[{"id":494383,"name":"Five Nights at Freddy's: Security Breach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f5b/f5b0a8232e747c03aa6b56ce2d2af49a.jpg","description":"THE NEXT CHAPTER IN FEAR\r\nFive Nights at Freddy’s: Security Breach is the latest installment of the family-friendly horror games loved by millions of players from all over the globe. Play as Gregory, a young boy trapped overnight in Freddy Fazbear’s Mega Pizzaplex. With the help of Freddy Fazbear himself, Gregory must survive the near-unstoppable hunt of reimagined Five Nights at Freddy’s characters - as well as new, horrific threats.\r\nTHE HUNTERS AND THE HUNTED - Once nighttime protocols are initiated, the animatronics at Freddy Fazbear’s Mega Pizzaplex will relentlessly pursue all intruders. Glamrock Chica, Roxanne Wolf, Montgomery Gator, and the Pizzaplex’s security guard, Vanessa, will turn over every Cotton Candy Pizza Stand if they have to - it’s not wise to stay in one place for too long.\r\nADAPT TO SURVIVE - Access the building’s security cameras to survey the environment and plan your route through danger. Distract enemies by knocking over paint cans and toys - just slip away before enemies are drawn to your location. Hop into hiding spots and allow danger to pass, or try to outrun your pursuers. Play your way, but be prepared to adapt.\r\nEXPLORE AND DISCOVER - Freddy Fazbear’s Mega Pizzaplex offers a variety of attractions for guests to enjoy - Monty Golf, Roxy Raceway, Bonnie Bowl, the sewers, and… Sewers? The Pizzaplex is vast and has no shortage of goodies to discover.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Steel Wool Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"}]},{"id":382755,"name":"Sands of Salzaar","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ee/9ee1d536aa4dc00a8591c725577c5ca3.jpg","description":"This is a fantastical tale of an exotic land. The Old Empire which once ruled the desert has fallen, leaving various tribes to fight for control of their world. Little do they know of the seeds of darkness which grow in the shadows with each passing day...\n\nPlayers may select from different characters to explore the open world desert.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"汉家松鼠","platforms":[{"id":0,"name":"PC"}]},{"id":323075,"name":"SpaceEngine","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac1/ac14fea80040dd991c88f230b6e74361.jpg","description":"SpaceEngine is a 1:1 scale science-based Universe simulator, featuring billions upon billions of galaxies, nebulae, stars, and planets, all shown at their full real-world scale. Explore Earth and our neighboring worlds in the Solar System, orbit a black hole in a galaxy billions of light-years away, or visit anything in between.\nAll of time and space are yours to explore – cruise between the stars at a million times the speed of light, and accelerate time to watch the orbital motions of a thousand worlds play out before your eyes. Every planet you encounter in your journey will feature procedural 3D terrain with detailed textures. Everything you see in the sky – stars and galaxies, planets and moons, asteroids and comets, black holes and neutron stars, star clusters and nebulae – are yours to explore at the press of a button.\nSpacecraft with Newtonian physics and pilot-assist autopilot features (in early development but fully usable) are yours to fly anywhere in the universe in the Flight Simulator mode. SpaceEngine is also very friendly for creators of mods and add-ons – create your own planets, star systems, even galaxies, import your own spacecraft models, create custom GUI skins, and more, all easily sharable with others.\nWith SpaceEngine, the possibilities are limitless.\nSpaceEngine Planetarium capabilities:\nAstronomy\nAll types of celestial objects are represented: galaxies, nebulae, stars and star clusters, planets and moons, comets and asteroids. Known celestial objects are represented using data from catalogs: galaxies (NGC/IC), stars (HIPPARCOS), star clusters, nebulae, and planets (Solar System and known extrasolar planets). Regions of space not yet cataloged feature procedurally generated objects: galaxies, stars, star clusters, nebulae, and planetary systems.\nControls\nYou are free to move around the universe – travel seamlessly between any object and any distance, from surface to orbit to interstellar and intergalactic space. Moving through space is as easy as \"click and go\", as well as game-style free flight using the WASD keys or a gamepad. Also, time travel is possible: you can accelerate, decelerate, or reverse the flow of time, and jump to a specified date. Detailed interactive tutorials will familiarize you with the controls.\nGraphics\nVolumetric 3D models of galaxies and nebulae with interstellar dust clouds, and 3D landscapes on planets and stars. For many Solar System bodies, actual data from space probes is used, with huge, high-resolution texture packs available as free DLC. For unmapped and procedural planets, the surface is generated procedurally using your computer's GPU. Other features include realistic atmospheric scattering, eclipse shadows, animated auroras and comet tails, and physically-based light warping near black holes and neutron stars, with animated accretion disks and jets.\nPhysics\nRealistic and physically-based generation of procedural objects (galaxies, star systems, planets) and their physical properties (mass, radius, temperature, atmospheric parameters, etc). The orbital motion of planets, moons, and stars in multiple-star systems are accurately calculated and displayed. Realistic space ship design concepts and physics: orbital motion, atmospheric flight model, and Alcubierre warp drive physics.\nVirtual reality\nSpaceEngine supports HTC Vive, Oculus Rift (via native library), and Windows Mixed Reality (via Steam VR). Support of VR controllers is partial: you can select objects with one controller and move around with the other one.\nSound\nOriginal background music tracks made by many authors, with context-sensitive playback. Sound effects for planetary environments and space ships are in development.\nTools\nBuilt-in tutorials will help you start using the Planetarium. Search for celestial objects by name and search for the nearest star systems. Browse the cosmos using a scalable Universe map and planetary system chart. Saving, exporting, and importing of locations is supported, which can easily be shared between users. The program keeps an automatic journal of objects you have recently visited. Learn every detail about the objects you find using the built-in “Wiki” info system, with additional hand-written descriptions of many known objects. Display the orbital paths of celestial objects, labels and markers, constellations, and other informational tools.\nMulti-language support\nCurrently SpaceEngine is available in English, German, French, Italian, Spanish, Brazilian and European Portuguese, Dutch, Finnish, Swedish, Croatian, Romanian, Czech, Polish, Slovak, Russian, and Turkish languages. Many new localizations are under development. Only localizations which are 100% complete are displayed on the Steam store page, but you can enable others in-game.\nModding\nSpaceEngine supports creating and importing user add-ons: catalogs, models and textures for deep space objects, planets, and space ships. Spacecraft models, representing both real and fictional designs – including from popular sci-fi franchises – are commonly imported and shared by the community, both here on Steam and on the official SpaceEngine forum.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Vladimir Romanyuk","platforms":[{"id":0,"name":"PC"}]},{"id":60894,"name":"Synth Riders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1af/1af606e2a8f72509574e68bc6d64a3ef.jpg","description":"Synth Riders is a challenging VR rhythm game with a cyberpunk twist. Fly through breathtaking retro-futuristic landscapes to Synthwave music perfectly attuned with every level. Players hit colored notes and note streams that fly by to the beat of pulsating retro synthesizer music. Blue notes can be hit with either hand, pink notes must be hit with one hand only, and orange notes must be hit with both hands at the same time. There are four levels of difficulty: easy, medium, hard and expert.\nFeatures\nUnique gameplay tailored for Synthwave musicGroovy Synthwave tunes from top Synthwave artists from around the worldHandcrafted levels Intuitive gameplayThree beautiful retrowave/cyberpunk stages","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Retrowave VR","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":45188,"name":"Rise of One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de5/de5f088dcbb14036f9fa1b5e5690cb7d.jpg","description":"Note: Rise of One is still in development. Day by day we are adding new features to the game. As the team of Rise of One, we are on the way to becoming a constantly renewed game with the feedback received from users to meet the Third Person MOBA demand.\nEvery day we add features in our game, that's why we need your ideas and feedbacks as very important. The development process of our game is progressing in accordance with the demands and recommendations of our players. In order to be a part of this community, we are waiting for you to our Discord server. We are reading all messages here with carefully.\nRise of One is a multiplayer game with the battle arena theme. With the graphics above the standard and the smooth play style, the players are able to compete with each other while they have a nice time.\nThere are currently 6 characters available. Magnificient battles are waiting for you in both main land and 5v5 arena. According to the course of the war, each character has the talent trees that you can personalize. You can play one character as the attecker, defender or support, it's up to you. Items are also available to support your decision.\nThe most glorious way to win the battle by capturing the main headquarter of your opponent in 5v5 battles, you have to destroy your enemy towers one by one. We have developed a combat system in which is you can distinguish yourself from your opponents in the battle. You have to use your skills with aim. That’s why you have to think smart before using any skill.\nWe have developed another system that makes our battle system unique. To explain this system; You can interrupt all your skills at any time. What is the benefit of this? This system allows you to change your strategy more quickly and efficiently according to the operation of the battle. In this way, you can react faster during the events and change the course of the war with your skilled hands.\nWe designed a special map called \"Main Land\" in our game. Main Land provides you with a battleground where you can develop your personal skills. Also, this place will host many events, community area and monument of tournament winners. Don't forget you can find the boss which is will give you coins in this glorious area.\nIn our game, there will be a unique universe and each character will have a story that will draw you into the game. In addition to this, various game modes and different maps will be included in this universe, which will make your game experience more enjoyable.\nMore than 50 items in the design process, where you can create strategies in battles. With these items, you can equip your characters in a unique way according to your own play strategy.\nIn general, a classification such as an attacker, defender and support classes in the MOBA games is not available in our game. You can use the character you want as an attacker, defender or support. This is totally up to you!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Rise of One","platforms":[{"id":0,"name":"PC"}]},{"id":23007,"name":"Sea Dogs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0eb/0ebbbda607221e77fe49f41f98efceae.jpg","description":"Sea Dogs is an epic role-playing game for the pirate in all of us. Return to the age of sail as a young captain looking to make a name in the world. Develop your character from humble beginnings and rise to control all of the islands for your country or yourself. You can give your allegiance to one of three countries or choose to serve only yourself as a swashbuckling pirate. Build your wealth and reputation and use it to acquire bigger ships and better crewman. Hire other captains to join you in attacking and capturing other ships or forts. Where you go and what you do is up to you. The choices in Sea Dogs are endless, and so is the fun.\nPlay as one of four sides (British, French, Spanish, or Pirate) or change allegiances during the game.\nNonlinear campaign allows players to choose quests or play the game any way they want.\n20 different ship types to choose from, from small boats to large battleships.\nLocation-specific ship damage allows you to send their sails up in flames, bring the mast crashing to the deck, or shoot holes in the hull.\nRealistic and dynamic wind and weather effects as well as day and night cycle.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Akella","platforms":[{"id":0,"name":"PC"}]},{"id":22708,"name":"Wing Commander 3 Heart of the Tiger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a35/a350a78a36c0991c2389cc66c1603806.jpg","description":"Professionally scripted and filmed in Hollywood, ORIGIN's multi-million dollar production combines the entertainment of film-making with the interactivity of computer gaming. The result is far more than an action packed and spectacular spaceflight experience. Become immersed in a futuristic adventure that combines Hollywood's movie making expertise with the adrenaline-pumping game play of a space combat simulation. You are the star, your actions will determine the eventual outcome of the Terran Confederation.\nAdrenaline, romance, humor, danger - Wing Commander III has all this and more. This sequel completes the turbulent chronicles of the Terran-Kilrathi war. The final showdown is near and only you can write the ending. Cinematic atmosphere - over 3 hours of live-action video, brilliant orchestral score, plus dozens of hours of absorbing gameplay\nNon-linear story with over fifty intense and challenging scenarios\nPilot five distinct fighters, armed with fully configurable weaponry that lets you adapt to best fulfill the mission objectives","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Origin Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"3DO"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"}]},{"id":19878,"name":"The Grandfather","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aca/acac15ac352809efcc5a2c08eb1cc80d.jpg","description":"\"The Grandfather\" is a story driven point & click Puzzle/Horror game about torment and sorrow. The Grandfather tells the sad tale of an old man who is tormented by the coldness of his wife (based on a true story).\nFeatures:\n- All hand drawn comic book art\n- Unique challenging puzzle types\n- A procedural soundtrack\n- Full narration by a voice actress\n\"The Grandfather\" is a collaboration by Michael Patrick Rogers (creators of \"The Lady\") and David Szymanski (creator of \"The Moon Sliver\" and \"Fingerbones\".","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"David Szymanski","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19663,"name":"Clutch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f9/1f9413151b81d51324280161631537e7.jpg","description":"Clutch is a fast-paced arcade racing game which will challenge the resilience of anyone's nerves. You play as a person who has survived a catastrophe of the Large Hadron Collider (LHC), while everyone else in the city has been transformed into a bloodthirsty zombie. You return to the abandoned city, looking for a way to change the zombies back into humans. The only way to survive is to move on fast armored vehicles. The player will complete different missions: racing, rescue and more to finally learn the truth.\nKey features:\nA multitude of drivable vehicles and upgrades\nMany ways to destroy zombies\nThe LHC campus is a complete city open for exploration, sandbox style\n8 game modes of racing and combat\nAdvanced collision and damage physics\nDiversity of artifacts that affect the player and rivals\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"}]},{"id":17280,"name":"Elementary My Dear Majesty!","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9bd/9bdd608b28386695b76a100fbdb2da91.jpg","description":"Step into a stunning make-believe world in the first 3D hidden object adventure!  The king's daughter has turned into a man-eating monster, and either you find the cure, or it's off with your head!  Put your keen powers of observation to work as you search 14 eye-popping locations for clues, perform tasks for a variety of comical characters, and solve over 100 cunning puzzles.  If you enjoy original and exciting games, Elementary My Dear Majesty is for you!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alawar Dreamdale","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17147,"name":"Into the Dark: Ultimate Trash Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f2/7f2bbac2ce7341b80e1e20f2a927d208.jpg","description":"Expect the ultimate B-Movie Trash experience!\nDon´t even dare to hope for state-of the art graphics, a proper balancing, professional voice acting or breathtaking script-writing. This here is 100% pure trash, an adventure / shooter hybrid with gazillions of bad jokes, dozens of pop culture references and a hidden, dense net of subversive, intelligent messages related to post-WWII-politics. Oh yes, you need a basic knowledge of pop culture to enjoy the game, and quite some education on politics to really love it, but who cares?\nFar more important is:\nWe got boobies.\nWe got hookers.\nWe got Zombies.\nWe got Nazis.\nWe got even Nazi-Zombies!\nYou`re Peter \"Pete\" O`Brannon, a Private Eye. Sounds fascinating? It isn`t, trust me - unless you find it exciting to hunt down cheating husbands and lost dogs while living of cheap Chinese food in shabby motels. THAT would be what Petes job is all about - but luckily for him, he has a good customer paying his bills. It`s GlobalSecure Inc., one of the biggest insurance companies on the East Coast. More exactly, it`s Samantha \"Sam\" Miller who runs their investigation department on insurance fraud. She`s tough, she`s intelligent, she`s better than Pete. By far better. But due to the companies Code of Conduct and some very nasty ethic rules, she`s prevented from taking, erm, \"semi-legal\" steps to gain essential information and proofs. That`s where Pete steps in - for 500 bucks per day + expenses + a nice 20% share of the money the company saves with whatever Pete finds out.\nInto the Dark is a playable B-Movie, a trash experience composed out of 60% humor, 30% horror and 10% technical flaws. Enjoy!\n11 Levels of pure madness\n15 different guns & weaponized items\nSoundtrack featuring Nox Arcana\n67 puzzles\n238 lovely clipping errors ²\n35 sophisticated AI bugs ²\nGuaranteed minimum of 10 crashes when playing through the game! ²\n168 additional glitches ²\nPlay it as adventure, as shooter or as both!\nExplore the levels with your Oculus Rift Kit in VR!\nOptional Controller support (XboX and 360 Controllers work fine)\nWatch the full movie \"Night of the living dead\" ingame!Free Halloween Minigame - a new one each year!!\n² just kidding. and trolling. and partially true.\nAttention:\nWindows 8 users: As Windows 8 treats DarkBasic applications quite strange upon demanding large chunks of memory, we officially don´t support it. We have ran through the game on several Windows 8 systems, we have reports of many players beating the game on Windows 8, but we CANNOT guarantee it works on your side.  Buy on own risk and RUN THE INTOTHEDARK EXE AS ADMINISTRATOR WITH COMPATIBILITY MODE WINDOWS 7\nMemory Issues:[/b] Into the Dark calls large chunks of your primary 1.85Gig memory block. You may have to turn off FRAPS and Skype to have a proper trash experience, and sometimes you will have to reload an autosave to clear the memory. Refer to the troubleshooting guide for more information!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Homegrown Games","platforms":[{"id":0,"name":"PC"}]},{"id":16297,"name":"BitRay","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12d/12d209539d14ba7e03b6da42005c0d36.jpg","description":"Steam GreenlightMy other games in GreenLight\nPlease,support my games)\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=876819310\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=861517979\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=861538896\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=861488112\nAbout the GameBitRay is a simple puzzle game in which your task is to destroy all the red cubes, and do so all the white appeared on the platform.\nFeatures:\n- Minimalistic graphics, TimeKiller.\n- More than 50 different levels.\n- Many cubes and spheres with their own unique abilities\n- 2 Soundtracks","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lagun Victor","platforms":[{"id":0,"name":"PC"}]},{"id":16274,"name":"Citalis","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3c/d3c1cbac59ff940fda8694609476d726.jpg","description":"Citalis is a fast paced, arcade like city simulation game where you must manage your city and businesses to make a profit and avoid bankruptcy at all costs.\nUsing Commercial, Residential and Park districts you must balance all the core aspects of a happy and successful city - such as building businesses, housing, maintaining roads, monitoring water levels and ensuring the city remains beautiful at all times.\nBut beware, if your city becomes unhappy your businesses will start partaking in criminal activity leading them to be shut down. Failure to monitor water levels may lead to a drought to stop the city functioning properly or a flood to destroy housing, landscaping and roads.\nNow with 3 new target modes to challenge different aspects of your city building!FeaturesUnlimited city building\n4 separate target modes with your highscores\n40 different blocks with over 700 combinations of building\nMoveable UI elements to fit your screen resolution in any way you want\nNo limit on number of districts - create cities spanning thousands of blocks!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Matt Hooper","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15563,"name":"KNIGHTS","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7b/f7b70a190779218e34a732e4332dac2c.jpg","description":"Steam GreenlightThank you so much to everyone that supported KNIGHTS!\nAbout the GameOverview\nKNIGHTS is a minimalist puzzle game based on a single chess piece, the titular knight. A simple enough to pick up and relaxing experience.\nThe goal for each level is to set each of the colored knights into a space of their corresponding color.\nForethought and future planning are key abilities to master for later puzzles. New ways to tackle a problem will gradually evident as the game progresses, allowing several solutions for the same puzzle.Key FeaturesNearly a hundred hand crafted levels.\nMinimalist art style for user-friendly experience.\nAn infinite amount of procedurally-generated levels, released every day.\nSelectable color-blind friendly palette.\nRelaxing soundtrack and sound effects to delve into the experience.\nSimple gameplay for anyone to pick up and play. Special ThanksTo everyone that gave their support and feedback in the making of this project.  And a special thanks to YOU, for taking your time to view KNIGHTS.\nFeel free to visit the official website.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Arzola's","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11105,"name":"Stash","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc2/fc2db756e0a0a389f320388e50a976cd.jpg","description":"Stash is bringing the magic back to MMOs. With turn based combat, customizable housing as a core feature, a unique tabletop art style, and more loot than you can fit in a portable hole, Stash delivers a fun, engaging experience unlike any other MMO. Stash is set in the fantasy world of Primordiax - a game world featured in 6 previous games by Frogdice released over the last 20 years. The intriguing world story has evolved through decades of staff plot lines and the actions of hundreds of thousands of players.\nStash's core features include:\nTurn based combat on a tactical grid.\nGreat Community: The most incredible thing about Frogdice and all of our games is the community. Our players are a major reason our games are so special and their passion and love for our game world is part of a sacred trust we cherish.\nHousing as a core feature. Your Base of Operations (BOO) starts as a humble bedroll and can be built and customized into a mighty fortress where you stash your loot.\nDungeons: Hand crafted as well as randomly generated dungeons.\nCharacter customization via class, race, build, gear, cosmetics, costumes, pets, mounts, and more.\nCrafting: Use, sell, trade, or enter items into competitions.\nExploration: A huge world for you to discover with hundreds of unique locations.\nAwesome world story with a unique twist. Players affect this story and the entire world profoundly. Our staff runs world events and plot lines.\nClans: Join with friends and compete for dominance.\nLoot: Tons and tons of loot, and with rare exceptions we don’t do bind on pickup/equip.\nPvP: Optional group and solo PvP.\nThere are two packages available which include the game, your $ value worth of Medallions (virtual currency), and some bonus items:\nCitizen Package\n$15 worth of medallions\nMount: donkey\n+25% XP Booster (2 hour duration) x2\nHealing Potion x5\nMana Potion x5\nFounder's Package\n$50 worth of medallions\nMount: donkey\n+25% XP Booster (2 hour duration) x4\nHealing Potion x10\nMana Potion x10\nFounder's Cloak (bonus stats, XP boost through level 20) (not claimable yet, but will be in the near future)\nFounder's Plaque BOO (Base of operations - your house) item (not claimable yet, but will be in the near future)\nSpecial Interior BOO item (not claimable yet, but will be in the near future)\nClick here for step by step instructions on how to get your medallions and in-game bonus items.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frogdice","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10608,"name":"Orake 2D MMORPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a8/4a8e4f18baa77a7ddafcf06114b96608.jpg","description":"Orake is an open world game where you'll strive to be the best! Embark on quests, explore secret rooms, unleash your rage attack's against your opponents, and much more.\n\r\n- Enter the \"Boneyard\" and prepare for a grueling fight! (The Boneyard is a deadly pvp zone).\n\r\n- Play mini-games like capture the flag!\n\r\n- Train to become the very best! (12 skills as of now).\n\r\n- Embark on dangerous adventure and defeat bosses of amazing size.\n\r\n- Solve puzzles.\n\r\n- Explore the world of Orake with friends.\n\n\n\r\nLooking to play a game with some friends?\n\r\nIn Orake you can party up with your friends or make a clan. You can play capture the flag, engage in clan fights, boss fights, explore caves, and much more!\n\n\n\r\nWhat is a Rage Bar?\n\r\nA Rage bar is used to do special weapon attacks. Every weapon has it's own rage attack, so find the best one to kill your opponents!\n\n\n\r\nOrake is still in early development so if you do find any bugs contact us through our website,or Steam.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Candycane Games","platforms":[{"id":0,"name":"PC"}]},{"id":5641,"name":"Resistance: Fall of Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ec/6ec7f7d32d1bd0ad3484af83b1e5b6b1.jpg","description":"In Resistance: Fall of Man, the U.S. and Britain band together in a last-ditch effort to save Europe and Asia from a horrific scourge. In mere decades, the Chimera - a species of unknown origin propagating a virus that converts other life forms into more Chimera - has overrun Russia and all of Europe. Humanity’s hope for survival is slim, and the tide of the battle rests on the shoulders of U.S. Army Ranger, Sgt. Nathan Hale. Resistance: Fall of Man draws players into a deep, frightening story that rewrites the 20th century and pits the United States and Britain against a horrific species of unknown origin. \n\nIn addition to an epic single player campaign, the game features co-op, split screen multiplayer and highly customizable online gameplay. Greater processing power on PlayStation 3 and Blu-ray technology enables more immersive visual and sound effects in Resistance: Fall of Man, heightening the chaos of large-scale warfare. Insomniac Games has combined its passion for creating exotic weapons and vehicles with a proprietary physics system to create a unique human and alien arsenal.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4479,"name":"Madden NFL 12","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/760/760d66ef2d12f47253deb70b9ed40bfb.jpg","description":"Madden NFL 12 continues the rich tradition of the storied franchise by bringing fans closer to the NFL than ever before. Featuring all 32 teams, stadiums, and your favorite players, Madden NFL 12 is True to the Game. Whether battling your rivals on the couch or online, leading your favorite team to the Super Bowl in Franchise mode, or building the ultimate dream team in Madden Ultimate Team, Madden NFL 12 is True to the NFL, True to the Franchise, True to the Game.\n© 2011 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc. The mark \"John Madden\" and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear, Inc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. © 2011 NFL Properties LLC. Team names/logos are trademarks of the teams indicated. All other NFL-related trademarks are trademarks of the National Football League. Officially Licensed Product of National Football League Players Incorporated | NFLPLAYERS.COM. All trademarks are the property of their respective owners.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"}]},{"id":816363,"name":"Monument Valley: Panoramic Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16e/16ee56f19c22284d38e6b028496b7f24.jpg","description":"Discover Monument Valley - A quest for forgiveness in a strikingly beautiful and mysterious world.\nEmbark on a journey of forgiveness along with Ida, the silent princess, through impossible environments and illusionary puzzles. Experience this meditative and calming puzzle game by manipulating monuments and creating evolving paths to explore new, surreal, and mysterious worlds.\nStep into the new expanded world of Monument Valley: Panoramic Edition - and experience more intriguing impossibilities than ever before.\nThe Modern Classic Comes to PC. In this multi-award-winning title, solve tricky but immensely satisfying puzzles with optical illusions at their core.\nEvolve landscapes to reveal paths that would have otherwise been impossible without your help.\nAs you progress, discover beautiful architecture, transforming landscapes through pushing, pulling, clicking, raising, lowering and more.\nIda is not alone in this world, and you will need to use your wits to outsmart the enigmatic Crow People who block the path from Ida quest for forgiveness.\nSimply ExplorativeClick to manipulate a beautiful variety of worlds, all built for a one-of-a-kind PC experience. Designed for players of all ages and experience levels, Monument Valley allows players to explore evolving environments, transforming scenic and visually stunning landscapes as you play. Everyone should be able to pick up, enjoy and complete Ida’s journey. This is the biggest and best way to play Monument Valley yet. Beautifully ReimaginedWhether playing in Full HD, TV or on ultrawide 21:9 displays, Monument Valley looks better than ever with stunning full-screen panoramic artwork. With more perceptible visuals than ever before, what secrets will you uncover?Every World IncludedMonument Valley: Panoramic Edition is the total collection of all Monument Valley content - with every chapter, add-on and DLC to make this the ultimate game to add to your collection. Inspired by minimalist 3D design, optical illusions, and ancient architecture from around the world, every monument is a unique, hand-crafted world to explore.  Panoramic Collection Out NowMonument Valley: Panoramic Edition and Monument Valley 2: Panoramic Edition are both available at an exclusive bundle price when purchased together on Steam. The Panoramic Collection is the best way to play the Monument Valley series - with every chapter and DLC included.\nustwo games are proud independent developers, best known for the award-winning Monument Valley series, Land’s End, Assemble with Care and Alba: A Wildlife Adventure.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"ustwo games","platforms":[{"id":0,"name":"PC"}]},{"id":627556,"name":"Bro Falls: Ultimate Showdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/399/399f2ec26b53eef2c849ffe28a818d97.jpg","description":"WIN EVERY ROUND TO BE THE LAST FOOD AND GET THE LEGENDARY CROWN!Traps, Falls, Chaos...Brokkoli is angry because nobody chooses him to put in the cart. His evil master plan is that he catches all of the food and drops them into a showdown trial. Foods have to go through traps and obstacles to get out of the trial and beat Brokkoli.\nBROKKOLI IS ABLE TO ACTIVATE ALL SORTS OF TRAPS IN THE MATCH TO PREVENT FOODS TO COME IN HIS SIDE.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Boros Bros","platforms":[{"id":0,"name":"PC"}]},{"id":477316,"name":"Ben 10: Power Trip","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/438/4386fdc13fa355b57303c9a89507964f.jpg","description":"Ben Tennyson and his family are all set for a relaxing European vacation – until evil Hex awakens four mysterious crystals and summons monstrous visitors from the Void. Now it’s up to you to help Ben stop the master magician’s Hex-tremely fiendish plans!\nSo put on the Omnitrix and transform into Ben 10’s incredible aliens, as you adventure and battle through an action-packed 3D world. Take on some of the deadliest enemies Ben has ever faced in thrilling combat. Solve fun puzzles, use your skills to help out the townspeople you meet, and collect power-ups to upgrade your aliens. And explore the cities, forests and mountains of Europe on your way to the final showdown against villainous Hex.\nWith Gwen and Grandpa Max on your side, all the humor and rivalry from the Cartoon Network show is here. And since four arms are better than two, Kevin Levin is along for the adventure in local split-screen co-op. This is one Power Trip you’ll want to take again and again.\nIt’s hero time!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"PHL Collective","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":428391,"name":"Dreamscaper: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe6/fe6f705b7e47f46146db2e9dcea6aaa5.jpg","description":"Wishlist The Full Game Now <3https://store.steampowered.com/app/1040420/Dreamscaper/\nAbout the GameDREAM. DIE. WAKE. REPEAT.\nDreamscaper: Prologue is the first chapter in the Dreamscaper saga, consisting of the level Home Town and 4-6h of unlockable content. Dreamscaper is an ARPG Roguelite blending elements from brawlers, top-down shooters, and dungeon crawlers. Every slumber is a different dungeon in an an ever-changing world with a multitude of unique events and challenges.FeaturesMASTER DEEP COMBAT SYSTEMS: Skilled play gets rewarded. Use careful positioning, exact timing and quick reflexes to defeat foes with an abundance of combat options.\nHARNESS YOUR LUCID POWERS: Warp the Dreamscape around you with  surreal dream attacks and abilities that manipulate the elements, warp space, and even control time itself.\nUNCOVER THE MYSTERY: Unravel Cassidy’s story as you plunge through her subconscious and build relationships in the real world.\nOVERCOME THE NIGHTMARE​\nAdventure through beautiful, haunting dreams to discover untold secrets, vanquish nightmares, and upgrade your gear all while uncovering Cassidy’s story as you plunge through her subconscious. Each dream is another peek into Cassidy’s memories and experiences.\nLive Cassidy's waking life and forge friendships with the people around her. Empower Cassidy with their hopes and memories to dispel the darkness of her nightmares.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Afterburner Studios","platforms":[{"id":0,"name":"PC"}]},{"id":415180,"name":"Samurai Jack: Battle Through Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f6/6f67a76e4717c1494c697c6fcb0be3f2.jpg","description":"Become the Samurai and Defeat Aku forever\nBecome Samurai Jack, the greatest warrior of the past, present and future. Journey through time to finally stop Aku’s evil reign in this new adventure told by the creators of Samurai Jack. Encounter your favorite characters from the show including The Scotsman, Scaramouche, Sir Rothchild and more!\n\nAn untold Samurai Jack adventure that ties into the epic series finale. Team up with trusted allies from the show to face off against familiar enemies. Visit classic worlds and moments from your favorite episodes. Travel to a dark future to free mankind. Dive into the past to face off against terrifying monsters. Seek your fate as you travel across space and time. Equip and master over a dozen different weapons in combat. Increase your power even more by training and unlocking new skills to support your playstyle.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Soleil","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":270660,"name":"Later Alligator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbb/cbbf47de4d06484370a5fb39a5c914f0.jpg","description":"Later Alligator tells the story of Pat the alligator, a (mostly) harmless and (probably) innocent reptile at the center of a conspiracy that could bring down the biggest, scariest family in Alligator New York City: his own! Explore the city, meet the Family, and try to save Pat before the clock runs out.\nAlligator New York City comes to life with the classic hand drawn animation style of SmallBu Animation, featuring densely animated areas to explore, 30 goofy minigames, and over 100 alligator residents to investigate. With multiple endings and a fully-animated cartoon finale, Later Alligator is a funny urban adventure you can play again and again.\nClassic 2D animation from an award winning studio\nOver 100 alligators and at least 3 ghosts\nFunny and family friendly, perfect for all ages\n30 joke-filled minigames and challenges\nMultiple endings and a secret surprise","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pillow Fight","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":262390,"name":"The Eternal Castle [REMASTERED]","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86e/86edb7051cfd16a2f4bc2220854af289.jpg","description":"The Eternal Castle [REMASTERED] is an ambitious attempt to modernize an old classic in order to keep its memory alive. Through detailed research and hard work, the production team tried to expand the experience while keeping the same 'feel' and emotional flow of the original masterpiece from 1987.\n[message:start\\]YEAR 2XXX - BEFORE THE FALL OF THE CYBER-NET SOCIETY EXTRA TERRESTRIAL HUMAN COLONIZATION UNITS WERE ABLE TO CONSTRUCT PARALLEL SURVIVAL FACILITIES AROUND THEIR ROOT PLANET IN ORDER TO REESTABLISH A SELF SUFFICIENT ECOSYSTEM IN SPACE THE PROCEDURE WAS DISCONTINUED BY NUMEROUS TERRORIST ATTACKS TO THE MAIN CORE SERVERS AFTER COUNTLESS GLOBAL WARS ALL SYSTEMS GOT SHUT DOWN AND THE PROCEDURE WAS NEVER AGAIN RESUMED POLLUTED WATERS CLIMATE CHANGE RADIOACTIVE WARFARE AND ABSENCE OF RESOURCES CAUSED THE MAJORITY OF THE REMAINING HUMANS TO DECEASE THE LAST COLONIZATION UNITS IN SPACE WERE ABLE TO SURVIVE FOR SEVERAL YEARS BEFORE EXTINGUISHING MOST OF THE REMAINING RESOURCES NEEDED FOR SURVIVAL SCAVENGER UNITS WERE SENT BACK TO EARTH TO GATHER MATERIALS IN ORDER TO RESTORE THE SELF-SUFFICIENT ECOSYSTEM FACILITIES AND CONTINUE THE EXTRATERRESTRIAL COLONIZATION PROCEDURE ONE OF THE UNITS WAS SENT BACK TO EARTH BUT THE UNIT NEVER RETURNED IT'S BEEN TOO LONG SINCE THE LAST TIME I WAS IN TOUCH WITH HER I KNOW SHE IS IN DANGER AND I KNOW SHE NEEDS MY HELP GOING BACK THERE BY MY OWN IS A SUICIDE MISSION BUT I HAVE NO CHOICE LEFT EITHER I GO, OR SHE DIES[\\message:end]\nEnjoy the atmosphere or speedrun through a post-AI fallout packed with challenges  Meditate, Predict, and Wake up, in the eternal dream with Adam or Eve  Fight your way through the Ancient Ruins  Shoot your way through the Forgotten City  Sneak by monsters in the Unholy Lab  Enter the Eternal Castle Collect all 4 GLIDERS to power up your ship:      Use up to 10 different weapons:            Unlock up to 10 different items:                               Find all missing FRAGMENTS to get back home:                                 Repeat the dream for as many times as you can before reaching the end.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Playsaurus","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60732,"name":"FALLBACK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/794/794f507b430b4cb1e7f0312935574fb9.jpg","description":"FALLBACK is a tale about humanity restored after a cataclysmic ecological disaster. Having mastered technology allowing them to thrive again, the people now living underground face new challenges from the outside with vicious creatures threatening their lifestyle. But also, and more importantly, from the inside. To what extent can technology really save their humanity? What are the choices and sacrifices one is willing to make to keep his or her lifestyle?\nThose questions form the background of an adventure where you will explore a procedurally generated dungeon trying to survive long enough to bring back the energy required to further your explorations. What initially appears to be a simple quest for energy becomes less clear as the identity of the “volunteers” exploring the world is questioned, forcing you - the player – to make choices that you might not have thought of before.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"ENDROAD","platforms":[{"id":0,"name":"PC"}]},{"id":51213,"name":"Bad Dream: Fever","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98e/98e11f696b44d06dda1352f5e57178ad.jpg","description":"The world has lost its natural colors, an unknown plague has gathered its cruel harvest. The city seems to be completely empty and dead, but in its every corner there are manifestations of fear, sorrow, frustration, misunderstanding, loneliness and suffering. The situation looks hopelessly, but not everything is lost yet...\nEnter the feverish dream and experience its abstract world. Recognize the degradation of your environment and adapt to it. Act with caution. There is a malicious virus waiting for you at each step, which purpose is to remove you from this infected and imperfect sleep.\nKeep an open mind and be prepared for anything. Expect an enemy in the person who you would least expect it. If you feel betrayed, remember that a fever can change a strong, healthy person into a complete wreck. An infected mind loses common sense and the ability to assess the situation.\nAttempt to save at least one person. Remember, sometimes 100% effort is still not enough. Don't let the fever infect your mind. Don't make the same mistake as others...\nGame features:\n- The climate of a world resembling sleep during a fever.\n- Creative riddles requiring an unconventional approach.\n- A sincere and complex story told from the depth of the author's heart.\n- Refined locations, full of intense, suggestive climate.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Desert Fox","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":30112,"name":"SiN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/559/559f0bc2b44bc3223f14e4393a2f70d8.jpg","description":"Sin is the fully-integrated first-person 3D experience that will push you over the edge. Sin features a character-driven story and revolutionary multiplayer gameplay powered by an enhanced version of id software's Quake II engine. You will blast your way through complex levels of unholy terror as you investigate the secret source of the crime epidemic plaguing the city. Sin features six distinct game world regions enriched with convincing graphic detail and a rich interwoven storyline.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Ritual Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21430,"name":"Motorama","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb8/fb85caef9e2742f8aad67c2d4023f8aa.jpg","description":"Go back in time and experience “The Fabulous Fifties” in a game that relives the period, vehicles and street races of the legendary 50´s films. Customize your car and compete in 8 different race modes, through five completely different 50´s themed areas and become the King of the Road!\nFor many years, street racings have been popular around Sierra Lake, one of California’s most famous cities. Flashy cars driven by skilled racers, with lots of money at stake and of course beautiful girls create - an explosive cocktail where only the bravest compete.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"251 Games","platforms":[{"id":0,"name":"PC"}]},{"id":17047,"name":"Supreme League of Patriots - Episode 2: Patriot Frames","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/156/156cf75d7d518d6076aaadeb74827e98.jpg","description":"Don your cape and mask and join the Supreme League of Patriots in this hilarious and irreverent superhero comedy adventure!\nIn Issue 2, Kyle's transformation into the Purple Patriot is progressing unabated, and he's discovering a lot of new prejudices he never had before. While Mel fears for the sanity of his friend, The Purple Patriot sets about creating his own superhero team. He soon discovers that a wall of bureaucracy stands between him and his dreams of becoming an official Manhattan superhero. Surrounded by temptations, he's forced to decide whether a campaign of justice can really be founded on some pretty nefarious practices.\nFeatures:\nClassic point and click gameplay with a hilarious modern sense of humor\nTwo playable characters of Kyle Keever aka The Purple Patriot and his sarcastic sidekick Mel\nBattle the dastardly red tape of the New York bureaucracy!\nDiscover, befriend and declare your enemies from the city’s zany and colorful cast of superheroes and archenemies\nFantastic original soundtrack composed by Jake \"Virt\" Kaufman","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"No Bull Intentions","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16757,"name":"1000 Amps","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3b/c3b2f0633c34b464ec7903fea3d8a367.jpg","description":"Light up the world! As Plug, you are charged with restoring the expansive Amp-Tree-System, and thwarting an enigmatic intruder. Solve puzzles and explore in 1000 Amps!\n\nKey Features:\t\t\t\t\t\tIlluminate the darkness by lighting up whatever you touch.\nTeleport into any un-occupied space with a simple mouse click.\nExplore the expansive and labyrinthine Amp-Tree-System, finding new power ups strewn throughout.\nTackle challenges in whatever order you like, thanks to the open world design.\nOver 150 rooms to complete and explore.\nSave anywhere, at anytime.\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Brandon Brizzi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14654,"name":"PixBit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a8/4a85adda414f6a2eebf411ccb1a7fb1c.jpg","description":"Steam GreenlightThank you!\nAbout the GamePixBit  is a small game in which your objective is to survive running into an enemy, collect as many crystals as possible and to keep the enemies from reaching one of the points. When a crystal is picked up a new crystal randomly appears somewhere on the map and one of the weapons appears in your hands.\nIn the game there are15 kinds of weapons\n15 different maps\n7 enemies\n10 characters\nYou can unlock them all by achieving certain goals in the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hipix Studio","platforms":[{"id":0,"name":"PC"}]},{"id":14475,"name":"Tattletail","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0c/f0c33236d1af182a93d378c5f5849185.jpg","description":"New DLC Campaign Included!Purchase Tattletail and get The Kaleidoscope Expansion DLC for free! The Kaleidoscope is a whole new campaign that unlocks after you complete the original game. It tells a very different story about the events of Christmas 1998, starring a strange green-eyed Tattletail. New nights, new scares, and mysterious consequences.\nAbout the GameWho remembers Talking Tattletail? It was SO creepy, right??There’s not much reference online but the original version, Mama Tattletail, was recalled years earlier… and I’m pretty sure I know why.90's Virtual Pet HorrorTattletail is a short, story-driven first person horror game about everyone's favorite talking toy from the 90's. You opened your Tattletail before Christmas, and now he won't stay in his box. Can you keep him out of trouble until Christmas day? Or will Mama Tattletail find her baby and hunt you down first?\nObey Tattletail's mischevious demands.\nFeed, Brush, and Recharge Tattletail... or he'll never shut up.\nShake your flashlight to charge it... but be careful. Someone might hear.\nDo not wake up Mama Tattletail\nDO NOT MAKE LOUD NOISES NEAR MAMA TATTLETAIL\nThis is our first game as Waygetter Electronics. We'd love to hear your feedback!!\nPlease report all sightings of Mama Tattletail to Waygetter Electronics","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Waygetter Electronics","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11169,"name":"StarCrawlers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c0/0c0c91a74a38124990116b319d4295a3.jpg","description":"Crawlers Wanted: high pay, certain risk. Plausible deniability a must.\nBuild a crew of renegade adventurers on the fringes of space, taking jobs from megacorps to hunt bounties, sabotage rivals and conduct corporate espionage. If you can navigate the intricate politics of wealth and power, you might just survive long enough to spend your hard-won credits.\nYou’re a Crawler, and that means you work for those that can pay. Asset recovery, commercial espionage, and mayhem for hire are just a few of your crew’s specialized services. If something shady needs doing, chances are a Crawler will be involved. Succeed and you’ll be rewarded with better pay then any corp drone can dream of. Plus, you'll earn the respect of the eclectic assortment of merchants, opportunists and adventurers who make their home in the fringes of space.\n\nKey Features:\nWage strategic battles against futuristic enemies with an innovative time unit turn-based combat system.\nProcedurally-generated dungeons and events create endless replayability.\nChoose your allies and your foes wisely. Your choices will change how the story unfolds.\nEight player classes each with unique abilities, both in combat and when exploring.\nRandomly generated weapons, armor and gear with upgradeable enhancements.\nEasy to Hardcore difficulty modes and optional permadeath.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Juggernaut Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10003,"name":"Naval Action","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf9/cf9e5d9726c69c60f594f9e46eae4fb5.jpg","description":"Naval action - open world multiplayer sandbox\nNaval Action is a hardcore, realistic, and beautifully detailed naval combat game immersing players into the experience of the most beautiful period of naval history - when sailing ships ruled the seas.Features:\nExciting bugs – Because its still alpha we have an interesting selection of annoying, strange, and sometimes wonderful bugs. We are squashing them one by one, but it's Caribbean - they will keep coming for quite some time.\nEnormous open world – Large open world, recreated based on 18th Century maps, historical harbors, positions, and town names. We do not believe in the various modern hand-holding markers, thus player position is not shown on the map: you will have to navigate yourself using compass, sun or landmarks. PS. battles are instanced to allow extremely complex sailing and fighting calculations for 50 ship battles.\nFreedom – Build ships, trade, sink enemies of your nation. You can attack anyone almost everywhere. Remember that every action could have consequences. So don't attack everyone - or you will become a pirate. Conquer almost every port in the Caribbean, but remember! other adventurous captains will try to ruin your plans.\nBeautiful ships  – Accurate hull models, sail plans, guns, internal upgrades, historical speed, turning and heel performance. Ships from small cutters to large 100+ gun 1st rates will allow the player to experience every possible role of the Age of Sail period.\nRealistic sailing – Advanced wind and physics model provides for realistic portrayal of ship’s performance in the age of sail. Yard angles, ship angle to wind, fittings and ship condition affects speeds and turning rates. Correct tacking, boxhauling, clubhauling and other elements of the age of sail sailing are possible. Hidden ship characteristics will allow to gradually uncover potential of the vessel – every ship in game will be unique.\nHistorical gunnery - Realistic ballistics and cannon performance of the period. Every cannonball is tracked in the air and after it hits the target. One shot can hit the stern, damage the rudder, then hit the cannon carriage, injure crew, ricochet from the floor and hit the opposite side. Listing and wind affects the shooting distance and will require change of tactics.\nWeapons - All major types of naval artillery are implemented: from long guns to carronades. Fort and land batteries will provide support during port battles. Mortars are coming soon.\nDamage model - Leaks, structural damage, torn sails, demasting, raking, fires and all other hazards that were possible in that era. Damage is positional: hit the gun and you might destroy it. Gunnery crews are placed deck by deck. Shot can pass through the balcony, ricochet of the gun, hit a crew member and then fly out of the gunport splashing into the water. Armor thickness and wood type is implemented and at extreme angles cannonballs will ricochet from the hulls.\nCommunity driven development - Players actively participate in development and many elements of the game have already been implemented based on the player feedback. Content is immediately given out to players for testing and improvement. Share your thoughts in comments or on the forums.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Game-Labs","platforms":[{"id":0,"name":"PC"}]},{"id":9777,"name":"Onward","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fc/0fc8d6b8ef73ee764325fceada146bd2.jpg","description":"Onward is a Mil-Sim paced tactical multiplayer shooter, being developed for virtual reality head mounted displays. Players will use coordination, communication, and marksmanship skill to complete objectives in online infantry combat. With dynamic time of day, weather effects, and multiple environments and scenarios, no skirmish will feel the same. With limited respawns, no HUDs, and no crosshairs, players will need their wits and combat skills to survive.\nBecome fully Immersed in the firefight.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Downpour Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":5605,"name":"Naughty Bear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/826/826703957c9ed9f6763567ffe1a694f5.jpg","description":"When the other bears threw a party Naughty Bear wasn't invited. Scorned for the last time, Naughty Bear is exacting his revenge... now they will pay... with their lives... Stab, shoot and bludgeon every adorable creature that crosses your path.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":5373,"name":"FLOCK! (2009)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b35/b359d2ad6996be73c194fac09e1e90ea.jpg","description":"Join the Herd!\nProtect your cornfields and lock up your livestock, because FLOCK is here! Pilot a UFO around vibrantly-colored landscapes in this charming sandbox puzzle game where you must herd animal life back to the Motherflocker. Using a powerful physics engine that drives many of the game’s elements, FLOCK features over 50 pastoral puzzles. Pick up wood to form bridges, move boulders to create obstructions, and flatten fields into pathways all to help deliver your herd before time runs out! Flock together with a friend and even create and share your own crazy levels online!\nHerd, poke, prod and manipulate cute, cuddly animals that react to each other and their hazardous surroundings\nOver 50 levels of pastoral puzzle challenges\n2 player local co-op flocking\nLevel editor allows for custom puzzles to be created, shared and rated\nCompelling environments complemented by a whimsical art style, beautiful lighting and  distinctive textures makes this one of the most graphically-advanced downloadable titles to date\nReal-world physics engine creates all new types of puzzles; Pick up wood to form bridges, move boulders to create obstructions, and flatten fields into pathways\nLots of fun surprises, secret collectibles and upgrades to find","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":4496,"name":"Crazy Machines Elements","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/199/199467eaccd604b645dbb1fb95800999.jpg","description":"GET YOUR BRAIN BUZZING with each new challenge in the latest installment of the multi award-winning wacky contraption series - CRAZY MACHINES ELEMENTS. Play with Fire, harness the power of water and control the wind to set off the most insanely creative chain reactions! Build crazy machines from everyday objects and bizarre components. Utilize the elements (fire, water and wind) to discover all the fantastic possibilities available to you! Experiment by night, in the snow or rain! Use the cloud machine and generate lightning, tornadoes and rain to complete your crazy chain reactions; real physics will simultaneously be your best ally and your toughest enemy. Take your pick of challenging and zany puzzles to solve, using cool parts like the clone cannon, monster trucks, fire breathing dragons, and more! Compete with your friends to see who can make the coolest machine. Design and try out your own wacky inventions using the built-in editor. Loads of totally wacky chain reactions are just waiting to be created, so put your brain to the test by carrying out zany experiments as the nutty inventor in CRAZY MACHINES ELEMENTS! Your lab awaits you.Key Features:Harness the Power of the Elements: Fire, Water and Wind\nTrue Newtonian Physics\nNext Gen 3d Graphics\nHundreds of Levels and Parts\nControl the weather: make it rain, snow and even light up the sky with lightening!\nExperiment by day or night","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"dtp Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":1543,"name":"Inside My Radio","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe8/fe859674f1354bfa887e366073f4501b.jpg","description":"Can you beat the beat? Journey as a green LED mysteriously trapped inside a dying boombox and play the ultimate musical experience. In this rhythmic platform adventure where your every action needs to be right on the beat, bring electro, dub and disco music back to life!\nFEATURESRhythmic awareness is vital when you jump, dash or slam. You have to hit that beat! Never under any circumstances should you play on mute!\nFeel creative, play with the music and unleash your inner musician! Inside My Radio lets you compose the track: YOU are in control, either with your actions, movements or jam zone, where you can freely choose and mix the tracks the way you want.\nThe game is a mix-tape where every level is a different track: every level brings different variations to electro, disco or dub!\nEnjoyed the experience but want more? Try to finish the levels before the clock expires, in Time Attack mode. It’s rhythm or die time: the more you hit the beat, the higher your score multiplier goes, the better your score. Don’t miss a beat or you will lose your multiplier AND get a time penalty!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Seaven Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]}]