[{"id":1358,"name":"Papers, Please","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d3/6d33014a4ed48a19c30a77ead5a0f62e.jpg","description":"The creator of the game often travelled through Asia and made the observation that the work of an immigration officer checking documents for entry is simultaneously very monotonous and very responsible. The game reproduces this work - but scammers and unusual situations occur in it much more often than in reality. The task of the player-officer is not to make a mistake, not to let an unwanted guest into the country. He has power, directories, translucent devices, etc., but experienced masters of deception and fraud act against him. The task of the player is complicated by the fact that his country is like all the paranoid dictatorships at the same time. This country fears a lot, seeks to control everything and periodically generates various rules. The game has a lot of humour, a lot of exciting puzzles and unexpected twists, including shooting. The visual and musical design of the game reflects the bizarre world of stupid rules, constant fear and mutual distrust.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Dukope1","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"}]},{"id":51325,"name":"The Last of Us Part II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/909/909974d1c7863c2027241e265fe7011f.jpg","description":"The Last of Us Part II is the sequel to the post-apocalyptic zombie game The Last of Us.\n\nPlot\n\nThe game follows Ellie, the girl who was the secondary protagonist and the player character's companion in The Last of Us. The game is set five years after the ending of the original. Both Ellie (who is by 19 now) and Joel survived and live in Jackson, Wyoming, where Ellie is dating another girl, Dina. However, the characters have to deal with the evil cult called the Seraphites, who try to sacrifice their former members. A matter of revenge forces Ellie and her friends to undertake a trip to Seattle, Washington, to kill their enemies. The major theme of the plot is Ellie's dealing with her hate issues.\n\nGameplay\n\nUnlike in the original game, the player controls Ellie instead of Joel, who now becomes her AI-controlled companion. The game features improved controls that include new options such as crawling, dodging, and a jump button. A new AI system allows the human adversaries to communicate share information with each other. The game also introduces multiplayer.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":10073,"name":"Divinity: Original Sin 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/424/424facd40f4eb1f2794fe4b4bb28a277.jpg","description":"The Divine is dead. The Void approaches. And the powers latent within you are soon to awaken. The battle for Divinity has begun. Choose wisely and trust sparingly; darkness lurks within every heart.\n\nWho will you be? A flesh-eating elf; an imperial lizard; an undead risen from the grave? Choose your race and origin story - or create your own! Discover how the world reacts differently to who - and what - you are.It’s time for a new Divinity!\nGather your party and develop relationships with your companions. Blast your opponents in deep tactical turn-based combat. Use the environment as a weapon, use height to your advantage, and manipulate the elements.Ascend as the god that Rivellon so desperately needs.\nExplore the vast and layered world of Rivellon alone or with up to 4 players in drop-in/drop-out co-operative play. Go anywhere, kill anyone, and explore endless ways to interact with the world. Continue to play in the brand-new PvP and Game Master modes.\nChoose your race and origin. or create your own as a Human, Lizard, Elf, Dwarf, or Undead. The world reacts to who you are, and what you’ve done. Every choice will have a consequence.\nUnlimited freedom to explore and experiment. Go anywhere, talk to anyone, and interact with everything! Every NPC can be killed, and every animal spoken to! Even ghosts hold a few secrets or two…\nThe next generation of turn-based combat. Revamped action point system, AI 2.0., new elemental combos, over 200 skills, height advantage… and much, much more.\nUp to 4 player online and split-screen multiplayer. Choose one of the 6 pre-made characters or create your own. Play with your friends online or in local split-screen with full controller support.\nGame Master Mode: Take your imagination to the next level and craft your own stories with the Game Master mode. Download fan-made campaigns and mods from Steam Workshop.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Larian Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":28492,"name":"Dead Island","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/56e/56ed40948bebaf1968234aa6e3c74771.jpg","description":"Dead Island is a zombie fighting game with the open world. Fictional island Banoi is filled with tourist. But suddenly, everyone disappears from every hotel room, and every corner of the island is filled with zombies. Four survivors - Sam, Xian, Logan and Purna must escape the hordes of zombies and try to find any survivors on the island and get out of this God forgotten place.\r\n\r\nThe gameplay is based around experience. Killing zombies and completing quests will provide with EXP points which you can waste for new traits and perks for better and easier killing. Every character has his advantages with different types of weapon. For example, Purna is a former police officer, and she is quite familiar with firearms when Sam is very good with blunt weaponry. Having different styles of gameplay adds a very good variety to the gameplay, as you can play alone or with your friends. Quests will provide experience to every player on the map as you share it with your partner and you are free to do your quests as you want since the game has an open world system integrated into it.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Techland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":559,"name":"Fallout Shelter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a91/a911f0a91991469e398fa70091507a5b.jpg","description":"The game is a simulation of managing a refuge. As an Overseer, you have to control the essential aspects of life in the Vault, especially: energy, food, water and the number of inhabitants. Your task is to develop and expand your shelter, as well as to fight enemies, to resist the attacks of raiders and other representatives of the Wasteland. \n\nTo obtain resources, you need to assign people to the appropriate premises, properly distributing their skills between strength, perception, endurance, charisma, intelligence, agility and luck. Each character characteristic will affect how well he produces a particular type of resources and how high his chances to survive in the Wasteland. \n\nAn essential aspect of the game is the correct use of resources and their balance. And with a deficit of one, there are difficulties. For example, the lack of electricity disrupts the premises, the lack of water leads to radiation exposure of residents, and food — to the loss of health. You also need to protect themselves from attacks by raiders, mutated rats,  ghouls and other creatures.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":2572,"name":"DiRT Rally","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78d/78dfae12fb8c5b16cd78648553071e0a.jpg","description":"Full Oculus VR SupportDiRT Rally now fully supports Oculus Rift giving you the ultimate experience in racing immersion.\nDiRT Rally VR puts you directly in the driver’s seat of the most iconic rally cars ever produced as you take on some of the most challenging stages in the world including the incredible Broadmoor Pikes Peak International Hill Climb as well as experiencing wheel-to-wheel thrill of Rallycross.\n•\tFull Oculus Rift VR support throughout the entire game\n•\tAmazing 90fps experience\nAbout the GameDiRT Rally is out now for Linux\nDiRT Rally for Mac is standing by for Metal\nDiRT Rally is the most authentic and thrilling rally game ever made, road-tested over 80 million miles by the DiRT community. It perfectly captures that white knuckle feeling of racing on the edge as you hurtle along dangerous roads at breakneck speed, knowing that one crash could irreparably harm your stage time.\nDiRT Rally also includes officially licensed World Rallycross content, allowing you to experience the breathless, high-speed thrills of some of the world’s fastest off-road cars as you trade paint with other drivers at some of the series’ best-loved circuits, in both singleplayer and high-intensity multiplayer races.\n• ICONIC RALLY CARS - DiRT Rally boasts over 40 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on.\n• SIX MASSIVE RALLIES WITH OVER 70 STAGES - Head to the muddy paths of Wales, the dusty trails of Greece and the icy tarmac of Monte Carlo. Take on the legendary hillclimb of Pikes Peak, the snowy thrills of Sweden, and the epic scenery of Finland.\n• OFFICIAL FIA WORLD RALLYCROSS CONTENT – Race at the Lydden Hill, Holjes and Hell tracks in six of the fastest off-road cars and take on your friends in high intensity, bumper-to-bumper multiplayer racing.\n• CUSTOM RALLY EVENTS: Take any car on any track – configure and compete in single or multi-stage events.\n• RALLY CHAMPIONSHIPS: Start on the bottom rung of the rally ladder and compete in a succession of events, earning points and money on your way to promotion. Use skilful driving and manage your repair schedules as you work your way to the top division and earn the most lucrative rewards.\n• UPGRADES, REPAIRS, SETUP AND TUNING - DiRT Rally delivers depth in areas beyond driving – elements such as repairs, upgrades, and setup & tuning add a rich and strategic dimension to your rally experience.\n• CHALLENGING, UNCOMPROMISING HANDLING MODEL - Codemasters has completely rebuilt the physical simulation for DIRT Rally to adequately capture how it feels to race across changing surfaces and has created brand new models for differential, suspension, engine mapping and turbo modelling.\n• TEAM MANAGEMENT - Hire and fire your crew members each of whom which will have different skills, improving repair times for different parts of the car. Teach them new skills as they gain experience and work together as a team to improve your performance in events.\n• PLAYER LEAGUE SUPPORT - Get together with friends and run your very own racing league. Join or create unlimited leagues and run them how and when you want.\n• DAILY, WEEKLY AND MONTHLY ONLINE CHALLENGES - It’s you versus the entire DiRT community in a series of one-day, week-long and month-long challenges to earn in-game credits to improve your car and team.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"}]},{"id":3740,"name":"FEZ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4cb/4cb855e8ef1578415a928e53c9f51867.png","description":"FEZ is a 2D and 3D game at the same time. Even though it is a platformer game in which you solve puzzles in the dimension your looking at, you can manipulate with the world itself by rotating it all around. Because of that very interesting mechanic that is not so popular in the industry, the game is actually is a 2D in a 3D world. In order to proceed from one level to another, you have to collect cubes or fragments of it. However, by rotating the world, you can actually gain access to some places that wouldn't be available without this mechanic. \n\nGomez, our protagonist, must restore the order in his universe by passing through the levels and collecting little fragments of it. But he will face no threat at all. Your only challenge is to actually beat these quite peculiar puzzles, basically without any guidelines at all. As stated by a developer himself, this game is about \"stop and smell the flower\", which makes it a brilliant stress-relief or a relaxing sort of the game with slow gameplay and nice atmosphere.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"POLYTRON","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19542,"name":"Half-Life: Blue Shift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4cb/4cb463b5588adc672124fb041f09e91c.jpg","description":"Half-Life: Blue Shift is the second (after Opposing Force) expansion pack for the original first-person shooter Half-Life. The game setting is the same as the one in the original game: the story takes place in the science laboratory called Black Mesa Research Facility in New Mexico. However, the game portrays the events of Half-Life through the eyes of Barney Calhoun a security guard employed by Black Mesa. Till the things have gone the wrong way the protagonist was responsible for the lab equipment and personnel welfare, but after the accident, his only aim is to protect a high-ranked scientist Dr. Rosenberg. The gameplay is almost similar to the original Half-Life’s: the storyline continues by navigating through the sequence of levels. Each level consists of both combat part and solving puzzles. Although Blue Shift is an expansion to the original Half-Life, both weaponry and enemies range face no changes or additions, so players use same guns to shoot same aliens. The only new mechanics is escorting a character to a specific location.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Gearbox Software","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3757,"name":"South Park: The Stick of Truth","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ca/8ca40b562a755d6a0e30d48e6c74b178.jpg","description":"South Park: The Stick of Truth is an action RPG based on the American animated series South Park. Players assume the role of the New Kid, who moved to eponymous fictional town in Colorado State with his parents. According to the storyline, the New Kid meets the army of humans led by Wizard King Cartman in the Kupa Keep Kingdom (Cartman’s backyard) and gets his nickname Douchebag. Cartman, as well as other characters of the original series, introduce The Stick of Truth, the key to the war between humans and elves, to the New Kid. Once The Stick is stolen by elves, the war and the whole adventure of Douchebag begins. The game is viewed from the third-person perspective. To start the campaign, players have to choose one of the character types (Fighter, Thief, Mage, and Jew), each with its own parameters and special abilities. Completing the levels and eliminating the enemies gives experience points that could be spent on learning new skills or upgrading the level. The gameplay also features fast travel ability. Remarkable characters of the original series – Cartman, Butters, Stan, and Kyle – join the protagonist during his wild adventure.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":21265,"name":"Half-Life: Opposing Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/110/1106ebafac87cc573161f1f4f16e84cf.jpeg","description":"Half-Life: Opposing Force is an expansion pack for the original first-person shooter Half-Life. The game setting is the same as the one in the original game: the story takes place in the science laboratory called Black Mesa Research Facility in New Mexico at the same time. However, instead of following the original characters, players are offered to assume the role of Adrien Shephard a Hazardous Environment Combat Unit (initially antagonist organization) operator, who is sent to Black Mesa to prevent an extraterrestrial menace. Nevertheless, shooting scientists is not required, as the main threat comes out of aliens. The overall gameplay has few differences comparing to the one existing in Half-life, as far as it is based on completing the sequence of levels. Although the combat system looks almost the same, it features the non-player character’s assistance so the protagonist will receive support from scientists, security guards, and marines (soldiers, combat medics, and engineers) during firefights or while solving puzzles. Players will also face new aliens types added to the existing ones.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10419,"name":"Subnautica","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/739/73990e3ec9f43a9e8ecafe207fa4f368.jpg","description":"Subnautica is a first-person game about survival in the deep sea. You control Ryley Robinson, a space traveler in the 22nd century, who crash-landed his starship on a planet that is covered almost entirely by the ocean. The protagonist needs to eat and drink, although this can be disabled in lower difficulty modes. He can desalinate oceanic water, catch or gather the seafood, and create useful tools and structures. Unlike many survival games, Subnautica has a detailed plot, in which Ryley has to uncover why his ship crashed. By exploring the ocean, finding the remnants of other crashes, and listening to the radio messages, Robinson will learn about the enormous Leviathan, the mysterious Precursors, and the reason why this planet is quarantined.\r\nThe game is famous for its spectacular portrayal of the ocean and its wildlife. Robinson is equipped with a scuba diving gear that allows the player to spend most of the game underwater, although oxygen still has to be replenished. The player can dive deep and explore the world full of corals, fish, and other colorful sea creatures, often grotesque or bio-luminescent. The environment is randomly generated to improve replayability.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Unknown Worlds Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":4954,"name":"Castle Crashers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1a/d1a1202a378607b6c635c8f18ace95dd.jpg","description":"Castle Crashers is 2D beat-em-up game with role-playing elements developed by Behemoth. It was initially released in 2008 via Xbox Live Arcade with following ports for PS3, Windows, and macOS. In 2015 it was remastered as Castle Crashers Remastered and was released for Xbox One.  \nYou play as a knight sent by the king to defeat an evil wizard who stole the king’s daughters and captured and mystical gem. The gameplay is very reminiscent of older side-scrolling beat-em-up titles. It can be summarized as a player has to defeat waves of enemies in different locations using his weapons and magical abilities. However, it also incorporates some role-playing elements such as acquiring gaining new levels which allow a player to enhance his stats and acquire new moves. One of the gameplay’s focal points is cooperative multiplayer with the support for up to 4 players which is available both locally and online.  \nThe game shares significant Behemoth hand-drawn visual style which was used before in Alien Hominid and would be later used in studio’s BattleBlock Theater and Pit People.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"The Behemoth","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3990,"name":"The Last Of Us","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a5a/a5a7fb8d9cb8063a8b42ee002b410db6.jpg","description":"The population of the Earth almost disappeared as a result of a pandemic caused by a mutated fungus. The disease causes irreversible changes in the human body, a person loses his mind and behaves aggressively, like a zombie. Civilization no longer exists, few survivors live in isolation under the protection of the military.\nCities outside the zones are dangerous ruins inhabited by infected people and people who have almost lost humanity.\nHeroes, the smuggler Joel and teenage girl Ellie, are trying to cross the continent, colliding in depopulated cities with all the set of dangers. The game requires hidden actions, the combat capability and the number of ammunition of the heroes are small, and it is best for them to avoid fighting. For most of the game, the player controls Joel, while Ellie and Joel's other companions are controlled by artificial intelligence.\nThe levels of the game are very extensive, at each level the task is the same - to reach a certain point alive.\n\nCharacters have something like a shotgun pistol, bow and arrow, as well as improvised items - pipes, sticks, baseball bats.\nFrom time to time, it is necessary to solve the problem of perceptiveness.\nArtificial intelligence, which controls opponents, can behave differently depending on the situation.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":1244,"name":"Darkest Dungeon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd9/fd92f105dcd6491bc5d61135033d1f19.jpg","description":"Darkest Dungeon is a roguelike RPG developed by Red Hook Studios.\n\nThe works of Howard Lovecraft served as the main inspiration for the game which addresses the themes of fear and psychological trauma. \n\nThe story begins when the player learns that they inherited a manor from a distant relative who died excavating the catacombs under the manor and accidentally released a number of monsters.\n\nThe player controls a group of adventure seekers that explore the dungeons beneath an old manor. Before every expedition, the player has to choose several heroes from the suggested roster and lead them through procedurally generated dungeons collecting treasures and killing various monsters.\n\nThe main objective is to save the lives and mental health of the heroes. Mental health declines every time when the player's comrades suffer damage, walk into traps or fall back from the battlefield. If the hero suffers a breakdown, they start to behave unexpectedly. During the expedition, the characters obtain their own traits - permanent behavior patterns, which can be both negative, such as alcoholism and kleptomania or positive like bravery.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Red Hook Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":14348,"name":"Dying Light: The Following - Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c11/c11a0b92b4c28f2e0db489f430142653.jpg","description":"Dying Light series introduces a world that was hit by a zombie virus outbreak. Under the daylight, zombies are weak and slow, but after the sunset, they become fast, strong and hungry for human flesh. You play as Kyle Crane, a special operative sent to the Harran city, which became a quarantined zone after the outbreak. In the expansion pack The Following, he learns about a cure for the plague, supposedly invented by a sect, and sets off to find out more about it. Crane will travel the countryside open world that is twice the size of the original game’s map. To fight off zombies, Crane will use not only a variety of weapons but also parkour movements, which are the definitive feature in Dying Light gameplay.\nThe Following introduces new weapons, several new game modes, such as bounty hunting which gives the player a new mission every day. The expansion allows the player to drive a buggy to run zombies over. There is a four-person multiplayer mode, and also the “Be the Zombie” mode, in which players can assume the role of a huge, powerful zombie. The Enhanced Edition includes the original game, the expansion pack, and all the available DLCs, such as Cuisine & Cargo and The Bozak Horde.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Techland","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":59359,"name":"A Plague Tale: Innocence","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4a/b4adf80c36e267b35acc3497ed2af19c.jpg","description":"A Plague Tale: Innocence, on PlayStation 4, Xbox One and PC, tells the grim story of two siblings fighting together for survival in the darkest hours of History. This new video game from Asobo Studio sends you on an emotional journey through the 14th century France, with gameplay combining adventure, action and stealth, supported by a compelling story. Follow the young Amicia and her little brother Hugo, who face the brutality of a ravaged world as they discover their purpose to expose a dark secret. On the run from the Inquisition's soldiers, surrounded by unstoppable swarms of rats incarnating the Black Death, Amicia and Hugo will learn to know and trust each other as they struggle for their lives against all odds.\r\n• An original, powerful tale following the trip of the young noble Amicia de Runes and her adorable yet smart brother Hugo\r\n• Survive a great, enigmatic danger in a brutal, unforgiving world. With the Black Plague appeared deadly swarms of rats, indiscriminately devouring everything in their path.\r\n• A seamless blend of adventure and stealth gameplay, deeply embedded in dark medieval mystery.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":15859,"name":"Star Wars: Knights of the Old Republic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6e0/6e0c19bb111bd4fa20cf0eb72a049519.jpg","description":"The game takes place in the world of the epic \"Star Wars\".\r\nWhen creating a character, first select a class - Soldier, Scoundrel or Scout. Classes differ in the proportion of strength, health and cunning. Later, three more classes will open, each of which will be a Jedi: Jedi Guardian, Jedi Consular, and Jedi Sentinel. This will also be the choice in favour of different proportions of strength, intelligence and skills.\r\nIn the world of \"Star Wars,\" there is a Force that can be vested both by the Jedi and by their enemies. There are Force Powers of three types: light, dark and neutral. They should be studied, this raises the level of skill. Forces are expended but are restored.\r\nThe player can alternately lean toward both the Light and the Dark Side of the Force - this will affect the ending of the game and the use of Force Powers. For example, if the character belongs to the Light Side, then the use of the Dark Force will require more of this Force from him than using the Light.\r\nThe hero will visit the underground metropolis, the desert planet, the planet-forest and the planet-ocean, caves with crystals for light swords, sand Tatooine, the planet-cemetery, space ships and stations.\r\nThe hero will interact with sentient beings, droids of different classes and exotic animals.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":857,"name":"Halo: The Master Chief Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c24/c24f4434882ae9c2c8d9d38de82cb7a5.jpg","description":"Halo: The Master Chief Collection is a bundle of Halo remasters developed by Bungie and 343 industries.\r\n\r\nThe bundle features Halo: Combat Evolved Anniversary, Halo 2 Anniversary, Halo 3 and Halo 4. All four games are distributed on one disc and are accessible through a unified interface. It is possible to play any mission from all four games right from the beginning of the game. \r\n\r\nApart from the story in the games themselves, the bundle features two CG videos which reveal that Jameson Locke is going through Master Chief's combat record in an attempt of finding him after the events of Halo 4. \r\n\r\nFor every game in the collection, it is possible to turn on the campaign scoring system. Every mission has its own leaderboard which includes the overall score, playtime, and the enemy kill count. \r\n\r\nEvery game in the bundle features a cooperative mode that can be played either online or using split-screen. It is possible to play with 3 more players online while only two players can play on one screen. The original multiplayer is retained in the games. Every multiplayer map ever released for every game in the bundle is available for the players.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Splash Damage","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":56184,"name":"Resident Evil 4 (2005)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fee/fee0100afd87b52bfbd33e26689fa26c.jpg","description":"Resident Evil 4 is a third-person shooter game developed by Capcom Production Studio 4 and published by Capcom. The sixth major installment in the Resident Evil series, it was originally released for the GameCube in 2005. Players control U.S. government special agent Leon S. Kennedy, who is sent on a mission to rescue the U.S. president's daughter Ashley Graham, who has been kidnapped by a cult. In a rural part of Europe, Leon fights hordes of villagers infected by a mind-controlling parasite, and reunites with the spy Ada Wong.\nDevelopment began for PlayStation 2 in 1999. Four proposed versions were discarded; the first attempt was directed by Hideki Kamiya after producer Shinji Mikami. In a departure from the fixed camera angles and slower survival horror gameplay of previous instalments, the team focused on developing more dynamic shooting action.\nResident Evil 4 was announced as a GameCube exclusive as part of the Capcom Five, but was ported to numerous formats, becoming a cross-platform hit, selling over 10 million copies across all platforms. It garnered acclaim for its narrative, gameplay, voice acting, and characters, and is often named one of the best video games, winning multiple Game of the Year awards in 2005. It influenced the evolution of the survival horror and third-person genres, popularizing the \"over-the-shoulder\" third-person view. Resident Evil 5 was released in 2009.\n\n#Gameplay\nThe player controls the protagonist, Leon S. Kennedy, from a third-person perspective. Departing significantly from the series' previous games, the gameplay focuses on action and shootouts with fewer survival horror elements. The camera is placed behind Leon and zooms in for an over-the-shoulder view when aiming a weapon, or a first-person view when aiming with a sniper rifle. There is no crosshair for firearms; instead, every firearm has a laser sight. Unlike previous games where players can only shoot straight, up, or down, players have more options. For example, shots to the feet can cause enemies to stumble, and shots to the arms can make them drop their weapons. Players can also shoot down projectiles like thrown axes or scythes.\nResident Evil 4 adds context-sensitive controls. Based on the situation, players can interact with the environment: kicking down a ladder, jumping out of a window, dodging an attack or executing a \"finishing move\" on weakened enemies. There are also quick time events, in which the player must press buttons indicated on-screen to execute actions such as dodging a falling boulder or wrestling an enemy to stay alive. These are often incorporated into the game's many boss fights, in which the player must avoid instant-kill attacks.\nThe main enemies are violent villagers referred to as Los Ganados (\"The Cattle\" in Spanish). Los Ganados can dodge, wield melee and projectile weapons, and are capable of working collectively and communicating with each other.\nThe inventory system features a grid system, represented by an attaché case, that has each item take up a certain number of spaces. The case can be upgraded several times, allowing for more space. Weapons, ammunition, and healing items are kept in the case, while key items and treasures are kept in a separate menu. Items may be bought from and sold to a merchant that appears in various locations. He sells first aid sprays, weapons, allows for weapons to be upgraded and buys various treasures that Leon finds. The various weapons each have their own advantages and disadvantages.\nCapcom added content for the PlayStation 2 version, which was later incorporated into the PC and Wii releases. The largest addition is \"Separate Ways\", a minigame which focuses on Ada Wong's involvement in Resident Evil 4 and her connection to the series' villain Albert Wesker. \"Ada's Report\", a five-part documentary, analyzes Ada's relationship with Wesker and his role in the plot. Other unlockable content in all versions includes the minigames \"The Mercenaries\" and \"Assignment Ada\" (using Ada to retrieve Las Plagas samples), new costumes for Leon and Ashley, new weapons, and a cutscene browser.\n\n#Plot\nU.S. government agent Leon S. Kennedy (Paul Mercier) is on a mission to rescue Ashley Graham (Carolyn Lawrence), the U.S. President's daughter, who has been kidnapped by a mysterious cult. He travels to a nameless rural village in Spain, where he encounters a group of hostile villagers who pledge their lives to Los Illuminados, the cult that kidnapped Ashley. The villagers were once simple farmers until becoming infected by a mind-controlling parasite known as Las Plagas.\nWhile in the village, Leon is captured by its chief, Bitores Mendez, and injected with Las Plagas. He finds himself held captive with Luis Sera (Rino Romano), a former Los Illuminados researcher. The two work together to escape, but soon go their separate ways. Leon finds out Ashley is being held in a church and rescues her. They both escape from the church after Osmund Saddler (Michael Gough), leader of Los Illuminados, reveals his plan to use the plaga they injected into Ashley to manipulate her into injecting the president of the United States with a \"sample\" once she returns home, allowing Saddler to begin his conquest of the world.\nAfter killing Mendez, Leon and Ashley try to take refuge in a castle but are attacked by more Illuminados under the command of Ramon Salazar (Rene Mujica), another of Saddler's henchmen who owns the castle, and the two become separated by Salazar's traps. Meanwhile, Luis searches for pills that will slow Leon and Ashley's infection, as well as a sample of Las Plagas. He brings the two items to Leon but is killed by Saddler, who takes the sample, while the pills to suppress the infection remain in Leon's hands. While in the castle, Leon briefly encounters Ada Wong (Sally Cahill), a woman from his past who supports him during his mission. He battles his way through the castle before killing Salazar.\nAfterward, Leon travels to a nearby island research facility, where he continues the search for Ashley. He discovers that one of his former training comrades, Jack Krauser (Jim Ward), who was believed to have been killed in a helicopter crash two years prior, is responsible for her kidnapping. Ada and Krauser are working with Albert Wesker (Richard Waugh), for whom both intend to secure a Plagas sample. Suspicious of the mercenary's intentions, Saddler orders Krauser to kill Leon, believing that no matter which one dies, he will benefit. After Krauser's fatal defeat, Leon rescues Ashley, and they remove the Plagas from their bodies using a specialized radiotherapeutic device. Leon confronts Saddler, and with Ada's help, manages to kill him. However, Ada takes the sample from Leon at gunpoint before escaping in a helicopter, leaving Leon and Ashley to escape via her jet-ski as the island explodes.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Capcom","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"}]},{"id":9475,"name":"Don't Starve","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f3e/f3eec35c6218dcfd93a537751e6bfa61.jpg","description":"Don’t Starve is an adventure survival game set in a procedurally generated open world environment and made in a specific cartoon manner. Players assume the role of the scientist Wilson lost in the dark world. The main objectives for Wilson are to stay healthy, fed and mentally stable, and to avoid attacks of supernatural enemies in order to survive as long as possible. Players control the action with the keyboard (general activities) and mouse (combat). The game features day/night time cycles, which change survival pace dramatically. Days are usually spent exploring the map, gathering resources, and crafting, while nights require maximum concentration and caution to stay aware of dangerous enemies. Enemies range from tiny frogs to carnivore birds and tentacles. To lead a successful survival players must control tree scales in the screen top, which track hunger, health and sanity respectively. Death occurs in various ways from including starving, insanity, and deadly wounds inflicted by monsters.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":3015,"name":"Chivalry: Medieval Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f0/7f021d4a3577ac9d591a628a431fc2e5.jpg","description":"Chivalry: Medieval Warfare is a fun hack-and-slash PvP game based in medieval ages. You can pick one of four classes - knight, archer, man-at-arms or a vanguard with his specific weapons and behead your opponents, stick an arrow in their chest or make a good-old rush with a battle cry and a claymore. \n\nAlso, there is a variety of game modes to choose from. In Free Fro All the player with most points wins the game when everyone battles everyone in this massacre mode. Duel makes a tournament - one vs one fights of knights where only better skill or luck will grant you victory. Team Deathmatch is a traditional mode with two teams and scores that must be reduced to zero in order to win. \n\nWhat is not so ordinary for the genre, however, is a first-person camera. You are able to control any movement of your weapon thus creating a unique pattern of your attacks and slicing through enemies in order to win.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Activision","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":8146,"name":"Assassin's Creed Unity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59f/59fc1c5de1d29cb9234741c97d250150.jpg","description":"The game takes place in Paris, during the Great French Revolution, from the capture of the Bastille in 1789 to the Thermidorian coup. Behind all action, there is an intrigue connected with the change of the Great Master of the Order of Templars. The game has a new assassin, Arno Victor Dorian.\nThe setting provides an abundance of locations - from Versailles to the Parisian multi-level catacombs.\nThe mission system is entirely different from the previous games of the series. In this game, there is a cooperative mode for a maximum of 4 people.\nParkour now allows you to climb walls without any troubles at all. A system of shelters and the ability to manipulate the crowd are added.\nThe player has an influence on the character improvement scenario.\nAn interesting detail - before the murder of the primary victim, her whole life flashes before the eyes of the assassin.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19384,"name":"The Binding of Isaac","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cef/cefedf18016cbab466861eb698daf988.jpg","description":"The Binding Of Isaac is a roguelike top-down “shooter” with RPG elements. Initially, a Flash game, the game had earned many fans due to its unique art style, spooky and catchy ambient music, and almost infinite replayability. Randomly generated levels, loot, and enemies will provide quite a challenge for those unfamiliar with roguelike games, and will bring joy to the eye of an experienced player.\nThe game’s protagonist is Isaac, a child from a religious family. His misadventures are based off a biblical story about a character of the same name, although the gameplay itself certainly does not follow the same footsteps. There are also additional, unlockable characters with unique abilities and traits, which will affect your playthrough’s difficulty. \nThe Binding of Isaac featured non-linear levels, which brought about different outcomes of the game. Depending on the character played, playstyles can also differ, allowing players to create and share new metals for further replayability, and eventual full completion of the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Edmund McMillen and Florian Himsl","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":865,"name":"Call of Duty: Black Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/410/41033a495ce8f7fd4b0934bdb975f12a.jpg","description":"Call of Duty: Black Ops is a first-person shooter, a seventh installment in the series altogether and a sequel to Call of Duty: World at War. The game takes place during the Cold War and shows different historical periods of it.\r\nThe main character is a CIA agent, set out on different classified missions and tasked with eliminating enemies if needed. The story in the game is complicated, featuring characters from the previous games, and historical figures like JFK and Fidel Castro. Despite its emphasis on the scenario and real-world plausibility, Black Ops doesn’t lack in gameplay terms, as the combat system is, as established in series, extensive and realistic. The graphics are made for the player’s highest level of entertainment, with massive special effects and excellent quality of every detail.\r\nCall of Duty: Black Ops features a trademark multiplayer system, with different game modes, competitive play, and cooperative maps. The players can earn ranks for their performance, unlock new customizable weapons and different perks for use in the upcoming battles.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Raven Software","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":3486,"name":"Syberia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/852/8522935d8ab27b610a254b52de0da212.jpg","description":"Syberia is an adventure game where a twisted story is combined with puzzle solving and a graphical quest’s elements. You take on the role of Kate Walker, who has to travel over half of Europe to fix her business issues. However, her adventure appears to be exciting and surreal, and, actually, life-changing. Searching for a man to sell her a toy factory, Kate becomes involved in a fantastic journey that leads her to the land of Syberia where mammoths are still alive.\nThe main gameplay activity is classical for point-and-click quests and for the most part is solving numerous complicated puzzles that are tightly connected with the plot development and extend and deepen the story. Huge locations may contain dozens of puzzles, so finding all clues will make you explore every corner of every place. Puzzles often feature work with details from mechanisms and odd inventions. The gameplay supports the surreal atmosphere of the game which twists the reality with human dreams and hopes.\nSyberia is followed by two sequels, Syberia II and Syberia 3, that continue the adventures of Kate Walker.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Microids","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":4639,"name":"Dragon Age: Origins","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc0/dc0926d3f84ffbcc00968fe8a6f0aed3.jpg","description":"Dragon Age: Origins is the first game in BioWare’s RPG franchise Dragon Age. The game is considered to be the spiritual successor of BioWare’s classic fantasy RPG titles like Baldur’s Gate and Neverwinter Nights. Developers describe the game's setting as a mix of high fantasy and low fantasy. The storyline is centered around the event known as Blight, which occurs once in several hundred years and marks the demonic invasion in the world of Thedas.  \nThe player creates its character by choosing its appearance, class, and race. There are 3 and three races in Dragon Age. The classes are the warrior, mage, rouge, and races are human, elf, and dwarf. The combination of class and race determines the character’s background story and the beginning of the game. \nThe interaction between the player, his teammates and NPC’s is an integral part of the game. The game’s storyline often makes the player take moral decisions which affect his later interaction with characters and the game world in general.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":18241,"name":"DmC: Devil May Cry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/295/295eb868c241e6ad32ac033b8e6a2ede.jpg","description":"DMC: Devil May Cry is a hack-and-slash adventure game, the fifth installment in Capcom’s Devil May Cry franchise and reboot of the series. This is the first game in the series not developed by Capcom, but rather by English studio Team Ninja. Concerning story, the game is connected to the previous game and changes the cast of characters and even Dante’s (the series main protagonist) iconic appearance (which was met with indignation from the series fans at the time). The game’s story is notable for its social commentary regarding mass-media and modern capitalism drawbacks.  \nThe gameplay overall is very similar to the other installments of the Devil May Cry series and is heavily focused on fast-paced fighting with hordes of demons with occasional puzzles and platforming sections. The main change in the game’s combat mechanics is the Angel and Devil modes. They alternate Dante’s and attacks and special abilities. The modes are activated by holding left or right trigger (on the controller) which makes switching between them instant and allows performing complex combos, combining each mode’s unique features.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ninja Theory","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":6617,"name":"Quantum Break","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a28/a289e23b4d4d84f26ab59125e3be4483.jpg","description":"Quantum Break is an adventure third-person action game. \n\nThe game's plot revolves around the fictional Northern American University called Riverport. The main character of the game - a young guy Jack, who discovered the ability to control the time after a failed experiment. Jack begins to hunt the organisation called \"Monarch\", whose founder, Paul Serene, also has a unique ability - he can see alternative futures. Jack has all the forces to confront the \"Monarch\", using the newly acquired forces to understand what happened during this mystical experiment.\n\nIn the game, besides the usual cut scenes, added the same series with short episodes that reveal the plot of the project. Details of each set may vary depending on what decisions players make at any given time. It is a shooter with elements of shelters. The player will need to do a lot of manipulations with time to overcome obstacles in its path.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":3932,"name":"The Bureau: XCOM Declassified","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5cc/5cc765484c6df567ed9207c1781b88cb.jpg","description":"The Bureau: XCOM Declassified is the second game in some kind of the franchise reboot. Despite the fact that the first game, XCOM: Enemy Unknown was a strategic game, this time is it a tactical third-person shooter. The story follows CIA Agent William Carter, who survives the attack of aliens in 1962 and becomes a member of the Bureau -  secret U.S. organisation that was created to fight with threats of national security scale. However, after arriving in the bunker, Faulke - director of the facility - states that all of the U.S. military bases have been destroyed and they cannot contact the White House. With that being said, the Bureau is now re-named into XCOM and starts its story from this moment.\n\nDespite genre difference to its predecessor, The Bureau still focuses on tactical elements of the gameplay. Agent Williams has a squad of 3 members with him included. While in the fight, the player can stop the game to give orders to his crew - change your position, use some skill or focus on the exact target.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":4550,"name":"Dead Space 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae1/ae1518c3dc1e847344661905fd2a8d16.jpg","description":"Dead Space 2 is a third-person action shooter including both survival and horror elements. The game is a direct sequel to the first chapter of the Dead Space franchise. The game is set in the space environment of the future. The story of the second part begins in 2511, 3 years after the events held in the first game. The main character Isaac Clarke is awakened after 3-year coma (after the escape from Aegis VII) in an insane asylum in the Sprawl on Titan. A soon as the event pace raises and antagonists start pursuing him to get his brains (for building a new Marker), Isaac realizes his only goal – the destruction of the Marker. Players are offered to join the protagonist’s space adventures to complete his main mission and to force a Necromorph outbreak. As in the previous part, Isaac uses a special Resource Integration Gear – special suit, which displays important in-game parameters including health and oxygen level (required for vacuum spaces), and which also serves as a gameplay HUD. In case if one of the scales reaches the zero point, Isaac will die, and the game will be restarted from the last checkpoint.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":16112,"name":"Sleeping Dogs: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bd7/bd7cfccfececba1ec2b97a120a40373f.jpg","description":"Sleeping Dogs: Definitive Edition is a remaster of Sleeping Dogs, an action game about a police officer’s undercover work inside an Asian criminal organization. It features the original game with improved graphics and several expansion packs, including Nightmare in North Point and Year of the Snake.\nYou take on the role of Wei Shen, who joins the 'Sun On Yee' Triad gang and starts to complete different assignments to get to the head of the organization. During the investigation, you will explore different sides of Hong Kong where traditional Asian culture meets neon lights and modern skyscrapers. In Definitive Edition the city's environment is upgraded with huge attention to details and lightning. \nYour way up to the top of the mafia clan will consist of numerous fights, where you can use multiple guns along with melee combat and pieces of the environment. Besides the battles, Wei Shen can use gadgets for exploration, sing in karaoke bars, date women and interact with deeply developed NPCs.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":3771,"name":"Rayman Legends","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/85c/85c8ae70e7cdf0105f06ef6bdce63b8b.jpg","description":"Rayman Legends is a fifth main title in the original series of platform games. The new Rayman chapter is a direct sequel to the 2011 game Rayman Origins. The game is set in an imaginary world inhabited by both friendly and hostile creatures. The main character Rayman, a shapeless magical being, accompanied by his closest friends is expected to protect the fictional world from evil. The story begins a century after the Origins events. Bubble Dreamers’ nightmares as well as the Magician (both are main antagonists) has grown up in their power, so only awakened after the 100-year sleep Rayman and his friends Globox and Teensies are able to stop the terrible villains. As the story takes place in various locations depending on the game stage, the environment, as well as difficulty, differs from time to time. The gameplay is about completing multiple platform levels, collecting lums and defeating enemies. In addition to Rayman, Globox and Teensies players can assume the roles of several new game characters. Rayman Legends also features a co-op game mode.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":17875,"name":"Guacamelee! Super Turbo Championship Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc8/fc838d98c9b944e6a15176eabf40bee8.jpg","description":"Guacamelee! is strongly inspired by colorful Mexican aesthetics and folklore. Your protagonist, Juan Aguacate, used to be a regular farmer until one day he found a magic mask of a Luchador, that is, a Mexican wrestler. His mission is to save El Presidente's daughter who was captured by evil Carlos Calaca. The villain wants her as a sacrifice to open the gates to the World of the Dead. In a cooperative mode, Juan is aided by female luchador Tostada.\r\n\r\nDespite being a traditional Metroidvania platformer, Guacamelee! is also, surprisingly, an open-world game. You can go in any direction in this 2D world. For example, if you climb down, this counts as going south on the map. Action in Guacamelee! is inspired by fighting games like Mortal Kombat, and the controls are very responsive. The monsters are varied and very Mexican: they include traditional Dia de Los Muertos skeletons, feral armadillos, and evil cacti.\r\n\r\nThe Super Turbo Championship Edition adds several new features, such as Intenso mode that makes your characters way stronger for a short amount of time. Health bars above your opponents' heads are introduced. This edition also features new enemies, levels, and even a new boss in this edition.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":5562,"name":"Fallout 3","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a4/5a4e70bb8a862829dbaa398aa5f66afc.jpg","description":"Fallout 3 is a legendary action RPG, which continues the Fallout franchise. Players dive into the events held 36 years after Fallout 2's ending. The game is set in the post-apocalyptic open world known as the “Capital Wasteland.” According to the storyline, by 2277, the whole familiar world finds itself devastated. The cataclysm is the consequence of the nuclear war of 2077 between USA and China. The only people left on Earth are lucky ones, who managed to stay alive on the surface, and those, who made their way to the warehouses provided by Vaul-Tech (like the main character). In the very beginning, the protagonist wakes up inside the Vault 101. His only aim is to find his father who left the warehouse some time ago. On his way, he will contact other survivors (both gangs and singles) and explore entire restoring areas of Washington D.C., Northern Virginia, and Maryland. The game offers countless progress opportunities, so the gameplay is overloaded with various features including types of customization, numerous conversations with NPC’s, side quests – everything that an average player is going to face.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":58755,"name":"Devil May Cry 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9fb/9fbf956a16249def7625ab5dc3d09515.jpg","description":"Devil May Cry 5 is the sixth game in the Devil May Cry franchise and the fifth in its main series. \n\n###Plot\nThe game continues the plot of Devil May Cry 2. The demonic threat seems to have been forgotten, but the demons return, and there are new accidents around the world. Nero and Dante have parted ways, and Nero established his own agency. He also received a new robotic arm made by his engineer Nico. It replaces his Devil Bringer prosthetic that was stolen by a villain. At the beginning of the game, Nero rides his van to Red Grave City in which a demonic tree appeared. At the same time, Dante has a new client, a mysterious V, who hires him to investigate the demonic attacks.\n\n###Gameplay\nAs usual in the Devil May Cry series, the player controls his or her character from the third person view. The game features three playable characters. Dante and Nero make a return, and V is newly introduced. Each of the three characters has a unique fighting style. Nero's prosthetic hand allows him to use a variety of options, such as pulling his enemies closer. Nero also uses his legendary weapons, the gun called “Blue Rose” and the sword named “Red Queen”. Dante, as usual, fights with his swords Rebellion and Sparda, as well as a variety of new weapons, such as chainsaws and a motorcycle. V uses a walking cane as a weapon.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":492,"name":"Yakuza 0","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca1/ca16da30f86d8f4d36261de45fb35430.jpg","description":"Yakuza 0 is an action-adventure game developed by Sega for Microsoft and PlayStation in 2015.\n\n###Plot \nThe game takes place in 1988 in Tokyo. The main characters are Kazuma Kiryu and Goro Majima, who are forced to participate in the power struggle of the Japan mafia organizations. Kiryu is framed for a murder and pursued by a huge mafia family. On the loose, the protagonist tries to prove innocent and reveal the truth behind the so-called Empty Lot conflict. The aim is to follow the plot and make choices based on different strategies. \n\n###Gameplay\nThe game is played from a third-person perspective. The player can explore the world freely. The action is performed in Kamurocho, which is the representation of Kabukichō, Tokyo’s district. During the game, the player resembles the usual mechanics: walking, listening to dialogues and watching cinematics pieces. The action includes side-quests which let the protagonists earn more money and special Completion Point currency; each CP lets the player gain additional bonuses, upgrades, and certain items. The main gameplay modification is battle control. It lets the player switch action styles in the middle of the fight.\n\n###Reception\nYakuza 0 is a prequel of Yakuza, video game series first released in 2005. The original was acknowledged for its innovative gameplay. The prequel followed the success and became favorable as well.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":28623,"name":"Batman: Arkham City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5a/b5a1226bfd971284a735a4a0969086b3.jpg","description":"The plot of Arkham City begins one and a half years after the events of Arkham Asylum. Quincy Sharp, former superintendent of the Arkham Psychiatric Hospital, became mayor of Gotham and created the prison \"Arkham City\". Prisoners of Arkham City are not controlled by anyone in its borders, they are only forbidden from running away ...\r\nThere are all the regular characters in the game - Joker, Two-Face, Catwoman, Ra's al Ghul, James Gordon and others. Each villain individually and all of them together give Batman difficult tasks that move the game forward.\r\nArkham City has an open world. All gadgets from Arkham Asylum are available to the player from the very beginning. Many of them are improved, there are also new ones. The game has a \"Detective mode\" - the skeletons of enemies are highlighted, it is possible to conduct various examinations, for example, tracking the flight of a sniper's bullet. There is also access to a database that tracks villains in the city.\r\nAt a certain point in the story, you can play as a Catwoman. She has an analogue of \"Detective Mode\" - \"Mode of the thief\".\r\nThe visual decision and soundtrack are very atmospheric, soft, but give a clear sense of gloom and horror, entirely in the spirit of the plot and characters.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Rocksteady Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":817974,"name":"Wallpaper Engine","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a7/5a72aed79451d8fbd6a7b82f784002bd.jpg","description":"'Wallpaper Engine' is a customizable desktop wallpaper software available for PC via Steam. Developed and published by Wallpaper Engine Team on October 10th, 2016, it dedicates the program towards the user's tastes and preference for their desktop wallpaper. It features high-definition static images, slideshow backgrounds, as well as animated live wallpapers, with a backlog presenting hundreds of default options and DIY tools. It also has a specialized Android app of the same name, which allows users to transfer wallpapers to their phones.\n\nOfficial Description\n-\nWallpaper Engine enables you to use live wallpapers on your Windows desktop. Various types of animated wallpapers are supported, including 3D and 2D animations, websites, videos and even certain applications. Choose an existing wallpaper or create your own and share it on the Steam Workshop! In addition to that, you can use the free Wallpaper Engine companion app for Android to transfer your favorite wallpapers to your Android mobile device and take your live wallpapers on the go.\n\nFeatures:\n-\n• Bring your desktop wallpapers alive with realtime graphics, videos, applications or websites.\n• Use animated screensavers while you are away from your computer.\n• Personalize animated wallpapers with your favorite colors.\n• Use interactive wallpapers that can be controlled with your mouse.\n• Many aspect ratios and native resolutions supported including 16:9, 21:9, 16:10, 4:3.\n• Multi monitor environments are supported.\n• Wallpapers will pause while playing games to save performance.\n• Create your own animated wallpapers in the Wallpaper Engine Editor.\n• Animate new live wallpapers from basic images or import HTML or video files for the wallpaper.\n• Use the Steam Workshop to share and download wallpapers for free.\n• Wallpaper Engine can be used at the same time as any other Steam game or application.\n• Supported video formats: mp4, WebM, avi, m4v, mov, wmv (for local files, Workshop only allows mp4).\n• Use the free Android companion app to take your favorite scene and video wallpapers on the go.\n• Support for Razer Chroma and Corsair iCUE.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":17126,"name":"Torchlight II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c06/c06d88c35785c8003147cb53c84af033.jpg","description":"Torchlight II is the second installment in the series, and while it continues the story of its predecessor, it also allows new players to jump right into the action-packed roguelike RPG world. The genre itself is well-established already with giants like Diablo series, but Torchlight offers the fresh experience for veterans and newbies alike.\n  The steampunk fantasy world lets players enjoy the lush grass of various beautiful environments, the glowing caves filled with mushrooms, and the endless deserts with their treasures! Lots of different enemies always try their best to stop our adventurers from their goal. From every corner there comes danger, only briefly allowing the players to collect their thoughts and dive yet again in battle with evil.\n  Following Torchlight, the second game starts with chaos erupting from underneath the world. A crazed former hero now takes the lead of hordes of different creatures, and in defeating him and his minions lies the ultimate goal of our new heroes. Take on the mantle of one of the four available classes, and be sure to utilize their might at its fullest. Stay flexible, for the treasure is always surprising, and don’t forget to use your trusty companion as the aid in battle, or as a heavy-packed war mule. Be ready for harsh defeats, or, if you feel like immortal, try the hardest difficulty for the ultimate roguelike challenge. The world of Torchlight is yours to explore!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Runic Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3028,"name":"Beyond: Two Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/07a/07a74470a2618fd71945db0619602baf.jpg","description":"This game is often called an \"interactive film\" - because the proportion between the given story and the possibilities to influence the story is indeed somewhat different than in most games. The game develops between three points in the biography of the girl Jodie Holmes. In these three points, we find ourselves repeatedly. And in general, we see 16 years of her life, from 8 to 24 years.\nJodie from birth has a gift of communication with a disembodied being called Aiden. In this context, the Jodie-Aiden couple can capture people's consciousness, move objects, and even strangle people. At the same time, Jodie is periodically exposed to attacks of vague energies.\nHer parents are not her relatives, they give her to psychiatrists and refuse her. When the family of one of the psychiatrists perishes, Jodie, with the help of Ayden, establishes a connection with the deceased, she can let the living and the dead speak.\nThe CIA is interested in Jodie's abilities and makes her become an agent. She then instructs her on several missions, but Jodie realises that she is being used for criminal activities - and refuses to cooperate with the CIA. CIA agents do not leave her alone, and she destroys them.\nThe game has a lot of interpretations of what is happening in the world of the dead, different people use Jodi's forces in different ways. Jody herself also does not have a clear picture, she seeks and finds real parents, helps different people - but they rarely pay her the same.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Quantic Dream","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]}]