[{"id":19807,"name":"Autumn","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/043/0438413723094df3e5e83f56f95619db.jpg","description":"More than a game, Autumn is a relaxing place for spiritual learning and growth with a soothing atmosphere.\nIn each game you play as a Spirit which depends on the natural world for its progress in life. As you help the world around you to thrive, you receive vital energy(Prana) in return. During the Autumn season, while the trees are shedding their leaves, orbs of Prana are released into the air, which you can absorb. Your own Prana can be utilized to help and change the world around you and to obtain spiritual teachings.\nMore than levels, puzzles or in-game progressions, Autumn’s focus is on the growth of the player. Not the one in the game, but the one in the chair.\nThere are no time limits, no enemies to defeat, no goals to reach… except the ones you set for yourself. Relax, learn, grow… and enjoy Autumn.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nuno Donato","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19652,"name":"StarDrive","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf3/cf35332d1c92577c64d5a40e506abf3e.jpg","description":"StarDrive sets a new benchmark for the  ‘4X Space Strategy’ genre.  Starting with a single planet and a small number of space-worthy vessels, you must venture forth into the galaxy, conquer new worlds, build new colonies and defend your very existence against those who would take what is yours. How you play is your decision. Use diplomacy or brute force. Trade, spy and research your way to galactic domination. Make friends, or create mortal enemies…\nThe heart of StarDrive is its ship design and combat engine.\nStarDrive takes a modular approach to ship design, allowing the player to create custom ships where the composition and placement of ship modules really matters to the performance of a ship.. In combat, if your portside armour is taking a beating, then rotate around and show them the starboard side!  Hide behind a friendly capital ship’s shields; warp into and out of the fray, launch fighters, lay mines, and so much more.Key Features\nReal time gameplay with a seamless zoom from a grand strategic view to a close-up action view\nChoose from 8 beautifully rendered alien races or design your own to lead into the stars; interact, negotiate and forge allegiances on your way to victory\nExpand your empire and colonize all kinds of planets, terraform and populate them and build them into specialized centers of trade or industry\nResearch and unlock an array of technologies to improve your military and industrial capabilities\nControl your ships with classic real time strategy commands or jump into the fray by taking direct ‘arcade’ control of any ship in your empire\nCreate your unique ship designs with the modular ship design system and determine your own fate in battle\nCreate custom fleet formations and set rules of engagement in the easy-to-use fleet editor\nSteal technologies, incite rebellions, or rob your enemies blind with a rich agent-based espionage system\nDeploy ground troops from orbit to defeat the enemies’ last planetary defenses in ground combat\nExplore the rich universe that comes alive with random events, remnant elements, hidden treasures, deep space terrors and late-game threats","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zero Sum Games","platforms":[{"id":0,"name":"PC"}]},{"id":19340,"name":"Half Minute Hero: The Second Coming","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2b/d2b631d1ee0dfbf1b37cd5f1e1c41354.jpg","description":"The world's speediest homage/roast to JRPGs! Can you save the world in 30 seconds?\n\nGet a quest, find those in need, fight through dungeons, earn cash, get cool loot and level up until YOU>EVIL. Don't have enough time? Pay the Goddess to reset the clock and try again! Over 100 mini-JRPGs for you to test your might with! Available outside Japan for the first time ever exclusively on Steam.Key Features:A robust single player mode that features persistent leveling and FIVE separate eras of the Half Minute Hero saga.\nFour-player multiplayer with lobby support so you can see which of your friends is the TRUE hero.\nTime Attack and Infinite Battle Modes with Steam leaderboards!\nA custom map editor (with mouse support) so you can create your own maps and quests. Find, download, edit, and share via Steam Workshop.\nAn art gallery and music player you can unlock as you progress through the game.\nMore fun and charm than should be allowed in a game!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Opus","platforms":[{"id":0,"name":"PC"}]},{"id":18088,"name":"Left in the Dark: No One on Board","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54f/54fb870661fe19cb4d4219bd9cba6e3f.jpg","description":"When private detective Charlotte Austin accepts her latest commission, she immediately knows it will be an unusual one. A bizarre letter from the Mayor of Port Providence arrives asking for help investigating the mysterious disappearance of a missing ship, which has suddenly reappeared without crew or cargo.\n\nDuring her first attempts to solve the case, Charlotte realizes that the reports in the local press about an alleged curse may be more than local folklore. Her encounter with a hooded figure in the supposedly abandoned shipwreck, along with other seemingly impossible events, reinforce her belief that there is more going on in Portsmouth than meets the eye.\n\nDetective Austin must discover the link between the abandoned ship, Devil Island, and the unsolved murder of a local family. Will she discover the curse that is dooming ships out of Portsmouth, and be able to stop it before more people die?","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Moonrise Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":16340,"name":"Chess Knight 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c1/8c16092d3907aad94b69d445a4231d43.jpg","description":"Chess Knight 2 is the classic board game of Chess reimagined for the casual gamer looking to learn and to grow with the most popular game in history. A medieval world of strategy and tactics await you to engage in epic battles of wits as you master the moves and the strategies in a conquest to claim the kingdom of Chess. Learn to play in this fun, colorful and intuitive download offering multiple levels of difficulty. You can play in top-down 2D or fully animated 3D mode in a challenge against the computer or a good friend or relative. An introduction to Chess is included and the visual guide to legal moves provides help if you are stuck!KEY FEATURES2D & 3D gameplay\nSingle- and two-player mode\n4 levels of difficulty\nUnique animated Chess pieces\nUndo recent moves\nVisual guide to legal moves\nIntroduction to Chess","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":11809,"name":"Demise of Nations","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/601/601b0624999cf6edc575d7359d7a30c2.jpg","description":"Demise of Nations is a 4X turn-based grand strategy wargame covering the rise of Rome till the fall of modern civilization. Command your armies in one of the many ancient and modern countries including the Roman Empire, British Islands, Germany, Japan or the United States. From Rome to modern nations, you create your own warring experience. Wage colossal wars solo, against the AI, or take on your gaming friends in cross-platform multiplayer games. Form alliances and fight co-op style with the AI and other players for ultimate victory.\nRange of functionality is comprised of trading, diplomacy, expansion, conducting research, exploration, managing resources, building, food distribution, governing and city management. Units at your disposal are Scouts, Swordsmen, Spearmen, Archers, War Elephants, Galleys and Longboats amongst others. Demise of Nations incorporates changing weather patterns such as shifting climates and storms. Rain during summer providing much needed humidity for your crops, while snowy winters will proof if you are ready for the challenge. Assemble your armies and take on the world and achieve greatness in this epic historical strategy game.\nTurn-Based Grand Strategy covering Ancient to Modern Times.\n4X Strategy: eXplore, eXpand, eXploit, and eXterminate.\nChallenging AI based on Genetic Algorithm.\nWeather and Seasons including Snow, Rain and Storms.\nDiplomacy, Research, Trade and City-Building.\nCross-Platform Multiplayer/Hotseat-Play including co-op team games.\nRandom Map Generator.\nNations: Roman Empire, Gaul, Germany, Japan and the United States amongst others.\nTroops: Swordsmen, Archers, Horsemen, Tanks and Fighter Planes amongst others.\nShips: Galleys, Aircraft Carriers, Battleships and Submarines amongst others.\nPlayed as WE-GO Turn-Based Game allowing for an Unlimited Number of Players.\nHigh Scores, Playing Statistics and Achievements.\nEngaging Music and Sound Effects.\nThe game includes one map for FREE. Other maps are available for download and cost $3.99+ for single maps or $19.99 for all maps. Multiplayer games are generally free to join. Hosting multiplayer games costs 5 cents/game. There is no subscriptions. This game is NOT pay-to-win.\nIf you like this game, please also try our other strategy games. You should be able to find the games in the same marketplace!\nThanks & Enjoy the Game!\nnoblemaster ]:-D","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noble Master","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":10126,"name":"BallisticNG","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f12/f122e5b732aaeeb9e18e2deddc8a9657.jpg","description":"BallisticNG is a free anti-gravity racing game that takes the genre back to its roots. It's fast, technical and unforgiving. Pick the ship that's right for you and become the best pilot the AGL has ever seen. The game sports five increasingly difficult speed classes across a large range of tracks. You are provided with an assortment of weapons that you can use to damage or even eliminate your opponents.\nImport your own ships, build your own tracks. BallisticNG provides you with all the tools you need to create your own content and share it on the Workshop. The modding tools are targeted at more experienced users and provide you with all the freedom you need to create all the endless content you could desire. A lot more modding possibilities will be coming down the road too!\nBallisticNG is built on emulating early 90s 3D rendering with a few modern extras thrown on top for good measure. From low poly meshes and low-res textures to wobbly vertices and primitive lighting, BallisticNG goes all out on looking like a game of decades past.\nBallisticNG brings back the classic Wipeout formula. You'll glide, bounce, drift and scrape around the tracks at insane speeds. Timing and muscle memory is everything, slip ups can be made but mistakes will not be forgiven. Manage your pitch to stay at maximum speed, keep a good racing line to ensure you hit all the speed pads and of course don't hit the track floor.\nIf classic physics aren't to your liking, you can switch to a faithful re-creation of the modern Wipeout physics with the flick of a switch.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Neognosis","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9958,"name":"Kabitis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e44/e44d52f94dfee4945c64d8a2316e7c2c.jpg","description":"Your Way To Play\nAn evil robot named Dron, was ordered to kidnap humans, but a young man managed to escape the clutches of Dron, his name is Aike.\nKabitis realized what had happened and decided to go after Dron and rescue the prisoners. Aike decides to join Kabitis in your search.\nYou can play up to two players and use gamepad.\nIt has about 30 stages, including bonuses and additional arenas phases that can be unlocked for the Battle Mode.\nIn another additional feature that can be unlocked.\nDuring the story mode you can collect crystals, buy items from the store,\nMake points, fighting enemies, Kabitis and Aike become more stronger.\nYou can buy bees, each has its function.\nYou can buy and sell time, for each phase has a timer that Dron put the exit gates.\nThe game has a variety of items such as the magic box.\nAnd beware of the thorns, by touching them you get hurt or may even poison!\nIf something happens that you just take a little juice, but be quick.\nKabitis is a fun game that brings new challenges at every step and if you are having trouble getting somewhere\nor want to achieve something that is difficult to achieve, you can use the tools of the store, such as New Platforms so you can build your own way.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"André Bertaglia","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9946,"name":"Water Bears VR","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00c/00c3453e785a2a4dc54b4ae4aaf70274.jpg","description":"Step into the Vive and use your own two hands to reroute, remix, and redirect water flows to free trapped water bears! Water Bears VR is the next evolution of Water Bears, winner of the 2015 Serious Play Awards “Best in Show” and the 2015 CTR “Editor’s Choice for Excellence in Design.”\nEach puzzle starts with sad water bears that are desperately in need of water. Help them by building and rebuilding water flows using an ever-increasing variety of pipes. Walk around the puzzles in real space, viewing them from all sides to get ideas. Manipulate myriad colors, test your spatial reasoning, and make the most of your limited resources. There are dozens of puzzles and an awful lot of thirsty water bears that need your help!\n[Standing / minimum playspace size: 2.3m x 2m / ]","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Schell Games","platforms":[{"id":0,"name":"PC"}]},{"id":710,"name":"Surgeon Simulator: Experience Reality","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24e/24efde6484e7b7b50e0bf840ac6d9f46.jpg","description":"Surgeon Simulator is bringing the ER to VR! The most critically acclaimed and infamous surgery simulation game as you have never seen it before! Built for Vive and featuring all of the surgeries and twisted humour of the original favourite plus a few new surprises…\nSurgeon Simulator: Experience Reality transports you into some of the most unlikely and possibly unsanitary surgeries possible. Bob’s life is in your hands in this darkly humorous VR game, taking you closer to bloody surgery than you possibly ever wanted to go! From the operating theatre, to the back of an ambulance, to outer space, your patient’s welfare will be in your virtual hands.\nIn addition to the original surgeries we’ve added exclusive new features for you to play with in VR. How about brain surgery in the dark? What about a hand-held camera to admire your surgical efforts from any angle? New achievements? It’s all in Surgeon Simulator: ER!\nWhatever you do, don’t press that button in space!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":849517,"name":"Alone in the Dark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/719/7197c4abfd5cfac909548dce23b74daa.jpg","description":"Psychological Horror meets Southern Gothic in this reimagination of the classic survival horror game, Alone in the Dark\r\n\r\nThis love letter to the ground-breaking original lets you experience a haunting story through the eyes of one of two protagonists. Play as either Edward Carnby or Emily Hartwood and explore your environments, fight monsters, solve puzzles and uncover the uneasy truth of Derceto Manor…\r\n\r\nDeep in the 1920’s south, Emily Hartwood’s uncle has gone missing. Together with private investigator Edward Carnby, she embarks on a journey to Derceto Manor, a home for the mentally ill where something is lurking. You’ll encounter strange residents, nightmarish realms, dangerous monsters and ultimately uncover a plot of rising evil. At the intersection of reality, mystery, and insanity, an adventure waits that will challenge your core beliefs. Who can you trust, what will you believe, and what will you do next?","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Pieces Interactive","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":618709,"name":"Slime Rancher 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d37/d3764044c9ecac93d4bafeb616186604.jpg","description":"Slime Rancher 2 is a sequel to the award-winning, smash-hit original that has been enjoyed by over 10 million fans worldwide. Continue the adventures of Beatrix LeBeau as she journeys to Rainbow Island, a mysterious land brimming with ancient technology, unknown natural resources, and an avalanche of wiggling, jiggling, new slimes to discover.\n\nAs Beatrix attempts to unravel the island’s secrets and uncover its true purpose, she’ll build, ranch, and farm within a beautiful conservatory, whose sparkling glass walls give her full view of the prismatic paradise she now calls home.\n\nFeatures:\nExplore a Vibrant New World\nContinue the slime ranching adventures of Beatrix LeBeau as she journeys to a mysterious rainbow-hued island.\nDiscover Wiggly New Slimes\nCollect slimes never seen before on the Far, Far Range, like the bouncy cotton slime or the aquatic angler slime.\nBuild a Conservatory on Rainbow Island\nEarn newbucks from slime plorts and collect resources on Rainbow Island to upgrade your vacpack, build new gadgets, and expand your conservatory.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Monomi Park","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":61916,"name":"OH MY GOD, LOOK AT THIS KNIGHT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40b/40b066e386dacfd17850f899d821860f.jpg","description":"The Knight.\nThe one who guards the crown.\nThe one who protects innocents at all costs.\nThe one who makes justice to prevail.\nToday's sirs don't remember any of it...\nThey drown in loathness, only able to feast and prance on their steeds.\nIt is time to remind them who the knight is.\nAnd when the last dragon is slain, when good triumphs and my glory spreads over the lands, people will hail:\nOH MY GOD, LOOK AT THIS KNIGHT!\nYou are a brave knight, who must to help villagers solve their problems. Grab your shiny helmet and trusty sword, gather all the valor and honor you have, and experience possibly the most heroic fifteen minutes in your life! Smash cabbage, destroy scarecrows, battle evil demons and fight for justice!\nFEATURES:\n- RPG gameplay.\n- 5 unique missions.\n- An epic story.\n- Lots of secrets.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Foxoft","platforms":[{"id":0,"name":"PC"}]},{"id":20213,"name":"HIS (Heroes In the Sky)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/715/715babdc554cc1d2aa4d452e951e12d2.jpg","description":"About the HISHeroes in the Sky is an intense airborne MMOTPS (Massively Multiplayer Online Third person Shooter) that combines high impact PVE and fast paced PVP as it chronicles the events from the beginning to the end of World War II. PVP combat is taken to a new level as players must not only worry about the basic danger from in front, behind, and to the sides, but also from above and below.\n\nCannon fire, machine gun blasts, missiles, and bombs flood the skies as up to 16 players shoot it out for air superiority! If that isn't enough for you, soar across the sky recreating critical battles of the European and Pacific fronts to help your side take control in the occupational war.\n\nCities will be bombed, boats will be sunk, blimps will be blown to pieces, fighters will be torn asunder; all this and more will unfold as players compete to become the top Ace in WWII.Key Features\n- Various scenarios (more than 200) based on real operations during World War II\n- Air battle; Dynamic maneuver and Dog fighting make feel romance\n- more than 600 real or exist on paper Airplane\n- 1~8 players can co-op on mission\n- Raid mission with 1~16 players\n- Occupation war; maximum 35 players can fight each other\n- more than 1300 various item can use\n- variable choice with strengthen Item and Airplane\n- HIS is compatible with a range of joysticks, as well as being fully optimized for mouse and keyboard, and gamepads","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GameUS","platforms":[{"id":0,"name":"PC"}]},{"id":17544,"name":"Attack on Titan / A.O.T. Wings of Freedom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ba/6ba340160880414da6c85a9433bdc9d3.jpg","description":"An international hit anime \"Attack on Titan\" has come to Steam®!\nBattle is joined between the man-eating Titans and Eren and his companions. Experience the illusion of being in the anime, and controlling the flow of the story.\nThe story from the anime, with a few original twists, is yours to experience!\n* The images are from an in-development build and may differ from the final version.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":16318,"name":"Ludo Supremo","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb7/fb7d2b30184683f72c4cbb9f4824c9ee.jpg","description":"Ludo Supremo is the classic board game of Ludo reinvented in beautiful 3D for the next generation of casual players seeking a fun gameplay experience with friends. You can play alone or compete against 3 opponents in a challenging game of tokens and chance. In Ludo Supremo, each player has to race 4 tokens from the starting point to the finishing point, according to the roll of the die.\nLudo is similar to many other games involving cross and circle, especially the Indian game of Pachisi. Players take turns to play. At the beginning of a game, you must throw a 6 before it becomes possible to navigate your colored token from its starting position to its starting square. After that, in each of the subsequent turns, your token may move forward for one to six squares as per indicated by the throwing die. If you throw a 6, you may choose to introduce a new token in the starting square or decide to navigate an already active token forward. Throwing a 6 also gives a bonus turn. The winner of Ludo Supremo is the player who successfully navigates all 4 tokens to the home area on the board.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16316,"name":"Fantastic Checkers 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd19fe9cd6533a60d0475ecdafb7563d.jpg","description":"Fantastic Checkers 2 is a modern version of the classic strategy board game set in an extraterrestrial environment! The objective of the game is to capture opponent pieces by diagonally jumping over them to eliminate them from the board. The game features a spinning board with fully animated space monsters on each side. You can play against the computer in three levels of difficulty or take on your friends and family in a local two-player, turn-based bout. You can play in classic top-down 2D mode or opt for the unique 3D mode, and each game presents a random set of playable characters.KEY FEATURES3 Levels of difficulty\nLocal turn-based player-vs-player action\n2D & 3D rendered gameplay\nFully animated board pieces\n28 adorable monsters included","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16315,"name":"Fantastic 4 In A Row 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07a/07a3cc7f8d9515b628e93c077d1bebd8.jpg","description":"Fantastic 4 In A Row 2 is a modern version of the timeless classic, played on a distant planet with beautiful graphics and music. Participating players take turns dropping colored discs from the top of the screen into a vertically suspended grid. The pieces fall straight down, occupying the next available space within the column. The objective of the game is to connect four of one's own discs of the same color next to each other vertically, horizontally, or diagonally before your opponent. The game includes 4 levels of difficulty in single-player mode, a 2-player mode and even comes with a unique 3- and 4-player mode using multi-sided grids. Your winning row can now wrap around the sides in 3D! This is a great way to play with family or a group of friends taking the experience to brand new levels.KEY FEATURESClassic Four-In-A-Row reinvented\nBeautiful 3D graphics and effects\nWonderful audio and music\nSingle-player mode with 4 levels of difficulty\nLocal turn-based 2-player mode\nLocal turn-based 3- and 4-player modes on multi-sided grids","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":14755,"name":"The Samaritan Paradox","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/adac8ff3f23f8f7bf79e6cc3a700d19d.jpg","description":"A writer has died. His daughter seeks the help of you, Ord Salamon, to find his secret last novel. During the search, questions will emerge. Did her father really kill himself? What is the secret novel all about? What is going on at the island of Fardo? Crack codes, decipher secrets & find a lost fortune in this exciting adventure for Windows PC.\n+ Old-school style point & click adventure\n+ Full English voice acting, 2000+ lines\n+ Hand-drawn art & animation, 60+ rooms\n+ Original soundtrack by Lannie Neely III, 45+ mins\n+ Additional languages (text only) included, EFIGS\nThe Samaritan Paradox is set in Sweden in the 80's. Ord Salomon has agreed to help Sara Bergwall find the book her father, Jonatan Bergwall, wrote before he died. During the course of this treasure hunt, he learns that Jonatan was investigating the weapons industry, and more specifically some covert affairs with foreign dictatorships.\nBut more questions arise. What is the book about, and why does Sara want Ord to find it for her? Did her Alzheimer's-stricken mother know the secret before she grew too demented to share it? And how did Jonatan actually die?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Faravid Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10768,"name":"Hero Zero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc2/dc2f827c1e044f96349ff4af9adda285.jpg","description":"Hero Zero is one of the most successful free to play Online Multiplayer RPG games. Create your own superhero character in a funny, exciting and fascinating universe with hundreds of villains, criminals and bosses. Fight and stop crime in different parts of the world to become the most powerful and celebrated superhero in the universe. Only you can bring justice and peace back to the world. Unlock hilariously powerful gadgets and upgrades for your hero to equip him for epic battles and challenging single player missions.\nBuild your own Hide-Out as a secret base, which will be placed under your house in Humpreydale. Upgrade and modify your shelter in order to get better rewards and increase efficiency.  Compete with other players to find out who build the best Superhero Hide-Out.\nJoin or create a team with your friends and build your own headquarters to fight more efficiently against all evil villains, criminals and bosses. Compete with other players and teams in exciting and cool multiplayer fights. Nobody can stop you from climbing the leaderboard on your challenging mission to become the most successful superhero in the world.\nFeatures:\nMore than 26 million players!\nRegular free updates and new content\nFree to play!\nCreate and customize your own hero\nBuild up your own superhero team!\nChallenge other heroes in PvP and team battles\nFunny and fascinating storyline\nEasy to learn gameplay\nAppealing Graphics\nReal time villain events with thousands of players\nStart your epic and funny adventure now for free!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playata","platforms":[{"id":0,"name":"PC"}]},{"id":9921,"name":"Castle Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df3/df3f410b5faefbfd7d4e57773459c2dc.jpg","description":"An epic adventure awaits you in Castle Story, a strategy game where you command friendly creatures called Bricktrons. Have them explore, carve, dig and gather resources from vast, spectacular floating islands, reshaping the voxel-based world to your desire!\nDesign and build any structure you can imagine! From mighty and legendary castles to sprawling Bricktron villages. Beware, your Bricktrons will have to take arms and defend themselves against mysterious creatures, the Corruptrons. Build catapults and hurl explosive barrels at the invaders, or lure them into strategically placed traps! The physics system will also challenge the sturdiness of your architecture! A tower whose foundation is destroyed will crumble to the ground realistically.\nCastle Story is also a multiplayer experience! Challenge your friends to a round of Conquest or join forces with them to repel the enemies in the Co-Op Invasion gamemode. Of course, you can also group up in sandbox and build together!\nThe maps in Castle Story are meticulously hand-crafted by the developers and we’re giving you access to the same tool we use! Create your own worlds with our awesome World Editor, share them with the community and try out other player-made maps!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sauropod Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":4362,"name":"Resistance: Burning Skies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c14/c14bb7d5862b5471c187bb6a1a731fd6.jpg","description":"As New York fire fighter and National Guardsman Tom Riley, you're about to come face to face with the brutal Chimeran invasion force in this blistering shooter built from the ground up for the PlayStation®Vita.  The latest installment in the hugely successful franchise focuses on the initial days of the assault by overwhelming Chimeran forces on the U.S. eastern seaboard and intense multiplayer.\n\nKey Features:\n• First fully portable, true FPS experience only available on the PS Vita system: dual analog sticks provide precision aiming and navigation, front touch screen functionality allows for easy to use primary and secondary weapon fire\n• Hallmark Resistance experience that stays true to the franchise with classic Chimeran enemies, trademark weapon wheel, and a robust multiplayer experience\n• Increased level of weapon customization, with returning favorites as well as all new weapons - all with a PS Vita system twist\n• Engaging single-player campaign and fully competitive multiplayer experience across 6 maps and 3 modes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":118982,"name":"Love Letter (itch)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31b/31bedc9e7e9bfce8b1784eca9e6b22b4.jpg","description":"Made for GGJ2018 with the theme \"transmission\"\n\nA love story at a bus station\n\nThe boy is too shy to say hi.\n\nPassengers at the platform are standing by.\n\nChange the order of the queue to let the love letter fly.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nomad Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60101,"name":"STEINS;GATE ELITE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/785/785a779cf35486a6fb89ad416d79a1f5.jpg","description":"STEINS;GATE ELITE follows a rag-tag band of tech-savvy young students who discover the means of changing the past via e-mail using a modified microwave. Their experiments in pushing the boundaries of time begin to spiral out of control as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and John Titor, who claims to be from a dystopian future.\nKey Features\nFully Animated Adventure – Indulge in all the beautiful animation from the STEINS;GATE anime, plus newly created sequences for certain endings.\nA New Way to Time Leap – Experience the world of STEINS;GATE with this remastered, ultimate version that features newly animated sequences for certain endings.\nBranching Storylines – Every choice you make has its own consequence, shifting the world line closer or farther from reaching 1% divergence, and providing a multitude of endings.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"MAGES","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":36797,"name":"Sacred 2: Fallen Angel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13b/13b4c3f9f86f02cd0077b2a798ffa7cb.jpg","description":"T Energy has been flowing through Ancaria since time itself. This mysterious power forms the beginning of all life, is the source of all magic and the origin of all thought. For an era, it was the angelic Seraphim who watched over the T Energy and therefore over the fate of the entire world. They passed their knowledge on to the High Elves, so that they could benefit from T Energy. But the High Elves let the power over T Energy tear their society apart, and war and strife broke out. Worse than that, the T Energy itself went out of control, turning negative and creating destructive evil in the land. The nobility as well as the clerical caste of the High Elves struggled to seize power over the high-elvish imperium, so that they alone might hold the T Power in their rule. The land once more faced with war; a war that was much larger with more far reaching consequences than all previous wars and battles. Two thousand years before Shaddar, the cry for heroes arises to avert this war and to regain control over the T Energy. Will those heroes prevent the world from lapsing into final chaos, or will they instead deepen it with their actions?","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":35646,"name":"Warhammer 40,000: Dawn of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/16f/16f2f287ad8bbbd654cf76be4da52c04.jpg","description":"Prepare yourself for the grim, dark future of the 41st millennium, where alien races battle mankind for galactic domination in a universe of unending war. Personalize your armies with a revolutionary unit customization tool that gives you the ability to choose your armies insignias, banners, squad colors and names.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":28730,"name":"2010 FIFA World Cup","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/173/173104f5d0e628698cf757b43a2c0bdd.jpg","description":"Experience all the emotion and passion of the world’s fiercest national rivalries as you live the dream of competing against friends from around the world for the 2010 FIFA World Cup South Africa™. Take on the challenge of leading your home nation from qualification right through to a virtual re-creation of the final with all the pageantry, drama and excitement of the official tournament.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22461,"name":"Midnight Mysteries 3: Devil on the Mississippi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/666/666409e4c56cfe9c1fa4b4d1a6decd3d.jpg","description":"Down by the deep and muddy Mississippi, something’s not right. A ghostly riverboat brings to light a new conspiracy for players to unravel in this all-new Midnight Mystery.\nMark Twain’s ghost has come to you seeking help from an evil that has been stalking him in the afterlife.  Trace the steps in Twain’s past that led to a lifetime of anguish.  Twain’s passion for literary history reignites a controversial debate about the true identity of Shakespeare; the age-old question resurrects a series of malevolent characters.  After waking an unexpected evil, Twain sets about to rid his time of the darkness, but the plot only thickens.  With Twain’s help, you have to unravel the connections to try and set history straight while dangerous forces loom.\nWho wrote the works of Shakespeare? And just how did Mark Twain get caught up in a strange Elizabethan rivalry all those years later?  Find out in this Midnight Mystery!\nKey Features:\nComplete all-new adventure missions by searching through hidden objects for tools, collecting additional tools to solve brain-teasing puzzles and interviewing apparitions from the past\nFigure out the connection between humorist Twain and the Elizabethan Shakespeare\nDetailed hint system to help you at any step along the way\nCollector’s Edition Includes:\nExclusive Bonus Mission! Explore all of Twain’s secrets\nHelpful fully-integrated Strategy Guide\nPeek behind the scenes with a treasure of Concept Art\n12 Beautifully illustrated Wallpapers\nBonus “Dem Bones” Game Mode\nExplore the Panic Room to relive all the special effects","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21655,"name":"Selfie: Sisters of the Amniotic Lens","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb1/bb1a62d6334ac4fbb8aaa88274c7c6eb.jpg","description":"The endless, halcyon days of  \"Nauseous pines\" summer of love are over, the travellers and minstrels, dreamers and drug dealers have gone.\nIt is now 198X, you wake up in a very bad situation. You were the \"Sisters of the amniotic lens\" and now it's time to face what you did to the minds of the naive all those years ago.\nTurn off your mind, relax and float down stream, it IS dying\nStory driven non-game with space exploration elements dealing with the dangers of the radicalization of the vulnerable .\nEngage with other peoples deepest and darkest pleas in deep and meaningful retro-future play-by-mail mmo/social network.\nThe most advanced fly A.I. of all time utilizing not only their random state but stable route calculating sense of smell.\n\"Mix tape\" of music by the award winning No-wave/industrial and avant-folk  siren Jarboe.\nQuantum physics, metaphysics and retro-future tech combine to immerse you in a nightmare world.\nConcept and story by the TIGA award nominated Dylan Barry\nFull suite of 198X teletext by award winning artist Dan Farrimond (ITAF, British Tate)\nAdditional art and lucid dream exploration by Eye of sic\nGuest starring psychonaught sirens Neurosoup (Krystle Cole) Christina Martine and introducing Christine Brookes\nSpecial guest appearances by members of the Rail slave games community and Jarboe herself.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rail Slave Games","platforms":[{"id":0,"name":"PC"}]},{"id":21105,"name":"Final Slam 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d6/9d6808b7bc6ab57424ce4565a259677b.jpg","description":"MESSAGE FROM DEVELOPER: Thank you to all Final Slam 2 players!  Please click \"Read More\" in the description and scroll to  \"Message From Developer\".\nCustomize your fighter (80 slots to save your avatars) with tons of different options and get ready to fight into the Championship.\nFinal Slam 2 is a PC fighting game that allows you to create your own fighter and win the Final Slam championships or play through the official Final Slam story in story mode. The game is packed with over 40 in-game fighters, but you can still create your own fighters by customizing his or her attire, moves and stats. You can even adjust the Artificial Intelligence of your fighter! Create yourself. Create your friends. Create your enemies. Create casual guys, ninjas, movie stars, wrestlers, shaolin monks, kung fu fighters, boxers, warriors, robots, game characters and even monsters. Then fight!Game Features Creator Mode:\nIn the creator mode, you can create a wide variety of fighters.  There are tons of different body parts, attire, fighting moves, throw moves and special moves to choose from.  The fighting moves are animated following several martial arts, brawling and wrestling moves.  The special moves comprise of different styles such as magic, elemental, Kung Fu, gadgets and wrestling.  You can also control the actions of the fighters when they are being played by the computer by changing the AI settings.  You will have 80 slots to save your created fighters.  All fighters can be stored/exported as plain text format slamcodes, so you can copy the slamcodes of the fighters and save them outside the game or share them online with other players. You can also import fighters created by other players by inputting the slamcodes that are shared by other players online!\nStory and Versus Mode:\nFight the evil that is threatening Earth, or fight individual matches against the computer or a friend in versus mode.  The fight arena is zoomable, with blood effects.\nFinal Slam Mode:\nEnter the Final Slam mode against 80 to 100 fighters and fight up the rankings.  There are 3 different titles to win.  Get up to the top and win the World Heavyweight Championship!\nArcade Mode:\nSee how good you are by fighting opponent after opponent and tracking your win/loss record.Message From DeveloperHi, I am Josh the developer of Final Slam 2.  I would like to thank all of you who tried and played the game, like or dislike it.  A lot of the players dislike Final Slam 2 and if you compare it to other full-blown mainstream competitive fighting games and you don't like it, well, your dislike for the game is justified and I understand.  With very limited budget and with only one person working on the game (which is myself), as opposed to bigger-sized indie or mainstream companies, I understand that I cannot provide the best graphics, gameplay and most modern features to satisfy the hardcore fighting gamer.  Therefore, I decided to make it more of a casual game and focus on the uniqueness of the game that not many fighting games have.  And this uniqueness comprises:\n1. the character creation mode with speed creation settings\n2. Final Slam Season Mode where you can win titles and fight up a league (fight with characters you created as well)\n3. the automatically-generated AI fighters in season mode.\nOther features include the ability to export your fighter to a text string that can be saved and shared anywhere you like.  Therefore, it is possible to create an unlimited amount of characters.  Some players have had a lot of fun playing the game, but some haven't and others don't even care about what the game has to offer.  But anyway, I accept all opinions and judgment about the game and welcome you to try it out at a low cheap price.  You can request for a Steam refund if you feel it is not for you.  Thanks again.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tamugaia","platforms":[{"id":0,"name":"PC"}]},{"id":20632,"name":"Space Legends: At the Edge of the Universe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bc/2bc82c072c5b33a4653a3836ec746c69.jpg","description":"Some places are best left alone even if advances in space travel make visits to remote parts of the universe a possibility. See what's at the far end of the universe and plan your escape. A breathtakingly exciting expedition to a distant world ventures into uncharted territory - on a faraway planet, total destruction threatens ALL.\nJoin Elizabeth Campton and her close colleague Steve on a routine voyage that turns into a real adventure. As an exobiologist and space explorer, Elizabeth is no stranger to danger. Still, the threats she encounters are more than she thought could ever face all at once, especially with her dear friend Steve by her side.\nFrom bad weather, to emergency ship repairs, to landing in jail, to healing a princess – Elizabeth has found herself in a series of binds. Then, it gets worse! A comet is on a collision course with the planet! Everyone is in grave danger. Elizabeth gains permission to visit a forbidden deserted city, where she finds a transport ship that can save everyone, but it's in disrepair.\nYou can save the entire world. In a new dimension where the future, past and present intertwine, only your skill and cunning can bring you back home. An exciting galactic drama will challenge your every move. Escape from the Far End of the Universe!\nFeatures\nA thrilling Sci Fi adventure featuring indelible characters\nBeautifully detailed hidden object scenes and locations to explore\nDiscover an in-game journal and find clues\nTricky puzzles to solve, mini-games and more","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red Hedgehog","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19841,"name":"Eco - Global Survival Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/5343f16115d76765856af7aa4e830cac.jpg","description":"Enter the world of Eco, where you must team-up to build civilization and prevent a disaster, using resources from a fully simulated ecosystem, where your every action affects the lives of countless species.\nWill you and your fellow builders collaborate successfully, creating laws to guide player actions, finding a balance that takes from the ecosystem without damaging it? Or will the world be destroyed by short-sighted choices that pollute the environment in exchange for immediate resource gains? Or, do players act too slowly, and the world is consumed by a disaster that could have been avoided if you developed the right technology? In Eco, you must find a balance as a group if the world is to survive.A world-survival game Eco is a survival game in a global sense, where it is not just the individual or group who is threatened, but the world itself. The world of Eco will be home to a population of thousands of simulated plants and animals of dozens of species, each living out their lives on a server running 24 hours a day, growing, feeding and reproducing, with their existence highly dependent on other species.\nEnter humans into this equation, and things get complicated. It is the role of players to thrive in this environment by using resources from the world to eat, build, discover, learn and invent. However, every resource they take affects the environment it is taken from, and without careful planning and understanding of the ecosystem, lands can become deforested and polluted, habitats destroyed, and species left extinct.\nIn the extreme, the food supply of the ecosystem can be destroyed, along with all human life on it, resulting in server-wide perma-death. Eco is a game where the player’s actions have meaningful consequences.\nEverything you do affects the ecosystem, and players can destroy their food supply and world (server-wide permadeath)\nCreate a player-run government to make decisions as a group, proposing and voting on laws\nUse data gathered from the world to propose and vote on laws as a group. Debate with scientific argumentation.\nCreate a player-run economy that allows you to sell not only good but services in the form of server-enforced contracts (simulating a player driven quest system).\nPvP takes the form of a player-run criminal justice system.  Breaking the player-made laws can result in arrest and punishment.\nYour food level determines your skill-increase rate, making food very important and tying players directly to the ecosystem from which it comes.\nA game with goals higher than entertainment. We plan to build it for schools as an augmented classroom world students share.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Strange Loop Games","platforms":[{"id":0,"name":"PC"}]},{"id":19480,"name":"Qora","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73c/73cc53930d00d012acca1f8b7b293386.jpg","description":"\"One of 2014's best games\"\n- Gary Bailey, GertLush Gaming\n\"I came away with a profound sense of my own mortality and that’s precisely the sort of thing that [Qora] might inspire me to explore.\"\n- Adam Smith, RockPaperShotgun\n\"[Qora] has the same quirk and charm of old-school RPGs and adventure games\"\n- Chloi Rad, Indie Statik\nBeautifully realised, and implementing stunning pixel-art graphics and a wonderful low-fi soundtrack, visionary filmmaker Holden Boyle's first video game Qora is a passionate homage to the past adventure game greats.\nSettling in a new village tucked away amongst a valley, you will explore unknown mysterious landscapes, harnessing a strange mystical power hidden there.\nAn absorbing story-driven experience, Qora is an unforgettable journey that will continue to burn bright in your mind even after it is over.\nFeaturing many varied and gorgeous pixel-painted landscapes, Qora's world is full of intrigue and beautiful mystery\nA powerful low-fi soundtrack accompanies your journey, punctuating the setting appropriately\nGenuinely amusing and charming characters/dialogue will ensure that you speak to every last NPC\nA mysterious power enables you learn more about your surroundings and explore the secrets hidden among the valleys\nMultiple endings give you a reason to explore the game all over again","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Holden Boyles","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19395,"name":"Sacrifice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/703/7034b1d8b8e88e9873e2abd8830d62b1.jpg","description":"Sacrifice is the acclaimed real-time strategy game that focuses on combat instead of resource gathering. The only two resources you'll need to worry about are mana and souls. Need more units? Capture the souls of your enemy. Cast spells of awesome power. Choose which gods to support and you will be rewarded with a different selection of spells.\nBanish your enemy by sacrificing one of your allies at his altar...","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Shiny Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16717,"name":"Fire","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4dd/4dd0b8b28edc7dd99e343c1476260755.jpg","description":"FIRE is a puzzleventure with intuitive puzzle design. Without losing many words it tells a savagely hilarious story. Journey into the Stone Age and face the most challenging task of this era: The search for fire!\nThis story's hero is the lovably chaotic Neanderthal Ungh who dozes off during his very first night watch. The next morning, the catastrophe ensues: the fire's gone out and Ungh is banished from his village. Now you have to help Ungh finding a new flame, searching every corner of the Stone Age world. No matter if he has to search the insides of a dinosaur, smoldering volcanoes or even through time itself, there is no place Ungh wouldn't look for new fire.\nOne click or swipe and your environment comes to life. A small dash of logic and you'll be able to solve any puzzle and there will be no limit to your exploratory spirit while interacting with the game's world: fire coconuts from a mammoth's trunk, turn into an animal or save the fair maiden from the Octo-Boss' grasp.\nNo text or dialogue at all\nCoherent and intuitive controls\nExplore a lovable, vividly animated Stone Age world\n10 beautifully hand-drawn sceneries\nAtmospheric soundtrack by the composer of \"The Night of the Rabbit\" included with every purchase\ngaminglives.com\n„It’s [...] an intriguing evolution of the genre”\nhttp://www.gaminglives.com/2014/07/18/fire-preview/\n4players.de\n„After the presentation I would have loved to start right away.“\nhttp://www.4players.de/4players.php/dispbericht/Allgemein/Vorschau/35412/80674/0/Fire.html","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16519,"name":"The Sad Story of Emmeline Burns","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/752/752a636e3ef5c351700f4752e921269d.jpg","description":"A free game created by Ebi-Hime, author of Asphyxia, The Way We ALL GO and Strawberry Vinegar, TSSofEB is a free yuri (girls' love) game created for a game jam.\nAs the saying goes, dead men tell no tales. They only leave tales behind.\nToma Andrews, aged 14, has always felt like an outsider. She enjoys spending time in graveyards, and feels more comfortable among the dead than the living.\nThat is, until Toma meets a strange girl in her local graveyard who might be a real ghost.\nThe girl asks Toma if she will stay for a while and listen to a story. A story about a girl called Emmeline Burns, who died a tragic death back in 1851.\nToma is compelled to listen, but at the same time, she feels uneasy. After all, what can she do? How could she ever hope to help somebody who has already died?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ebi-hime","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13611,"name":"CastleMiner Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6eb/6ebc1264360068fb353e8f3d4b6eb8d8.jpg","description":"CastleMiner Z is an online coop survival horror game in a block based environment. Travel with your friends in a huge, ever-changing world and craft modern weapons to defend yourself from dragons and the zombie horde!\nGame PlayCastleMiner Z is an infinite world filled with deep places to explore, and horrifying monsters to slay. Build structures out of blocks, craft weapons and tools from raw materials, and explore the vast and frightening world around you.\nPlay by yourself or online with friends in any of these exciting game modes:\nEndurance Mode: There are tales of a place beyond the mountains where Hell itself has torn through. How far can you get before you succumb to the zombies, dragons, skeletons, or other enemies that thirst for your blood? Run, fight, and sneak your way across dry deserts, snowy mountains, and icy expanses on your quest to vanquish the ultimate guardians of the abyss. In Endurance Mode, the world is randomized each game and the death of your party is permanent. Survival Mode: If you enjoy Endurance, but would rather build permanent structures and defenses, Survival Mode is where you’ll spend your time.Creative Mode: With simplified crafting and the ability to adjust or eliminate the enemy threat, Creative Mode is a great place to build vast structures in peace.Dragon Survival Mode: For those who like their trophies big and their hair singed and smoking, Dragon Survival Mode brings you up close and personal with wave after wave of the biggest, meanest, scaliest brutes in the game.\nWorlds can be saved in any game mode (except endurance) so try building a castle with enemies turned off, then grabbing some friends and loading it up with enemies turned on!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"DigitalDNA Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3551,"name":"Senran Kagura: Shinovi Versus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e83/e8355a71ceda899534ba5fd9c833fd18.jpg","description":"From the Warring States period to the present day, the mysterious shinobi have fought covertly across Japan. Some fight for the authorities, others for the highest bidder, but all of them have one thing in common: They kick ass and know how to look good doing it.\nSENRAN KAGURA SHINOVI VERSUS immediately follows the events of SENRAN KAGURA Burst, revisiting the fierce rivalry between the girls of Hanzō National Academy and their sworn enemies from Hebijo Clandestine Girls’ Academy, the latter of which have now gone underground and formed a mercenary strike team known as the Homura Crimson Squad. In addition to their old adversaries, the Hanzō girls must also face a whole new set of foes: the students of Gessen Girls’ Academy, who seek to punish them for their imperfections as shinobi warriors. Meanwhile, a new class is in session at Hebijo, and these students mean business: they oppose all three of the competing factions and will stop at nothing to be the last shinobi squad standing – even if it means leaving broken bodies and shattered dreams in their wake.\nThe stage is set for a shinobi battle royale. Heroines and renegades battle saints and sinners in a flurry of fists, feet, clothes, tattered remnants of those clothes, and sometimes underclothes. Each school has a story to tell, full of tragedy, heroism, pathos and partial nudity. Choose a school, prepare for battle, and follow the Path of the Shinobi.Key Features:A Little Violent, a Little Sexy, a Ton of Fun\nFight with a team of buxom ninja girls in a 3D brawler containing massive mid-air combos, revealing cut-scenes and special Secret Ninja Art techniques, all while struggling to stay clothed as damage is depicted by the deterioration of each girl’s outfit. Now in HD and silky smooth 60fps on Windows PC.\nMaster over 20 Fighters, each with a Unique Fighting Style and Abilities\nEach of the 20+ shinobi has her own unique weapon, techniques and special moves, while Ninja Arts can be harnessed to change costumes and power up in mid-battle. PC version comes standard with all DLC from the original PlayStation(r)Vita system release.\nStory Narrative told from Four Different Viewpoints\nEach of the four rival shinobi schools takes a turn at the story narrative, providing background on motivations, relationships and hobbies, while the original Japanese voice-overs with English subtitles bring each girl’s distinct personality to life.\nInnovative Multiplayer Modes for 4-Player Battle Royale\nUp to four players can compete online in one of three modes; classic Death Match, Strip Battle to unclothe your opponents, and Understorm, a race to grab the most falling undergarments from the sky.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"XSEED Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":2899,"name":"Mimpi Dreams","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e1/3e1e9a072e39e8674b944ce09aa9e623.jpeg","description":"Mimpi is a lazy doggy who becomes the “Superdog” in his dreams. Help him to save his friends by manipulating the environment of 6 original illustrated worlds in this charming mix of adventure, puzzle, and platformer. Find out what dreams dogs have and download the sequel to the award-winning Mimpi 1! Mimpi Dreams is a casual game, do not expect strong challenges, we want you to have fun and finish it. The game was designed as multiplatform, so you can play it on iOS or Android devices, but it is played best on a PC!\nFeatures\n● Scientifically accurate super-realistic simulator of dog dreams :)\n● Casual gameplay combining platformer, puzzles and adventure\n● 6 different worlds to explore: stoneface forest, tesla landscape, bottle seaside, fairytale, medieval castle and factory!\n● Soundtrack by award-winning​ composers Jaroslav Vyhnička and Alexandre Guiraud\n● Sequel to the award winning original - yes, there is Mimpi 1\nPC Features\n● Proper keyboard and mouse controls designed for PC (you can also use the gamepad).\n● Different camera zoom and more parallax backgrounds.\n● Steamworks features: Cards, badges and Steam achievements!\nAbout Mimpi\nMimpi is a lazy doggy who likes to sleep a lot. In his dreams, he becomes the dog hero, who rescues and saves whoever is in need of rescuing or saving! Be it a lost pirate ship, a lab rat who wants to be free or a princess held by a dragon - Mimpi hero is here to save the day. Of course, Mimpi can not do it without his sidekick and that is YOU!\nMimpi and you are the makers of his dreams. Help Mimpi be the hero by manipulating his dreams - move obstacles to allow Mimpi to get through levels, solve puzzles and help Mimpi communicate with the creatures in his dreams.\nFollow Us\nBecome a fan of Mimpi on Facebook and get the latest updates: www.facebook.com/TheRealMimpi or follow us on Twitter: www.twitter.com/SiliconJelly","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dreadlocks","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":908,"name":"Seraph","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0c/d0c1914eaa7fdb697560462ff21febd5.jpg","description":"Seraph is a skill based, acrobatic combat platformer... without aiming! Featuring an angel, known as Seraph, who's fighting to restore her lost power and ultimately escape a prison infested with demons. However, dark magic has trapped the angel inside her human Vessel: if the Vessel dies, so will Seraph.Key FeaturesGun-fu acrobatic combat - Seraph chooses her own targets with a wide range of deadly firearms, allowing the player to focus on acrobatic evasion instead. Dodge enemy attacks with lightning fast reactions and look awesome while doing it!\nDynamic difficulty scaling - The on-screen difficulty rating ensures that the game is always challenging. The better you do, the harder the enemies (but the greater the rewards!).\nDesigned to be replayed - Levels are procedurally generated and filled with random pick-ups, enemies and bosses. Craft new weapons, Miracles and protective items through the Transmutation feature and unlock powerful passive Oaths for your next demonic encounter. Daily and weeky challenge leaderboards allow you to test your mettle against other players.\nNot a rogue-like! - Seraph can be slain in her battles, but doing so will mean resurrecting with less maximum health. Discover hidden checkpoint orbs to save your start point through the campaign if you die completely.\nTwitch features - Seraph can be played in Twitch mode, allowing viewers to vote between levels to give the Streamer a positive or negative modifier, which then actually alters the game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dreadbit","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]