[{"id":21608,"name":"Moorhuhn (Crazy Chicken)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a6/7a6e46bf06bd191a4218aa07e1b423b7.jpg","description":"In this hunting game, not everything is about shooting. Crazy Chickens are tricky! Try to find all the secret puzzles to maximize your score!\nFeatures:\nA lot of game to shoot!\nEasy to pick up, difficult to master!\nFind the second level!\nUnlock the mighty Skycleaner weapon. Then use the mailbox to send some chicken!\nEasy Mouse or Touchpad Control","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Doyodo","platforms":[{"id":0,"name":"PC"}]},{"id":20437,"name":"Wrestling Spirit 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a80/a801e2bddf77f612163ef06be39c6920.jpg","description":"Wrestling Spirit, created by Total Extreme Wrestling developer Adam Ryland, allows you to take control of the career of a professional wrestler, guiding him through the world title wins, the tough matches, and the rivalries. You control each match, negotiate contracts, manage personal finances, deal with injuries, and navigate all the backstage politics in this text-based professional wrestling role-playing simulation. The accurate simulation engine and realistic AI offers up an extremely unique and immersive wrestling experience.\nMatch Features\nRealistic opponent AI: Wrestlers fight in a natural manner. Lightweights come off the top rope at regular intervals. Technical workers will tie you up in knots on the mat and try to squeeze you into submission. 500 pound giants will simply batter you with strikes and slams.\nVaried move sets for workers: Each worker has a huge amount of moves of various styes:  strikes, grapples, corner, ground, air, rebound off the ropes, and rope moves (planchas and springboards). This gives wrestlers very unique offensive choices no matter where they are in the ring (or outside).\nRealistic simulation of physical condition: Working body parts has a very real effect on the match. Working a wrestler's legs will not only soften him up for submissions, but will also make him unable to utilize any of his own moves that rely on leg strength.\nRealistic simulation of time: As the match progresses, wrestlers get tired and they start to make mistakes. The speed of their weakening is based on their stamina levels, meaning highly conditioned professionals will have major advantages over fat out-of-shape brawlers as the match goes on.\nMatch statistics: At any point in the match you can view an amazing array of stats, from the percentage of time you've been on the attack, to how many of each type of move you've attempted, to the amount of counters you've executed. You can also view a log of every move, counter, and action performed so far, so you can see where your weaknesses are.\nOutside forces: External factors can play a big part in matches. Ref bumps? Chairs? Tables? Blood? Run-ins? Pre-match attacks? All included.\nCareer Features\nTraining: Define exactly how you want to train so you can customize exactly where you want your character to focus his efforts, perfecting the areas you want to perfect.\nMorale: Your character has wants and needs that you must satisfy. If he becomes too unhappy, he'll leave wrestling, ending your career. These include things like financial needs, meaning that you may need to make tough choices about where you work in order to pay the bills!\nBackstage: Talk to other wrestlers before the show; form friendships, make enemies, get into fights, or keep to yourself.\nPolitics: The relationships that you form can affect how your career is shaped. Strong allies can get you opportunities you'd never get otherwise, while enemies can be out to screw you over.\nTryout matches: Promotions may give you a match to prove yourself worthy. Feel the pressure as you engage in a make-or-break match with a superior opponent!\nLook for work: You can approach promotions to look for work, or they can come to you if you're in demand.\nCreative meetings: Call a meeting with the company to discuss your creative direction, such as requesting managers, feuds, or new tag team partners.\nGame Features\nExhibition match feature: Play against a friend or the computer with any worker in any style of match.\nFully active game world: Every promotion in the world continues doing business, regardless of whether you work for them or not. Wrestlers will move around, have matches, and win titles, making a constantly evolving game world for you to explore.\nFull in-game, easy-to-use editor, which can be used to edit just about everything in the game!\nFull match history for every wrestler in the game.\nFull title history for every belt and wrestler in the game.\nFull results history for every promotion in the game.\nSeven different game areas: USA, Canada, Mexico, Japan, UK, Australia and Europe.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grey Dog Software","platforms":[{"id":0,"name":"PC"}]},{"id":18029,"name":"Just Hero","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ce/8ce64d1f33e7bacc09ab4f7c517326e4.jpg","description":"More games by Anatoliy Loginovskikhhttp://store.steampowered.com/app/491030/\nhttp://store.steampowered.com/app/474820/\nAbout the Game\nJust Hero - a classic platformer about a green man in a hat which, by the will of destiny, is meant to become a hero. This game has it all: an intricate storyline, betrayal, death, tragedy, and finally, revenge! The main character has lost his memory and now has to figure out what happened to him, along with finding the answers to many other questions. This game has many different levels and in some places they are very complicated. Some of them will make you truly suffer on your way to the end!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Anatoliy Loginovskikh","platforms":[{"id":0,"name":"PC"}]},{"id":15270,"name":"Last Knight: Rogue Rider Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c63/c635b563cc06bdd83f62a9d8e8213019.jpg","description":"Feature ListOVER-THE-TOP JOUSTING! - Countless enemies had been shot, hacked and slashed in the history of games. Now it is time to ram a wooden lance in some gut, send your foes flying, and watch them bite the dust! Body parts ripping off, ragdoll horse physics, and destructive environments included.\nA BEAUTIFUL BRUTAL WORLD – Dive into a magical fantasy world full of treasures and adventures! Don't be fooled by the cartoony looks: here, simply bumping into a silly wooden fence spells a sudden end to your hero's life. If you fancy dying in a more heroic way, how about getting swallowed by a giant toad, falling into a lava pit, exploding from eating too much turkey, getting impaled by a Hitler Snowman, or just getting lit on fire by a dragon!\nBUCKETLOADS OF CONTENT – Divided into three major parts - the Story Mode, the Endless Journey Mode and the Rogue Rider Mode - this game has a lot to offer and there is always something new to accomplish, find, or unlock. Power-ups, characters, view modes, mutators, quests, game mode variations, randomly generated hats, you name it! Did you ever wish to be a skeleton king with a fancy wig riding over rainbows on a flower-pooping pink unicorn? It's all up to you in this game!\nINSPIRED BY CRASH BANDICOOT – Good third-person platformers were always hard to find on PC, when consoles sport countless shining examples: the first Crash Bandicoot titles, Spyro, Ratchet & Clank, and Super Mario were all a big inspiration for Last Knight. This game kicks it up a notch with non-stop jousting action, no-health instant death, procedurally-generated worlds, as well as custom-crafted levels with Knightmare levels in-between. To top it off, the new Rogue Rider Mode pushes it all into a rogue-like direction, and if you don't like third-person view, try playing in first-person mode!\nAbout the GameLast Knight is a unique genre mix that combines platforming, action-packed riding\nand ragdoll physics driven jousting! It is fast-paced action in a never ending randomly generated Unreal Engine powered fantasy world!\nThe story mode put it's player in control of a squire on its way of becoming a knight. But before he can prove himself, events of epic proportions make him the last hope for the kingdom! On his heroic adventure he will have to fight the horned bucket heads and oversized hungry creatures. He will have to get through a wide range of dangerous environments as well as his own Knightmares. But beside the story there is much more. Various game modes let you adventure through always different never ending generated worlds filled with riches and dangers. On your journeys you will also find quests that will take each of the characters on different missions in the hunt for fame and glory as well as gold and chivalry. Gold can be spent on fancy power ups, while chivalry can unlock world bending mutators and different view modes like the intense first person view. Cutting-edge features like a fully dynamic randomized weather system and a collision system that can alter basically everything of the world geometry make this game even more over the top.\nFeatures: A full-fledged adventure in the story mode\nRandomly generated world in the different endless modes\nYour own adventure in a generated kingdom in the Rogue Rider Adventure mode\nWide range of different fantasy environments\nQuests and rewards system\nBeautiful graphics archived with the Unreal Engine\nUnique Power ups and other special unlock-ables\nCustomization with different characters\nDynamic weather system\nRagdoll physics feedback\nImpacts alter and deform the world\n3rd Person, First Person and Bird's Eye view modes\nWorld Mutators, Body Mutators and randomly generated hats","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Toco Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14950,"name":"SHOCK TROOPERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/599/599aa44b6c50fba1e46a829ac67d9b33.jpg","description":"“SHOCK TROOPERS ”, the fan favorite 2D top-down view action shooting game released exclusively on NEOGEO MVS in 1997, returns to the battlefield on Steam!\nProgress through the battlefield, choosing the best routes and strategy! MAIN FEATURES・ARCADE:\nChoose a character and go on your mission solo in “Lonely Wolf” mode, or form a team of three soldiers from the eight mercenary characters available, and try to rescue Dr. George and his granddaughter who have been kidnapped.\nThe route you choose at the beginning will affect the progress of the game, allowing you to enjoy an original gameplay experience time after time.\n・MULTIPLAYER:\nConnect to Steam and clear missions with a brother-in-arms far away via the Online Co-Op Play feature.\nEngage with a fellow countryman or foreign ally, and try to put an end to the evil plans of the terrorist group called the “Bloody Scorpions”!\n・LEADERBOARDS:\nCheck your current rank & score in “SHOCK TROOPERS”  at any time, as well as those of your friends and other top troopers!\n・SETTINGS:\nConfigure your language, video and language display, and adjust sound volume settings to your preference for the most pleasant “SHOCK TROOPERS” experience ever.\n** WILL NOT RUN ON Windows XP **","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"DotEmu","platforms":[{"id":0,"name":"Neo Geo"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":14051,"name":"Soulless: Ray Of Hope","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ca/3ca4744596b13ec79d28fdc4f1c05c2a.jpg","description":"Follow the ray of hope in a world of darkening silhouettes as you help Elin save his friend and face his deepest fears.\nImmerse yourself in Elin’s childlike wonder, and witness each new puzzle, secret, sin, or dilemma unfold to discover the truth behind this shadowy world.\nFeatures:\nTravel through beautiful handcrafted environments\nChallenge yourself with intricate puzzles, cryptic bosses and refreshing gameplay\nConfront the seven deadly sins, secrets, dilemmas and atmospheric perspectives\nExplore this rich and mysterious world of silhouettes with an epic original soundtrack\nCome back for more: with three different endings to uncover\nExperience a deeply moving personal journey of hope...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Meridian4","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":11416,"name":"FLYING TIGERS: SHADOWS OVER CHINA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fad/fad5e390173a0a1ab3dddeb7cf0812ed.jpg","description":"Digital Deluxe EditionThe Digital Deluxe Edition adds the PARADISE ISLAND DLC which includes the lush Phi Phi Island map, an additional sunset weather, and two amphibious fighter aircraft -- the Japanese A6M2-N \"Rufe\" and the US Navy “Seahawk” SC-1, both with cockpits.\nMoreover, the Digital Deluxe Edition also gets you the FLYING TIGERS: SHADOWS OVER CHINA OFFICIAL SOUNDTRACK featuring main-themes \"HOPE IS VICTORY\" and \"FOR THE REPUBLIC\", and Norman Wayne's popular country-rock single/EP \"THESE GUNS\".\nSoundtrack also available on major music services including Bandcamp, Apple Music, Spotify, Deezer, and Xbox/Microsoft Groove Music. ℗ & © 2017 Imperial North Music Agency.\nAbout the Game“The sky was a maelstrom of exploding bombers, twisting tracers, flaming parachutes, and Robert’s own burning fighter...  then his engine quit!”\nFTSOC, short for FLYING TIGERS: SHADOWS OVER CHINA, is an air-combat action game based on the true events of America’s secret volunteer squadrons that defended China against Japan in the China-Burma-India theatre of World War 2.\nExperience rarely depicted air-battles as you take on the role of headstrong fighter pilots, self-sacrificing transport navigators, and daring bomber crews and gunners of the AVG, the RAF, and the USAAF to repel the onslaught of the Japanese war machine. Dogfight skilled enemy aces using “hit and run” tactics, carry out breakaway air-strikes behind enemy lines, and take part in the defense of China’s critical supply-routes, from Rangoon up the Burma road, and across the deadly Himalayan \"Hump\".\nFLYING TIGERS: SHADOWS OVER CHINA recreates some of the most legendary events of the China-Burma-India theatre. A decent collection of historical missions are included, such as the Japanese Christmas-raids on Rangoon, the AVG’s first combat over Kunming, the Battle of the Salween Gorge, “Hump” transport missions over the Himalayas, flight-training at Kyedaw in Toungoo, the surprise Invasion of Malaya, and many more.\nRARELY DEPICTED AIR-BATTLES OF WORLD WAR 2\nAction-packed campaign recreates the clandestine operations of the American Volunteer Group in fighter, bomber, gunner, reconnaissance, torpedo, and night missions.\nAPPROACHABLE TAKE ON AIR-COMBAT\nFeatures TrazerTime™ slow-motion precision firing, arcade-like combat maneuvers, sim-style pitch & roll controls, moody weathers (including thunderous monsoons, beautiful sunsets and misty dawns), 20+ Allied and Japanese planes, adjustable mouse & keyboard, gamepad, and flightstick controls, and more!\nMULTIPLAYER FOR UP TO 16 PLAYERS\nSteam leaderboards eternalize players’ online rankings across five battle modes! Coordinate devastating air-attacks in TEAM DOGFIGHT while providing cover for your comrades, outdo all enemies using powerful rocket weaponry in ROCKET BATTLE VS, or take to the skies to “Capture the Flag” in the FLAGBUSTERS mode.\nPAY ONCE AND PLAY\nNo micro-transactions or F2P-elements -- for a single purchase, you’ll get the full, stand-alone experience -- with unrestricted multiplayer!\nFLY IN COCKPIT OR THIRD-PERSON MODE\nSoar through the skies of Southeast Asia in third-person or cockpit view in a variety of American, British, Russian/Chinese, and Japanese aircraft.\nSTRIKING RENDITION OF THE FAR EAST\nFaithful environments, beautiful graphics, booming sound effects and an epic-orchestral soundtrack create a lasting impression of the China-Burma-India theatre.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ACE MADDOX","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11243,"name":"Creature Clicker - Capture, Train, Ascend!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a4/6a4f5e41527346fd1bc4d2e5b5390e82.jpg","description":"Creature Clicker is a new take on the Clicker genre, taking inspiration from Clicker Heroes and Pokemon it builds on both elements, you can capture creatures, level them up to make them do more DPS and ascend them to gain better abilities.\nYou start the game by selecting an egg and incubating it by killing enemies, everytime you kill an enemy you have a 1 / 10 chance of capturing it and having it as a pet that will do constant DPS to enemies so you have help clicking.\nAs you creatures grow up they will get tougher and you will be able to use your hard earned cash to purchase upgrades and abilities.\nYou will also be able to pickup rare items from creatures and craft items which can be equipped on your creatures to further boost your DPS and beat those high level bosses which appear every 12 levels and must be beaten within 60 seconds or you will not be able to progress to the higher levels until they are beat, this will sometimes mean going back a few levels to further level and ascend your creatures and then come back and beat them when you are bigger and stronger!\nEach boss drops a soul stone which are used to Ascend your creatures to their next tier level and acts as a rebirth system for extra DPS, your Dragon grows up in stages of an egg, baby, juvenile, adolescant and adult. each time they ascend they get stronger and stronger\nYou can even build a farm on your land that you can build Stables, Townhouses, Vineyards and other structures that all help towards your DPS","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]},{"id":9874,"name":"Super Mega Baseball 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86a/86acab2c5c5d3c71c51198c8a913c7c9.jpg","description":"The critically acclaimed, streamlined baseball simulator is headed for second. Lace up your cleats and step onto the field for the most gratifying hardball action. Build your dream team and dominate online or on your couch.\nTake in the sights and sounds of the ballpark:\nGorgeous stadiums using PBR rendering technology\nNew, more realistically scaled character models\nOverhauled user interface\nGot game? Show your stuff online:\n2 to 4 players (1v1, 2v1, 2v2, 2vCPU)\nCompetitive online matchmaking\nCooperative online season play (2vCPU)\nDedicated servers\nYour team, your league, your way:\nEdit player names, appearance, gear, animations and skills\nCustomize team logos, uniforms and names\nCreate leagues and configure divisions and conferences\nSet season length, playoff bracket size and number of innings\nTake the field for a refined baseball experience:\nCritically-acclaimed ‘Ego’ system with 100 difficulty levels\nRealistic baseball simulation and accurate physics\nTight controls and fast-paced gameplay\nDeep, multi-season stat tracking\nSolo, co-op or versus play – online or off","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Metalhead Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9503,"name":"Home Design 3D","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/162/1621a988541af1bd9e63de698a713199.jpg","description":"3D PRINT AVAILABLE\nGet your customized full-color 3D Printed model available in the last update V4.1.1.\nMore info: http://steamcommunity.com/games/420000/announcements/detail/1287311065261966344\nAbout the GameWith a community of more than 30M of users worldwide, Home Design 3D is the reference interior design and home decor application!\nDraw floor plans, design, rearrange or remodel your home, have never been so quick and intuitive!\nHow does it work?\n1. DRAW FLOOR PLANS\nIn 2D and 3D, draw your plot, rooms, dividers\nChange the height or the thickness of the walls, create corners\nAdd doors, windows or openings with fully-resizable pieces of joinery\n2. FURNISH AND DECORATE BOTH THE INTERIOR AND OUTDOOR\nMake your choice from over a thousand of pieces of furniture, objects and textures, customize your home decor and express your style\nEdit any object, by changing its size, color, position and altitude on the walls\nDuplicate items thanks to the copy/paste function\nUse the undo/redo feature at anytime\nUse the eye dropper to find an existing texture in the plan\nYou can also import picture as texture and apply them anywhere\n3. VISUALIZE AND VISIT IN 3D\nVisit your project in real-time 3D as if you were inside it\nDiscover your home, your outdoor and even your neighborhood\nAdmire the result day and night, the compass function will show you where exactly the light will fall at different times of the day\n4. IMPORT/EXPORT AND SHARE\nImport blueprint and display it as a layer\nShare your projects via e-mail, Dropbox (backup), OneDrive etc.\nExport and continue your work on other devices thanks to the cross-platform compatibility\nShare your creations on the online Gallery, and manage projects on {LINK REMOVED}www.homedesign3d.net!\nLocal autosave function\nNo internet connection required\nIllustrated tutorials available + video tutorials\nAlso available here: https://www.youtube.com/channel/UC8Y13TBoZMo2C_mjZAzvolQ","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":7007,"name":"iBomber Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c85/c8523bc85a120c0f2ed02c7e2bdbb1b3.jpeg","description":"iBomber Defense combines classic tower defense gameplay with intense action and strategy. Keep enemies at bay all over the world using a variety of weapons and tactics, from rattling Machine guns, explosive cannons and awesome anti-aircraft artillery!\nChoose from Quick play and Campaign modes and battle across North Africa, Europe and Russia as both the Allied and Axis forces. Position your defenses and prepare for attack.\niBomber Defense is the complete entertainment package with hours of action packed and deep strategic game play.\nKey features:\t\t\t\t\t\t\tTwenty-Two challenging and unique stages across a vast campaign\nHuge variety of weapons to repel the enemy; AA Guns, Artillery, Machine Gun Nests and more!\nUse Counter Attacks, Rewinds and the High Ground to your advantage\nThree tiers of difficulty\nSlick, gorgeous, graphics\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":3689,"name":"Drakengard 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d9/5d94461c293475192732c015ba83f65f.jpg","description":"A prequel to the original Drakengard, Drakengard 3 transports players to a medieval world where six sisters wield special magical abilities as the 'Intoners.' These sisters have brought peace to the earth with their power to manipulate magic through song. Harmony is disrupted, however, when the eldest sister, Zero, attempts to murder her younger sisters with the help of her dragon companion, Mikhail. As the story progresses, players find themselves in a battle to unravel the mystery of Zero and learn her true intentions.\n1 player\nHDTV screen resolution: 720p\nDUALSHOCK®3\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n© 2013, 2014 SQUARE ENIX CO., LTD. All Rights Reserved. Character Design: Kimihiko Fujisaka. Drakengard is a registered trademark or trademark of Square Enix Co., Ltd. SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3538,"name":"Just Dance 2015","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c46/c46f3925874a7e3ed22c67e4b918aaaa.jpg","description":"With more than 50 million copies of Just Dance titles in homes around the world, our players are as important as ever, and the new features in Just Dance 2015 bring people together in more ways than ever before.\nFor the first time ever, you too can be in the game. The all-new Community Remix feature puts players in the global spotlight by allowing them to become a Just Dance coach that players everywhere can dance along to.\nJust Dance 2015 also introduces Challenger mode where players will be able to compete against their past performances or challenge friends anywhere to beat their score, even if they can’t play at the same time. Plus, this year we’re bringing even more excitement to World Dance Floor, the online multiplayer mode. Follow @justdancegame on Twitter for all the latest updates!\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\nNetwork Players 2-8\n24GB minimum save size\nMotion Controller 1/Player Required\nPS Camera Required\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2014 Ubisoft Entertainment. All Rights Reserved. Just Dance, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":491607,"name":"HUMANKIND - OpenDev","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c98/c98679ecd581897c521033e5e29df147.jpg","description":"HUMANKIND™ OPENDEV - Register now\nAbout the Gamehttps://store.steampowered.com/app/1124300/HUMANKIND/?snr=1_5_1100__1100Welcome to HUMANKIND™ OpenDev!\nGetting feedback as early as possible from our players has always been our way of creating the best games we can. In fact, we designed the GAMES2GETHER platform and program 10 years ago to fill that missing link between our dev team and our players.\n“Today, we're very excited to present OpenDev : a new way for players to get early access into our developing games so they can help us make sure we're on the right path.\nWe're really excited to try this out with HUMANKIND™ -- we're looking forward to your feedback on our most ambitious game yet!\" - Romain de Waubert\nIntroducing HUMANKIND™ OpenDev\nOpenDev is our new approach to community-driven game development. It allows you to join the dev team and help shape the game during its production.\nStarting June 13th, register and get a chance to get access to 3 time-limited scenarios focusing on specific core features of the game (exploration, tactical battles, basic city management). Each scenario concludes with a game design survey that will help our dev team level-up the game!\nRegister now!\nHead over to http://opendev.humankind.game, register and get a chance to be one of the first to play HUMANKIND™. Once selected, you will receive a confirmation e-mail and the game will be automatically added to your Steam library. The number of players who get access will be increased as we release new scenarios, so stay tuned!QUESTIONS\nHow can I join?\nBy signing up/logging in to Games2Gether, you will get access to a registering form. After answering a few questions about your gaming habits and PC specifications, you will be registered on the waiting list. If selected, you will later receive a confirmation email and HUMANKIND™ OpenDev will be added to your steam library automatically.\nPlease note that you have to be 18 or over to join HUMANKIND™ OpenDev.\nIn what regions will HUMANKIND™ OpenDev be available?\nOpenDev will be available worldwide, but will only be playable in English. HUMANKIND™ will however be localized in several other languages at its release.\n\nI haven’t been selected for the first scenario, what can I do?\nOpenDev only has a limited number of spots, that will increase for each scenario release. Not having access to the first scenario does not necessarily mean that you will not get access to the next one. Keep an eye open on your inbox 😉\nIs OpenDev free?\nHUMANKIND™ OpenDev is completely free!\nHow long will the game stay in my Steam library ?\nHUMANKIND™ OpenDev is limited in time. Each scenario is accessible only for 4 days, and previously unlocked scenarios will remain playable during this period. Once these 4 days are over, the game will be removed from your Steam library.What mark will you leave on HUMANKIND™?","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"PC"}]},{"id":79838,"name":"Freddi Fish 1: The Case of the Missing Kelp Seeds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a4e/a4e877129374d82a8690f5ea3ff0f168.jpg","description":"Freddi Fish 1: The Case of the Missing Kelp Seeds\nJoin detective Freddi Fish and her best friend Luther as they take on their latest case: finding Grandma Grouper’s kelp seeds that feed the fish under the sea. Explore underwater caves, deep canyons and colorful reefs, and discover fascinating places like King Crab’s Castle and A Sunken Ship Out of Time, in an effort to save the reef.\nFreddi Fish and the missing Kelp Seeds entertains children for hours as they explore the wonders of the sea, use logical thinking and reasoning skills to solve the mystery, and make unforgettable new friends along the way!\n—User Reviews—\n\"I really love these games! You should make more!\"\n“The puzzles are difficult without being frustrating, and there are plenty of fun animations to watch and hot spots to click along the way.”\n\"It's just as good as I remember and this is a great port that works great for a touch screen.\"\nFEATURES:\n• Explore over 40 places as Freddi and Luther try to find the missing kelp seeds.\n• Every location is filled with wonders, a touch and who knows what will appear, with over 500 secret touch points there’s a new surprise every time you play.\n• Fun music mini-games keep things lively for you and your child.\nThis product uses ScummVM which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":49976,"name":"BattleRush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/764/764e3d05a5988687c2bc951e97d2d6ac.jpg","description":"Free-to-play multiplayer action game in the entourage of the Second World War with total destructibility of the environment. Enjoy full freedom, build a defense, create your army, crush the enemy.  Complete freedom of action.  Do anything and anywhere. Build defense, control any vehicle which you will see on your way.  Total destructibility.  Complete destruction of any objects on the map.  Dynamic change of day time.  Use the dark time to arrange sabotage in the enemy's rear.  Crafting, building.  Create your defensive line using a variety of options for construction: booms, dots, bunkers, towers with searchlights, stationary machine gun spots, and guns.  Variety of equipment and weapons.  More than 30 kinds of vehicles of those years: light, medium and heavy tanks, trucks, cars, guns.\nSmall arms are available in more than 20 types of assault rifles, pistols, rifles, machine guns and grenade launchers.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Thunder Devs.","platforms":[{"id":0,"name":"PC"}]},{"id":23467,"name":"League of Maidens","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38c/38c5d5ec397ccff93443728c156d2b72.jpg","description":"[EVENT] THE AWAKENING (STARTS APRIL 28TH - 9:00 UTC)\nCelebrate the kickoff of BATTLE SEASON 1 (and the first weekend of availability for League of Maidens) with a limited time 500% increase in initial account credit of COINS and BP during the Awakening event.\nStarting April 28th and ending on April 30th we will be crediting new accounts with 100,000 free coins (used for enlisting and building assets like soldiers, tanks, turrets, war ships and jets as well as opening silver and gold chests) and free 500 crystals (to use for boosting asset builds and purchasing premium items from our in-game shop). After April 30th new account credits will return to 20,000 coins and 100 crystals.\nAbout the GameSUPERHUMAN POWERS:\nLeague of Maidens is a 3D free-to-play online battle arena real time strategy game for PC featuring beautiful maidens with superhuman powers. Players battle in teams of 3 to destroy towers guarding the enemy base. The match is won when all towers are destroyed including the main tower located in the enemy base.\nIN-DEPTH CHARACTER CUSTOMIZATION:\nThe game features FPS style shooting and projectile attacks, 3rd person melee fighting with combo ability and combo counters, building and environment destruction, dynamic day/night cycles and weather, human flight at the speed of sound, swimming, car/truck driving, lifting and flying with cars/trucks, grabbing enemies while flying at high speed and smashing them into the ground or buildings, indoor and outdoor combat, in-depth character customization, building and recruiting military assets (soldiers, tanks, turrets, war ships and jets) and much more.\nMOTION REPLAY (CREATE YOUR OWN GAME TRAILER):\nMotion Replay® is a 100% free and awesome feature of League of Maidens® allowing players to step onto the battlefield with a professional film camera. In fact it is the exact same tool that we used in-house to capture some of the beautifully cinematic moments of the game trailer. Choose a lens and aperture then Start/Stop/Pause or even slow down the speed to capture that perfect moment. Even change the angle of the sun, the density of the clouds or the intensity of the rain. With so many options to choose from the possibilities are endless.\nFREQUENTLY ASKED QUESTIONS (F.A.Q):\nHave questions about the game that have not yet been answered? Check out the frequently asked questions on our website for answers to most questions about League of Maidens or feel free to post on our official message board.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Maiden Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":20978,"name":"BattleSpace","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ab/6ab78afc2e0c98858c89fdbd8123cc09.jpg","description":"BattleSpace is a sci-fi flash game designed to play in the comfort of your web browser. In this free online strategy game, you step into the role of an Admiral, building a solar system in the depths of a faraway galaxy. Every player starts in their own 'Union', or guild, with the option of banding together and creating an interstellar empire.\nPlay solo, PvE, PvP, as a combatant or gatherer—or all of the above! The options are limitless once you entire deep space. The ultimate goal is to conquer the Giant Planet before the season's ends, but with so many ways of getting there, BattleSpace tailors to all playstyles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Funnel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20484,"name":"Death Ray Manta SE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18a/18a51c7200acbb071fe1890e917bf599.jpg","description":"Death Ray Manta has lasers in his head\nHe blew up his house, now he lives in space instead.DEATH RAY MANTA\nTwo sticks, one fish, some flashing lights. Death Ray Manta is, quite definitely, a videogame in the purest sense. Rejigged, rebuilt, remastered for Steam in the year of our Molyneux 2015.\nDeath Ray Manta is a short form top down arena shooter where you blow up enemies using colourful laserbeams. You spawn in the centre of the screen, moments later the screen is filled with mines, robots, rabbits and lasers from beyond the stars. Collect space gems for a bonus and shoot everything else that you can in order to flash lights at yourself. Aim for your own personal high score. How far into fish space can you get?\n32 screens of increasingly colourful and crazy laser firing mayhem from the brains behind (amongst other things) Squid Yes, Not So Octopus, SYNSO 2 and the challenge mode in Waves. Also, he's that hairy dude off the internet. You know the one.\nDeath Ray Manta is made with the fine assistance of Mike Daw who provided the legwarmer chic tunes and Andy White, who helped out under the hood and kept me sane. Cover art by the legendary Ste Pickford.\n\"Absolutely Brilliant!\" - Rob Fearon","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Future Of Videogames","platforms":[{"id":0,"name":"PC"}]},{"id":17136,"name":"Way of the Samurai 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ef/0ef62451f5ec5d66b057282b4f5ec83a.jpg","description":"As a major release from the million+ selling Way of the Samurai series, Way Of The Samurai 3 is the prequel to the Famitsu Gold Award winning Way Of The Samurai 4 and furthers the series’ blend of customization, exploration and action gameplay!\nHonour, sacrifice, betrayal… Your choices make you who you are. How will history remember you?\nYou must wield the sword of a mysterious lone samurai during Japan’s turbulent Sengoku era, in one of the most atmospheric action RPGs ever created.\nExplore the villages, body-strewn battlefields, bandit fortresses, immense castles and local town of Amana, in an open world bustling with a rich cast of colourful characters that you can help, ignore or victimise.\nChoose your friends and enemies carefully in a game where every decision has far-reaching consequences, and where finishing the game is just the beginning of your journey…\n• The Butterfly Effect – More than 20 different endings. Your every action, no matter how subtle or ludicrous, could set in motion a huge variety of events, allowing for huge replayability. Explore new narrative paths, reveal new allies… and enemies!\n• Huge Customization - Craft your own unique weapons from over 200 different parts. Create the ultimate unbreakable weapon to suit your preferred fighting style. Forge lethal swords, spears, pole axes and more outlandish weaponry and discover hundreds of new abilities as you become a true master of each weapon!\n• Reward System and Samurai Rating – Your actions and conduct will reward you with Samurai Points and Titles, all of which unlock new game features, customisation options, outfits and accessories. Live as an honourable samurai, wallow in the low life of a bandit or strike your own path! Your choices lead to new endings, strange followers and other unexpected outcomes.\n• The Pen Can Be Mightier Than the Sword - Fight your enemies by force or take the diplomatic route, using subtle gestures like the unsheathing of your sword or kowtowing. Featuring an extensive dialogue tree, combo system and much, much more!\nWhat the reviewers had to say about the PS3 version:\n“Anyone who likes swordfighting, the freedom of an open-world, and the opportunity to shape a story would be well-advised to pick it up.” – Cheat Code Central\n“You're free to do whatever you want… you're encouraged to play it over and over again and try different things each time. Again, I think this design is great.” – IGN\n“Multiple endings, tons of weapon customization and plenty of replay offer up a package that is a must buy for fans of the first two games.” - ZTGD","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Acquire","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"}]},{"id":15214,"name":"Allods Online My.com","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/128/128de49375aabe8f7f978503a2cf7345.jpg","description":"Gameplay\nDelve into the depths of epic mysteries across space and time, exploring the relationship between two factions at war within a unique setting. Develop your character to maximize their abilities, craft your own equipment, and enchant yourself via a rune based system to excel in both duels and Astral space-ship battles.\nWorld history\nA thousand years ago, the Great Cataclysm split the world of Sarnaut into innumerable islands – called allods – which spread throughout the Astral. Their inhabitants learned to live in this new world by traveling the Astral in special ships. Shortly after, a war errupted between old-time enemies – the League and the Empire – both vying for power over the new world, resulting in bloody battles on allods and large-scale fights in the Astral that never cease. The cataclysm allowed adventurers and cutthroats to thrive on the chaos of war and profit from undiscovered treasures of the Astral, yet nobody knows that the real catastrophe is still yet to come...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Allods Team","platforms":[{"id":0,"name":"PC"}]},{"id":12881,"name":"Belko VR: An Escape Room Experiment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/095/095e2dbc896ccbffeb1e5bc9635c6536.jpg","description":"Belko VR: An Escape Room Experiment is a VR Escape Room unlike any you've ever seen before!\nSet in the world of The Belko Experiment, the game will force players to make some pretty twisted choices in order to survive.\nEach player starts off as a simple worker drone at the Belko Corporation, a dull multi-national company staffing Americans overseas...until one day when 80 of those employees are trapped inside one of their facilities.\nForced to escape or die, you will have to solve multiple complex puzzles while a timer counts down to your demise.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Top Right Corner","platforms":[{"id":0,"name":"PC"}]},{"id":12656,"name":"Blaite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88b/88b208a207b1b2e30b4c7c0aa7d28abc.jpg","description":"A platform game so difficult and at the same time, so addictive that you will enjoy having to repeat a levels dozens of times until complete them, enjoy this platform game with your friends and challenge them.\nFeatures:\nYou will receive up to 5 new levels each week.\nHours of fun and anger, all at once in a \"good\" way.\nGreat for playing with your friends and laughing with them or... of them.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dosane Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9577,"name":"TerraTech","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8d/d8ddf7bb0fe0211774300274b02980c3.jpg","description":"TerraTech is an open-world, sandbox adventure game, where you design and build your own creations through a mix of crafting, combat and discovery. Explore a hostile alien landscape, or design with creative freedom. The choice is yours.\nStart your career as an Intergalactic miner on a randomly generated infinite world in search of profit and glory in Campaign, sit back and build to your hearts content in Creative mode or pit your Techs against the clock and dare to run the Gauntlet Challenge. There are many game modes available in TerraTech to stretch your Tech building imagination to the limits!StoryIn the distant future, Earth's natural resources have been depleted, and as a resource-gathering prospector it's your job to travel to alien planets and scour them for valuable materials. But you are not alone! Rival prospectors litter the landscapes of these new worlds, and will fight to protect what’s theirs, and invade to take what’s yours. To make your mark, you will need to be cunning and creative.\nUsing the building blocks, guns, wheels, and wings from several Mining Corporations, you can build varied Techs to suit every purpose. Be it powerful armoured combat vehicles, unstoppable resource gathering machines, sprawling resource processing bases or a hybrid of all three - creativity is your key to exo-planetary success.The worlds in TerraTech are procedurally generated and infinite, so there are always new lands to discover and more resources to find. Treacherous mountain ranges, luscious grasslands and huge deserts are among the biomes you will encounter. More will be added as development progresses.The intergalactic mining industry is a profitable one, but you are not the only miner in search for new worlds to exploit. Defending yourself from rival miners will take time, resources and skill, with success leading to new territory and new lands. All equipable blocks and items can be damaged or destroyed, so ensuring you are sufficiently armed and ready for battle is a key element of both survival and prosperity in TerraTech. Get out there and show them who’s boss!By gathering and processing natural resources, players are able to construct storage, refining and construction bases in order to craft new blocks in the game. Like the look of that Venture Hail Fire Rifle that just tore your vehicle apart? Go prospecting for the needed resources, and craft a couple for yourself in the shiny new Venture fabricator which you just aquired, by beating their time trial challenge in the nearby mountains.All exo-planetary miners buy parts from the established Mining Corporations, which each have their own specific brand of mining technology. Get the job done with GSO, zoom around with high-performance recon specialists Venture, strip-mine to the max with the heavy-duty GeoCorp or act with miltary efficiency utilizing the stealth focussed Hawkeye. New Corporations we’re aiming to add to the game include deranged experimental scientists Reticule Research, technological superiority giants Better Future and the hive-mind AI swarms of LEGION. Completing missions and discovering blocks for each Corp will improve your standing with them, and gain access to the more sought-after components in their arsenal.\nThis is an Early Access game, with everything that implies. Please check the System Requirements to ensure your PC is compatible.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Payload Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2281,"name":"STAR OCEAN: INTEGRITY AND FAITHLESSNESS","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b71/b71772da997cd43c644549560b3f5a78.jpg","description":"STAR OCEAN, the epic sci-fi RPG saga makes its triumphant return with its forthcoming fifth installment in the series.\nDigital edition includes:\n5 x in-game DLC items\n1. Ring of the Valkyries\n2. Golden Bunny statue\n3. Bushybrume Cincture\n4. Wristlet of the Stars\n5. Secret Sthalian Tome\n•  BGM from VALKYRIE PROFILE Series\nThe Pangalactic Federation is nearing the fulfilment of its mission to bring peace and order to the galaxy.However, the embers of conflict begin to stir once again, six thousand light years from Earth on the planet of Faykreed,as a mysterious young girl is found amongst the wreckage of a downed spacecraft.\n• Engage in massive battles with up to 7 x characters on-screen\n• Experience a seamless world where battle and story play out in real time\n• Customize your adventures with an expansive battle role system\nAdditional hardware required for Remote Play.\n1 player\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SQUARE ENIX CO., LTD. All Rights Reserved. Developed by tri-Ace Inc. CHARACTER DESIGN：akiman\nINTEGRITY AND FAITHLESSNESS and STAR OCEAN are registered trademarks or trademarks of Square Enix Co., Ltd.\nSQUARE ENIX and the SQUARE ENIX logo are registered This Digital edition will include:\n• 5 x in-game DLC items\n1. Ring of the Valkyries – Increases ATK, INT and CRITICAL\n2. Golden Bunny statue – Increases EXP and FOL\n3. Bushybrume Cincture – Reduces amount if MP used\n4. Wristlet of the Stars – Reduces damage taken\n5. Secret Sthalian Tome – Increases HP healed\n•  BGM from VALKYRIE PROFILE Series","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":1769,"name":"Cally's Caves 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e7/1e7bad39ef756315998e935d2e71e3f7.jpeg","description":"It’s time for the epic battle to save your parents!\nCally's parents have been abducted, as her arch-enemy Herbert has taken control of the Caves to perform his evil experiments.  Join Cally and her friends in this action-packed run and gun platformer, conquering insane bosses, exploring to find secrets, and levelling up EVERYTHING.\nUse your weapons to level them up and evolve them into their ultimate forms!  Unlock new character abilities like the Triple Jump, Dodge Roll and Water Wings.  Use a second playable character, Bera to unleash crazy awesome ninja moves and solve challenging puzzles.  Most importantly, battle to rescue your parents from Herbert's clutches, and bring an end to Herbert's experiments for good!\nFeaturing:\n310 levels across 10 zones\nFull gamepad support\nIntense boss fights against giant monsters\nMetroidvania-style map with checkpoint system\nSecond playable character Bera\nBattle against 25 types of enemies\nNew Game + mode which unlocks higher weapon tiers and a second ending\nWave-based Survival mode: Can you beat 150 waves of deadly enemies and gain the ultimate prize?\nLevel your weapons up by using them, and evolve them into different forms with different effects\n15 weapon classes with 95 unique weapon effects\nBuy consumables from the store to use them later for an extra boost\nTons of character abilities to unlock\nWeapon mod system, allowing you to customize your favorite weapon and make it extra powerful!\nIt's time to battle for your parents freedom, to protect the Caves' animals and natural resources, and most importantly, to SAVE YOUR PARENTS!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VDO Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":938122,"name":"The Whisperer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f758e9ba7f08b1e4a2d8a58fb6adb2c8.jpg","description":"The Whisperer is an action-adventure side-scroller game that encompasses both the platformer and storytelling elements within the experience. In this game, you play as Suzie, a cute and bubbly girl, who along with her 3 kittens, goes to get some groceries. While returning, kittens started menacing each other and started running around. Before Suzie could stop them, a pack of wild jackals appeared towards those kittens and started chasing them. Suzie became sad and started regretting her decision, but then an “Animal God” appeared and granted Suzie cat-like abilities which she could utilize to rescue her friends.\nThe Whisperer features soothing yet intense gameplay. This game requires you to use its platforming abilities in your favor by making timed jumps, climbing walls, and performing jump dashes. You had to be careful while running through the different environments because you never know how many ambushes lurk there to stop you. Move through intriguing traps, defeat your enemies, and rescue your friends.\nFeatures:\n1. 4 different biomes with 24 levels to play.\n2. Easy to control traversal movements.\n3. Soothing atmosphere and music.\n4. 2 different enemy types and multiple traps.\n5. Slideshow-based storytelling.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Quadrity Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":826896,"name":"Urbek City Builder Prologue","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebf/ebf6f2a53648117342444c8bd6fad4b1.jpg","description":"In Urbek, you will be able to build a city of your own design! Manage its natural resources, improve the quality of life of the population, and build its neighbourhoods in your own way.NeighbourhoodsBreathe life into your city by building different neighbourhoods. Do you want a bohemian neighbourhood? Build bars, parks and libraries, but keep a low population density nearby. Do you want a bourgeois neighbourhood? You need parks and luxury shops.\nManageThere is no money in Urbek. Instead, you will have to build everything with your own resources, such as food, coal, or skilled work. There are more than 30 different resources to manage! Manage your natural resources well, so that they do not run out before they can be replaced. How will you choose to produce the energy for your inhabitants and industries?\nEducateEducation is fundamental! By producing enough qualified work and scientific work, you will be able to build more advanced buildings.\nObserveMove around at street level in order to get a more intimate sense of the city you are creating. See and feel the differences between neighborhoods the way your city’s residents do!\nOrganic growthThe growth of your city will be organic. Some constructions will appear according to the surrounding conditions. For example, buildings with more than two floors will appear in densely populated areas and with basic services.\nYou can place other buildings by yourself, but they need some conditions. For instance, the local market needs to be close to the farms. The university should have some high schools nearby, which, in turn, require nearby schools.\nWhen it comes to designing your city, you have a variety of viable options. There are no buildings that are superior to others. Every decision will have its pros and cons. Bourgeois houses consume more food and need resources that cost more to produce, but will improve the quality of life of the residents there. On the other hand, improving the productivity of industries will produce more resources, but will diminish the quality of life for residents living in the area.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Estudios Kremlinois","platforms":[{"id":0,"name":"PC"}]},{"id":508546,"name":"Paw Patrol Mighty Pups Save Adventure Bay","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10e/10e169bb13e65551a0ab7127a83585df.jpg","description":"A fallen meteor has given the pups mighty powers – and left Adventure Bay in a mighty mess. Now it’s up to you and the Pups to use their powers, rescue skills and gadgets to make the town PAWsome again!\nEmbark on super-heroic missions with the Mighty Pups and Chase’s Super Speed, Marshall’s Mighty Heat, Skye’s Whirlwind Power and the whole mighty PAW Patrol team. Explore the town and journey to Jake’s snowboarding resort, Tracker’s jungle and beyond, as you work together to rescue friends.\nSo, head to the Lookout and get ready for Mighty action! After you’re done saving the day, get playful with Pup -Pup Boogie, jump rope and more fun activities side-quests. And bring a friend along in 2-player co-op mode. Mighty Pups, GO!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Drakhar Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":460512,"name":"NASCAR Heat 5","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e1/1e16191ff5883133f04cb8e2654202f5.jpg","description":"NASCAR Heat 5, the official video game of the world’s most popular stockcar racing series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion.\n \nFeatures all the official teams, drivers and cars from the three NASCAR National Series as well as the Xtreme Dirt Tour, racing on 39 authentic tracks. The immersive Career is complemented by Quick Race, a new Test Session mode and multiplayer, both online and split screen.\n \nTo take the win in NASCAR Heat 5 you have to Refuse to Lose!\n \n· Introducing Test Session Mode – practice without AI, adjust your setup, and refine your race craft\n· Deeper career mode statistics – track your performance more accurately, such as average finish, average start\n· Race online for the ultimate challenge against up to 39 other drivers\n· Take part in the eNASCAR Heat Pro League for the chance to drive for one of the official NASCAR teams!\n· Full car set up options allow you to refine the car to suit the circuit and your racing style","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"704Games Company","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":430301,"name":"She Will Punish Them","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/393/393286a1a10d743ef3ea1524486b001a.jpg","description":"Bring your demoness to the goriest combat. Slaughter or get slaughtered. There are no check-points, only your skills, and luck matters.\nThe old demon king is dead. Veronica, as his favorite princess, ought to take the throne. However, her brothers and sisters are not happy with this decision. They betrayed and locked her up in the tower of pain. She must fight her way out, combat the demonic guards and gate-keepers. Survive and punish them!\nFeatures\nRoguelike gameplay with High-Replayability\nFight your way out in the randomly generated maps of cold plain, dark meadow, ruins, and dungeons. Get randomly generated weapons, spells, and power-ups to boost up your combat ability. Improve your skills and reflex in the cycles of slaughtering and death.\nGory Combat\nViolently murder your foes with melee, spells, explosives, and traps. Cut them in half or blow into pieces. More than 30 weapons and spells to master, each with a unique playstyle. Be careful, your enemy can also do the same to you. The game doesn't focus on character's attributes, but a sense of brutal melee combat. The timing of each slash, choice of weapons, a quick roll to avoid a blow and rage is the key to victory.\nCollectible items and outfits\nMore than 50 outfits, ornaments, shoes, leggings to collect and customize your succubus to look like a badass demon queen. But if you die, you may lose all the equipment you have collected through hard work unless you put them in your personal storage. Punishment is real if you don't know when to withdraw.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"L2 Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":359221,"name":"Neos VR","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a0ba829c0e2ecf1237edee3022f839f.jpg","description":"\nNeos VR is built to be like the real world, but without the pesky laws of physics! Meet your friends and coworkers no matter where they are, explore worlds created by the community and import your own models, videos, images, audio files and more, all in realtime.\nIf you feel like it, you can grab any of the building tools and start creating (or editing) anything from an avatar, interactive object to an entire world. Neos makes no distinction between entities, everything is accessible, editable and programmable (as long as you have the permission to do so).\nEditing can be as simple as gluing things together, putting a material into a material gun and shooting the surfaces in the world or fiddling with particle system knobs. There’s also more advanced visual scripting,and scene inspectors for editing object and component hierarchy. Did we mention that you do all that in VR and multiplayer too? It’s like being inside a game engine!\nWe have taken great care to build Neos to be very futureproof and versatile, no matter who you are and what your background is. It’s based on novel engine architecture designed and programmed from the ground up to give you unprecedented amount of control.\nYou can make Neos into whatever you want it to be, focusing on what you want to do inside in VR, with Neos transparently making sure that everything part of a single virtual universe, where sharing what you made is as simple as handing it to others or sending via message.\nSo come and become part of our amazing community, whether you want to just hang out, visualize your models, build a cool world or a silly item, or even collaborate on projects with engineers and scientists. Neos is a metaverse for all of us.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Frooxius","platforms":[{"id":0,"name":"PC"}]},{"id":327256,"name":"Supermarket Shriek","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a9/1a978036ca14a26c041bb7d5fe50b67a.jpg","description":"Join man and goat in this chaotic, award-winning couch-co-op adventure! Tackle outlandish obstacle courses, complete rewarding challenges and dodge deadly obstacles in a hectic race to the checkout! Packed with a frantic 38 stage campaign and 4 hilariously fun PvP party modes for 2-8 players.\nScream like a man! Scream like a goat! Scream together!\nA Couch Co-op Experience Like No OtherPropel our two heroes through supermarkets, shops and boutiques using their wild, incomprehensible screams!\nGoat Screams: Kart Turns right!\nMan Screams: Kart turns left!\nScream Together: Kart powers forward!\nUse your controller triggers to make each of the duo scream - or hook up two mics and *literally* shriek your way to victory!\n4 PvP Party Modes for 2-8 PlayersCollect all the items in the fastest time in \"Shopping List\", dominate the arena in an epic clash of man, goat and trolley in \"Sumo\", scream as though your life (or indeed, some points) depended on it in a \"Race\", and finally just survive as long as you possibly can in \"Elimination\".\nAction-Packed Story ModeThe 38 stages include outlandish obstacle courses, rewarding challenges, time-limited collectathons and not forgetting the-mode-where-you-knock-over-the-tins-of-beans.\nA World of Insane ObstaclesBehind each shopfront, expect a relentless stream of obstacles blocking your way to the checkout! From the mundane (conveyor belts, spillages) to the absurd (fire pits, swinging axes, sumo wrestlers & more!).\nExperience \"Duet\" Co-Op ModeYes, you and a friend can *literally* shriek your way to glory by controlling the action using a mic. A mode that will certainly have your neighbours talking!\nDress to ImpressCustomise the appearance of your characters with over 50 customisation options!  Choose from a range of excellent shirt & tie combos, as well as some outlandish headgear!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Billy Goat Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":61549,"name":"中国式家长 / Chinese Parents","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a38/a38f1c95fc5b134974a083087dc06052.jpg","description":"<h3>Follow Us</h3><p>Want to know more about the latest info？Follow Coconut Island Games now!</p><ul><li><strong>Facebook</strong><br/></li><li><strong>Twitter</strong><br/></li><li><strong>Youtube</strong><br/></li><li><strong>Discord</strong></li></ul><br/><h3>About the Game</h3><br/><br/>In this casual yet realistic life sim with a Chinese authenticity, you step into the shoes of an average kid from the first day of life towards the end of your high school days. <br/><br/>Study hard, have fun, make friends and face the “Gaokao”, one of the most critical examinations in your life. And perhaps this experience might also give you a special perspective to explore your relationships as a parent and as a child.<br/><br/><br/><h3>A unique slice of life simulator</h3>You are a child born in an ordinary Chinese family. Prior to Gaokao, one of the most critical examinations, you have 18 years to enjoy your life and make choices to be yourself.<h3>Be a Chinese kid</h3>As a girl or a boy, different experiences from heartfully weaved stories and distinctive characters awaits you.<h3>Use “Fragments” to improve yourself</h3>Raise your stats with Fragment mini-game. Higher stats improve your character through learning new skills.<h3>Tiger Parent, or not?</h3>Scheduling every detail, either ensure a happy and stress-free life, or force the kid to study as hard as possible? It’s all up to you.<h3>Live the life as a Chinese child with various mini-games</h3>Expect a life full of challenges. Do you have what it takes to defeat your annoying and cocky neighbors in the Face Duel? Or can you maintain your cool while trying everything to grasp the Red Pocket against your relatives in a courtesy manner?<h3>Multiple friends to date with</h3>You are not alone, after all you need a social life. Choose and date with 14 friends in total with various interaction in order to know them better. Who knows what post-graduation fairy tales will happen to these childhood sweethearts?<h3>Over 100 career endings</h3>Persuade your dream career, and choose your own life. Will you settle to be an average nobody, or only after reaching the top of everything will your ambition be properly answered?<h3>Your family journeys on, from generation to generation</h3>Your child in the next game will benefit from your achievements in the previous generation. Don’t forget to check back your roots to find courage and wits for the future.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"墨鱼玩游戏","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":60752,"name":"Gift of Parthax","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/401/401f61aec8c667b82f65d849cc7275b9.jpg","description":"2D top-down arena fighter in a gothic pixel art style. Follow the story of Arif, a mage on a quest of saving his friend.\nArif promised to become skilled and powerful enough to prevent his friend’s death. Beating all enemies in Atixa’s grand arena and receiving the Gift of Parthax might be his only chance to do so. Unleash Arif’s power and survive several seasons with waves of mobs and mighty bosses with the help of customized and enhanced spells, to defeat the champion and claim the main prize.FeaturesSurvive 5 Seasons of Challenges in the Wizards’ Colosseum of Atixa\nBattle against Mythological and Magical Beasts in the Colosseum\nSeveral unique boss fights\nLearn, modify and customize elemental spells\nDecide your character’s development within a mature storyline\nInteract with the characters and discover more about the lore","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Foldergeist Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":59848,"name":"Impulsion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c5/4c58035274fb76be0b5c6e4c40bc90a7.jpg","description":"Make your way through 25 levels of increasing difficulty by manipulating physics to your advantage, shooting force fields to slow down or speed yourself up and the environment!\nTired of easy games? Hop into the Competitive and Speedrun modes to climb the leaderboards! Challenge your friends, online players and yourself! Be prepared... It's not going to be easy.KEY FEATURES Fast-paced platformer in first-person experience!\nChallenging levels providing hours of gameplay\nStory Mode with an intriguing science-fiction story filled with funny dialogues\nCompetitive Mode with Steam leaderboards to challenge the world ...and your friends\nSpeedrun Mode with an in-game timer for players looking for the hardest of challenges!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Driving Force Games","platforms":[{"id":0,"name":"PC"}]},{"id":54481,"name":"Pokémon Stadium","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67d/67da39fd51f95e3b591264a3641c8be0.jpg","description":"Pokémon Stadium, released as Pokemon Stadium 2 in Japan, is a strategy video game developed and published by Nintendo for the Nintendo 64 video game console. First released in Japan in April 1999, it was later released as the first Stadium title in Western regions the following year, and is a sequel to the Japanese-only 1998 Nintendo 64 release, Pokémon Stadium. Gameplay is built around a 3D turn-based battling system using the 151 creatures from the Game Boy games Pokémon Red, Blue, and Yellow.\nUsing the Transfer Pak accessory that was bundled with the game, players are able to view, organize, store, trade, and battle with their own Pokémon uploaded from Pokémon Red, Blue, and Yellow. One main focus of the game is completion of the four stadium cups, each of which is a series of three-on-three Pokémon battles against an ordered lineup of opponents. Another battle mode called Gym Leader Castle allows battles against the eight Kanto gym leaders and the Elite Four. Other features of Pokémon Stadium include mini-games, versus-style battles, a hall of fame, compatibility with the Game Boy Printer, and a built-in emulation function for Pokémon Red, Blue, and Yellow.\nPokémon Stadium went on to become one of the Nintendo 64's best-selling titles, reaching one million copies sold before the end of 2000. Critical reception of the game was mixed, with critics praising the game's visuals but finding fault with the audio quality. A sequel, Pokémon Stadium 2, was released in English-speaking regions in 2001 as a counterpart for the next-generation Pokémon Gold, Silver, and Crystal games.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":54380,"name":"Donkey Kong 64","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/458/4589f9727a1b8bcc0109e5a33a4ea944.jpg","description":"Donkey Kong 64 is a 1999 adventure platform video game for the Nintendo 64 console, and the first in the Donkey Kong series to feature 3D gameplay. As the gorilla Donkey Kong, the player explores the themed levels of an island to collect items and rescue his kidnapped friends from K. Rool. The player completes minigames and puzzles as five playable Kong characters—each with its own special abilities—to receive bananas and other collectibles. In a separate multiplayer mode, up to four players can compete in deathmatch and last man standing games.\nRare, who had previously developed the Donkey Kong Country games, began development on the 3D Donkey Kong in 1997. A 16-person team, with many members recruited from Rare's Banjo group, finished the game in 1999, when it was published by Nintendo for North America in November and worldwide by December. It was the first game to require the Nintendo 64 console's Expansion Pak, an accessory that added memory resources. The game had an exceptionally large marketing budget that included advertisements, sweepstakes, and a national tour.\nThe game received universal acclaim from reviewers and was Nintendo's top seller during the 1999 holiday season, with 2.3 million units sold by 2004. It won the 1999 E3 Game Critics award for Best Platform Game, and multiple awards and nominations from games magazines. Reviewers noted the game's exceptional size and length, but criticized its emphasis on item collection and backtracking. Some cited its similarity in gameplay and visuals to Rare's 1998 predecessor, Banjo-Kazooie, despite Donkey Kong 64's mandatory memory add-on. The game's camera controls also frustrated reviewers. Critics felt that the game did not meet the revolutionary potential of Donkey Kong Country, but remained among the best 3D platform games on the console.\nDonkey Kong 64 is remembered as the emblematic example of Rare's \"collect-a-thon\" adventure platformers for the tedium of its collection tasks. A rap song from the game's introductory sequence—the DK Rap—is often cited among the worst songs to feature in a video game. The title was later released on Nintendo's Wii U Virtual Console in 2015.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Rare","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":47330,"name":"Deadbeat Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/878/8789430eb4bc7609a1010a12b6149319.jpg","description":"London’s Super Heroes have been vanquished. Only the Deadbeat Heroes can put an end to dastardly evil-doers and their rotten plans!\nDeadbeat Heroes is a movement based 3D brawler where you (and a friend) dodge bullets, steal super powers and crack wise. You play as the new wave of ‘Deadbeat Heroes’. Not born with their own powers, they are armed with a prototype super gauntlet - which has the ability to 'borrow' the powers of others. You will (both) vie to win the hearts of the public with your amazing daring do, while not getting shot, sliced, lasered, exploded, vaporized, eaten...\nKEY FEATURES:\nPower Fists Forever – Choose from one of 10 explosive abilities including a rocket powered punch, freeze ray and invisibility\nLondon’s Streets – Over 35 levels set across London\nExtreme Traversal – Wall Run & Air Dash through London\nAlone or with a Friend - 1 to 2 player local campaign co-op\nTwitch Streaming – Chat appears in the news ticker, chatters become baddies and are featured in end of level credits\nGroovy Baby - A groovy cell shaded aesthetic bringing 70’s style to the 21st century\nBringing the Bass - A funky original soundtrack created by Pitstop Productions\nDulcet Tones - Featuring the vocal talents Jim Howick and more\nDo you have what it takes to save London’s streets?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Deadbeat Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":47309,"name":"Think of the Children Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ca/0caf7645e1544f7ea2f66b2930abe82c.jpg","description":"Little Bobby’s dead, the BBQ is on fire, Jen’s eating poisonous berries and the birthday cake still needs icing. It’s just another wonderful day out with the kids in Think of the Children, a chaotic parenting simulator for up to four players.\nHauled before the court for bad parenting and endangering the lives of your children, the Prosecutors present a series of events as evidence that will either condemn or exonerate you: a birthday party at the park, a day at the zoo, a camping trip, an unexpected visit to the Australian Outback and more. Each of these locations proves to be far more dangerous than they sound, and even the tamest of environments are filled with deadly hazards.\nRun solo, or team up with other parents to play through each trip in flashback to prove your parenting skills-and your innocence-to the judge, and avoid going to jail.\nMulti-tasking mayhemThere’s never a dull moment when you’ve got the BBQ to tend, picnic tables to set, some of the kids are playing with a rabid dog, and two of them just ran out onto the road.Parenting is hardTo get a good parenting grade and avoid jail time you’ll need to get all your tasks done, keep the kids happy, and–ideally–alive!Nowhere is safeThe local park, the beach, the supermarket, the zoo. Great places for a day out with the kids. That is, aside from the poisonous berries, ravenous seagulls, towering grocery shelves and electrified pens.All kinds of families welcomeSingle parent? Two mums? A mum, two dads and a horse in a long distance relationship? It’s all good. Parent solo or co-operatively with up to four players.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]}]