[{"id":19671,"name":"Blueberry Garden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc5/fc5d78947cd72818d2be578c8292506c.jpg","description":"Congratulations Blueberry Garden!  Winner of the Seumas McNally Grand Prize for 'Best Independent Game' at the 2009 Independent Games Festival. Also a winner for 'Best Innovation' at the 2008 Swedish Game Awards.\nBlueberry Garden is a short and experimental game about exploring a strange world. It is set in an ever-changing ecosystem and your goal is to find out what's going on among the softly swaying trees and mysterious creatures living there.\nThe game is a relaxing, yet intense experience for people who like soaring through the sky.\nKey features:\nInteractive fairytale  — no film sequences or dialogues\nFood  — Try out the effects of various fruits and use their effects to navigate the landscape more easily\nStory  — Experience two different endings depending on your choices and your skill\nLiving world — Plants, fruits and animals living in symbiosis\nMusic  — Fantastic piano tunes by Daduk","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Erik Svedäng","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19265,"name":"Runeous: Part One","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba0/ba0613f821b65864ecfd0371c6445976.jpg","description":"About\nRuneous is a 2 part story. In this episode we introduce the characters and the main plot which will be concluded in part 2.\nEach installment is free to play and serve as a beginning for our studio's future products.\nThis Episode contains roughly 20 minutes of game time.\nStory\nThe story follows a small group of heroes in a world ravished by the wars of its past.\nRunestones possessing magical qualities are what fuel the industry, their secrets long ago lost.\nHumans research them to unlock their hidden potential.\nOverpopulation in cities built for far fewer inhabitants. Homes built atop homes with giant walkways connecting the various levels together.\nThe world of Ceir'a faces a new threat. It is here that Leif, a young runic apprentice meets a Jacawi tribeswoman Eme. Together they must overcome the differences of their people and unite the factions to thwart the rising evil empire. Though not all is as it seems when the very fabric of nature begins to fall apart!\nCharacters\nThe story follows 4 main characters and various 'NPCs' who help the story along. Being a story of 2 parts, we will be introducing more plot essential characters in the second episode.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Novel Tea Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19013,"name":"Let's Explore the Airport (Junior Field Trips)","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/764/7648ce7a163c99fd161921129d14c135.jpg","description":"Let Buzzy the Knowledge Bug take your kids on a fun-filled tour of their favorite places!\nLet's Explore the Airport captures all of the fun, energy, and excitement of a real, working airport. Kids can check out the ticket counter in the main terminal, work the controls in the cockpit of the Concord, and see how the ground crew prepares the planes. Players can even sneak behind the scenes and find out where the baggage really goes. And that's just the beginning of this incredible tour.\nJunior Field Trips turns kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to come back to The Airport again and again. It's a place where curiosity and understanding reach new heights - and the fun never stops.\nGet Ready to Board!\nThe Airport has over 40 incredible locations to explore. Just point and click and your own your way.\nMeet your Tour Guide.\nBuzzy the Knowledge Bug is your official Airport guide. He'll show you where the throttle is, tell you how radar works,- and even tell you what an altimeter is! All at the push of a button.\nEvery picture tells a story.\nMore than 200 jobs, machines, tools and other objects are defined and explained in detail. Just click the mouse button and Buzzy reads the descriptions out loud.\nSurprise click points.\nThere's no telling what will happen when you click on a float plane, the control tower, the heliport and more! Things transform and create a lively world of sights and sounds that children love.\nLearning has never been so much fun.\nKids can go on a scavenger hunt, track luggage through a baggage maze, color pictures, learn fun facts, and match items with words- all in 5 fun-filled games.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18403,"name":"Silver Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/144/144e3823936fcbc0b448d29d91688c8b.jpg","description":"Silver Knight is a unique isometric mini-RPG with randomized enemy spawn placement that offers a challenging new experience each time you play.\nAny second can become your last in this dangerous land. Think twice before making your move — lives are extremely hard to come by in these parts.\nBut above all, remember; the Black Knight must die.\nKey Features\n- 30+ enemies, with beautiful designs and varying abilities.\n- Over 4 bosses.\n- Rooms packed with eggs and boxes !\n- A new experience each time!\n- Gallons of Pixel blood !\n- Hidden item shop for your Knight.\n- Secret bosses.\nI made this game for you! Join me my friend, and find your princess!\nDeveloper\n~ Wojciech Krupinski","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wojciech Krupinski","platforms":[{"id":0,"name":"PC"}]},{"id":17677,"name":"Krautscape","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cab/cab312bc5ca12368750f51b5155a0667.jpg","description":"Krautscape is an action-packed racing game with bird-like flying cars and procedurally built racetracks. The leading player builds the racetrack while the chasing players can take shortcuts by flying off the track to overcome obstacles. But the track is needed to score and to get speed – the vehicles don't have any thrusters to accelerate while flying.\nKrautscape features three unique multiplayer gamemodes that are designed to support nonlinear gameplay and intelligent movement instead of forcing you to drive perfectly. Three singleplayer game modes introduce you to the basic mechanics of driving, flying and track building.Key Features\nFlying cars: Glide through the air like a bird\nBuild a racing track while driving – each race creates a new track\n3 multiplayer game modes with completely different goals & gameplay: Snake, Ping Pong and Collector\n3 singleplayer game modes, focused on driving, flying and track building\nMultiplayer game modes are playable online, on LAN or in splitscreen mode (up to 8 players)\nFree play sandbox mode\nOriginal adaptive soundtrack\nSteam leaderboards and achievements\nKeyboard and gamepad support for XInput compatible devices on Windows, Xbox 360, PS3, PS4 gamepads on Mac/Linux","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mario von Rickenbach","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17153,"name":"Control Craft 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96a/96a4b39100978a18f6ca8bb5fffb2f60.jpg","description":"Control Craft 2\nControl Craft 2 is a fast paced RTS, which brings quick thinking and clever tactics together for some planet conquering action.\nBadges :\nEnhancing everything which made the original a hit, with stylish graphics and addictive game play, Control Craft 2 will keep you coming back for more.\nTake command of your troops and lead them into battle. Send in wave after wave of your soldiers to overthrow the enemy colonies and occupy their bases.\nBattle your way through challenging levels and upgrade your weapons. Combine your different attack units (light, heavy and flying) to out wit the enemy and claim the planet as yours.\nFEATURES :\n*24 Unique Levels\n*Clever 2D Platform Level Design\n*Stylish Graphics and Smooth Animations\n*The Ability to Upgrade Your Firepower\n*Hear the Troops React to Your Orders as You Direct Them\n*Unlock Levels and Choose the Non-linear Path to Victory\nControl Craft 2 adds to the unique style and game play of the original. This game is easy to pick up but hard to put down.Take Control and Smash the Enemy. Your army needs you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Elite Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16444,"name":"The Bluecoats: North vs South","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e44/e44c2e1695cb1e3d7ca73bb898d8c84a.jpg","description":"Reunite with Sergeant Cornelius M. Chesterfield and Corporal Blutch in this remastered game that combines turn-based strategy and real-time action. This new version will delight fans of the original game, initially released on the Amiga at the end of the 1980s!\nMaster turn-based strategy to achieve victory. Take control of new states, secure forts and railways to increase your resources, and lead reinforcements sent over from Europe. Discover or relive the experience of the original game \"The Bluecoats: North and South\", in single or two-player mode, with this updated version featuring redesigned gameplay!\nWhether you're a rookie or an experienced player of strategy games, you can personalize your experience with a variety of options available to activate.\nDiscover various episodes in the history of the American Civil War by choosing which year to start in. You can attempt to change the course of history or maintain your positions.\nFeatures:\n3 different gameplay modes:\n- Turn-based strategy map: take charge of operations and move your battalions to capture new states, engage the enemy, or strengthen your positions.\n- Real-time battles: get to the heart of the action and directly confront the enemy. Use your infantry, cavalry and artillery to achieve victory. Use the strengths of each corps to crush your opponent.\n- Attack and defend forts and trains in FPS mode. The totally redesigned gameplay puts you in the shoes of the soldier. Defend your positions from the invader or take the initiative by attacking enemy possessions.\nFull two-player mode.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Microids","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":14841,"name":"Divine Slice of Life","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c87/c87b9b13942c0ac97f7ec7d832331141.jpg","description":"Take on the role of Aaki, a seemingly normal if somewhat self conscious young man, whose life is turned upside down after a casual stroll through the local park. Now he has to deal with two mischievous demi-gods who insist he must marry one of them. If that wasn't enough it seems that several women he knows have also decided he must go out with them, and all the while he has his exams to deal with too.\nIt's a tough time for Aaki in this little Divine Slice of Life.\nThe game features a large script and amazing artwork to tell Aaki's story giving the player key choices to make throughout which in turn effect how Aaki's life is shaped and what the games final ending will be.\nFeaturing:\nDetailed Story with Multiple Alternate Endings\nVoice-acting for the main characters\nFive separate female romance options\nFun, Tongue in Cheek script\nMultiple choices with a branching story\nDedicated Original Soundtrack\nUn-lockable in-game gallery\nSteam Trading Cards\n5-6 hours of gameplay on the main story-lines","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"AJTGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14469,"name":"Millennium 2 - Take Me Higher","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f2/8f231464234e73ba6281507e555d7ffc.jpg","description":"Backstory\nMillennium 2 is the direct sequel to Millennium - A New Hope, the new epic saga of Aldorlea Games, specialists in RPG and Adventure. Will Marine gather the people she needs so that they can challenge the Lords of Mystrock to a legendary showdown?\nWith magic and marvels a world and journey await you.\nDetails\nMillennium 2 is the second episode of Aldorlea's flagship series (the makers behind The Book of Legends, Moonchild, Dreamscape, 3 Stars of Destiny, Asguaard, Undefeated etc.).\nFeaturing an immersive story, this game is a fantastic chapter to a series greenlighted by the Steam community that spans over 5 episodes and features more than 20 characters in total. Key Features\n30+ achievements to unlock - can you get them all?\n4 levels of difficulty - choose your difficulty and enjoy replaying the game at its most challenging\nChoose visible or invisible monsters - cater to the encounter style you prefer\nOptional guiding arrows - enjoy the game without the worry of having to look up a walkthrough or guide\nDozens of secret rooms - for those who like to explore and discover every secret\n40 quests - easy request from a villager or very tricky riddle to solve, help people as you progress in your adventure\nBattle superb monsters including 8 Animal Kings - they are the most dangerous and feared creatures out there, so beware\nGet help from Jeanne - your magically-gifted fairy friend that you can summon when you really need that little something extra\nGorgeous retro graphics and musics - Millennium features high production values in its genre, all for your enjoyment Best-Selling Games by Aldorlea\nhttp://store.steampowered.com/app/277470\nhttp://store.steampowered.com/app/332380\nhttp://store.steampowered.com/app/370670 Aldorlea Useful Links\nOfficial Website (contains 100+ games including all 15+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)\nMillennium Help Forum (tons of info to be found there for the aspiring adventurer)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aldorlea Games","platforms":[{"id":0,"name":"PC"}]},{"id":14031,"name":"Starpoint Gemini","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7f/a7fa4f4a52d0e35c9beb515fd11e2374.jpg","description":"Starpoint Gemini is an RPG tactical simulator focused on the control and strengths of individual vessels. In SPG ship captains and their skills make the greatest difference in large-scale battles. The games is set in a science-fiction universe where various thriving technological directions exist side by side.\nAfter spending almost twenty years trapped in the so-called Stasis rift anomaly, unaware of the passage of time, player reemerges into normal space to find Gemini and indeed everything he knew, had changed beyond recognition.\nThe Gateway stood as the entry point to the Gemini system, but events that took place two decades ago closed the wormhole and practically sealed the system off of the rest of the universe. The isolation and the appearance of countless anomalies enabled unforeseen technological advancements. Political intrigues, greed and lust for power have shaped the fate of Gemini and it is almost time for reckoning .\nPlayers will freely traverse the rich and filled vastness of the Gemini star system, fight skirmishes with rogue ships, trade commodities, research anomalies, buy new vessels, upgrade their ships with state-of-the-art technology, increase their experience and rank to learn more powerful maneuvers and ultimately use all that in large scale engagements against other fleets of hostile ships. Gemini is a dangerous place with riches waiting to be claimed by the more daring and capable captain.\nKey Features:\t\t\t\t\t\tFree-roaming space waiting to be explored.\nVast and interesting Gemini star system, divided into more than fifty large sectors connected via entrances into hyperspace torrents, called T-Gates.\nNumerous space stations, asteroid mining bases, asteroid fields filled with ore to be mined, randomly appearing anomalies, random encounters with hostile pirates or vessels in distress, trade convoys, military patrols, nebulas and much more are all there to create a deep and immersive experience of a living star system.\nDeep and intriguing storyline filled with schemes and twists, drives the player further into the main plot.\nNumerous scripted side missions offer a break from the main plot and give more insight into the setting of Starpoint Gemini.\nMore than 300 Freelance missions can be found and taken on stations through Freelance commission.\nIntuitive and user-friendly interface.\nDiverse skill system offers more than 30 upgradeable vessel maneuvers.\nIncreasing your rank leads to more options including the ability to purchase larger ship classes.\nChoose from many different perks to gain additional passive bonuses.\nShips have special built in abilities, which makes even smaller ship classes very useful in fleet battles.\nUpgrade your ships with more than 300 ship systems ranging from weapons and energy shields to power cores and thrusters.\nEnlist additional experienced personnel for your ships to gain skill bonuses.\nRandom global events will influence almost all aspects of the game world (like chance for pirate encounters or commodity prices). '\nA comprehensive \"Captain's Log\" will enable you to keep track of ongoing missions and events.\nFree Gladiators DLC Features:\t\t\t\t\t\tFour new ship designs add to the already large number of unique vessels\n50 new special ship systems that can only be awarded for victories in Gladiators\nOuter Horizon, a new sector of Gemini where the special tournament is held\nSeries of difficult combat situations like Free-for-all and Team fights\nCompletely free-of-charge as a big thank you to everyone who supported us in developing and improving Starpoint Gemini\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Little Green Men Games","platforms":[{"id":0,"name":"PC"}]},{"id":13162,"name":"Putt-Putt Saves the Zoo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a1/1a15084d6e6be398d2239a46826d0ca7.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameThings have gone wild at the Cartown Zoo!\nToday's the grand opening of the Cartown Zoo, and there's still so much to do: zoo chow is running low, and all the baby animals are missing. Putt-Putt® and Pep need your child's help to reunite the little ones with their parents before Outback Al can open the gates. Along the way, they'll swing across alligator-infested rivers, play ice hockey with a polar bear, build a bridge out of icebergs, bop with dancing penguins, and enjoy other adventures. This zoo is full of loyal friends and captivating challenges that are sure to run wild through your child's imagination.\nTake breaks from the action to play games, sing songs, paint Putt-Putt® or learn about the animals you find in the zoo.\nClick Points reveal hundreds and hundreds of hidden surprises.\nUse Putt-Putt's® special camera to take picture of your favorite zoo animals and print them out.\nOut of time? You can save the game and finish it later.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":12764,"name":"Shadowhand","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c7/0c790e33e8b8dda06bc9300ef044e2cf.jpg","description":"RIDE WITH SHADOWHANDShadowhand is a strategic RPG card game. Duel powerful enemies with unique solitaire-style turn-based combat. Build mini-decks and equip your character strategically to sneak, slice and blast through foes!SET IN LATE 18TH CENTURY ENGLANDWe follow the story of Lady Cornelia Darkmoor, a beguiling young aristocrat who masquerades as the notorious highwaywoman, Shadowhand. Fleeing a crime scene and forced to act under the cover of darkness, Shadowhand's mission to safeguard a woman she holds dear leads to a web of corruption, smuggling and blackmail.IT'S TIME TO STAND AND DELIVER - YOUR FORTUNE AND FREEDOM ARE AT STAKECombining an historical visual novel narrative with a card-driven RPG, Shadowhand's story spans 20 chapters of atmospheric locations including stormy coastlines, mysterious woods and gloomy manors. Featuring 180 levels of elegant and intense single-player card action, players must dodge the law and brawl with outlaws in turn-based combat, gaining experience to customize their character and collect new weapons, gear and loot.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Grey Alien Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11211,"name":"Force of Nature","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/220/2200be379c3122b06cb40c8c81656133.jpg","description":"Force of Nature is a Sandbox game that combines Action, Adventure, RPG, Strategy and Management genres.\nThe player will explore more than 10 different zones, each with its own unique flora and fauna. You can gather and mine resources, create weapons and clothes, build houses, different crafting tables, laboratories and grind your character. Look for useful plants, grow them on seedbeds and domesticate animals to get a stable supply of food. Build portals for faster movement around the world and use map in order not to get lost.\nFeatures\nRandomly generated open world\nDay/night cycle and dynamic weather\nBuild, craft and farm systems\nAny object in the world is destructible\nLots of creatures, monsters, wild and peaceful animals, weapons, clothes and constructions\nGenerated proportions of ingredients for potions\nSome monsters can be tamed to fight for you","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"A.Y.std","platforms":[{"id":0,"name":"PC"}]},{"id":9973,"name":"Dynasty Feud","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13b/13b43ae38d92c4707eb2d19c31e33eb9.jpg","description":"Dynasty Feud is a competitive, team-based, fast-paced platform brawler for 2-4 players. Play either local or online and show off your skills with 40 characters, one-hit kills, multiple fighting skills and a lot of style.\nOK, but... what does that mean? Well, Dynasty Feud is different from other brawlers out there, taking inspiration from several genres to offer an experience that is faster, leaner, and a lot of fun!\nBeat other dynasties in the ultimate battle between time periods in free-for-all and team matches.\nCustomize your own dynasty in the ALL-STAR MODE.\nChallenge other players in quick ONLINE matches or rise to the top in RANKED MODE.\nMaster all 40 CHARACTERS of the 8 DYNASTIES currently available!\nIn Dynasty Feud you won’t pick a character to fight, you will pick a whole dynasty formed by 5 of them. The characters are your life bar, if you lose all of them, that’s it, you are done. What, really? No way! And they die fast, really fast, REALLY REALLY FAST; one hit and that character is gone. Yeah, gone. The next character will appear, but it will be a totally different one, with its own weaknesses and strengths.\nValue your characters and measure your movements carefully. Knowing their capacities and how to use them is as important as knowing your enemies. Plus there are 40 like this, so... have fun. A miscalculated jump, a surprise burst or missed attack can be the difference between death and glory. Uuuhh, that sounded serious.\nEach character is unique. Each character plays different. Each dynasty is special.\nFrom melee juggernauts to sneaky snipers, along with invisible ninjas and a TNT-loving cactus, a true Dynasty Master can adapt to any opponent by making the most of each of its family members.\n\nLet's see who they are shall we...\n\nThe Cartwrongs are specialized in LONG and MEDIUM RANGE bullet attacks. Their key to victory is to keep enemies away by using their zoning abilities.\n\nThe Yngling Clan is a well balanced dynasty that specializes in very strong MELEE and effective MEDIUM RANGE THROWS, as well as good defense and mobility.\n\nWith a good mix of PROJECTILE, EXPLOSIVES and MELEE, the Fancier's Crew are a pretty balanced bunch.\n\n\nThe Nekoyama-Shi is the most MOBILE dynasty in the game, with excellent MELEE aptitudes to boot. Take advantage of both.\n\nThe Uurg Aaarg members are a mixed bunch with decent PROJECTILE and mid range capacity, as well as some powerful MELEE options. They are hard to control, but powerful once you master them.\n\nThe House of Arthur is an exceptionally resilient dynasty, with many of its members having shield and armor. They do sacrifice mobility and reach.\n\n\nThe People of the Sun's main strength is in their powerful SUPER FEUD attack, in which each character gains a special power, coupled with their ability to sacrifice themselves to automatically fill the SUPER FEUD meter.\n\n\nThe Project X-22 subjects rely on their unique mind power mechanic. They spend mind energy to attack, which they then need to recharge. However, if they have enough mind energy saved up, they can withstand a hit. Probably the trickiest dynasty to master.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kaia Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1349,"name":"PSYCHO-PASS: Mandatory Happiness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5dd/5dd4861e6e636e7ae19887ca2690dd6a.jpg","description":"In the new future, everyone's mental state and disposition can now be quantified.\nEverything from emotional tendencies to criminal behavior are recorded and utilized as a guideline to lead everyone to the good life: not only pursuing happiness, but attaining it. Needless to say, the public was excited to begin quantifying their everyday lives. The general term for this value, which determines the morality of an individual's heart and soul, is commonly known as the Psycho-Pass.\nOne component of this value is the Crime Coefficient, which is ultimately a number that represents an individual's potential to commit crime. In order to combat those who attempt to disrupt the status quo, detectives work in tandem to maintain peace and order, composed of Enforcers and Inspectors. The former is tasked with apprehending suspects, while the latter oversees and commands their subordinate colleagues. After all, Enforcers possess high Crime Coefficients. However, because of their criminal nature, they can better understand what makes other criminals tick, allowing them to sniff out suspects and arrest the true perpetrators. But because of their criminal background, Inspectors are needed to provide a calm and sound judgement to each case. Ultimately, all members of the MWPSB have to walk a fine line, maintaining their own mental health while facing the worst that society has to offer.\nWith justice in their hearts, the detectives of Division 1 tackle each case, confronting humanity's ugly truths.\nBut, what lies ahead?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NIS America","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":681578,"name":"Echo Generation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0e/c0ebf3ab6ba5a5ce3302c03bf6135761.jpg","description":"Echo Generation is a turn-based adventure game with a supernatural twist. Strange things are afoot in Maple Town: A mysterious crash leads you on a spooky adventure through your hometown. Battle monsters, complete quests and unearth secrets to reveal a conspiracy that transcends time.\nActive Turn-Based Combat\nBecome a battle master and unlock your hidden potential by collecting over 30 Comic Books, each with their own unique minigames, skills and stat boosts.\nGather Your Party\nRecruit adorable pet companions on your adventure and utilize their specialized skill sets to face enemies and bosses. Never leave your pets at home again!\nExplore and Uncover Secrets\nThe folks of Maple Town are always happy to lend a hand as you complete quests and solve mysteries; some may unlock new paths or hint at a secret or two.\nHeartwarming Story\nSet in the 90s, Echo Generation has a heartwarming story about the supernatural, family and the nostalgia of growing up in a small town.\nCharming Voxel Art Style\nImmerse yourself in the stunning voxel art style of Echo Generation, the second title in the developer’s ‘Voxel Trilogy’ of games.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Cococucumber","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":650650,"name":"Agatha Christie - Hercule Poirot: The First Cases","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdc0a80698a806ff3b82f5cc5f475ea2.jpg","description":"In his early years as a detective, Hercule Poirot is invited to a reception by the influential Van den Bosch family, for the announcement of their daughter’s engagement. But tensions amongst the guests run high as a snowstorm descends on the town, trapping everyone inside the manor. The happy event is soon marred by the murder of one of the guests…\n\nIn the right place at the right time, Poirot immediately begins to investigate. What buried secrets and deadly rivalries will he uncover?\nFeatures:\n\n\n\n- Rediscover the legendary detective in an all-new crime story.\n\n- Play as Hercule Poirot in his early years as a detective, when he still had everything to prove.\n\n- Solve a complex murder case where everyone has something to hide.\n\n- Unveil what hides behind the deceiving appearances of the Van den Bosch family.\n\n\n\n- Question all the suspects and glean crucial information from them without their knowing.\n\n- Notice all suspicious behavior as you uncover the dark secrets and rivalries of the upper class.\n\n- Explore a luxurious house full of buried mysteries. There is more to discover than just the murderer…\n\n- Use your talents of deduction to link clues in your mindmap.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Blazing Griffin","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":579531,"name":"Toy Tinker Simulator: BETA","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef3/ef327d578b48d5c639ed19d856b5de04.jpg","description":"Wishlist The Full Versionhttps://store.steampowered.com/app/1510580/Toy_Tinker_Simulator/\nAbout the Game[THIS IS NOT THE FULL VERSION. There are only ten toys in this version]\nToy Tinker Simulator: BETA is a tiny portion of the full game: Toy Tinker Simulator.Repair toys\nDisassemble/assemble toy parts and go through  the repair processes like cleaning, painting, sandblasting, coating, sanding, sewing, filling/stuffing etcRepair as many toys as possible to earn more money and experienceTake before/after photos to see the progressDesign your office and workshop\nBuy furniture, carpets, paintings, plants, flowers, etc and design your officeBuy new tools and equipment to increase your portfolioStart your toy-museums\nBuy and repair unique toysBuy new buildings and design your toy-museumsPlay with master-toys\nLevel up and become masterPlay with master-toys after successful deliveries","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Turquoise Revival Games","platforms":[{"id":0,"name":"PC"}]},{"id":444384,"name":"Nexomon: Extinction","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c65/c65e07a823c169cfa9711f4d3d3ba74c.jpg","description":"Nexomon: Extinction is a return to classic monster catching games, with a brand new story, eccentric characters and over 300 unique Nexomon to trap, tame and evolve.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"VEWO INTERACTIVE","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]},{"id":427532,"name":"Barro F","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7c/c7cfb01d75db1bebb89a4f1d1b2724ee.jpg","description":"Barro F is the new sequel for the game Barro, faster then ever before.\n11 new cars\n10 new race tracks\nSingle player or 2 players local split screen\nNew and improved time trial mode\nUp to 10 cars on the grid","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SC Jogos","platforms":[{"id":0,"name":"PC"}]},{"id":309761,"name":"Talisman: Origins","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d4/2d4b2ec0964bfc30c3e6fea41d59a284.jpg","description":"This new adaptation of the Talisman board game focuses on solo play as you adventure through many epic quests using the full rule-set of the Revised 4th Edition.\nExperience the origins of historic events in the world of Talisman, such as the creation of the Crown of Command, the return of the dragons, the Ifrit war and the rise of the guilds.\nTake control of 12 Talisman characters, including the new Great Wizard exclusive to this game, as they battle to save the land from dragon invasions, double-crossing devils, mysterious guilds and more. OR, play as the bad guy! Bring on the dragon invasion! Destroy sacred chapels! Protect the dungeon from heroic invaders!\nExciting stories set in the Talisman world\n20 quests spread across 4 campaigns covering many dramatic events\n100 Challenges to be completed\nDetailed interactive tutorial\nAchievements track your progress through the stories","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":301521,"name":"Super Jigsaw Puzzle: Generations","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b9/5b9498e3360b733dc3fa177db633a19c.jpg","description":"If you like to make puzzles, Super Jigsaw Puzzle: Generations is your game.\nEnjoy its comfortable and intuitive interface and its relaxing music that will allow you to concentrate on the difficult task of solving these beautiful photos that suppose a real challenge for puzzle lovers.\nSolve puzzles to unlock new ones even more difficult. Up to 30! You will always have several available, do not get stuck!\nDrag the pieces to their position, form groups with them or use the available boxes to divide them by colors.\nConfigurable snap system to avoid stress. Features\n30 different puzzles\nAutosave, you will not lose your progress\nYou can form groups with the pieces and combine them together\nConfigurable snap\nZoom\nRelaxing music and atmosphere","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Flat Cat Games","platforms":[{"id":0,"name":"PC"}]},{"id":59041,"name":"Semblance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/911/911f39fc82767d8cfe84a266c10cf68d.jpg","description":"Semblance is an innovative platformer with deformable terrain, set in a beautiful minimalist world. It’s a game that asks, what if you could deform and reshape the world itself? Semblance takes the idea of a ‘platform’ in a platformer and turns it on its head. What if platforms were actually part of the gameplay, part of the way you solved problems?\nExplore a world where the default is soft, where the property of 'hardness' doesn't exist. Each of the game's three worlds explore a new consequence of a planet that can shift, change and deform. Beat back the strange, crystalline infection of hard material by freeing the world's life essences and uncover the dark cause for its appearance\nUnique and innovative deforming platform gameplay:\nCan’t reach a collectible? Just deform and elevate a piece of the ground so that the point you jump from is higher. Nasty spikes in the way? Just deform and push-down  the ground lower so that you can pass by. Squish, bounce, squash and transform the world- and yourself to solve problems.\nBeautiful Minimalist Aesthetic Design:\nExplore 3 worlds bursting with colorful minimalist charm, quirky critters, and calming vistas.  Become hypnotized by each world's dynamically layered score, each with a hint of African aural distinction.\nExplore non-linearly\nThe game allows you to move between puzzles as you wish, never forcing you to find a solution in order to progress and enabling you to come back later. Similarly, the game's narrative is presented expansively, allowing you to explore- and piece together the story for yourself as you roam the game.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nyamakop","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":50711,"name":"Jak X: Combat Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dbd/dbd629dce42e03686c3eea7a96e30737.jpg","description":"After a mysterious invite brings Jak and Daxter to Kras City, they discover that they have been poisoned by the sinister Krew. Krew proceeds to give the duo an ultimatum - race for him in the next Kras City Grand Championship and receive the poison antidote.  Jak and his friends must now race for their lives in the biggest combat racing on the planet - against the best drivers in the world!\r\n\r\nExperience Jak X: Combat Racing for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay (active PS Plus membership may be required), Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PlayStation App.\r\n\r\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\r\n\r\n  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\n\r\n© 2005 Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":47059,"name":"Diamo XL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddb/ddb70725dbf8b3affdea1731082fc3e6.jpg","description":"This is an 'XL' version of my unreleased mobile game 'Diamo'. I have added/changed a variety of things to make it more suitable for the Steam platform. I have been learning to make games in my free time and love making small-yet-solid arcade games with simple mechanics. Please expect 'Diamo XL' to be a small, re-playable, arcade score-chaser game where the only basic goals are to constantly beat your previous score and unlock a handful of alternate player characters. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter, My Website, or the forums if you encounter something wrong with the game, something misleading on the store page, or you just want to say hello.\nThank you for taking a moment to read this; I really hope you enjoy playing my game.\nAdam Nickerson - Nickervision Studios\nSurvive the constant onslaught of obstacles by moving your character to all five zones within the Diamond. Collect points before the enemies smash them and keep moving to keep your multiplier high. Fill in the four triangles to complete the Diamond and get bonus points.\nSimply holding any of the four directional buttons allows your player to move around the Diamonds zones at a high rate of speed, if you just tap the direction your player will move at half the speed.\nUse the keyboard's Arrow Keys, WASD, a controller's DPAD or Joystick, or even the mouse to click the zones.\nEasy to learn, simple controls on keyboard, controller or mouse\nAn endless, fast paced and challenging arcade style game play that constantly gets harder\nUnlock a handful of unique characters to play as with different stats by completing certain tasks\n'Close Call' system that awards extra points for close calls with obstacles.\nScore multiplier and various stat tracking that allows you to perfect your game.\nSteam Achievements and Leader board\nPerfect for playing a round while in Queue for another game :)\nThe in game audio/SFX was provided by my mouth making noises into a crumby consumer mic, and some royalty free SFX from FreeSFX.\nIn game song is Royalty Free Music from Bensound called \"Moose\"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nickervision Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":46831,"name":"Tale of Toast","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38d/38df05759a554400cebf8650474e281e.jpg","description":"Tale of Toast is an open world MMORPG with core gameplay inspired by what made old school MMORPGs endlessly fun and engaging. With its easy to pick up play style, open world player versus player with high stakes for those daring to partake, and its focus on simple yet tactical combat, social aspects, trade skills, procedurally generated dungeons and quality over quantity quests, it is sure to have something for everyone.\nEngaging combat with risks and rewards\nExperience battles throughout the world against enemies, world bosses, players, or by taking part of large scale guild wars. Will you be a villain killing innocent players for their inventory, or will you lead a posse to protect the innocent and take out those villains?\nWith regard to world PvP, the various zones have different restrictions, though you can always take part in a duel or fight without risk inside the PvP Arenas.\nClasses\nTired of being told what you can and cannot do with your character? In ToT, you do not choose a class for your character; you yourself decide what type of character you create. Perhaps you will make a pure melee warrior or a hybrid mage and ranger?\nTrade Skills\nYou may take up a wide range of trade skills such as Mining, Woodcutting, Botany, Fishing, Blacksmithing, Carpentry, Leatherworking, Paring, Cooking, and Alchemy. The number of trade skills you take on is completely up to you. Will you become a generalist or focus on becoming the #1 chef on our high score list?\nDungeons\nWith both world dungeons that all players on the realm can enter, as well as instanced group dungeons, everyone can do their preferred dungeon. Dungeons scale to the level of the players inside, and dungeons are procedurally generated to ensure that each time you enter the same dungeon you will get a unique experience.\nQuests\nWith high focus on quality before quantity, you will not find hundreds of quests that tells you to kill certain monsters, but instead you will find epic quest chains that unlock special features and opens locations for your character.\nWorld\nIn the land of Astaria, you will find an open world taking place in a single zone with towns, capitals, forests, fields, summer areas, winter areas, desert areas, volcanoes, mines, and dungeons for you to explore in a dynamic day & night system and weather system.\nFree-to-Play, but not Pay-to-win\nThe game is Free-to-Play, and offers micro transactions for things such as cosmetic items, pets, guild features, character renames and realm transfers. We have made a strong point to not have Pay-to-Win features in our game, so you will not be able to pay to gain an advantage over anyone else in combat.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Toasty Leaf","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":40314,"name":"Castlevania: Harmony of Despair","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f03/f035fa65f92754eae1540494fcc3b10e.jpg","description":"Step into the shadows of the hell house: Castlevania is back in all its pixel-powered 2D glory, this time in full 1080p! Call upon the series' most hallowed heroes and vanquish your nemesis, Dracula! All-new multiplayer modes like 6-player Co-op and Survival have been whipped up for you, too... but enough talk. Have at it!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":23417,"name":"Bio Inc. Redemption","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a6/9a66f442d945a8059701dec3495ea0f5.jpg","description":"Bio Inc.: Redemption is a complex biomedical simulator in which you make life or death decisions. Create the ultimate illness to infect and torment your victim or play as the head of a medical team and hopefully find a cure to save your patient. Will you be the plague or preserve humanity?\n\nIncluding over 600 actual diseases, virus, symptoms, diagnostic tests, treatments and other medical conditions, Bio Inc.: Redemption is frighteningly realistic. It will captivate you for hours, bringing you into a microscopic world of epic plague proportions!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DryGin Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":22423,"name":"Xpand Rally Xtreme","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89c/89c4d15c77a98343f55d0c617beffbcf.jpg","description":"Xpand Rally Xtreme shows the true climate and conditions of rally racing. Dangerous, technical tracks, based on the world's hardest special stages full of moguls,jumps,grooves and tight hairpins.\nBy winning races amass funds for faster cars and repairs. The player also has the ability to mechanically tune their cars by increasing parameters such as turbocharger efficiency,fitting sports breaks and suspension kits and more.\nFeatures:\nExtreme driving in the toughest possible conditions: Innumerable moguls, bumps, ditches, potholes, grooves and jumps-the ultimate                    test of the driver's skills and his car's suspension.\nLearn to respect a real rally car: Extreme realism of driving a rally car, thanks to the highly-detailed driving physics                    simulation.\nGo head-to-head with AI opponents in two exciting new racing modes:Off-Road Series featuring 4x4 xtreme cars and Touring Challenge with 1000BHP GT and DTM supercars\nOptical and mechanical car tuning and individual parts preference settings.\nSingle race, online play and championship modes","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Techland","platforms":[{"id":0,"name":"PC"}]},{"id":21210,"name":"Odysseus: Long Way Home","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38f/38fd454228cca004b0152b3029567471.jpg","description":"Plunge yourself into the world of ancient Greek myths together with the heroes of Homer’s epic Odyssey. Set out on a 20-year journey starting from the walls of Troy to Odysseus' home on Ithaca. Visit mysterious islands filled with magical creatures on the way. Some will beg for help, while others might want to eat you, or even turn you into a wild beast! Overcome all of the obstacles on the way, and help Odysseus to finally return to his beloved Penelope.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rainbow Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20832,"name":"War in a Box: Paper Tanks","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/535/5351c25e7be113e7f7e1d6f38242f2e9.jpg","description":"Finally the war of paper tanks comes into your room!\nHow long can you hold the defences against paper tanks.\nBuild your towers of paper before they get out of the box and make a big mess in the room. Manage the turrets, upgrade and be careful where you put them... every decision can be fatal! Watch out for the air units, they have a different route!\nTake out your toy box and get ready for some of the most intense battles in a tower defence game that will make you reconsider the entire genre. As peaceful and simple War In A Box may seem for the casual player as fierce and thrilling the action will be once you get your hands on this paper battle madness!\nShred your enemies into pieces with different turret models - from simple guns to Tesla towers – in a battle against both land and airborne units that will do everything to get behind your lines of defence. Featuring real 3D environment and delivering a large number of original levels, War In A Box: Paper Tanks is as addictive as it is simple to play.\nFeatures:\nTrue 3D environment in each level\nTurret and air view with different zoom options\nDifferent game modes for different types of players\nGame speed controls for adjusting the intensity of action\nAvailable for Mac, Windows and Linux","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"DQ Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20791,"name":"1Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10f/10f4dfe2d27477534c2c896fd8d34b81.jpg","description":"1Quest is a turn-based roguelike RPG where you play as a young adventurer who pursues an evil blood cult that has abducted several children, including the princess of the kingdom!\nYou got 7 days before they can start their evil ritual to summon an ancient demon by sacrificing the children. Each region of the realm contains dungeons full of hostile creatures, but you will also find help and get various rewards depending on which path you take towards rescuing the children. But you need to hurry, if you want to save them all...\nFight monsters, grab loot, become more powerful and prevent the blood cult from summoning the demon.Key featuresTurn based RPG\n5 races\n18 Differents classes\nMore than 150 class abilities and spells for characters\nMore than 100 monsters\n20 Differents dungeons with specific rewards\nMagic system based on spell schools and magic affinities for more diversity and replayability","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Storybird Games","platforms":[{"id":0,"name":"PC"}]},{"id":19473,"name":"Armada 2526 Gold Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/278/278ca086d7ce20f2917078d3ef3e2af5.jpg","description":"Conquer the Galaxy In This ‘4x’ Strategy Game.\nLead one of 18 different alien races to become a mighty pan-galactic empire. Manage your colonies, deploy your fleets and conduct research. Plot your strategy and turn your planets into mighty bastions. Explore new star systems, where you may encounter tachyon storms, psychic plants, primitives or find abandoned alien technology. Diplomacy is of utter importance in being successful. Make pacts and alliances, make threats or ask for favours - and when the time is right, replace diplomacy by space combat and fight it out in real-time 3D.\nThe trade system lets you trade valuable commodities between both your own and alien worlds. Alien relics, rare minerals, tourists, or even natural anti-matter, your freighters will carry them all. Although the game is complex, and the possible strategies endless, powerful help and advisor features, help you get up to speed quickly. Unlike many games in this genre, Armada 2526  Gold Edition focuses on providing a game that can be finished in a reasonable time, and emphasizes battle and strategy over economic micro-management. All with one purpose: to emerge victorious and conquer the galaxy with your armada.Key Features\nTurn based star map for fleets, colonies, research and diplomacy.\nCustomizable map size and number of players. Map designer included.\n18 animated alien races to play and battle against.\nFull featured diplomacy system.\nMore than 150 technology items to research.\nTrade system plus espionage and special ops system.\n3D Real-time battle system for fighting huge battles.\nMore than a hundred beautifully crafted ship models.\nMultiplayer by LAN or PBEM\nTough A.I. opponents.\nIncludes the expansion Supernova !","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ntronium Games","platforms":[{"id":0,"name":"PC"}]},{"id":19042,"name":"DreamLand","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fd/8fd5d68a63286e8f476c10846a42e631.jpg","description":"In Dreamland, you can create personalized avatars that represent your virtual identity within the game. you can explore a vast and visually stunning virtual environment filled with captivating landscapes, fantastical creatures, and intriguing challenges.\nOnline Adventure\nSome games in Dreamland are very difficult. If you encounter difficult levels during the game, you can invite friends to work together to overcome them.\nThe challenges you will face\n• Experience the horror and danger of zombies in ShootTheZombie and OtherShore\n• Defeat the evil cowboy in the town in the WesternRanger\n• Playing the adventurer in DungeonHunter to explore unknown underground castles\n• Break into the dangerous laboratory in GunHunter and defeat the evil organization\n• Use watermelon and cars to eliminate the threatening enemy in CrazyThrowing\n• Evade the traps scattered throughout LostMaze and find the correct exit\n• Experience real live online shooting battles on ShootingSquare\n• Dream World has now launched 19 different styles of game scenes, including social games, PVP games, and PVE games\nGame List\nHome,Lobby,TheOtherShore,ShootingSquare,TeamBrawl,DesertTown,UndergroundPalace.SpaceSquare,ShootTheZombie,IndividualBrawl,TeamCap,WesternRanger,GunHunter, DungeonHunter,MazeTrial, CrazyThrowing, LoopsFly, LostMaze, GunDuel.\nDreamland is a world full of imagination and adventure, waiting for you to explore and discover. Join us and embark on your adventure!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SandVUE","platforms":[{"id":0,"name":"PC"}]},{"id":18569,"name":"Super ComboMan: Smash Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d86/d860707934ba372deb32cd3138bb8703.jpg","description":"Crispy Combo Action\nEnter a new action hero. An energetic islander with a funked up mullet nugget, wearer of loud Hawaiian shirts, eater of chocolate chip cookies, and owner of a talking fanny pack (yeah, a talking fanny pack). His name is Struggles, and he’s the working class hero with an 'All You Can' attitude, a spinning pile driver, and fireball moves to match.\nHelp Struggles battle an army of baddies and mega bosses from a giant construction organization called DoDoCo. Traverse through vibrant levels, unlock powerful moves inspired by classic 2D fighter games  and punch your co-workers through brick walls in order to collect a paycheck along the way. Help Struggles keep a roof over his and his brother's head in this action packed 2D adventure.\nFEATURES\n●\t2D Fighting Game Inspired Action (you know you love it) – Smash, counter punch, and forward dash into classic 2D platform action and take down an army of DoDoCo thugs coming at you with fighting moves straight outta the classic 2D fighting games move list.\n●\tMega Manga Bosses & Talking Fanny Packs (the obvious bullet point) - Test your twitch gaming skills and take on big beefy bosses with the help of Struggles' trusted flopping side kick, Flappy, the talking fanny pack. Struggles never leaves home without him.\n●\tUnlock & Unleash - Earn your keep by beating down the DoDoCo baddies, and spend your hard earned cash on unlocking new powerful fighting moves like the fire uppercut, air dash, and the ole stand-by dive kick.\n●\tGo Combo Crazy - Rack up killer kombos and activate powerful perks you can unlock in the combo store.\n●\tPerks  - It's going to take more than a loud Hawaiian Shirt and a talking fanny pack to defeat your enemies. Activate powerful perks like Infinite Smash and Heal Parry to put the beat down on the enemy.\n●\t2D Sticker Art Style - Rad 2D sticker art style will make you want to rock your own fanny pack. (Not for the faint of heart.)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Interabang Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16476,"name":"Bridge It +","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e78/e78e5ba20fdb73b49be234b6222f0f50.jpg","description":"Bridge It is about building a bridge that doesn't break, although watching your bridge creation break and plunge a train into the watery depths below can be half the fun.\nSet in the picturesque surroundings of sparse deserts and dense forests it is your task to strategically design and construct an engineering masterpiece. Watch in eager anticipation as unsuspecting motorists, heavy freight trains and tourist riverboats approach. Will your solution stand up to the test or will tons of mangled steel be sent plummeting into the river below?Features:38 challenging levels from novice to expert\nCars, trucks, trains to drive across your bridges\nBoats to really test your draw bridges\nBuild suspension bridges, draw bridges and more!\nAbility to save out and swap levels with friends\nScoring system rewards clever design and cheap bridges\nIntuitive editing tools allow you to build beautiful bridges\nNarrated tutorial levels\nEarthquakes to really put your bridges through their paces!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Chronic Logic","platforms":[{"id":0,"name":"PC"}]},{"id":16443,"name":"Lords of the Realm II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4fa/4fa344c04fc09a5dc246e194fd9ab245.jpg","description":"The lands of England and Wales are ruled by powerful feudal nobles who cruelly oppress the people. They all have their eyes on the English throne, and they’re willing to do anything to seize it. The people cry out for a leader who can unite them: A leader worthy of a kingdom.\nAdvancing the series’ trademark template of turn-based and real-time strategy, Lords of the Realm II takes you into the intrepid struggle of 13th century England.  Turn a ragged band of peasants into an army, build massive castles, make and break alliances, and conquer your enemies on the battlefield. The road to the throne will be dark and treacherous – will you have what it takes to become King?Lords of the Realm II includes:The original Lords of the Realms II game\nThe Siege Pack expansion, which includes additional castles, battle maps and scenariosKey Features\nBuilds on a winning formula with thrilling battles and improved graphics and sound.\nOverrun your enemies’ castles in nail-biting sieges, played out in real-time.\nBe as hands-on or hands-off as you like – your Steward will help manage your kingdom.\nDesign your castles, from inexpensive wooden keeps to impregnable stone fortresses.\nLead your people: Plant crops, collect taxes, build weapons, raise armies and wage war!\nTake on up to 4 friends in multiplayer and prove yourself a Lord among your peers.\nMultiplayer notice: Playing over the Internet is no longer possible. Playing through a LAN is still available.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Impressions Games","platforms":[{"id":0,"name":"PC"}]},{"id":15957,"name":"BoneBone: Rise of the Deathlord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/113/1130660716e4fa222544c287f170300e.jpg","description":"Being a farmer, you have to protect your home from impending danger. Army of the Dead has risen in the western lands.\nThere is no hope. Rely only on yourself. Good luck!\nFeatures:\n• An exciting and intuitive gameplay.\n• Great minimalist design.\n• The wave structure of the game.\n• Tactical gameplay.\n• A variety of enemies.\n• More than 800 types of weapons.\n• Adventure and endless game modes.\n• Army of the Dead is not easily give up!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vladis Fire","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15585,"name":"Darconika: The Cube of Soul","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d3/6d395509081be8ff0fd7da0db0c1f8a2.jpg","description":"The main character Alan Traur, a mercenary. He was tasked to find a girl kidnapped by local vampire gang, but he decided to join \"fangers\". His new mission from vampires - find the Soul Cube, creepy artifact that can extract souls from people.\nPlayer must lead the character through series of events, including fight with indulge, race through the foggy woods against the wolves, prophetic dreams, meeting with the God of Death and solving a seventy-year-old mystery.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Viktor Lazarev","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14071,"name":"Rise of Venice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/135/1351822642209199d1b7c7e0cae1ca67.jpg","description":"Venice was at the peak of its power during the Renaissance and was viewed as a city of decadence, beauty and intrigue.  Renowned as the linchpin of civilization and the cultural centre of Europe, Venice was the most important trading post between Western Europe and the eastern stretch of the Mediterranean Sea.  It was also the stage for political corruptions and clandestine dealings.\nThis is where your story begins.  As a young man striving for success, power and wealth and with the support of your family, you begin to build up a trading empire across Genua, Tripoli, Rome, Alexandria and Constantinople in addition to many other significant cities from the Renaissance.  As you progress through the ranks of Venetian society, increasing your power with smart trading moves and calling in the occasional favour you can begin to assemble your own fleet.  With this you will start to build up new production facilities, test yourself in challenging sea battles where you will face off against pirates as well as political enemies to finally become the Doge of Venice.Key Features:\nExperience a compelling story full of intrigue and treason in Venice at the time of the Renaissance\nTrade a variety of goods in the most important cities of the time such as Rome, Alexandria, Constantinople or Athens.\nWith your own family tree you can interact with your family members, send them on missions and watch how the power of your family grows over time.\nMeet other important families who are pulling the strings in Venice’s government and influence political decisions yourself.\nBuild your own production facilities and trading fleets\nTake fate into your own hands and test your skills in furious sea battles\nMultiplayer mode for up to 4 players via LAN and Internet","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]}]