[{"id":502212,"name":"Virtual Cottage","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99f/99fd9969fc26efd098a52b41c64576b5.jpg","description":"Cats everywhere!Relaxing vibes but more gameplay? Check out  Cats Organized Neatly!\nAbout the GameWelcome to your Virtual Cottage!\nPlease stay as long as you like and enjoy a cozy, distraction-free environment.\nGot some big, uncomfortable tasks you have been putting off for weeks? Virtual Cottage was made to help you start them. Upon entering your cottage, commit to an activity you want to accomplish. Enjoy the relaxing atmosphere to ease your start on whatever you want to get done.\nRelaxing Lo-fi SoundtrackVirtual Cottage features amazing lo-fi music from various talented artists. To complete the relaxing atmosphere, a rain sound can be toggled on or off.\nCheck out more of their work with the links below!The cottage is wherever YOU areThe game automatically syncs with your local time and displays a similar lighting scenario. If you are a night owl, just change your computer clock and the graphics will change as well. ;)Getting things doneThere is no way to stop the timer, except for quitting the game. Once you’ve entered an activity, stay committed and get started!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"DU&I","platforms":[{"id":0,"name":"PC"}]},{"id":74084,"name":"Standoff 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cae/caef6746c4abc9a58cf321eea1d05661_x7PoPO5.jpg","description":"The legendary \"Standoff\" is back in the form of a dynamic first-person shooter!\nNew maps, new types of weapons, new game modes are waiting for you in ths incredible action game, where terrorists and special forces going to engage the battle not for life, but to death.\nIncredible features are waiting for you:\n- 5 maps\n- 3 game modes\n- Friends\n- Lobbies\n- Messaging\n- HUD customization\n- Text chats\n- A lot of fun!\nNext features:\n- Different game modes (\"Deathmatch\", \"Defuse the bomb\", \"Arms race\", \"Capture the flag\", \"Robbery\")\n- Competitive games (\"Defuse the bomb\")\n- New models of knives, grenades, new weapons\n- More maps\n- Skins and exchange between players\n- Voice chat\nLet the battle begin!\n----------------------------------------------------\nWe're in VK: https://vk.com/standoff2_official\nWe're in Facebook: https://www.facebook.com/Standoff2Official\nWe're in Twitter: https://twitter.com/so2_official","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Abdulin Ildar","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":50688,"name":"Long Live Santa!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45b/45b4ce7dc1bc125ccc877b95c50a51e9.jpg","description":"Compete in this brand new epic multiplayer PvP survival game from Doborog Games!\nOriginally conceived as a quick technical exercise in multiplayer game creation, Twitch chat's interest in the game's quirky action and interactive fun led the dev team to go, “let’s actually release this!”The Tale...\nSanta is dead. Now the remaining bearded men of the Norwegian wilderness must fight to the death. Will you be the next Santa, or die in the snow? Punch, slice, outwit your way to a fulfilling new seasonal job.Gameplay\nWith fast and furious gameplay, finding out if you will wear the tattered cloak of Santa Claus has never been more intense. Weapons drop from the sky as you compete against strangers on the internet to be the last one standing.\nCreate or join a server to instantly start a match.\nChoose between two unique game modes - Last Santa Standing, battle-royale-style last-man-standing combat where weapons are scarce but powerful, or Deathmatch, a continuous round with little downtime and instant re-spawns.\nOnce the round starts, all bets are off. Find your weapons, best your Santa foes, and perhaps you will be the Winner, Winner, Christmas Dinner!Key Features\nOnline Multiplayer Combat with up to 8 players per battle.\nGift Boxes drop from the sky containing weapons!\nFestive Weapons! Shoot your fellow Santa contenders with a Candy Crossbow, slice them with your Santa Sword, or just punch them with your bare-knuckle fists!\nLast Santa Standing game mode: seek out weapons, attack enemies, or cower in the corner. Winner, winner, Christmas dinner.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Doborog Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":46893,"name":"Just Dance 2018","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed1/ed118e2ba4e5797d5d2ac99c39720c38.jpg","description":"Just Dance 2018 is coming back on October 26th 2017 with over 40 tracks at launch.  From the hottest hits to family favorites, dance to 40 new tracks, including: • Shape of You - Ed Sheeran • Despacito - Luis Fonsi & Daddy Yankee • 24K Magic - Bruno Mars • John Wayne - Lady Gaga • Waka Waka - Shakira • Naughty Girl - Beyoncé • Rockabye - Clean Bandit Ft. Sean Paul & Anne-Marie ...and many more!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":33696,"name":"Bet on Soldier: Blood Sport","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a74/a7440cb1558aab42a34521298366c888.jpg","description":"In a world where war has been waged for 80 years, the general public revel in televised transmissions of battles, which rage right across the globe.\nThe best soldiers have become celebrity A-listers and their fights draw incredibly huge bets.\nYou take on the role of one of these soldiers and have to forge a career for yourself as a champion, idolized by the masses! If you get tired of the massacring, join up with the resistance and fight the system. They’ve seen you're a natural born leader!\nKEY POINTS:\nBet and kill to earn enough money to survive\nTravel the four corners of the earth, with more than 40 champions to beat in 25 missions\nNon-linear storyline with two possible endings\nFull, evolving arsenal with over 40 weapons\nTwo endings - choose your own destiny","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":23494,"name":"Fidel: Dungeon Rescue","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c77/c77ec8ee7600546591c674cad4073bb9.jpg","description":"Fidel is a roguelike where you can REWIND. <br/><br/>A puzzle-crawler where you trace a path through monsters, treasure and magic.<br/><br/>No grinding, no filler, loads fast, quick to play, and there are many secrets to uncover!<br/><br/>(Don't forget to bark)<br/><br/><strong>Anniversary Update</strong> - Including Daily Challenges, OST (free!), gameplay improvements and even a hidden videogame!<br/><br/>","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daniel Benmergui","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21387,"name":"Little Farm","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db0/db0eb1b42bdfa72e79f2d9682d5f8ee6.jpg","description":"Have a down-home good time at Little Farm, where you'll use your puzzle-solving and matching skills to help The Normans adjust to farm life and grow truck-loads of vegetables!\nThe Normans left the city to retreat to Uncle Nate's farm—but this isn't a farm of leisure! Battle insects, animals and weather as you race against the clock to grow your harvest. Match like-colored patches in your farm field to create squares to water and grow plump pumpkins, excellent eggplants and tasty tomatoes! Collect your harvest while fending off the elements of nature and expanding your family farm beyond the gates of Little Farm!\nRescue, Collect and Wetting Modes offer a garden of variety!\nFind Lost Coins to create your Best Match!\nMake matches quickly to earn Wild patches\nSpend your earnings to invest in new farm equipment\nExpand the family farm across the U.S.!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":20643,"name":"CortexGear:AngryDroids","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e58/e5845229e30d6abe7a76bcfd5503f594.jpg","description":"CortexGear:AngryDroids:\nIN CORTEXGEAR: ANGRYDROIDS, YOU PLAY AS:\nAn alien (main character) hacker who take control of a CortexGear (A robot with an implanted brain) in order to eradicate angry droids. The alien is one of the last survivors from a Cortex war (A war based on hacking the opponent) against the AngryDroids. The alien is also from an upgraded generation of CortexSoldiers (Soldier with great hacking abilities), the generation that ended the ultimate CortexWar against mankind. Discover the extra-terrestrial true origin through the game’s story, in a world infested by angry droids.\n\nTo get and know more about the story, you should visit the game's website page. The full story of the game is placed there.\nBRAVE THE GAME WITH YOUR SKILLS AND REFLEXES\nCortexGear: AngryDroids is a challenging action-adventure game where you have to think logically to find your enemy's weaknesses, to trick your enemies with traps and solve draconic puzzles. You will also be hacking computers, master the use of tricks and combos, because the places are vast and hostile. The way forward is not always clear, and death will meet you as soon as you let your guard down, but be brave, fight well and explore carefully, because droids are angry, and share none of your weak human emotions. No pity.\nMultiplayer (Cross platform).\nMultiplayer stage customization.\nSurvival mode.\n20 extra challenging levels.\nMore than 6 hours of campaign.\nRandom enemy.\n35 different enemies.\nMore than 100 sets of weapons (24).\nTricks list (specials and combos moves).\nThe hardest Sci-Fi shooting sidescroller\nIs a classic 3D Sci-Fi shooting sidescroller where quick tactics and skills need to be in harmony the beat the game. A run-and-gun shooter with both mouse and keyboard controls at the same time. An adventure game with an emotional story and epic game-play, it's a game for PC, Mac and Linux.\n\"CortexGear: AngryDroids\" is an adventure game that will challenge your skills in many forms. Robots with a conscious and they won't budge. With a join us or perish mentality, those AngryDroids are on a mission: 'I will destroy you'\nThe game is hard, skilled and contains violence, intelligent themes, minimal blood, and threatening language.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JH12world","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19789,"name":"Elven Legacy: Magic","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83c/83c8265aec56f8d0955047c3e0d4c25b.jpg","description":"The era of Elven Legacy is coming to an end. The relentless wave of demonic magical energy triggered by the death of the demon Farrakh has swept the world and has now reached the free city of Sylent. Powerless, the Masters of the Academy of Magic are being driven insane. The Holy Inquisition, inspired by the clerics of the kingdom of New Tixus, acts swiftly to intervene in the seemingly hopeless cause of preventing the world’s slide into darkness and madness.\nAt the forefront is Alfred Brennock, the Archmage supreme, who alone is mastered in the arcane arts, and who alone can save the lives and the sanity of his Academy pupils. Using the strength and potency of the Sagittel’s curse, Brennock faces the ultimate test of his will as he creates spells of untold power, summons legions of mystical spectres, and crosses half a world in a desperate attempt to stem the tide of evil.\nBut he isn’t the only one...\n\nKey features:\n15 new campaign missions\nA new hero & return of heroes of old – Runic Dward Mage, Gilven, Master Brennock\nNew tactical skills, armies of summons, and sacred dwarven runes\nPowerful new spells and artifacts that can drastically effect any given tactical situation if used correctly\nBONUS mission that reveals the continuing tales of heroes from “Elven Legacy” and “Fantasy Wars”\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":19164,"name":"Sid Meier's Covert Action (Classic)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a3/7a32b396c30e2421e79b85f25c7c640d.jpg","description":"Sid Meier's Covert Action - A Techno-Thriller From the Case Files of Max Remington.\nIn the 1990's our national nightmares are haunted by wild-eyed political extremists, greedy and ruthless drug lords, and lunatic military dictators. For too long we have felt powerless to stop them.\nBut now, award-winning game designer Sid Meier takes us around the globe with super-spy Max Remington to challenge these threats and neutralize their shadowy schemes of terrorism, smuggling and extortion. A seasoned veteran of modern, hi-tech undercover operations, Remington always obeys the two main rules of Covert Action: 1. Use your intelligence. 2. If Rule one fails, use your other weapons.\nGame Features:\nIntelligence: Recognize Faces, Break Codes, Unravel plots and sub-plots to determine how sub-plots fit together in the larger scheme, Decide which leads to follow, which to ignore\nWeapons: Guns, Fragmentation grenades, Stun grenades, Remote-control bombs, Tear gas\nWorld travel: 3 Continents, 50 cities\nVariety: Work for CIA, Mossad(Israeli), MI5 (British), Unlimited number of cases to solve\nRealism:Crucial decisions international agents face every day, cases based on today's headlines.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19143,"name":"True Bliss","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b41/b410328920e0361505e79b6810b353b7.jpg","description":"Activate brain pathways you never even knew existed!\nModify geometry and experience a gaming genre that is truly unique, different, beautiful and serene all in one. For all you mathematicians out there this will satisfy all your geometric vectoring desires in a way they have never been satisfied before.\n2 gameplay modes - Journey Mode and Freeform Mode\n85 levels\nCreate Beautiful Abstract Line Art\nMove, Deform & Connect Geometry\nMultiple yet interconnected goals\nUnlimited combinations\nA vast library of shapes to play with","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artur Mandas","platforms":[{"id":0,"name":"PC"}]},{"id":18729,"name":"Last Inua","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/119/119a4987a1108bcf5c512152531e1a7f.jpg","description":"A father and son tale, Last Inua will leave you breathless with its immersive, emotional and captivating gameplay.\nLast Inua is an immersive and emotional, award winning 2D platform adventure game developed by Glowforth. Designed for the young and old and mixing classic platform genres, culminating in a captivating experience, Last Inua tells the tale of an Inuit family’s fight for survival against a fearsome demon and the harsh elements of the mythical Arctic.\nThe Tonrar, a demonic trickster, has awoken in the Arctic. The mythical powers that are still very active in this part of the world are under severe threat. The Tonrar is spreading his darkness that is taking over both the physical aspects (ice, snow and caves) but also the mythological. The Inuit gods, giant mythical creatures; the Ice Bear, the Raven and the Narwhal are all under threat by the Tonrar. They are slowly losing their power, health and sanity - infected by this darkness. Hiko and Ataataq are the only hope, yet Hiko is physically and will need to rely on the brute strength of his powerhouse father, Ataataq.\nGuiding Hiko, his physically weak but gifted son along this epic journey, Ataataq will need to rely on his brute strength to overcome many obstacles. Hiko, although more fragile than his father, carries with him supernatural abilities and magical skills that exceed the physical powers of his father.\nTogether, Ataataq and Hiko must traverse the arctic landscape and visit The Trinity of the Mythical Creatures to help defeat the malevolent Tonrar. Physically weak and fragile, Hiko will need the help of his father to reach the end of this wondrous tale.Key Features\nAn immersive + emotional, award winning 2D platform adventure.\nIntriguing storyline, epic scenery, beautiful gameplay & fun puzzles.\nAmazingly handcrafted character animations and artwork.\nControl two unique characters with a strong emotional bond\nA unique world combining Inuit mythology + modern game culture.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Glowforth","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16781,"name":"BIT.TRIP CORE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/928/92870cbe96b886c8533f9840db9b7480.jpg","description":"BIT.TRIP CORE visits a darker place in CommanderVideo's saga, taking the player into unfamiliar territory as they use NES-style controls to blast their way through the barrage of Beats in this rhythm-music adventure.\nCORE is the second installment in CommanderVideo's soul quest with:Classic NES-Style Controls!\nBeautiful Boss Battles!\nA Thumpin' Chiptune-Inspired Soundtrack!\nSpecial Chiptune Guest Star Bubblyfish!\nMind-Melting Challenges!\nRevealing Cutscenes!Download BIT.TRIP CORE to continue your very own BIT.TRIP!Key features:Leaderboards!\nAchievements!\nBrand New Easy Mode!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15763,"name":"Eron","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5cc/5cc6061a533ea9d2781e51ed96a31a05.jpg","description":"Eron is a 2D platform game that allows the player to actively switch between two parallel realms. The player will have to depend upon this power to finish each level.\nIn a distant galaxy, on an uncharted planet code-named, Eron, a special power is hidden. The planet is in constant danger as many seek this power hidden in the planets core.\nYou play as a native tribesman on this planet, who one day discovers that uninvited guests have destroyed your village. It is up to you to find and stop whoever is responsible.\n***THIS GAME MIGHT NOT BE COMPATIBLE WITH YOUR GAMEPAD***\nThis game has only been verified to work on a Xbox 360 controller for Windows and a few similar gamepads.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"David Mulder","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14688,"name":"WORLD END ECONOMiCA episode.03","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ae/3ae9381ff2228c0fc6c639c5b7a65da5.jpg","description":"The conclusive episode in this visual novel trilogy is set in the far future on the moon, 16 years after humans have begun to colonize it. Will Hal's dream be realized? It's been 8 years since the events of episode.01 and his dream is still to stand where no man has stood before, and in order to do so he still needs a ludicrous amount of capital. With the economics of lunar city going out of control what is going to happen next?\nFrom the author of Spice and Wolf, Isuna Hasekura, comes WORLD END ECONOMiCA episode.03. The opening video features music by Kishida Kyoudan & The Akeboshi Rockets, known for the opening songs for High School of the Dead, Strike the Blood, and GATE!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Spicy Tails","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14657,"name":"Spakoyno: Back to the USSR 2.0","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce3/ce33f693c3b002cf009916e676ac23e1.jpg","description":"Spakoyno is a Russian visual novel set in the late USSR. This is a story of an average Russian guy named Kirill. The characters are left at the borderline conflict of old and new society. High crime rates, corruption and a change of morals… Can he survive the new society?\nThe brother of the protagonist has gone into criminal underground and the father spends all his time at work and can't protect his sons. Militsiya doesn't do anything about local criminal groups. Kirill is left alone… Everyone is against him: Kirill doesn't favor neither patriots, nor bandits or soviet conservatives. He wishes for peace in our world, so he decides to struggle.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dagestan Technology","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12525,"name":"The District","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d51/d5140d62b641b66182548807c377a15e.jpg","description":"The District - action with elements of survival in the open world. You will have to look for weapons, to produce supplies, shelter from the weather and to get used to the conditions of a new life.\nThe District - action with elements of survival in the open world. You will have to look for weapons, get supplies, shelter from the weather and to get used to the conditions of a new life.\nThe game takes place in an alternate reality somewhere in the depths of the Russian. There's a crisis in the world, therefore no legitimate governance. The\nmedical science cannot cope with diffirent difficulties. At the same time a new kind of virus evolves in the Russian. Science cannot explore the virus and decides to\nisolate all would-be infected. Because of the abscence of finances, the government comes to ambiguous solution - to send the infected to an empty lands on the outskirts\nof  civilization under the supervision of physicians and the rest of the population. This supervision comes in the form of a reality show. Patients tries to survive,\nhaving scanty resources under 24/7 surveillance. You are the one trying to survive. Look for the other people, collect resources and food. Beware of wild animals. Survive.\nThe game is under development.  Currently, only 20% of all ideas are realised.\nNow we are improving the game in terms of graphics, the map also fill various buildings, loot, Easter eggs and much more.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kotach","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9959,"name":"Clone Drone in the Danger Zone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11b/11bbbc0bed249e0d41d49f3c161e7542.jpg","description":"CONGRATULATIONS HUMAN! 🤖\nApologies for the brief agony while we harvested your mind. But now your thought patterns are safely encased in this sleek, shiny robot!\nWith a laser sword.\nSURVIVE AND PERHAPS YOU WILL EARN UPGRADES.\nGOOD LUCK IN THE ARENA.\nWe hope you survive longer than the last contestant...\nOh, and the one before that...\nGame Modes\n1. Story Mode - One part epic tale of human defiance, another part laser swords.\n2. Endless Mode - Challenge yourself to fight through 86 level variants spread across 5 difficulty tiers. Can you make it to 🏆TITANIUM🏆 ?\n3. Twitch Mode - TWITCH PLAYS YOU. Your Twitch stream viewers earn coins, bet on your gameplay and spawn enemies to kill you (or give you ❤️s—if they really like you). !spawn jetpack2 Kappa Kappa Kappa4. Challenge Mode - Bow-only, hammer-only, can you still survive the arena?\n5. Level Editor - Make custom levels and challenges and share them with other humans! Explore the rich Workshop library of awesome human-built levels!\nFeatures (in the game right now!) Epic Voxel Dismemberment: In addition to looking cool, the ability to cut off body parts is central to the gameplay. Jumping on one leg is a common occurrence. Large enemies need to be cut down to size before a fatal blow can be delivered.\nSharp Sword Combat: Combat is fast and intense, putting great emphasis on movement, timing and positioning. You are never safe, as any blow can instantly kill or dismember.\nEntertaining Commentary: With 7,421 spoken words, Commentatron and Analysis-Bot provide a running commentary of your performance and react to your activities.\nUpgrade your robot: jetpack, bow, kicking, deflection, clones, giant hammers, FIRE 🔥🔥🔥.\nTerrifying robotic enemies that actually get pretty hard! Sword robots, bow robots, Spidertron 5000, Spidertron 6000, gigantic hammer bots. So many things to dismember.Alpha Limitations:\nSee Early Access description above.\nHone your sword skills now, before the rest of humanity gets its turn. JOIN THE HUMAN RESISTANCE!\nOr don't! It's your future-robo-funeral... 😈","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Doborog Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9957,"name":"JumpBall","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/700/70013ca78cfc677b05dc0450eb0a40d8.jpg","description":"These colorful ninjas received a training in JumpBall.\nThis is the Road Mode.\nRun and jump while balancing on the ball.\nDodge the spikes in order to reach the end of each stage.\nEach stage you pass the balls will spin faster.\nIn this game you can play up to 5 players, use gamepad,\nadjust the brightness of the background and choose difficulty.\nDuring the gameplay you only need to use 1 button,\njust for jump.\nSee how many points you can do on solo play or with family / friends.\nSee if you can be a true ninja of JumpBall.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"André Bertaglia","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":576518,"name":"MLB 21: The Show","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f54/f54ccafceb7ac632ae669762336742b7.jpg","description":"OWN THE SHOW\n\nExperience faster, deeper and more intense moment-to-moment match action on the field, with a variety of game modes for all you rookie players and returning seasoned vets.\n• Lead your Ballplayer to Road to the Show and Diamond Dynasty glory as a two-way star.\n• Enjoy updates to Franchise and March to October modes which empower you to better make decisions for the future of your club.\n• Face your friends on PS4™ or PS5™ with cross-platform play*\n• Feel the impact of every hit, catch and collision through the DualSense™ wireless controller’s immersive haptic feedback on PS5™.\n• Hear the roar of the crowd all around you with 360-degree Tempest 3D Audio Tech for compatible headphones on PS5™.\nOffline multiplayer (2-4 players)\nOnline multiplayer (2-8 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nYou can download and play this content on the main PS5 console associated with your account (through the “Console Sharing and Offline Play” setting) and on any other PS5 consoles when you login with your same account.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"SCEA San Diego Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":566447,"name":"Revita","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/532/532e98b7e313a038efee09bacb490876.jpg","description":"A fast paced twin-stick roguelite platformer. Climb an ominous clock tower in a series of procedural encounter rooms and past challenging boss fights on your way to reclaiming your lost memory.\nExchange health for power in fast paced glass cannon gameplay. Find the right balance of attack and defense as you try, die, repeat and progress up the tower\nBattle through an almost infinite variety of combat encounters in procedurally generated rooms\nTwin stick shooting, dashing and wall sliding are just the beginning - find power-ups and items on each run and upgrade your arsenal\nAn extensive set of options lets you tweak Revita to your playstyle - slow down time, set an outline colour for enemies to make them easier to track or choose the level of aim assist that feels right for you.\n\nExplore an underground subway line infested with monsters and filled with colourful characters who will help you on your journey. Travelling from station to station where elevators take you towards the heights of an ever changing clocktower.\n\nA nameless child with no memories awakens in the metro with only a vague sense of purpose and desire to reach the distant clocktower, hoping to find answers at the top. On the way they will discover a melancholic world filled with masked characters, monsters and perhaps the answers that the child seeks.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Benstar","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":540031,"name":"NERTS! Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/171/17185801200bb20aa7ab2b39452ef3e1.jpg","description":"Nerts is a fast-paced competitive solitaire game for you and up to five of your friends!\nUnlike the rest of our solitaire games, we did not invent Nerts. We learned about it from our artist Kyle, who has played it for years, and started playing it after lunch in the Zachtronics office. Over time we added more to it, including house rules, longer tournaments, and even a theme song.\nWhen we started working from home in early 2020 we made a rough version of the game to play over the internet, which eventually (nine months later) was cleaned up and turned into this. The game includes a few Zachtronics additions, like players being allowed to move cards between their Nerts pile and their tableau after Nerts has been called. It's free, but you do technically unlock card backs by owning our other games, so let's pretend that's a legitimate monetization strategy.\nHave fun!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":320394,"name":"Quantum League","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a81/a8169a30972a2377803f72354c0d7172.jpg","description":"It’s an alternate universe where time travel manipulation has changed the face of professional sports as we know it. Quantum League, a heavily weaponized team-based shooting sport, dominates the globe.\nAs a Quantum Athlete, compete in 1v1 and 2v2 matches in specially designed arenas with a time loop feature that rewinds and revives you, allowing you to tactically team up with yourself. Your goal is to dominate the sport’s rankings, chasing superstar status with rewards of great fame and wealth as you progress. But agility, speed and skill are not enough to rise to the top. The ability to tactically play with yourself is important too!Features Unique Time Loop Game Mechanic - Dominate each round by taking advantage of the cloning time-loop in each arena to outmaneuver your opponent. Consider where you were and where you want to be to make that final winning shot, turning the tide of battle in an instant.\nMultiple Options for Combat - play solo against an online opponent in 1v1 battles or dial up to the power of 2 in 2v2 multiplayer matches. Chase the top of the competitive leaderboard for global recognition!\nPlay 4 different game modes - including death match and capture point across 9 different arenas.\nChoose from 6 different characters to play and level up as you progress unlocking new outfits and styles as you evolve.\nSelect from 8 different weapons and head into the Quantum Arena!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"NGD Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":28854,"name":"Last.fm","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Last.fm on Xbox LIVE!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Microsoft","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":20670,"name":"Comic Book Hero: The Greatest Cape","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9c5/9c568f97eda47c3b6206df7eb301ba41.jpg","description":"What would you do with unlimited power? Would you become the greatest hero the world has ever seen or make the world tremble at your feet? Find out how your super-powered career would really unfold in Comic Book Hero: The Greatest Cape! Assume the role of a masked crime fighter and take part in adventures ranging from the streets of your city to the farthest reaches of the galaxy! Write your own super-heroic story as you take on every foe from petty thugs to cosmic villains in this unique role-playing simulation adventure. Adventure awaits you!\nCreate a custom hero to guide through a crime-fighting career, from origin story to climactic battles!\nCustomize your perfect hero by choosing from hundreds of superpowers, abilities and attributes.\nChoose one of four game modes. Create your own hero from scratch, develop a hero from a selected backstory, take on the role of an existing hero, or clone a hero’s abilities and create a new story!\nTake on opponents one on one or in team battles as large as 10 versus 10 in turn-based, strategic combat!\nFoil evil schemes by fighting off henchmen, solving puzzles, and unmasking villainous masterminds!\nSee how popular your crime fighting adventures are with comic book fans! Your adventures are chronicled in in-game comic books. The more exciting your adventures, the better your issues sell!\nStay prepared by gathering information with the innovative “Word On The Street” feature.\nManage your character's relationships with allies, villains and civilians.\nProtect your character's secret identity fiercely or choose to tell your closest allies.\nJoin a team for adventures or even start your own heroic alliance.\nThe in-depth editor allows you to customize the game world. Everything from a character's powers to the locations in the game world can be customized.\nCreate your own game world from scratch and design a complete comic book universe of your own!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grey Dog Software","platforms":[{"id":0,"name":"PC"}]},{"id":19578,"name":"Sol Survivor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/941/941a2b429947363ab96cb8832296cfe0.jpg","description":"Jump in to intense turret defense action with Sol Survivor!  Build turrets to defend your colony and the innocent colonists within.  Smash enemies with volleys of actively-controlled orbital support.  Play with friends in co-operative and competitive multiplayer matches or test your mettle against our new Survival mode!\nOrbital Support - Get up close and personal with the enemy by calling down orbital lasers, salvos of artillery and many other weapons in support of your turrets.  Never be stuck wishing your turrets could fire just one more shot!\nHuge Turret Arsenal - Twenty-six turrets are at the ready in the fight against the enemy, with each one filling a unique role.  Try \"old-time\" strategies like cannons and mortars or ramp up the technology with banks of lasers and automated drones!\n10 Unique Playstyles - Ten distinct executive officers bring unique combinations of turrets and support to the battlefield.  Choose a favorite or pick the officer that best suits the challenge at hand!\nImmersive Camera and Controls - With a full rotational camera, the battlefield is at your fingertips.  View the action from afar and plan strategies or get in close for precise actions!\nExciting Co-Op and Multiplayer Modes -  Choose from up to four game modes: the casual Duo mode, flexible Versus mode, challenging Co-Op or competitive Wars mode. Play with up to 8 friends!\nSurvival Mode - Fight against tougher and tougher waves of enemies crafted randomly to create new challenges with each game.  Challenge your friends to beat your best times!\nIn-Game Encyclopedia - Always be well informed about the turrets and the enemy by consulting the in-game encyclopedia.  Read up before starting a battle or check up on your knowledge quickly from the field.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cadenza Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":19313,"name":"Shardlight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be8/be82ed1fc3efde21b85f04637279b20b.jpg","description":"The world ended on the day the bombs fell. Since then, it’s always been like this: disease, hunger, death. The ruling Aristocrats — a faceless oligarchy that controls all resources — have unchallenged authority. There’s never enough food, water, or vaccine to go around. The rich receive regular doses of vaccinations in exchange for their unconditional government support. The poor live in fear, superstition, and squalor until they die.\nAmy Wellard, a young woman reluctantly working for the government to qualify for the vaccine lottery, believes there’s a cure — and she’s going to find it. Even if it costs her her life.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":17750,"name":"Starion Tactics","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7dc/7dc544f42e6e205b9ba68fa1b0beccf2.jpg","description":"Just UpdatedV1.0.5401.40673\n- The player can now enable Advanced values, which adds Speed and Shield values, as well as allows ships to gain experience from battles and level up their stats.\n- A dialog for notifying the player of ships that levelled up since last round has been added.\nAbout the GamePerfect for the novice, yet sophisticated enough for the veteran, Starion Tactics is a turn-based digital board game that delivers a deeply tactical and highly visual experience with fun and quick gameplay.\nAfter assuming command of one of four human or alien factions vying for galactic dominance, immediately define your game’s scope. Play for minutes to hours across tens to hundreds of planets in single-player skirmish or multiplayer modes—it’s entirely up to you.\nLeave the tedious, everyday tasks that take away from crafting and executing tactical strategies to your faction as you explore the galaxy. Explore the galaxy map and discover different planet types: some rich in resources, some barren and unfit for terraforming. Expand your empire by choosing which planets to invade, colonize, destroy or simply ignore. Exploit and terraform planets, acquiring resources to grow and strengthen your fleet, empowering you to exterminate enemy factions and rule the galaxy.\nFully customize each game by creating your own settings so that no two games are the same.\nAssume the role of a faction leader and command one of four factions\nFocus your efforts on crafting and executing your tactical strategy while your faction takes care of tedious, everyday tasks\nEngage single-player skirmishes or up to 8 player multiplayer wars across 10 to 100 planets—you define your game’s scope\nUse resources acquired from planets to build and strengthen your fleet\nConstruct ships that range from small, agile scouts to colossal battle cruisers\nFrom improved mining to solar eruptions to labour strikes and beyond, implement cards and/or artifacts to make games more interesting with the element of chance","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Corncrow Games","platforms":[{"id":0,"name":"PC"}]},{"id":16780,"name":"BIT.TRIP FATE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3f/a3fef754e4e537f76a6934532f524fc5.jpg","description":"FATE is the penultimate chapter in the six-part BIT.TRIP series and will leave you wondering what’s next.Key Features:The arrow keys control CommanderVideo while the mouse allows you to fire anywhere on screen! Or if you prefer, plug in a controller for dual-stick shooting action!\nCollect power-ups to call on CommanderVideo’s friends for powerful shot upgrades!\nA chiptune-inspired dubstep soundtrack helps bring the action to a whole new level!\nVideo game worlds collide with appearances from Super Meat Boy and Mr. Robotube!\nChipmusic artist Minusbaby helps set the tone with a special guest appearance!\nEnjoy brand new Easy and Hard Difficulty Modes!\nRide the vibe in BIT.TRIP FATE to discover where CommanderVideo’s true mission will take him.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15732,"name":"Karma. Incarnation 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56f/56f95d5148ec83ca1120adfcf0f4f760.jpg","description":"This original adventure game explores a love story between two beautiful souls through ingenious humour and a bizarre, hand-drawn, frame-by-frame animation style. Our hero’s beloved has been abducted by evil spirits, and the only way to reunite them is to reincarnate himself as a dragon to defeat Evil. But something has gone wrong, and his soul is reborn as a worm named Pip. Now Pip must overcome the challenges of a surreal world, solve mind bending puzzles, and save his love. Choosing between good and evil, Pip learns the laws of Karma, and his choices define the outcome of the game.\nFeatures:\nPlay as Pip and explore a rich, bizarre world.\nUse Astral sight, a power that allows you to peek into the world of spirits at any point of the game.\nLearn Karma laws through choice and action. Each evil deed spoils Pip’s karma and changes his appearance. Good deeds purify karma. Key characters respond differently to Pip’s karma, opening additional storyline.\nHand-drawn animations of the varied interactions of Pip with his strange environment. The environment and other characters of the quests are drawn individually for each situation.\nLive magical award winning music and sound by ZMEIRADUGA.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"AuraLab","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":13976,"name":"Rooms: The Main Building","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d17/d178fbbce2a9a9d7bd063aec978cdd1c.jpg","description":"Rooms is set in a dark and mysterious house called ‘Rooms Mansion’, the game plunges you into a virtual world based around 100 challenging sliding puzzles with a twist. In each room or level, you must think carefully and strategically navigate your character to the room’s exit by sliding sections of the room, the same way as a slide puzzle. Your character can walk from tile to tile, but remember that only the tile that your character is standing in can be moved.\nIn this parallel world you need to use an amazing array of unusual items and devices, including telephones that teleport you from one side of the room to the other and explosives, to break through brick walls or other obstacles. And watch out – some rooms are filled with water and will need to be pumped out!\nAfter escaping each puzzle you will be rewarded with four golden puzzle pieces that are required to secure your way home.\nThe solution is only a doorstep away. Getting there is the easy part. Finding a way home will be the adventure.Features\nA unique point-and-click puzzle adventure that is based on the classic sliding tile puzzle mechanic.Play inside of intuitive and amusing rooms as you use objects and your wits to escape.Over 100 rooms to go through as you make your way through the buildings of this mystifying world.Includes Wii/DS exclusive levels.Explore the additional play areas of \"Rooms Street\" and the \"Rooms Mansion\" where you can interact with non-player characters, find useful items and more.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"HandMade Game","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12236,"name":"The VR Museum of Fine Art","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/990/990edeac33644cbd9f831dc144f947c4.jpg","description":"Just updated! Welcome to the Museum's Second Floor!\nSee new sculptures, ride the elevator, check out the Café, and enjoy the new Water Lilies exhibition.\nWelcome to The VR Museum of Fine Art, Steam's finest art gallery.\nDepending on who you ask, of course.\nIf you've been training to be a space pirate and building fantastical contraptions all day, the Museum is your ticket to a well-deserved break. Surround yourself with 1:1 scale sculptures and paintings, and we won't tell anybody if you touch the merchandise! No rope barriers or glass walls here. Feel free to explore the artwork however you see fit. Roomscale VR lets you walk around, duck under, and even hug the life-sized figures.\nThe initial release of The VR Museum includes 15 high-fidelity sculptures, and more are coming. In addition, two famous paintings are included, scanned and rendered in crisp detail. In future releases, both collections of sculpture and paintings are sure to expand. The artwork is arranged thoughtfully into four exhibits, each with its own theme.\nIf you ever actually feel like learning something, informative holographic plaques are placed next to each piece of art. That does involve reading, though, and that's a lot of work.\nTickets are free, drinks are temporarily non-existent, and the artwork is pristine. Enjoy!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Finn Sinclair","platforms":[{"id":0,"name":"PC"}]},{"id":10434,"name":"VRMark","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/176/1760e5d5e859714441ed1e9c5f1e0cac.jpg","description":"Is your PC ready for VR? Find out with VRMark, the virtual reality benchmark.\nSee if your PC meets the performance requirements for HTC Vive and Oculus Rift.\nTest your PC with two VR benchmark tests, headset not required.\nOr connect an HMD and judge the VR experience with your own eyes.\nDetailed results and hardware monitoring charts.\nExplore each scene in VR or on your monitor with Experience mode.\nTry before you buy\nThe performance requirements for VR games are much higher than for typical PC games. So before you buy an HTC Vive or Oculus Rift, use VRMark to see whether your PC has what it takes to deliver a great VR experience.\nVRMark includes two benchmark tests that run on your desktop monitor, no headset required. Or connect an HMD and see for yourself with the free-roaming Experience mode.\nOrange Room benchmark\nThe VRMark Orange Room benchmark shows the impressive level of detail that can be achieved on a PC that meets the recommended minimum hardware requirements for HTC Vive and Oculus Rift. If your PC passes this test, it's ready for the two most popular VR systems available today.\nBlue Room benchmark\nThe Blue Room is a much more demanding test, ideal for benchmarking the latest graphics cards. With its massive 5K rendering resolution and spectacular volumetric lighting effects, the Blue Room sets the bar for future hardware generations.\nResults and reporting\nAfter running each test, you'll see clearly whether your PC has passed or not. You'll get an overall score for your PC, which you can use to compare systems, and detailed charts showing how your PC performed during the test.\nExperience mode\nVR headsets use clever techniques to compensate for missed frames. With Experience mode, you can judge the quality of the VR experience with your own eyes. Explore each scene in your own time in VR or on your monitor.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Futuremark","platforms":[{"id":0,"name":"PC"}]},{"id":3589,"name":"Murasaki Baby","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc6/bc65f22d5f6266d2cfd22b0bebb02576.jpg","description":"Use your wits to guide the girl through paths full of dangers and teach her the difference between right and wrong in a bid to keep her smiling… and alive. Think fast and move even faster as danger lurks everywhere in this truly unique side-scrolling puzzle adventure.\nA HELPING HAND\n• Use the touchscreen to hold Baby’s hand as you lead her along your journey together – your guidance will influence her behavior, character, self-judgment and perception of danger.\n• Discover new ways to solve puzzles with the rear touch pad by unlocking – and switching between − unique “mood” backgrounds.\n• Meet a host of bizarre characters trapped in their own tragic state, such as the little boy eaten alive by a huge bunny and a young girl enslaved under her own hair’s control.\n• Murasaki Baby is all about the emotional bond you’ll develop with Baby. So clear your schedule, switch off your phone and lose yourself in this incredible adventure.\n1 player(s)\n16KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n©2014 Sony Computer Entertainment Europe. Murasaki Baby is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":605663,"name":"Prison Simulator: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d2/8d223357b0c68bb17af037b791e107df.jpg","description":"Prison Simulatorhttps://store.steampowered.com/app/842180/Prison_Simulator/\nhttps://store.steampowered.com/app/1442450/Monsters_Domain/\nPrison Simulator: Full Game\nAbout the Gamehttps://store.steampowered.com/app/1505940/Orc_Warchief_Strategy_City_Builder/\nPrison Simulator: Prologue takes you back to the past and shows you the cruellest events that the walls of this prison have seen. Everything starts inconspicuously. Exactly as if you have just started another boring shift at work. But you see that something is going on..\nEverything looks a little different here. Prisoners are disgusting swines who will do anything to humiliate you. They're starting to rule here. You want to show them where they belong? It won't be easy at all.\nFor months of humiliation, execution and other stupid ideas, they will finally say \"enough\". Maybe today, maybe next month. Who knows? One thing is certain. Only you will stay in this shit. Yes, you. You're alone. It's up to you whether these reptiles go back to prison or you get out of this jail in a black bag.\nHave you ever seen real fights? Fire everywhere? Prisoners destroying the whole prison? Or maybe your super-amazing coworker lost his keys a few days ago?\nThose will be funny days in this facility. For you, for sure.\nGameplay description\nPrologue contains:\n♦ New events\n♦ New dialogues\n♦ New routines\n♦ Redesigned environment\n♦ New soundtrack and sound effects\n♦ New models and items\n♦ Weapon mechanics and shooting\nYou always wanted to shoot? Did you dream about weapons at night? Great. Grab a gun, because without it you can catch a ride into the afterlife. But if you think you're a fighter, you don't have to use it. Take your nightstick and go! Maybe you will get something special? Maybe.\nTake part in negotiations, or at least try it. Maybe you can do it. Benches are burning in the yard, there is a battle for tables in the canteen and the workshop turns into a slaughterhouse. So what will you do now? Fight. You are a guard. You rule here. They're only convicts, they're sitting for murder, rape and theft. For you, it's a piece of cake.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Baked Games","platforms":[{"id":0,"name":"PC"}]},{"id":484951,"name":"5D Chess With Multiverse Time Travel","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c55/c55bb8b0e07138d1b7eafe84e2556180.jpg","description":"What is it?5D Chess With Multiverse Time Travel the first ever chess variant with spatial, temporal, and parallel dimensions. It's the first ever chess variant with multiverse time travel!\nFeatures Sharpen your tactics by solving a collection of multiverse chess puzzles.\nPractice against four different AI personalities, each with different strengths and styles.\nTry out a variety of different starting positions and scenarios.\nPlay online with your friends or against strangers.More Features Learn as you go. An intuitive interface makes experiementation quick and easy.\nVisualize how your pieces move with highly-polished diagrams and views.\nBuy it! Show your friends!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Conor Petersen","platforms":[{"id":0,"name":"PC"}]},{"id":404489,"name":"HuniePop 2: Double Date","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/879/8796275a165e791abd3ea16a88d59ebf.jpeg","description":"Take a trip to an exotic island paradise for a steamy new adventure in this long awaited sequel to the popular dating sim / puzzle game hybrid, HuniePop!\r\nStory Summary\r\nAn era of darkness and destruction draws near as an ancient evil of limitless lechery, the Nymphojinn, will soon be awoken by a cosmic super-period of unspeakable PMS. Reunite with Kyu, your old love fairy sidekick, and travel to the island of Inna De Poona to develop your double dating prowess and overcome the insatiable lust of the demonic pair.\r\nFeature List\r\nA blend of old friends and fresh faces make up a twelve character cast, each with their own unique personality, problems and preferences!\r\nDouble dates encourage you to split your time and attention between two girls with an all new Stamina system!\r\nRevamped gameplay systems create a stronger connection between the Sim and Puzzle portions of the game!\r\nLoads of new date gifts to give with a wide variety of strategic effects, and plenty of old ones too!\r\nA brand new Baggage system that introduces new twists and challenges as you progress on your dates!\r\nExplore the exotic island of Inna De Poona with over twenty touristic tropical locations to visit!\r\nA sweeping soundtrack inspired by a mix of seaside styles including Hawaiian, Caribbean and classic American surf rock!\r\nThousands of lines of fully voice acted dialog with multiple interactions between compatible pairs of girls!\r\nUnlock new outfits, hairstyles, and sexy CG scenes as you date your way to the top of Mount Nymphojaro!\r\nPlease note that this is a censored version of the game.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"HuniePot","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":359386,"name":"Secret Neighbor Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bef/bef1a718232d410581c8e49f40d80f75.jpg","description":"Add Secret Neighbor to your Wishlist!https://store.steampowered.com/app/859570/\nAbout the GameThis is an ALPHA version of Hello Neighbor Multiplayer Game, Secret Neighbor.\nSecret Neighbor is a Multiplayer Social Horror game set in the Hello Neighbor universe.\nA group of kids tries to sneak into their creepy Neighbor's basement to rescue their missing friend.  The only problem is one of the players is a traitor in disguise.\nPlaying as a child:\nCollect keys\nSave you friends from the Neighbor\nCooperate but don`t trust anyone\nIf you are lucky enough to play as Neighbor\nThe house is your territory! Use it to separate, scare and confuse intruders.\nUse your gadgets to get advantage over the kids' team.\nGain trust amongst your foes and attack in the right moment.\nProtect your basement!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dynamic Pixels","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":302940,"name":"The Great Perhaps","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/187/187d08fc7b451bc79b338cd941dad266.jpg","description":"The Great Perhaps tells the story of an astronaut returning to Earth destroyed by natural cataclysms.\nThere, among the ruins he finds an unusual artifact — an old lantern, in the light of which you can see glimpses of another time and travel to the past.\nExperience constant time traveling between an empty, melancholic scenery of the post-apocalyptic Earth and its vivid days gone by.\nThe hero will face the danger in the post-apocalyptic present, as well as in the past. Help him on his journey to find out the true cause of the disaster and save the planet!\nFeatures\nChallenging puzzles and mini-games based around time travel\nExperience the gripping atmosphere of a post-apocalyptic world based on Soviet aesthetics\nInnovative storytelling which binds together the past and the present\nMemorable characters with personal stories\nOriginal interactive soundtrack which adapts to each timeline\nWistful hand-drawn 2D art style","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Caligari Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":52937,"name":"Final Fantasy IV (1991)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb5/cb5fee4db77e93350719dc151a33d13f.jpg","description":"Final Fantasy IV (ファイナルファンタジーIV, Fainaru Fantajī Fō), known as Final Fantasy II for its initial North American release (and not to be confused with the original Japanese Final Fantasy II), is a role-playing video game developed and published by Square (now Square Enix) for the Super Nintendo Entertainment System. Released in 1991, it is the fourth main installment of the Final Fantasy series. The game's story follows Cecil, a dark knight, as he tries to prevent the sorcerer Golbez from seizing powerful crystals and destroying the world. He is joined on this quest by a frequently changing group of allies. Final Fantasy IV introduced innovations that became staples of the Final Fantasy series and role-playing games in general. Its \"Active Time Battle\" system was used in five subsequent Final Fantasy games, and unlike prior games in the series, IV gave each character their own unchangeable character class.\nFinal Fantasy IV has been ported to several other platforms with varying differences. An enhanced remake, also called Final Fantasy IV, with 3D graphics was released for the Nintendo DS in 2007 and 2008. The game was re-titled Final Fantasy II during its initial release outside Japan as the original Final Fantasy II and Final Fantasy III had not been released outside Japan at the time. All later localizations, which began to appear after Final Fantasy VII (released worldwide under that title), used the original title.\nWith its character-driven plot, use of new technologies, and critically acclaimed score by Nobuo Uematsu, Final Fantasy IV is regarded as a landmark of the series and of the role-playing genre. The various incarnations of the game have sold more than four million copies worldwide. A sequel, Final Fantasy IV: The After Years, was released for Japanese mobile phones in 2008, and worldwide via the Wii Shop Channel on June 1, 2009. In 2011, both Final Fantasy IV and The After Years were released for the PlayStation Portable as part of the compilation Final Fantasy IV: The Complete Collection, which also included a new game, set between the two; Final Fantasy IV: Interlude. Ports of the Nintendo DS remake were released for iOS in 2012, for Android in 2013 and for Windows in 2014.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Square","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"iOS"}]}]