[{"id":21106,"name":"Uninvited: MacVenture Series","genre":"Adventure","price":0.0,"description":"As you and your brother are driving in the dead of night, you swerve to avoid a mysterious object. Then the world goes black. When you come to, your car is wrapped around a tree, a storm is brewing and your brother has vanished. You leave the car, drawn to a Gothic mansion, believing the Victorian manor holds the key to your brother’s fate. You enter the mansion, finding yourself within a labyrinth filled with ghosts and demons. Each step brings you further into the unknown. Move quickly, since each second that passes threatens your sanity.\nThe original Macintosh AND Apple IIgs versions are here and welcome you, once again, into the haunted mansion! Come see where the world of first-person adventures started and experience the classic horror game as it appeared in 1986.The Uninvited: MacVenture Series Key Features\nTwo Original Versions: You get BOTH the Macintosh and Apple IIgs versions, restored to their original glory!\nFirst Person Adventuring: Over 50 game rooms of horror adventure.\nDrag and Drop: Utilize the classic, groundbreaking windows-based, drag and drop object system.\nPuzzles: Tons of great puzzles.\nCustomized UI: Move the UI around to suit your needs and resize the retro graphics to full screen.\nSave System: Save your progress at any time – create as many save points as you wish.","imageUrl":"https://media.rawg.io/media/screenshots/1ee/1eecf8c5fa2a671df952cbe664c2b583.jpg","releaseYear":2015,"developer":"Zojoi","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19781,"name":"Atulos Online","genre":"Adventure","price":0.0,"description":"Atulos Online is a free to play 2D medieval MMORPG. You can choose from many different characters including Mage, Knight, Dwarf and Guardian. The story unfolds as a confrontation with the sorcerer Atulos draws ever closer.\nIn the Ancient times, a fearsome ruler in the line of Arkahron ruled with an iron fist. This ruler was called Atulos, because in the Ancient tongue this meant that he was both wise and evil. Atulos used his wisdom to study the dark arts, a gift that according to legend, was sometimes found in the lineage of Arkahron. Atulos awoke many a great and terrible force, and became more powerful than any other that has lived.\nAtulos conquered all the lands of the Ancient world, and ruled them for many years. But Atulos was not immortal. During a war with a band of mountain dwelling rebels, Atulos was struck in the neck by an arrow. Nearing death, Atulos retreated to his castle. There he died and was placed in a burial chamber that became enchanted by powers still unknown.\nOver the centuries the region was named after its ancient ruler... Atulos.","imageUrl":"https://media.rawg.io/media/screenshots/a88/a88d3c677b6e472d8dd19e0d92b2dde1.jpg","releaseYear":2016,"developer":"Parallaxian","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19366,"name":"Echelon: Wind Warriors","genre":"Action","price":0.0,"description":"A new part of Montezuma available on Steam!http://store.steampowered.com/app/443370\nDarkestville Castle Coming Soon\nAbout the Game\nYou are a pilot in the government forces stationed at one of the planets under attack. As you get higher on your career ladder, you will be able to choose more advanced hovercrafts and ammunition, as well as to order your own squad and influence local battles.\nThe goal of the development of the game is to further expand our virtual universe. Based on the huge success of the first game, we are presenting you with the same world, occurring at the same time, but from the point of view of another character, whose adventures unfold according to a different storyline. At times, it will cross the storyline of the previous game, and if you have played \"Echelon\", you will recognize some places and characters.\nEchelon: Wind Warriors is a unique game. This is not a regular space-battle simulator, nor is it a simulator of combat in enclosed labyrinths. The action is taking place above the surfaces of a planet, the picturesque landscapes of which are one of the basic features of the game play. In the realism of the implementation of the gaming environment – the cockpit of the battle hovercraft – Echelon is comparable with the best flight simulators. The game play is similar to that of the MechWarrior series, but instead of a walking robot, you pilot a fighter. Echelon: Wind Warriors has the following advantages over Echelon:\nUnique combination of flight simulation and action.\nRealistic and highly detailed world of the game. Various, elaborate, and vast landscapes.\nA broad but well-balanced range of available weapons provides the player enough freedom and flexibility for using different tactics.\nThe player’s progress, as he advances through the game, upgraded equipment, as well as the appearance of new equipment with unknown functions on the part of the enemies will continually add excitement to the game play.","imageUrl":"https://media.rawg.io/media/screenshots/b41/b4144eb42224f26cd085845a19157d1a.jpg","releaseYear":2014,"developer":"Madia Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18975,"name":"Jacob","genre":"Strategy","price":0.0,"description":"Jacob: a free and simple puzzle game/experience with a scientific twist - it's evidence-based, using research on societal inequalities to determine game difficulty.\nFeatures\n•\tIncorporation of real research findings into gameplay - a simple control scheme with quick play-through.\n•\tLeaderboard - players build a population of scores which reflect socioeconomic difficulty, game skill, and random chance.\n•\tAwe-inspiring silhouette landscapes.\n•\tBeautiful and uplifting soundtrack.","imageUrl":"https://media.rawg.io/media/screenshots/503/503823e41a882bf37e5b406fad9ad372.jpg","releaseYear":2016,"developer":"Duck Duck Zeus","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18882,"name":"Slavistan","genre":"Action","price":0.0,"description":"Trading cards available\nAbout the Game\nHello Comrades ! You think you got what it takes to be tru slav?\nThen we have game for you ! Prove to all your gopnik friends\nthat you are the superior alpha slav your babushka always wanted you to be.\n3 glorious gamemodes in 3 glorious countries.\n6 unlockable characters you can make friends with.\nhard and fast gameplay that will make you real man.","imageUrl":"https://media.rawg.io/media/screenshots/4b9/4b92c85e09d574461d89db9e38229e8e.jpg","releaseYear":2016,"developer":"Free Candy Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18764,"name":"Rogue's Tale","genre":"RPG","price":0.0,"description":"Rogue's Tale is a single player turn-based dungeon crawling game.\nThe game takes place in a place called Frostmourn Keep and its underlying dungeons located in the World's End Mountains. The goal is to overthrow the current king of the Frostmourn Keep and become the new king.\nClassless character building where you can be the kind of rogue you want.\nSeemingly unfair, untimely and unforgiving deaths which are also permanent.\nWays to counter these deaths by learning the game mechanics.\nRandom dungeons and encounters.\n24 talents to build your character with.\n30 spells to build your character even further.\n60 heritages that make your next character stronger.\n30 challenges to complete once you get the hang of the game.","imageUrl":"https://media.rawg.io/media/screenshots/4be/4be8ae28ed754b56022dfc844ad760e2.jpg","releaseYear":2014,"developer":"Epixx.org","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":18379,"name":"Ghost Encounters: Deadwood - Collector's Edition","genre":"Adventure","price":0.0,"description":"The town of Deadwood is being terrorized by the ghost of a murderous outlaw in Ghost Encounters: Deadwood - The Collector's Edition!Check out Our New Game Kickass commandos!http://store.steampowered.com/app/359140/Also Try Tiki Man!http://store.steampowered.com/app/376920/Also try Ant War - Domination!http://store.steampowered.com/app/406080/\nA PARANORMAL POINT-AND-CLICK ADVENTURE FULL OF INTRIGUE Grave robbers have unleashed a phantom curse and condemned the entire town. One by one the townsfolk are dropping dead and now it's up to you to save them.\nEXPLORE THE FORSAKEN TOWN OF DEADWOOD After killing 21 men while he was alive, Blackjack is back to kill many more - you'll be at the edge of your seat trying to figure out what is coming next!\nCHALLENGING POINT-AND-CLICK ADVENTURE STYLE GAMEPLAY Break Blackjack's evil curse and save the day while enjoying the incredible Point-and-Click and Hidden Object Puzzle Adventure gameplay.\nUNIQUE PUZZLES AND HIDDEN OBJECT GAMES Play your way through over 35 different locations while solving 40+ puzzles and mini-games in search of the ghostly villain Blackjack!!!","imageUrl":"https://media.rawg.io/media/screenshots/f54/f542fff36967b1c5f234548af427648a.jpg","releaseYear":2013,"developer":"Anarchy Enterprises","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18350,"name":"So Long Earth","genre":"Action","price":0.0,"description":"So Long Earth is a light paced game that focus on puzzling and adventure, it tells the story of a grumpy protagonist and his new life outside of earth.\nThere is going to be hours of exploration all around the universe while unveiling the story of Dominique alongside his minion.\nIf you enjoy a simple game that you can just turn on, kick back with a controller and relax, then this is just the game for you.","imageUrl":"https://media.rawg.io/media/screenshots/106/10619d0bf395e11efcf2cf560d2e4011.jpg","releaseYear":2016,"developer":"Edd Coast","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16603,"name":"CLANNAD Side Stories","genre":"Casual","price":0.0,"description":"Delve further into the world of CLANNAD and experience the stories beyond the original visual novel adventure. Known as CLANNAD Hikari Mimamoru Sakamichi de in Japan, this collection of linear side stories allows you to explore and experience new sides and twists to your favorite characters from the little town of Hikarizaka. These are the stories which are not explored in either the visual novel or in the anime adaptation.\nAfter the death of his mother, Tomoya Okazaki—a guarded delinquent student at Hikarizaka High School struggles to find meaning in his life. While on his way to class one morning, he meets a mystifying girl named Nagisa. From their brief encounter, Nagisa decides they should be friends, and enlists Tomoya's help to revive the school drama club.  Along the way, the two make friends with many other students and try to find both solace and belonging in their endeavors.\nOriginally released on the PSP handheld platform, this all new Steam release collects all the side story chapters and features high resolution assets at 1280x960 and in English for the very first time.","imageUrl":"https://media.rawg.io/media/screenshots/5d3/5d3ea6b00f8beaf6f7026ba43f607586.jpg","releaseYear":2016,"developer":"VisualArts/Key","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16469,"name":"Agricultural Simulator 2011: Extended Edition","genre":"Simulation","price":0.0,"description":"In a charming mountain area, you take the role of a classic farmer with all the necessary tasks like cattle breeding, growing grain and other resources, and dealing with products from your farm. Your fields can be cultivated with machines from CLAAS and even your animals have to be taken care of.\nThe complete Agricultural Simulator allows you to ride many genuine CLAAS tractors. Choose between many different models of tractors, combines, extensions and hangers. Sell your products and invest in better equipment. More powerful machines will help you farm bigger areas. As striving farmer, you have to invest carefully to maximize the crop. Don’t kick over the traces or you won’t be able to upgrade your farm and buy more land. Choose the right seed from different types of grains like barley, rye, or wheat or decide to grow canola or corn. The harvest can be used as animal food, new seed as well as product to be sold on the market. Always have an eye on the market prices so you don’t come out with losses after all the work. Get another main pillar and breed cattle: cows, horses, sheep, hen, and geese. You may even have game animals on your farm and sell them profitably as food. If everything works well, the animals will prosper and you can sell their offspring on the market. Take care of proper feeding, daily care of the stables, and your animals well-being. Hire workers to balance your workload and invest in their further education. The career mode in Agricultural Simulator guarantees a lot of fun. Playing cooperative mode allows you to manage your farm either online or offline with your friends.New features in the Extended Edition:Optimized and faster engine for higher performance\nVehicle models, physics and movement have been reworked and improved\nNew visual effects and graphic options\nConfigurable day and night sky\nImproved 3D map\nMore streets, a gas station and a new village have been added\nNew places to sell your products\nMultiplayer mode now has chat\nSupport for Joysticks and Gamepads\nImproved AI traffic\nNew helper system\nFully configurable keyboard control","imageUrl":"https://media.rawg.io/media/screenshots/984/9845a1d635713d00a65adba0cf2a0884.jpg","releaseYear":2011,"developer":"United Independent Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15682,"name":"PolyDome","genre":"Simulation","price":0.0,"description":"Step into the Polydome.\nPolyDome is a musical environment that changes and progresses when you interact with it. Think of it as a sequencer, but rather than being a tool for creating music, it's a place where you can explore and create different musical phrases and sounds. The point of PolyDome is not to win, loose or compete, but simply to relax and enjoy.","imageUrl":"https://media.rawg.io/media/screenshots/5e7/5e725fe668a5c070806a63e58c2c7002.jpg","releaseYear":2016,"developer":"Plan8","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15301,"name":"Zombie Vikings: Stab-a-thon","genre":"Action","price":0.0,"description":"Zombie Vikings: Stab-a-thon is a free to play game that takes place in the Zombie Vikings universe. Play as the most fearsome Vikings ever raised from Norse soil in this brawler game with up to 4 players. Pick your weapon and your character and you're ready to fight your friends (or enemies) in arenas like Fishgaard and Berzerker Factory. Or why not play a game of the traditional and historically accurate game of Söcker?\nSharpen your weapons to find out who's the best Zombie Viking of them all!\nBattle your friends in this completely free brawler game!\nCompete in the ancient Viking game known as Söcker\nFight in arenas like Hellheim, Berzerker Factory and Fishgaard.\nUnlock new weapons and use them to smash your friends on their heads!\nEquip magic runes to gain new abilitiesAlso includes one demo level from full game Zombie Vikings","imageUrl":"https://media.rawg.io/media/screenshots/433/433d60151627b0b59a9db2cb92445c0b.jpg","releaseYear":2016,"developer":"Zoink!","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15239,"name":"RymdResa","genre":"Adventure","price":0.0,"description":"A roguelike space odyssey in a procedurally generated world\nWhen home is no more...\nResources are sparse. The universe is infinite and unknown. The universe is lonely, open and unforgiving.\nYou're drifting, in a big, empty and silent space. Searching for a new home. You know a few coordinates to some random locations; but this is the only information you got.\nRymdResa is a challenging and evolving space adventure, based on randomness, with RPG elements. Abstract story elements and art are expressed throughout a lonesome and calm journey in space.\nTravel through a mysterious cosmos, deep and beyond. Discover the solitude of space! Customize your ship, explore and survive in the retro stylized universe of RymdResa.\nGame Features:\n★ Solitude Of Space\n★ Procedural World\n★ Randomized Loot\n★ Customizations\n★ Pilot Level\n★ Abstract Experience\n★ 3 Chapters With Different Gameplay\n★ Beautiful Art\n★ Original Soundtrack\n★ Voiced Story\n★ Exploration\n★ Nonviolent\nSolitude of space\nThe universe is lonely, open and unforgiving, but that doesn't mean it isn't peaceful. We have tried to create a place for relaxation and beauty.\nProcedural World\nThe world is infinite and different every time you play, with over 300 different  objects to discover and explore; like planets, stars and spaceships.\nRandomized Loot\nThere is a large amount of different item types you can find to enhance your ship. These are randomized. Try to get legendary items!\nShip Customization\nThere are 8 ships in RymdResa. Every ship has in total 8 item slots, whereof 2 are unlockable. You can find different styles, auras, engines and other improvements.\nPilot Level\nLevel up to become a master pilot! Choose orientation, focus on exploring, scouring, survival or technology.\nUpgrades\nDiscover a set of several different upgrades, like researches and different worlds enhancements; why not for example unlock the shield as an item type or see moons in space?\n3 Chapters\nRymdResa is an evolving space adventure. Each chapter has unique gameplay and a unique narrative. Chapter 3 is set in a new universe!\nBeautiful Art\nPoetry, peace and art. Explore and enjoy a big set of visuals, crafted with RymdResa's art style; pixelart mixed with a posterized style combined with a strict color pallet.\nOriginal Soundtrack\nEvery ship has a custom soundtrack enhancing the world around it. Two musicians: Tom Croke and Pat Jacobs created the soundtrack with their vision of the game.\nVoiced Story\nA poetic voice log from the pilot describing a great loss, thoughts and feelings. Abstract fragments discussing the past, present and future.\nNonviolent\nWe didn't want to create yet another space-shooter, with laser-beams and exploding aliens. In RymdResa the gameplay is peaceful, passive and relaxing.","imageUrl":"https://media.rawg.io/media/screenshots/a54/a546f2e39ac8a9dab1fb16b0bac2c425.jpg","releaseYear":2015,"developer":"Morgondag","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":15211,"name":"Pretty Girls Panic!","genre":"Casual","price":0.0,"description":"Socially conservative sea creatures have constructed a water filled screen to hide the Pretty Girls from view. But please don't panic!  Use your special tool to penetrate the barrier and reveal the girls while avoiding getting caught. Girls will gradually disrobe from stage to stage to reward you for your success.\n■ Your Mission\n13 Pretty Girls in 50 stages are waiting to be exposed.  After each stage you complete, a commemorative photo will be added to your Gallery.  Complete all stages to achieve the status of Master of Pretty Girls Panic.\n■ Game Play\n・Direct your tool by using the arrow keys on the keyboard.\n・Complete a cut by connecting back to an edge.\n・The bigger the piece you cut out the more points you earn.\n・Complete a stage by removing 75% or more of the barrier.\n・You are usually safe on an edge but watch out for crabs!\n■ Sea Creature Enemies\n・Beware of enemy sea creatures who will try to stop girls from being exposed.\n・If an enemy touches your tool or the line of your cut then your tool is lost.\n・Lose all of your tools and it's game over for you.\n・The further you progress the more powerful your enemies will become.\nAll characters include sexy voices in Japanese.\n* Please note: This is a puzzle game with sexy characters but no nudity.\n* Characters and character images used under license from their respective owners.","imageUrl":"https://media.rawg.io/media/screenshots/1d4/1d44a6cb1fc32e498c9b58429318a8da.jpg","releaseYear":2016,"developer":"Zoo","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13509,"name":"SLIVER.tv","genre":"Desconocido","price":0.0,"description":"World's First VR Livestream: ESL One New York, Oct. 1 & 2SLIVER.tv livestream launches on Oct. 1 & 2 with exclusive ESL One: New York VR broadcast partnership\nAbout the SoftwareSLIVER.tv is a platform to record, view, and stream top esports games in fully immersive, 360 VR video. Our cutting edge, patented technology immerses the audience inside a 3D game world, viewing their favorite players and matches in an exciting new way never seen before. Many games that incorporate VR spectating require you to own the game or download a client; this is not one of those platforms. Instead, SLIVER.tv is a place to watch 360 VR game content from any source, similar to how one might currently watch a video on Youtube, or a streamer on Twitch!\nWatch esports from inside the gameLook up at the SKYCAM for a first person viewSLIVER.tv supports livestreaming in 360 VR\nSLIVER.tv is constantly adding new tools and features for the emerging VR community, and we can't do it alone. Please join us on social media, Reddit, and the steam forums to help us improve our platform.","imageUrl":"https://media.rawg.io/media/screenshots/cd7/cd7d5098695d7e912ea2232f73d32ad8.jpg","releaseYear":2016,"developer":"SLIVER.tv","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13480,"name":"Rogue Port - Red Nightmare","genre":"Adventure","price":0.0,"description":"\"Rogue Port - Red Nightmare\" is a turn based modern RPG that uses a 16 bit graphic style and an in game day/night calendar system with dynamic lighting where you name your friends and pet dog at the beginning of the game, choose one of three classes for your primary character and answer a series of questions to determine your primary character's stats.\nFeatures include : Dynamic Equipment (main Player's character sprite changes based on what apparel is equipped).\nDay and Night System (1 second is a minute in game time), Calendar System (4 total months for each Season).\nDynamic Lighting (different lighting in exterior cells based on time).\nRandom Trash Can Items (each searchable trash can in the game offers 1 of 3 random items).\nStamina Sprinting (you can only run until you run out of stamina).\nTemporary Fog of War (cave and dungeon tiles are only visible around the Player in a small radius).\nSecret Chests (every map in the game that has enemies has a secret chest that will only appear when all the enemies are defeated on that map).\nPortals (there are a total of 30 different portals, each appearing on a different day on the calendar regardless of the season).\nAnimated Battlers and Backgrounds (enemies you fight in battle are animated as well as the background).\nDynamic Music (soundtrack will change depending on if it's day or night time).\nArcade Games (two arcade games that both have unique prizes called \"StarShot\" and \"Jumper\" can be played).\nPlayer's Garden (behind the Player's house, there is a garden that allows them to grow up to 4 crops at once. Crop grade depends on how many times you've watered them before harvest and eating them will increase your max stamina meter).\nSeasonal Town Festival (at the end of each month, a festival starts in the City of Rogue Port where the Mayor will judge contestants crops for a chance at unique prizes that cannot be found elsewhere).\nOriginal music compositions by Cwglassmusic and Kain Vinosec.","imageUrl":"https://media.rawg.io/media/screenshots/7ed/7edd911c0cc74a8abb1c834bb64a19ee.jpg","releaseYear":2016,"developer":"Sunight Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13438,"name":"Canvas The Gallery","genre":"Simulation","price":0.0,"description":"In Canvas The Gallery, you are given an empty art gallery, a spray can and let loose. You can paint whatever you want, and people will come and view your drawings. Share your galleries with your friends, or upload your own pictures and have them shown in your gallery. Featuring music by Chopin that will adapt to your painting activity.\nPaint\nPaint on any canvas or even the walls. Select a color and a stencil and you're good to go! Artistic ability is not needed to have fun.\nSharing\nEach gallery in Canvas The Gallery is a convenient folder, with all paintings available as .pngs. It is very easy to share your galleries with friends. Just send them the folder, and have them put it in their documents\\\\CanvasTheGallery folder. Then, your friend can edit the gallery, and send it back!\nUse any picture\nDue to the fully accessible painting files, it is possible to swap any picture in and have it displayed as a painting in your gallery. Use your photography photos, photos of your cat, or create a gallery entirely of memes, no one will stop you.","imageUrl":"https://media.rawg.io/media/screenshots/ef1/ef19604fb2ab3ab48e67ce6819305f91.jpg","releaseYear":2017,"developer":"Skylar Stickley","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12561,"name":"Woven","genre":"Action","price":0.0,"description":"Welcome to Woven - a puzzle adventure game in which you explore a superficially safe world that is made out of wool, where stuffed animals live. In Woven, you play as Stuffy, a kind, but also a bit clumsy, stuffed animal in the shape of an elephant.\nStuffy will face many obstacles and rough terrains, and sometimes his heavy elephant feet or clumsy arms simply won't be able help you. You will have to find blueprints of different animal shapes and reknit Stuffy into different forms so he can overcome the obstacles. Elephant legs may be strong, but what would rabbit legs allow you to do? Finding and combining the right blueprints is a major part of gameplay in Woven,\nAs our game is incredibly story driven, it is laced with fully voiced narration that guides the player through the story about the hidden danger in this seemingly innocent and woolen world.\nIn a world that consists solely of wool, cotton and fabrics, you control a mysterious little metal robot named Glitch, and his friend Stuffy. Glitch has lost nearly all his knowledge of his past, remembering only flashes of metal, steam and danger. As he enters the soft and woolen world for the first time, he meets our clumsy friend Stuffy, who has always wanted to travel, but has never been able to do so. Together with them, you set out to unravel the mystery of Glitch’s origin and discover things equally amazing and terrifying.\nCustomize Stuffy, with different body parts and fabrics.\nOver a hundred different hidden fabrics to discover\nA selection of different animal blueprints each with their own skillset.\nA huge and colorful handcrafted world to discover.\nHugely detailed areas, each with their own unique ambience, obstacles, soundtrack and story - each full of hidden secrets.\nPuzzles that may be solved in different ways.\nAn amazing story, all told through rhyme by the a lovely, soft, woolen voice.","imageUrl":"https://media.rawg.io/media/screenshots/b79/b79d433232e78393bff34bc5455c7e18.jpg","releaseYear":2019,"developer":"Alterego Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":12325,"name":"ROOT (2015)","genre":"Action","price":0.0,"description":"A game of woodland might and right.\nPlay the digital adaptation of the beloved tabletop board game. Root is a game of adventure and war where 2 to 4 players battle for control of a vast wilderness.\nThe nefarious Marquise de Cat has seized the great woodland, intent on harvesting its riches. Under her rule, the many creatures of the forest have banded together. This Alliance will seek to strengthen its resources and subvert the rule of Cats. In this effort, the Alliance may enlist the help of the wandering Vagabonds who are able to move through the more dangerous woodland paths. Though some may sympathize with the Alliance’s hopes and dreams, these wanderers are old enough to remember the great birds of prey who once controlled the woods.\nMeanwhile, at the edge of the region, the proud, squabbling Eyrie have found a new commander who they hope will lead their faction to resume their ancient birthright.\nThe stage is set for a contest that will decide the fate of the great woodland. It is up to the players to decide which group will ultimately take root.\nThe most recent conquerors of the forest, the Marquise de Cat plays a game of engine building and logistics while policing the vast wilderness. By collecting Wood they are able to build Workshops, Sawmills, and Recruiters to help her score victory points. Marquise de Cat has the largest army in ROOT, but numbers alone won’t be enough to secure the forest...\nThe Marquise de Cat builds a mighty industrial war machine to subdue the forest. Each time the Marquise builds a Workshop, Sawmill, or Recruiter, you score victory points. The more of the same building she has on the map, the more points scored. However, to fuel ongoing construction, the Marquise must maintain and protect a strong, interconnected economy of Wood. While it may be tempting to overwhelm your opponents with sheer numbers, this leaves you at great risk of spreading yourself too thin and ultimately not being able to keep up.\nThe Eyrie Dynasties once ruled the wood, before the coming of the Cats. They must retake control by capturing territory and building Roosts before they collapse back into squabbling. The Eyrie are proud and bound to the decrees of their leaders. Each leader brings with them different specialties and advantages. The right leader at the right time could lead you to victory, but the wrong leader could cripple your chances of reclaiming the forest.\nDuring the Evening, the Eyrie score victory points based on the number of roosts on the map. The greater their presence in the Woodlands, the greater their gains. However, the Eyrie are bound by their Decree, an ever-increasing set of mandated actions promised by their leader. Each turn, they must take all of the actions on their Decree, or else fall into turmoil.\nThe Woodland Alliance doesn’t take kindly to despots - old or new. Marquise, Eyrie, they’re all the same. Only through the will of the people can this wood be ruled! The Woodland Alliance are masters of guerrilla warfare, they begin slowly but can build into a late-game powerhouse - but only if they can manage to subvert the other would-be rulers along the way.\nThe Woodland Alliance works to gain the sympathy of the various creatures of the forest. Each time the Alliance places a sympathy token, they may score victory points. The more sympathy on the map they have, the more victory points they score. Gaining the sympathy of the people requires supporters. These supporters can also be put toward violent ends, inciting outright rebellion across the forest. When a revolt erupts, the Alliance will establish a base. Bases allow the Alliance to train officers, increasing their military strength and flexibility.\nThe Vagabond is an adventurer to some, a trader to others, and thief to more, and an all-around scoundrel. As the Vagabond, you will explore all over the map, beyond just it's clearings, into dense woods to find items and ruins. You can trade and lend aid to the warring factions of the forest to help you complete your own secret quests.\nThe Vagabond plays all sides of the conflict while going on quests to increase his renown throughout the wood. Each time the Vagabond improves their relationship with another faction, or removes a warrior belonging to a faction hostile toward them, the Vagabond scores victory points. You can also complete quests to score victory points. To move and act effectively the Vagabond must manage a pack of items, expand your selection by exploring the forest ruins and providing aid to other factions.","imageUrl":"https://media.rawg.io/media/screenshots/8c8/8c850b5bfb816e10520c31621b60e87b.jpg","releaseYear":2015,"developer":"Skunkape Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9815,"name":"Days of War","genre":"Action","price":0.0,"description":"Grab your rifle and make those bullets count.  Head back to the Second World War where combat was brutal, unforgiving, and required extensive teamwork.\nIn this competitive FPS, players need to fall back on their marksmanship, skill, map awareness and tactical cunning. Like in true WW2 warfare, combat in Days of War is brutal, unforgiving and requires extensive teamwork.\nFeatures\nClassic competitive FPS combat:   marksmanship, skill, knowledge of the map and tactical cunning is your path to victory\nTeam based combat roles:  9 well defined classes, over 20 weapons, each with distinct strengths and weaknesses\nRealistic battlefield variety: from tight city streets to wide open beaches, to foliage rich forests, all with a variety of weather conditions and times of day\nAuthentic WW2 warfare:  motion captured soldier animations, maps designed using photogrammetry, and laser scanned weapon models\nDevoted community support:  dedicated server hosting and modding support coming soon\nThat means there will be bugs, your frames may drop, and there isn't a ton of content.  But ask any of our Kickstarter backers - we keep making Days of War more performant, more fluid, and better looking with each update.  We'll be adding more maps, more factions, and more weapons as free expansions as we build up to full release.\nIf you want to help make Days of War a better game, we invite you to join us in Early Access.  If you are expecting a final, polished game, we implore you to wait until full release.\nWe're going to keep plugging away until we've gotten Days of War to a place where we can all be proud of.  Take a look at our roadmap for more details","imageUrl":"https://media.rawg.io/media/screenshots/d82/d8264060ae360250767314a7bdeb648d.jpg","releaseYear":2017,"developer":"Driven Arts","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":3682,"name":"Lemmings Touch","genre":"Puzzle","price":0.0,"description":"Get to grips with all new ways to play, using the touchscreen control system as you guide a bunch of the carefree, unsuspecting rodents through superbly detailed levels filled with devious pitfalls and hazards.\nThey’re not that smart, but the Lemmings are certainly not lazy: give them jobs – like digging, bashing, building, blocking or climbing – and they’ll happily work away to clear a trail to each level’s exit. Just make sure you’re one step ahead – without your help and supervision they’ll most likely meet a sticky end, oh no!\nSo are you ready to lead your Lemmings to safety?\nFeatures\n•\tGuide the Lemmings through 100 fiendishly puzzling levels set in the Crystal Caverns, Hell, Ancient Egypt, Space and Candy Land.\n•\tUse your PS Vita system’s touchscreen and an intuitive new touch and swipe interface to pick and choose Lemmings with ease.\n•\tInteract with level objects like cannons, trampolines, switches and platforms.\n•\tNew level objective system to help unlock crazy costumes to customize your Lemmings clan like never before.\n•\tWatch out for a new type of Lemming, not all Lemmings play nice!\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n©2014 Sony Computer Entertainment Europe. Developed by D3T Ltd.  Lemmings is a trademark of Sony Computer Entertainment Europe.","imageUrl":"null","releaseYear":2014,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":3576,"name":"The Incredibles","genre":"Arcade","price":0.0,"description":"Mr. Incredible and his family must join together if they are going to put a stop to Syndrome and his city-wrecking Omnidroid.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n©Disney/Pixar.\nThis title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionalities may not be available.","imageUrl":"https://media.rawg.io/media/games/695/695ad6673cd1f6489d3ad02f6e9002c3.jpg","releaseYear":2004,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 2"}]},{"id":3077,"name":"SkyScrappers","genre":"Action","price":0.0,"description":"SkyScrappers is a classic arcade-style, vertically scrolling, competitive platform-fighting game. Select from a diverse range of extreme sportspeople, to fight and race your way to the top of a falling skyscraper… as it is being demolished.\nPlay with up to four players in classic couch-multiplayer, take on the story-driven single-player campaigns, or set up a skirmish against AI bots.\nClassic arcade feel and style\nBreathtaking hand drawn artwork\n60fps action\nSkill-based gameplay\nFull controller support\n1-4 Player Local Multiplayer\nSingle player story mode","imageUrl":"https://media.rawg.io/media/screenshots/de8/de8639527d515d4e8976eb9ad3ff0441.jpg","releaseYear":2015,"developer":"Ground Shatter","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":983211,"name":"Life is Strange: Double Exposure","genre":"Action","price":0.0,"description":"Max Caulfield, photographer-in-residence at the prestigious Caledon University, discovers her closest new friend, Safi, dead in the snow.\nMurdered.\nTo save her, Max tries to Rewind time - a power she’s not used in years... instead, Max opens the way to a parallel timeline where Safi is still alive, and still in danger!\nMax realizes the killer will soon strike again - in both versions of reality.\nWith her new power to Shift between two timelines - can Max solve and prevent the same murder?","imageUrl":"https://media.rawg.io/media/games/279/279a4377b3499615155908764e297e1c.jpg","releaseYear":2024,"developer":"Deck Nine Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":973793,"name":"100 Asian Cats","genre":"Action","price":0.0,"description":"Pre-Purchase Offerhttps://store.steampowered.com/app/2687200/100_London_Cats/?utm_source=100AsianCats_Special\nhttps://store.steampowered.com/app/2687190/100_Christmas_Cats/?utm_source=100AsianCats_Special\nAbout the Gamehttps://store.steampowered.com/app/2733930/100_Asian_Cats__Extra_Content/?utm_source=WidgetTop🗼🐾 WELCOME TO 100 ASIAN CATS – THE BEST HIDDEN OBJECTS GAME! 🗺️🌸🏮 Join the cutest adventure in the Asian temples locations! 🏙️ Explore the charming hand-drawn artwork of architecture as you embark on a quest to find 100 adorable cats hidden throughout the game. 🎨\n😸Test your attention and observation skills in this cozy and delightful hidden object game 😊\nEach cat is more charming than the last, and every discovery brings a smile to your face.🐈🕵️‍♂️ Can you find them all? 🕵️‍♂️🐈⚙️ Key Features ⚙️ 🎮 1 Level\n🐈 100 Hidden Cats\n🎵 Awesome Soundtrack\n🎨 High Quality Resolution Artworks\n🥇 Achievements\n🌗 Brightness Settings\n⌛️ SpeedRun Mode (Timer)\n💾 Progress Saves\n🔍 Zoom\n😺 Real Meow Sounds!\n💥 Combo Counter!\n👫 Community\n🌐 No Text\n🏆 START YOUR AMAZING JOURNEY IN THE WORLD OF CATS RIGHT NOW 🏆Don't miss out on the cutest and exciting puzzle game ever! Come to 100 Asian Cats and start your amazing adventure today!😻🎁DLC List for this game🎁😻\n✅😻 Follow our Dev Page! 😻✅\nhttps://store.steampowered.com/app/2687200/100_London_Cats/?utm_source=100AsianCats_Bot","imageUrl":"https://media.rawg.io/media/screenshots/5cc/5cce7cdf7a7436f3baa8c8d01d2bb7b7.jpg","releaseYear":2023,"developer":"100 Hidden Animals","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":854345,"name":"HYPER DEMON","genre":"Action","price":0.0,"description":"HYPER DEMON is an FPS like no other..\na pearl of lightning. a dream from the future. a drop of poison. a swan song.\nThe faster you slay demons, the harder the game and the higher your score.\nThere is an end\nwill it see you?\n\n\n\nMaster minimal controls that open up a plethora of weapons and abilities for deep and spectacular combos.\nCollect gems to buff your shot and rapid or grab them to charge laser attacks and skillfully unleash cataclysmic super moves.\n\n\n\nGroundbreaking spherical projection gives the player wide peripheral vision without pinching and shrinking the center of the screen like a traditional linear perspective, allowing fields of view up to 180 degrees.\nA unique red holographic “rear view” overlay gives the player a full 360 degree sensory awareness of threats.\n\n\n\nChallenge your Steam and Discord friends’ scores or take the ultimate journey to reach the top of the Global Leaderboard.\nWatch Replays for any run, record and share clips straight from the game with embeddable video links that seamlessly work in Discord, Twitter and more.\n\nPhotosensitive seizure warning - This game contains intense visuals including stroboscopic effects.\nVideo games can be addictive - Please remember to breathe, drink water, take breaks, move, go outside, spend time with the ones you love.","imageUrl":"https://media.rawg.io/media/games/bc3/bc38deccf8bfab8b588d29817c68c1ff.jpg","releaseYear":2022,"developer":"Sorath","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":600965,"name":"Miss Furry","genre":"Action","price":0.0,"description":"🦊CHECK THIS OUT🦊https://store.steampowered.com/app/1349040/Furry_Love_2/\nAbout the GameGeneral\nMiss Furry is an Pleasurable Arcade Game, consisting of a Series of Thrilling Mini-Games with the Stunning Furry Girls 🐺\nStunning Furry Girls, Great Atmosphere, Amazing Music, 56 Levels with Full HD Furry Artworks.\nGood for relaxing after a hard day at work. Join us! Unique Features\nSeven Game Modes\nDynamic Gameplay and Varying Degrees of Difficulty\n56 Fantastic Levels with Full HD & 4K Furry Artworks\nGreat Atmosphere & Amazing Music\n100 Achievements\nCheat Code to Complete the Level - \"MISS\"\nContact - darkfantasy.gamedev@gmail.comGame Modes\nFurry Tron\nFurball\nFurrman\nFurry Cutter\nCatch the Furry!\nPuzzle\nRock, Paper, Scissors\nMany thanks to our artists:\nTotesFleisch8\nDanomil\nMissy\nSmileeeeeee(Oduvan7773)\nPaintchaser\nHpNerd-ALS","imageUrl":"https://media.rawg.io/media/screenshots/091/0919018ac3a04acd2a6997864ff6cf2c.jpg","releaseYear":2021,"developer":"빌리 헤링턴","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":579584,"name":"Crowalt: Traces of the Lost Colony - Prologue","genre":"Adventure","price":0.0,"description":"Wishlist The Full Versionhttps://store.steampowered.com/app/1269500/Crowalt_Traces_of_the_Lost_Colony\nAbout the GameCrowalt: Traces of the Lost Colony is an adventure game that is merging traditional storytelling with modern-day pixel art graphics. The choices you make will affect the course of events and you will draw your own path in this little and also mysterious town.\nThis version is a prologue of the full game. If you like this, please wishlist the full version.\nCHASING A MYSTERY THAT IS UNEXPLAINED FOR 150 YEARS\nA group of people who set out to establish the first settled colony in America in 1587, mysteriously disappears a short time after arriving. They leave only an island name carved on a tree: \"Crowalt\".\nNow, the year is 1737.\nA young and ambitious adventurer Hugh Radcliff pursues the Lost Colony to make his first great discovery. Now, different people live in Crowalt, where he came to solve this mystery. He will hover around the island and definitely will get in a series of troubles to find what happened to the Lost Colony.\nCLASSIC POINT AND CLICK MECHANICS\nCollect, combine, and use items to solve puzzles.PIRATES ARE HERE TOO!\nTry to deal with routine pirate visitors of Crowalt and of course, enjoy funny dialogues.FOLLOW YOUR JOURNAL\nHugh draws important things and takes notes regarding them in his journal. It will be updated after important events and findings during the game.MAKE CHOICESLie or speak only the truth.COLLECT ARTIFACTSThere are lots of historical items around the island, collecting them will take you to another level of… achievements!EARN THE TRUST OF NATIVESNatives are discreet residents of the island. Taking information from them will require earning their trust.","imageUrl":"https://media.rawg.io/media/screenshots/beb/bebc6b4249c7d61bf455ead81265ee66.jpg","releaseYear":-1,"developer":"Madcraft Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":442868,"name":"Blightbound","genre":"Action","price":0.0,"description":"The world lies in peril. Decades ago, a band of legendary warriors slayed the dreaded Shadow Titan after a long and ferocious struggle, but their celebration was short-lived. The Shadow Titan’s true intentions revealed themselves when from his broken husk flowed the Blight; a corrupting fog that alters any living creature exposed to its evil.\n\nBlightbound is a multiplayer dungeon crawler that tasks three heroes to venture down from their mountain refuge to face the abominations of the Blight - a mysterious and corrupting fog that enshrouds the land.\n\nExplore handcrafted dungeons, fight a terrifying cadre of mystical and monstrous enemies, grab valuable loot and recover fallen heroes to expand your roster of available warriors. Each player will fulfill a specific role on the team - warrior, assassin, or mage - to overcome colossal bosses and solve clever puzzles.\n\nCan you collect and complete all the challenges, and conquer the Blight once and for all?\nFEATURES\nBlightbound is an ever expanding game with new dungeons to explore, new heroes to recover and use, and new loot to retrieve with planned free updates for the community.\n\nCollect over 20 unique heroes, each with their own skill set, passive abilities, and fully narrated story to complete.\n\nHundreds of unique items to loot and craft to improve each hero and alter their repertoire of attacks and abilities.\n\nBuild out your refuge atop the mountain by recruiting new artisans to craft more items, fulfill bounties, and training your heroes.\n\nBattle through three distinct lands, each with several dungeons to conquer, including the eerie Gravemark, the oppressive Underhold, and precarious Blood Ridge.\n\nDistinct class roles that reward team play and powerful ultimate abilites that charge from fulfilling your role. Block damage as a warrior, interrupt enemies as an assassin or heal your allies as a mage.\n\nStunning mix of hand-painted characters and realtime 3D models and lighting effects.","imageUrl":"https://media.rawg.io/media/screenshots/86c/86cda9910f0ea55ee33a30e0079da157.jpg","releaseYear":2021,"developer":"Ronimo Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":428038,"name":"Vault of the Void","genre":"Strategy","price":0.0,"description":"Join the Discord\nAbout the GameA Single-player Roguelite card game where you're in control. Switch up your deck as you proceed, swapping in and out cards before combat to improve your odds and adapt to monster strategies.Purging\nUse your own cards as energy, choose which cards from your hand to discard to gain additional energy and fuel high powered combos.Customise your Cards\nCollect Void Stones, powerful Runes that can be socketed into cards to grant them additional abilities!FeaturesOver 150 player cards, each with unique upgrades\nUnlockable cards and custom Deck Backs.\nPlayer Spells and abilities - adding another element to the card play strategy\nOver 50+ unique and handcrafted Monster encounters\n6 different Void Stones to infuse with your cards, giving each card up to 7 variations\nOver 40+ Artifacts\nPlayer Classes - each with their own starting decks and unique spellsYour deck - your way.Vault of the Void is not a Deck Builder. You’ll have a chance to change you deck before each fight. Different encounters may require you to change and adapt your strategy before taking on a creature or guardian. Quickly switching out Bleed cards in favour of Strength gain could be the difference between victory, or an agonising defeat.\nThe more you play, the more you’ll learn about each mob group, and which deck type would be best suited to handle the challenge ahead.Customise your CardsOne of the most unique features in Vault of the Void is the ability to customise your cards. You’ll gather Void Stones as you progress through a run, and have the ability to socket them into any card in your library, giving them extra abilities.\nTake the humble Master Slash for example, which will deal 5 damage. Taking a Yellow Void Stone will now also grant you 2 Block. Or maybe a Blue Void Stone, which now gives it the added ability of \"Draw a Card\". There's hundreds of variations to try out, and how each of these interact with each other is part of the fun (and learning) that comes as you play.\nBut that's not all! The variations continue, as all cards have the ability evolve into more dynamic and powerful versions! Turn any humble card into potent backbones of your strategy that are only further enhanced with those precious Void Stones you collect.Fast paced combatVault of the Void offers card fights that are fast paced and familiar, with some subtle unique changes.\nAlthough you’ll regain some energy at the start of each turn, Purging cards gives you the final decision on which cards you should play, and which you should sacrifice to setup for later turns.\nAs creatures attack during their turn, they’ll increase your Threat. At the end of your next turn, your Threat stack will trigger, dealing damage to your hit points equal to its total value. Play Block cards to reduce your Threat reactively, and make the hard choice between damage, or survival.","imageUrl":"https://media.rawg.io/media/screenshots/a1e/a1e6a5bb30ff067bd9b34ef46d790e27.jpg","releaseYear":2022,"developer":"Spider Nest Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":351600,"name":"After the Fall","genre":"Action","price":0.0,"description":"After the FallFrom the creators of the hit VR shooter Arizona Sunshine comes an epic multiplayer VR action FPS with seamless, co-operative gameplay at its core that pits up to four players against a vast, hostile VR world in a raging fight for survival.\nSet in the ice-covered ruins of LA nearly 20 years after the apocalypse, After the Fall combines a living, breathing VR world shared with players from all over the world, a cinematic and atmospheric campaign, action-packed solo and multiplayer gameplay, and endgame built from the ground up for VR.\n2005, LA. A generation has passed since a mysterious outbreak caused by the excessive use of designer drugs birthed the terrible Snowbreed, infesting our cities and collapsing civilization. You, one of the survivors seemingly immune to the side-effects of the substances, are humanity’s last hope of resurgence. Explore the remains of a civilization ground to a halt in an alternate 1980s, craft deadly weapons and wield devastating powers with real-life movements as you develop you combat style, and join forces with players worldwide as you go head to head with relentless hordes and larger-than-life bosses in a bid to take back the city. It’s time.\nAn Epic Multiplayer VR Shooter: Go solo or join forces in seamless co-op on a campaign through a post-apocalyptic, infested VR world from the creators of Arizona Sunshine\nHell Has Frozen Over: Discover, scavenge and survive the ice-covered and Snowbreed-infested ruins of a post-apocalyptic LA ground to a halt in an alternate 1980s\nLarger-Than-Life Boss Fights: Survive unprecedented hordes, fight tactically to defeat Specials and think on your feet as you square off against awe-inspiring bosses\nCraft Your Ultimate Loadout: Craft, upgrade and mod your gear, from armor and a huge array of guns, to melee weapons and ingenious combat devices\nDiscover Your Combat Style: Wield a huge variety of deadly weapons and devastating powers, from crowd-control to badass Snowbreed manipulation, all with real-life movements\nThe End is The Beginning: After completing the story campaign, venture out into a living world full of events, missions, and blood-pumping encounters","imageUrl":"https://media.rawg.io/media/screenshots/dbd/dbd8d8c54d0d0d11520f8f2ffc581896.jpg","releaseYear":-1,"developer":"Vertigo Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":326994,"name":"Lovely Planet 2: April Skies","genre":"Action","price":0.0,"description":"Shoot baddies. Dodge Bullets. Find Secrets\n\nSequel to the most adorable First Person Shooter Gun Ballet. Feel the speed once again as you jump and shoot your way through the familiar cuetsy abstract world filled with clever traps and angry baddies fuming with rage. Pick out targets with precision accuracy and dodge an infinite barrage of bullets carefully jumping between floating islands all while racing the clock for a better score.\n\nPlay a 100+ levels of pure jumping and shooting\nExperience five unique worlds with brand new traps and enemies\nReplay every level in a more challenging new game mode ☯\nExplore to find hidden levels, secrets and achievements\nVibe to an original soundtrack by Calum Bowen","imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c280259c3f4461dd8e5035bca928435.jpg","releaseYear":2019,"developer":"QUICKTEQUILA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":63796,"name":"Just, Bearly","genre":"Casual","price":0.0,"description":"A comedic story game played in vignettes, about feeling anxious as a bear in inner city Melbourne, Australia, and trying to connect to people none the less.\nClick, pull, mash, and guide your way through an ever changing mix of dialogue choices, reaction challenges, dexterity tests, rhythm games and God only knows what else as you overthink and under-perform your way through every day life -- Striving towards greatness and being less of an awkward, anxious, crap.\nKey features:\nVignette story telling\nVery realistic simulations of awkward situations\nInteractive panic attacks\nLaugh-y bits\nCry-y bits\npretty ok original photography","imageUrl":"https://media.rawg.io/media/screenshots/d45/d45b7c3a59f71361120448175e62e796.jpg","releaseYear":2018,"developer":"Daniel J Roberts","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":63256,"name":"God Vs Zombies","genre":"Action","price":0.0,"description":"Storyline\nBecause of a zombie epidemic your the last human on earth and billions of years of gods time has been wasted.With you been the last human alive God has come to help you survive on a desert island you have stranded yourself on. You can expand your land and build on it but beware zombies can smell you from the other side of the planet so night by night the amount of zombies coming will increase\nFeatures\nGiven Godly powers you can create your very on land to build on\nFully night and day Eco system\nWaves of zombies that increase night after night","imageUrl":"https://media.rawg.io/media/screenshots/ab1/ab1eb25454a34577fdcd49d221ee31c0.jpg","releaseYear":2018,"developer":"Kev Jackson","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":59904,"name":"My Little Farmies","genre":"Simulation","price":0.0,"description":"The Medieval Village of your Dreams\nWhat a development! It started out a plain green field – but you've managed to turn the little plot of land into a bustling medieval village. Lay paths, build a magnificent flour mill, grow grain, vegetables and fruits, harvest your produce and process it into countless goods to sell to your eager customers. Experience the entertaining farm game My Little Farmies. Create your own medieval village according to your wishes in this captivating tycoon game. Keep animals, practice agriculture and expand your sphere of influence.\nGuild, Trade and Challenges\nDiscover the extensive opportunities this unique building game offers. Breed rabbits, chickens, geese, sheep, swine, cattle and many other animals. Process natural products such as eggs, milk and meat in a variety of production chains to make luxury goods. An exciting blend of farm game and tycoon awaits you! Features include:\nExtensive production chains\nExciting seasonal events\nConstruction of artisan workshops and production sites\nA fascinating farm setting with cartoon graphics\nGuild features\nSocial features\nAnimal husbandry and breeding\nExtraordinary tycoon game options for long-lasting fun\nFrom your Fields to the World\nManage your village successfully to turn it into a thriving town with prospering trade. Use agriculture and animal breeding in this farm game to make your mark. Mill grain into flour and bake fragrant bread, or process plums into juice and brandy. Upgrade your buildings and decorate your village!\nDownload Now and Get Started\nLet yourself be whisked back to the Middle Ages and experience the captivating mix of tycoon and farm game!\nMy Little Farmies can only be played online. Existing accounts for the browser game of the same name cannot be linked to Steam.","imageUrl":"https://media.rawg.io/media/screenshots/32b/32b5040279c2fa92d8a421bf57c9a624.jpg","releaseYear":2018,"developer":"KING Art","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":59675,"name":"Treasures of the Ancients: Egypt","genre":"Adventure","price":0.0,"description":"Go on a trip to Egypt. Everything is as usual: dangers, traps and unpredictable events. This journey is guaranteed to leave an indelible imprint in your soul.Features:Easy and hard levels\nPlenty of obstacles\nThe scorching sun over his head\nNice graphics\nAbove your head hangs a constant bright sun. Perhaps all these rumors about Egypt, which have survived to the present day - about the walking mummies, scarabs, not shy of human flesh-is true? Looks like you're the one who's been fated to find out. Tighten your belts and get ready for a charming and dangerous adventure.","imageUrl":"https://media.rawg.io/media/screenshots/daa/daa27d69489a99704931002258e5fee5.jpg","releaseYear":2018,"developer":"Garage Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":59157,"name":"Banner Saga Trilogy","genre":"Action","price":0.0,"description":"Weave your own thread through this epic Viking RPG adventure with the Banner Saga Trilogy. Guide your caravan across the landscape of a breaking world, where the sun has stopped in the sky and the gods are dead.  Bold leadership decisions, wise use of resources, and skillful battle tactics are vital to ensure that you and your clans make it through alive.\r\n- Beautifully hand drawn combat sequences and animations, accompanied by an evocative score from Grammy-nominated composer Austin Wintory, will immerse you into a fantasy realm inspired by Norse mythology.\r\n- Choose from 48 playable characters from 4 different races and 40 different classes, each with unique abilities and upgrade options to fit your play style.\r\n- Strategic combat with consequences - victory or defeat and even the permanent loss of a character depends on which characters you choose to take into battle and what decisions you make afterwards.\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\n© 2018 The Banner Saga © 2018 Versus Evil, LLC. Versus Evil and the Versus Evil logo are trademarks of Versus Evil LLC. All rights reserved.  All other logos and trademarks are property of their respective owners.","imageUrl":"https://media.rawg.io/media/games/687/68704d4931b100550993fc858729396e.jpg","releaseYear":2018,"developer":"Versus Evil","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":56962,"name":"Castlevania: Bloodlines","genre":"Action","price":0.0,"description":"Castlevania: Bloodlines is a platform game developed, and published by Konami for the Sega Genesis, released worldwide in March 1994. It was the only Castlevania video game released on the Genesis.\nThe game's storyline concerns a legendary vampire named Elizabeth Bartley, who is Dracula's niece, suddenly appearing in the 20th century. Plotting a sacrificial war in order to bring her uncle back to life, she orchestrates the beginning of World War I. Quincy Morris' son, John, and his best friend Eric Lecarde, vow to take up the fight against evil. Together they manage to prevent Dracula's full resurrection.","imageUrl":"https://media.rawg.io/media/games/ffb/ffb20e5a56e138ca17c45ef134f29092.jpg","releaseYear":1994,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Genesis"}]},{"id":49690,"name":"KARAKARA2","genre":"Casual","price":0.0,"description":"Let us live\non this land so arid.\nKARAKARA. It is the sound of aridity. It is the sound of dry asphalt and sandy winds. It is the sound of relentless sunshine, as well as the sound of a withering race.\nThe \"Age of Dusk.\" It is a time of senescence for the human species, during which hybrids known as the \"Others\"—those who are human, yet not—exist in great numbers. On the windswept barrens of a land without moisture, a small gathering of people make their living in a world they no longer know. Down a stretch of highway and far from the heart of the town are two such people who run a small diner. To them, the circumstances that reshaped their world is of far less concern than the number of lunch boxes they can load into their delivery vehicle. After all, leaving customers hungry is not good for business, and business keeps them fed. Day after day, they occupy themselves with the endless work of their store. However, the comfortable monotony of their daily lives is turned on its head when they discover a large suitcase by the roadside on their way home from deliveries. Lying on the suitcase, unmoving, is a young girl with pink hair...\nThough parched, they keep each other company,\nand while hollow, they fill each other's voids.\nSo shall they live\non this land so arid.\nFeatures:\nContinuing the story from KARAKARA\nMeet Rebecca=Valentine, One day, she visits Leon's diner. With a gentle, tender personality and the disposition of an older sister, she handles any and all household chores flawlessly, and has excellent skills in horticulture -- rare in this \"Age of Dusk\". But the truth is, she is under certain \"circumstances\"...\nMeet Mari=Mizuno, Holding ninjas in great esteem, this girl trains day and night. Leon finds her on the brink of starvation and comes to her aid, leading her to respect him greatly. She never slacks on her training, leading her to possess great physical prowess -- she makes full use of this, volunteering to guard the diner.","imageUrl":"https://media.rawg.io/media/screenshots/705/7052a16e08b04ccd65fe9a707693ffea.jpg","releaseYear":2017,"developer":"calme","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45760,"name":"FPV Drone Simulator","genre":"Simulation","price":0.0,"description":"This FPV Drone Simulator is especially designed for practicing your drone flying skills! Fly in different environments. Choose 'free ride' or 'fantasy forest'. Flying ingame works best with a dual stick controller, otherwise a keyboard and mouse will do.\nKey features:\nfocus on realistic physics\nrealistic flight mechanics\ncontinuous development\nWe would love to receive feedback on our drone race simulator and don't forget any wishes your want us to implement.\nThis is by no means an end product, so be gentle please.","imageUrl":"https://media.rawg.io/media/screenshots/97b/97b8d000d0a3a776f4d89d22408411e8.jpg","releaseYear":2017,"developer":"hacky97","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]