[{"id":31777,"name":"Thief: The Dark Project","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/86d/86d7f559c312a2082e4b1c1a184b8215.jpg","releaseYear":1998,"developer":"Looking Glass Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31396,"name":"Icewind Dale","genre":"RPG","price":0.0,"description":"Evil stirs beneath the Spine of the World.\nIn the northernmost reaches of the Forgotten Realms lies the region of icy tundra known as Icewind Dale. Journey deep into the Spine of the World mountains, a harsh and unforgiving territory settled by only the hardiest folk. Encounter fearsome beasts that have learned the cunning and ferocity needed to survive among the snow-shrouded peaks. Confront an evil that schemes beneath the carven glaciers and mountainsides to wreak destruction upon the face of Faerûn. This is the world of Icewind Dale: Enhanced Edition.\nOriginally released in 2000, Icewind Dale is a Dungeons & Dragons game set in Wizards of The Coast's legendary Forgotten Realms. This Enhanced Edition allows a new generation of players to experience this epic adventure.\n- Swords and Sorcery: Discover dozens of new spells and items, including new magic armor and weapons.\n- Blackguards and Wizard Slayers: Select from almost 40 new kits and classes to create the perfect adventuring party.\n- A New Look: Experience the Enhanced Edition's all new interface, including the new Quickloot bar.\n- Bring A Friend: Join your fellow adventurers in cooperative, cross-platform multiplayer games.\n- See The Unseen: Explore quest content cut from the original game, now finished and restored.\n- More to Experience: Enjoy the countless bug fixes and improvements that await you in Icewind Dale: Enhanced Edition!","imageUrl":"https://media.rawg.io/media/games/e77/e77d7707d4cb2b2c3c642fb9dc124cf9.jpg","releaseYear":2000,"developer":"Black Isle Studios","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":27404,"name":"Wario Land 4","genre":"Action","price":0.0,"description":"Hey! You! Yeah, you! Listen up when Wario's talking to you! I just read about this legendary Pyramid of Gold, and you're gonna help me go explore it. There's lots of treasure in there for the taking, and I want it all. I'm sure there are gonna be all kinds of weird enemies and big, bad bosses in there, so if you don't think you can hack it, put the game down now. I don't want any losers making me jump into bottomless pits, you hear me?","imageUrl":"https://media.rawg.io/media/games/64f/64f2745f1f49b106a523ce3defdbfc03.jpg","releaseYear":2001,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":23284,"name":"Defence to death","genre":"Strategy","price":0.0,"description":"Defence to death  - game in genre \"Tower Defence\". Defend Your castle from monster! Show Your's strength and wisdom.\n- Build, upgrade and sell towers.\n- Earn  money in the mine (click on mine)\n- Destroy enemies by clicking them!\n- Buy upgrades for towers in the shop. Without it you'll not able to upgrade tower.","imageUrl":"https://media.rawg.io/media/screenshots/c6a/c6afb931396d19cfb11c1ecab9400c88.jpg","releaseYear":2017,"developer":"Laush Dmitriy Sergeevich","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22703,"name":"Wing Commander: Privateer","genre":"Action","price":0.0,"description":"2669, Gemini Sector, Troy System. The Terran frontier between the Kilrathi Empire and the unknown. Privateer takes you to the seamy side of the Wing Commander universe. In the far reaches of space, you live by no man’s rules but your own. The fringes are populated by a volatile mix of pirates, miners, mercs, cutthroats, and Kilrathi, all struggling to make a life for themselves.\nIn this open-ended game you can choose from many paths. You start with a rusted scout ship and a handful of credits in your pocket. It isn't much, but the universe is there for you to explore in search for profitable opportunities.\nBecome a patient, law-abiding merchant, a smuggler far away from the normal space lanes, a pirate preying on the weak, or a professional mercenary hunting down criminal scum. Or just do whatever suits you at the time. At the end of the day, it’s all about money and survival. Mostly money.\nAre you determined enough to forge your own destiny?Includes the Wing Commander Privateer: Righteous Fire expansion.\nCustomize your ship according to your needs and budget, modifying weapons, armor, and other systems\nChoose the life of a pirate, merchant, or mercenary. As long as you keep a couple of steps ahead of your enemies and a couple of bucks in the black, you’re a free agent\nExplore a vast universe with countless bases and planets spread out across dozens of systems. Adventure, trade, and exploration are limitless, even after you’ve finished the main game","imageUrl":"https://media.rawg.io/media/screenshots/10e/10e99a47e3dca70d9b596a40bd47ca63.jpg","releaseYear":1993,"developer":"Origin Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21951,"name":"Book of Spells","genre":"Adventure","price":0.0,"description":"Book of Spells is the first title for Wonderbook™ featuring original writing from J.K. Rowling.\nRead, discover, learn and practice spells as well as discover mischievous notes and humorous anecdotal facts relating to the spells. J.K. Rowling has also written a conundrum that leads you through the experience, inviting you to journey through the book rewarding successful students along the way.","imageUrl":"https://media.rawg.io/media/games/a60/a6032d07b15873d9d84b11bf1be286ba.jpg","releaseYear":2012,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":21729,"name":"Realm of Perpetual Guilds","genre":"RPG","price":0.0,"description":"The journey begins with four silent protagonists. They go into dungeons, fight\nenemies, defeat bosses, and level up. But, is that all there is to their lives?\nMeanwhile, in the real world, a group of bored game designers are looking\nto bridge the gap between the virtual and real worlds. Will your protagonists\nsimply fight respawning enemies for all of eternity or will they achieve\ngreater things? (Intended to be part 1 of a trilogy).\nThis is a game for those that like snes-era rpgs and dungeon crawlers.\nFeatures:\nFree-turn Stamina Battle System (Mixture of SMT Nocturne and Chrono Cross).\nFull recovery after every battle.\nSave from menu at any time.\n10 Classes to choose from at start of game. You pick a class for all 4 of your starting characters at the beginning of the game (Like in FF1). High replayability value.\n12+ hour game\n7 Challenging dungeons (game is intended for those who like battles)\nAvailable Classes:\nWarrior/Berserker: Physically strong. Useful for ending battles quickly\nDefender/Sentinel: High HP and defense. Can Support party\nRogue/Hunter: Balanced stats and varied abilities,\nEarth Mage/Ice Mage: Healing and magic spells.\nThunder/Flame Mage: Strong attack magic.\nIn the Free-turn Stamina Battle System, you get 4 actions per turn that can be distributed between your 4 characters as you wish. Characters can even act 2-4 times as long as they have the required stamina.","imageUrl":"https://media.rawg.io/media/screenshots/25d/25dbb1e9565685716644da5308a8efc0.jpg","releaseYear":2015,"developer":"Omega Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20810,"name":"TransPlan","genre":"Strategy","price":0.0,"description":"Deliver your payload from point A to point B with only a few simple tools and the laws of physics.  Create ramps and catapults, watch objects tumble and fall, and someway... somehow reach the destination.  Each project is a hand-drawn puzzle for you to interact with -- Devise a plan, experiment, and make it happen!\nTransPlan features dozens of projects to explore, starting simple and growing ever more complex.  Unlock later puzzles and categories by completing earlier ones, and finish projects on-budget to earn hints to help you later on.  TransPlan fully supports achievements and cloud saves so your progress will stay with you anywhere!","imageUrl":"https://media.rawg.io/media/screenshots/b89/b89dc69ebec31f8ed1f0f893b8a6d78e.jpg","releaseYear":2015,"developer":"Kittehface Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":20749,"name":"Bunny Must Die! Chelsea and the 7 Devils","genre":"Action","price":0.0,"description":"From the creator of the Gundemonium Collection comes a thrilling new 2D action-platformer!\nHelp Bunny escape the Devils’ Labyrinth and defeat the 7 Devils in this hilariously over-the-top action-platformer game. Battle through a large, connected map filled with unique enemies, traps, and puzzles. Use magical items like the Sylph Shooter and the Hyper Heels to power up and defeat the 7 Devils. Manipulate the fabric of time to solve puzzles and survive. Will Bunny be rid of those new ears she so despises? Only with your assistance can she brave this dangerous maze...\nKey features:\t\t\t\t\t\tBeautiful hand-drawn 2D graphics\nOver-the-top comical style with a charming storyline\nPlay through 7 dangerous areas and battle 7 powerful Devils\n2 versions: Choose between the original graphics or new remixed sprites\nAcquire magical items, new abilities and manipulate time to solve puzzles\nA new arranged soundtrack by Woofle (Gundemonium Collection), alongside the original\nFull arranged soundtrack in high-quality MP3 format for listening outside of the game\nJapanese language support now available!\nDownload Demo http://bunnymustdie.com/demo/","imageUrl":"https://media.rawg.io/media/screenshots/056/0566b34838ec8ea60a9672a298246113.jpg","releaseYear":2012,"developer":"Platine Dispositif","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20742,"name":"Kill Fun Yeah","genre":"Action","price":0.0,"description":"Kill Fun Yeah is an online 2D platform shooter.\nMurder and capture your way to the top, using an ever increasing arsenal of silly weaponry and items, the powers of deflect, attract and freeze, as well as various powerups.\nMake your own maps, using custom made tilesets and background sprites and create your own custom player skin to make you stand out on the battlefield.","imageUrl":"https://media.rawg.io/media/screenshots/819/819dcbedc29feef6f5841228e4ae2cc2.jpg","releaseYear":2014,"developer":"Arctic Anteater","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20533,"name":"Chronicles of the Witches and Warlocks","genre":"Adventure","price":0.0,"description":"Bad news! The lawyer Kathleen Wilson has discovered that her beloved Danny Reed has been arrested under strange circumstances. He’s being accused of murder. In order to free Danny, she’s going to have to carry out her own investigation.\nKathleen has to find out the truth of what really happened. Was he set up, or was it just some kind of misunderstanding? Is there something bigger behind all this? Right now, nothing is clear...\nCollect photographs, notes, slides – anything that might be useful in your investigation. Record all the facts and clues in your notebook - they could come in handy later. It isn’t hard to hit a dead end in an investigation, but don’t panic - you can use a hint.","imageUrl":"https://media.rawg.io/media/screenshots/10f/10f5a6027dfdbc2864721d14b5d74064.jpg","releaseYear":2015,"developer":"8Floor","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19019,"name":"Pajama Sam 4: Life Is Rough When You Lose Your Stuff!","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameSam's bedroom is a mess!\nLost among the piles of clothes and toys is his prized comic book. Donning his red cape, Pajama Sam dives into the chaos only to land in a strange and fantastic world that resembles his messy room. Pajama Sam sets off on a series of adventures in search of his lost comic book, looking for lost socks in Agitator Lake, rounding up dust bunnies at the Dust Bunny Corral, exploring the Spilled Soda Swamp and much more. In the end, Sam finds his comic book and realizes that life wouldn't be so rough if he put away his stuff! Throughout the story, kids meet lots of interesting new friends and tackle fun challenges that will inspire them to solve problems in creative ways.\nHelp Sam find his comic book.\nYou will have to listen carefully for clues from the friends you meet !\nThe adventure changes each time you play.","imageUrl":"https://media.rawg.io/media/screenshots/ee8/ee860bdf745e6b4d46f83aa742254e1f.jpg","releaseYear":2003,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17585,"name":"March of War: FaceOff - M","genre":"Strategy","price":0.0,"description":"March of War: FaceOff\nThe Battlefield Card Game.\nPlayed out on a beautiful game-board battlefield, FaceOff offers many of the familiar mechanics of the typical card game; however, the game-board play adds a unique “terrain” dimension missing from other card games.\nFaceOff not only plays different than other card games – it is the only Steampunk card game we know of on Steam.\nCome join the FaceOff alt-history Steampunk wargame community - choose a faction, build a devious deck, and then put on your poker face as you Face Off across the game-board battlefield. Unleash devastating barrages, advance your army, and pulverize the enemy with a dazzling combination of cunning strategy and totally unexpected card combinations.\nWith hundreds of cards across three unique factions, no game is ever the same. Craft your perfect deck and play for free against the AI or human opponents!\nMany FaceOff players are active chess players looking for entertaining new ways to exercise their chess skills. So if you like card games, and you like chess - then why not download FaceOff and give it a spin - its Free to Play.FeaturesOne Account - Multi-platform\nWindows, OS X, Android, iOS\nLink any supported device to your account\nStart game on PC and finish on your tablet (PvE) only\nFree 2 Play\nNo units restricted to paying only players\nEarn cards as rewards\nEarn tickets as rewards\nEarn Coins\nLocalization\n8 Different Languages\nMore to come\nExtensive Deck Building\nBegin with versatile starter deck\nEarn cards & build unlimited custom decks\n3 Unique Factions, 400+ cards\nDisintegrate excess cards & craft new ones\nBoard Based Gameplay\nMore Skill – Less RNG\nAll strategy except for card draw\nUnique position based gameplay","imageUrl":"https://media.rawg.io/media/screenshots/967/96725b8b39ac5930ef159fe124c636b0.jpg","releaseYear":2015,"developer":"ISOTX","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17277,"name":"Mistfal","genre":"Action","price":0.0,"description":"Description:Mistfal is a psychological thriller in a spirit of Stephen King's novels and HP Lovecraft. The literary basis - a diary of the protagonist and the chapters of the diary follow the levels of the game. The Gameplay represents an old school survival horror with stealth elements. The literary basis is inseparable from the gameplay as well as the curiosity is inseparable from the fear.Story: The protagonist is a retired soldier who fought against terrorism in the Middle East and Afghanistan. He came back home where the tragedy awaited him - his wife died. Сurrently he had to raise his son alone. One day he and his son went on a picnic together to the abandoned National Park \"Mistfal\". Once upon a time, in childhood, the main character used to came there with his father. Now he tries to investigate the sinister story that led to the closure of the park. Suddenly the picnic turned into a nightmare. The mist, rising from the valley, brought superstitious horror. With the advent of the night the old legends of these places come alive and the protagonist had to overcome all the difficulties and fears, in order to save his son.Features:Complete the passing game is 3-6 hours\nThe total volume of the literary part of the game is 14 sheets of A4 size, but you can skip reading, although I highly recommend:)\nVarious locations: natural, mystical and industrial\nMoving between worlds using portals\nSolution of different quests to pass the levels\nThe enemies are powerful ans fast - to escape from them is difficult\nFocus on the stealth walkthrough\nGraphics settings: resolution, brightness, texture quality etc\nControl settings with the ability to reassign keys, inverse mouse, reassign gamepad buttons","imageUrl":"https://media.rawg.io/media/screenshots/beb/bebe2d976fecbd903da71d6c4d7c608b.jpg","releaseYear":2016,"developer":"Sergei Minin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16566,"name":"Hospital Manager","genre":"Simulation","price":0.0,"description":"Choose and hire your doctors and employees, build the departments of your choosing, and manage your finances! Are you thrifty or a big spender? Would you rather pamper your patients instead of your banker? Make your own decisions!\nYou'll have many missions to accomplish, littered with all kinds of epidemics, patients with disturbing pathologies such as the zombie disease, the Chewbacca syndrome, and the moonwalk virus. Be on the lookout: Many events will spice up your rise, such as exterminating extraterrestrial germs and stopping toad contamination!\nCustomize your hospital down to the last details, buy high-tech equipment, choose rooms that will make your hospital center the most popular one!Key FeaturesUse comprehensive management of your hospital to your advantage: You're the boss!\nBuild your reputation with a large variety of factors\nAccomplish diverse and surprising missions\nPlunge into an explosive 3D cartoon style universe with wacky pathologies and situations!\nExperience a nonlinear adventure: Every decision will lead to different consequences, depending on when the action happens.\nA rich system of artificial intelligence that can adapt patient behavior to each of your actions and decisions!","imageUrl":"https://media.rawg.io/media/screenshots/5f3/5f346f626826ff8b5f3798ed2c589689.jpg","releaseYear":2014,"developer":"CCCP","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15826,"name":"Dark Eden","genre":"RPG","price":0.0,"description":"(Features)\n1. Unique Theme and Genre\nThe game constitutes of a unique objet which is vampire in the near future and this differentiates Dark Eden from the other MMORPGs.The game has modern horror fantasy background through combination of heroism, middle-age fantasy and SF future atmosphere.\n2. Battle between races based on and well-made scenario\nYou can choose race freely from Vampire, Slayer and Ousters who fight with each other. Small-size conflicts between races occur for delicate turf war. Further, large-scale war between races which seems to be strategic enough and siege warfare between guilds occurs inAdam’s shrine.\n3. Differentiated characteristics of races\nVampire and Ousters use level system while Slayer uses skill system. Each race has unique growth system, item configuration, sill and class. Vehicles including motorcycle, helicopter, bat and warp tunnel, shylph jam, horn of spirit of land enablecharacters to move on map quickly and spells are provided that each race has its own merit and drawback.\n4. Change in stats according to time\nChanges in day and night are not limited to vision and background scene but affect stats of each race according to the time. Vampires become stronger in the night while Slayers and Ousters become stronger during day.\n5. Race System\nClass system where the characters grow irrespective of level has been adopted and support class skill which the characters can learn skills selectively.\n6. Various Skills\nVampire and Ousters have about 40 and 70 skills and spells respectively. Slayers have about 100 types of skills and spell. Further, there are 30 types of passive skills according to the class\n(Help Guide)\n\tCreate Character\n- Create character\n1. Enter [ID and PASSWORD] of the account registered and click [Login] button.\n＊ [OTP] is optional but is recommended to use for safe security\n2. Register [2nd password], enter the password and click confirm button for safe game play\n3. Choose world and channel for playing game\n＊ The world is an independent space can you cannot use characters in other world therefore choose the world carefully.\n＊ [Blitz] world is a special world where Exp gain ratio is higher than the other worlds. However, the figures are initiated after certain time.\n4. Choose and double click place for creating character or click [Create Character] button.\n＊ You can create 3 characters at maximum in an world.\n5. Set race, name and gender of character then click [Create Character] button.\n＊ Character’s name should be within 5 and 10 worlds for Korean and English respectively.\n＊ Ousters do not have gender.\n- Delete character\n1. Choose character to be deleted and click [delete character] button.\n2. Enter registration number of the account and click confirm button to delete the character.\n＊ The deleted character can be recovered within 10 days from the deletion. Items and game money cannot be recovered therefore carefully delete the character.\n\tGame control\n-How to control\nUse mouse and keyboard shortcuts for easier game play!\n- Mouse control\nYou can get item, move character and follow subject by using mouse.\n- Keyboard control\nYou can play the game faster by using various shortcuts for control therefore play the game more conveniently.\n* You can change and use keyboard shortcuts to be your taste.\n1. You can check shortcuts through game menu (ESC) -> change option -> game setting -> keyboard setting.\n2. You can modify and change shortcuts to be your taste in keyboard setting.\n- Keyboard shortcuts\n* When chatting screen is closed, you can use it as shortcut apart from [Ctrl] key.\n- Keyboard shortcuts\nShortcut\tUsage\nALT + TAB\tLogout window\nEsc\tGame menu\nCtrl + H\tHelp guide\nCtrl + Tab\tEquipment screen\nTab\tBag (inventory)\nCtrl + M\tMini map\nCtrl + I\tCharacter information\nRight Ctrl + Subject for checking information\tSee character information\nCtrl + K\tSkill information\nCtrl + S\tOpen skin icon screen\nCtrl + C\tGeneral chatting\nCtrl + Z\tZone chatting\nCtrl + A\tParty chatting\nCtrl + G\tGuild chatting\nCtrl + T\tChannel chatting\nCtrl + W\tWhisper\nCtrl + E\tChatting screen\nAlt + Click subject for trade\tTrade\nRight Alt + Click subject for making party\tMake party\nCtrl + P\tParty screen\nShift + Click subject for attack\tForced attack\nLeft, right Alt\tCheck dropped item\nCtrl + ~\tOn/ off quick item\nCtrl + click subject for following\tFollow the character selected\nCtrl + V\tChange shadow display option\nScroll Lock, Print Screen\tScreenshot\n- Chatting shortcut command\nEnter each command on chatting screen\nI.e.>enter [/c] then enter your saying for general chatting.\nShortcut\tUsage\n/C\tGeneral chatting command\n/Z\tZone chatting command\n/P\tParty chatting command\n/G\tGuild chatting command\n/W\tWhisper command\n/U\tAlliance chatting command\n/BGM\tBGM on / off\n/Sound effect\tSound effect on / off\n/Chatting guide, /?\tSee chatting guide\n/Help, /help, /H, /help\tSee basic help guide\n/Where, * where\tCheck server where certain user is logging in\n- Shortcuts of each race\nClick skill icon and put mouse point on the skill for appointing the number of skills.\nRace\tShortcut\tUsage\nSlayer\nF1 ~ F8\tBelt shortcut\nYou can use the shortcut by using belt item.\nF9 ~ F12\tSkill shortcut\nYou can appoint and use skills by using shortcut.\nVampire\nF1\tShortcut for using serum(recovery) item\nItems such as serum in inventory are automatically registered and you can use the item.\nF5 ~ F12\tSkill shortcut\nAppoint and use skills by using shortcut.\nOusters\nF1 ~ F6\tShortcut for arms band\nYou can use it by using arms band item.\nF7 ~ F12\tSkill shortcut\nAppoint and user skills by using shortcut.\n\tBasic interface\nLearn the whole structure of interface of Dark Eden.\n* All interfaces apart from mini map and skill screen can be moved.\nNo.\tUsage\tContents\n1\tBuff screen\tStatus-related spells applied to the character including buff and debuff are displayed.\n2\tChatting screen\n(Open: Enter)\tChatting mode setting or the contents of chatting you or the other user entered.\n※ You can check the previous contents by using mouse wheel or scroll bar on the right side of chatting screen.\n3\tBelt , arms band slot screens\tThis screen is displayed when slayer and ousters wear belt and arms band items.\n※ Not for vampire.\n4\tInformation screen\tCurrent data in the game, major stats of character are displayed.\n5\tInsane gauge\tA(Attack insane mode): this mode is charged by attacking, special abilities including sucking blood and sucking soul.\nD(Defense insane mode): this mode is charged from attack by the others.\nP(Party insane mode): this mode is displayed in party status only and is charged from attack by the others.\n6\tStatus gauge\tCharacter level and status are displayed.\nSlayer : red: HP(health point), blue: MP(mana point)\nVampire : red: HP(health point)\nOusters : red: HP(health point), blue: EP(energy point)\n7\tQuick item slot screen\tItem and skills registered in belt and arms band screen are displayed.\n8\tHelp screen\tClick to see help guide.\n9\tQuick skill screen\tCurrently activated skills are displayed. You can check or appoint the skills you learnt by clicking the skill.\n10\tMini map\n(Shortcut: M, Ctrl + M)\tYou can check the current location.\n※ Green zone is safe zone and +on the map is NPC.\n11\tGame menu screen\tThe game menu at the bottom is displayed and opened by clicking this menu.\nMenu\tGame information\tYou can open my information, skill information, quest, pet information screens\nGuild\tYou can open guild information, guild list, awaiting guild and guild member.\nCommunity\tYou can open friends list, party screen and letter box.\nStore\tYou can open Daden market, personal store and shopping list.\nHelp\tYou can see basic help guide\nEtc.\tYou can change option, logout and finish the game.","imageUrl":"https://media.rawg.io/media/screenshots/832/8327c9049c7efa37d4225f2ca590fb25.jpg","releaseYear":2016,"developer":"SOFTON ENTERTAINMENT","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15286,"name":"NITE Team 4","genre":"Adventure","price":0.0,"description":"Early Beta Access\nAbout the Game\nNITE Team 4 is a story-driven military hacking simulation game that explores the world of cyberwarfare and features realistic mission scenarios. It will be released on Steam for PC and Mac.\nYou play as a new recruit in the covert hacking cell, Network Intelligence & Technical Evaluation (NITE) Team 4. Engaged in cyberwarfare with black hat groups and hostile states, you will be in a struggle to penetrate highly secure targets. Your job is to use the STINGER hacking system to infiltrate hardened computer networks and coordinate strike teams on the ground to carry out missions that feature real espionage tradecraft terminology taken straight from leaked NSA documents.\n\nIn NITE Team 4, players will have access to a virtual hacking platform based off real systems (Kali Linux / Metasploit). Each mission is broken down into distinct phases including Recon, Exploitation and Raid.\nIn the Recon Phase, players will be performing research and investigative tasks to learn all they can using actual espionage tradecraft. Utilize reconnaissance tools to map networks, fingerprint systems and gather intelligence that will help you uncover possible weaknesses in the target organization.\nAfter gaining a thorough understanding of the enemy, players will move to the Exploitation Phase where they will use hacking modules to exploit and gain a secure foothold into the target. Customize your attack strategy by leveraging all the offensive system tools at your disposal.\nFinally, the Raid Phase begins where players will work with military teams on the ground to provide specialized support and direct units to effectively compromise an entire facility/organization using highly advanced cyberwarfare equipment. Ensure your team is well equipped to defeat threats on the ground, facility security controls and network defenses.\nHACKING SUITE - The STINGER hacking platform is inspired by actual platforms like Kali Linux. It allows players to control sophisticated modules and use custom intrusion tools to deliver an authentic hacking experience.\nIN THE FIELD - Direct troops in the field to carry out hacking operations like covertly implanting devices with eavesdropping equipment and sabotaging targets.\nRICH STORY - Mission objectives and descriptions feature real world NSA intel analyst terminology, taken straight from leaked NSA documents in the Snowden archive and inspiration from actual cyberthreats.\nALTERNATE REALITY WAR GAMES - From Advanced Persistent Threats to covert malware projects that destroy critical infrastructure, NITE Team 4 is inspired by the real world of cyberwarfare and includes optional Alternate Reality Game elements that enhance the immersion of the universe.","imageUrl":"https://media.rawg.io/media/screenshots/32d/32d08cd6b0451909c499605c8a4ad92a.jpg","releaseYear":2018,"developer":"Alice & Smith","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15000,"name":"Impossible Quest","genre":"Adventure","price":0.0,"description":"Do you like mediocre jokes and reading? Then this text adventure is for you! Impossible Quest is a story of a very troubled man. He can't live a day without getting into some trouble. Your job is to help him and keep him alive.Quests\nThere are 4 quests with different settings:\nDeadly Danger Dungeon\nGlobal Adventure\nImpossible Quest... in space!\nSpooky Scary House\nMuch more coming soon!Features\n2 languages: Russian and English!\nMore than 100 endings! Not even kidding.\nMore than a million bits of text!\nAwesome* humor!\n*In developer's opinion.","imageUrl":"https://media.rawg.io/media/screenshots/0ed/0edfa673e9221eaba14e1e8025a95642.jpg","releaseYear":2016,"developer":"Axel Sonic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14360,"name":"Heroes Evolved","genre":"Action","price":0.0,"description":"Featured Update\nAbout the GameWHAT'S HEROES EVOLVEDHeroes Evolved is a lightweight client based game with a heavy focus on real-time strategy and online multiplayer arena combat. Two teams face off in epic battles for supremacy. The team that can destroy the opposing base first wins!\nPlayers select from a huge roster of playable characters, each with their own unique skills and attributes. Earn gold, level up, and acquire powerful artifact gear as you co-ordinate with your team, balancing defense and offense on the road to victory!\n75+ UNIQUE CHARACTERSHeroes Evolved features an expansive roster of unique playable characters waiting for your call, each with their own distinct combat style. Get to know their attributes and abilities and lead them to victory in battle!\nGAME MODES AND RANKIn Heroes Evolved, there are 3 main game modes for players to choose, and more will be available in future updates:\nMatchmaking Games: Players can experience Heroes Evolved as a solo player or with their friends to battle against opponents of similar skill.Custom Games: Players can also create game lobbies to freely invite teammates and opponents. Co-op: This Mode is more suitable for beginners to experience. Players can practice with Bots to improve their skills.Moreover, by playing matchmaking games players will earn a game Rank which represents their skill. Gather your teammates to level up together!\nGLOBAL E-SPORTS TOURNAMENTHeroes Evolved has been launched successfully in South America, Malaysia, China and Vietnam. Now, it finally comes to Steam. In November 2016, R2 Games hosted the first online Heroes Evolved Championship tournament with $60,000 USD prize pool. Team Synergy from the Americas region won the Grand Final.\nIn 2017, R2 Games will bring more online and offline tournaments covering both professional eSports players and casual gamers, with a total prize pool of more than $600,000 USD cash. We hope to see you at the Grand Final!\nABOUT R2GAMESR2Games is an international distributor of online games and mobile games. Since its establishment, R2Games' strength has been its international background, cultural adaptability and mission statement of spreading happiness, determined to make its mark as a global leader in video games.\nAs an overseas company specializing in video games, R2Games publishes in 20 countries and regions, including the United States, Australia, France, Germany, Spain, Turkey, UK, Thailand, Malaysia, and Singapore. R2 has grown from a small team of ten to a company of nearly three hundred employees. With a wealth of marketing resources, a first class operations team and a strong overseas brand R2Games is set to continue innovating into creating one of the world's greatest gaming platforms.","imageUrl":"https://media.rawg.io/media/screenshots/713/713ff11271cc1aca7536a057ae415506.jpg","releaseYear":2017,"developer":"REALITY SQUARED GAME CO","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":13167,"name":"Potato Thriller","genre":"Action","price":0.0,"description":"After receiving an anonymous tip about the whereabouts of the Potato Man, bounty hunting team Quindalin and Dexter depart on a mission to put an end to the Potato Man once and for all. However, trying to capture this sinister spud might be the last decision our heroes ever make.\nYou'll get to...\nDive head-first into the lair of the deep fryer\nFind hidden secrets that'll scare the sh*t out of you\nScratch your head at fourth-wall shattering puzzles\nCollect specimens, and wield powerful plungers\nPut an end to the Potato Man's reign of terror","imageUrl":"https://media.rawg.io/media/screenshots/cd1/cd192058436562baa62b76c7dcdefaf1.jpg","releaseYear":2016,"developer":"Samer Khatib","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12307,"name":"Numberline","genre":"Casual","price":0.0,"description":"NumberLine - addictive puzzle game in which you have to repeat the image of the figures. But this is not so easy - in fact you can only create units with number \"One\". Fortunately, figures interact with each other.\nYou can create only a block with \"1\", but it also increase nearest numbers by one.\nPleasant soundtrack, beautiful design and a low level of difficulty will help you to relax, and the high level will strain gyrus.\nFeatures:\nPleasant soundtrack\nMinimalistic design\nSimple but addictive gameplay\nComing soon:Different modes\nLevel editor","imageUrl":"https://media.rawg.io/media/screenshots/fce/fce326800c7e0037b985ccab7ae4c081.jpg","releaseYear":2017,"developer":"Egor Magurin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11205,"name":"aMAZE","genre":"Casual","price":0.0,"description":"How long have you developed your thinking and attentiveness? Today we will give you such an opportunity, as an interesting and attractive game appeared on our vast spaces, which allows us to poke our brains. Game aMAZE perfectly suitable not only for your children, but also the whole family.\nTry to get through the tangled labyrinth. After exiting the labyrinth, you will move to a larger labyrinth, and this will continue until you can not get out of all the labyrinths.\nIn this game you need to pass a small ball through the maze. It should be brought to the finish line, which is usually located at the other end of the labyrinth. The game has three levels of difficulty, choose based on your preferences. If you want to go through the game without problems, you can choose an easy level of difficulty. If you want a test for yourself, then safely choose a complex level of complexity.\nEvery time you play this maze game the maze itself is different, we through that was a really cool aspect. Not many maze games will create a whole new maze for you every time you start playing.\nUse the keyboard arrow keys to navigate the different mazes\nIn aMAZE:\n- 50 levels\n- 3 difficulties\n- Achievements\n- Trading Cards","imageUrl":"https://media.rawg.io/media/screenshots/3ca/3ca76b19b75899d3955c92b13e2f0555.jpg","releaseYear":2017,"developer":"Blender Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5202,"name":".detuned","genre":"Arcade","price":0.0,"description":"Developed by .theprodukkt, .detuned™ is a personalized, interactive music experience which gives you the opportunity to create dynamic artwork in real-time to accompany your XMB™ music collection. Manipulate the given scene by interacting with and modifying its unique graphics using the DUALSHOCK®3 Wireless Controller.  Plus you can change and tweak your own music to accompany the scene.  .detuned™'s brilliant design and capabilities call for the state-of-the-art processing power that can only be done on the PS3™ system.\nDownload .detuned™ today for an artistic music experience!\nFeatures:\n-Artistic Experiences:  An abstract and surreal interactive experience to players of all levels and interests\n-Personalized Music:  Manipulate and tweak music tracks on the XMB™ to accompany your artistic creations\n-Power of the PS3™ system:  Stunning and crisp HD environment that brings your artistic visions to life in real-time\nUse of this item is subject to the PlayStation®Network Terms of Service.  If you do not wish to accept all these terms, do not use this item. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n© 2009 Sony Computer Entertainment America Inc.  Developed by .theprodukkt.","imageUrl":"https://media.rawg.io/media/screenshots/845/8456bcdce2e594639c837b648d9f9b5f.jpg","releaseYear":2009,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3967,"name":"Coconut Dodge Revitalised","genre":"Desconocido","price":0.0,"description":"Why is it that real people like us never find treasure on treasure islands? It's because the pirates stash all their treasure in the trees!\nFew people know this, but one crab does, named Clawrence. He's greedy for Gold, Diamonds and Rubies, and he's found a great spot to catch them as they fall - if it weren't for all the pesky coconuts that fall at the same time!\nHelp Clawrence dodge falling coconuts, weave through airborne mazes and play beach ball keepy-uppy, and if you're really good, collect enough treasure to secure a place on the leaderboard!\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\nNetwork Features\n2048KB Minimum\nTouchscreen\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\nVelocity®Ultra © 2013 FuturLab™ Limited. 'Velocity' is a registered trademark of FuturLab™ Limited.\nVelocity®Ultra developed and published by FuturLab™ Limited.  All rights reserved.","imageUrl":"null","releaseYear":2013,"developer":"FuturLab","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":3835,"name":"Dynasty Warriors 6","genre":"Action","price":0.0,"description":"The Dynasty Warriors series is reborn. The power of the next gen consoles is used to create the look and feel of a modern kung fu action film. Battle against thousands of soldiers in more immersive environments where players can swim, climb and use the landscape to make a raid on the hordes of soldiers swarming the battlefield with innovative and unpredictable Tactical Action objectives blend seamlessly fast and intuitive melee combat to become history's greatest warrior.\n1-2 players\n360KB minimum save size\nHDTV screen resolution: 720p\nNetwork Features\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nDynasty Warriors and the KOEI logo are registered trademarks of TECMO KOEI GAMES CO., LTD. ©2007-2008 TECMO KOEI GAMES CO., LTD. All rights reserved.","imageUrl":"https://media.rawg.io/media/games/29e/29edfdb12a254869f3e5f75d8fc9d22f.jpg","releaseYear":2008,"developer":"KOEI TECMO America","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":3066,"name":"Spelunker World","genre":"Desconocido","price":0.0,"description":"Embark on an underground adventure!\nSpelunker World is a free-to-play side-scrolling action game.\nPlay as underground explorer 'Spelunker' and venture into the mysterious dungeons!\nBut, the caves are filled with danger, and letting your guard down for just a bit can cost you your life.\nOnline multiplayer mode allows for up to 6 people to work together to clear the dungeon. Even if you mess us, your friends can help you! More points are rewarded when there are more people in your group! The new pet that will be added will give your explorer the advantage with its special abilities! Customize your characters with gear that can only be obtained in certain dungeons! Plus new characters may join!? What awaits at the deepest parts of the caves?\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1 player\nNetwork Players 2-6\nDUALSHOCK®4\nOnline Play (Required)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2015 SQUARE ENIX CO., LTD. All Rights Reserved. © 1983-2015 Timothy G. Martin / Tozai, Inc. All Rights Reserved. Spelunker is a trademark of Timothy G. Martin and Tozai Games is a trademark of Tozai, Inc. registered or protected in the US and other countries. SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd.  The ESRB rating icon is a registered trademark of the Entertainment Software Association. All other trademarks are the properties of their respective owners.","imageUrl":"https://media.rawg.io/media/screenshots/08a/08a07ef46f8c34afc9bfee5622350508.jpg","releaseYear":2015,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":1542,"name":"Adventures of Pip","genre":"Action","price":0.0,"description":"Adventures of Pip revitalizes the classic side-scrolling action platform genre. Pip -- the ultimate digital underdog – is a lowly single pixel in a 32-bit world who proves that you can’t judge a hero by the fidelity of his shaders. During the game, Pip gains the ability to evolve and grow by absorbing pixels from his fallen foes. Those same pixels can then be used to blast through environment puzzles and enemies, devolving Pip back to a single pixel. Players will explore five stylized worlds and experience up to 10 hours of epic adventure saving Pip’s village from the evil Queen DeRezzia.\n\nInspired by classic platformers, Adventures of Pip basks in a world where players can defeat a huge 32-bit boss as a single pixel or even as an 8-bit character.\n\nWith three different forms, evolve and devolve Pip to solve puzzles and defeat enemies; each with their own weakness and strength that must be unraveled throughout the campaign.\nSTORY\nThe Bit Stream is the life force that fuels Pixel Kingdom. The One who taps its power can forge the Kingdom's destiny.\nPip is only one pixel in a world full of 32-bit characters, yet he is the only one brave enough to face the Queen DeRezzia and rescue the kidnapped princess.\nMoved by his plight, the ghost knight, Sir Elwyn, bestowed upon Pip the power to harness the Bit Stream. With the ability to absorb his enemy’s pixels, Pip can transform into a hi-fidelity hero! But be aware! With each evolution not only will you gain skills but some will be lost.","imageUrl":"https://media.rawg.io/media/screenshots/c4c/c4cb11166943a33f5173fbbaef0d253e.jpg","releaseYear":2015,"developer":"Tic Toc Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":1029,"name":"Cobalt","genre":"Action","price":0.0,"description":"Forget everything you’ve learned about combat. Cobalt’s slo-mo mechanic lets you perform moves that other games can’t comprehend. Play through the story and discover answers to mysterious questions including: What happened to the humans? Why am I riding a space hamster? How is my cyborg head so good at deflecting bullets? Multiplayer is a less cryptic, though equally enjoyable affair: face off against friends and enemies in local or online multiplayer, learn the intricacies of over 80 maps and 67 weapons, and dominate the leaderboards.\nEnjoy 6 multiplayer modes on over 80 maps. Play locally or online.\nWield over 37 ranged weapons, 33 melee weapons, 6 hand shields, and more...\nUse Cobalt's signature move - the combat roll - to deflect projectiles or line up sweet headshots.\nTake advantage of our automatic-extreme-slo-mo mechanic,  to pull off sick manoeuvres like rocket punches, bullet deflects, or last-second goals\nCustomise weapons and armour to your personal taste.\nPlay through the story alone or in co-op. Tame wasps! Take part in unnecessary dancing mini-games. Make friends with birds then get sad when they explode into puff of feathersSix game modesSurvival Mode: Face off against waves of enemies, upgrading equipment between rounds.\nCombat and Speed challenges: test speed, agility and combat skills in a wealth of challenges. Take your place on the global leaderboards.\nDeathmatch: Go head to head in free-for-all showdowns or team-based battles.\nTeam Strike:  No respawns.  Multiple rounds! Equipment upgrades! Cobalt’s most original mode.\nPlug Slam: The most popular sport in the Cobalt universe. Slam the plug into the goal to win. Don’t die!\nStory Mode: Discover the secrets of a remote colony alone or with a friend in local co-op. Includes puzzles, boss fights and tameable pets.\nCobalt is the brainchild of Oxeye Game Studio, which consists of Jens Bergensten, Daniel Brynolf, and Pontus Hammarberg. It’s published by Mojang.","imageUrl":"https://media.rawg.io/media/screenshots/424/4242e76b898c47219406b83b49e40287.jpg","releaseYear":2016,"developer":"Oxeye Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":972784,"name":"ThornSin","genre":"Action","price":0.0,"description":"ThornSin is an Adult Action Roguelike Game made by Unity.\n\nWe aim for the game to be both entertaining and erotic.\n\nSupports English, Japanese(日本語), Chinese(中文), Korean(한국어).\nReal-time combat with fully animated H scenes support.\nExplore completely random dungeons.\nConstantly updated artifacts and items.\nAchievements unlock new items or enemies.\nThe town of Magheim has been destroyed by an unknown force. Sister Inesa is searching for the cause of the disaster amongst the ruins.\n\nShe has a kind and strong heart, yet deep inside there seems to be an unknown aspect that no one knows about.\n\nNow, as she searches for herself and her faith, she sets foot in this land infested with demons and sins.","imageUrl":"https://media.rawg.io/media/games/7cb/7cb20c70a8c22cbcd1b9a64c9fb44bf8.jpg","releaseYear":2023,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":972449,"name":"Warhammer Age of Sigmar: Realms of Ruin","genre":"Action","price":0.0,"description":"Ultimate Edition\nPurchase the Ultimate Edition of Warhammer Age of Sigmar: Realms of Ruin now to receive:\n'Deluxe’ Profile Customisation Set, a selection of customisation options for your in-game profile, including a unique avatar, avatar frame, banner, and banner image.\n4 Alternate Hero Skins\nWarhammer Age of Sigmar: Realms of Ruin - The Celestial Spear and The Mouth of Mork Hero Pack\nJOIN OUR DISCORD SERVER\nAbout the GameA real-time strategy game from Frontier, set in the iconic Warhammer universe. Become a warlord and lead four unique factions to conquer the wild and savage Realm of Ghur in tense and tactical battles:\n•\tCinematic campaign – Enjoy a rich, character driven story of desperate conflict in a savage realm, co-written by acclaimed Black Library writer Gav Thorpe.\n•\tComprehensive multiplayer – Dive into 1v1 and 2v2 cross platform multiplayer matches with any mix of human and AI teammates/opponents, and climb a 1v1 competitive ladder.\n•\tEternal conquest – Battle across procedurally generated wildlands in a single player experience, as you fight towards the final enemy.\n•\tEndless creativity – Build, share and compete on your own maps or other people’s, paint your own armies, create beautiful dioramas to show them off.\nExplore the nature of war from the perspectives of righteous champions and villainous warlords. Battle for survival and dominance across a campaign featuring four major factions, including Stormcast Eternals, Orruk Kruleboyz, Nighthaunt and the Disciples of Tzeentch! Experience a cinematic plot, penned in conjunction with acclaimed Black Library author, Gavin Thorpe.\nChallenge warlords from around the world in online cross-platform multiplayer modes. Build your honour in casual play or put your strategy to the test and crown yourself as the one true ruler of Ghur in ranked, competitive play. Compete 1v1, or 2v2 with up to three AI – or play co-op with a friend.\nA single player challenge mode played over a procedurally generated campaign, that pits players against a series of unpredictable combat scenarios and maps. Featuring rule-breaking twists that transform the conditions of conflict. Strike forth directly to victory or take on more battles to craft a high score the choice is yours. No two Conquest campaigns will ever be the same.\nBecome one with the Realms and construct battle maps with a revolutionary Map Editor, which utilises the same tools used to create existing maps in the game.\nLeave a personal mark in your path of conquest with the Army Livery, a system that allows you to personalise your forces with paint from the Games Workshop's Citadel collection\nCreate spellbinding scenes to share with the community with the Scene Editor, an additional tool that allows you to place and pose characters and props in creatively curated and sharable scenes.","imageUrl":"https://media.rawg.io/media/screenshots/b3b/b3bb72a8481f52a54d74d71821ab46bc.jpg","releaseYear":2023,"developer":"Frontier Developments","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":881229,"name":"Bravery and Greed","genre":"Action","price":0.0,"description":"Join Our Discord!\nAbout the GameDeep Robust Combat SystemWhether you're playing as the mighty Amazon, the valiant Warrior, agile Rogue or spell-weaving Wizard, each class possesses a breadth of fantastic and powerful combo move sets. Parry, dodge, juggle, zone and unleash destructive special moves to take the upper hand against ever mightier foes, bosses and even your friends.\nPvE & PvP VarietyExplore a variety of thrilling environments in Adventure Mode as you tackle biomes and bosses in your search for runes to the Sky Fortress. Team up with friends and battle against wave after wave of enemies in the challenge Survival Mode or settle the grudge with arena-based team and solo PvP.\nCustomisable Character ChoicesAlong with class choice, you will have to make on-the-fly decisions that alter your character skillset. Skill trees focusing on the aspects of Chaos, Order, Darkness and Life will grant you skill augmentations and special abilities, whilst a myriad of equipment drops ensure that every run feels unique with plenty of options.\nGreed is EternalIn Bravery and Greed, you can permanently unlock awesome content and game-altering augmentations by levelling up with gold. Greedily grab coins and plunder chests, steal pockets of gold when reviving allies, or be the first to run and grab loot after an epic encounter, get rich or die trying!\nhttps://store.steampowered.com/app/943370/Bravery_and_Greed/","imageUrl":"https://media.rawg.io/media/screenshots/529/529d0535eafe7a55fc4d03b82367ce8a.jpg","releaseYear":2022,"developer":"Rekka Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":864926,"name":"Hell is Others","genre":"Action","price":0.0,"description":"Hell is Others is a survival horror PVPVE top-down shooter. Outside the safety of your apartment lies the noir hellscape that is Century City. A city of endless night that straddles the line between reality and insanity. Explore, hunt and loot in a place where blood is literally currency.","imageUrl":"https://media.rawg.io/media/games/4f8/4f8ea140398b7dc8c7fd26e0b326f192.jpg","releaseYear":2022,"developer":"Strelka Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":816467,"name":"Once Upon a Jester","genre":"Adventure","price":0.0,"description":"Join our Discord community!\nAbout the Game\nBest friends Sok & Jester devise a mischievous scheme to steal the Royal Diamond!\nTo complete their master plan, they must start an improv theatre show and outperform every other act - including their rivals, Hofnar & Bok. Only becoming the best show in the kingdom will get them invited to the Royal Theatrical Spectacle in the Royal Palace, where the king keeps his precious gem.\nThey embark on a grand adventure across a fantasy kingdom, meeting tons of wacky characters, performing improvised shows and singing their hearts out. Along the way, they unintentionally discover the freedom and joy of musical theatre. Will the pair change their wicked ways or do whatever it takes to get rich?\nEMBRACE YOUR CREATIVE FREEDOMNo two shows are alike! The choices are yours as you decide how to wow your audience!\nBEFRIEND WACKY CHARACTERSMeet and befriend tons of quirky characters - all fully voiced!\nA friendly Wendingo, a tree looking for its roots and a blob of pesto to name a few.\nDIVE INTO A VIBRANT FANTASY KINGDOMIt’s always adventure time in hand-crafted locations like the cosy Dorp Town, the dark mysterious Woudwoods, and the radio-obsessed Stad City.\nVIBE TO THE INDIE TUNESAn original soundtrack, written and performed by the developers is here to burrow in your ear and never leave!","imageUrl":"https://media.rawg.io/media/screenshots/615/6156d22a8f699b3c980ebccd5d6a1072.jpg","releaseYear":2022,"developer":"Bonte Avond","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":700690,"name":"Touhou Hero of Ice Fairy: Prologue","genre":"Action","price":0.0,"description":"《东方冰之勇者记：序章》是一款将 [横轴动作] + [弹幕射击] 元素相结合的东方Project同人游戏。本作采用了 BOSS RUSH 的关卡模式，玩家需要操控东方人气角色 琪露诺 化身为冰之勇者，踏上对抗邪恶力量、解放幻想乡，并最终拯救珍重之人的旅途。★很久很久以前★有一位居住在雾之湖湖畔的「冰之勇者」，她勇敢且“聪慧”，时刻履行守护「雾之湖公主」的誓言。\n雾之湖公主美丽动人、内心纯真善良，传说蝴蝶会为她舞蹈，鸟雀会为她歌唱。\n勇者一直仰慕着公主，而公主同样对守护自己的勇者萌生了好感。\n然而，突然出现的一道「绯红魔影」将公主从勇者的身边强行掳走，打破了二人平静的生活。\n悲愤交加的勇者将公主遗留的信物系在护腕上，义无反顾地踏上了寻回珍重之人的旅途.....\n★你将体验到★■  相较于传统弹幕游戏更为流畅爽快的「高机动弹幕对战」。\n■  专门为横轴玩法所设计的精美弹幕。\n■  可爱灵动的角色动画与立绘。\n■  诙谐生趣的剧情对白。★需要注意★本作是尚在开发中的正篇游戏《东方冰之勇者记 ~ Touhou Hero of Ice Fairy》的独立序章游戏；\n本作中出现的关卡流程将不会重复出现在正篇游戏当中；\n正篇游戏将采用买断制的收费模式发布。\n★同好交流★对本作感兴趣，以及对东方Project题材感兴趣的小伙伴欢迎加入游戏交流群一起讨论~\n玩家QQ群：849555325","imageUrl":"https://media.rawg.io/media/screenshots/3ce/3ceaf697cccfcd975eaacb66982ca7af.jpg","releaseYear":-1,"developer":"GAMEPULSE 游戏脉冲","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":695840,"name":"Car Detailing Simulator: Prologue","genre":"Simulation","price":0.0,"description":"CHECK OUT MORE GREAT GAMEShttps://store.steampowered.com/app/1286880/Ship_Graveyard_Simulator/\nhttps://store.steampowered.com/app/1811350/Zombie_Hell_Infected_City/\nhttps://store.steampowered.com/app/1764270/Garage_Flipper/\nAbout the Game\nhttps://store.steampowered.com/app/1433570/Car_Detailing_Simulator/\nhttps://store.steampowered.com/app/1798110/Drug_Lord_Simulator/\nDo you love watching full car restorations come to life with Larry Kosilla from AMMO NYC? Now, you can experience it for yourself. Car Detailing Simulator lets you uncover lost pieces of automotive history in an abandoned warehouse full of forgotten antique cars, then bring them back to your garage and restore them to their former glory! Polish the paint, shampoo the interior, find lost treasures and post the freshly restored car for sale online. With the profit, build out your own custom detailing shop, buy new tools, products and equipment to upgrade your detailing studio. Head back to the barn to uncover the next lost super car and continue honing your skills and building your detailing business.\nBuy and restore awesome cars\nChoose the car you want to renovate from a variety of types and models – muscle cars, European cars, as well as other, exotic machines to choose from. Buy one of them and then do your best to restore it, so that you sell it and buy an even more impressive piece to work on.\nFind valuables\nInside the cars you will find many old, interesting, precious items like vintage lighters, money, dated documents, or even keys to another car! In this game a keen eye always gets rewarded with a little something extra, one way or the other.\nA selection of tools\nCar Detailing Simulator features a broad, diverse set of specialized equipment that you’ll need to accomplish all the goals of your car’s renovation. In pursuit of realism the game challenges you to select proper tools and replace their parts accordingly in order to get everything done the way it should. Wrong choices can result in some serious setbacks…\nStart with the interior\nThe cars had stood in the shed for many years. There’s lots of rubbish and debris inside but be careful not to miss those valuables and not to destroy the interior. This is the part where you get your hands really dirty – don’t be surprised if there are even rat droppings in your way. Make sure to use the right equipment and complete your tasks with satisfactory results.\nLet’s get to detailing\nNext comes the exterior. Begin with washing and watch the water – you don’t want it getting inside and ruining all of your previous work. Mind the pressure too as paintwork’s a delicate thing. With everything done correctly, you’ll be rewarded with the car’s true colors – a glimpse into the days of its glory. Other tasks will for example involve tires that need to be either reinflated or replaced.\nThe fruits of your labours\nOnce everything’s to your liking in the car’s restoration process, you can marvel at your accomplishments – the vintage wonders of automotive engineering brought back into proper shape! Don’t take too much time gawking though. Yours is an expensive occupation, so it’s now time to sell your work and turn a profit in a good deal – the next challenge awaits!","imageUrl":"https://media.rawg.io/media/screenshots/8e2/8e2b37cbb8ae5e0dc3c6b9e4dd8c9cb6.jpg","releaseYear":2021,"developer":"Games Incubator","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":627635,"name":"Tandem: A Tale of Shadows","genre":"Action","price":0.0,"description":"ADD TANDEM TO YOUR WISHLIST!\nAbout the Game\nTandem : A Tale of Shadows redefines the puzzle platformer genre with a unique top down and side-scroller gameplay and exceptional aesthetics. Help Emma and the teddy bear Fenton solve the mystery of the disappearance of the famous magician Thomas Kane.\nAward-winning Tandem: A Tale of Shadows features five beautiful Victorian-inspired worlds inspired by Tim Burton, Jules Vernes, Conan Doyle. Players have to carefully alternate between Emma’s top-down view and Fenton’s horizontal side-scroller view if they hope to escape these chiaroscuro dimensions alive.\nAs the duo navigates past intelligent obstacles and menacing horrors, they uncover clues regarding Thomas’ disappearance, the strange Kane family, and their place in this universe. Will Emma and Fenton escape the murderous manor filled with twists and turns, or has their fate already been sealed?","imageUrl":"https://media.rawg.io/media/screenshots/d1f/d1fea205b6428d84a0d033633aa26f64.jpg","releaseYear":2021,"developer":"Monochrome Paris","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":593230,"name":"Portal Reloaded","genre":"Action","price":0.0,"description":"Portal Reloaded is a free, community made modification for Portal 2. The mod builds on the concepts of the main game by allowing you to place a third portal, which enables traveling between two different timelines. Thinking in four dimensions is vital to solving 25 brand new mind-bending puzzles.","imageUrl":"https://media.rawg.io/media/games/791/7917bfd83a9de944efe2fc6d28402bf1.jpg","releaseYear":2021,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":557754,"name":"Clip maker","genre":"Simulation","price":0.0,"description":"During the last year we understood that, because of the COVID-19, the best way to protect yourself is to stay at home and work from home. And in this volatile time, you need a stable source of income. Covid-19 has changed our lives. Many people lost their jobs and lost their livelihoods. This game was created not only to support such people morally, but also financially. You can become screenwriter and producer rolled into one.\nAn artist, when painting his picture, does not think about how he sells it, he just enjoys it. With making a movie, something is very similar, with only one difference, you can post it on thousands of web sites like YouTube or TikTok and start making money.\nIf you are lucky and the pandemic did not affect you, then by purchasing this game you can support those who are not as lucky as you. Your money will be used to purchase additional content, which will enable victims to create more of their content and earn money that will allow them to survive in such a difficult period. Let's rally and help the victims.\nFor my part, I will provide any DLC of your choice for all the victims for free.\nDo you want to make money on video content, but do not know where to start? It's hard to find anything more fun than creating great video content, masterpieces that generate incredible profits.\nWorking on a film, video clip or any other video content is the dream of many. It is very important that a person devote himself to his work with his head, the one who works with art does it like no other.\nTo start a famous blog or film maker you need a few very important things:\n1. Decide on your niche\n2. Outline your channel goal\n3. Brainstorm content ideas\n4. Develop a content schedule\n5. High quality tools and equipment\nThe first 4 points depends just on you. You are the boss and you decide! The Clip maker will help you with the 5th point.\nThe Clip maker is a very cool game which will turn you blogger, vlogger, screenwriter and producer and will help you to make money! It offers you scene, characters and animations, and excellent tools for making your own films, clips and videos. You can add your own images, videos for billboards and voices for characters.\nFirst of all you will need to make your clip time line:\n- select the scene\n- set up positions for automatic camera movement\n- set up a pause for the camera, a time frame how long camera should stay on the same place\n- set up a character for your video clip\n- change character make-up\n- change character wardrobe\n- set up character accessories\n- change character eye color\n- choose the animation for your character\n- insert video from YouTube and 1000 of other sites\nWhen everything will be ready your can press play to see how it will look like or immediately record your video clip in one click.\nThe Clip maker offers you save and load system of timeline, so you can prepare your clip and record it later or can easily edit the timeline you have made earlier. As you can see the Clip maker is very easy to use, so don't wait anymore and start making your own videos clips right now!\nWith the Clip maker you will get:\nAnimations:\nAnger emotional expressions 10\nAnime girl 55\nArms crossed female 9\nArms crossed male 9\nCasual motions male 5\nCasual moves female 7\nCity life chat female 5\nCity life chat male 5\nCity life interaction female 5\nCity life interaction male 5\nCity life phone female 4\nCity life phone male 4\nCity life travel female 3\nCity life travel male 3\nCity life walk female 9\nCity life walk male 9\nConversation 15\nDance club 14\nDance collection 60\nDance 18\nEveryday motion pack 150\nFemale movement 175\nGirl dance 20\nGlamorous moves female 55\nGlamorous moves male 18\nGraceful and arms crossed female 9\nGraceful talk female 8\nHand on hips female 9\nHand on hips male 9\nIdle female 3\nIdle male 3\nIdle talk female 9\nIdle talk male 9\nIn love emotional expressions 11\nInteractive motions 01 54\nJoy emotional expressions 11\nK-POP dance 3\nLeaning forward female 9\nLegs and arms crossed female 9\nLegs and arms crossed male 9\nLegs crossed female 9\nLegs crossed male 9\nLegs crossed talk female 7\nLegs crossed talk male 7\nMixed move female 91\nMixed move male 100\nModel posing 14\nMusic video dance 4\nRelaxed female casual moves 8\nRock band 15\nSadness emotional expressions 10\nSensuous female casual moves 5\nSit arms crossed male 9\nSit chair male 3\nSit female 5\nSit male 9\nSit talk male 8\nSit transitions female 16\nSit transitions male 8\nSports female casual moves 24\nStand transitions female 7\nStand transitions male 7\nStreet dance girl style 19\nStreet dance hip hop 22\nStreet dance locking 21\nStreet dance popping 21\nStreet dance vol 01 4\nSuave and charming 6\nWalk female casual moves 15\nScenes:\nStudio news 5\nAlien fantasy forest\nArchViz Interior 3\nCyber city\nFantasy\nMilitary pack 1\nModular medieval village\nPolygon - City pack\nSci fi facility\nWinter environment 01","imageUrl":"https://media.rawg.io/media/screenshots/0d9/0d99e61f7357f761048d34891e963e21.jpg","releaseYear":2021,"developer":"Games For Pleasure","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":536709,"name":"Labyrinth City: Pierre the Maze Detective","genre":"Adventure","price":0.0,"description":"Come say hi in our Discord and get an exclusive role!\nFrom the award-winning designers that brought you Homo Machina (2018) and Californium (2015), Darjeeling brings you another revolutionary puzzle game that is one of its kind.\nFun, engaging, and beautiful, Labyrinth City creates 10 new visually-stunning universes for you to explore.Play as detective Pierre, you must solve all puzzles to retrieve the lost stone from the notorious thief, Mr. X.Crossing varied locations, you will encounter cute NPCs, and learn more about Opéra City, its surroundings and its citizens.\nStoryline\nA terrible crime has happened at the Opera City Museum! Mr. X, Pierre's sworn enemy, has stolen and fled with a magic stone that can turn everything around it into a labyrinth. Under the call of the Opera City Museum, Pierre, the detective, must undertake a new set of adventure, across 10 different places, to retrieve the lost stone. The issue is urgent, and he must act now!\nGame Features\nMany giant levels for you to exploreMore than 100 hidden objects to find and some surprising mini puzzle gamesAvailable in English, French, German, Chinese, Italian and JapaneseOriginal soundtrack\nGame Highlight\nStellar graphics based on the international bestselling children's book Pierre The Maze DetectiveVisiting beautiful places and interacting with the NPCs to build your own storySearching through the colorful world and exploring the numerous hidden subplot and modesIntriguing puzzles and many hidden objects awaitCollecting extra stars and treasure chests on your way to the finish line","imageUrl":"https://media.rawg.io/media/screenshots/6d8/6d82db0687a8fbe096f51a6248639785.jpg","releaseYear":2021,"developer":"Darjeeling","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":392226,"name":"Taimanin Asagi 1: Trial","genre":"Adventure","price":0.0,"description":"This game is a trial version; it covers the prologue of the Taimanin Asagi.\nThe language of this game is set to English by default.\nFor other languages, please change the language setting from the in-game option.\nTokyo. The demonic city, plagued with the demons from the dark realms.\nThe ancient rule has prohibited the demons from interfering with humans,\nbut with the humanity's dark descent, the pact is now history,\nand the treacherous syndicates weave crime and chaos throughout the world.\nIn order to protect the nation, the Japanese government has established a special force,\nconsisted of ninjas who, with their might and skills, can fight against the demonic invasion.the World Will Know them...as the taimanins.\nIgawa Asagi is the strongest among all taimanins, the ninja vigilantes that protect Tokyo from the invasive forces of demons and corrupted humans.\nAfter her last mission against Oboro, the defected ninja and the head of Oboro Ninja Troops, Asagi retires from her former glory to marry her lover, Sawaki Kyousuke, for a want of the mundane life as an ordinary woman.\nThings take an unexpected turn, however, as her past nemesis creeps back from the dead, and the unfortunate heroine must find her way out from the vengeful debauchery and suffering that awaits her...\nWould Asagi escape from the grasp of the evil that lurks in the darkest depth of Tokyo?\nOr would she fall from grace, as she is exposed to the sensations worse than death?\nTaimanin Asagi is a visual novel that illustrates the first episode of the Taimanin saga, the long-running series of dark, devious, and dramatic chronicles that takes place in the near-future, fiendishly corrupted city of Tokyo.\nDisclaimer: This game may contain contents not appropriate for all ages, or may not be appropriate for viewing at work: Fantasy violence, nudity, strong language, sexual content, violence. All characters in the game are at least 18 years old.","imageUrl":"https://media.rawg.io/media/screenshots/e14/e14435ba87a1502f64f0618de88ea531.jpg","releaseYear":-1,"developer":"Lilith","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]