[{"id":13291,"name":"A Trip to Yugoslavia: Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/00e/00e268c2b9403bef35513467d8f17399.jpg","description":"A TRIP TO YUGOSLAVIA is an experimental interactive game with a theme of the old VCR player (with the ability to REWIND, PAUSE and FASTFORWARD).\nYugoslavia has fallen apart. No one knows what caused it. Some people ran away instantly and some of them still don't know that the war has just begun\nIncluding you. You're taking a role of Dimitri, an amateur photographer, who has been caught in the nearby Yugoslavian forest on the outskirts of town. Now, without any combat knowledge, you have to survive a few months of war in a desolated country.\nWelcome on a one way trip...Game features:Full Motion Video\nThanks to FMV you can get immersed even more into your one way trip.\nPoint & Click sections\nExplore the environment, collect items, hide the bodies…\nQuickTime events\nPress the arrow in the right direction to get out in one piece. Otherwise, you might die or change the outcome of the entire story.\nChoose your own path\nYour decisions throughout the whole game can lead you to one of the ten available endings.\nVCR system\nRewind, Pause and FASTFORWARD the tape you’re watching.STEAM version exclusive content:12 minutes of additional gameplay\nThree new endings\nFour new achievements\nMac & Linux ports\nSteam achievements and trading cards\nThis game isn't based on any real Yugoslavian conflict","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Piotr Bunkowski","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12913,"name":"rooMaze","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/851/8518264def67d6295a78d2d308116c81.jpg","description":"rooMaze is a first person hardcore roguelike with voxel graphics and procedurally generated levels! All of this is powered by Unreal Engine 4.\nDon't let acute-angled cubes deceive you as behind a simple visual style lies the all-consuming hardcore.\nFeatures:Random generation of levels, rooms, objects and everything else.\nVoxel graphics and the dark dungeon atmosphere.\nSeveral branches of character «leveling up».\nUnusual combat system.\nCrossbows in each hand – cool!\nA lot of enemies and items.\nDeadly traps - watch your steps!\nCharacter damage systems: burns, bleedings, fractures – you're in trouble!\nMany hidden secrets.\nBarter system - in a dark damp dungeon nobody needs your shiny coins.\nHardCore.\nMushrooms!\nThough this is our first project and there were only two developers on a team, we did our best to create something special by mixing a good old blend of RPG and Action and adding up some peculiarities:\nAn unexpectedly dark and oppressive atmosphere, where light becomes a useful resource just like mana and health.\nA randomly generated dungeon, where rooms are not just cells full of enemies - we tried to make all of them meaningful. We managed to get around our least favorite senseless narrow halls which are quite frequent in other video games with randomly generated levels. And we worked hard so the layout of caves doesn't look like a playing field for noughts and crosses. It also goes without saying that caves contain randomly generated visual and practical content like enemies, traps etc.\nTraps: lots of \"pleasant\" surprises are waiting for you in the dark ready to be activated by trip wires or floor press plates. Classical flying darts, whirling axes and maces, rooms rapidly filled with gas. A trap may cause painful holes in your body and there's almost no chance your bones remain safe and sound.\nModule damage of the main character: a burn on his arm means using it causes pain and a cracked leg will slow him down.\nA similar system is applied to enemies: while fighting with dungeon inhabitants you have to look for weak spots in their defense.\nAn unusual combat system: you need to charge almost every strike as well as most skills need to be used with a specific type of weapon after its full charge. This system requires a player to get used to it. Though it may look not very dynamic, it allows to carefully adjust every strike.\nBarter trade: that's because nobody needs your shiny coins in a wet and spooky dungeon! The list of items includes wands, sticks, one-handed and two-handed crossbows, bows, swords, maces, shields and even some fire weapon. Keep in mind that you have to work hard to find all these items as just few things have remained undamaged ever since this place had been inhabited.\nrooMaze is an indie game; over a period of two years of its development we have only had teabags in our budget. Our experience was insufficient so at some moments we tried too hard in vain or we had to painfully give it up. However, we created that very game we ourselves can play with pleasure.\nIf you're fond of exploring mysterious dark and full of secrets locations, adapting to unfriendly environment and overcoming any kind of difficulties then you may like this game!\nAnd remember: \"Mushrooms are close!\"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ChairKilling","platforms":[{"id":0,"name":"PC"}]},{"id":12006,"name":"Judgment: Apocalypse Survival Simulation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f59/f5909e6fbc718b7e45e5e23ef532ba57.jpg","description":"Rebuild society. Survive the Apocalypse.\nJudgment: Apocalypse Survival Simulation is a colony simulation game with tactical combat that takes place in the midst of a demon apocalypse. The gates of hell have opened and unleashed relentless demons into the world -- but you can fight back! Guide a group of survivors through the mayhem -- hiding from hellspawn and building a sanctuary. Survive by gathering resources, crafting equipment, defending your base and sending teams to scavenge for supplies. Research human technologies and practice the dark arts to find a way and send the demons back to hell.\nTo survive is to prevail. Will you survive Judgment day?FeaturesBuild your base in the midst of a demon apocalypse\nExplore a randomly generated world overrun with hellspawn and scavenge essential resources\nFight creatures of the abyss in real-time tactical combat with pause\nLevel up and customize your survivors\nCraft your own equipment, tools and weapons\nResearch lost technologies to unlock new structures and equipment\nPractice the occult and use the demons own dark magic against themEarly AccessJudgment is in early access because we believe that great games are made through cooperation between fans and developers. The game is fully funded and we are not counting on Early Access sales to fund the development.StoryIt's the Apocalypse, the end of the world. You were camping with some friends when an evil shadow, a huge demon, appeared out of nowhere and viciously ripped one of them apart. Somehow as your survival instincts took hold, you managed to kill the creature and flee. Soon, however, you found that you were a few of the lucky ones. Your demon encounter was not an isolated incident. The town was aflame, it was Judgment day.\nBut you and your friends vow to fight back. You find an isolated valley and build a base, a shelter for yourselves and other survivors you may find. The Apocalypse may be here, but your hope is still strong. As long as you're alive, mankind has yet to be judged. You will find a way to save the world, send the demons back.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":7290,"name":"Braveland Pirate","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/900/9005f92e06d09d723cf0262594b22ed4.jpeg","description":"The Braveland trilogy concludes with the most exciting book of all, number three – welcome to Braveland Pirate strategy game! A crew of pirates led by Captain Jim embarks on a search for the Eternal Treasure. Hordes of undead, chests full of gold, devious pirate captains, and breathtaking adventures await you in the Free Islands.\n- Your Hero steps on the battlefield for the first time in the series\n- Travel freely between the islands on your own ship\n- Random encounters with enemies in the open sea\n- Heaps of rare artifacts stashed away in treasure chests\n- Pirate tricks that change the course of a battle\n- Three talent trees to enhance your captain\n- A real pirate crew: cabin boy, daredevil, cannoneer, possessed, and many more\n- Hand drawn tropical islands surrounded by a vast ocean\n- Hunt for the heads of the most notorious criminals\n- More than seven hours of real adventures\nBraveland Trilogy:\n- Braveland\n- Braveland Wizard\n- Braveland Pirate","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tortuga Team","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":1411,"name":"Hatsune Miku: Project DIVA X","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c9/3c98d0f3ab6c5777e6d14883d8d5da4f.jpg","description":"In Project DIVA X, players help Miku and her friends sing and dance their way through five Clouds that comprise their world! Each Cloud has its own unique aura -- Classic, Cool, Cute, Elegant, and Quirky -- that will offer different challenges for players to fulfill. Moreover, the auras of the 30 new and classic songs they perform, and the nearly 300 modules (costumes) they'll wear, will have an important impact on the many different challenges.\nPlayStation®Camera Compatible\nEnhanced play with 1 PS®Move controller\nVR games may cause some players to experience motion sickness.\nAdditional hardware required for Remote Play.\nAdditional hardware required for Interconnectivity.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1 player\nDUALSHOCK®4\nRemote Play\nInterconnectivity PS4™ • PS Vita\nOnline Play (Optional)\nPlayStation®VR Compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SEGA. SEGA, the SEGA logo, and Project DIVA are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates.\n© Crypton Future Media, INC. www.piapro.net","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":989947,"name":"THRONE AND LIBERTY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5a/f5a47c651a93a57b6b0341b2af53e966.jpg","description":"Welcome to THRONE AND LIBERTY, a free-to-play MMORPG that takes place in the vast open world of Solisium. You can scale expansive mountain ranges for new vantage points, scan open skies, traverse sprawling plains, explore a land full of depth and opportunity. Adapt your fight to survive and thrive through strategic decisions in PvP, PvE or both as you encounter evolving battlefields impacted by weather, time of day, and other players. There is no single path to victory as you seek to defeat Kazar and claim the throne while keeping rival guilds at bay.\nFor more information about Early Access Packs, please visit: https://www.playthroneandliberty.com/forward-link?id=shop-faq","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"NCSOFT","platforms":[{"id":0,"name":"PC"}]},{"id":981791,"name":"Assassin's Creed Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/526/526881e0f5f8c1550e51df3801f96ea3.jpg","description":"A new Creed rises over Japan. \n\nLive the intertwined stories of Naoe, an adept shinobi Assassin from Iga Province, and Yasuke, the powerful African samurai of historical legend. Against the backdrop of the turbulent late Sengoku period, this remarkable duo will discover their common destiny as they usher in a new era for Japan.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":830059,"name":"Coral Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/196/196381a3afc69bd73d4374fdbf5ef774.jpg","description":"Coral Island is a vibrant and laid-back reimagining of farm sim games. Be who you want and experience enchanting island living at your own pace—live off the land, nurture animals, build relationships with a diverse cast of townsfolk, and make the world around you a more vital and harmonious place.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Stairway Games","platforms":[{"id":0,"name":"PC"}]},{"id":427445,"name":"Drug Dealer Simulator: Free Sample","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/7133a95fa0c597bf941e5dcd89a2a2b1.jpg","description":"IF YOU ENJOYED FREE SAMPLE - HERE IS FULL GAME!https://store.steampowered.com/app/682990/Drug_Dealer_Simulator/\nAbout the GameNot convinced to get into this business?Drug Dealer Simulator: Free Sample is an introduction to the dark alleys of the ghetto, where you can start to expand your own crime empire!\nGet in touch with your contact and take your first steps in drug dealing business!\nGain and prepare your merchandise\nUse an innovative platform ShadyComm, gain clients and order more product.\nPrepare the merch on your workstation. Set the amounts, mix the product. Decide if you want to sell a stronger hybrid, or save the money by adding the visual substitutes.\nBecome a drug dealing ninja!\nNot everyone will applaud your profession, especially Police. Make your own strategic ways to your client without getting caught! Stay low by working through day, or take a risk and receive a more profitable orders by night!\nYou have to be smart, you have to be sneaky, or you’ll lost your source of income.\nShow who’s the boss\nWanna make more money? Expand your territory!\nUse a spray can to set your new bounds with the graffiti. Find new clients through free samples. Who knows, maybe someday they'll start to work for you?\nGame features:\n- Get through 8 levels of dope business transactions and constant adrenaline in your veins! But is it really adrenaline?\n- Receive the ordered product - Safely make your way to your hideout with the merchandise\n- Create your own recipies, divide portions to prepare dope for sale\n- Organise your distribution starting from singular junkie sales up to more profitable transactions.\n- Strategically avoid police patrols through your work hours.\n- Raise your influence and gain territory. Hire your own dealers.\n- Grow your business, invest your money and face new dangers and dilemmas as you climb the criminal ladder.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Byterunners Game Studio","platforms":[{"id":0,"name":"PC"}]},{"id":319153,"name":"Sex with Stalin","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d92/d92b8d2b43f93d49073fdc6a3ac9c6c6.jpg","description":"You, being the young time traveler, get the opportunity to meet the greatest dictator in history - Stalin.\nAnd what's next? It's up to you! Communicate with Stalin and reveal his most hidden secrets! Share advices and help the leader to reach worldwide supremacy! Or... show that mustache guy what's real love is!\nKey features:\n- Your choice is capable of changing the future! Several variants of endings!\n\n- Tired of enduring the dictator? Show him where the hell is! Hit him in the stomach, plug in the electricity to his nipples, jump on his back!\n- The possibility to seduce Stalin!\n\n- Several unique authentic locations: interrogation chamber, Stalin's  cabinet, bedroom and the secret \"Red\" room.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Boobs Dev","platforms":[{"id":0,"name":"PC"}]},{"id":48017,"name":"The Mammoth: A Cave Painting","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39d/39dd442a96c36bb93f5c17f90e573ff4.jpg","description":"The Mammoth: A Cave Painting tells the 5 million year story of the mammoth in 5 minutes. At its very core it is a story about the inescapability of loss.\nInspired by prehistoric cave-paintings, act out a story written on the wall of a cave.\nSearch for your lost herd on the wide plain.\nGather and protect your children.\nStruggle with human hunters.\nExperience the dynamic narration unfold as you tell your story.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"inbetweengames","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":32797,"name":"No One Lives Forever 2: A Spy in H.A.R.M.'s Way","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24a/24a7490f304e74d503bd461bc23b37a2.jpg","description":"Cate Archer, the fearless and fashionable secret agent, returns to save the world from H.A.R.M. Armed with an assortment of superspy weaponry and gadgets, Cate must explore exotic locales, avoid devious traps, and defeat deadly agents to foil a Soviet project. As Cate, it's up to you to avert a nuclear holocaust through 40 single-player missions. No One Lives Forever 2 also features a multiplayer mode that lets you play cooperatively with your friend over the Internet.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29112,"name":"LUMINES LIVE!","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3aa/3aa8d772dd6d0eb8a9ec3b56ad158c72.jpg","description":"Single Player, Xbox Live Multiplayer 1-2, Local Multiplayer, HD (High Definition). LUMINES LIVE! - a fresh installment to the blockbuster puzzle series has landed on Xbox Live® Arcade. Harnessing the power of the Xbox 360™, LUMINES LIVE! is a deeply rich and totally cool gaming experience. LUMINES™ LIVE! Standard Edition offers a stunning array of playable game modes including: 12 unlockable skins in Challenge Mode, Time Attack Mode, full multiplayer VS Mode on Xbox Live, 10 challenges each in Puzzle and Mission Modes, and 1 level of VS CPU Mode. All new Skin Edit Mode and plenty of downloadable content via Xbox Live Marketplace allows for customization of the LUMINES experience like never before. Don't miss out on the exciting world of LUMINES LIVE! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Q Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22820,"name":"Populous","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7f/a7f3cb62af2ee95d92065da88583338b.jpg","description":"Miracles are child's play. Earthquakes are serious fun. The all-powerful can perform miracles in their sleep. But omnipotence isn't what it used to be. These days, it takes awesome natural disasters to dominate a world. You give them good land. You tell them when to farm and when to fight. You make them content beyond their wildest dreams. But then they become raging arsonists. What's a deity to do? Disasters are your divine prerogative - volcanoes, quakes, swamps. For stubborn non-believers, nothing beats a flood for spring cleaning. Cruel ice, lush grassland, parched desert... With 500 worlds, a deity's work is never done.\nPopulous is the original god-game, a strategy title that lets you shape the isometric isometric world and the fates of its inhabitants. Be sure to check out one of Bullfrog's earliest classics, from the mind of Peter Molyneux!Includes Populous and the Promised Lands expansion.\nBecome a god, assume godly powers, shape civilizations, and make them all bow to your will\nThe power of light or the force of darkness? Holy wrath or divine miracles – you decide\nPunish the infidels with plagues, earthquakes, and tornadoes. A ”little” volcano here and there might also convince them as to which god they should pray to","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"SNES"},{"id":0,"name":"Genesis"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22700,"name":"Might and Magic 8: Day of the Destroyer","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8e/b8e3d7e58089bccf3723d4e300d0f632.jpg","description":"The destroyer is walking the land once again. The legendary Planeswalker Escaton has been seen in Jadame and the very elements themselves have felt his presence. In the four corners of the world, gates to the planes of Fire, Air, Earth and Water have opened and denizens of those realms are sweeping across the lands, devastating all in their path. Lead a band of rugged adventurers on a mission of utmost peril to save the kingdoms from ruin, or watch as the lands are devastated forever.Another great installment of the famous Might and Magic series\nA vast, magical world full of adventurers, mythical creatures and powerful artifacts\nAn epic soundtrack composed by the acclaimed artist Rob King","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":22455,"name":"Ironclads: Anglo Russian War 1866","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/547/5472572463c82f4f0a37ba855c2487a0.jpg","description":"Russia sought to seize control of Constantinople. The city controlled the Black Sea straits, an important economic and strategic point of the Black and Mediterranean Sea. This area was the cause of constant conflict with Britain, which was concerned about her Mediterranean interests. The Crimean War had weakened the position of Russia on the Black Sea, but, in the Baltic and North Sea, the Tsar built a new, modern fleet. In 1865, Poland rebelled against Russia. Britain supported the rebels and declared war on Russia. Two objectives of the Royal Navy were to destroy the Russian squadron in the North Sea and the establishment of a full blockade of the North.\nKey features:\nManage financial and strategic aspects while planning your squadron's structure\nSet up battle squadron groups\nRealistic ship models and characteristics\nAdvanced ballistic and weapon models","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Totem Games","platforms":[{"id":0,"name":"PC"}]},{"id":21541,"name":"Cosmic Osmo and the Worlds Beyond the Mackerel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b9/9b9ba7a37dfd1c99788400619a19ce5c.jpg","description":"You're an Osmo, a strange creature indeed. You explore the galaxy in your spaceship, and the planets you encounter are almost as bizarre as the Osmos themselves. There are seven worlds presented for your consideration, each more goofy and peculiar than the last. Cosmic Osmo is a game about exploration and discovery, not winning or challenges.\nChildren and adults will both find something to enjoy in this early gem from the creators of Myst.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":21516,"name":"Home is Where One Starts...","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/165/165cca86baf63de7a137031fdf72759a.jpg","description":"“I remember when I was a little girl, waiting at the end of my driveway. I had already missed the school bus, but I stood there anyway… envying the birds.”\nHome is Where One Starts... is a short, first-person exploration game in the same vein as Dear Esther or Gone Home. It’s an experience where every object has been carefully placed to tell a poignant story—a story about childhood, hope, and the miracle of memory. You play as a little girl from a broken home somewhere in the American South. Exploring the lonely countryside reveals clues and vignettes which help the player answer the question of where home is—and how one can get there.Key features:A quiet, non-linear story told by the future self of a reflective narrator\nInspired by the rural countryside and stories like John Steinbeck’s East of Eden and Terrence Malick’s The Tree of Life\nA 15-30 minute experience that can be completed in one sitting\nAn experience that focuses on atmosphere rather than action or puzzles\nA rich, detailed environment that rewards players who explore with story insights and secret endings\nOculus Rift DK2 support (currently in beta)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"David Wehle","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21465,"name":"Ironclads: American Civil War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/428/428c94756aff097c07d8a18bba6294de.jpg","description":"Battle of the civil war ironclads. Take part in battles from USS Monitor vs CSS Virginia before battles between armored squadrons of steamships and other vessels.\nThe flow of time is organized into rounds. Within the limits of each round, the player and the computer opponent take turns executing all actions possible within five minutes of real time combat for each of their ships. At the moment when the selected active ship is carrying out an action, all other game units are motionless. Time for decision-making is not limited.\nGame locations are presented in real 1:1 scale and are not divided into cells or hexagons. The trajectory of movement of the active ship is determined by laws of physics and calculated using realistic speed, size and shape of a unit.\nThe campaign based on alternate outcomes of events which assume a more favourable position for the Confederation in the first two years of the conflict, including diplomatic recognition and construction of a stronger, more balanced Southern fleet in European shipyards.\nUSA and CSA campaigns: 14 missions, 80 hours of game time, 54 unique ships. USS Monitor, CSS Virginia, USS New Ironsides and others Civil War ironclads 3d models.\nKey features:\nHistorical accuracy: the game's locations are created based on historical maps and other surviving documents and accounts of real battles\n3D models of the civil war ironclads and other warships are based on original drawings and designs from archives, or those restored by experts using photos, models and descriptions of the ships that participated in the Civil War\nRealness: use of real specifications of the civil war ironclads and other warships: the size, hull contours, displacement, construction materials and design, quality and arrangement the crew and armament, speed and acceleration\nCalculations of physical interactions such as collisions between ships, flooding and capsizing, shell modeling, ammunition fires and flooding\nUse of a special ballistic calculator on the basis of original artillery tables for definition of accuracy, penetration ability, explosion and shrapnel damage","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Totem Games","platforms":[{"id":0,"name":"PC"}]},{"id":20768,"name":"Gravi","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca3b39f42c8118639fec3371281e7e96.jpg","description":"Trading Cards\nPlatform SupportReleased: Windows\nComing Soon: OSX & Linux\nAbout the GameGravi is an intense puzzle-platformer that will test your tolerance for pain. Shoot and swing your way towards victory as Gravi, an adorable blue ball of energy. While you’re launching through terrorizing traps and bending gravity to your will, Anti-Gravi, an atomic ball of rage, is barreling down on your position.​\n​\nAfter losing yourself in the ridiculously trap-filled underbelly of an alien test facility, you must use your wits and perseverance to solve a series of perplexing puzzles. Along the way, your limits will be put to the test by all sorts of absurdly dangerous hazards.\nSnatch up collectibles and fight off Anti-Gravi on your path to freedom. If you can survive Gravi’s 40 unique levels and best Anti-Gravi at his own game, you just might make it out alive.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Hashbang Games","platforms":[{"id":0,"name":"PC"}]},{"id":20691,"name":"Blue Rose","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/186/186c0e8565445da5c86643a21ec4fd82.jpg","description":"“Deep in the mountains, away from prying eyes\nis a refuge unknown to anyone else.\nBorn of hope\ncradled in shadows\nthis place that only looks forward\nis where I found my heart.”﻿\nBlue Rose is an interactive ‘visual novel’, following the viewpoint of the female knight Lena as she enters an unknown world deep in the mountains. Lena is a Templar of the Blue Rose, living her life to fight and protect her home and country.\nBut what is truly important to her is only just about to reveal itself. Pulled away from the front lines of the war, Lena finds herself trapped in a secluded, unknown village in the mountains. For the first time she will make her own decisions – and face the consequences.\nFeatures:\n5 routes – 4 guys and 1 girl\n10 endings\nUnlockable mini stories\nCG and music gallery\nWhat is a Visual Novel?\nStep into the shoes of Lena as you go through an interactive novel-style story of text, illustrations, and music, making choices and influencing the plot as you go.\nWho will Lena choose as her companion? Will she and the others succeed in opposing the threat that they have uncovered? Make your choices and find out.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"White Cat","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20162,"name":"Golden Rush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e0/9e0483bf8b4a91142353e7a4e5e7e2d1.jpg","description":"Golden Rush is a rather unusual fantasy MOBA for four teams. Here you can become one of the legendary heroes fighting against monsters, dragons, and other adventurers for the treasures of the Golden Lands.\nThere are no lines or creeps and nexus here. Wealth is your only goal. You are to slay monsters and seize their chests with gold, become invisible, steal treasures from other teams, defend your own gold and triumph in the dynamic fantasy PvP. Four teams make the situation on the map unpredictable: victory, seemingly so close, may slip away in one second. Golden Rush is no place to relax – it's a treasure hunt you have to carry through!\nHere's what else you will experience in the game:\nLevel up your hero after choosing one of six basic classes, be it a seductive witch or a furious barbarian.\nLook for a unique tactics of victory in the new MOBA that is different from all the other ones.\nSlay hundreds of monsters, defeat bosses and turn into a Bone Dragon that tosses enemy heroes around as if they were puppets.\nCollect artifacts looted from monsters and assemble unique armour sets.\nTake part in rating battles and monthly tournaments.\nOrganize well-coordinated teams of friends and fight against experienced opponents.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Forbes Consult","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18861,"name":"Aircraft War X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95c/95cc348a07ac4f9bba26f70b1c4a5716.jpg","description":"The game is dedicated to the air battle.The game contains 10 levels long where you have to confront numerous enemies.\nIt will require you to focus and agility.The main change the position of the aircraft more often to keep healthy.\nThe game is simple and straightforward.It is a simple shooter on airplanes.Fun and addictive.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mystic Games","platforms":[{"id":0,"name":"PC"}]},{"id":18824,"name":"Goats On A Bridge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cf/0cf5226e99c4ab9134ba80ff9986439f.jpg","description":"Three goats. Two bridges. One corgi. Zero margin of error.\nGoats on a Bridge adapts the classic Norwegian fairy tale, Three Billy Goats Gruff, as an inventive new platformer that has players controlling not one, but two goats at the same time. That’s twice the capra-control of Goat Simulator! Sadly, this has the makings of a tragic tale.\nTempo and Chubbs’ poor brother has been abducted by an evil troll, and it’s down to you to direct the pair as they jump, dodge and roll their way across a series of hazardous bridges to track down their lost sibling. There’ll be bizarre collectibles, accessory-selling amphibians and even an energetic corgi to help you on your adventures. Just be sure not to let your four-legged friends plummet into the water. That’d really get their goat.Features2 Different Game Modes\nSingle-player, co-operative and competitive herding\n10 time-based levels challenge players to secure all 3 stars\nVisit the Stash to admire your recently discovered Rainbow Toast\nA sophisticated frog sells bold accessories to customize your characters at the Stump\nDash Mode turns the game into a procedurally generated endless runner\nSupports PS3™, PS4™, Xbox 360™ & Xbox One™ Controllers\nDoesn’t require much RAM… (yeah, we went there)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cabygon","platforms":[{"id":0,"name":"PC"}]},{"id":16088,"name":"The Forest of Doom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/240/2407534fdae62e758c05386fa87ba3bb.jpg","description":"Only the foolhardy would risk an encounter with the unknown perils that lurk in the murky depths of Darkwood Forest. Yet there is no alternative, for your quest is a desperate race against time to find the missing pieces of the legendary Hammer of Stonebridge – fashioned by Dwarfs to protect the villagers of Stonebridge against their ancient doom.\nComputer gaming was in its infancy and it was the early days of tabletop RPGs when Ian Livingstone's The Forest of Doom exploded into bookshops in the early 80s, proudly displaying Iain McCaig’s iconic cover.\nRelive the adventures in Darkwood Forest, lovingly updated for PC, Mac and Linux. Presented in full colour with realistic physics-based dice rolling for battles, auto-mapping, an auto-updated adventure sheet and stat keeping.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tin Man Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13727,"name":"SUPERFIGHT","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5f/d5fa52370ef113b0a142041ec723d30a.jpg","description":"SUPERFIGHT pits players against one another in hypothetical battles of real wit. The only way to win is to make the most compelling argument about the big questions in life: Who would win in a fight between a drunk Ninja and Abraham Lincoln riding a bear? Which is the better weapon: an infinite sausage lasso or a skunk on a stick? What are the chances an army of penguins could stop a depressed centaur? Grab a microphone, join or create a game with up to 4 players, and let the votes decide!\nBuild your fighter with character cards (like Zombie, Shark, or George W. Bush) and attribute cards (like Super Speed, Armed with a Chainsaw, or Has Tiny T-Rex Arms). When it’s your turn, combine a character card with a couple of attribute cards to construct your fighter, then it’s up to you to make your case to an audience of friends or Twitch! The included FREE Blue, Purple, and Challenge Decks also allow players to throw hundreds of random locations, scenarios, and challenges into the mix for even MORE mayhem. Additional themed decks, like the R-rated Red Deck or the Geek themed Orange Deck, are available to purchase, with even more hilarious digital decks to come in future updates!\nBut wait there’s more! SUPERFIGHT has two ways to earn over 130 fully voiced titles and over 500 unlockable cards - PLAY or VOTE. Don’t have time to play a match? Vote on fighters from other matches to earn unlocks! Correctly guessing the winners from past match-ups in Quick Vote, or vote on LIVE games streamed to Twitch directly via easy to use hashtag voting in their chat – you don’t even need to be in-game to earn XP from voting on live streamed games, just link your Twitch account to SUPERFIGHT and earn unlocks whenever and wherever you watch a game on Twitch!\nFeatures:\nPLAY with a group of up to four players using matchmaking or inviting your friends.\nVOTE on fighters from previous games, guessing a match-up’s outcome to earn rewards.\nARGUE using integrated in-game voice and optional webcam support to make your case!\nWATCH and vote for winners in live broadcasts of fights directly within Superfight or any device with Twitch!\nCOLLECT over 500 additional cards, on top of the 200+ cards unlocked immediately upon purchase, as you Play or Vote!\nUNLOCK over 130 Titles based on how you play! Customize your round introduction with your Titles.\nEXPAND your card count with the included free Location, Scenario, and Challenge Decks! More decks available as DLC!\nLINK your Twitch account to earn bonus rewards while Broadcasting or Voting on live games (streaming not required to play)!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pipeworks Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13715,"name":"Walkover","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9fd/9fd508f45b5de15e478955432510a07a.jpg","description":"The ultimate Splatter-Strategy-Action-Game.\nFight side by side with your friends against hords of Aliens. Be prepared for epic battles with several hundreds of enemies.\n6 different Gamemodes (Standard, Survival, Deathmatch (with and without Aliens), Capture the flag (with and without Aliens))\n4 different weapons (Laser, Ion, Grenade, Rockets) with a total of 14 different fire modes\nNetcode, which allows thousands of Aliens to fight agains together with other players around the world\nDedicated Game server to join, or host your own server for your friendsFree2Play, Really?YES! There is no ingame currency, no paid DLC. Download, Play, Have Fun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Millenium Project Enterprises","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11106,"name":"Eisenwald: Blood of November","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/716/7163319acf9bddafbb9a416aba224393.jpg","description":"The duke is dead. Without an heir it falls upon the council to decide who will become the new duke. Amidst the upheaval two powerful clans vie for the crown: Eisig and Horn. But they are not alone for some lesser clans have dared to declare their own bid for the throne.\nThe cards are dealt and the stakes are too high for anyone to give support to another contender. Whatever decision the council makes, feudal war looms on the horizon. You alone have kept your neutrality and the fate of the war is in your hands.\nThis game contains references to the current political situation.\nThis new adventure will have the following new features:\nRandom events that add replayability;\nSmart re-spawn - improved dynamic balance of the armies;\nUpdated look - the engine and graphics will be reworked and improved;\nSandbox like gameplay – freedom of movement;\nExperimental quest system where some events will change according to your behavior;\n6-10 hours of gameplay.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aterdux Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":5600,"name":"NARUTO SHIPPUDEN: Ultimate Ninja STORM Generations","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b10/b10c984e162982d437d7f8653f16a5b4.jpg","description":"It’s the ninja battle of the generations! NARUTO SHIPPUDEN™: Ultimate Ninja® STORM Generations is the latest rendition in the smash hit series of games. All your favorite NARUTO ninja defy time to clash in the largest ninja war ever! With more than 70 playable characters and over 65 minutes of new NARUTO anime footage, NARUTO SHIPPUDEN™: Ultimate Ninja® STORM Generations is the ultimate NARUTO SHIPPUDEN™ game!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":4641,"name":"Galaga Legions DX","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f98/f98425b4ab0dfb349f475f470a8100be.jpg","description":"The legendary hit arcade shooter returns with Galaga® Legions DX! Featuring a new twist on the classic gameplay, slick new graphics and devastating weapon power-ups, the fate of the galaxy lies in your hands! Board your fighter and prepare to defend Earth from wave after wave of relentless aliens. Target your enemies' critical weak spots to earn bonuses and rack-up an astronomical score! Blast your way through unique levels and epic boss battles on your mission to defend the galaxy and prevent an intergalactic catastrophe!\nGalaga®Legions DX & © 2011 NAMCO BANDAI Games Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3784,"name":"TxK","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/516/51667b1227f9f8760c318272d0537fb5.jpg","description":"Glowing vectors, explosive particle effects and a pulse-pounding soundtrack are core elements of many modern arcade shooters - a style that Llamasoft defined with its seminal 90s tube shooter.\nTxK is the spiritual successor to that genre-defining work and brings you 100 levels of engrossing score-chasing gameplay married to an outstanding soundtrack that will have your head nodding as you blast your way onto the scoreboards.\nThree gameplay modes and our acclaimed Restart Best level select mode combine to bring you blissful shooting satisfaction whether you are looking to zone away an hour or two or simply dip in for five minutes to bump up a level's score.\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\nNetwork Features\n32768KB Minimum\nTouchscreen\nDual Analog Sticks\nMotion Sensor\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n(c) 2014 Llamasoft Ltd","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PS Vita"}]},{"id":1644,"name":"Kick & Fennick","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ef/3ef9ac40e0b5dbb2604ad8afb6d7053f.jpg","description":"Kick & Fennick is a platform adventure about a little boy with a very big gun.\nSoon after waking up in a desolate but colorful world, Kick meets a small flying robot named Fennick. When Fennick saves Kick from a menacing guard robot, they find out Fennick's battery is broken. Together, they embark on an adventure to the Core Tower to find Fennick a new energy core.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Abstraction Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"}]},{"id":1318,"name":"Super Mutant Alien Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c70/c70a094df36d5b879e2347904f4e4f0d.jpg","description":"Three fleets of spaceships flee a doomed Earth carrying the last humans in cryostasis. Pursued by aliens, it’s up to the lowly security droids to save humanity. Taking up arms solo or with a friend, you must dance with death in a brutal and addictive arcade platformer shooter inspired by Super Crate Box and stuffed to the brim with unlockables.\nFight through rapid fire single screen levels each with a random combination of platform layout, objective, vending machines and enemies. Dodge and weave amongst the aliens to stay alive but don’t leave them standing too long or the ship’s radiation will mutate them into bigger, nastier versions.\nOnly by unlocking and mastering the wild variety of weapons, explosives, special abilities, defense moves and perks can you hope to survive across all three galaxies, rid your ship of the mutant menace and save the oblivious humans.Features\n- rapid fire levels give you no rest as hordes of enemies arrive, hell-bent on your destruction. Clear the objective quickly and be sure to kill each enemy before it has the chance to mutate into a bigger, nastier version of itself. Take a tiny breather and then it’s on to the next room.\n- in the tight confines of the space freighter, standing still is not an option. Your ability to dodge around enemies is as important as your aim. Survival requires quick thinking and rapid reflexes and a true master of the dance is a beautiful thing to behold.\n- each single screen level is randomised, drawing on a pool of platform layouts, objective types and enemies as well as which vending machines will be present. You’ll never know which weapons or grenades will spawn in the vending machines whilst crate drops containing special abilities, sidearms, perks and defense moves are also random, adding further to the mind-boggling possible combinations.\n- a wealth of weapons, sidearms, special abilities, perks, explosives, defense moves and character skins awaits you. Each new unlockable joins the melting pot of random ingredients, increasing your options but also the need to master each individual element and the way they combine with each other.\n- take on the mutant hordes by yourself or team up in local co-op. Two player adds further complications to master as you must be careful to avoid friendly fire from explosives and will have to share/fight over item and health pack drops.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SURPRISE ATTACK","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":791668,"name":"Idle Skilling","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a5/8a5f689a657f0294e31498753a20fcac.jpg","description":"Afterlife -- the long lost Idle Skilling updateYou really thought I wasn't coming back with 1 more update? I know you guys always believed in me, so you know I had to go and do it, and you know it's gonna be great fun!\nThe new Idle Skilling update, Afterlife, is dropping with the Steam Release.\n(It will also be available on the mobile version, although there will be no crossplay cloudsaving)\nAbout the GameIdle Skilling is the idle game with ALL the skills!!!\nI won't waste your time with a long description, so here's the gameplay loop of Idle Skilling -- if it sounds interesting, go play it!\n◉ You start out with basic skills like Strength and Attack. You level those up to fight monsters and earn skill points.\n◉ You quickly unlock Mining, Fishing, and Smithing using skill points. You level up mining and fishing to get resources used in smithing to craft upgrades, which help you fight monsters to reach world 2.\n◉ Once you reach world 2, you can partially reset your progress and rerun the whole game much faster and progress further. Reach world 3, and you unlock the farming skills of Tilling, Botany, and Apothecary. Level up your tilling by harvesting crops, and botany by planting a series of increasingly exotic flowers, then use them to brew strong potions to buff up and fight monsters even better to reach world 4.\n◉ You keep doing this forever, unlocking the other 14 skills and gameplay mechanics (pet breeding, tunnels and construction, crusades, etc) and fighting increasingly difficult mobs over 10 worlds, from the Grasslands all the way to the Maelstrom!!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Lavaflame2","platforms":[{"id":0,"name":"PC"}]},{"id":502155,"name":"Raji: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09b/09b45fba1502e585d35a852f932bd3e2.jpg","description":"add full game to your wishlisthttps://store.steampowered.com/app/730390/Raji_An_Ancient_Epic/\nAbout the GameThis is an opening chapter of Raji: An Ancient Epic that you can play for free.\nOur story begins at the start of a new war between the demons and the gods. Seeking to avenge their humiliating defeat in the last great war, the demons have challenged the gods and have invaded the human realm, threatening nothing less than the utter destruction of humanity.\nAfter the first great war, the humans had fallen into a false sense of security, forgetting the ways of alchemy, while enjoying the peace. Soon, the demons arrived to challenge the humans’ complacency, and unable to defend themselves, cities and fortresses fell, leaving the humans at the mercy of the demons.\nAmidst the chaos, a new hero has risen in the form of a young girl, Raji, who has been chosen by the gods to be the sole defender of the human race. In her quest to save humanity, Raji must also rescue her brother, who has been captured by the demons for unknown purposes.\nA Story of SiblingsExperience a story of siblings. Raji and Golu are sister and brother who have been separated by the attacking demonic hordes and now find themselves in the middle of the great war.\nRaji has taken it upon herself to find her brother and put an end to this reckless war. However, this can only happen if she manages to break down the might and stratagem devised by the great lord of demons, Mahabalasura.\nStunning ArtworkInspired by Indian mythologies such as Mahabharata and Ramayana, and by the medieval architecture of Rajasthan, Raji: An Ancient Epic brings a refreshing new style to the action-adventure scene!\nEvery corner of the game’s environment is drawn in the Pahari art style and combines hand-painted textures, rendered in 3D giving the Raji: An Ancient Epic a stunning and unique visual quality rarely seen in games.\nTactical CombatDiverse weapons and powers, gifted to Raji by the gods, are at your disposal. Mastering them all will be vital to your success as the demonic hordes will skillfully adapt to each and every situation; while the Trishul may be perfect for one battle, the mighty Sharanga bow may be needed for the next.\nA Universe Set in Ancient IndiaFor the very first time, experience a game set in ancient India and infused with Hindu and Balinese mythology. You will find yourself immersed in ancient India where every corner is begging to be explored.\nFrom enchanting stories from the lore of the game to tightly packed battles against ferocious demons and bosses, ancient puzzles, massive forts and palaces, experience a sibling story who find themselves at the center of a divine war.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nodding Heads Games","platforms":[{"id":0,"name":"PC"}]},{"id":416036,"name":"Fuser","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89f/89f0e891287d58191c770d5572f2b1f5.jpg","description":"At its core, Fuser is a music mixing game that delivers the fantasy of headlining the world’s premier, non-stop music festival. With access to a 100+ song soundtrack that features global hits from some of the world’s biggest artists, players will seamlessly blend vocals, bass lines, beats and riffs as they play.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Harmonix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":379605,"name":"XIII - Remake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef6/ef66bec388cd5c66d9619c62d886ebc0.jpg","description":"The video game XIII is back in a remake.\r\nXIII is a First Person Shooter where you play as «Thirteen», a talented soldier who lost his memory and has been accused of killing the President of the United States. You first wake up injured and amnesic on Brighton Beach with the only clue being a small key and a mysterious tattoo « XIII » next to your clavicle. It’s now your job to search for answers through a 34 levels solo campaign. Don’t worry, you will find the appropriate weapon arsenal along the way. With questions not missing, neither are the bullets!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"PlayMagic","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":57841,"name":"Tekken 2 (1995)","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c9f/c9fbbde8236fbefa330658166eba8419.jpg","description":"Tekken 2 (鉄拳2) is a fighting game, the second installment in the Tekken series. It was released in arcades in August 1995, and later for the PlayStation in 1996. The original arcade version of the game was released in Tekken 5's Arcade History mode for the PlayStation 2, in 2007 for the PlayStation 3 and PlayStation Portable via the PlayStation Network, and in 2009 for Zeebo.\nThere are ten playable characters in the game's arcade version and up to twenty-five fighters, including eight new ones in the console version. The home version also introduced new, now-staple game modes to the series. Tekken 2 was a critical as well as commercial success. It was followed by Tekken 3 in March 1997.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation"}]},{"id":50176,"name":"Super Seducer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b7/7b74973faf43dd2bbc7664fa969282cf.jpg","description":"Super Seducer is an FMV dating simulation with a huge\ntwist. Equal parts entertainment and learning, this is the ultimate test of\nyour real-world seduction skills.\nYour palms are sweaty, your mind goes blank, you struggle to find the right\nthing to say. This beautiful lady is looking at you expectantly and…you\nmake your excuses and leave.\nWe’ve all been in embarrassing dating situations.\nNow you can put yourself in those same situations and experiment until you\nfind the perfect approach for every scenario. The virtual slaps won’t hurt or\nembarrass you, but instead show you what not to do next time. When you\nget a number, a kiss or take a girl home in Super Seducer, the same moves\nwill work in real life.\nWith ten varied levels, over 530 choices, and over 8 hours of high quality\nvideo, the game is rich and varied and we believe it is the biggest FMV\ngame ever made.\nMultiple endings to each level incentivize you to go back again and see if\nyou can do better. If you want to be totally ridiculous, we have you covered\ntoo, the most indecent proposals and ludicrous lines are right there as\nchoices.\nOn level completion, you get feedback for every choice you made, so that\nyou can see exactly why it was right or wrong.\nSo what are you waiting for? These lovely ladies are not going to seduce\nthemselves!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"RLR Training","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":36759,"name":"True Crime: New York City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/430/4309f10bef59d88c9efdb57b8f776b17.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Luxoflux","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]}]