[{"id":13879,"name":"Hearthlands","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ce/2ce3abf1324a5386a37624b5502e743d.jpg","description":"Hearthlands is a medieval/fantasy city-building real time strategy game in which you take a role of a king in a procedurally generated world. You can not control your subjects directly; instead you focus on city-building, resource management, diplomacy, heroes, magic and other things a\ntypical king deals with on a daily basis.\nThe game is very flexible: you can build up a powerful realm and rule the lands with an iron grip, or establish a humble fishermen village. Or create a trading empire. Or found a small, but well-defended outpost or raider's camp. Or become a host of a wizard's manor.\nAll characters, from a hauler to a hero have their own minds and behavior patterns. Sometimes it is interesting just to watch people scurry about minding their own business.Features:Build a medieval city;\nPlay the game the way you like it: experiment with sandbox settings or play a campaign mode (ex. Polish localization);\nKeep your people happy by providing them with necessary resources and services;\nGather resources, produce goods and build industries;\nSee reports and tune up your economy;\nBuild an army and protect your city from monsters and invasions;\nTrade and conduct diplomacy with neighbor realms, or go to war with them;\nResearch technologies and cast spells;\nChallenge yourself by going after one of the achievements.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sergio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13140,"name":"Morphine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3eb/3eb5a3101fd9dd3260da848a100b0f67.jpg","description":"You will be playing as an eighteen year old high school student who is living in his own utopia as an ignored, bullied person by many others throughout his life...\nYou will journey into his past testifying his dramatic events that troubled his young life.\nMorphine will drag you empathize and make you witness to an alternative subconscious world from a different perspective.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kerim Kumbasar","platforms":[{"id":0,"name":"PC"}]},{"id":10712,"name":"Sumoman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa8/aa80562a14855bf3c75d6b63b695a9f8.jpg","description":"Sumoman is an adventure puzzle platformer with advanced physics, destructible objects and the ability to reverse time. Solve various physical puzzles, trying to keep the unstable Sumoman on his feet in challenging environments.\nA young Sumoman is returning home from a sumo tournament only to find his fellow countrymen in a dramatic peril. Someone has enchanted the inhabitants of the island, putting them into an eternal slumber. Our clumsy, yet fearless hero starts his journey across the beautiful, ancient Japan to find the source of the magical dream. He will have to overcome puzzling contraptions and threatening surroundings in order to break the dream spell and wake up the charmed people. Sumoman makes no haste, however, because nothing would be worse for our noble hero than to fall over and lie helplessly.Key Features\nUnstable main hero. Sumoman can't get up if he falls over.\nTime reverse feature. Every sumo wrestler can rewind time. Didn't you know?\nPhysical puzzles. Can you solve even the simplest puzzle if Sumoman falls over every time?\nLots of humor and Easter Eggs.\nSplit-screen mode with special competitive levels for 2 players. Be faster than your friend in sumo racing, or beat them in the King of the Hill mode.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tequilabyte Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":9707,"name":"Galaxy Control: 3D Strategy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ed/6ed922b64f57c18f8ecf362b18d52b3f.jpg","description":"Steam FAQQUESTION: Free-to-Play game? Another one?!\nANSWER: Yes, this is a F2P game. We’re honest about it. There is no paywall, no artificial barriers. Everyone is in same conditions if they pay or not. If you like to support developers and grow faster (but not bigger!) in the process — you can donate. But this is completely voluntary!\nQ: WTF? Timers?!\nA: Yes, many things in our game are time dependent. This is a way to balance a massive multiplayer game and to make players return to game regularly. This may be a bit strange for desktop game, but mobile games been using it for years.\nQ: Can I play on mobile?\nA: Galaxy Control is already available on all mobile platforms:\n- iOS: https://itunes.apple.com/us/app/galaxy-control-3d-strategy/id835092690\n- Android: https://play.google.com/store/apps/details?id=gl.fx.galaxycontrol\n- Amazon: https://www.amazon.com/FX-Games-Galaxy-Control-strategy/dp/B00LHZB97U\n- Windows Phone: https://www.microsoft.com/en-us/store/p/galaxy-control/9wzdncrdbv2p\nQ: Why do we need a Steam version?\nA: We have a lot of fans who prefer playing (or continue playing) on PC and Mac in Facebook version, meanwhile many browsers limiting support of 3D games recently. So we do this for their convenience first of all. We're determined to develop Steam version and hope that many new players will join the game!\nQ: Will I be able to play on the same account from Steam and from mobile?\nA: Absolutely! We support connecting Steam accounts to mobile (and vice-versa) through Facebook.\nQ: Are Steam players playing on the same server as mobile users?\nA: Everyone is playing on the same server. There are already hundreds of thousands of players in Galaxy Control!\nAbout the GameGalaxy Control is an ultimate space combat strategy game with fast-paced combats!\nBuild your base and battle with other players to control the galaxy! Galaxy Control is an ultimate space combat strategy game with next generation 3d graphics and fast-paced combats!\nGather minerals and extract uranium, defend your base with laser towers, missile turrets, cannons, walls and mines, create the ultimate army with unique ground and air units! Battle with millions of players and take their Fame point and resources! Became the TOP 1 in the galaxy!\nNOTE! Galaxy Control requires internet connection.\nFEATURES:\n- 100% FREE TO PLAY ultimate space strategy\n- Battle with players from all over the world and take their Fame Points and resources\n- Gather minerals and extract uranium to build and upgrade your base\n- Defend your base with laser towers, missile turrets, cannons, walls and mines\n- Create the ultimate army with more than 11 unique ground and air units\n- Campaign Mode with more than 100 unique missions","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FX Games Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":7612,"name":"Wrecked","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31c/31c07b50a2777e177cda875b0f3192cd.jpeg","description":"Create your vehicle and get ready for action!\nGet Wrecked is a tactical PvP Free-to-Play where you will have to build, add weapons and install armor plates to your vehicle to launch yourself into the the melee in different game modes, such as \"capture the flag\", or \"deathmatch\". you can literally place weapons and defenses, such as machine guns, cannons and shields anywhere in your favorite vehicle!\nPrepare for the challenge!\nGet ready for Get Wrecked!\nFeatures:\nMultiple maps in real and fictional places.\nMany different real and fictional vehicles.\nMany different weapons and protections that can be placed in infinite different ways.\n10 vs 10 online multiplayer.\nMultiplatform.\nUnique graphic.\nRealistic physic in weapons and vehicles.\nA totally new way to play.\nController support soon.\nNew game modes soon.\nMany vehicles and maps incoming.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MDickie","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":4474,"name":"Super Stardust Delta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/291/291b77d52b4a61845777f167ed47e549.jpg","description":"Blast through an addictive shooter where one wrong move could be your last.\n\nCreate incredible black holes using the touchscreen, blast asteroids to pieces using the dual analog sticks and deploy devastating shock waves with motion sensitive gameplay.\nEnjoy classic gameplay modes from Super Stardust HD and Super Stardust Portable, as well as new modes exclusive to PS Vita.\nShoot your way to the top of the intergalactic leaderboards via PlayStation Network.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Housemarque","platforms":[{"id":0,"name":"PS Vita"}]},{"id":3521,"name":"MotoGP 14","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/303/30364eaea7b2ba76d7ebe5ae326bb9e0.jpg","description":"The official video game of the MotoGP™ hits the track with all the riders from the 2013 and 2014 seasons, as well as legendary champions from the history of the MotoGP™. Race on all the official tracks and take on your adversaries on the brand new Argentina circuit. Put yourself to the test with new game modes, including online Split Battle and offline Real Events 2013, not forgetting the compelling career mode. MotoGP™14 has been completely overhauled thanks to the new graphics engine that gives players the opportunity of experiencing all the thrills of being a real MotoGP™ rider.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":484,"name":"Battle Academy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/425/425428c95112b63c5ac981871f2bb29e.jpg","description":"The hit turn-based strategy game has landed on Steam! #1 strategy game in the app store in 46 countries.\nApproachable, absorbing, detailed and yet visually impressive, Battle Academy aims to revolutionize the strategy games market with a blend of intuitive design and compelling gameplay. This quick-paced easy-to-learn strategy title boasts an impressive number of unit types and different missions and delivers endless replay value because of cleverly designed online multiplayer system, built in scenario editor and a host of user mods and scenarios.\nBattle Academy is an action-packed tactical strategy game where you have to take command of a select group of units and lead them through battles on the many different fronts of World War II. As a commander, you will have to employ real world combined-arms tactics in order to secure victory. This means you will have to lay ambushes to surprise opposing forces, use suppressing fire to pin them, flank hostile armor for maximum effect and, if necessary, assaults the enemy to clear strong points. In some cases you will also have access to powerful off map artillery and air support with the capacity to weaken the enemy defenses or even stop an enemy attack dead in its tracks. At the same time you will have to play close attention to the morale of your own troops and use recon units to spot any hostile ambushes or flanking attacks.\nTo achieve this, Battle Academy offers a clean and intuitive interface that makes it easy to control your troops and at the same time makes sure you will never lose sight of the battle. This means that you will be focused on what really matters; your mission objectives, battle tactics and unit positioning.\nThe game engine is also completely script-driven and therefore easy to mod, allowing players to create their own missions and scenario and even complete game overhauls in a simple and effective way.MultiplayerSlitherine’s revolutionary server-based PBEM++ system completes the package, for a gaming experience that will certainly please both hard core wargamers and newcomers. This asynchronous multiplayer system means you can easily find opponents anywhere in the world any time of day and play at your own pace. There are thousands of games on going at any time.\nBattle Academy is also available on iPad and offers cross-platform multiplayer, this means that there will always be someone to challenge online! You can even start your turn at home on your PC and then continue it or play another turn on your iPad on the train.Base Game FeaturesControl British, US, Polish, Canadian forces in 3 epic campaigns covering more than 30 varied battles or take control of Italian and German forces in multiplayer.\nSelect from a vast array of equipment including 100 units from 6 nations - Shermans, Fireflys, Panthers, Tigers, Stukas, Hurricanes, P47s and much more!\nGameplay features include ambushes, line of sight, artillery barrages, airstrikes, scouts, morale, APCs, flame throwers, heavy bombers, snipers and suppression.\nYour units gain experience as they fight. Get promoted to Veteran and Elite status and gain new skills.\nAddictive multiplayer modes using Slitherines revolutionary multiplayer server.\nHuge modding opportunities. The game has been designed so that its easily moddable and accessible scripts control all aspects of combat, user interface and the game's appearance.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Slitherine Software","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":978865,"name":"Nobody Wants to Die","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ef/4efba3c8f8cc57ee822b728fd60993ea.jpg","description":"Lose yourself in the world of New York, 2329, where immortality comes at a price that someone has to pay. Following a near-death experience, Detective James Karra takes an off-the-books case from his chief with only the help of a young police liaison, Sara Kai, to assist him. Time reveals all as they risk everything in pursuit of a killer, uncovering the dark secrets of the city's elite.\r\n\r\nExperience a noir adventure in an alternate future of New York City in 2329; technology has advanced to offer humans eternal life, allowing consciousness to be stored in memory banks or transferred from one body to another. That is, if you can afford the subscription.\r\n\r\nSee through the eyes of Mortality Department Detective James Karra on his hunt for a serial killer who targets the city’s elite citizens. Investigate crime scenes using his time manipulation augmentation and advanced technology to reconstruct events leading up to each murder and uncover clues that lead to the horrifying truth behind the murders.\r\n\r\nLose yourself in a dystopian future through this meaningful and original interactive detective story, that explores the dangers of transhumanism and immortality. In a world of eternal life and vanishing morality, you, a hardened detective, must navigate the lines of right and wrong in a society where death is a distant memory.\r\n\r\nUtilising the power of Unreal Engine 5, Nobody Wants to Die pushes the boundaries of storytelling, combining photorealistic graphics and a distinctly unique narrative experience.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Critical Hit Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":965471,"name":"MiSide","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/151/1518595310e4bbef5139b98a4cb36a81.jpg","description":"Tips※This game contains intense scenes. It is not recommended for those with weak hearts.\nAbout the Game Every day, you will come to see me, help me with chores, cook for me, and buy me gifts.You are so nice! I love you!I want to keep you with me every day, and live with you every day~I know you also want to be with me every day, so I let you to come to our sweet home~How is that? Are you happy? That way we can stay together all the time!Let's take a selfie first, It will last longer~Enjoy a wonderful lunch together~You may feel sudden, but it doesn't matter. I don't care as long as we can be together~Why does it feel like you are so eager to go back ? Don't you love me anymore? Why are you leaving? Why are you leaving? Why are you leaving? Why are you leaving!Original visual style\nThe authors hope to emphasize the contrast of colorful anime style against the background of the disturbing adventures of the main character.Interesting plot\nThe game has an unexpectedly developing storyline, accompanied by psychological tension.Original musical accompaniment\nThe game experience is accompanied by an authentic warm soundtrack, transitioning into an atmospheric ambient.Unique Characters\nIn the world of MiSide, the player will encounter various characters who play a role in the narrative part of the game to varying degrees. Helping the hero, scaring him, or just messing with him.※This game contains intense scenes. It is not recommended for those with weak hearts.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"AIHASTO","platforms":[{"id":0,"name":"PC"}]},{"id":914904,"name":"Wall World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e71/e71a8527d9616bdd923e0468ae3c27c2.jpg","description":"Welcome to the Wall World, a mining rogue-lite with tower defense elements. Explore procedurally generated mines and discover fantastical biomes. Find resources and technologies for purchasing valuable upgrades. Fight off hordes of aggressive monsters using your mobile base. Roam the Wall freely day and night, in various weather conditions. Find traces of \"the others\" and boldly mine where no man has mined before.\nMine\nBurrow deep into the Wall in different places. Look for resources and technologies for upgrades, discover new biomes in the mines — but don't forget to return to your robospider in time for the next monster attack.\nFight\nShoot and hack at the nightmarish creatures with a variety of weapons, from simple machine guns to homing missiles. Increase your chances of survival by breaking camp instantly and continuing the fight on the go.\nUpgrade\nModernize your exosuit with resources and technologies you find to move faster in mines and break through ever harder rocks. Upgrade your robospider's combat stats to deal with the increasingly dangerous enemies that await you on the endless Wall.\nExplore\nDiscover mysterious locations and fantastic biomes. See how the Wall World changes as you move deeper along it, day and night.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":761348,"name":"Terraformers","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b12/b12ffa12fe4d791b4363f8ff138f6222.jpg","description":"Send your leaders to mysterious locations and be the first to discover rich resource depots, giant crystal caves and stunning natural wonders.\nFound new cities on craters and in lava Tubes. Make them thrive and meet your population's rising demands.\nMine the rare metals of Mars, manufacture them into advanced goods and set up an effective transport system between your ever-growing cities.\n\nRestart a volcano, construct giant space mirrors or crash ice asteroids to geo-engineer the entire planet.\nFrom spreading adaptive bacteria, to planting full-grown forests with bears. Each life form has specific requirements and provides strategic benefits.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Asteroid Lab","platforms":[{"id":0,"name":"PC"}]},{"id":614973,"name":"Scars Above","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/860/860dc24809b7bdef538f6833b0c8d9d5.jpg","description":"Scars Above is a challenging sci-fi third-person action adventure shooter combining the rewarding feel of overcoming difficulty with a compelling and intricate story, set in a mysterious alien world to explore.\n\nSome things were not meant to be discovered…\n\nA colossal and enigmatic alien structure appears in Earth's orbit and stuns the entire world; humanity names it ‘The Metahedron’. The Sentient Contact Assessment and Response team (SCAR) - consisting of scientists and engineers - is sent to investigate.\n\nThings don’t go as planned and the Metahedron hauls the team across space onto a mysterious extrasolar planet. Playing the role of Dr Kate Ward - a SCAR member - who wakes up dazed, alone in a strange, hostile environment. Determined to survive, you set out to find your crew and unravel the mystery behind what’s happened.\nSURVIVE AGAINST ALL ODDS\nKate is an astronaut and a scientist – not a soldier - but she's resourceful and determined to do anything to survive.Use a combination of ranged weapons, devices, consumables and melee attacks, you need to manage stamina as you run, dodge, exploit weak points and discover effective tactics to defeat your foes\nCombine different elemental attacks to beat the odds and break through otherwise impassable obstacles.\nCraft different items and gadgets to aid you against the countless threats in this exoplanet.\n\nEXPLORE A MYSTERIOUS EXOPLANET\nImmerse yourself in a carefully crafted adventure, inspired by the sci-fi classics.Explore an alien world filled with countless threats, gorgeous landscapes and ruins hinting of an ancient - yet advanced - civilisation that somehow disappeared.\nJourney through different biomes, such as marshlands, freezing wastelands, underground caverns and alien facilities – all with their own set of challenges, enemies, secrets and environmental hazards.\n\nEMBARK ON A RESEARCH JOURNEY\nKate is a scientist to her core and you'll use that scientific expertise to extract information from your surroundings by scanning artifacts, materials and creatures in order to learn about their features, properties and weaknesses.As you explore your surroundings, you will conduct analysis and gain knowledge which will allow you to craft new gadgets, weapons and unlock abilities in Xenobiology and Engineering trees.\n\nTHRILLING BOSS FIGHTS\nGhastly enemy designs - with diverse strategies and tactics - will keep encounters fresh, forcing you to find creative ways to defeat them.\nThe Scars Above Experience:\nImmerse yourself in an exciting sci-fi adventure inspired by the classics of the genre\nExplore an enigmatic and intricate alien world - with plenty of mysteries to uncover\nFight tactically, using a combination of elemental attacks, gadgets and items, exploit the environment and enemy weaknesses\nEngage exciting and challenging enemies and bosses, from hulking rock-covered monstrosities to nightmarish creatures lurking in the dark\nGain knowledge and acquire new skills\nScan enemies to learn about their weaknesses and behaviours\nUse your scientific skills to conduct research and extrapolate information\nMature Content Description\nThe developers describe the content like this:Violence, Depictions mutated human bodies, Depictions of dead and mutilated aliens.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Mad Head Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":502168,"name":"Heavy Metal Babes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/507/5072bcbd06b4aaf5fb137414408f7f95.jpg","description":"In a not so distant future, humanity has reached the very edges of the galaxy.\nPerfect genetically improved clones of the most beautiful women on Earth are now used in combat and exploration missions.\nWith the unique ability to synchronize and control powerful robots, they are the ultimate AI companions. But recently, Earth has lost communication with one of its colonies: a planet called X-69, inhabited exclusively by XEN units. Your mission is to discover what happened there, fix the issue and re-establish communication with the lost planet. To do that, you will join your AI companions on a crazy adventure that will have you go deep into planet exploration, battling corrupted XEN units and defeating powerful enemies.\nFact and features\n21 Girls and +140 H-Scenes\nUnlock hot animations with all of your sexy companions and create a dream harem with the most beautiful girls in the galaxy!\nGroup Sex H-Scenes\nIncredible group H-scenes where you will see your girls having a lot of FUN!\nEngage in spicy chats with all of your girls...AT THE SAME TIME!\nCollect all of their naughty photos and unleash your wildest fantasies!\nAmazing Storyline\nTravel through space with a ship full of HOT girls dying to get your attention!\nChat with girls and make them yours\nChoose your words wisely and make your girls wet!\n+40 Erotic animated scenes\nHigh-quality animations with lots of sexy girls who just want to show how you HORNY they are!\nUnlock crazy hentai sex scenes beyond your wildest dreams!\nChallenge other players\nCompete against other players and prove that your girls are the strongest and the sexiest!\nShow that you are the best commander by training your sex partners and making it to the top of the league!\nPowerful abilities\nBuild your dream team, put your horny girls to the task and defeat all the enemies standing in your way!\nMake your girls go wild and unleash powerful attacks!\nXEN Labs Challenge\nFight your way through increasingly difficult challenges, satisfy your girls and reach the top to claim your prizes!\nAs you will win more and more battles, you will be able to upgrade your character, unlock a map, and even partake in some side games to switch things up a little. Close your eyes for a second, and allow yourself to be transported by the music; the jazzy tunes that play in the main frame will set the mood for you to make the most of everything, *wink wink*. But once your squad is assembled and ready for battle, the high-octane action music will definitely drive your will to victory. And, of course, this game wouldn’t be complete without a super villain; enters the Dark Goddess, your steaming and evil nemesis.\nSo sit tight, buckle up for the ride, and get on board, sexy thing; it’s time for heavy metal!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Digital Arts","platforms":[{"id":0,"name":"PC"}]},{"id":376898,"name":"Humanity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0eb/0ebd25306a59a3ec8a2cd429298ec572.jpg","description":"A unique blend of puzzle-solving and action-platforming, HUMANITY puts the fate of all mankind in your hands. Er, paws. Did we mention you’re a dog? You are a Shiba Inu charged with commanding massive, marching crowds to jump, turn, push, float, shoot, and climb their way to salvation. Guide the masses through 90-plus stages filled with obstacles, enemies, puzzles, unlockable skills, and wild boss fights in the narrative campaign, or browse a wide array of user-made levels (or build your own!) crafted via the super easy-to-use in-game Stage Creator.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Enhance Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":300819,"name":"King of Crabs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/365/365af445aa2b3b3538c290bc54e44291_vPzMvfV.jpg","description":"Fight to become the biggest crab on the island!\nIntense real-time multiplayer action. Up to 100 players per game. A huge island world is waiting to be explored and conquered. Join the onslaught: Scrap, scavenge and slaughter your way through waves of crustaceans. Can you become the King of Crabs? Climb to the top of the leader-board to prove you’re the mightiest crab in the land!\nCollect a weird and wonderful variety of species of Crabs. Discover advanced skills and collect unique skins. Upgrade and customize them to help you climb the ranks.\nFind an array of crazy and deadly weaponry to help skew the odds in your favour. Incredibly detailed 3D graphics, animation and sound make the experience come alive.\nTest your worth in the intense PvP game modes.\nLook out for new Crabs, skins, maps, special events and games modes in the future.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Spilt Milk Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":244847,"name":"EXAPUNKS: TEC Redshift Player","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79e/79e9656510338a1080eef36201114e8c.jpg","description":"The year is 1992. Eyeing the surging video game market, electronics giant TEC rushes to develop the Redshift, a microdisc-based gaming handheld.\nUnderpowered even before it was released, and with a gimmicky 3D mode that gave users headaches when used for longer than a few minutes, the Redshift was widely panned and became an expensive flop.\nBut the story doesn’t end there. Now, in 1997, the Redshift is a popular hackable device, easy to find in bargain bins and at garage sales. The Redshift homebrew scene begins to grow as hackers swap tips and trade increasingly clever homebrew games that push the hardware to its limits.\nAll of this is of absolutely no benefit to TEC, who never made another game console again.\nThe Redshift is a fictional handheld game console in the universe of the puzzle programming game EXAPUNKS. This player will allow you to play Redshift games made by other EXAPUNKS players, but you'll need the full version of EXAPUNKS to create your own.\nPlay Redshift games created by your friends, even if you don’t own EXAPUNKS!\nIncludes a questionable 3D mode! (Requires red/blue \"anaglyph\" 3D glasses, not included.)\nPowered by advanced EXA (EXecution Agent) technology.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Zachtronics","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":59667,"name":"Hentai 3018","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/111/1113ee376a4ef98c23d917ec17cfdce2.jpg","description":"Hentai 3018 - is casual game. You play as a girl that need to get out of the room\nThe door with the same color and it  can transport you to each other and will rotate the world on your ground.Try to find the exit door and not be caught by the enemy or die in the trap.\nThere are a lot of amazing levels when you need think about  solving puzzles\nSome features\n20+ levels that give you some challenge for your brain\nLovely music\nFine graphics\nSimple levels\nCome and get some","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Easy game","platforms":[{"id":0,"name":"PC"}]},{"id":58613,"name":"Pokémon Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f6/0f6dc8b3c90a3db37362ff9de941a99d.jpg","description":"Set off for adventure in the Pokémon™ Quest game. Venture out with your\nPokémon buddies on expeditions across Tumblecube Island in search of\nloot in this free-to-start action-adventure for the Nintendo Switch™\nsystem. Modify your Pokémon buddies with discovered Power Stones to make\nyour ultimate expedition team.\n\nWith a cube-shaped art style, Pokémon™ Quest is unlike any Pokémon game\nyou've seen before. The simple gameplay makes it easy to hop into\nexpeditions and start exploring Tumblecube Island with the help of your\nPokémon buddies. Afterwards, head back to your base camp where you can\nuse the loot you found during your adventure to befriend more Pokémon.\nAttract various Kanto Region Pokémon to your base camp by cooking up\ndishes made with collected ingredients! You can even decorate your base\ncamp with fun items that provide helpful bonuses that make your\nexpeditions more beneficial.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"The Pokemon Company","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":41478,"name":"The Dream Machine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75c/75cd24c565cf8b3cb22b895b9818205c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cockroach","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":30784,"name":"Colin McRae Rally 2.0","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a1/2a1418f6c12f197f170bf12b2c39712e.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Codemasters","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":22316,"name":"Pizza Connection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/219/219aba0f4f9846d322960b5a79207757.jpg","description":"Make quick dough in spite of ruthless competition, crooked authorities and greedy gangsters. Pizza Tycoon is a humorous business strategy game that challenges you to build a pizza empire from scratch. Try this spicy slice of the pizza-making business.\nIngredients:\n- Use demographics to determine the best location for your restaurant\n- Keep on top of the latest eating trends to build your customer base\n- Contact competing banks to get the lowest interest rates\n- Buy restaurant furniture and equipment\n- Hire waiters, cooks and a manager, each with their own skills\n- Fight off the competition and decide on how to work with underworld gangsters\n- Build your empire across cities, Europe or America\n- Use billboards, newspapers or TV ads to advertise your restaurant\n- Create your own pizzas or make traditional ones using our colorful cookbook\n- Enter pizza contests against competing restaurants","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22248,"name":"Burst The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/acb/acbd7d530adba1062ff1d118f4b6eacf.jpg","description":"The war has had blown up when the BURST terrorist group started to attack the government five years ago. They fought us using the weapons we had created to guarantee liberty. They started by attacking the internet. They then attacked most of the important government positions. The exchange stocks were rapidly falling as revolutions began to burst. People did not have enough money to recover from these assaults, so the government started to opt for extremist politics and made the people be even more revolted. Countries were torned as richest people took power using armed groups. The population started to flee in the countryside, forming communities and little groups, fighting to have a small part of the freedom they once had. Some groups were fighting against others, and some were trying to restore liberty.\nYou are in one of these groups. In Burst, you play as a soldier who fights for freedom and democracy in all of the most disastrous and apocalyptic environment to win over your opponent using strategy and communication. Also the game is free, so you can invite all your friends to play with you at no cost !","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Lancelot DE BRIEY","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21222,"name":"Zen of Sudoku","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa0/aa01a125a6084cf9da0e03ee7e4a7820.jpg","description":"From the creators of Natural Selection comes Zen of Sudoku, a relaxing, easy to play version of Sudoku for your PC.\nRelax with hand-painted Japanese-styled backgrounds, no timer and lush natural soundscapes.\nStimulates your brain to keep it healthy and alert.\nTeaches you the basics of Sudoku through advanced strategies like \"naked pairs\", \"x-wing\" and \"locked candidates\".\nPlay unlimited puzzles, print them to finish offline and enter custom puzzles from other sources.\nUnlock trophies, backgrounds and more.\nThis product includes portions of the PopCap Games Framework.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Unknown Worlds Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":18225,"name":"Age of Magic CCG","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bcd/bcd5de8a01970964ee156e37a3f5975f.jpg","description":"Age of Magic is a online Collectible Card Game with an MMO twist. Master four powerful classes, and build your deck using unit cards from five distinct races. Extend your collection and upgrade them! Defeat evil forces in an exciting PvE Campaign, take on powerful AI opponents with up to 2 other players in Dungeons. And then show off your deck building/playing skills and claim victory over your fellow players in the Arena!Features Unique turn-based gameplay. Easy to learn, deep strategy.\nFast-paced match, ends in 5 minutes for average.\nReal-time PVP arena for 1v1 and 2v2.\nPVP season and rankings.\nCooperative real-time dungeon supports up to three players.\nFour classes with 18 skill cards and 5 weapons each.\nFive races with 41 unit cards each.\nMost cards can be upgraded up to 6 stars.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"QianZhiHuDong Network Technology Co","platforms":[{"id":0,"name":"PC"}]},{"id":18056,"name":"The Emerald Maiden: Symphony of Dreams","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71c/71c9b6b6c2902657fda5b3d3811dc23c.jpg","description":"Undersea complex called Emerald Maiden hides a lot of dark mysteries. On the surface it appears to be a paradise, when in fact it’s not what it seems to be. Reveal the secret hidden in dreams and save your loved ones!\nLondon 1957. You have been abandoned on an orphanage doorstep as a child. Now – 25 years later – you receive an envelope with an invitation on a mystery voyage and an old picture of you and your mother together. Why did your mom leave you and how is she connected to the secret organization? To discover the truth, you embark on a trip to the Emerald Maiden. Soon it becomes apparent that something very wrong is going on inside this supposed “playground for the rich and elite”. Relying on your wits alone, you will have to face the facilities darkest secrets, learn the truth about your family and flee before it’s too late!\nAre you strong enough to challenge the ancient evil lurking deep under the sea in The Emerald Maiden?\nFeaturesThrilling story in a unique underwater setting!\n19 challenging minigames to test your wits!\n25 original hidden object scenes to explore!\nA personal robot will help you on your quest!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":14817,"name":"Earth Overclocked","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/390/3908d3000ac178775ceac69a21eba3d7.jpg","description":"Earth Overclocked is a twin-stick shooter with rogue-like elements, set in a distorted version of our world where trees are evil, snowmen have lasers, and monsters run amok. After a scientist's time machine explodes while traveling to the past, he finds himself trapped in this hostile, parallel dimension. Now he must reassemble the time machine and escape before this warped reality collapses in on itself. Fortunately, a variety of bizarre and powerful weapons are scattered throughout the land to aid him in his quest. Arm the Scientist with shotguns, boomerangs, cannons, magical swords, and even cheese to help him survive!\nWith only 20 minutes to explore, blast monsters, and rebuild his time machine; surviving Earth Overclocked isn't going to be easy.\nIn true rogue-like fashion death is permanent, but procedurally generated environments combined with permanently unlockable weapons, game modes, and abilities makes each playthrough feel like fresh experience. FeaturesBlast monsters by yourself, or team up with up to 3 friends in Local Multiplayer!\nShort, intense burst of gameplay ideal for lunch breaks.\nChallenging, rewarding gameplay with that will have you saying \"just one more run\".\nNon-linear exploration. Achieve the objectives in any order. (Or follow the game's suggested route.)\nRandomly generated forests, dungeons, and enemies. No two runs are the same!\nPermanent death. Failing results in a reset, but unlockable weapons, abilities, and game modes persist across runs.\n6 different environments and dungeon themes.\n4 main classes unlocked from the start, each with different starting weapons and passive abilities.\n2 bonus unlockable classes.\n40+ enemy types with unique behaviors and attacks.\n20+ difficult boss encounters. Fight a different group of bosses every playthrough!\n30+ gameplay-altering weapon types.\n35+ pieces of unlockable content which change or add to the experience.\nStats of both enemies and weapons are procedurally generated.\nAn unlockable difficulty mode with even more challenges and rewards.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Chronicle Bench","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13009,"name":"Lethe - Episode One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c96/c9619e6e7f76712ca7892e54c7a04dc3.jpg","description":"OverviewLethe is a first person adventure with survival horror elements. Explore an atmospheric and frightening world and uncover the dark secrets of your origins.EpisodesEach Episode is considered to be a stand-alone experience. Any future Episodes will expand upon Lethe's lore and backstory, but not necessarily the same protagonist's story.StoryCrushed under the debts of his recently deceased step-father, Robert Dawn, a journalist with an unremarkable career, decides to hunt down his origins. Everything points to a quiet mining settlement. Shortly after his arrival, Robert comes into contact with an unknown substance and develops psychokinetic abilities that feed on his life energy. As tension rises, he is faced with another, even darker threat, quickly turning the trip into a terrifying battle for survival.FeaturesStealth Gameplay: Run or hide to survive.\nPsychokinesis: Manipulate the environment and use it in your aid. But be careful! Your newly gained abilities can only affect inorganic objects.\nQuality Graphics: Immerse yourself in a highly detailed and horrifying world.\nStory: Lethe isn't your typical adventure game. Learning the story behind the places you'll visit, is entirely up to you.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"KoukouStudios","platforms":[{"id":0,"name":"PC"}]},{"id":12745,"name":"Path of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a3/9a34833208e41a048313566fd631f557.jpg","description":"In Path of War, the entire United States is your battleground!\nA terrible and mysterious disaster has thrown the country into anarchy. The United States is reeling and an evil Regime has assumed control of the whole nation, oppressing its citizens. It’s up to you to assemble a militia of your friends, build an army of awesome fighting machines, and battle your way from California to Washington, D.C. to take back America!\nDesign your mobile headquarters, raise a fearsome army and wreak a path of destruction across the United States in 1-to-1 scale! Wage war to expand your territory through fast-paced, intense player-vs-player combat and upgrade your base with the enemy’s loot. Forge cooperative alliances and together expand the ever-growing borders of your new empire!\n* ASSEMBLE AN ARMY of machinegun toting monster trucks, grenadiers, helicopters and more!\n* DESIGN, COMMAND, AND UPGRADE your mobile headquarters with tons of armed defenses, structures, and traps\n* WAGE WAR against rivals in PvP combat to capture enemy forts!\n* EXPAND YOUR EMPIRE, control points of interest, entire cities, and even your home town!\n* FORGE ALLIANCES with other commanders to CONTROL ENORMOUS TERRITORIES and share reinforcements to strengthen your foothold\n* RACE TO WASHINGTON, D.C. and take over the capital!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Envision Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":12102,"name":"Alicemare","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a10/a101569a4f0d27adb5eac1277ceb68fb.jpg","description":"Alicemare is a somehow familiar yet totally unique adventure game with strong horror leanings, created by △○□× (Miwashiba) using the WOLF RPG Editor.~STORY~\nAllen is a young boy who has lost his memory.\nBereaved by the loss of his mother and father, he eventually ends up at a home for lost children.\nOne day, he sets out to investigate a rumor heard from the other children. This is where Allen’s story really begins...~WHAT KIND OF A GAME?~\nAlicemare is an adventure game blending elements of exploration, storybooks and fairytales, and just a hint of horror.\nThose with an aversion to horror need not worry; this title only includes subtle touches of the genre here and there.\nThere are no survival-horror elements to the gameplay nor the story, and you can rest assured that the only thing keeping you up at night will be your enjoyment of the game.~CHARACTERS~◆Allen\nA young boy who has tragically lost both his memory and his parents.\nHe likes books and newspapers.\n◆Letty & Rick\nLetty is a young girl with a bright and energetic personality.\nRick, her twin, is a boy who looks exactly like Letty.\n◆Chelsy\nA shy little girl.\nChelsy loves her teddy bears.\n◆Joshua\nA mischievous young boy who likes to cause trouble.\nJoshua is currently obsessed with frogs.\n◆Stella\nA curious little girl with an unreadable face.\nStella is always thinking to herself silently.\n◆Teacher\nA male teacher at the children’s home where Allen lives.\nHe is searching for something―but what, and why...?\n◆White Rabbit\nThe White Rabbit technically fills the role of Allen’s guide.\nHowever, he seems to have little interest in actually “guiding”.\n◆Cheshire Cat\nThe Cheshire Cat is another character who guides Allen along on his journey.\nHe has the ability to appear and disappear at will, and is characterized by his very peculiar manner of speaking.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"△○□×","platforms":[{"id":0,"name":"PC"}]},{"id":11723,"name":"Windscape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be4/be4a4fa13c9ee3b4a3b382497990514b.jpg","description":"Hi, my name is Dennis and I am the creator of Windscape, a first-person exploration adventure. Instead of just letting you read a boring game description, please allow me to share my vision of the game I am creating. Hopefully you will like what I am working on.\nEver since my childhood I was a huge fan of the Zelda series of games, Golden Axe Warrior, Secret of Mana and games in which let you explore a vivid world without time pressures and a too restrictive storyline. Over the past year and a half I’ve been working on my vision of a modern exploration adventure, combining it with my fondness for modern crafting and sandbox games.\nIn Windscape you play as a young girl living on your parents’ farm, set in a lovely world made up of floating islands in the sky. As you discover the world you learn that something has gone terribly wrong -  islands are breaking apart and falling from the sky! It’s up to you to discover the evil that is threatening the universe of Windscape.\nAs you travel the world(s) you will gather valuable resources allowing you to craft a plethora of items such as weapons, shields, potions, magical spells and much more. Some items will be just for fun while others are a necessity for your survival.\n\nYou will meet peaceful NPCs and vicious monsters both on the surface of each island as well as in the dungeons and lairs you uncover along your journey. While I want the islands to work in a non-linear manner, I have decided to make the dungeons more puzzle and combat driven - each with its own style and atmosphere.\nWindscape will feature tactical fights against larger bosses such as ghosts, ogres and dragons. Of course, there are many valuable items to loot too.\nWhat I don't want Windscape to be? A stats-driven RPG, a terraforming sandbox game or a first-person action game. This is why I am asking for your support. I’m building this game for the community and hopefully with the community. I feel your feedback is really needed to match my vision with the high standards you, the players, demand. Because of this I have chosen to go into Early Access, hoping to make great friends and build a community which shares my vision and aids me on my development quest…\nKey elements of Windscape\nOne of my very first decisions was that I wanted the world to feel like a living and breathing environment. While I could have employed procedural world generation, as so many other games do these days, I have decided against this so I can flesh out the most beautiful corners of the world in detail. While this means that sadly there will be a point when “you have seen it all”, I still feel very comfortable with my decision as it allows me to put you right into the world we’re building, with places to remember and stories to tell.\nI already have the game’s universe mapped in my head but I also want the game to go where the community’s input takes it too. For the final game I am planning for at least four very different maps, and I’ll appreciate the support on choosing the most fitting ones. The game starts on a pastoral island with peaceful nature, a flourishing little village, a water mill and many more idyllic spots to discover. Over the next few months I am looking forward to revealing more scenery and gathering valuable feedback from the players to help me make the next big decisions.\nWhy always a boy? I hope you will come to love Ida as much as she has grown on me during the game’s development. Sent out by her parents into the small neighborhood town to make a delivery, Ida is yet unaware that soon the fate of the world will be resting solely upon her shoulders…\nI have created a resource and crafting system which is intuitive to use but allows many things to be made. Basically you will find different crafting stations at key places all over the islands, each enabling you to build different things if you have gathered the resources needed. You can cook healthy or just yummy food, craft sweeping shields and weapons, mix mysterious ingredients to create powerful magic potions, melt iron and copper into new forms of metal and much, much more.\nI want the dungeons to be an enthralling deviation of the more open exploration and story driven game that takes place on the islands surface. The first big dungeon you will encounter is a copper mine infested with rat-like enemies. Here you will also encounter the first bigger boss monster - with a great reward waiting for you if you make it out alive. Some dungeons will be an incremental part of the story while many others and smaller caves are hidden in the world for you to just discover.\nI hope you like my ideas of Windscape. Together we can all create a game which lives up to the vision I have set forth. Thank you for your support!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Magic Sandbox","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":10968,"name":"Formicide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d50/d5083adcbabfb78ca2ad519035bf4e46.jpg","description":"\"Formicide could be a massive hit.\" -@TheRealIndie\nFormicide is a fast-paced 2D online platformer with a lineup of versatile classes. Think Worms meets Team Fortress 2. Face off with teammates against enemies in destructible environments with the weapons and abilities at your disposal.Features Online multiplayer - Blow up ants anywhere in the world.\nDrop-in, drop-out servers - Join an in-progress game any time that's convenient for you.\nTeam based objectives - Control point beacons with your team to win the match.\nClasses with varied playstyles - 8 playable classes. Play as a tough soldier, a cloaking hunter, a turret-building engineer, and more.\nChoosable ultimate abilities - Customize your class' ultimate ability, giving multiple playstyles to each class.\nHigh skill ceiling - Easy to learn, difficult to master.\nShort matches - Matches are 5-10 minutes, convenient for the lifestyle of the modern ant on the go.\nRandom events - Collect powerups to give your team an advantage. Make bombs rain from the sky, unleash a swarm of enemy-seeking hunter worms, and others.\nUnique environments - 7 playable maps. Swelter in the desert sun, climb through snowy mountains, or hold your breath with your tiny ant lungs to dive into a coral reef.\nDestructible terrain - Demolish a path through the ground towards your enemies, or create barricades of dirt for protection.\nHost your own server - Host your own Formicide dedicated server, either public or private.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rock Wall Games","platforms":[{"id":0,"name":"PC"}]},{"id":5656,"name":"Skylanders Giants","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49c/49c8a4a38db547caa775de8448643cd7.jpg","description":"Bring the Skylanders to life! ™\n\nFROZEN IN OUR WORLD. ALIVE IN THEIRS. Thousands of years ago, the Skylanders Giants fought epic battles in Skylands, but were banished to Earth. With a new threat looming, it's time to bring them back to join forces with the Skylanders. Only you can put them on the Portal of Power® to unleash their strength in the ultimate battle to save Skylands.\nStart your Giant Adventure Today!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"}]},{"id":3523,"name":"The Hungry Horde","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Lead a horde of zombies on a manic mission to expand the ranks of the undead and destroy humanity. Battle the clock and attempt to trash the planet in this highly addictive, run-till-you-die zombie rampage – one game and you’ll be “turned”!\n\n•\tChase, corner and infect humans to grow your horde and stop it being nuked by the military.\n•\tHerd through a variety of locations, causing damage and grabbing brains to power up your horde’s human-chomping abilities.\n•\tSplit your horde in two to mop up survivors, overcome obstacles and activate switches.\n•\tTackle a series of entertaining zombie-themed mini-games and unlock loads of bonus features.\n1 player(s)\n100KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n©2014 Sony Computer Entertainment Europe.  The Hungry Horde is a trademark of Sony Computer Entertainment Europe.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":828,"name":"Coldfire Keep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/158/15839ee6ca29f70f7a1fcea6f74b37d4.jpeg","description":"An ancient power lies hidden, deep within Coldfire Keep, threatening the peaceful town of Newsettle.\nNow four friends must take it upon themselves to become heroes, and venture into the depths on a quest to secure their town's future.\nColdfire Keep is a traditional, old-school dungeon crawler, lovingly hand-crafted for fans of the genre. Featuring grid-based movement, and active turn-based combat, Coldfire Keep draws inspiration from classic late 80's and early 90's dungeon crawling adventures.\nGorgeous 3D environments.\nA massive dungeon to explore.\nMonsters, loot, puzzles, and hidden secrets!\nMultiple control methods.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Crescent Moon Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":964791,"name":"Like a Dragon Gaiden: The Man Who Erased His Name","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c1/0c10aa5a41d64c0bb6ca9fe30173488d.jpg","description":"Feature Listhttps://store.steampowered.com/app/2072450/Like_a_Dragon_Infinite_Wealth/\nDigital Deluxe Edition\nAbout the GameDELUXE EDITION INCLUDES:Like a Dragon Gaiden: The Man Who Erased His Name\nLegendary Fighter Pack\nFloating in the bay, away from the prying eyes of the public, is a mysterious container ship known as the Castle. At its center lies the Coliseum, and three legendary yakuza have entered the battle arena as playable characters.\nEnter the Coliseum and play as or alongside:\nGoro Majima – The Mad Dog of Shimano\nTaiga Saejima – The Slayer of Eighteen\nDaigo Dojima – 6th Chairman of the Tojo Clan\nClaim victory with these allies in the ultimate showdown!\nERASE YOUR PAST TO PROTECT YOUR FUTURE\nOnce a legendary yakuza, Kazuma Kiryu faked his own death and abandoned his name for the sake of protecting his family. Now, he is thrust into conflict by a mysterious figure attempting to drive him out of hiding.\nUnder the codename “Joryu,” Kiryu embarks on a gripping action narrative with bone-shattering combat in vibrant locations filled with exciting characters and activities.\nULTIMATE COMBAT WITH TWO HIGH-IMPACT FIGHTING STYLES\nDynamically switch between the Yakuza and Agent fighting styles in visceral melee combat.\nWith the Yakuza style, strike fear into enemies by unleashing wildly aggressive moves powered by Kiryu’s unparalleled strength and flair.\nOr up the ante with the Agent style by delivering blows with absolute speed and precision, while using an array of high-tech gadgets like electrified bind wires to stun enemies then send them flying.\nStrategically adapt to the situation and leverage both styles to dominate and destroy hordes of enemies.\nENDLESS ENTERTAINMENT\nWhether you're brawling in the secret Battle arena, singing a new karaoke song, enjoying a drink at the live-action cabaret club, or racing in the pocket circuit, the world offers a variety of immersive experiences.\nAn intriguing informant named Akame also provides thrilling sub-missions, drawing you into an epic showdown that unfolds the more you explore and enjoy Sotenbori and Yokohama.\nLIKE A DRAGON: INFINITE WEALTH SPECIAL TRIAL VERSION ALSO INCLUDED!\nAfter completing Like a Dragon Gaiden: The Man Who Erased His Name game, a Like a Dragon: Infinite Wealth Special Trial Version will be unlocked for you to enjoy!\nThis game may be updated over time and have paid for and free additional content released for it. Please be aware that this may increase the minimum requirements for running the game above the specification stated here\nEnglish voice will be implemented in a post-launch patch distribution","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":630693,"name":"Fears to Fathom - Home Alone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b19/b198e89c8b494ff8d9231189da5edaa9.jpg","description":"Fears to Fathom is an episodic psychological horror game where each episode unveils a short story narrated by the ones who survived.\nThe first episode of Fears to Fathom is free to play, more episodes are coming soon.Fears to Fathom : Home AloneIn the first episode of Fears to Fathom you play as Miles, a 14 years old kid who is home alone while his parents are out of town for work. He soon finds himself in trouble as the story unfolds, would he make it through the night?\nHe survived as he made the right choices.Key FeaturesAtmospheric environment and photo-realistic graphics.\nVHS film aesthetic.\nReceive texts from NPCs.\nPlayer voice activity.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rayll","platforms":[{"id":0,"name":"PC"}]},{"id":581085,"name":"Resident Evil Re:Verse Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad9/ad90cfa0aadf17bfc8aecb2b1d280d91.jpg","description":"This open beta test is available to all! Beloved Resident Evil characters clash in a fight to the death! Test your skills against other players in six-person deathmatch battles.\nBut don't forget the terrifying bioweapons! You'll need to master the skills of the heroes and bioweapons alike if you want to claw your way to victory!\nAvailability period:\n4/7 23:00 - 4/10 22:59 (PDT)\nNote: Capcom ID registration required. Availability period subject to change without notice. Please check the official website for further details.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"PC"}]},{"id":428109,"name":"Yu Escape / Monday","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afe/afe83295713ba930a85a39c541e9de5d.jpg","description":"Featured DLC\nAbout the GameYu's new girlfriend, Shi, is a very passionate Escape Room designer and our plucky protagonist has found himself the guinea pig for her latest elaborate entrapping contraption!\nWill Yu be able to outwit Shi's challenges to escape to the sexy prize hidden at the end?\nFUNKY, SEXY, FUN- It's okay to be here for the boobs. Boobs are cool.\nSOLVE BRAIN-BENDING PUZZLES- Dreamed up deranged madmen. (Us.)\nCHUCKLE SENSIBLY- Quirky, comedic, writing that only partially relies on puns.\nBASK IN VICTORY- If you're clever enough, that is.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Team Tailnut","platforms":[{"id":0,"name":"PC"}]},{"id":311743,"name":"Shattered - Tale of the Forgotten King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f60/f6033f9760fe1317747d15bed66bf4b2.jpg","description":"Put on the Wanderer's coat and explore strange worlds adrift within the void. Retrace the fall of an entire civilization through the testimonies of its rare survivors in Shattered - Tale of the Forgotten King, an adventure game mixing exploration and boss fight.Between dreamy exploration and epic battlesIn the world of Hypnos, a wide continent scattered with huge fortresses and cities in ruins is yours to roam. Switch between 2.5D and 3D phases and dive into the story of a forgotten universe where fierce opponents await. To reach victory, precision in your movements and observation of your enemies will be vital. Are you ready, Wanderer?Features:\t12 zones to explore: A semi-open world in which you can walk several paths. You can choose the one that suits you. Or choose to discover new ones.\n5 bosses to fight: Observe them and learn to anticipate their moves. The timing of your assaults and parries will be crucial to your victory.\nConstant progression: May it be by crushing enemies or discovering new areas, you'll have the possibility of making the Wanderer evolve. Will you choose to level up, buy new equipment or purchase more lore items to learn everything about Hypnos?\nChoices and consequences: Each NPC follows their own trajectory, impacted by their encounters with you, as well as your actions. You'll have a direct influence over their personal quests, that can then end in good or bad ways.\nCustomize the Wanderer: more than 20 glyphs available to modify your character's features.\n« I had travelled through forgotten paths for days, weeks and months to reach the Thousand-Door Palace. A place where only silence reigned now. Where the wind had stopped and the tides retreated with the Great Rift. The great Departure.\nAnd here stood before me this towering beauty of onyx and obsidian - the divine home where once echoed every whisper of the world. So vast that the greatest city of any kingdom would only be an anteroom in comparison. Peculiar green lights shone from inside the building, pulsating though the circular openings in the floating columns. The lost reverberations of an empty throne...\nAnd here I was, bathed in my mist of past and future memories, standing in this mythical place that remained, still. The only location anyone in Hypnos could have found with no map or compass back when the King still reigned.\nAnd I Remember the Silence In My Soul.\nThe Bitter Raindrops In the Wind. »","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Redlock Studio","platforms":[{"id":0,"name":"PC"}]}]