[{"id":12720,"name":"Teeworlds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed3/ed334c8c5cdb92cf0c9dae4d5c1cebb5.jpg","description":"Play together with your friends and have a fun time! In Teeworlds you can play in three gamemodes (Deathmatch, Team-Deathmatch and Capture The Flag) and tons more of community-made modifications with up to 16 players!\nCustomize your own player character, your personal tee, to your liking. With hundreds of possible combinations, you will always look unique!\nTeeworlds is a game that gives you a lot of freedom and plenty of gameplay mechanics to use or abuse. With a full focus on multiplayer games you will never be bored.\nAnd the best thing: It's open-source! Anyone can help to develop this game, create new game types, skins or brand new maps via the built-in map editor!\nKey Features:\nEasy to learn, hard to master. You will never stop learning new tricks while playing Teeworlds, no matter how long you play. At the same time it's easy for new players to just pick it up and have a blast.\nEngaging and motivated community. Teeworlds' one-of-a-kind community is the thing keeping the game alive. Be it the community servers or maps or all the other innovative content.\nPlay with your friends for free. Teeworlds has been free since the very start and will stay that way forever. With up to 16 players in a match, challenge your friends - the fun is only a mouseclick away!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Teeworlds Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11193,"name":"Brigador","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb3/eb378e6c0f8677cb3b0e6e6f6deea40c.jpg","description":"Brigador relaunches in 2017 with expanded introductory missions, localization, easier difficulty and revised controls, plus improved lighting effects, mechanics, and more.Here is your contractBrigador is an isometric roguelite of intense tactical combat. Play as mercenary pilots betraying their planet, looking for the big payout and a ticket off this planet. Everything you destroy earns the pilots money that can be used to unlock even more destructive vehicles, guns, and challenges.  Find the right load out for your playstyle and wreak havoc on the city of Solo Nobre.Escape off-world with your money or die trying\n\n\nFeaturesUnlock 56 different mechs, tanks, hovercraft, with 40 different weapons\n100% destructible environments\nExpanded 37 mission Campaign Mode with continuing developer support\nExpanded and updated 20+ map Freelance mode with variable difficulty and challenge for all skill levels\nDeep and engaging dark science fiction universe and lore\nOriginal soundtrack by Makeup & Vanity Set, over 2 hours of acclaimed synth music","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stellar Jockeys","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":30243,"name":"Deus Ex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fcf/fcf5ec8a73501581282796e4fa1b5cff.jpg","description":"The year is 2052 and the world is a dangerous and chaotic place. Terrorists operate openly - killing thousands; drugs, disease and pollution kill even more. The world's economies are close to collapse and the gap between the insanely wealthy and the desperately poor grows ever wider. Worst of all, an ages old conspiracy bent on world domination has decided that the time is right to emerge from the shadows and take control.\n\nKey Features:\n\nReal role-playing from an immersive 3D, first-person perspective. The game includes action, character interaction and problem solving.\n\nRealistic, recognizable locations. Many of the locations are built from actual blueprints of real places set in a near future scenario.\n\nA game filled with people rather than monsters. This creates empathy with the game characters and enhances the realism of the game world.\n    \nRich character development systems: Skills, augmentations, weapon and item selections and multiple solutions to problems ensure that no two players will end the game with similar characters.\n    \nMultiple solutions to problems and character development choices ensure a varied game experience. Talk, fight or use skills to get past obstacles as the game adapts itself to your style of play.\n    \nStrong storyline: Built on \"real\" conspiracy theories, current events and expected advancements in technology. If it's in the game, someone, somewhere believes","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Ion Storm","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":349557,"name":"Frog Detective 2: The Case of the Invisible Wizard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/391/39144a839bdffe98e6b9f103e1ad014e.jpeg","description":"☆★☆★ ...something debatably wicked this way comes... ★☆★☆\n☻ 1.5 hour estimated completion time ☻\nThe famed Frog Detective returns in the most thrilling mystery yet! A town’s welcoming celebration for a mysterious Invisible Wizard has been ripped to shreds by an unknown culprit. The Detective must find out “whodunnit”!\nThe Case of the Invisible Wizard is the second game in the Frog Detective series, following The Haunted Island, which was loved by all.*\n*(Except for one user on steam who called it “a middle finger and a waste of $5”, but we can’t win em all.)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Thomas Bowker","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18743,"name":"Desperados: Wanted Dead or Alive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a8/9a8dc92a19d11e944a0a0ac256d089a6.jpg","description":"\"Desperados: Wanted Dead or Alive\" is the first strategy game ever to combine a movie-based and story-driven atmosphere of an adventure game with the intellectual challenge of a real time tactic game.\nIn this western-style title, discover a game of strategy and tactics played out in exceptional real time. You're in charge of a team of 6 mercenaries and must find a way to complete your missions, be it infiltrating an enemy fortress, saving a team member or escaping an ambush... Combine the different skills of your 6 heroes to lead them to victory.The StoryEl Paso, a typical Wild West town in the southwestern United States near the Mexican border. It is the year 1881. For the last few months, the trains belonging to the famous railroad company, Twinnings & Co have been the target of a whole series of hold-ups and ambushes. The management of the company has decided enough is enough and they have to put an end to the raids. It has offered a reward of $15,000 for anyone who captures the leader of the gang responsible.\nBut no one in and around El Paso has the courage to take on the might of the bandidos, so the outlaws just keep on robbing train after train. Even the local Marshal is keeping well out of it.\nIt’s only when a stranger rides into town that things start to change. Bounty hunter John Cooper pays a visit to the local Twinnings & Co manager offering to end the railroad company’s problems once and for all. He gathers together a gang of his old partners and declares war on the bandidos. But during his pursuit, which will take him through half of the southwestern United States, Cooper soon discovers that on this mission nothing is quite what it seems...Key FeaturesMore than 20 enemies with different profiles, from the lazy and cowardly bandit, to the fearsome mercenary.\nA team of 6 characters, each with their own very distinct characteristics, to manage in real time.\n25 different levels provide nail-biting intrigue, with cinematic transition scenes and landscapes that will take your breath away. Amazing artificial intelligence!\nEach enemy is ranked on 10 different criteria, including intelligence, courage, marksmanship, resistance to alcohol, etc.\nAn array of different settings: day-time, night-time, storms, dusk, villages, ghost towns, fortresses, gold mines, saloons, prisons, boats 6 training levels to allow the player to really get into the story","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Spellbound Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16426,"name":"Post Mortem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/206/206aa0c96fe92c8aee4836233d356d87.jpg","description":"STEP INTO A PURE THRILLER IN WHICH NOTHING IS WHAT IT SEEMS!\n\nAfter returning to the quiet streets of Paris to pursue a life of painting, Gus Macpherson could not escape his true art…\n\nThe former New York detective finds himself walking the beat once again, when hired by a sensuous woman to investigate the gruesome beheadings of her sister and brother-in-law. In the dark and mysterious streets of Paris and plagued by his clairvoyant sixth sense, Gus will uncover a conspiracy written in blood, with rituals and artifacts as old as time itself.\nKey features:\t\t\t\t\t\tStunningly beautiful 360° panoramic views\nRich and intriguing characters\nDetailed, realistic environment\nMultiple game paths integrated into the story\nOriginal and creative puzzles\nPrequel to Still Life adventure game\n","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]},{"id":14638,"name":"Destiny Warriors RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e19/e195e5d651d6f1eb386cf732b172d42c.jpg","description":"Destiny Warriors is an epic 12 hour JRPG.\nThirteen years ago, your village's leader set off to confront the spirit beasts that threatened to invade and destroy your home.\nAmong these spirit beasts was a fire dragon that burned everything to ashes, a sea serpent with great healing abilities and a lightning bird that could attack faster than light itself.  While the village leader was a powerful warrior, trained in both hand-to-hand combat and magic, he could not overpower them.\nUltimately, he had no choice but to sacrifice his own life by casting a powerful sealing spell on the beasts.  This trapped the beasts in the souls of three human children.  Unfortunately no one in the village, including the children themselves, knew which children's souls contained the trapped spirit beasts.\nThirteen years later, as you enter the village's elite warrior academy, the spirit beasts have become restless and threaten to break free from their hosts.  As student after student goes missing, it's up to you and three friends to abandon your training and set out into the unknown world.  Use magic, might, and cunning in order to find the missing students and defeat the spirit beasts in this amazing JRPG.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ninjalex","platforms":[{"id":0,"name":"PC"}]},{"id":3454,"name":"Splice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/170/1709a6b79200633a055bd5842efe9702.jpg","description":"Splice is an indie puzzle game developed by Cipher Prime. It is no longer available in the Google Play Store, yet it is possible to purchase it on other platforms.\n\n###Gameplay\nThere is no plot present in the game.\n\nThe game's core mechanics center around creating new structures from the disassembled cells. The players have a limited number of moves, also known as splices, to create a new required structure. The main objective of the game is to create the structure with as few splices possible. \n\nThere are 77 levels present in the game offering a wide range of power-up cells and special abilities. For example, there is a specific type of cells that destroy both themselves and their children which can be used to reach other cells or destroy an obstacle. There is also a particular type of cells, that is compatible with every cell of the level and links them together. It is essential for the players to remember the types of cells available to them and to make use of everything present in the game. \n\n###Soundtrack\nThe game's soundtrack was recorded by the Cipher Prime's co-creator. Only eight tracks got released to the general public free of charge. This soundtrack consists of seven music tracks that got used in the game's first levels and one from its epilogue.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cipher Prime Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":151232,"name":"Eliza","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/edc/edc4b653284260cc551fce181b010cc1.jpg","description":"Eliza is a visual novel about an AI counseling program, the people who develop it, and the people who use it. Follow Evelyn Ishino-Aubrey as she reconnects with people from her past, gets to know the people of Seattle who use Eliza for counseling, and decides the course of her future.\nAfter abandoning her high-powered tech career and a mysterious three-year absence, Evelyn Ishino-Aubrey resurfaces working as a proxy for a virtual counseling app called Eliza. Her job consists solely of reading a script provided to her in real-time by an AI, leaving her no autonomy over what she says. Is Eliza a technological marvel that brings therapy to those who otherwise couldn’t access it? Or is it an ineffective replacement and another vector for technology companies to gain control over our lives and humanity?\nAs she reconnects with people from her past and gets to know the ordinary people of Seattle who use Eliza for counseling, Evelyn finds herself caught in the middle between differing sides of the argument— and as she begins to question everything about her past life and future purpose in the world, it becomes clear she must confront the turmoil and darkness inside.\nA thought-provoking story told in the form of a visual novel from an award-winning indie team.\nFollow Evelyn’s journey through a present-day Seattle brought to life with beautiful hand-painted art.\nGet to know Eliza’s clients and the employees of Skandha, the technology giant behind it, with over a dozen fully-voiced characters and powerful performances from a highly regarded cast.\nAn evocative, ambient original score by the composer for Infinifactory, SHENZHEN I/O, Opus Magnum, and EXAPUNKS.\nIs AI-driven counseling better than nothing? Is it worse than nothing? What responsibilities come with technical skills? Consider your own answers to these questions and more.\nCounseling sessions getting a little too real? Relax with Kabufuda Solitaire, a new take on solitaire using Japanese kabufuda cards.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Zachtronics","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":61153,"name":"Paratopic","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/596/596d821b3c0cd01b27773f07b99ff737.jpg","description":"You got caught smuggling VHS tapes across the border, and now there's hell to pay. You want to find an elusive rare bird in the forest and snap its picture. You have to kill a man in the back room of a shady diner.\nThis is Paratopic, an experimental first-person horror game, one of the best-rated horror titles on itch, and one of Rock, Paper, Shotgun's best games of 2018.\nA narrative, horror tinged adventure game that takes you on a journey through a cruel fever dream world.\nCutting between numerous detailed and varied vignettes, unravel how the stories of three separate characters intersect.\nExplore the detritus of forbidden industry, kill, drive through the night, find yourself in conversation with some very off-kilter individuals.\nA leisurely playthrough should take forty five minutes give or take, with plenty more to discover in the detailed, grimey low polygon environments. Or speedrun it, if you'd prefer.\nOver an hour of gorgeous dark ambient music is used to create our subtly dynamic soundscape. An anachronistic blend of modern and outdated production as glitches and textural pads meet synthesis & sampling akin to a haunted recollection of 90s Unreal Engine soundtracks.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Arbitrary Metric","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":23011,"name":"Europa Universalis II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10e/10e4cab49b0e3131e20afe4ea5676519.jpg","description":"Europa Universalis II invites you to a global struggle for supremacy from the dark times of Jeanne D'Arc to the flaming wars of Napoleon. As the leader of a country you have to guide domestic and foreign policies. Engage in religious struggles, set up expeditions to claim the New World, lead your country to prosperity and victory. Send your Privateers to roam the seven seas, muster mercenaries to bolster your defences, and send missionaries to convert infidels to your State Religion.\nInteract with true historical events and persons to determine which path your nation will take in the game. The new game includes an elaborate and expanded system for diplomacy, trade, military might and development. It also includes new graphics, music, sound, manual and a new tutorial system to lower the learning curve.The possibility to demand or offer any combination of provinces, gold and diplomatic agreements as a result of peace.\nEuropa Universalis II expands history's greatest cause of war \"Religion\", introducing Hinduism, Confucianism and Buddhism. Cultural groups based on linguistic differences between peoples have also been introduced to portrait the difficulty with which one controls the subjects of another culture during different time periods.\nA brand new event engine that produces historical, random and special events. The event engine is designed to let the player create his own events making it very fun to build scenarios. Many of the events have multiple choices.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":59115,"name":"Ultimate Custom Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3a9/3a9fdc609e11dc8cb953fbfff7e4a128.jpg","description":"Welcome to the ultimate Five Nights at Freddy's mashup, where you will once again be trapped alone in an office fending off killer animatronics! Featuring 50 selectable animatronic characters spanning seven Five Nights at Freddy's games, the options for customization are nearly endless. Mix and match any assortment of characters that you like, set their difficulty from 0-20, then jump right into the action! From your office desk, you will need to manage two side doors, two vents, as well as two air hoses, all of which lead directly into your office.\nThis time you will have to master other tools as well if you want to complete the ultimate challenges, tools such as the heater, A/C, a global music box, a power generator, and more. As if all of that weren't enough, you'll also need to set up laser traps in the vents, collect Faz-Coins, purchase items from the prize counter, and as always, keep a close eye on not one, but two, Pirate Cove curtains!\nOther features include:\n- Challenge menu including sixteen themed challenges.\n- Voice acting from returning favorites as well as from new arrivals to the franchise!\n- Unlockable office skins!\n- Unlockable cutscenes!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":21503,"name":"Cobi Treasure Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/876/87644f649b5adaced9ea431de4e359b9.jpg","description":"Cobi Treasure Deluxe is a 3-in-a-row puzzle game.  \n\n###Gameplay \nIn Cobi Treasure Deluxe you have to help Sally the seahorse collect and match ocean treasures. The game has three game modes: Classic, Ship Shape and Sally’s Shape.\nEach of them revolves around cleaning the playfield from gems of different shapes and colors falling from the top of the screen. To do so, you have to match three or more of them. The more gems you match at the same time, the more points you get. The player can control the game with mouse or arrow keys. Moving mouse horizontally or pressing left and right keys position the falling gems, clicking left mouse button or pressing up rotates them and right mouse button or down critical speeds up the rate of fall. There are several types of unique gems that affect the playfield one way or another.\nFor example, Oily Glooper spreads to any adjacent gems turning them into Oily Gems that can only be cleared by Danger Gems. The Classic game mode consists of 75 levels in which you have to score a certain amount of points. Ship Shape is an endless mode where the water gradually fills the screen.\nMatching gems makes waterline go down. In Sally’s Shape, you have to clear Puzzle Shapes before the timer runs out. The game has a trophy system which awards the player for completing different challenges and registers the player’s high scores.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"PC"}]},{"id":10826,"name":"Blood and Bacon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/635/635e6d2d85748197f39212addb4f200b.jpg","description":"Josh of When Evil Calls  -  End Credits Metal Music !! Please Check Out - When Evil Calls\nUp To 6 Player CO-OPPlay Up To 6 Player CO-OP with your friends, or just random people. Now featuring Horde Mode where you can play with 6 players and unlock new characters.  So far in 1 month we have added many mini updates, a total of 6 characters, added in 2 new weapons, the beloved paintball gun with 4 colors, more achievements and LeaderBoards.\nAbout the GameAll You Need is Blood and Bacon\nBlood And Bacon is a Multiplayer (Up To 6P) FPS that pits heavily armed players against undead deadstock as you attempt to butcher your way through 100+ levels of insanity and twitching gristle. Day and night levels, players will take on 25 enemy types and numerous bosses, like the gargantuan monster affectionately named, ‘Princess Blubbergut’ and Minibosses every 10 days as you explore, shoot and run for your life against the onslaught of porcine monstrosities. The game creatively dispenses pickups through a meat grinder, from the very creatures you are killing. Ammo boxes, Adrenaline, Grenades, Rockets, and other exotic boosters. Boasting over 15+ hours of gameplay and the ability to battle a staggering (or shambling) 500+ undead creatures at once, \"Blood and Bacon\" looks to feature more barnyard excitement than you can shake Old MacDonald’s severed femur at !!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BIG","platforms":[{"id":0,"name":"PC"}]},{"id":4183,"name":"F1 RACE STARS","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d5/3d50c74e2ed07e739bf95f0761598281.jpg","description":"F1 Race Stars is a parody of a Formula One simulation. It renders the F1 racers as wacky characters and their cars as karts.\n\n###Style\nThe game features drivers, teams, and races from the 2012 season of Formula One. However, unlike most simulators, which aim to represent the races realistically, F1 Race Stars is a humorous arcade game. The racers, such as Sebastian Vettel, Michael Schumacher, Fernando Alonso, and Lewis Hamilton, are depicted as cartoonish versions of themselves. \n\n###Tracks\nThere's a total of eleven tracks based on the real Formula One circuits. They retained their basic configurations but were enhanced with springboards, loops, traps, and other unrealistic features. The circuits' backgrounds also became comical representations of a country where the race is set in.\n\n###Gameplay\nAlthough the game is a kart simulation, F1 Race Stars doesn't imitate the actual karting, either. It provides a fictional combination of karting and Formula driving experiences. The cars in the game cannot drift and slide. Instead, the game uses the real-world KERS system to give the car a boost when exiting the corner. The game features power-up in the vein of Super Mario Kart, and some of them are parodies of the actual Formula One elements, such as a safety car. Each team in F1 Race Stars also has a special ability, such as shooting at the opponents for Ferrari or a free boost for Red Bull.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":532168,"name":"Century: Age of Ashes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c42/c429ec19f54baabd45941fcd8a4a95b7.jpg","description":"Century: Age of Ashes, the multiplayer dragon battle game is now available for free! Customize your dragon, dive into the arena and compete to become a legendary Dragoneer. Burn your enemies and rule the skies!\n\n\n\n\nCompete in intense online games and discover the fast-paced gameplay of Century : Age of Ashes! Dive into the arena alone or with friends and fight for your survival! Three varied game modes ranging from 3v3 to 6v6v6 await you: Carnage, Survival and Raid.\n\nCarnage: A 6v6 killing spree with special power ups appearing in the arena to unleash hell on your opponents. It’s Team Deathmatch, Dragon riders style!\nSurvival: A Last Team Standing mode where up to 18 players divide into 3 teams (6v6v6). Respawn is limited and can only be done through ally rescue!\nRaid: A unique mode in which two teams clash over possession of the flag. Gain points by flying through special gates around the arena while holding the flag!\n\n\nExperience different play styles with 3 unique classes, each with their own abilities! Shield and disorient as the Windguard, track and destroy as the Marauder, or stealth and trap as the Phantom. How will you choose your path to victory? Additional classes are planned throughout development.\n\n\nYour dragon, your style! Century: Age of Ashes offers carefully designed cosmetic items to stand out in the arena. Gain experience as you play and unlock awesome skins to customize your dragon and its rider! Don't worry, these items are purely cosmetic and offer no advantage in battle.\n\n\nCentury: Age of Ashes is completely free-to-play. In order to keep the experience fair and equitable, in-game purchases are purely cosmetic. Battles are won by skill and teamwork alone.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Playwing","platforms":[{"id":0,"name":"PC"}]},{"id":455515,"name":"Just Die Already","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/415/415121d3fd31e0f6103ad11acab5eff6.jpg","description":"Just Die Already is an old people mayhem sandbox game created by the designers of Goat Simulator.\nYou are an old retired person in a near future where people aren’t having any children. There isn’t anyone to pay for pensions due to those ungrateful millennials who prefer playing video games instead of doing actual work. With no one to cover your living costs, you - just like all other old people in this world - have no other choice but to survive on your own.\nHow will you survive in a world that wants you to Just Die Already?\nTo make things worse, you’ve just been kicked out of your retirement home, and your only option now is to perform dangerous challenges and explore the world for retirement tickets to qualify for free retirement care.\nSo with society wishing you dead, isn’t it finally time to live a little?\nKEY FEATURES\nBE OLD, BE BOLD\nYou get to be an old person. Angry, fragile, poor and hating the world: the dream you didn’t know you had until now. Finally, you have found something in common with your grandparents.\nBREAK A LEG... BREAK A NECK\nDiscover the joys of being old and made of glass, anything can break you and you can break your everything.\nDON’T TRY THIS AT (RETIREMENT) HOME\nComplete dangerous challenges that you will never ever try at home and answer existential questions like: can you launch yourself from a catapult and land on someone? Or, can you survive losing your head, grabbing it and whacking someone with it?\nONE MISSION: RETIRE!\nEarn rewards by completing dangerous challenges, your goal? To qualify for a proper retirement home. That makes perfect sense. Word of advice: try and stay in one piece so you can enjoy it in the end…\nSANDBOX MULTIPLAYER\nPlay alone, or with up to 4 players in online multiplayer. Complete challenges together, or just cause mayhem and rip your friends’ limbs off!\nBE OLD. TWICE\nYou get to be an old person. So good we said it twice.\nLIMITLESS INTERACTION\nPick up and interact with a very wide variety of objects. Everything from giant trouts, trampolines, guns, electrical wiring, and fireworks, just to mention a few. Bazookas, axes, trombones, air horns and jetpacks to mention a few more. Yes they all can be used to hurt and maim.\nEMBRACE YOUR INNER BOOMER\nWreak havoc on the millennial and zoomer population (we forgot Generation X, just like everyone else). NPCs react differently depending on their age - some will laugh and clap at others getting hurt while others will run away in terror.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"DoubleMoose","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":319132,"name":"Project Wingman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28a/28a5010a07b9104a91c6de5059a7fe69.jpg","description":"Project Wingman is a combat flight action game with an emphasis on polished and refined gameplay, true-to-its-roots inspirations, and an engaging single player experience. Perfect for those who aren't looking for a simulator experience with the ease of pick up and play, all the way to those who want a fast-paced challenging flight action game.\nDogfight, strike, and fly through combat zones based off an alternate history of Earth. Either over the cold waters of the Bering Strait, attacking tanks in the brutal deserts of the Orient, or diving through the Red Woods to strike targets of opportunity in the Pacific North West, across the oceans, above the scarred lands of the world, this war will take you from exotic battlefield to exotic battlefield, all while going up against odds way above your pay grade.\nPure Combat Flight Action\nExotic weaponries such as railguns and geothermal-powered armaments will be ready to pluck you out of the sky if you're careless. Whether you are an attack aircraft pilot, skimming the ground with a gatling gun and rocket launchers attached to your wing, or an interceptor with long range, almost sniper-like missiles at your disposal, it will be up to you to prove yourself as an Ace pilot.\nConquest Mode\nIn Conquest Mode, fight in an uphill battle against various bosses and ace squadrons in a territory capture game, drawing elements from roguelikes and RPGs. Players will have to earn enough money to not only upgrade their own plane, but build a mercenary army of their own in order to take on waves of increasingly difficult opposition as they struggle to take on a myriad of changing missions.\nVirtual Reality\nVirtual Reality headsets will work in-game to put the player in the cockpit of aerial warfare, immersing themselves in head-swiveling combat. Combine this with full compatibility with HOTAS peripherals and custom axis curves, and you will be able to experience the game however you want, using any DirectInput supported peripheral you like.Key Features:Fly in varied and exciting scenarios and locations unlike you've ever seen before\nEngaging single player campaign\nOver 20 different aircraft and over 40 unique weapons at your disposal\nFight different kinds of adversaries such as giant mechanized fortresses and railgun cannons\nTest your skills in Conquest mode and fight against hordes of adversaries\nWant a different Conquest experience? - Adjust it with modifiers to your liking\nBeautiful 3D Volumetric clouds rendered with TrueSKY\nFully rebindable controls and HOTAS compatibility with DirectInput support\nVR Support","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sector D2","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":705002,"name":"Crab Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84c/84c9e9075aade1fb234f45e25b04db6d.jpg","description":"Crab Game is a First-Person Multiplayer game where you play through several different minigames based on children's games, until only one player stands victorious.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dani","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1271,"name":"The Swindle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a0f4375deea6207eaaadea8ad12e3ec.jpg","description":"The Swindle is a steampunk cybercrime caper about breaking into buildings, hacking their systems, stealing all their cash, and quickly running away again before the police show up.\nAll the buildings you’ll be robbing are randomly-generated, so you’ll never get the same level twice.\nMeanwhile, from the safety of your rickety airship up in Outer Space, you can modify your thief with new skills, tools, and all manner of advanced technological horrors, allowing you to take on bigger buildings with better security, for gargantuan rewards!\nHave you got what it takes to pull off The Swindle?\n// THE_SWINDLE.GetTransmission()\n-------------------------------------------------\n> London, 1849_\n> In 100 days, Scotland Yard will activate their breakthrough Artificial Intelligence technology,\n> codenamed \"The Devil's Basilisk\"_\n> Its surveillance capabilities will be total. If the project is completed,\n> your career as a master burglar will be untenable_\n> Steal it, before that can happen_\n-------------------------------------------------","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":654591,"name":"Alan Wake Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/685/685812b147f42b08e94391defa972898.jpg","description":"Alan Wake Remastered is the original experience you fell in love with all those years ago. We did not want to change that. But the visuals all around, including the character model of Alan Wake himself and the cinematics, have been updated and improved with some choice next-generation upgrades.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":16932,"name":"Talisman: Prologue","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60e/60ef1b1853c35da13bc2ca9cbd1c0539.jpeg","description":"Talisman: Prologue is a video game adaptation of Talisman, a popular board game created in 1983 by Games Workshop. This version is adapted for a single-player experience and does not allow multiplayer. The game is set in a high fantasy world of elves and dwarves and was described as \"Monopoly meets Dungeons & Dragons.\"\n\n###Overview\nThe game is based on the Fourth Edition rules of the original board game. In Talisman, the player controls a single character and moves him or her across a map. There are ten characters, such as Assassin, Monk, or Elf. Each of them has a score of D&D-like abilities, such as Strength and Craft, as well as downsides. \n\nEach character has his or her set of consecutive scenarios that become longer and more difficult over time. The scenarios are sorted depending on the number of turns required to complete them. The player can set a record by beating a scenario in fewer turns.\n\n###Maps and movement\nEach map is divided into three realms that form concentric rings. The player starts at the outer realm and has to defeat guardians or build bridges and rafts to move inwards. The goal is to reach the center of the map, where lies the ancient artifact called The Crown of Command. \n\nThe character's movement depends on the dice rolls and the properties of the terrain he or she is on. In certain spaces, the protagonist may encounter NPCs, recruit followers, fight enemies, obtain artifacts, and perform other activities. All of them are represented by the cards.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nomad Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":4561,"name":"Mortal Kombat vs. DC Universe","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/292/292afefcb3b93a82395b9f12a21028f2.jpg","description":"For the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamic multi-tiered environments. Plus, pick your favorite character from MK or DCU and pursue a fighting adventure in the new single player mode with an intertwined storyline and two unique perspectives.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Midway Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":362874,"name":"Wingspan","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b8/9b81f13454031d7e358b46a5c0aba521.jpg","description":"You are bird enthusiasts—researchers, bird watchers, ornithologists, and collectors—seeking to discover and attract the best birds to your network of wildlife preserves. Each bird extends a chain of powerful combinations in one of your habitats.\nEach habitat focuses on a key aspect of the growth of your preserves:\nGain food tokens via custom dice in a birdfeeder dice tower\nLay eggs using marbled egg miniatures in a variety of colors\nExpand your bird collection, drawing from hundreds of unique bird cards\nThe winner is the player with the most points accumulated from birds, bonus cards, end-of-round goals, eggs, cached food, and tucked birds.\nThis is a digital adaptation of Wingspan, a competitive, medium-weight, card-driven, engine-building board game from Stonemaier Games. Wingspan is the winner of the prestigious 2019 Kennerspiel des Jahres award.\nFeaturesDraw from hundreds of unique, animated bird cards\nHear real life sound recordings of the birds you encounter in the game\nPlay against AI or other people online and offlineGet in touchTalk to us on our Wingspan discord\nhttps://store.steampowered.com/app/1054490","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Monster Couch","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":20848,"name":"Paranautical Activity: Deluxe Atonement Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfd/cfd437464392262e2ee9f6de4ff9d63e.jpg","description":"Paranautical Activity combines the classic FPS action of games like Doom and Quake, with the randomness and difficulty of modern roguelikes like Binding of Isaac and Spelunky.\n-Unique FPS/Roguelike combination\n-Procedurally generated levels\n-Impossibly fast gameplay\n-Hidden levels\n-Over 100 items\n-40+ enemies\n-Ridiculous bosses‏\n-Kick ass Dubstep soundtrack\nThe Deluxe Atonement Edition includes the following\n-Developer footage & commentary, from prototype to pre alpha to full release!\n-The Seafarers Guide; A pro guide with a nautical twist. Consult the pro guide to become the leanest, baddest, mostest bestest Paranautical Activity player you can be.\n-1 new level type, 1 new weapon and 1 new item.\n-Wallpapers baby!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19370,"name":"Men of War: Red Tide","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb5/eb51457600af0bc2eb691d3030035416_Co4UccX.jpg","description":"Men of War: Red Tide is a sequel to the critically acclaimed RTS Men of War. Red Tide introduces a new story driven campaign based on the writings of Soviet scribe Alexander Zorich, it also includes dozens of new or upgraded units and weapons.\nMen of War: Red Tide is a stunning mixture of RTS and a third-person action that introduces a new fighting force known for its brutal efficiency during the height of World War II. Played out across more than 20 missions, Men of War: Red Tide allows to take command of the feared \"Black Coats,\" the nickname given to Soviet Marines, an elite combat group specializing in engagements near the shoreline.\nThe player has direct control of new game units including the Black Coats, tanks, self-propelled guns, armored trains, landing craft, artillery and new enemy emplaced weapons to capture and use. New air support options include fighters, bombers, hydroplanes; cruisers, destroyers and gun boats which provide naval fire support.\nFighting during the Black Sea Campaigns of WWII, history buffs and WWII aficionados will recognize theaters of battle such as Odessa, Sevastopol, Theodosia, Eltingen, Nikolaev and Constanta.\n23 missions - Soviet, German, Romanian and Italian forces\nSix intense historical battles and landing operations during 1941-1945\nOver 100 different military units: tanks, artillery, armored cars, planes (fighters, bombers, transporters), war ships and boats (cruisers, torpedo boats, gunboats)\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":18399,"name":"Dark Future: Blood Red States","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61c/61c787efa4d7e25e394a32ea0dc51443.jpg","description":"Dark Future: Blood Red States puts you in command of a team of hired road-mercenaries plying their brutal trade on the ravaged highways of mid America, 2023. The government barely functions as huge corporations hold sway in the cities, while the rest of the land slides into chaos. On the highways of mid America - aka The Big Empty - pollution, stagnation, catastrophic climate change and gang warfare has resulted in a post-apocalyptic nightmare.\nIn this dystopian alternative America, the ‘Sanctioned Ops’ - highway warriors for hire - hold sway, enforcing what few laws remain - but only if you can afford to pay. With violent gangcults hunting on the broken roads, contracts are plentiful, morals are flexible and the ways to die are growing day by day.\nRun your Sanctioned Ops agency how you see fit; take jobs that help citizens, catch criminals, and clear the roads of murderous scum, or engage in the murky world of corporate sabotage, industrial espionage, and hired hits.\nHaving equipped your team with high-powered vehicles - complete with a devastating array of weapons and defences earned throughout the single player campaign - you issue your commands to your Interceptors in real time, helping them navigate the hazardous roads, attack relentless enemies, and avoid the myriad threats that lie ahead.\nThis real time strategic play, combined with a physics-defying time manipulation mechanic, bleakly beautiful visuals, and a mysterious universe filled with danger, makes Dark Future: Blood Red States a truly unique car combat title occupying a genre all of its own, that we’re calling \"RealTimeShift Vehicular Action Strategy\".\nFeatures\nRealTimeShift Vehicular Action Strategy: command your ops and vehicles second by second as fits your tactical choices, as you hammer enemy vehicles with bullets, rockets, and ramming.\nExplore the sand-strewn wastes of a near-future USA, with gorgeous visuals and realistic physics powered by Unreal Engine 4.\nGet ahead of enemies to drop devastating mines, riddle their gas tanks with bullets from your machine gun turret, or turbo boost into their tail to send them spinning off the road.\nOutrun merciless corporations and deranged gangcults in high-speed highway shoot outs.\nPurchase new vehicles and upgrade them with powerful new weapons.\nPut together the most famous (or infamous) team of Ops and Interceptors in Dark Future history, then increase their abilities through successful missions and the latest cybernetic enhancements.\nUnravel a rich campaign filled with tactical decision making and intense action.\nStay in complete control of the action strategy using either keyboard and mouse or the controller of your choosing.\nA faithful adaptation of Games Workshop’s Dark Future universe, guided by legendary sci-fi author James Swallow (Dark Future, Warhammer 40,000, Deus Ex, 2000 AD).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Auroch Digital","platforms":[{"id":0,"name":"PC"}]},{"id":17807,"name":"NecroVision","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0d/c0d01bcd66859c19845efb4f52ad5ca7.jpg","description":"War is Hell. NecroVision is a first-person shooter that takes gamers across the frantic battlegrounds of World War I and into a dark underworld of vampires, demons and dark magic.\nSeeking adventure, young American Simon Bukner joins the British army in war-torn Europe of 1916. During a particularly ferocious battle, Bukner and his battalion are pushed into a series of dark trenches where they encounter mysterious phenomenon. As they move through the labyrinth they discover that there is a greater evil hiding underneath the battle-fields of the Great War — an evil that is forcing its way into our world and threatens to wipe out humanity. In the depths of this newly discovered underworld, Bukner must confront the dark forces and fight for the survival of mankind.\nAn engrossing storyline blends elements of a traditional war shooter with magic and the supernatural world\nPlayers fight with authentic WWI era weapons, powerful magic artifacts and vampire powers\nHordes of enemies that include humans, demons and vampires\nMassive, brutal boss battles\nIntense, fast-paced FPS combat stands out from the trend of plodding shooters\nBattle online with up to 16 players\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"The Farm 51","platforms":[{"id":0,"name":"PC"}]},{"id":4555,"name":"BloodRayne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ef/1ef64727a174dbc6c03ce26bf1ab2fae.jpg","description":"In the years between the World Wars, Agent BloodRayne works as a killing machine for The Brimstone Society--a top secret fraternity that hunts down and destroys supernatural threats. Two missions, five years apart, turn out to be connected by one man.  For years, this man has been searching the world for powerful occult relics to bring Germany into a new age of domination. Rayne must face his elite Nazi army and prevent them from releasing horrific creatures in their quest for the artifacts.  Starring the super-sexy, super-lethal, supernatural heroine BloodRayne, this original action horror game unleashed the red headed dhampir on the world.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"}]},{"id":316859,"name":"John Wick Hex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d0/5d0ed9e749d4f7aa4ced96715dc3d0cc.jpg","description":"John Wick Hex is the first John Wick PC/console game inspired by Lionsgate’s hit action franchise. From acclaimed Game Director, Mike Bithell (Volume, Thomas Was Alone, Subsurface Circular), John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like the professional hitman.\n\nCreated in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature gun fu style while expanding its story universe. Players must choose every action and attack they make, while considering their immediate cost and consequences. Every move in John Wick Hex feels like a scene from the movies, and every fight contributes to your progress on the job and requires precise strategic thinking. \n\nPerform well and progress in the main story mode (which features an original story created for the game) to unlock new weapons, suit options and locations. Each weapon changes up the tactics you’ll use and the manner in which you’ll play. Ammo is finite and realistically simulated, so time your reloads and make the most of weapons you scavenge on the job.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bithell Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":304216,"name":"Telling Lies","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d96/d965a8355c3165cf4698e1b3fdb5dd3a.jpg","description":"A Video Game About Private Conversations\nTelling Lies is the new video game from Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories.  An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. It stars Logan Marshall-Green, Alexandra Shipp, Kerry Bishé and Angela Sarafyan.\nHow does it work?\nTelling Lies sits you in front of an anonymous laptop loaded with a stolen NSA database full of footage. The footage covers two years in the intimate lives of four people whose stories are linked by a shocking incident. Explore the database by typing search terms, watch the clips where those words are spoken and piece together your story.\nUnlike anything you've played before, Telling Lies is an intimate and intense experience.  A game where you decide the truth.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":241088,"name":"Minoria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a11/a115439cf07ec721103dd7367f84732a.jpg","description":"Minoria is the latest and most ambitious game from Bombservice, and a spiritual sequel to the Momodora series, from the same studio.\nFans of Momodora will find familiar aspects in the design and gameplay elements, as they master the ins-and-outs of parries, dodges, and a variety of different spells.\nThe presentation has evolved to an HD format, with aesthetics mixing 2D hand-painted backgrounds and cel-shaded characters.\nThe story takes place during the fourth Witch War. It is a time of fanatical religious fervor. On the one hand, by the Sacred Office, a powerful organization leading an Inquisition against heresy, in order to purify the sinners who threaten humanity. And on the other hand, those labeled “witches”, responsible for conducting a mysterious ceremony that contradicts the rules of the Church.\nSet forth with Sisters Semilla and Fran, missionaries in the Church’s service, on their journey to thwart the witches’ ceremony and protect the common-folk from heresy that endangers the status quo.\nA powerful fantasy story inspired by the history of medieval Europe\nA unique visual aesthetic combining hand-painted 2D art with cel-shading\nFluid controls encouraging careful engagement and patient play\nOffensive combat enabling players to crush enemies with a mix of swordplay and spells\nDefensive options including dodge-rolls and parries\nA leveling system that helps players adjust their character to their desired difficulty\nHello there! I’m rdein, the creator and director of Minoria.\nFirst of all, I’d like to share my excitement in announcing this project. This is an universe I care a lot for, from the setting to the characters, and it’s been a lot of fun to explore and develop its concepts during the process of game development.\nFor the first time in many years, I started a game project set in a new universe. It felt like a breath of fresh air for me. With that said, Minoria does contain some similarities with my previous projects (especially Momodora’s latest installment, Reverie Under the Moonlight).\nI am proud of what we’ve been making for Minoria, and I hope you will enjoy the story and characters I’ve prepared this time around!\nHowdy folks, Dan here from Dangen Entertainment. It’s been hard patiently waiting for the announcement of Minoria, knowing what an amazing game it’s going to be. It combines everything I love about the Momodora games with stronger emphasis on a solemn story. I love how Bombservice is approaching the visuals this time around too--it’s a unique take that looks beautiful and shows another evolutionary step in the team’s development experience, just as previous titles have.\nThis game is extraordinary. A must-play if you’ve got an appetite for action-platformers like I do.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bombservice","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":58771,"name":"PLANET ALPHA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2eb/2eb34a667d4edb7c5564253147edfc52.jpg","description":"Pre-Purchase OfferPre Purchase now to receive the Digital Deluxe edition, featuring the game as well as:\nThe Original Soundtrack. Be immersed in the beautiful and deadly world of Planet Alpha with the Planet Alpha Original Soundtrack. Featuring all 40 tracks in Planet Alpha by Composer Sid Barnhoorn.\nDigital Artbook. The Planet Alpha Digital Artbook includes concept art and illustrations that helped to create the stunning world of Planet Alpha as well as screenshots and other artwork from the game.\nAbout the GamePLANET ALPHA, a beautiful alien world filled with mystery and danger. Pursued by relentless enemies, you must harness the power of night and day as you struggle to survive.Marooned on an Alien World…You have awoken on a strange alien world. Injured, alone and stranded you venture across this foreign land, navigating beautiful and varied terrain as you try to stay alive.\nPower Over Night and DayThe world of PLANET ALPHA is affected by the solar cycle, and as you progress you’ll discover a unique gift – you can manipulate the time of day and use it to your advantage.\nUnlock the Mysteries of PLANET ALPHAExplore a unique world and piece together your story. What will you discover on PLANET ALPHA?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":672365,"name":"Poppy Playtime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/635/635749dc78e4fbd29a9773abd0a49c5e.jpg","description":"More than just a walking simulator... You must stay alive in this horror/puzzle adventure. Try to survive the vengeful toys waiting for you in the abandoned toy factory. Use your GrabPack to hack electrical circuits or nab anything from afar. Explore the mysterious facility... and don't get caught.Welcome to Playtime Co.!Playtime Co. was once the king of the toy manufacturing industry... until everybody inside of the factory one day disappeared into thin air. Now, years later, you must explore the abandoned factory and uncover the truth.\r\nThe ToysThe toys of Playtime Co. are a lively bunch! From Bot to Huggy, Catbee to Poppy, Playtime does it all!\r\nAs long as you're at Playtime Co., why not pay the toys a little visit? You might just make a few friends...\r\nThe GrabPackThis amazing GrabPack is a wearable backpack, accompanied by 2 artificial hands attached via steel wire.\r\nWith this handy, state-of-the-art tool, there's no limit to what Playtime Co. employees can accomplish! The following list of features should help to show you what the GrabPack has to offer.\r\nThe hands' powerful grip allows for movement of heavy objects with ease!\r\nA lengthy and flexible wire gives any employee the ability to reach whatever they may need, no matter the distance!\r\nThe steel wire makes conducting electricity a breeze!\r\nThe only limit is the length of your GrabPack's wire.\r\nWon't you stick around? There's lots of fun in store for you. It's almost Playtime...","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"MOB Games","platforms":[{"id":0,"name":"PC"}]},{"id":12899,"name":"Jagged Alliance 2 - Wildfire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/223/223cf5be09ac10204e5b9a6a1cfb9da4.jpg","description":"Even if the regime is totally inept and corrupt, don't suppose for a moment that you as the liberator will be greeted with open arms.\nJAGGED ALLIANCE 2: WILDFIRE brings you back to Arulco. The population is being terrorized by a reckless army; in the meantime the main export goods are drugs. Subversion and fraudulence has infiltrated all levels of local government and the ever-present Mafia has his fingers in many pies. You are working undercover on behalf of the US government and your goal is to destroy the mighty drug cartel. You'll need a skilled hand to put together the right team of mercenaries and the negotiating skills of a diplomat to get the sceptical population on to your side. You'll also need the strategic genius of a general and the fighting tactics of a guerrilla.\nShould you fail, your \"client\" will deny all knowledge of your existence.\nJagged Alliance 2 Awards:\nGameplayAn exciting mix of strategy and role-playing that puts you in charge of a nation's fight for freedom. Your objectives are - to hire a core group of skilled professionals through A.I.M., the Association of International Mercenaries; to win the local population over to your side by displaying courage and loyalty; to train your men around the clock and then send them into dangerous missions and lethal fire fights and to conquer the depths of underground mines, reap their riches and discover their secrets. Each success will bring you closer to total victory, while each failure must be overcome with iron determination. Sometimes a tactical withdrawal can bring you more benefits than a battle for battle's sake. Retreat from one sector only to surprise the enemy by attacking on another flank. At the beginning, some of your enemy's bases may seem to be impregnable - but don't despair - you will have to become stronger step by step and slowly gain ground.FEATURES:Only the best of strategy\nIncomparable depth of gaming combined with a non-linear gameplay\nA unique mixture of real time reconnaissance and turn based combat\nYou influence the smallest details of every tactical move\nand role-play\nCreate your own optimal mercenary.\nInteract with more than 150 characters.\nRecruit teams of mercenaries all with their own unique personality.\nThe likes and dislikes of mercenaries between themselves influence the motivation and skill of a team.\nMercenaries have an excellent memory for the behavior of the gamer: Good and bad experiences have their own effect on the players game.\nThree difficulty levels.NEW IN WILDFIRE:\nUp to 10 mercenaries in a team\n8 new playable mercenaries with individual histories\n230 new and reworked sectors: new settlements, increased building density\nVarying landscapes with changing density of vegetation and new visual conditions in close combat.\nAll weapons and explosives have been newly balanced with absolutely authentic characteristics - Total realism in the combination of weapons and protection systems.\nRealistic sound effects for a new, exciting and authentic game feeling\nMore than 20 new weapons: USP, Uzi, UMP, MP5A3, Mini-30, HK33, G36, MP7, MSG90, AN-94, RPK, V-94, VAL, VSS and over 150 new objects.\nThere are new opponents and unfortunately for the player they have become a lot tougher, cleverer and unscrupulous. Differing enemy behavior demands a higher quality of varying tactics and non-linear thinking.\nImproved overview with a 1024 x 768 resolution","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"I-deal Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11548,"name":"Renowned Explorers: International Society","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ef/7ef2cd4d298b227d05eb079cbf9d10f9_5kWg3sT.jpg","description":"Renowned Explorers: International Society is a strategy adventure game set in a fictitious 19th century world. It introduces a unique attitude-based gameplay that challenges both your tactical and storytelling skills.Key Features Endless New Adventures - Explore the far corners of fictitious 19th century world in procedurally generated expeditions to Egypt, the Caribbean and much more.\nCompose your Crew - Choose 3 experts out of 20. Fighters are Aggressive but Speakers can solve tactical conflicts with Speech actions.\nPersonality = Gameplay - Each conflict can be solved in different ways, depending on your crew's personality and strategy. 'Mood' is one of the most important gameplay elements.\nFight them with Melee, Ranged and Area of Effect attacks,\nwin them over using Cheers, Charms and Compliments,\nor scare them away by Insults, Taunts and Humiliation Optimize your Economy - Collect Insight, Research, Gold and Status on your expeditions. Use them to build economy and support for your next expedition.\nVivid Stories - Find more than a hundred treasures in hundreds of visual events that adapt to the characters and have multiple outcomes.\nBuild a reputation - Become a Diplomat, Aggressor or Manipulator. Go for Science, Wealth or Status. Fame is your goal, but the way there is entirely up to you.\nPermadeath? - In Adventure mode you cannot load after failure. Discovery mode lets you reload. Choose difficulties from Easy through Impossible to customize the challenge.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Abbey Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":357891,"name":"Bear With Me: The Complete Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfa/cfa09407b376891c5a9ff472a7e08f3c.jpg","description":"Bear With Me: The Complete Collection features all previously released episodes as well as the new prequel The Lost Robots . This collection is the definitive way for players to experience the franchise.\nDark interrogations, sarcastic banter, and challenging puzzles lie in store for our heroes as they collect clues to solve a bigger, more sinister mystery. Featuring an evocative soundtrack, expansive narrative and a uniquely drawn 2D animated art-style accented by an impressive film noir style, Bear With Me will take players through an emotional rollercoaster of a journey that will determine the fates of our protagonists.\nKey Features:\n\nA Classic Genre Reimagined. Discover a distinct spin on the timeless point and click adventure formula in this modern indie adventure. Solve puzzles, interrogate suspects, and explore crime scenes in search of answers.\nAn Engaging Story. Bear With Me presents a unique fusion of comedy, horror, and mystery elements that elevate a thrilling narrative that spans across a four-episode journey.\nFully Interactable Environments. Explore the expansive Paper City to collect clues about this grand mystery. Players are free to tackle and revisit unsolved puzzles at their own pace to piece together vital bits of information to crack the case.\nMemorable Characters. From the cool and quotable Ted E. Bear to the optimistic Amber, communicate with a diverse cast of fully voiced characters that may help or hinder our protagonists in their unrelenting pursuit of the truth.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Exordium Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14520,"name":"Uriel's Chasm","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/778/778fb5b47d9ef274a8b3c6906c856892.jpg","description":"Uriel's Chasm is an adventure indie game, set in a fictional galaxy.\n\n###Plot\nSister Tabitha is tasked to explore the orbital monastery Enoch's Hope. However, this monastery has disappeared for mysterious reasons. Sister Tabitha has to find it and, moreover, save the members of the crew. There is an encircling meta-story. Two reviewers called Shovelware Queens picked up the game's cart and give it a shot. As the player completes levels, they react to it. They appear at the beginning of the game, and you see them a couple of times during it.\n\n###Gameplay\nThere are four levels to complete. The gameplay is quite mixed, so it consists of the different genres. In the beginning, it is a top-down shooter. You have to shoot meteorites and also dodge them. Sometimes they drop to you Bible verses, which you can collect to raise the faith meter. There are two meters beside the faith: ammo and fuel. The ammo meter can be decreased by shooting, and you lose fuel while moving. Fighting foes decreases the player's faith meter. In a case of any meter's depleting you lose. The next level is a side-scrolling shooter, aimed at fighting enemies and killing the boss. As for the enemies, there are gnarled trees, mechs and spinning crosses. The last genre is a platformer. The player has to jump around to find Bible verses. You do not have to kill enemies, and there is no possibility to die. Although the sections are short, you cannot save or load at any time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rail Slave Games","platforms":[{"id":0,"name":"PC"}]},{"id":10753,"name":"Rampage Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ca/9cab14d697c8faaec9b9fe0c05d85743.jpg","description":"Rampage Knights is a cooperative beat 'em up game mixed up with randomized dungeon crawling and exploration which you can play alone or with a friend online.\nYou play as a hero trapped by a spell in a magical forest. All paths lead you to a nearby ruined castle, infested with goblins, skeletons and other foul creatures. Gear up with awesome and ridiculous weapons and spells and descend into the deep labyrinth below the ruin to face its sinister master!\nTry to get as far as possible in a dungeon with randomized items, spells, traps and encounters. Your hero is upgraded along the way (both visually and gameplay-wise) as you find better weapons, items, magic powers and fight harder and harder monsters.\nThe main features:Frenetic action inspired by Golden Axe and Binding of Isaac\nSingleplayer campaign or co-op for two players (online and local)\nRandomly generated environments with rogue-like elements\nHero visually evolving with new abilities\nDozens of spells and weapons with game changing properties\nLong term progress with new classes and features to unlock\nFull controller support\nMighty foot included!\nSo what do you say? Are you ready to start the rampage?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rake in Grass","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":630676,"name":"Judgment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/338/33848ebb15683ea022c08f39f01b810f.jpg","description":"“We’re gonna chase the truth as far as we can.”\n\nKamurocho isn’t exactly known for being the safest place in Japan, but even for this red-light district, a string of violent serial murderers has the entire city on edge. It’s up to private detective Takayuki Yagami and his partner Kaito to track down the truth using whatever tools they can. Get a look at just some of those tools (including a drone, lockpicks, and the muscles of a huge former Yakuza member, to name just a few) in our new Features Trailer!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]}]