[{"id":961475,"name":"Town of Salem 2","genre":"RPG","price":0.0,"description":"Town of Salem 2 is releasing into Early Access May 26th, 2023! Wishlist now!\nThe Town of Salem is in turmoil as the Coven has taken over. Will you have what it takes to survive?\nHow To Play\nJoin up to 14 other players online and use your wit and abilities to emerge victorious. As a Town member, your goal is to lead your fellow members to victory by identifying and eliminating your opposition. Use your role's unique abilities to reveal yourself as innocent, track down killers, or even take down suspicious individuals. There are countless ways to play and win.\nMeanwhile, the Coven, Neutral, and Apocalypse factions work from the shadows, using their own abilities to thwart the Town's efforts. Whether it's burning away dead bodies, blocking Town members' abilities, or going on a killing rampage, each role has its own unique approach to achieving victory.\nNew Roles\nWith a vast array of new roles there are countless ways to play and win. Each role has its own set of abilities. Abilities such as taking fate into their own hands and killing during the day, Knighting another player giving them extra votes, and using blood rituals to destroy your enemies if you know their role.\nNew Apocalypse Faction and Four Horsemen Game Mode\n.\nThe Four Horsemen of the Apocalypse are here, each with their own way to win.\nWith so many roles to choose from, every game is different and exciting.\nMore Control Than Ever Before!\nScrolls can boost your chance of being your favorite role, while Cursed Scrolls can reduce the chance you get roles you dislike.\nYou can ban specific roles or add your favorite game modifiers, such as VIP or Town Traitor, to create the perfect role list for your game.\nPrivate custom lobbies allow you to invite your friends with a simple six-letter code or browse custom lobbies to join other games.\nAnd with free movement in lobbies, at night, and as a ghost, you have more freedom to explore the game world.\nCommunication\nCommunication is also easier than ever, with the ability to tag players, roles, and keywords in chat.\nPersonalization\nCustomization is a key feature in Town of Salem 2. From customizing your character and pet to your house's interior, you have more control than ever before.\nWith so many new features and roles to discover, Town of Salem 2 is an exciting and unique experience that you won't want to miss.\nWishlist now! Help the fight against the Coven, or... join them.","imageUrl":"https://media.rawg.io/media/screenshots/52f/52f2e76bdf63e64c7c92083cd16348ac.jpg","releaseYear":2023,"developer":"BlankMediaGames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":791789,"name":"Hatsune Miku: Project DIVA Mega Mix+","genre":"Action","price":0.0,"description":"Take center stage in Hatsune Miku’s premier rhythm game starring the world’s #1 virtual pop star! From a stunner setlist of songs to an enormous wardrobe to style, this is the ultimate tour with Hatsune Miku, Kagamine Rin and Len, Megurine Luka, MEIKO and KAITO—all it needs is you.\nStart by choosing a song, then tap and hold buttons at the right time with the icons on-screen. It’s simple to grasp, and challenging to master. Vibe with the music videos on Easy or aim for a high score on Extreme! Button inputs can be configured to harmonize with playstyle and accessibility preferences, supported by Steam-compatible controllers.\nOver 170 Songs\nProject DIVA debuts on PC with over 170 playable songs, each accompanied by a unique music video. Get into classics like “Melt” and “Cendrillon” plus new favorites like “Catch The Wave”!\nEndless Customization\nDress Miku and friends from head to toe in over 500 dazzling hairstyles, costumes, and accessories. Costumes can be tailored to every music video, making for endless possibilities.\nSwap Visual Styles in One Click\nSwitch between two visual styles for different experiences. Enjoy the pop of the “Mega Mix” style or the gloss of the high-fidelity “Future Tone” style, and change it up anytime.\nCustom T-Shirt Editor\nLet Miku kickstart your fashion designer career on the big stage! Draw your own T-shirt from front to back, then debut it in a performance.\nCustom Playlists\nYou’re the director of this concert! Curate a playlist to perfection, hit play, and let the customized music videos roll in this cinematic experience.\nThis game may be updated over time and have paid for and free additional content released for it. Please be aware that this may increase the minimum requirements for running the game above the specification stated below.","imageUrl":"https://media.rawg.io/media/screenshots/801/801b23ccc4ffac44e91a05990199e686.jpg","releaseYear":2022,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":635391,"name":"Space Jam: A New Legacy - The Game","genre":"Action","price":0.0,"description":"The Tune Squad faces the Goon Squad in a wacky basketball beat-em-up!\nBack in December 2020, Xbox called all gamers, Space Jam fans and coding enthusiasts to submit their ideas for the new Space Jam: A New Legacy game available first with Xbox Game Pass Ultimate. After reviewing submissions from around the world, Xbox and the Digital Eclipse development team selected the ideas and game concepts from two lucky winners, whose ideas have come to life in one of the looniest arcade style challenges around:\nAs part of his scheme to become an all-powerful digital force, a rogue artificial intelligence named Al-G Rhythm has trapped basketball champion and global icon LeBron James inside the Warner Bros. server.\nWhile plotting to have his Goon Squad square off against LeBron and the Tune Squad in a high-stakes, high-tech basketball game, Al-G locks himself away in a hidden area of cyberspace.\nIf LeBron, Bugs Bunny, and Lola Bunny can find all three pieces of the \"\"Legacy Code,\"\" they can use it to open up Al-G's secret lair. But standing in their way is the rogue AI's robot army... and members of the Goon Squad, The Brow and White Mamba.\nPut the hurt on Al-G's army in this classic 2D brawler, using collectible cards to enlist help from other Tune Squad players. Will the Tune Squad's teamwork be enough to stop Al-G Rhythm's plans?","imageUrl":"https://media.rawg.io/media/games/881/88119249d4fc42a69f23c1619dd90cd7.jpg","releaseYear":2021,"developer":"Digital Eclipse","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":595231,"name":"Frozenheim","genre":"Strategy","price":0.0,"description":"Frozenheim is a serene Norse city builder game that offers elaborate management mechanics and multiple progression trees to balance as you maintain and expand your settlement. Prepare for brutal RTS combat that will put your tactical skill into a test. As you launch exploration parties on foot and by boats you will not only discover resources you can exploit but also draw the attention of the enemies who will seek to destroy you. To prove yourself an Earl worthy of sagas, you will:\n\nBuild and expand a Viking village from nothing to a rich, unconquerable settlement\nForage, hunt, fish, grow your food, and keep your clan safe as the seasons pass\nFind your own progression path as you learn to utilize new buildings and units\nExplore the fjords of Midgard, launch raid parties on foot or set sail in your drakkars\nSeek the blessings of ancient shrines and build temples to win the favor of Asgard\nRaid other players or form alliances with them in multiplayer matches\nCapture the raw beauty of the Frozen North in photo-mode","imageUrl":"https://media.rawg.io/media/screenshots/2ce/2ce3e1c31794fbe541470eba6651c37b.jpg","releaseYear":2021,"developer":"Paranoid Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":491239,"name":"Kingdoms Reborn","genre":"Strategy","price":0.0,"description":"KINGDOMS REBORN IS AN OPEN-WORLD CITY BUILDER WITH MULTIPLAYER\nIn Kingdoms Reborn, you lead your people to settle in a rich vast wilderness. Inspired by Banished, Anno, and Civilization, the game features challenging resource management combined with an extensive tech tree and upgrades. With multiplayer, you can cooperate or compete in real-time with your friends in the same open world.\nRANDOMIZED OPEN WORLDImmerse yourself in a rich, seamless, procedurally-generated world\nMULTIPLAYERTrade, aid, steal, or compete with your neighbors\n7 DISTINCT BIOMESSettle in different environments with distinct resources, flora and fauna\nCHALLENGING SIMULATIONManage your people who have to work, eat, and rest just like us\nTECH TREELead your settlement from a tiny village, through eras, transforming it into an advanced civilization\nCARD SYSTEMAdd dynamics to your gameplay with building, policy, and interaction cards\nMARKET ECONOMYTrade with the global market in which prices are influenced by your decisions","imageUrl":"https://media.rawg.io/media/screenshots/95c/95cd92bbcb60c75cb5ccebafc3f2f5a4.jpg","releaseYear":-1,"developer":"Earthshine","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":485167,"name":"Combat Arms: the Classic","genre":"Action","price":0.0,"description":"- Combat Arms is an MMOFPS that focuses on multiplayer gaming. With its huge variety of customizable weapons and known game modes, it provides gamers a high-quality FPS experience. The game takes place in a vast world that features many different landscapes. Each map varies in design, terrain, and notable landmarks\n- Weapon Variety – Hundreds of weapons ready for customization\n- Boss Batlle - Defeat the boss and its minions and get Boss Rewards\n- Tons of Maps and Modes – Familiarize the maps to take advantage of other players, choose your game mode and dominate the game.\n- Character Customization – Hundreds of cosmetic items to customize your character to stand out.\n- Competitive Ladder – The ranking system that keeps track of stats. Rank up from Trainee to General of the Army.\n- Several weapons, once purchased, can be further customized to suit the player's needs. Players are able to improve the potential of their weapons (such as increasing firepower).\nSome weapons can also be combined or forged in order to create new, more powerful weapons.\n- Each day, a new set of missions are available from various clients around the world. Completing these missions will reward you with exclusive items or payment that would otherwise be difficult to obtain.","imageUrl":"https://media.rawg.io/media/screenshots/3ce/3ce88c34a2243fb93fa374f14ec592f3.jpg","releaseYear":2020,"developer":"VALOFE, NEXON","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":428150,"name":"BarnFinders: The Pilot","genre":"Adventure","price":0.0,"description":"Search for valuables stashed in abandoned barns ranging from old clocks, musical instruments, antiques, gold, weaponry or even vintage cars and motorcycles and sell them with profit.\nRun your family business. Look for valuables and sell them in your pawnshop. Every item has a value, so collect everything and search everywhere!\nBid your money on auctions and sales to get access to closed-off properties. Who knows what kind of dusty treasures you can find there?\nVisit 10 originals locations and unearth their secrets in the land of Ammeryka (largely simmilar to the real America, but not quite). Barns are just a start the beginning. How about a visit to an old military base or . . . the moon?\nTake care of developing your shop. Empty shelves mean an empty wallet. Customers will come back if they have something to come back to. Fix found items, clean the dirty ones and sell them all. And if there are no customers, you can always play basketball in your backyard. And somehow, make money while playing..\nUncle Billy will  keep you busy. Together you’ll explore different locations, but the real work is all for you to do. That is, until you go solo. Eventually.\nBeing a real Barn Finder is a state of mind a job for the brave and the bold. Your competitors are specialists and they are just waiting for you to slip.Features:Hundreds of items to find and sell\nImprove the quality of goods for sale by cleaning and repairing damaged ones as needed\nFind parts of exclusive cars, motorbikes, rebuild them and then sell for big payout.\nDiscover wonky stories of the locations you visit and items you collect","imageUrl":"https://media.rawg.io/media/screenshots/8e1/8e1423d90d84ea9a9f4a50fdeb363023.jpg","releaseYear":-1,"developer":"Duality Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":301616,"name":"圣女战旗 Banner of the Maid","genre":"RPG","price":0.0,"description":"致玩家的一段话\n大家好，《圣女战旗》Steam页面终于正式上线啦！在这里我们要对一直关注着《圣女战旗》的玩家说一声谢谢，感谢大家长久以来的关注与支持，在游戏制作过程中，大家的鼓励一直是我们最大的动力。\n因为对战棋游戏的喜爱，我们开始了这款游戏的制作，至此已经过了两年多磕磕绊绊的开发之旅。目前游戏已经进入最后的开发冲刺阶段，即将正式发售，届时希望大家能喜欢我们的游戏！也可通过以下途径了解游戏最新的进展情况：\n官方网站：圣女战旗官网\n新浪微博：@中电博亚    @圣女战旗制作组\n官方社区：圣女战旗杉果小组\n官方QQ群：607946570\nAbout the Game\n■故事背景\n《圣女战旗》是以18世纪末、19世纪初，法国大革命时代为背景改编的策略战棋游戏。玩家将扮演少女军官波利娜·波拿巴，展开一段属于自己的征程，在途中结识诸多名人和英雄。在这个波澜壮阔的时代，波利娜从一名普通的军官开始，逐步登上欧洲历史的舞台。\n■众多登场角色\n席卷欧洲的法国大革命，以及神秘的圣女，改变了无数人的命运。\n30多位出身各异的角色登场，既有叱咤风云的名将，也有被改变的命运推上历史舞台的普通人。他们或是你麾下的军人，或是与你对立的敌人，或是在背后支援你的盟友。\n跟随主角波利娜的脚步，在熟悉而又陌生的欧洲探寻他们的故事。\n■支线冒险\n大革命时期的巴黎，各大势力轮番登场，波利娜在皇室、斐扬派、雅各宾派等阵营间周旋，争取各派系的支持。完成他们所交代的任务和挑战，筹集经费改善武器装备、军粮补给，同时探索隐藏在城市深处的关于圣女的秘密。\n■具有时代特色的战斗\n以具有独特魅力的策略战棋的形式，指挥曾在18、19世纪活跃于欧洲战场上的线列步兵、骑兵、炮兵等多种部队，体验具有时代感的战争场面。\n掌握每个兵种的特性，培养麾下的指挥官学习及搭配各种战术技能，以战胜强大的敌军精锐。\n■利用关卡要素突破重重难关\n超过30个关卡地图，包括城市、平原、雪地等场地，利用诸多战场上的元素赢得优势：\n-给作战带来各种利弊的地形要素\n-为不同兵种提供独特支援的阵地\n-随剧情出现在战场上的特殊事件\n-暴雨、大雪、浓雾、黑夜等影响全军的环境变化","imageUrl":"https://media.rawg.io/media/screenshots/0a0/0a087d5be6427a6fd2f82359f2bdac35.jpg","releaseYear":-1,"developer":"Azure Flame Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":64119,"name":"Clawface","genre":"Action","price":0.0,"description":"Get ready to exeCUTE!\nClawface is an intense, arcade-styled, twin-stick shooter where you play as an adorable robot equipped with crazy weapons and a giant face claw to fight endless waves of alien monsters!\nWith fast-paced combat, a dynamic level system that modifies the play field, and the ability to dual-wield weapons, Clawface challenges you to think fast and adapt to the situation. Use the claw to grab enemies and eat them, recovering health so you can last just a couple more seconds in the arena!\nKey Features\n- 11 gross baddies to fight against, each with distinct attack patterns!\n- Use a claw in your face to grab and eat enemies!\n- Struggle to the top of the global leaderboard and challenge the best of the community!\n- Use a robust built-in level editor to create infinite levels and share them on the Steam Workshop!\n- A tubular 80's aesthetic that will make you eat your shorts!","imageUrl":"https://media.rawg.io/media/screenshots/5df/5dfa6d397bd594e1e7a3e02fdaf507b6.jpg","releaseYear":2018,"developer":"Hathos Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":61145,"name":"SharpShooter3D","genre":"Action","price":0.0,"description":"SharpShooter3D is a first-person subculture shooter in the best old school traditions.\nBurn! Destroy! Kill! Kill! Kill!\nWhen corrupt politicians look only for their own benefit, marginalized drug addicts go crazy, and the world consumes insanity, only the maddest madmen can stop this nightmare.\nSeemingly ordinary trip to the neighboring country South-Slovenko ended for our heroes with unbelievable and brutal consequences.\nWhen the best friend becomes an enemy, and the main villain becomes you yourself and blood flows like a river, someone will definitely have to answer the main question...\nWho is behind the awakening of ancient evil and is there still a chance for humanity?\nWelcome to the world of Sharpshooter3D.\nWelcome home!","imageUrl":"https://media.rawg.io/media/screenshots/c0f/c0fb14960d365f5ac7188d8eb4bd533d.jpg","releaseYear":2023,"developer":"HeadHunters games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60832,"name":"Spire of Sorcery – Character Generator","genre":"RPG","price":0.0,"description":"Spire of Sorcery is the upcoming open world survival RPG from Alexey Bokulev (creator of Eador. Genesis and Gremlins, Inc.).\nSpire of Sorcery – Character Generator is a free companion tool that allows you to have some fun and express your creativity:\nGenerate random characters from the world of Rund (biographies and portraits) – and edit them as you see fit!\nCreate your own characters: write their background stories, give them names – then assemble the portraits to match!\nShare your work with the community: export portraits to use as avatars; export portraits and biographies to share on Discord and elsewhere!The product is updated with new assets as we progress with the production of the main game.\nWe love feedback, and we very much welcome your suggestions and bug reports here on Steam and over on Discord! Many thanks for helping us create a better player experience for everyone!!","imageUrl":"https://media.rawg.io/media/screenshots/7ab/7abe06b782564089d572fe7248a39f71.jpg","releaseYear":-1,"developer":"Charlie Oscar Lima Tango Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":54145,"name":"Wild Gunman (1984)","genre":"Action","price":0.0,"description":"Wild Gunman (Japanese: ワイルドガンマン, Hepburn: Wairudo Ganman) is a light gun shooter game created by Nintendo. Originally created for arcades in 1974 by Gunpei Yokoi, the game was updated and released in 1985 as a launch title for the Nintendo Entertainment System, being among the few games making use of the NES Zapper peripheral.","imageUrl":"https://media.rawg.io/media/games/7dd/7ddc0cc1426c5f1e821cd3609bca9503.jpg","releaseYear":1984,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"NES"}]},{"id":51098,"name":"Sky Is Arrows","genre":"Adventure","price":0.0,"description":"A deep and twisted fantasy world with heroes, big battles, exploring weird locations, dodging traps, and permanent death. Players must be prepared to: Get their armies out of danger, protect their castle from attackers, and empower their hero enough--- To desolate all enemies!\nAlong the way; Pick up item & gold chests, explore graveyards and visit shrines. Each Act is randomly generated to guarantee no play-through is ever the same.\nPower up your hero; Focus your skill points on your hero's attributes to have a warrior hero, or level up a particular spell to make it all-powerful.\nDifficulty increases over time and the game becomes more difficult.\nStrengthen your hero enough to take on the final boss, or eventually fall to the onslaught of powered-up enemy heroes and armies.\n","imageUrl":"https://media.rawg.io/media/screenshots/75a/75a69e3d147ee429a65ae6367fe384a8.jpg","releaseYear":2018,"developer":"2,000 Damage","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":50630,"name":"Broken Reality","genre":"Adventure","price":0.0,"description":"Welcome to Broken Reality\nIt is the future, and supercorp NATEM is now responsible for offering most digital services. Your computer and the internet are all within NATEM's control.\nTo better integrate their various technology services, NATEM has decided to transform the experience of using a computer from a traditional 2D experience into a three-dimensional digital existance. Users can now move and interact with websites as if they were physical spaces.\nYou are invited to join the world of NATEM.\nTRY OUR DEMO!!Features\nFind passion in our exlusive Love Cruise, or gamble away in the casinos of GeoCity. Everything you want is one click away!\nCut ads into pieces with your katana, find secrets with your camera, teleport with your bookmarker and much more with our varied set of tools!\nMeet a diverse cast of characters and help them along the way!\nCollect likes to upgrade your social account and gain access to new sites!\nArcade-style mini games!\nRich, dynamic soundtrack that matches your progression.\nNo violence.","imageUrl":"https://media.rawg.io/media/screenshots/0a2/0a2c6816a27e63274d61c50e96a4fe2a.jpg","releaseYear":2018,"developer":"Dynamic Media Triad","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50550,"name":"TRANSCEND - EARLY ACCESS","genre":"Action","price":0.0,"description":"THIS IS AN EARLY ACCESS VERSION. The current version of this game is a DEMO that includes the first 4 out of 11 chapters of TRANSCEND.  Please do not purchase this game if you expect a full game. This was intended to be released as \"Early Access\" but a mistake was made while publishing on Steam.\nAlso note- this does not change the price or content of the game, just the listing.\n\nTranscend is inspired by the unconventional mixture of Ghibli Studio's work and James Cameron's \"Avatar.\" In this refreshing 2D world, you will live the story of a \"Spirit\" who was given the path of the \"Warrior.\" In order for him to become this \"Spirit Warrior,\" he will need to prove himself by transcending time, worlds, and even dimensions, to challenge the greatest warriors across all existence. You will learn to live like one of them, you will train with them, learn their strengths and weaknesses, and ultimately... you will challenge them. Every decision you make in Transcend will have an evolving effect on the game-play and story.\nThe story of Transcend is its core feature and it starts from the very beginning... birth. When a new spirit is born, it makes a voyage to what's called the \"Spirit World.\" During this voyage, spirits are assigned a role they are destined for. This is where your journey starts. In Transcend, you will play the story from beginning to end of a Spirit named \"Hero,\" who was chosen to be a \"Spirit Warrior.\" In order for him to fulfill his destiny, he will go through a series of trials and challenges to prove himself. Most of these challenges will revolve around him learning what being a \"Spirit Warrior\" truly means, and what is required of him. Hero will travel through time to visit some of the greatest warriors EVER: the mighty Spartans, the berserk Vikings, the honorable Samurais and many more... They will learn to use the shadows in the Ninja world and travel across the galaxies to new worlds and civilizations of sentient warriors. Each timeline/world will have its own story/plot, and with each, a lesson Hero (you) will learn.\nTranscend's game-play/plot could be described as a mixture of the original Zelda games (with its rewarding yet simple combat/visuals) and Assassin's Creed (traveling through different eras and timelines). This game is being developed by a team of one (myself, Ynor), for the last two years. When I began working on this project, I originally intended to release the game in chunks (I wanted to release the chapters as I finished them), similar to a show or T.V series. This is something I am still really hoping to do. I believe it will give the players a quicker and more rewarding return for their investment, while also allowing me to receive input and shape the game with your help as I go.  However, I understand this is something that may sound very unconventional, since it hasn't been done before (that I know of, there are probably other examples). Feel free to let me know how you feel about this idea.","imageUrl":"https://media.rawg.io/media/screenshots/454/454233df5b36731acabd76dbf1f618ff.jpg","releaseYear":2017,"developer":"Ynor","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":48990,"name":"Steamburg","genre":"Adventure","price":0.0,"description":"Steamburg is an award-winning puzzle adventure game with story exploration elements and unique gameplay. The game is made by Telehorse, a steampunk games company. It was awarded the Best Upcoming Game at IMGA in San Francisco in March 2017.\nThe main character, professor Vincent Cornelius Moore, fights robots that invaded the city of Steamburg. The gameplay is unique – Vincent is unarmed, so he must choose his moves wisely. He can only throw small electro-bombs which lure the robots and halt their progress for a while. Vincent has to walk through the streets in such a way that the robot chasing him hits upon a Tesla coil and is destroyed. It seems quite easy in the first levels. Then you have to fight several robots at the same time, the robots become faster and faster, some of them can fly and other respond to Vincent’s every move.\nNarrative elements are of great importance. In 2016 Steamburg won an award for Best Storytelling at White Nights in Helsinki. Dialogues reveal Vincent to be a scientist responsible for testing a new weapon in Steamburg. At the same time he is searching for his fiancée who was reported to be in Steamburg when the robots attacked. Some narrative elements are connected directly with the gameplay. Players can also find many letters and photos and discover the love story of Vincent and his fiancée.\nFeatures:\n•        Unique, addictive gameplay\n•        32 levels set in atmospheric steampunk locations\n•        Several hidden locations and dozens of narrative objects to be explored\n•        Outstanding American and British voice actors including Bruce Glover (known for Diamonds Are Forever and Chinatown)\n•        Original score by Silver Rocket","imageUrl":"https://media.rawg.io/media/screenshots/b0f/b0fc9fce3b662f77d62533dacb360eac.jpg","releaseYear":2017,"developer":"Anuman Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":46927,"name":"Fox Hime","genre":"Adventure","price":0.0,"description":"這是一款國內獨立開發者製作的GALGAME，遊戲劇情以小說形式呈現故事的發展，遊戲裡除了配有動聽的音樂，全程人物立繪使用Live2D表現動態演出效果。在遊戲進程中，玩家不需要太多操作，只需靜靜觀看劇情，偶爾享受一下突如其來的福利情。\n開朗活潑的麗婭，看起來養尊處優的她怎麼這麼饞！\n一起工作的茉莉，為什麼她的​​身上充滿謎團？ ！\n出身、際遇各不相同的主角們，在如同細線一般的思念引領下，相遇、相識、相愛……\n玩家將跟隨初入大學獨立生活的主角的視角，在和性格各異的同學、同事、友人之間的感情糾葛中體驗主角漸漸變化的心境，感受這段曲折、奇妙又有趣的戀愛故事。\n遊戲角色\n麗婭 Liya\n在最陰暗的那段日子裡遇到了她……她像是一束光，亮的刺眼。\n在重拾心情的時候又遇到了她，這是緣分嗎？\n茉莉 Mori\n本該是花一樣的年輕女孩。卻獨自在外流離。\n不知道她經歷了什麼才能這麼堅強，那應該是她的痛處吧。\n希望能幫幫她……\n前輩 Seni\n文史專業的研究生，卻有著不可思議的理性。對自己的人生有著完整的規劃。\n令人羨慕又充滿了尊敬。\n杏 Sims\n大學的同學，出生在一個優越的高管家庭。\n衣食無憂的他，卻也有著很多煩惱……","imageUrl":"https://media.rawg.io/media/screenshots/387/3871727f19fe38411da7fa658bdfd20e.jpg","releaseYear":2017,"developer":"Oichi Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46562,"name":"Elyse the Devil","genre":"Adventure","price":0.0,"description":"After Devil Iblis who wants to conquer the world is defeated by the hero, she is so weak and becomes a little girl. She swears her revenge, changed her name into Elise and starts her journey to take back the power. Can Elise finally revenge successfully? Or degenerate into a sex slave?","imageUrl":"https://media.rawg.io/media/screenshots/5e9/5e92e36a4f1ba2a926f32d8f87d5258a.jpg","releaseYear":2017,"developer":"Dieselmine","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45898,"name":"Ball 2D: Crazy Soccer","genre":"Sports","price":0.0,"description":"Ball 2D is all about reflex and strategy. Are you good enough to master the game? Play and find out. You will have tons of fun thanks to it.\nFeatures:\n5 Game Modes (Soccer, Real Soccer, Hockey, Tennis, Darts)\n24 Stadiums\nMultiplayer\nRealistic Physics\nT-Shirts Customization\nReplays\nStatistics","imageUrl":"https://media.rawg.io/media/screenshots/15f/15f3892cf208ea6f9601d3c6d3e15fef.jpg","releaseYear":2017,"developer":"Unusualsoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":44435,"name":"VTOL VR","genre":"Action","price":0.0,"description":"VTOL VR is a near-futuristic combat flight game built specifically for Virtual Reality.  You are the pilot of an AV-42C, a Vertical Take-Off and Landing (VTOL) capable vehicle that can perform transport, air to surface, and air to air combat roles. Take on a wide array of challenges that will put your flight skills, situational awareness, and combat tactics to the test.\nNo extra hardware is required.  If you have a VR set with tracked controllers, then you have a virtual cockpit where you can reach out and interact with the stick and throttle, flip switches, press buttons, and even pull the eject handle if things go wrong.\nImmerse yourself in action packed combat missions, delicate vertical landings, aircraft carrier operations, aerial refueling and more.Current FeaturesAV-42C Tilt-jet VTOL/STOL/CTOL Attack/Transport vehicle\nFully interactable cockpit via tracked controllers\nVarious interchangeable equipment - guns, rockets, missiles, bombs, etc.\nNear realistic vehicle systems - heads-up display, targeting pod, multi-function displays, radar, IR flares, chaff, etc.\nHead-mounted cueing system\nEjector seat\nRealistic vehicle physics - lift, weight, thrust, drag\nSeveral playable missions - \"story mode\" campaign, free flight, training scenarios/tutorials\nAI wing men - fighter escorts and attack VTOLs\nAI friends and foes - Tanks, artillery, surface-to-air missile launchers, ships, planes\nAerial refueling\nGround based refueling and rearmament\nCarrier operations - catapult assisted takeoff, arrested landing\nIsland/ocean mapPlanned FeaturesTo be added throughout Early Access\n\"F/A-26\" Fighter/Attack Jet\nMore weapons and variants for different roles\nMore missions/complete campaign\nMore maps\nMore types of friendly and enemy units\nBetter vehicle damage model\nCustom mission/campaign editor\nRandomly generated missions\nRadio communication system for commanding wing men and other AI\nATC system\nGeneral improvements to existing features\"Stretch Goals\"If all goes well - possibly in updates after full release\nMultiplayer\nFull modding support\nMore flyable vehicles","imageUrl":"https://media.rawg.io/media/screenshots/a2e/a2e2d42341ad5075accd4f72ca281f11.jpg","releaseYear":2017,"developer":"Boundless Dynamics","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":41541,"name":"Vampires!","genre":"Casual","price":0.0,"description":"Your attention is invited to an exciting logical game about vampires, which will force you to make a lot of effort to pass difficult levels.Features:Logical game\nMultiple levels\nInteresting idea\nMany achievements\nSuitable for children\nDeveloping\nHave you ever wanted to watch how vampires hunt their victims? To take part in this difficult process for the purpose also it's necessary to solve logic problems? If so, then you are interested in the correct game. After all, here you have to solve difficult puzzles about how to get to the victim, you do not have to be trapped yourself, have time to eat before competitors this may not be so easy as it seems at first glance, go through many levels and infect the vampirism of all potential victims!","imageUrl":"https://media.rawg.io/media/screenshots/b3f/b3f50d9004c6bd8c6973351d60dc8e48.jpg","releaseYear":2017,"developer":"For Kids","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":35880,"name":"Spark","genre":"Action","price":0.0,"description":"Spark is an adventure-puzzle game that encourages selflessness and provokes thoughtful problem solving.\nYou are Spark, an animated and bright bundle of energy. Through exploring an electronic maze in the depths of a computer, you come to understand your purpose in life of bringing connection, vitality, and exuberance to those around you.\nBy connecting components, solving puzzles, and powering your world, you find purpose through selfless action and dedication to a larger goal.\nSpark: Virtue Through Voltage.\nPlug in conductors to unlock progression throughout the stages!Manipulate switches to power your objectives.Connect batteries to their sockets to unlock new gameplay possibilities.Play through three different levels, along with a tutorial to show you the ropes.Uncover a mysterious story that reveals your greater purpose as Spark.","imageUrl":"https://media.rawg.io/media/screenshots/ec7/ec7d457cf3fb3aaac0fe664ece77a895.jpg","releaseYear":1991,"developer":"Daph-Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":31744,"name":"Broken Sword 2 - The Smoking Mirror","genre":"Adventure","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/f45/f452d35dd61574ce038358618531e511.jpg","releaseYear":1997,"developer":"Revolution Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":30095,"name":"Submarine Titans","genre":"Strategy","price":0.0,"description":"In the year 2047, a massive comet ravages Earth's surface and the remnants of mankind descend to the bottom of the ocean in order to survive. A century passes, and humans, resilient and enduring, slowly create new life in their cool blue underwater universe. But even in the still of the deep, one truth remains... where man goes, war soon follows. The craddle of civilization has spawned the seeds of man's destruction and now all the oceans of the world are not big enough for the embattled civilizations of the power-hungry White Sharks, the technologically savvy Black Octopi and the alien Silicons. Deploy armies, research technologies, mine for resources and set in motion a plan to gain control of this spellbinding abyss or find the fate of civilization and mankind dead in the water.\nFeatures:\nThree distinct civilizations to play, each with its own objectives, histories, untis, technologies and strategies to master.\nInnovative all-new units classes and structures along with the ability to hide units and buildings in caves, unders cliffs or above opponents creates new twistes in offensive and defensive strategies.\nA fully realized 3D underwater universe including 5 depth/elevationlevels of iridescent swirling waters, winding mountain ranges, dimly lit caverns, cliffs, and dark tunnels.\nAn evolutionary dual control interface allows you to control individual units or entire groups as well as simultaneously planning production and launching attacks on the enemy.\nThree zoom levels allow you to zoom into or out of the game anytime you need.\nA powerful scenario editor and an intelligent random mission generator combine to provide an almost unlimited amount of gameplay.","imageUrl":"https://media.rawg.io/media/screenshots/cd7/cd770ec2823b4851799bfd164805d2a0.jpg","releaseYear":2000,"developer":"Ellipse Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29158,"name":"Full Auto","genre":"Action","price":0.0,"description":"Racing and combat combine in the arcade-style racing game Full Auto. You can choose from 20 cars and 10 different weapons, which can be used to outrun and outgun your opponents. The \"unwreck\" meter allows you to rewind a limited amount of time to undo your mistakes. The game includes pursuit, arena, tag and rampage modes, as well as a 60-event campaign mode and a host of minigames. You can also play online, challenging other gamers via Xbox Live.","imageUrl":"https://media.rawg.io/media/games/970/97067e5f12b9b2602fcf6fffe55e2f58.jpg","releaseYear":2011,"developer":"Pseudo Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28820,"name":"Phantasy Star Universe","genre":"Action","price":0.0,"description":"An epic, science fiction RPG with fantastic visuals. Treat yourself to infinite possibilities! *Online service has ended as of September 7th, 2012.","imageUrl":"https://media.rawg.io/media/games/dbd/dbd2cc5933e61558f07e0602fd03fa80.jpg","releaseYear":2006,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":25393,"name":"FIFA Street 3","genre":"Sports","price":0.0,"description":"FIFA Street 3 from EA SPORTS BIG™ brings to life soccer superstars from\naround the world as stylized action heroes in the ultimate arcade soccer\nexperience for the Nintendo DS™.\n\nFIFA Street 3 creates a fast-paced and larger-than-life arcade soccer\nexperience which places the game’s biggest stars in exotic locales\naround the world. Hit the streets with some of the best Pro Players and\nexperience all the style and attitude of street soccer. Featuring the\nworld’s best players representing 18 of the top international teams,\neach player has been rendered into a stylized caricature with heroic\nqualities. Decked out in authentic training kits and street wear, every\nplayer boasts their own, distinctive style of play with unique abilities\nto match.\n\nWith the all new FIFA Street 3 Touch Screen control scheme you can\ncontrol all aspects of your team’s performance from passing and shooting\nto more advanced moves like juggling, headers and bicycle kicks .Use the\nstylus and simple button controls to seamlessly combine moves together\nbetween players to execute rewarding combos – providing you with tons of\ndifferent ways to showcase your street skills. Fill up your Gamebreaker\nbar and trigger Touch Screen controlled team trick moments to increase\nyour chances of scoring a goal.\n\nFIFA Street 3 on the Nintendo DS features an exclusive mini-game called\nKick Ups that will challenge you to keep the ball in the air and test\nyour ball juggling skills.\n\nBuild your team around your favourite player in Street Challenge Mode,\nand then take them from Pretender to Legendary status by completing\nchallenges, developing Team Chemistry, improving your Reputation and\nunlocking balls, kits and a few surprises. Take your team to the urban\nplaygrounds of South America, the rooftops in Asia, the streets of\nEurope, or a special location in Africa exclusive to the Nintendo DS.\n\nTake your soccer heroes to the streets and experience the revolution in\nstreet soccer.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.\n\n• New Touch Skills Control and Trick System: Ultra-responsive controls\nand an easy-to-use trick system give you instant control over your\nidols. Use the stylus and touch pad to combine flicks, drags and traps\nto pull off impossible moves and show you've got the skills to hit the\nbig time.\n\n• Team of Heroes: Play with the world’s best players representing 18 of\nthe top international teams, plus a few hidden extras!\n\n• Specialist Players: Choose from Tricksters, Enforcers, Playmakers and\nFinishers to give you different skill sets and options on the ball, and\nthen make your mark on the street.\n\n• Game Breaker: Fill your momentum meter to unleash a whole new set of\nover-the-top tricks and electrifying moves to score spectacular goals.\n\n• Enhanced AI: Street-smart players that pass and move with style makes\nFIFA Street 3 the ultimate arcade football experience.\n\n• New Street Challenge mode: Play in a variety of different tournaments\nto unlock new hidden street teams, players and a few surprises.\n\n• New Head To Head Mode: Play a best-of series against a friend.\nCustomize the rules of each match for a true test of skill.\n\n• Playground Picks: Assemble an all-star street team. Take the world’s\nbest players, line them up and take turns to select one to join your\nteam. Prepare for bruised egos!\n\n• Mini Games: Exclusive mini-games in a new game mode called Kick Ups\nwill challenge you to keep the ball in the air to the rhythm of the\nmusic and test your ball juggling skills.\n\n• Exotic Locations: Challenge your rivals in the hottest locales around\nthe world, everywhere from the urban playgrounds in South America to the\nrooftops in Asia to the streets of Europe or a special playground in\nAfrica exclusive to the DS.\n\n• Interactive Environments: Immerse yourself in a hyper-real world where\nplayers run up walls, environments pulsate to the music and your\nsurroundings explode to life with every well-timed tackle, outrageous\ntrick move or unstoppable shot on goal.\n\n• New Online Play*—Challenge your biggest rivals across the world via\nNintendo Wi-Fi Connection.\n\n• Single Card Play – Go head-to-head against a friend who has another\nNintendo DS in a Single-Card Play wireless match—even if they don’t own\nthe game.\n\n• Scenario Sharing—Challenge friends with personalized scenarios via\nNintendo Wi-Fi Connection or by generating unique codes you can input\ninto your Nintendo DS.","imageUrl":"https://media.rawg.io/media/screenshots/d07/d07afdc517d5f6f1fa3a838acabca9b0.jpg","releaseYear":2008,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"}]},{"id":24825,"name":"Fire Emblem: Radiant Dawn","genre":"RPG","price":0.0,"description":"Three years have passed since the great war that ended in the death of \n      Mad King Ashnard. His country of Daein suffers under the rule of the \n      war's victors. Now, a small band of freedom fighters struggle to end the \n      long, dark night of Daein's oppression. Micaiah, Sothe and a host of \n      others – the infamous \"Dawn Brigade\" – rally under the banner of Daein's \n      long-lost prince to bring a new day to this ravaged land.","imageUrl":"https://media.rawg.io/media/screenshots/e05/e05391b37193a3fc5142193d6a303087.jpg","releaseYear":2007,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":23380,"name":"Soundscape VR","genre":"Desconocido","price":0.0,"description":"Soundscape VR is your own private music venue and a mind-blowing audiovisual experience. Featuring tracks sure to delight all fans of electronic music, Soundscape transports the visual excitement of live music and festival stage production into VR while stripping away the inconveniences (and adding physics-defying twists), paving the way for the next generation of music experiences. In Soundscape you don't have to worry about driving to a music venue, don't have to wait in line, get hassled by security, pay 14 dollars for a beer, stand behind someone taller than you, or suffer poor acoustics from an aging venue. Soundscape represents a new musical frontier and vision of the future where artists can connect directly with fans. Now their artistic vision is unlimited, not restricted by the deals they can make with labels, venues, or corporations.\nSoundscape is a cutting edge virtual reality visual experience, and even a 1080ti with supersampling will be heavily taxed. Enjoy Soundscape sitting or standing. Requires a VR headset and motion controllers. Check back with Soundscape often as new upgrades and songs are added constantly, always for free.","imageUrl":"https://media.rawg.io/media/screenshots/0c8/0c81e0471e07ae8057cb3fc61dec4afa.jpg","releaseYear":2017,"developer":"Groove Science","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22124,"name":"Phantom Trigger","genre":"Action","price":0.0,"description":"Stan is losing control. The phantom realm brings arcane hexes into a pulsing neon reality, where demons fight in packs and use every trick they have to break your defense. Throw spells and traps mid-combo, ride the edge of control and chaos in this fresh take on action combat. You are your own worst enemy in Phantom Trigger.\nStory\nYou play as Stan, a white-collar middle-class worker living an ordinary life that gets disrupted by a mysterious event. Discover a brand new world and connect the dots along a branching story through neon-demonic worlds. Phantom Trigger has 4 alternate endings.\nGameplay\nMerging elements from slasher, RPG, and rogue-like genres, Phantom Trigger takes a rich combo system and builds on it, with trapping and freezing enemies, herding groups, burning bosses and dashing from one combo to the next.\nFeatures\nBranching story with 4 alternative endings\n5 Distinct Worlds to explore\nEstimated 7+ hours of gameplay\nA deep combat system focusing on unlocking combos and upgrading weapons","imageUrl":"https://media.rawg.io/media/games/a0b/a0b2821c50f3924aa74f00a101148977.jpg","releaseYear":2017,"developer":"tinyBuild","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":21969,"name":"HoCWar","genre":"Strategy","price":0.0,"description":"HoCWar - is a Collectible Card Game in the World War II setting.\nThis is your chance to become a real General! Bring your armies to the glory in the new card game HoCWar.\nGet caught up in the inclement world of merciless card wars!\nComputer Collectible Card Games today at its popular zenith. However truly original ideas which supplement something new in genre and not just exploiting the features of hits, are not so many. But our new CCG HoCWar goes far beyond many competitors because of its originality.\nHere are just some of features of the game:\n1. World Wat II setting. As in other games the characters are mostly fictional in HoCWar cards represent true mechanisms and troops of USSR and Germany.\n2. Dual-mode format: simplified mode for beginners and hard mode which was designed for lovers of long and intensive battles.\n3. Fog of War: Cells on the battlefield has a visibility attribute. The invisible cells called Hidden.\nThe system Pay-To-Win aren’t presented in the game, In-Game Purchases didn’t affect the balance of the game and don’t give any significant advantage to players. Much more importance has the player’s skill and chosen strategy.\nIn the nearest future the game will present:\n1. “Transitive” cards. It is very valuable cards which can’t be bought and can be received only from the battles. If your opponent use one of those cards in battle and if you won the match, you receive a copy of this card, and your opponent waste it.\n2. “Trophy cards”. It’s a type of card, which you can receive after the battle with certain possibility. It differs from Standard card only by good-looking visualization, but characteristics and perks are just the same.\n3. “Day and night” system. Depending on the time of the day cards and tactics will have different power, for instance: aviation at the night time won’t be such effective as it is in daylight.\n4. Fights on the land, on the sea and in the air; single battles in the format of separate missions and story campaigns; multiplayer combats on the Global Conflict map; upgrading the troops.\n5. Global Conflict. It’s a whole new world in the game, the events of it will be occur on a world map. In the combats on the different areas can participate just the specific kind of troops, for example in the sea you can use only fleet and aviation. “Day and night” system will make a difference in the Global Conflict as well. And the most important thing – the world will split not just among the separate unions, but states and blocs of nations!\n6. New fractions likе Japan, U.S., Poland, Finland, Britain and more to follow, which will diversify gameplay and complement the Global Conflict map.\nIt’s not all of our plans and we will update info about us periodically and keep you posted!\nSee you on the battlefield!","imageUrl":"https://media.rawg.io/media/screenshots/ab7/ab7510f75740a1b2104840c74011ee05.jpg","releaseYear":2016,"developer":"HoCWar","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21752,"name":"BorderZone","genre":"Action","price":0.0,"description":"BorderZone is a role-playing action with a complex non-linear storyline in which the player can choose a profession to his liking (mage, thief or soldier), learn the needed skills and spells, create a team of up to 5 dare-devils and leave for a trip full of danger and unexpected discoveries in the world of Terra filled with various creatures.\nTerra was born at the moment when the old Earth passed away. Due to a global nuclear catastrophe many regions of the planet became unsuitable for living\nand most of the population was atomized. A new world was created - a world where magic and technology adjoin and people are not the only intelligent race at all. After several millenniums the inhabitants of Terra are facing a new threat. Gods come down from heavens and start spreading death and destruction on the planet. You are to enter a violent struggle and you are the one on whom depends the fate of humanity.","imageUrl":"https://media.rawg.io/media/screenshots/094/0944b966ca40296d4e92c27d16d94804.jpg","releaseYear":2005,"developer":"Orion","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21125,"name":"US and THEM","genre":"Strategy","price":0.0,"description":"“Us And Them - Cold War” is a turn-based strategy game about cold war that you can play either as CIA or KGB.\nAlthough it is a game of territorial expansion, the rivals do not attack their opponent using military force. Instead they are using an army of Spies, Assassins and Experts of various kinds (like economy, technology etc.) in order to destabilize the enemy's countries socially, economically, politically and finally to change their governments’ ideology and attach them in their own political block.\nThe player will have to manage resources like money, oil and technology. He must place his units strategically on the map and create a series of spy networks waiting for the right moment to unleash a series of sabotages, assassinations, bribes, revolutions, arrests and interrogations of enemy units. Since most of the units are hidden to the enemy, the collection and interception of crucial information about the countries, the units' attributes and their whereabouts is essential for victory.\nFeatures:\nTake advantage of great Cold War personalities like Che Guevara, Henry Kissinger, Mao Ze Dong, Fidel Castro the Pope and many many more!\nResearch and develop spy gadgets right out of James Bond's laboratories and some famous equipment of real life spies.\nTake part in the historic Space Race\nUse your nuclear arsenal to intimidate the opponent.\nA series of special rules will allow you to deploy special strategies like the “Domino Effect” and the “Communist sandwich”.\nAll units, as a representation of actual persons, have their own skills and attributes that make them unique.\nThe game features a series of random events that in the most part are real events of the cold war era.","imageUrl":"https://media.rawg.io/media/screenshots/45b/45be638bfa1ca8b42e185ef11ef49c6d.jpg","releaseYear":2010,"developer":"Icehole Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20563,"name":"Pale Echoes","genre":"RPG","price":0.0,"description":"The end of the world has come and gone, leaving only phantoms where once there was life.  Now Schorl, the last surviving human, and Spinel, the last of the magical saerii, search through the memories of a bygone era, hoping to find a future.\nPale Echoes is an RPG where exploration, collection, and critical thinking are key.  Travel between the desolate real world and the vibrant world of memories, reliving the events of the past and collecting powerful human memories, each with their own unique skills.\nBattle against and purify echoes, powerful phantoms left behind by the deceased, using a unique battle system where every lost memory you collect is a different character to summon to your aid.  Beware, however, as each memory can only act once, and victory must be attained before your last memory has been used up.\nFeatures:\n• Open windows into the past to see the world as it used to be, solving puzzles and collecting memories to use in battle.\n• A practical puzzle battle system, where the more memories you collect, the longer you can last in a fight.\n• A story of finding hope when all seems lost, and friendship forged in the midst of resentment and despair.\n• Uncover 40 different memories to summon into battle, and 30 different hidden lexicons that detail the history and culture of the world that was lost.","imageUrl":"https://media.rawg.io/media/screenshots/f7e/f7e93c7ac7fc1ba6cbec8a7d0346e6f9.jpg","releaseYear":2015,"developer":"Wyrmling Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20064,"name":"RC Mini Racers","genre":"Action","price":0.0,"description":"RC Mini Racers is a fast paced and explosive racing game with 20+ remote controlled mini cars, lots of missiles and mines, turbos for an extra boost as well as great hard rock music. More than 20 cars can be unlocked within the game and the car pimp shop lets you customize you RC car by changing the color, the wheels and the antenna.\nThe game features 24 tracks separated in circuit races (round tracks with 5 laps) and sprint races (A to B races, no rules, as fast as possible). Beside that there’s a coin racing mode where you can explore the level and collect coins for the in-game store.\nRC Mini Racers has a great mixture of tracks where you need your weapons to win the race by shooting and bombing your opponents from the track but also fantastic high speed tracks where it is mostly down to great driving skills to win the race. Find out yourself which tracks you like most!\nFor nearly every action during a race you get in-game cash rewarded. You get cash for crashing other cars, explosions caused by missiles and mines that affect other cars, for jumping over epic ramps and getting airtime cash, for driving best laps and best race times as well as for winning the top spot ranks in a race. Use that in-game cash to unlock other tracks or convert them to coins for use in the car pimp shop.\nAll tracks can be raced in 4 difficulty modes ranging from easy to medium over to hard and finally the insane mode. Hours of fun guaranteed until you unlocked all tracks in all difficulty modes in all scenarios!\nRC Mini Racers runs in any native resolution your PC or Mac offers – in windowed and fullscreen mode. Graphics settings can be adjusted and tweaked in detail to let the game run perfectly on your machine. Joypads and Joysticks as well as the keyboard can be used to control your car.\nStill reading? What are you waiting for? Get the game and start your engine!","imageUrl":"https://media.rawg.io/media/screenshots/2cb/2cb4353c2a3a1af505b7e139004722d1.jpg","releaseYear":2015,"developer":"Decane","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19023,"name":"Putt-Putt Joins the Circus","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameStep Right Up!\nDiscover the Circus with Putt-Putt®!\nB.J. Sweeney needs you and Putt-Putt® to help his five main acts get ready for the show.  They will encounter challenges and have fun at the same time.\nJunior Adventures challenge and inspires kids to observe details and solve problems in creative and flexible ways. Kids play with faithful lovable friends as they discover and explore captivating worlds where they direct the journey at their own pace.\nProduct Features\nProblem Solving, Uh-oh! What goes into a power shake? Ivan the Semi-Strong Van can barely lift his antenna until his recipe card is pieced together.\nKindness, Splash! Putt-Putt® gladly patches Francine the high-diving hippo's swimming pool.\nTeamwork, Phew! Thanks Putt-Putt®. With the larger umbrella Eunice can safely cross the high wire.\nFriendship, Tra La! Sing under the big big top with your new circus friends!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/f2a/f2ac4fd16b4a1e7bfcdee174c2d69cd4.jpg","releaseYear":2000,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":18959,"name":"UNCORPOREAL - \"Fluffy!\"","genre":"Indie","price":0.0,"description":"\"Fluffy!\", an experimental VR short, is pure camp horror with a script based loosely on the iconic 80's horror film \"An American Werewolf in London\". A surrealistic motel is imagined in the world of the original film, starring a peculiar bellmen (played by Michael Donaldson)who's obsessed with \"pets'. Run length is 1 minute 30 seconds.","imageUrl":"https://media.rawg.io/media/screenshots/35f/35fe4a2aef23184b7a4870474062bdca.jpg","releaseYear":2016,"developer":"Uncorporeal Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17982,"name":"Adventurezator: When Pigs Fly","genre":"Adventure","price":0.0,"description":"The Adventurezator is an emergent adventure game about creating emergent adventure games!\nRock, Paper, Shotgun says:\n\"Madness! Brilliant madness.\"\nYou enter the room. Squinting your eyes under the dim light, you can make up the improbable form of a pig with wings. It is glorious. “We are Pigasus. Mighty game developers”, asserts the airborne swine, “And this here is Adventurezator”.\n“Adventurezator is an adventure game. Well, sort of. You see, we all love adventure games (as all sentient beings in their right minds should) but you must admit that even the best of them lack something very special: good old YOU.”\n“In Adventurezator, you not only play an ever-renewed pile of brilliantly designed point-and-click adventures: you actually get to design your own, and publish them too! The best part? You can do that without all that boring programming, or math. It’s all very technical, but (if we had to put it in layman’s terms) it works like a very fancy cable connected directly to your brilliance.”\nYou stare at the flying mammal for a while, barely containing your happiness. But still, you could use a little more detailed information. Something like a feature list. Maybe with bullet points. Pigasus opens its inventory and gladly gives it to you.\nFeatures:\nAn Adventure Sandbox: create and play your own adventures with no scripting or technical knowledge required;\nWorkshop support: share your creations, and easily play the best adventures the community has to offer;\nFree-form Object Interaction: objects dynamically interact with each other – no need to manually make a cup and a water fountain find what they can accomplish together;\nActor editor: create, save and share your own characters;\nCutscene Editor: show the world your movie-directing abilities have been drastically underrated until now;\nLevel Editor: easily point, click, drag, drop and rotate components to create your own levels;\nCampaign Editor: string your chapters together and create a world-spanning saga;\nFull-fledged campaign and stand-alone extra levels: for your enjoyment and to inspire greater creations!\nMore post-launch content: we will continue supporting Adventurezator with official and community-driven updates;\nPointy. Clicky.\nPigs. Naked, Baby, Flying, Godly Pigs.","imageUrl":"https://media.rawg.io/media/screenshots/7fb/7fb2536868afac0ad420f785ee715678.jpg","releaseYear":2015,"developer":"Pigasus Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17446,"name":"Ballistic Protection","genre":"Action","price":0.0,"description":"Old School Tower Defence game\nBallistic Protection is an old school Tower Defence game with large variety of weapons and enemies.\nBuild your own base, defend it and gain money for upgrades. Hordes of enemies will try to beat you, so show them what you stand for!\nThat's what Tower Defence is all about!\nWith stylish old school graphics, Ballistic Protection brings truly amazing experience of Tower Defence games.\nHardcore levels could be completed different ways. You have maximum power to make upgrades, buy new units and defend the base.\nTowers are unique and all of them have special abilities and gameplay. Splash damage, attack range, direct shot, sniper towers - you can build all of them!\nKey features:\n* Multiple levels can be completed different ways\n* Large variety of weapons and upgrade system\n* Old School style & graphics\n* Hordes of zombies and creatures!","imageUrl":"https://media.rawg.io/media/screenshots/e58/e587778a4079cc645b3b5b17c6161dc0.jpg","releaseYear":2016,"developer":"EHTechnology","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17425,"name":"Project \"Fire\"","genre":"Adventure","price":0.0,"description":"Welcome to \"Project Fire\" - free adventure\\role-playing game! This game is for the people who love good stories, fantasy, sci-fi, steampunk universes, and tactical combat in jrpg style. And yes, it's free for anyone who wants to try!\nThis is a story of two adventurers - chaos mage Alex and pathfinder Maya. They are chasing dangerous enemy across the whole world, where magic came to replace long-forgotten technologies.\nThis is not a heroic tale. You will not save the world. Sometimes you will have to do bad things to survive and reach your goals. How far would you go?   Once humans came from the stars, and now they sitting in the dust. Discover the history of this world, hear stories and tales... Which of them are the truth? It's for you to decide.   Explore hand drawn locations, that will allow you to dive deeper into the story!   Fight mighty enemies that certainly will stand in your way - this is not a joy trip after all.   Your choices sometimes will affect the story - but it will not be obvious.","imageUrl":"https://media.rawg.io/media/screenshots/be4/be46a34dcb77c4650ca61ed603c102aa.jpg","releaseYear":2016,"developer":"Distant Alliance","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]