[{"id":15508,"name":"Leisure Suit Larry in the Land of the Lounge Lizards: Reloaded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c0/2c0f72e354d10172a62d3daaa0902e08.jpg","description":"It’s not just the funniest game you've ever played…\n…it’s also the most infamous video game of all time!\nLeisure Suit Larry in the Land of the Lounge Lizards was first released by Sierra On-Line in 1987 and be-came an international phenomenon. The lovable loser Larry Laffer -- a 40-year-old virgin in pursuit of losing his vir….um, finding true love -- and risqué humor were unlike anything anyone had ever seen or played.\nNow Larry’s original creator, the world-famous game designer Al Lowe, has teamed up with Sierra Veteran Josh Mandel, to bring this amazing, perverted game back to life – updated and expanded in every way imaginable! All we kept from the original game is the plot. EVERYTHING else is fresh and new including:\n•Incredibly lush new high-res graphics! Explore all the seedy sights and sounds of Lost Wages, where fortunes and reputations go to die!\n•A brand new musical score by Grammy-nominated and BAFTA Award-winning composer Austin Wintory! Fresh from completing the musical score to Journey (available for download on the PS3), Austin composed the best music Leisure Suit Larry has ever heard!\n•Everything in the game was rebuilt from the ground up, including all hand-painted backgrounds, characters, and state-of-the-art 2D animation!\n•Thousands of hilarious new lines, gags, jokes, and dialogues, written by Al’s old Sierra partner, Josh Mandel (aka the voice of King Graham from King’s Quest)!\n•New characters, new locations, new puzzles, and a major new love interest for Larry!\nWhat’s more, Leisure Suit Larry: Reloaded is the first major game to be released with funding by Kick-starter! Over 14,000 fans chipped in to bring Larry back to life!\nWill Larry find true love? Will Lost Wages ever be the same? And will YOU want to play any other comedy adventure once you've played Leisure Suit Larry: Reloaded?\nThere’s only one way to find out!\nWow, even more people keep chiming in:\n“This is indeed Larry 1 at its best.”\n–Richard Cobbett, Rock, Paper, Shotgun\n“The city of Lost Wages has never looked, sounded, or played so good, and the additions are mostly huge improvements.”\n–Shane Roberts, Gamezebo\n“Fans who haven’t played the original in decades will smile, chuckle and, above all, be happy to see a character as well-designed and beloved as Larry return.”\n–Alan Danzis, Mashable\n“Just as filthy, funny, and heartwarming as it ever was.\"\n–Suzanne Keller, Slide to Play Score: 4 out of 4\n“You might find Leisure Suit Larry: Reloaded the funniest thing you've ever seen and certainly a bit risque.”\n–Karl Burnett, TouchArcade Score: 4 out of 5\n“Larry’s back (in more ways than one) and arguably better than ever.”\n–Rob Rich, 148Apps Score: 4 out of 5\n“This is a worthy remake that improves upon the original in every conceivable fashion.”\n–Nikola Suprak, Hardcore Gamer Score: 4 out of 5\n“Prepare yourself for something very unique and wholly unforgettable.”\n–Mark Smith, Game Chronicles Score: 4 out of 5","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"nFusion Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10114,"name":"Realpolitiks","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/33a/33aeebb6f2408b18440f522f7d6bab07_QMTIPYZ.jpg","description":"DEMO AVAILABLE!Try before you buy!\nDear customers, we would like to let you know that Realpolitiks Demo is available for free download. Due to the fact that Steam shows only a very small button which is easily overlooked, we have decided to post the info in a Special Announcement Section. You can find the download button next to the green \"Add to cart\" button.\nWe have received several comments from users who are not sure if they should buy the game. The demo offers you a chance to spend several long hours in Realpolitiks and test two scenarios designed to quickly show some of the highlights of the game.\nPlease note that the demo is based on an older version of the game (at this moment). We will update it soon.\nAbout the Game\nRealpolitiks is a streamlined real-time grand strategy game that allows you to become the leader of any contemporary nation. Dive deep into the issues of the modern world, with its current geopolitical borders, using your country’s power and economic strength to engage in military conflicts and international affairs. Choose your own method of coping with other nations' interests, unexpected events, global threats and various crises. Deal with the disintegration of the European Union, terrorism, the aftermath of World War III and many other real and fictional scenarios.\n\nBased on three main political systems (democracy, authoritarianism, totalitarianism), Realpolitiks allows you to extend the influence of your country through various means, all in order to win the race for global domination. Use your diplomatic skills, economic advantages, military power and the full freedom of moral and ethical decision-making to become a world superpower and ensure the well-being of your citizens.\n\nGrow and develop your nation to the highest possible levels of economic power, technological competitiveness and military supremacy in globally-ranked charts. The choice is yours as to whether you become a valued member of the United Nations, or a nuclear tyrant, bullying all those around you. Expand your territory any way you like with the whole-world sandbox gameplay of Realpolitiks, even creating colonies out at sea. And if that's not enough, try spreading the seed of our civilization to outer space...Features:\nLead any country in the world to global domination in various game scenarios.\nShape your country's political system and determine its relations with other nations.\nDeal with internal and external affairs and face threats from natural disasters, terrorism, financial crises and more.\nMake use of common political instruments in your international relations, including spy tactics and espionage to directly influence other nations’ internal affairs.\nTake the moral and ethical high road in your dealings with others, or not...\nHigh replay value ensured by a broad decision tree in all matters, as well as diverse mini-scenarios and random events.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jujubee","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9435,"name":"White Noise 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f32/f3258050d3715b84e30fd592a2e01861.jpg","description":"Enjoy a fresh horror experience with White Noise 2!\nWhite Noise 2 is the sequel of the successful White Noise Online. Be a part of the investigator team, or take control of the creature and devour them! White Noise 2 offers a 4vs1 asymmetric horror experience that won't leave anyone unmoved.Play with your friends\nWhite Noise 2 features a simple matchmaking system that allows you to play with your friends without complications. Enter the game, choose your side or leave it to luck, and start playing!The investigators are back\nAs an investigator, explore the area, cooperate with your partners, and make sure not to get lost, or you'll be easy prey for the creature! Try not to lose your sanity and watch your flashlight battery level to avoid walking blind.And the creature as well!\nAs the creature, stalk your preys and hunt them without being seen. Light can stun you, so use your powers to avoid it and wreak havoc upon the investigators, spreading them to make easier preys. Summon totems that will warn you of the presence of nearby investigators, and prevent them from picking the 8 tapes before you finish them off!Back from the grave\nIn White Noise 2, death doesn't mean game over. Rise as a ghost and take advantage of your enhanced exploration skills to help the remaining investigators in their search.Unlock new items\nUnlock new characters and flashlights as you play, including the classic White Noise Online characters. Each one has different specializations and skills. Do you prefer a stealhty approach, or will focus on speed even while making noise? Better flashlight battery, or improved exploration skills?Relive the best moments\nOf course, the signature replay screen is back in White Noise 2. Once the thrilling session is over, take a laugh checking how the team walked in circles, or one of the investigators got lost!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Milkstone Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":7527,"name":"Detective Grimoire","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/767/76752696836fda4a2846a5bb7fcff520.jpeg","description":"Detective Grimoire has been called to investigate a murder. The owner of a small tourist attraction, found deep within the heart of the marshes, seemingly killed by the very mythical creature his attraction is based around... Explore the surrounding area, inspect the scene of the crime, grill the suspects, solve puzzles, search for clues and uncover the secret of the swamp!\nFeatures\nA mixture of investigating and puzzle gameplay, designed with mouse/touch in mind\nAssemble Grimoire's thoughts to reach conclusions about the case\nA fully voiced and animated cast of characters to interrogate\nBeautiful digitally painted environments to explore\nAward nominated original orchestral soundtrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Armor Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":5143,"name":"Dino Crisis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/838/838b3e1f39cb8e60c9287cc88607bf52.jpg","description":"Survival Horror on a Much Larger Scale.  Your most primal fears grab you on this new journey into survival horror from the creators of Resident Evil®. Suspicious and terrifying... the world's most renowned scientist has disappeared and you've been recruited to investigate on a mysterious, remote island. Suddenly, out of the mist appears a predator, which has haunted mankind's imagination for centuries... experience the pure terror!","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Capcom","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":415364,"name":"Creepy Tale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b5/4b5f453f554f4b0d1a4ce904bfcb63df.jpg","description":"While walking with your brother, everything turns into horror and drags the hero into a series of terrible events. Your brother has been kidnapped, and you are left face-to-face with an ominous forest filled with dangers and strange creatures. Solve the puzzles that you meet on the way, do not let yourself be caught, and save your brother!\nFind out the dark story that befell the once-calm and peaceful forest, turning it into a creepy place filled with evil. Perhaps it is you who will be able to solve all the secrets of the forest and save the peaceful creatures?\n1. Creepy atmospheric puzzle\n2. Elements of a classic quest: collect items and use them in a wide variety of cases.\n3. But this is not only a quest, you will have to hide, run away, jump high, and even ... learn to play the reedpipe!\n4. A truly creepy soundtrack and beautiful 2D art will take you to a dark tale and give you few unforgettable hours!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Deqaf Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":326219,"name":"Destroy All Humans! (2020)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5c/d5c7f753e3715a73827e10ed390c990c.jpg","description":"The cult-classic returns! Terrorize the people of 1950's Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychic abilities. Reduce their cities to rubble with your flying Saucer! One giant step on mankind!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Black Forest Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":65336,"name":"BombTag","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d67/d6745bd79202c45f9dc82c9aca0b9a4c.jpg","description":"BombTag is a free to play online-multiplayer game inspired by Bomberman. Like the classic game, BombTag features fast-paced and chaotic gameplay, with most rounds lasting just a few minutes. Drop bombs, blow up crates, collect powerups, and blow up your enemies - but be careful not to get blown up first!GameplayDrop bombs to blow up crates\nCollect powerups from crates\nBlow up your enemies - but be careful not to blow up yourself or your friends!\nSlide into bombs to kick them away from you, or towards your enemies\nGames end once you or your team are the only ones left standing!FeaturesUp to 8 players per match\nTwo gamemodes - free for all and teams - with more to come!\nSix maps - with more to come!\nCharacter customization (over 800 pieces with Character Customization Pack)\nFriends list and chat\nRank system and online leaderboard\nController support (beta)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"David Schneider","platforms":[{"id":0,"name":"PC"}]},{"id":40276,"name":"Elemental: Fallen Enchantress","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b1/5b14b9c3548d4b7f1b1cb04ca410c230.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":29839,"name":"The Secret of Monkey Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/951/951f914b28b246835a811894bbc38403.jpeg","description":"From Wikipedia:\nThe Secret of Monkey Island is a 1990 point-and-click graphic adventure game developed and published by Lucasfilm Games. It takes place in a fantastic version of the Caribbean during the age of piracy. The player assumes the role of Guybrush Threepwood, a young man who dreams of becoming a pirate and explores fictional islands while solving puzzles.\nThe game was conceived in 1988 by Lucasfilm employee Ron Gilbert, who designed it with Tim Schafer and Dave Grossman. Gilbert's frustrations with contemporary adventure titles led him to make the player character's death almost impossible, which meant that gameplay focused the game on exploration. The atmosphere was based on that of the Pirates of the Caribbean theme park ride. The Secret of Monkey Island was the fifth game built with the SCUMM engine, which was heavily modified to include a more user-friendly interface.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Commodore / Amiga"}]},{"id":29276,"name":"Vickinachi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd5/cd5782f30ef5ed1e0a0980a25003972d.jpg","description":"Vickinachi is a RPG game. You are going to experience the fun mischief with our Vickinachi, there are many levels and design. in each level the vickinachi has to find the invisible doors to reach next level. vickinachi can collect golds, items during his journey. the main aim is to find the princes in each level.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hariharan S","platforms":[{"id":0,"name":"PC"}]},{"id":22959,"name":"Dark Fall 3: Lost Souls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/666/66645011843ba76d04c92762dc2cced0.jpg","description":"Some say the old train station and hotel are a 'haunted hotspot', hidden away in the woods, forgotten by some, feared by others. The old hallways and train platforms echo with the ghosts of many eras, all trapped within the very fabric of the place, each hoping for salvation. The dusty old rooms seem possessed, exhibiting 'time slips' as the past becomes the present. You must tread very carefully, or you too many join the Lost Souls forever. So, why are you here?\nAmy Haven went missing 5 Years ago. On the anniversary of the child's disappearance you, the Police Inspector who failed to find her, has returned to the Train Station and Hotel one last time. As you attempt to solve the mystery of Amy's disappearance you must face the horrors of your past. Someone, or something, does not want you to solve the mystery, that much is clear. Never turn your back on the darkness....for something hides there; something evil, unknowable and hungry.Key features:A stand-alone Dark Fall horror adventure.\nExplore a derelict train station & hotel, abandoned since World War 2.\nExperience 'timeslips' as the past becomes the present.\nCommunicate with ghosts, the Lost Souls, and attempt to free them from purgatory.\nA hauntingly creepy score, to chill, alarm and horrify.\nExplore the memories of the dead, in their own ‘nightmares’.\nDiscover the true identity, and power behind, the Dark Fall itself.\nPlay twisted 'Party Games' including Blind Man's Buff and Statues.\nSolve a modern urban mystery, 'What Happened To Amy Haven?'\nUse a Ouijaboard to meet and communicate with ghosts.\nSurvive the night in a realistic, abandoned location full of danger!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Darkling Room","platforms":[{"id":0,"name":"PC"}]},{"id":17397,"name":"Escape the Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c5/1c5008aaad3b887d0e9298a03225c77b.jpg","description":"Kevin is tired of being in this game.\nCan you help him escape?\nThe game is heavily influenced from games like The Stanley Parable, Thomas was Alone and other story-driven games were choices you make matter. The game is about the comedy, tragedy, and drama in Kevin's escape.\nThrough out the whole game, Kevin will constantly talk with you. Banter on choices you make and tell you about his plans. The game also includes a collection of gadgets with a unique twist to them - to break the game's boundaries. But the question still remains, is it even possible to escape?\nThis is the introduction to a longer and larger game.\nFollow the development on twitter!\n@Insanity_Games_","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Insanity Games","platforms":[{"id":0,"name":"PC"}]},{"id":17168,"name":"CASE: Animatronics","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dab/dabacf984b2ab9a845a3ab66a8ee551f.jpg","description":"Welcome to the police department, where working late can lead to tragic consequences. You're John Bishop, a swamped-with-work detective who tirelessly carries out your investigations late into the night.  But tonight you are pulled from your precious few hours of rest ,and a strange dream, by a mysterious call from an old “friend.” Turning your fight to find the truth into a fight to survive the night.\nYour police department is left without electricity. The security system has been hacked.  All exits are locked.  But that is not the real problem.\nSomeone… something is following you. Red eyes shine from dark corners and the sound of shifting, clanking metal echoes through the once safe halls.. You know them simply as animatronics, but something unknown and horrifying is driving them. Figure out what is going on, survive the night, and remember - no one will care if you scream.FEATURESA tablet to watch the security cameras carefully. You will use a tablet to watch the security cameras, and you need to be seriously careful. Using the environment of the police station is the key to salvation and survival. Be quiet, be alert, move fast.  Your only tools,  the only things you can  rely on, are your legs, your tablet, and a torch.\nHide & Sneak. Use closets and cabinets to sneak between animatronics and try to catch a silent breath.\nAnimatronics. The steel legs and arms will treat you well. Get ready to be confused by their abilities.  Be prepared to react to the unexpected.\nFigure out what’s happening. Explore the police department in search of explanations. Don’t forget to listen to the world around you and keep track of the changes around. The only one that can save your life, is you.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walnut","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16269,"name":"No Turning Back: The Pixel Art Action-Adventure Roguelike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db0/db0dba44c575b101d77214235c16cee3.jpg","description":"Trading Cards\nAbout the Game","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]},{"id":15679,"name":"Out of the Park Baseball 17","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4cf/4cf1688e353c31d67bba3f2ba52d9416.jpg","description":"Out of the Park Baseball 17 - winner of Metacritic's PC Game of the Year 2016 award and now officially licensed by MLB.com and the MLBPA - is the best baseball strategy game ever created!\n\"OOTP is an astonishing accomplishment!\" - Boston Red Sox Principal Owner John W. Henry\nOut of the Park Baseball 17 is a baseball fan’s dream. Step into the shoes of a GM and/or field manager to own the future or rewrite the past of your favorite real-world franchise. Build the team the way you want to. Start a new career with your favorite 2016 MLB team or span through almost 150 years of baseball history and run any team from the past! You can even set up your own fictional baseball universe or compete in online leagues against other OOTP players. The possibilities in OOTP 17 are endless.\nThe brand new 2016 MLB roster set will include all projected Opening Day MLB rosters as well as the complete minor league system down to the rookie leagues and even future draft classes. Can Jake Arrieta, David Price, and Johnny Cueto give their teams the pitching boosts they need? Will Albert Pujols, Chris Davis, and Bryce Harper once again help power their clubs to victory? Can the Kansas City Royals repeat or will the Chicago Cubs finally win the World Series again? Find out and guide your favorite MLB franchise to glory!\n\nDive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch. OOTP players progress realistically over time. Build a team through the draft, or sign big free agents to put you over the top!\nNew Features in OOTP 17 include:\nThe all-new MLBPA license lets players come alive. For the first time ever, Out of the Park Baseball features authentic FaceGen images of real players. With player aging, real-time emotion, and automatic uniform adjustment based on trades and free agency for most major leaguers, you’re more in touch with your club than ever.\nNew 3D animation with moving player symbols making plays and greatly improved authentic 3D major league ballparks deliver the most powerful in-game experience yet.\nAll-new Historical Exhibition mode allows you to pit any two major league teams from 1901 to 2015 against each other in a single game or series of multiple lengths. Or set up any past World Series matchup with authentic rosters automatically imported. What if...?\nAuthentic historical minor league systems from 1919 through 2015 with a database of more than 100,000 real players let you navigate farm systems to unprecedented levels.\nNew support for multi-core processors means that Out of the Park Baseball 17 cranks through simulations and other tasks at up to 60% better speeds than last season.\nAutomatically generated game recap headlines and stories report on key events throughout the games and your overall experience.\nGMs will face smarter, more cunning AI GMs and managers that have individualized, personal approaches to roster-building, scouting, and finances.\nA beautiful, redesigned game interface makes it easy for armchair GMs and managers to build their baseball empire.\nAnd much more, like recoded scouting, better AI, more realistic player development, definable trade needs etc. Dozens of new features await you!\nOwn the future - rewrite the past!\nVisit us on www.ootpdevelopments.com\nFacebook: http://www.facebook.com/ootpbaseball\nTwitter: http://twitter.com/ootpbaseball\nMajor League Baseball trademarks and copyrights are used with permission of MLB Advanced Media, L.P. All rights reserved.\nOFFICIALLY LICENSED PRODUCT OF MAJOR LEAGUE BASEBALL PLAYERS ASSOCIATION - MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA’s written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Out of the Park Developments","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13607,"name":"Roguelands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/316/316579024845f5a5fa9ec45829835914.jpg","description":"In the rush to invent, conquer, and create, the ultimate consequences are sometimes forgotten.\nEarth lies in ruin. Our ever advancing Aether technology opened a rift to another time, unleashing an ancient beast upon the galaxy. Known as the Destroyer, this massive creature travels from world to world devouring the Aether in planet cores only to leave a dead shell in its wake.\nYou play as a Galactic Cadet, tasked with traveling to hostile planets in search of precious resources before The Destroyer rips through the planet core. Team up with friends, gather resources, and craft powerful gear on your home planet so you can aid the fight to save the galaxy!Features: Explore Procedurally Generated Worlds: Each world is generated as you and your Combat Squad beam down. With exotic creatures, hostile monsters, and unique ores and vegetation, each planet provides a different experience and challenge that will test your skill and knowledge of survival in Roguelands.\nUnique Crafting System Gathering resources in Roguelands is unlike any other game. Instead of using a pickaxe or a hatchet to gather resources from ore deposits and trees, you command your Droids to do all of the work for you! Droids have different passive abilities and can cut down trees, mine ores, gather herbs, and even fight for you in combat. Once you've acquired 10 pieces of any loot, you can craft an Emblem. Combine any 3 Emblems at the Gear Forge to acquire a new piece of gear and expand your recipe log!\nPermanent Death, but Permanent Progress Upon death your Galactic Cadet will die: losing all weapons, armor, and loot in their inventory. But anything that you've stored back on your ship will remain persistent across ALL of your characters! After tons of character deaths you'll have permanently unlocked new Races, Variants, Augments, and Starting Uniforms that you can mix and match to create a unique play style. Also, any upgrades to your ship and saved NPCs will be permanent, so your new characters can have access to all of your hard earned resources!\nMaster Every Weapon Type & Variant: Roguelands features tons of exciting weapon types that players can experiment with. By progressing further through the galaxy by slaying monsters and crafting items, players will unlock new weapon variants with unique stats and randomly generated augments. Craft the perfect piece of gear through combining and forging!\nCollect All Combat Chips: Every Galactic Cadet can equip up to five Combat Chips before beaming out to a planet. These special augments can provide not only passive buffs for you and your squad, but also active abilities such as teleportation or enabling the use of Darkfire. Through exploration of both hostile planets and neutral cities and towns, players will amass a collection of these powerful chips and enable a variety of playstyles and character archetypes.\nUnlock the Secrets Behind the Destroyer & the Scourge: The more NPCs you save, the more knowledge you'll acquire about the galaxy's chaotic and mysterious history. Where did the Destroyer come from? What is its true purpose?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SmashGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3873,"name":"Batman: Arkham Origins Blackgate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf4/cf4b7e18dad531077040b03ea04e1079.jpg","description":"Developed by Armature Studio, BATMAN: ARKHAM ORIGINS BLACKGATE is a 2.5-D game set after the events of Batman: Arkham Origins.  Players continue the storyline of the console version and discover more details of the Dark Knight’s past. After gang-fueled uprisings occur within the walls of Blackgate Prison, Batman is called in to restore order and put an end to the rebellion before the chaos implodes.\nFeaturing stealth gameplay, free-flow combat, and Batman’s infamous gadgets, Batman: Arkham Origins Blackgate captures the genuine Arkham feel players have come to appreciate for the very first time on the handheld format.\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\n8000KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\nBATMAN: ARKHAM ORIGINS BLACKGATE software © 2013 Warner Bros. Entertainment Inc. Developed by Armature Studio. BATMAN and all characters, their distinctive likenesses, and related elements are trademarks of DC Comics © 2013. All Rights Reserved. WB GAMES LOGO, WB GAMES MONTREAL, WB SHIELD: ™ & © Warner Bros. Entertainment Inc.(s13)","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"}]},{"id":1300,"name":"Angry Birds Space","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b85/b855766801e0303621f95dc6fb4fa70f.jpeg","description":"The #1 mobile game of all time blasts off into space!\nPlay over 300 interstellar levels across 10 planets! Whether it’s the icy orbs of Cold Cuts, the volcanic explosiveness of Red Planet, Utopia – a planet made entirely of junk food, or the new Brass Hogs episode ruled by evil Hektor Porko, each episode offers intergalactic fun at every turn! And the low-gravity environment of space results in spectacular gameplay ranging from slow-motion puzzles to lightspeed destruction. With brand new birds, special abilities, and a whole galaxy to explore, the sky is no longer the limit!\n-----\n“Intergalactic phenomenon worth every penny” – AppCraver\n“Takes the fundamental physics-based flinging of the original and turns it on its head... It's satisfying, yet completely familiar, and is heaps of pig-smashing fun.” – Gamespot\n“Anyone burnt out on vanilla bird flinging will enjoy the game's out-of-this-world adventure.” -- IGN\n-----\nJoin the global phenomenon as it goes galactic!\nBecome a fan of Angry Birds on Facebook:\nhttp://facebook.angrybirds.com\nFollow us on Twitter:\nhttp://twitter.angrybirds.com\nTerms of Use: http://www.rovio.com/eula\nPrivacy Policy: http://www.rovio.com/privacy\nThis application may require internet connectivity and subsequent data transfer charges may apply.\nImportant Message for Parents\nThis game may include:\n- Direct links to social networking websites that are intended for an audience over the age of 13.\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.\n- Advertising of Rovio products and also products from select partners.\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.\nWhat's New in version 2.1.0:\nFace off against the villainous Hektor Porko in an all new episode: Brass Hogs!\n- 30 new unlockable Brass Hogs levels!\n- Daily missions!\n- Enter the Mirror World! Three-Star levels to play their Mirror World counterpart. Multi-dimensional pig-popping!\n- The Wingman makes his debut in Space with a new special ability!\nPLEASE NOTE: Xbox controller is currently not supported.Key Features:Over 300 interstellar levels!\nNew playable characters!\nUnique special abilities for each bird!\nZero-gravity space adventures!\nTrick shots using planets’ gravity!\nHidden bonus levels!\nBeautifully detailed backgrounds!\nDaily Missions!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Rovio Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":619944,"name":"Icarus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d6/1d66c38dedaf68ff0bd73087128016a3.jpg","description":"ICARUS is a session-based PvE survival game for up to eight co-op players.\n\nEndure a savage alien wilderness on Icarus, humanity’s greatest mistake. Survive its brutal environment as you explore, harvest, craft and hunt while seeking your fortune.\n\nFrom their orbital space station, prospectors drop down to the planet surface for limited time mission sessions in search of rare, valuable exotic materials. Those lucky enough to survive will return to orbit to convert their exotics into advanced technology and take on ever more challenging drops. Those that get left behind... are lost forever.\n\nIcarus was once destined to be a second Earth, but when terraforming collapsed - the air turned toxic and humanity’s hopes of colonizing a new world died. Icarus became a joke, a symbol of humanity reaching for the stars and failing. Yet when xeno-biologists discovered the cause of the failure - exotic matter - new interest was ignited. Valuable beyond reckoning, these ‘exotics’ sparked a gold rush that fueled political tensions between factions on Earth and brought prospectors flocking to Icarus.\n\nConfront and conquer a brutal PvE world determined to wear you down or tear you apart.\n\nFrom toxic atmosphere to savage wildlife and game-altering weather events, Icarus is a planet with a temper. Preparation and planning are everything, whether it’s to find a source of oxygen, stalk your next meal or stock supplies for a long journey into the wilderness.\n\nImmerse yourself in a deceptively familiar, yet alien, world.\n\nThe First Cohort of prospectors has been granted initial mining licenses for over 64 square kilometers of hand-crafted terrain full of hidden corners and resources to mine and diverse biomes to explore. Use the resources around you to survive - every single tree is harvestable, every rock can be voxel mined.\n\nMaster two separate tech trees: planet-side and orbital.\n\nUse the planet’s resources to craft tools, structures and machinery to protect yourself and aid your mission. Then return to orbit with rare exotic materials that you can engineer into advanced tech. Choose which tech to take on your next drop so you can complete missions faster, travel further, automate production or improve your odds of survival.\n\nYour time on Icarus is limited, so always watch the clock and use every second wisely.\n\nThe orbital space station waits for no one. If you fail to return to your dropship in time, there is no rescue. Your character’s progression and tech is lost to planet Icarus. Every drop has a clear goal and time limit, but how you overcome its challenges... is up to you.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"RocketWerkz","platforms":[{"id":0,"name":"PC"}]},{"id":351003,"name":"Roguebook","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/021/021e9b567a8f65c3c5adf37282564047.jpg","description":"Roguebook is a single-player roguelike deck-builder that takes place in a procedurally generated world.\nEnter an ever-changing world full of legendary encounters and stories. Craft your cards, assemble the perfect deck and defeat the Roguebook itself... or die trying.\nRoguebook is the second major game from Abrakam, the creators of the strategy card game Faeria, which launched in 2017 and has the best rating for a CCG on Steam with 86% positive Steam reviews and 1 million downloads.\nEvery time you play, the Roguebook generates a new world for you to explore. Said to contain all available knowledge in the world, rumors are whispered that those who dare to read the Roguebook can gain omniscience and attain near god-like status.\nThe pages within are filled with dangerous creatures, ancient legends, and exotic lands from the world of Faeria. The Roguebook itself is a mischievous entity with its own goals and motivations. It is able to rewrite itself entirely, always with the intent of tricking and fooling those who read it - trapping them for eternity.\nWill you be able to outsmart the Roguebook?\nYour adventure begins by selecting two heroes that will explore the Roguebook together. Each hero has their own special abilities and strategies. Combine different heroes for a completely different play experience.\nThe combat in Roguebook focuses on dual-hero gameplay. Each hero supports the other in different ways, from unleashing explosive combos to protecting the other from damage.\nCore Battle System\nDuring battles, the hero in front is the one normally exposed to damage.\nWhenever you a play a card belonging to the hero in the back row, your heroes will swap positions.\nIf any hero reaches 0 health, they become inactive for the rest of the battle and have their cards removed from the deck. After the battle, that hero is healed back to a low amount of health and two Wound cards are added to your deck. A Wound is a card that's not playable and will only act as a handicap. It is said that finding a helpful wandering monk can help you remedy these wounds...\nIf both of your heroes reach 0 health in the same battle, your current run ends and the Roguebook wins.\nEach card in Roguebook has a chance to have a certain amount of sockets. In these sockets, you can place a wide variety of gems to upgrade them in interesting ways. Gems also have assigned rarities. The rarest of them can completely transform your deck.\nIt's up to you to find the best way to use your gems with your deck, allowing for an infinite amount of customization. This vastly increases the ways you can break the game... exactly what we love about roguelikes!\nEach time you enter the Roguebook, it will generate a unique world for you to explore. Gems, cards, relics, encounters, and all sorts of legendary stories are randomized to guarantee a fresh experience with each new reading.\nYou can move around the map freely and decide which area or encounter you'd like to visit. Fog of war will prevent you from seeing the whole map, so some exploring will always be necessary. It's up to you decide which areas you'll discover, but be quick - for the Roguebook is always nipping at your heels as you go. Between fighting and looting, you will sometimes meet friendly NPCs: Fugoro the Shopkeeper, the Wandering Monk, the Court Jester, the Jeweler, etc.\nThe Roguebook contains the entire history of Faeria within its pages, including every legend and story that has ever been told around the campfire. Your heroes will encounter all manner of exotic beasts, endure powerful magic, and solve challenging problems.\nWe loved Gamebooks and would love to explore their narrative aspects in Roguebook. Each hero will have their own unique traits, like Wisdom, Cunning or Strength, giving them new possibilities to solve situations they encounter. Also, we want to have chain of events. For instance, the second or third time you meet the Apex Predator, the story will change depending on the results of previous encounters.\nThe game is strongly connected to the already established Faeria universe.\nThe Roguebook began as an esteemed book of lore from the world of Faeria. After the events in the Chronicles of Gagana take place, it was lost and forgotten inside the depths of a faeria well. There it lingered for over a decade.\nThe contact with this endless source of faeria transformed the book in a terrible way. Over time, it slowly develops its own free will - and reaveled its mischievous personality. By this time, characters like Sharra and Seifer have grown into heroes and villains of legend in their own regard. Their thirst for finding new challenges will draw them to this powerful artifact, now known as the Roguebook.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Abrakam","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":247058,"name":"Rebel Galaxy Outlaw","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/274/274d4c452a0bfed04db9e9de1795232b.jpg","description":"Out of cash, out of luck, out on the fringe. Juno Markev has a killer to tail, a debt to pay, and more trouble headed her way. Rebel Galaxy Outlaw takes place in a greasy, blue-collar world of outlaws, truckers, cops and thieves.\n\nStrap into a variety of spacecraft, settle a score in a filthy space-bar over a game of 8-ball, rock out to over 24 hours of music, and engage in white-knuckle dogfights.\n\nIn the Dodge Sector it’s hard to get by – and even harder to get even.\n\nRebel Galaxy Outlaw is an open-world space combat adventure game, spread across the nearly 40 systems of the Dodge Sector. Play as a mercenary, a trader, a pirate, or whatever mix of the three you feel fits you best. With an engaging storyline and a full conversation system, you can follow the narrative, or ignore it and forge your own path at any time.\n\nEngage in white-knuckle combat, and use the included Autopursuit function to effortlessly fly like an ace, instead of space-jousting for hours. Save up your credits, buy a new ship, kit it out, and then paint it in a fully-fledged 3d-painting application. Make a fortune exploiting lucrative trade routes. Join guilds, help or hunt those in distress, buy and outfit your own space station. Grab a tip in a local bar and hunt hidden treasure. In your down-time, shoot some 8-ball, play some dice-poker, or aim for the high-score in an arcade game in the local seedy watering hole. Flip through the 7 included radio stations and vast music library for just the right track to fit your current mood.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Double Damage Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":47463,"name":"The Invisible Hours","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ade/ade114cd58e4b219318aee0fe8f439d4.jpg","description":"The Invisible Hours is a complex murder mystery in VR, in which players freely explore an intricate web of interwoven stories within a sprawling mansion.\nA group of strangers receive a curious invitation from the enigmatic inventor, Nikola Tesla, offering each of them the chance to make amends for their darkest wrongdoings. When the last guest arrives at Tesla’s isolated mansion laboratory, they find him dead – murdered. Disgraced Swedish detective, Gustaf Gustav, vows to find the killer amongst the other guests: a blind butler, a convicted murderer, the world’s most famous actress, Tesla’s former assistant, the son of a wealthy railroad magnate, and rival inventor Thomas Edison. But none of these people are what they seem.\nThe player is invisible, with freedom to follow and observe anyone in the story – or to explore the mansion for hidden clues.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tequila Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":42744,"name":"Thinking with Time Machine","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e4/3e4524f50f85aae29885bc57d0313ee9_du9lUlN.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stridemann","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":30666,"name":"Command & Conquer: Red Alert 2 - Yuri's Revenge","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e26/e26670c17cc10bfa963cbb97e8e70d56.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20902,"name":"Flix The Flea","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d9/2d986885eb0c07a84195c955211d2895.jpg","description":"FLIX THE FLEA is the high flying platformer from one-man game studio, Psychotic Psoftware.\nFlix is a flea who lives on a Dog, who lives on a space-exploring rocket-ship. While exploring a new planetoid, Flix takes an unfortunate nosedive into a chasm. It's your mission to guide Flix up and out of monster infested caves in the hopes of getting him back to his rocket-ship and the sanctuary of his cozy doggie home.\nHighly inspired by the wonderful 8-bit classics, Flix The Flea returns to an almost forgotten sub-genre of cutesome high-jumping platform games. With a host of challenging environments and features, Flix creates just the right balance of fun and frustration for a very entertaining & addictive gaming experience!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Psychotic Psoftware","platforms":[{"id":0,"name":"PC"}]},{"id":20111,"name":"Silver Creek Falls: Chapter 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90e/90e280d767b9ab2f55a7540453f11c42.jpg","description":"The Walsingham Files Kickstarter\nWhats Next?http://store.steampowered.com/app/403070/Silver_Creek_Falls_Chapter_2/?snr=1_7_7_230_150_1\nhttp://store.steampowered.com/app/441060/Silver_Creek_Falls__Chapter_3/?snr=1_7_7_230_150_1\nAbout the GameThe captain has told you to visit Twin Peaks? No Silver Creek Falls. You arrive at your first crime scene. There is blood all over the floor and everywhere you would expect and even where you could not possibly expect! You have been assigned as the police detective for this special case with a new partner. Everything about this day is foreign to you including your newly assigned partner.\nTwo city detectives are sent to a small idyllic town in North Carolina called ‘Silver Creek Falls” to investigate a strange series of events that the local sheriff can’t seem to get his mind around. What initially seems like an open-and-shut case unfolds into a truly terrifying mystery that will leave the detectives wondering what is real and what isn’t.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sapphire Dragon Productions","platforms":[{"id":0,"name":"PC"}]},{"id":17296,"name":"Princess.Loot.Pixel.Again","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1f/a1f9ab8d22a2e99f1600a575becf0f54.jpg","description":"Like roguelikes?http://store.steampowered.com/app/462200\nAbout the GameRescue the King from of a Evil Mage!\nGet a beautiful Princess’ hand in marriage!\nUse various equipment and artifacts!\nDodge from enemies attack and jump over the spikes!\nEnjoy pixel retro stylistics!\nHave you already done this before? Do it again!\nPLPA is a dynamic platformer with a combo system and special strikes, there is also a bit of rogue-lite genre. The principal aim is to get through all floors of the Dark Tower and outfight the main antagonist a Evil Mage. That’s not easy due to a instant death which is followed by a full castle structure regeneration.\nFirst of all, success in the game depends on player’s skills, not on random. The player learns the game mechanics, operation of certain artifacts, items, skills and also behavior of enemies and bosses. The keynote of this gameplay is for a gamer to learn from mistakes and pump his own skills, but not only the protagonist’s ones.\n-The main thing about the game is having fun! No farming and excessive complexity.A gamer will face lots of fun things, unusual situations, easter eggs and references to other games. Self-irony also takes place.\n-The total generation of location structure, objects, artifacts, traps, enemies and bosses.\n-12 characters, different in performance and equipment.\n-Create equipment and pump it with stones, runes and enchantment.\n-Hidden features and events.\n-All of this and much more are seasoned by hurricane-like action with various strikes, skills and spells!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EfimovMax","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":7548,"name":"Cards and Castles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/100/100e0786177550010a92fa394dae211c.jpeg","description":"Collectible cards come to life in CARDS AND CASTLES! Collect cards, build decks, and compete against other players in strategic tactical battles. Your cards turn into expressive animated characters when you play them on the game board. Position your pieces carefully and strike when the time is right!\nGet free cards every day just for logging in!\nRank up and earn special rewards by competing against other players. The innovative SUDDEN DEATH mechanic ensures your matches never drag out!\nCombine up to two factions for unique deck combos. Play as Vikings, Crusaders, Pirates, Warlocks and Ninjas!\nCollect newly released cards every month!\nCompete in weekend Draft Tournaments for great prizes!\nPlay on Steam, Mobile or Tablet all with the same account. Cards and Castles is a fully cross platform game!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red Team Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5808,"name":"PewDiePie: Legend of the Brofist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46a/46a28691e8b9514831f520392e18de82.jpg","description":"Join your favorite YouTubers on an Epic Quest in PewDiePie: Legend of the Brofist.\nEnjoy this amazing 2D platformer!\nEVERYTHING YOU LIKED ABOUT THE MOBILE VERSION, NOW WITH COOP MODE!!\n⋆ COLLECT BROCOINS to buy new CHARACTERS, ATTACKS and DEFENSES!\n⋆ UNLOCK ALL THE YOUTUBE STARS and try to beat the game as PewDiePie, Marzia, CinnamonToastKen, JackSepticEye, Cryaotic, Markiplier and more!\n⋆ REAL VOICE ACTING by the YouTubers!\n⋆ FIGHT EPIC BOSSES to save your fans!\n⋆ BEAT ALL DIFFICULTY LEVELS and prove that you are a hardcore gamer!\n⋆ CHALLENGE YOUR FRIENDS in the survival arena and brag about your score!\n⋆ COLLECT ALL THE SECRETS hidden in the stages.\n⋆ AMAZING CHIPTUNE MUSIC by RUSHJET1!\n\"Legend of the Brofist is one of those rare games attached to a license that will appeal to just as many people who have no link to PewDiePie whatsoever as those who do.\" 10/10 -Trusted Reviews\n\"Kickass chiptune soundtrack, colorful levels, and tight touchscreen platforming.\" 8.5/10 -Destructoid\n\"PewDiePie: Legend Of The Brofist is a solid game.\" 4/5 -TouchArcade\n\"Plenty of potential for replayability using the different characters and power-ups, as well as taking on the higher difficulty levels.\" 4/5 -The Guardian\nFOLLOW US:\nfacebook.com/OutermindsCreations\nTwitter @Outerminds\n© 2015 Outerminds Inc. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Outerminds","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":62506,"name":"Flynn: Son of Crimson","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ed/1ed69a78ea0237bbccd7b12b118396c2.jpg","description":"Flynn: Son of Crimson is a 2D action adventure platformer with metroidvania elements. Set in a wondrous world with a looming darkness beginning to awaken yet again.\nWhat can you expect?\nExplore a wondrous world filled with discovery, taking place in unique regions designed with non-linear exploration.\nSwap between multiple weapons with quick and satisfying combat.\nDive in to a land with ancient mysteries and rich story.\nTravel across the lands, discovering new ways to roam and opening new paths using the power of crimson.\nDip in and out of an alternate dimension to make unique alterations to the real world.\nView a realm full of life, carefully formed with hand-crafted pixel art.\nTrade trinkets for new combat techniques and runes with an old war veteran.\nCall on your companion Dex in times of need, a mystical and loyal creature.\nTest your strength in the feared Rustwood coliseum among other challenging feats.\nTake on the role of Flynn, a young man orphaned as a child who sets out to chase the shadows of his beginnings whilst awakening the ancient power of Crimson within him.\nDiscover relics of ancient Rosantica, effigies and monuments to the goddess Sorrell that reveal hints at Flynn’s beginnings and unlock new powers. Reveal secret pathways, trade with villagers, battle fierce monsters, hang out with dogs.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Studio Thunderhorse","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":21432,"name":"Fingered","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3d/c3d27fd67c7dc91bdb7eed08c4cbbd51.jpg","description":"GUILTY! THEY ARE ALL GUILTY!i mean really just look at them, you can see the guilt...\ni feel guilty just looking at them...\ncan you point the finger at your fellow man?\nare you ready to finger yourself?\ncan you do your job?\ntrim your nails, put on your listening eyes and peer deeply into the skin folds of the usual suspects...\nwill you become a true hero?\nor will the fleas become too much for you?\neither way, i think there is a future in this for us.let's do this!\nFINGERED is a \"whodunit\" hyperrealisic police sim where you must finger the guilty and clean up this darn city using the descriptions of the local busy bodies. but everyone's perspective is different: one man's fat is another man's sexy!\nwill you put an end to all crime in america with the electric finger of the law?!\nanswer - yes!features:21 levels of confusion\na few billion randomly generated people to finger/murder\nbarking\nloads of secret celebs to murder!\nfind yourself in the criminal data base!\nbuttons\nsounds\nmenus","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Edmund McMillen","platforms":[{"id":0,"name":"PC"}]},{"id":21047,"name":"Belladonna","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea7/ea73ce52f0e77d5c915b915b50171758.jpg","description":"A deadly plague, a forbidden ritual\nExperience the cursed life of a hunter once bound by love and family, now driven to uncover the mystery of vanishing villagers and whispered rituals. Journey through treacherous areas of Ricci Estate where vampiric monsters lurk, while gathering an arsenal of weapons and magic. Fight as Belladonna, where death, madness, and the burden of sorrow weigh heavy upon her every move.\nRelics of the past, ancient arts restored\nEngage with a dynamic combat and magic system, with a variety of weapons that have unique attack patterns, and imbue them with different magic types that alter how you engage with twisted foes.\nExplore a world of puzzles and secrets\nSolve unique puzzles and objectives throughout the levels, and search for secrets to uncover the truth behind everything.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Neckbolt","platforms":[{"id":0,"name":"PC"}]},{"id":21031,"name":"Lost Chronicles of Zerzura","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/878/8783cfb45dbe67e52ea737e8d612c719.jpg","description":"Join a young inventor on the expedition of his life. A remarkable journey from Spain, across the Mediterranean, to distant Africa; a quest to save his own soul and lives of those he holds most dear.\nTwo brothers operate a workshop that is well ahead of its time in Barcelona of 1514. It's the time of the golden epoch of the Renaissance, a time of discoveries and inventions; but also the brutal age of the Inquisition.\nOne brother puts all his efforts into building a flying machine, while the other dreams of Egypt and mysterious art treasures. The advanced ideas and exotic fantasies weaved by the pair arouses the suspicions of the Grand Inquisitor.\nQuite suddenly their small world is turned upside down as one brother is taken away by the Inquisition; leaving the other  alone to search for answers that will set his imprisoned sibling free.\nExplore the ravishingly beautiful and detailed locations of this remarkable adventure as you become immersed in this mysterious medieval tale and solve a unique combination of puzzles, mini-games, and other challenges that are perfectly integrated within this breathtaking storyline.\nEvade further attacks by the inquisition, and forge strong alliances with those you meet along the way.  Trek across different countries and cultures and eventually to the legendary desert city of ZERZURA, where an ancient terror guards over powerful secrets - and poses the greatest challenge of all!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cranberry Production","platforms":[{"id":0,"name":"PC"}]},{"id":20638,"name":"Shot In The Dark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/598/5980930f50a8e5782b257f3edeb5d62b.jpg","description":"Shot in the Dark is a classic western tale of bloody vengeance, rituals, and teeth in the dark. Take up the gun of the lone bandit as they stop at nothing in the pursuit of vengeance. The only thing standing between the bandit and their quarry are the occult nightmares lurking in the darkness. From demons to cultists and long dead gunslingers, all manner of foes are arrayed against you.\nShot in the Dark offers a unique challenge, combining nail biting pixel perfect platforming with precise point and click shooting. But many of the cruel creatures of the night remain hidden in shadow. The bandit will have to be on the lookout for glowing red eyes, shadows moving through the trees, and figures lurking in the night. Because sometimes the only sign of a demon on your trail is the slight movement of the tall grass. And  sometimes all you can do is take a shot in the dark.\nGrab the DEMO today at:\nhttps://possumhousegames.itch.io/shot-in-the-dark\nor\nhttps://possumhousegames.com/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Technomancy Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18456,"name":"Aberoth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/318/3184d040d3f121cc9de3d5fce861ef57.jpg","description":"Aberoth is a fantasy massively multiplayer online role playing game with charming retro graphics and tons of freedom.\nYou start your adventure in an orcish prison with no possessions or skills. Once you escape, your journey of exploration begins. To survive, you must acquire items, learn skills, and join forces with other players to combat the hordes of enemies who inhabit the world.\nWhat makes Aberoth unique?\nNo dungeon instancing.\nEnemies pick up and use equipment, potions, scrolls, and magical items they find.\nDropped items never disappear.\nYou can build permanent structures with items.\nUnrestricted trading. There are no soulbound or no-drop items.\nFull PvP. Player killing is allowed almost everywhere (but the game contains many anti-griefing mechanisms).\nTame monsters and make them your pets.\nPolymorph yourself and play as a monster.\nOver 200 unique items to discover. Item graphics are never reused for different items.\nOver 30 different monsters to defeat.\nOver 60 quests to complete.\n16 large areas to explore.\n9 Non player characters to interact with.\n8 unique skills to master.\nFree to play with no registration required.\nWorks well on low end systems.\nNew content almost every week.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Castle art by Yuriy Gusev","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17492,"name":"Higurashi When They Cry Hou - Ch.3 Tatarigoroshi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ac/8acf7d0847aacd608203f15586ef4721.jpg","description":"The 58th year of Shouwa, early summer.\nIt’s June, and the summer heat has arrived earlier than it does most years.\nBy day there are crickets, and by night there are cicadas.\nWe’re in Hinamizawa, a small village in the countryside.\nThere are fewer than two thousand people here. But every year, there is an event.\nThis event is a mysterious death.\nOn a certain day in June, someone dies, and someone else goes missing.\nThe series of deaths is connected to the upheaval surrounding the dam construction project.\nA murder case that was covered up is being reenacted.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there isn’t.\nSomeone who wasn’t supposed to be there is.\nSomeone who was alive last night is dead now.\nAnd someone who is here right now isn’t alive.\nSo, there is no way to avert tragedy. There is no choice but to give up.\nBut don’t give up.\nOnly you can stand up to this.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"07th Expansion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17144,"name":"Raptor: Call of the Shadows (1994 Classic Edition)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c17/c174b562bcc03a10330d1a3e382010fa.jpg","description":"Raptor set a new standard for PC shooters. Its smooth VGA graphics and heart-pounding music will leave you breathless.\nDiscover secrets, find bonuses, and battle boss ships at the end of every wave. With each ship and ground target you destroy, you'll earn more cash to increase your ship's technology for the next wave. You'll be driven to kill and destroy until it's in your blood!Features\nBig-Screen Shooting: Ultra-detailed, smooth-scrolling VGA graphics and explosive cinematics.\nHardcore Harold: Up to 16 ship upgrades can be bought from Harold's Emporium between waves.\nGet Ready, Rookie: 27 killer levels, each with at least one unique boss ship to destroy.\nZero to Hero: Four insane skill levels - higher skill levels introduce new opponents!\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"DotEmu","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":14941,"name":"Lucid9: Inciting Incident","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2df/2df8d57f0c304b5f6b2c755f29da7310.jpg","description":"Lucid9 is a mystery visual novel where your choices affect the outcome of the story.\n--------STORY--------\n// D-DAY.\nYou're a murderer.\n// 1 DAY PRIOR.\nYou can’t trust anyone. You lose your mind.\n// 3 DAYS PRIOR.\nSomeone dies before your eyes. Your friends distance themselves from you.\n// 4 DAYS PRIOR.\nYour school enforces a curfew. You nearly drown. Your past catches up to you.\n// 6 DAYS PRIOR.\nYou learn that students at your school have been disappearing into nothingness. You visit an amusement park with a bunch of friends anyway.\n// 8 DAYS PRIOR.\nYou take a history exam. Maybe you pass, maybe you fail. Then you participate in a treasure hunt in the sketchiest part of the city. Thankfully, nothing happens. Or maybe something does.\n// 9 DAYS PRIOR.\nYou visit a career fair to review your options. Doesn't seem like there is a bright future ahead of you. You also meet a crazy woman with a vocabulary larger than her height who claims to be a detective.\n// 10 DAYS PRIOR.\nYou immerse yourself in classes, friends, and an everyday routine. You eat copious amounts of fried chicken and are press-ganged into advertising for a club you're not even in. This is where the game begins.\n// THE THING IS:\nYou can choose to fight this outcome.\n--------ABOUT LUCID9--------\nLucid9 is a visual novel focused on a web of intricate mysteries set in the fictional 2018 metropolis of Isamu. Inciting Incident is the first part of the story, where you play as Yama Ishimoto, a cynical high school student who would like nothing more than to keep his life free of school drama and hard choices. However, he’s forced to face his circumstances when an eccentric detective blazes into his life, alerting him of a string of brutal murders at his school.\nAs Yama furthers this investigation, he must dig through the secrets of the city, bringing him and his friends closer and closer to danger in the process. Every step leads Yama to the most unexpected - and terrifying - culprit…\n--------DEVELOPERS--------\nLucid9 is being created by Fallen Snow Studios, an international group of visual novel enthusiasts who seek to make a VN by fans for fans. As Lucid9 is a passion project that has been created without any budget so far, we are aiming to release it free of charge in order to both engage established fans of visual novels, as well as introduce newcomers to this unique storytelling medium. We are working our hardest to make sure the rest of the story will be available for free as well.\n--------UPCOMING--------\nFree Voice Acting patch: All of Inciting Incident will be fully voiced in English by Yin Yang Voices. Recording production has already begun, but it's a deliberate and lengthy process. Consequently, we're aiming to release the patch for the voices in 2017.\nSecond arc of Lucid9: We are currently working on the heroine routes, which will comprise the second part of Lucid9. They will be included in a future patch. There isn't any precise release date for this patch, but we will make sure to share progress regularly with all of you.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fallen Snow Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":525,"name":"Game of Thrones - Episode 1: Iron from Ice","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b69/b69dc27c76eaf80e1280c083992ebd44.jpg","description":"Download Episode One of Game of Thrones: Season One, a six part episodic game series set in the world of HBO's groundbreaking TV show. This new story tells of House Forrester, a noble family from the north of Westeros, loyal to the Starks of Winterfell. Caught up in the events surrounding the War of the Five Kings, they are thrown into a maelstrom of bloody warfare, revenge, intrigue, and horror as they fight to survive while the seven kingdoms tear themselves apart.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]}]