[{"id":58993,"name":"Candle: The Power of the Flame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf4/cf49a7aa8498c3ead491af41f3da95cb.jpg","description":"Candle is an adventure with challenging puzzles. Play as Teku, a young novice on a dangerous journey to rescue his tribe's shaman from the evil tribe of the Wakcha. But the way is littered with sinister traps and difficult obstacles. To master these challenges, you need to have keen eyes and a good sense for your environment, or your next step may be your last.\nBut Teku has a special gift: his left hand is a candle. Let it be a bright beacon to drive off your enemies or to shed light on dark places.\nGorgeous hand-painted watercolor visuals give Candle that special flair, as all backgrounds and characters have been carefully drawn and then scanned, picture after picture. The game consistently feels like a living painting.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Merge Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":35995,"name":"Uncharted Waters Online","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de5/de5eed35a3449a376381a307fdb974e7.jpg","description":"Voyage across the globe and through the ages, exploring the empty corners of the map. Discover lost civilizations and artefacts, command a lucrative trading fleet, terrorize the seas as a bloodthirsty pirate - the choice is yours!Key Features:\nA WORLD OF POSSIBLITIES\nBecome and Adventurer, Soldier, or Merchant and conquer the seas however you choose! Take on over 75 professions and train over 100 different skills to create your perfect Captain. Each level unlocks new abilities and locations around the world, plus dozens of unique customizations to truly stand out from the crowd.\nCOMMAND YOUR FLEET\nCaptain over 500 ships from across history, each with their own specialties and abilities. Helm a nimble exploration ship, a deep-hulled trading vessel, a warship armed to the teeth, or something of your own creation. Each ship has its own set of deep customization options, allowing you to craft the fleet of your dreams.\nACROSS THE GLOBE, THROUGH THE AGES\nExperience the historic Golden Age of Exploration in a massive open game world dictated by player actions. Interact with global diplomacy and realistic exchange markets and participate in historical events controlled by a server-wide World Clock that radically impact the game world.\nGATHER YOUR CREW\nForm a fleet with your friends and strike out on the seas together. Work together to explore the world, complete quests, battle foes, and synergize your skills to make a name for yourselves in the world. You can even open your very own bazaar and exchange with other Captains to expand your trade empire!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"}]},{"id":23451,"name":"World War II Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/780/780c7b86ae494d9a2edc06f586dca4a2.jpg","description":"Release ScheduleWWII Online will be released between September 5th - September 22nd 2017. This is to ensure best game experiences and ramp up our player numbers. These dates are subject to change based on outcomes of unlocking each region.\nSeptember 5th: Canada, Mexico and South America\nSeptember 8th: United States of America\nSeptember 12th: All of Europe\nSeptember 15th: All of Asia\nSeptember 19th: Oceania\nSeptember 22nd: The rest of the world\nAbout the GameWorld War II Online is a Massively Multiplayer FPS, simulation game set in the Western Front of WWII. The game offers a strategic and persistent winnable Campaign that is completely player-driven, both in the strategic planning and players fighting to control territory.\nThe Virtual Battlefield Does Exist!ALL OUT WAR, ON A MASSIVE SCALE\nIts scale is a massive 300,000 SQ KM that is an interconnected and zone-less game world offering total freedom for players. This scale allows for truly immersive combined arms pvp combat. Communication between the Army, Air Force, and Naval units that are engaged will help determine the outcome! There are no limitations to how many players can interact in a battle space.SERIOUS HISTORICAL ACCURACY\nAll weapons, vehicles, munitions and ordinance perform according to realistic values. We have achieved this through direct access to historical archives, a network of military experts and our advanced proprietary game engine that goes in depth like never before. Armor on tanks and aircraft, as well as their internal components, are modeled down to the millimeter.HIGHLY DETAILED DAMAGE MODELS\nOur damage models go into extreme detail with each component being destroyable in vehicles including crew, weapon storage, gas tanks and more! You don’t just shoot a hitbox? NO! With every shot fired, multiple calculations take place that determine the round impact consequences. Some of these include; angle of obliquity, speed of round at impact, thickness of the armor, internal spall, armor penetration, parts of tank damaged, etc.FAIR GAME PLAY FOR ALL\nJust like in real life, the outcome of each engagement will be determined by strategy, tactics, teamwork, and your weapon handling skills! In WWII Online there are no special power ups or item buys giving someone a special advantage against other players. Every rifle is just as lethal whether you are a premium subscriber or a free player.CREATE YOUR FREE ACCOUNT NOW!\nSince our original release in 2001, our community and game has provided memorable and challenging game play experiences. WWII Online’s game play is unmatched in terms of scale, realism and replay ability. (Expand for more game details below)\nDo you think you’re hardcore enough to play with and against some of the most battle-hardened WWII FPS gamers around?\nSign up today and find out!WWII ONLINE IS A SUBSCRIPTION BASED GAME\nHere on Steam, all users that sign up receive the base game package which includes 2 full weeks of PREMIUM subscriber access. After this time, if you do not select one either our Starter or Premium DLC option, you will be limited to the equipment that is available for Free Play Subscribers. Free Play users have access to ALL countries. You will be able to spawn the standard Rifleman class, the Airborne Rifleman, and a reserve class of Submachine gun. Free Players can support the battle's logistical needs by operating Trucks and heavy towing vehicles (Haulers) to bring in soldiers and towed guns.\nIn order to gain access to higher ranks and more equipment, soldiers MUST select from one of our *subscription* options available on Steam as DLC.\nThe STARTER subscription will include all Free Play Subscription access, equipment and vehicles, and also allows you to create in game Squads (Clans) as well as opening up more equipment options to choose from.\nThe PREMIUM subscription includes all of the access that is available to Free Play and STARTER subscribers. However, as a Premium subscriber, you will be eligible to gain maximum rank and be able to join the strategic High Command on either side. You can create and command Squads and (within restrictions of your current in game rank) have access to all of the equipment and vehicles available in WWII Online.\nPlease note, there are no micro-transactions in WWII Online. We believe in a fair and balanced game and our subscription model allows us to achieve that while continuing to provide the infrastructure for our massively multiplayer game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cornered Rat Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18344,"name":"Iron Grip: Warlord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fea/feaff7a434d02dbd99b1bc499a724a95.jpg","description":"Iron Grip: Warlord invigorates tower defense with first-person shooter elements to give a new twist to the genre.\nIt puts you in the heat of the battle, fighting off hordes of AI-controlled invaders. Play alone or with friends, in a diverse and challenging struggle to save all of Atelia.\nIron Grip: Warlord is set in an alternate universe where you take on the role of an Atelian Warlord. Gain power by killing the enemy or gathering valuables. Use this power to increase your personal arsenal or build structures to aid you in battle. Protect the Stronghold against waves of infantry, tanks and other powerful enemies. If the Stronghold falls, the defenders will surely lose heart and the battle will be lost. Do you have what it takes to defend your country?Key features:Online co-op multiplayer with up to 8 players\nA new twist on popular tower defense gameplay\nEight richly detailed maps\nEngaging and challenging battles\nDiverse enemy units, including the massive walkers, hordes of infantry, and the fearsome officer\nBeautiful concept artwork and stylistic art design\nPlay single player with AI bots, or team up with other people over LAN or internet\nWith Warlord, you're never bored! Enemies have many different abilities and teamwork is essential if you are going to survive","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"ISOTX","platforms":[{"id":0,"name":"PC"}]},{"id":18271,"name":"AaAaAA!!! - A Reckless Disregard for Gravity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b5/4b5948f8c5cd6e23f3c00c90e84a9b71.jpg","description":"Looking for the Oculus Rift version? Wan't to BASE jump on Mac or Linux? Pick up Aaaaa! for the Awesome.\nBASE jump through a floating city, creating your own stunts to delight your fans.\nYou dive off a skyscraper, relying on quick reflexes to negotiate the intricate tangle of girders that make up the floating city. All eyes are on you as the judges mark your score. One hundred points for hugging those exposed struts as you fall. A thousand for planting a kiss on the side of that building. Twisting and turning, you thread the needle between two billboards, earning cheers from your fans.\nBut while reflexes are important, it's quick thinking that gets you the win. One block away, you spot a crowd of protesters decrying your sport, and make a split second decision. You break off course, stare them straight in the eye, and flip them the finger. They explode into a burst of fury, but the judges absolutely love it, bumping you up to first place. Now all you have to do is to make that landing without ending up a loose sack of broken bones.\nFeatures\n80 levels take you through cities of floating billboards and buildings, and fly you inches away from the side of a mountain.\nUnique game mechanics allow you to create your own stunts to score.\nGive your fans the thumbs-up for points, or annoy protesters with rude gestures.\nSnag a can of spray paint and tag government buildings for an extra challenge.\nSpecial meditation mode helps you relax, with free anti-meditation mode to help you stop relaxing.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Dejobaan Games","platforms":[{"id":0,"name":"PC"}]},{"id":17526,"name":"Godus Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ab/9ab003e76f8adcb0dd47dfe17dc2d8ae.jpg","description":"Godus Wars mixes tactical Real Time Strategy gameplay with the mechanics of the God game genre.It’s fun, it’s simple and it’s brutal.\nTake control of one of four Deities, each with different play styles, abilities and powers.\nUse your might to battle over 7 varied continents, through hundreds uniquely designed and modifiable levels.\nCollect over 20 different Power Cards with potentially thousands of variations and use them to gain the upper hand in battle.\nControl expansive armies with up to 50 different unit types from Archers to Catapults!\nWield up to 8 mighty God Powers to bring devastating destruction or protection to your followers.\nMaps that change as you play with the unique deformable land - No two battles will be the same!\nGodus Wars includes Godus\nIf you’ve not had the chance to play our delightful, Zen-like re-genesis of the God-Game on Windows PC or Mac OS X, there’s never been a better time to do so!\nHave you ever wanted to play god? In GODUS, you can sculpt every inch of a beautiful world that you look down upon, where your population of Followers will settle and multiply. As you rule over your living, breathing society, a civilization will blossom across your land and offer you their belief. The more Followers that believe in you, the more powerful you will become. It is as simple to play as it is spectacular to behold. Come and lead an incredible journey - this delightful, charming world is waiting for you to make it your own. The Early Access build includes:\nOver 70 unique and deformable levels across two continents\n4 playable Deities with a range of abilities\n2 base unit types - Archers & Catapults!\n20 cards with 10 power levels!\n2 Deity opponents - including Bryan Henderson!\nOriginal Godus included","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"22cans","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14646,"name":"Bloodbath Kavkaz","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/824/824055e458ec4deb654a3d1d57867e98.jpg","description":"DESCRIPTIONBloodbath Kavkaz is an action-packed Top-Down Action based around russian culture, telling the story of Caucasian ex-killer named Shamil Rakhmanov. After a car crash Shamil gets in the hands of a mysterious stranger, who offers him a deal he can't refuse. Shamil must find and kill the leader of Moscow criminal syndicate, who is called Jafar, before the sunrise, or else he will die. Being desperate, Shamil starts his blood-filled way into the depths of Moscow night, where he will meet all the horrors of russian modern culture and solve the great conspiracy.\nViolent shootouts, slo-mo, thrilling non-linear story and stale shawarma – all of that await you in Bloodbath Kavkaz. Drink yazhka, break doors down, kill the unfaithful, nothing stops you in that game.FEATURESMaymays - The game has countless of references to the modern media-culture.\nAwesome soundtrack – a mix of 80's techno and azerbaijani lezghinka will not leave you disappointed.\nDynamic gunplay – camera is always moving in combat. Various visual effects also help to feel the dynamic of the game.\nSlow-motion will allow you to look at every detail in the heat of combat.\nHardcore gameplay – Bloodbath Kavkaz is a real challenge for an unprepared player.\nThrilling and non-linear plot – extraordinary story about ex-killer who is forced to return to his job to save his life, as well as lives of many Moscow citizens.\nSpectacular design – retro-styled graphics inspired by the nostalgia for 2000's games.\nInteractivity – you would find a lot of usable objects and side-NPCs whom you can interact with.\nVarious combat styles – you can kill lots of enemies with a single shot in an explosive barrel, or you can destroy a pipe with hot water to stun enemies near it, or you can break a switchboard which will turn the lights off, so the enemy will be completely disoriented, or you can just run and break through doors with what's left of your enemies. Possibilities are endless.\nLevel editor – you can create any game location by yourself.DISCLAIMERThe game does not have any racist implication and has no intention to offend anyone and is made purely for entertainment. The game is set in a parallel universe; all matches with real life are accidental.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dagestan Technology","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":682502,"name":"The Dark Pictures Anthology: The Devil In Me","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab0/ab0381be59467a6c54a858c6ab65a5a5.jpg","description":"A series of stand-alone branching cinematic horror games from the studio behind Until Dawn. Easy to pick-up and play in short sessions, alone or with friends. The Devil in Me is the fourth game in the series and the Season One finale.   \r\n\r\n \r\nA group of documentary film makers receive a mysterious call inviting them to a modern-day replica of serial killer H.H. Holmes’ ‘Murder Castle’. It’s an opportunity that’s too good to pass up and could be just the thing they’re looking for to win some much-needed public interest.\r\n \r\n\r\nThe hotel is the perfect set for their new episode, but things aren’t quite as they seem. The crew discover they’re being watched and even manipulated, and suddenly there’s much more at stake than just their ratings!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":262437,"name":"SkateBIRD","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/687/687dba2775a86b54ec90b32005857135.jpg","description":"Drop in, and be a skateboarding bird. Grind on bendy straws, kickflip over staplers, and carve killer lines through cardboard and sticky tape parks. Skate an expansively tiny world with simple controls even a Hawk named Tony would dig.\nHere's the deal: you're lonely, and your Big Friend has hung up their board for good. Their job sucks. You're gonna fix all that with the power of being a chill little skateboarding bird, though. You may be tiny, and alone, but the more you skate, the more following you get on Tweeter (the premier bird social network) - the more the cozy world of bird skating will open up. You'll make friends, birds will come check out your park, and maybe you'll even host events! Above all else, skate birds just try really hard.\nDrive smooth flowing, physical-feeling skating with simple buttons, not stick gestures\nFeel immediately at home with the controls, if you dig Pro Skaters of a Hawk variety\nExplore a series of tiny worlds full of little objectives and secret tapes (scotch tapes mostly)\nMake bird friends by completing challenges, or just trying really hard\nOrganize skate events with your new friends! Become a skate bird legend!\n(or just be really happy all your buds are having a good time with you)","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Glass Bottom Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":60765,"name":"Blood Bowl: Death Zone","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1c/a1c921239091aad41e524aa267607249.jpg","description":"Discover the Death Zone challenge, the most popular pre-game show in the history of Blood Bowl! Sponsored by ever popular brands such as Orcidas, Mc Murtys and Spike Magazine, the Death Zone challenge sees two Star Players of Blood Bowl fame leading teams of amateurs onto the pitch for some bone crushing five-a-side football!\r\nBlood Bowl: Death Zone is a competitive 1 vs. 1 game of football, violence and mayhem. You have full command of your players, move them around the pitch, activate their skills and special moves, and trigger passes and dashes in order to evade the opponents and to score TOUCHDOWNS. Each match lasts only 5 minutes and will put your skills and nerves to the test. You’re in total control… can you lead your players to the victory?\r\nEnter one of the multiple online leagues available and develop your team in a season long competition against other coaches from all over the world. Guide the progress of your players as they receive XP, improve their stats and unlock new skills match after match. Be careful, death looms over the pitch and your superstar could end up with a broken neck before the end of the season… but hey, that’s what Blood Bowl is all about: scoring touchdowns, punching opponents in the face and dealing with deadly injuries.\r\nBlood Bowl: Death Zone is currently in Early Access. Ultimately it will contain:\r\n15 teams based on the most popular races from the Blood Bowl universe (4 in current version)\r\n10+ Star Players, each with their unique style, strengths and weaknesses (4 in current version)\r\n20+ unique abilities for your players (8 in current version)\r\n5 arenas (1 in current version)\r\nMultiplayer league and simple matches (only simple matches in current version)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":14731,"name":"Through the Woods","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23c/23c1bd6b33c52c0c6cfdd90cf9509e22.jpg","description":"Collector's EditionThrough the Woods will be also available as a digital Collector's Edition, featuring an artbook and soundtrack from the game.\nAbout the Game\nThrough the Woods is a third-person Norse horror adventure set in a forest on the western shores of Norway that tells the story of a mother and her missing son. Through reactive narration, the player experiences the mother’s re-telling of the events surrounding her son’s disappearance. Players follow the path of a terrified woman who has forced herself to enter this terrible place for the sole purpose of finding her son, in a setting heavily influenced by Norse mythology and Norwegian folk tales.\nWith Through the Woods, Antagonist have captured the feeling of the forest as they saw it as children, with all the fear and mystery that comes from roaming through it alone. This is coupled with a powerful story and high quality sound design, which in the darkness of the forest becomes a core mechanic. Through the Woods is a profound experience that directly delivers the feelings of loneliness and loss in a terrifying place...\nFEATURES\nExplore stunning environments and experience stories inspired by Norse mythology, Norwegian art and nature\nUncover dark tales of the past and present through reactive narration\nCreative use of light and darkness generates deceptive environments\nA frightening journey accompanied by beautiful and grim sound design\nABOUT US\nAntagonist is a small independent game studio based in Oslo, Norway, founded in 2014. The team is focused on creating narrative-driven titles with epic stories and great gameplay.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"1C Publishing EU","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":10112,"name":"RPG Maker MV","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37b/37b1d13604b8ac800558634619cd2a4a.jpg","description":"POWERFUL enough for a developer SIMPLE enough for a child VERSATILE enough for any platform!For years, RPG Maker has been the easiest way to make your own Windows PC Roleplaying game. We have strived to give everyone, regardless of experience or skill level, the tools to make a game they could be proud of. Now, with RPG Maker MV, your game isn't just on Windows PC, its on the move. Make your game on your Windows or OS X PC, and then deploy it for iOS, Android, Windows, OS X, or even to play in a browser using HTML5!MAKE GAMES FOR THE PLATFORMS YOU WANT FROM ANY PCRPG Maker MV can run on both Windows and Mac OS X PCs. Users can also export games for the following platforms:\nWindows/EXE\nMacOSX/APP\nAndroid/APK\niOS/IPA\nHTML 5 for Web BrowsersBUILD YOUR WORLD WITH AN IMPROVED MAP EDITORRPG Maker MV uses a user-friendly​ map system to help you build the RPG world of your dreams. With an additional automated upper layer, mapping in MV is even easier than before.MAKE YOUR WORLD LIVE WITH A SIMPLE EVENT SYSTEMIn RPG Maker MV, you use the simple, intuitive event system to bring your world to life. You can easily and quickly create NPCs for your characters to interact with, puzzles for them to solve, and quests for them to complete.GET STARTED IMMEDIATELY WITH BUILT-IN RESOURCESRPG Maker MV, like previous RPG Makers, comes with its own graphic and audio resources for you to use in your game. From sprites to battlers, from sound effects to music. MV comes with resources for both Fantasy and Sci-fi games, and you are easily able to add more.USE TWO DIFFERENT BATTLE MODES, RIGHT OUT OF THE BOXWith a tick of a checkbox, you can switch between the classic Front View Battle to a Side View Battle system.USE A MOUSE OR TOUCH SCREEN TO PLAY YOUR GAMESTired of playing RPG Maker games with your keyboard? With RPG Maker MV, your game will allow the player to play the game with a flick of their mouse, or using a touch screen.SEE YOUR GAME IN HIGHER RESOLUTIONRPG Maker MV can show more than ever before. With a default 1.5x the resolution, sprites can show more emotion and the scenery can be more detailed than ever before.USE PLUGINS TO MAKE A FULLY CUSTOMIZED GAMEWant to customize your game even FURTHER? Use plugins to change things the way YOU want them. You can get them from us, get them from other fans, or master JavaScript to make your own! With our new plugin manager, you can just drop in the .js file of a plugin, and then configure it directly in the editor.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"KADOKAWA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1201,"name":"Necropolis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed0/ed0e273b438e5b56a98b9e2e5ec153da.jpg","description":"• Includes BRUTAL content such as ‘The Brute’ playable character, ‘The Dark Forest’ outdoor environment, and much more.\n• A 3D ACTION ROGUE-LIKE. Combines fast third-person combat with permadeath dungeon-delving for a game that’s diabolically hardcore. Anticipate enemy attack patterns, time your actions for maximum effect, and use smart combinations of light, heavy, and power attacks to defeat your enemies.\n• EXPLORE AN EVER-SHIFTING DUNGEON. Every playthrough offers new locations to discover, new threats to face, new traps to avoid, new items to craft, and new treasures to uncover.\n• DEFEAT HORDES OF DEADLY ENEMIES. Face ever-deadlier threats as you go deeper into the dungeon. Gemeaters, Changelings, Hoardmen, Fire Djinns, and many more exist only to kill you.\n• TEAM-UP IN 2 - 4 PLAYER CO-OP. Drop into multiplayer games and fight side-by-side, revive fallen comrades, and share valuable treasures as you face the dangers together.\n1 player, 2-4 Network Players, 4GB HDD min size, DUALSHOCK4, Remote Play, Online (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© Harebrained Holdings, Inc.\n© BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":666,"name":"3on3 FreeStyle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/700/700b175aea970c71a153b2230e1fdeb7.jpg","description":"Features:3 vs 3 Online Multiplayer Mode\n1 vs 1 Online Multiplayer Mode\nDynamic Practice LobbyFree to Play Basketball ActionThe game’s unique free-to-play approach means that players can dedicate the time needed to master the game and become online street basketball legends.Real-time Online CommunityPlayers can dive into a huge online community of potential teammates and competitors for a personal, competitive experience which makes them feel like they are right there on the court. Allowing for personal interaction, team development, and rivalry, 3on3 FreeStyle allows for social and interactive community, while also competitive at the same time.High-flying, Fast-paced Street B-ball GameplayThe straightforward controls of 3on3 FreeStyle allow for players to execute their favorite basketball moves with ease within their first time trying out the game. Once the basics have been mastered, players will find each unique character in the game with individual signature basketball tricks which can quickly be picked up, mastered, and unleashed on opponents.Dynamic Art Powered by Unreal Engine 4Inspired by the real-life street basketball courts in the country, the artists have infused their own unique take on the courts using the power provided by the Unreal Engine 4. Interactive environments and characters come to life when a player pulls off a stunning alley-oop or hits an impossible acrobatic shot.Characters With Unique Skill SetsPlayers can pick from a wide variety of diverse street basketball characters with specific skill sets and physical traits inspired by the different kinds of basketball players you will find on the court. Whether the player wants a tall, lanky rim protector, a gravity-defying slam dunk artist, who can bury the outside shot with ease, they can find them in 3on3 FreeStyle’s roster of characters.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Joycity","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":891238,"name":"Hades II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fd/8fd2e8317849fd265ad8781c324d4ec2.jpg","description":"The first-ever sequel from Supergiant Games builds on the best aspects of the original god-like rogue-like dungeon crawler in an all-new, action-packed, endlessly replayable experience rooted in the Underworld of Greek myth and its deep connections to the dawn of witchcraft.\nBATTLE BEYOND THE UNDERWORLD\nAs the immortal Princess of the Underworld, you'll explore a bigger, deeper mythic world, vanquishing the forces of the Titan of Time with the full might of Olympus behind you, in a sweeping story that continually unfolds through your every setback and accomplishment.\nMASTER WITCHCRAFT AND DARK SORCERY\nInfuse your legendary weapons of Night with ancient magick, so that none may stand in your way. Become stronger still with powerful Boons from more than a dozen Olympian gods, from Apollo to Zeus. There are nearly limitless ways to build your abilities.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Supergiant Games","platforms":[{"id":0,"name":"PC"}]},{"id":810322,"name":"EarthX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b4/0b442f231e0594a22c79981a7d1ab785.jpg","description":"EarthX is a relaxing family-friendly spaceflight company management game, where you launch rockets. A lot of them.Your Space Company⠀\nIn EarthX, you are responsible for managing your own space company. Sign contracts, build new rockets, and launch payloads into space!Make Your Rockets Bigger⠀\nLaunching loads of payloads to space requires massive rockets and a high launch cadence. Investing in new technology will bring great rewards in the future.\nRecover your rockets and reuse them to save money and time. If that’s not enough, you can also catch the fairings!\nIf you're too lazy to do research, remember that you can always simply make your rockets bigger. Just like that.Stay In Space⠀\nThe crew of the International Space Station needs your help! Resupply them regularly with food, science experiments, and new equipment. Eventually, you might even start launching your own astronauts to the station!Run LinkLink⠀⠀\nUse your fleet of rockets to launch thousands of LinkLink satellites to space - giving millions of people access to the internet while earning you millions of dollars per day!Beyond Earth⠀\nSooner or later, spaceships will allow you to bring humans and cargo to other planets, from which you can start your own bases and colonies!\nProduce dozens of nuclear bombs and throw them at the poles of Mars to heat it up. One day, the planet might start to look like Earth!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Denis","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":795370,"name":"Escape Academy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/046/046a0d88df42efb3a5c080af9ad91e65.jpg","description":"You've just arrived at Escape Academy, a school where promising students train to become the ultimate Escapist.\r\n\r\n\r\n\r\nPlay over a dozen masterfully hand crafted rooms, designed by experienced experts in the field of REAL LIFE escape rooms.\r\n\r\n\r\n\r\nExperience the entirety of Escape Academy alone in single player OR through two player co-operative play. Available in local or online splitscreen.\r\n\r\n\r\n\r\nExplore the campus of Escape Academy and get to know the faculty, a colorful cast of characters, each an expert in the art of Escape. And some with secrets yet to be uncovered...\r\n\r\nFeaturing Music and Sound Design by the one and only doseone (Gang Beasts, SLUDGE LIFE, Disc Room, Enter the Gungeon).\r\n\r\nEscape Academy’s Respected Curriculum:\r\n\r\nAttend a Tea 'N Tea Party - Can you defuse the bomb before your tranquil cup of tea gets cold? Your grade (and physical well being) depend on it!\r\nHack the Professor - Solve a quantifiably feverish series of challenges to prove to the Academy’s super A.I. that you’ve got the skills to become an Escapist.\r\nGo for the Gold - Represent your class in everyone’s favorite sporting event, The Rival Room. Go toe-to-toe against your nemesis in a puzzle-race to prove who’s top of the class.\r\nDo Not Drown! - Being at the bottom of a puzzle-tower that’s rapidly filling with water is NOT ideal. Scramble to the top for that sweet, sweet oxygen.\r\nSpray Paint the Monument - Art class is no Easy-A at the Academy. Leave your mark on the historic Monument of Escape but uh… hurry up! The Headmaster didn’t exactly approve the lesson plan.\r\n\r\nAnd this is just a portion of the wacky (and often lethal) curriculum!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Coin Crew Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":497993,"name":"Propagation VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f1/4f1e0071133f416170f1b5a5213ee130.jpg","description":"Combining survival horror and wave shooting, Propagation VR will get your adrenaline pumping as you try to survive the apocalypse brought on by a mysterious virus. Armed only with your guns and your fists, fight off terrifying zombies and other multi-species mutants. Will you get out alive?Live The HorrorTrapped in an abandoned subway station filled with monsters from your worst nightmares, you can only count on your cold blood and your skills to survive. You might get a little help... or not. Throughout this short but intense immersive experience, thrilling cinematics and a variety of enemies will keep you on your toes. The realistic handling of weapons will add to the tension, as you try to think straight and manage your ammunition. Surviving Propagation VR is a challenge you will remember.Use Your SkillsStudy your enemy for weaknesses, analyze the situation and overcome your fear if you want to make it till the end.\nManage your weapons wisely. You carry two weapons, each with their own qualities :\n- Use the handgun on your belt if you need precision, quick reload, or a light in the dark\n- Use the shotgun on your back for a powerful short-range blast\nDon't forget to reload whenever you catch your breath, or you will only be left with your fists to defend yourself in close combat.Can You Beat The Game?4 difficulty modes are available : Normal, Hard, Nightmare, and Impossible!\nOne session of Propagation VR is about 30 minutes of sweat and fear. Once you've finished the game, challenge yourself to a harder setting and see if you can make it!\nPersonal high score is locally saved. Can you beat your best score?\nChoose between multiple comfort settings to match your style and your hardware.\nPropagation VR is provided for private use only. For commercial licensing and more (multiplayer) experiences, please visit our website.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"WanadevStudio","platforms":[{"id":0,"name":"PC"}]},{"id":349334,"name":"Until You Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e15/e15d26cf406f942bf4ddb4f83c130419.jpg","description":"Fight. Fall. Rise again.\nRokar has fallen. Once a civilization fueled by a magical power called Aether, the Rokari have been destroyed by a Calamity of unknown origins. Now, monsters and twisted spirits wander these crystallized ruins.\nAs the last remaining Rune Knight, you alone can fight back these horrors. With the help of a mysterious Runesmith, you will forge the weapons needed to complete your campaign.\nPut your sword fighting skills to the test as you use both magic and melee to fight twisted enemies in an unforgiving environment. Battle, gather currency, and forge new weapons to grow stronger. Should you fall in combat, you will rise to return more powerful than before.\nFrom the team behind I Expect You To Die, this rogue-lite will force you to find and master your martial style using different weapon combinations for hours of dueling fun.FeaturesArm yourself with two unique weapons and define your own fighting style\nEach run features randomized rewards, enemy configurations, and rooms - no two attempts are quite the same\nCustomize your weapons within a run with over 30+ unique traits and augments\nEarn Aether each run to craft and upgrade your weapons permanently\nA variety of neon-tinged arenas where you can fight your enemies\nDriving Synthwave (Swordwave?) soundtrack to keep you fighting\nCustomizable field of view vignetting to let you move comfortably in VR\nJoin our growing community of faithful fans on Discord!\n#doitwithswords","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Schell Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":35326,"name":"Tom Clancy's Splinter Cell: Pandora Tomorrow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/686/686873b901e9c7ba4b5e60bc34cea257.jpg","description":"In Tom Clancy’s Splinter Cell®: Pandora Tomorrow™, you play Sam Fisher, a cold-blooded stealth soldier waging a one-man war against an Indonesian terrorist network. Inspired by the world of Tom Clancy, Pandora Tomorrow features a story line so real you can feel it. Tension-filled stealth action springs from a compelling and original plot that’s so realistic it could’ve been ripped from the headlines by scriptwriter JT Petty, who penned the original Tom Clancy’s Splinter Cell.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":29259,"name":"Remothered: Tormented Fathers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cda/cdafc6d93c50252d4d2df2d8f4607ace.jpeg","description":"Remothered: Tormented Fathers is the movie-like gaming experience with realistic and extreme gameplay created for survival horror fans.\nThe story is rich of unpredictable plot-twists, but it is touching at the same time. Psychology plays a huge role within the game: heroes and enemies are atypical and the line between good and evil is blurred. The development of the game is similar to that of a film narration, where the player perfectly identifies himself with the character. The soundtrack, composed by Nobuko Toda (Final Fantasy, Halo, Metal Gear Solid) and Luca Balboni, enhances the terrifying atmosphere of the game.\nRosemary Reed, a fascinating 35 year old woman, reaches the house of a retired notary, Dr. Felton, who is affected by a mysterious disease. The woman is greeted by Ms. Gloria, the nurse who takes care of the old man. When Rosemary reveals herself and her true intentions, the terrifying dread begins.\nRosemary’s investigations will bring her to believe that the disappearance of the man’s daughter Celeste actually hides a terrible massacre. Dr. Felton and his wife, Arianna, could be the only ones to know the truth, including the secret behind Celeste’s real identity and a fanatic cult of cloistered nuns in red.\nRemothered: Tormented Fathers is the first title of the long-awaited 3rd person game trilogy. A web of lies where murders and obsessions come to life. A revolutionary experience created for survival horror fans.\nRun and hide gameplay - You will have to deal with obsessed stalkers always on your steps. They’ll never give up or die.\nPsychological plot - Characters in the story are everyday people that turn themselves into scary monsters.\nNo guns or powerful weapons - You can only use standard items to deceive the stalkers or react to their assaults.\nMovie-like cutscenes - Thanks to his impressive direction, Chris Darril puts into play a story rich of complex life-like characters.\nAudio clues - The soundtrack will alert you when your enemies are getting closer.\nNo health bars - Your body is the only way to understand how you are doing.\nLearn new skills - Acquire new abilities and improve your old ones throughout the game.\nRealistic puzzles - Scenario and characters have been conceived to be realistic and credible.\nTop-notch soundtrack - Nobuko Toda (Final Fantasy, Halo, Metal Gear Solid) and Luca Balboni wrote the music for the game.\nReal-time loading - Explore the mansion without worrying about empty moments or boring loading times.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Stormind Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":23943,"name":"Mario Kart DS","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc0/bc02ade70c7d92900b1f4950f4c845ba.jpg","description":"Race along with Mario and his friends in five single-player modes and\nover 30 courses. Knock out the competition with your driving skills as\nyou rocket-start the race, use drifting and turbos at critical points,\nand deploy crazy items to gain an advantage.\n\nGet ready for total shell-tossing mayhem! Choose one of 12 Nintendo\ncharacters as you race through challenging tracks that become even more\nso with deployable items at your disposal. Enlist in the Grand Prix for\nthe trophy prize in eight different cups. Start a Time Trial, and try to\nbest your fastest time with your own ghost. Play against a\ncomputer-controller kart in VS mode for a quick race. Try out some fun\nkart minigames like Balloon Battle and Shine Runners in Battle mode. Or\ntry clearing some Missions to practice your technique in becoming the\nultimate Mario Kart racer!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":22489,"name":"Swipecart","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bb/2bb97c46d197454674fd380b20d6a8ca.jpg","description":"Swipecart is a physics powered mine cart racing game that rewards patience and skill. It combines vehicle physics with clever and challenging level design. Compete for the fastest times on each track and earn money to customize your avatar.\nSteam achievements, leaderboards, trading cards, and community integration included.Key Features:\n60 official tracks spread across 3 deadly mountains\nOver a hundred different avatar clothing options with collectable sets\nIn game track editor that allows you to upload and share your own levels*\n*Steam Workshop integration planned\nUse special abilities to control your cart's orientation and speed\nCross platform syncing; play any of the mobile versions and sync up your profile to continue playingFeel like the game is more suited to mobile?\nThen try it out on your phone or tablet!\nSwipecart on iTunes App Store\nSwipecart on Google Play store\nSync between any version! Play from your computer chair and then hop on the bus and keep on rolling! Please cart responsibly.Trading cards now available!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Micro Factory Games","platforms":[{"id":0,"name":"PC"}]},{"id":20923,"name":"how do you Do It?","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa7/fa718dc07996404977d0f68d4b30c5a0.jpg","description":"New game on Steam from a member of the \"how do you Do It?\" team!If you liked \"how do you Do It?\", you may also be interested in a new game from Nina, a member of the team! She worked on a game called Freshman Year that's out on Steam today! Check it out at the link below!\nFreshman Year is a vignette game about an ordinary night in the life a college freshman named Nina. Nina's best friend Jenna invites her to meet up at a local bar with some classmates. Jenna is sort of flaky though, so Nina has to navigate the party by herself.\nhttp://store.steampowered.com/app/364450\nAbout the Game\"how do you Do It?\" is a game by Nina Freeman, Emmett Butler, Decky Coss, and Joni Kittaka. The game puts players in the role of an 11-year-old girl whose mother has just stepped out for an errand. The girl immediately grabs her dolls and furtively attempts to figure out how sex works using these plastic surrogates.\n\"how do you Do It?\" has been nominated and shown at festivals including Indiecade and the Independent Games Festival.\nIt was made in 3 days at Global Game Jam in New York City during 2014.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Joni Kittaka","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19690,"name":"Gray Matter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/013/013f3464c72771fe26bfa19881306e62.jpg","description":"After a tragic accident, neurobiologist Dr. David Styles has become a recluse, rarely leaving his home, the Dread Hill House. One day, Samantha Everett, a street magician, appears at Dr. Style's doorstep just as he is seeking a new assistant.\nSamantha's first task is to find six people to form “The Lamb's Club” of human guinea pigs for Dr. Style's tests at Oxford University. The experiment starts off innocently enough, but then a chain of inexplicable incidents begin to occur, one after another.\nAre these experiments as innocent as they appear? What is the true aim of Dr. Styles' research? What secrets are waiting to cross over from the other side?\nIn Gray Matter, legendary game author Jane Jensen (creator of the Gabriel Knight series) tackles questions concerning the nature of reality and the power of the human mind in a mystery adventure that comprises 8 massive chapters. Jensen combines the elements of science and the supernatural, together with her acclaimed emphasis on character and story to create an unprecedented paranormal experience that will keep you riveted until the very end.\nFeatures:\nFrom legendary game author, Jane Jensen, GRAY MATTER combines the elements of science and the supernatural, together with character and story to create an unprecedented paranormal experience.\nA dark story told in the gothic novel style in eight epic chapters\nPlay as Dr. Styles and Samantha\nInnovative gameplay that combines science and the supernatural","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"WizarBox Production","platforms":[{"id":0,"name":"PC"}]},{"id":19622,"name":"Lilly Looking Through","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30c/30c1f92ef22d7666676d7b3f26d09d3e.jpg","description":"What Lilly sees is about to change her life forever....\nHelp our heroine through a variety of enchanting environments brimming with magic and wonder, as she seeks to rewrite the past, change the present, and unlock the ultimate mystery. Geeta Games presents an animated point-and-click adventure for all ages:\nLilly Looking Through.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Geeta Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12781,"name":"Half-Life: A Place in the West","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/504/504dcb8d81d81248c2e7818de268bb85.jpg","description":"What is A Place in the West?Half-Life: A Place in the West is a fan-made comic book set within Valve's acclaimed Half-Life universe, in which Earth has fallen under the grip of the totalitarian Combine empire following a scientific experiment gone very wrong.\n\nAs a group of military commandos sweep across the American wasteland kidnapping children, a troubled father, an intrepid young scientist, and an ancient alien warrior are drawn to the strange city from which the attackers sprung: New Franklin. Once inside, they discover a powerful secret, but the city holds many dangers, and deceptive temptations. Faced with warring clans, diabolical experiments, a treacherous conspiracy, and the growing shadow of the Combine, they must unlock New Franklin’s mysteries before it’s too late - and the lives of everyone in the city hang in the balance.\n\nA Place in the West delivers a compelling story, and a complex and intriguing cast of all-new characters, drawing on the rich mythology of the Half-Life universe in an entirely new medium for the series.\n\nThe comic will run for a total of thirteen chapters, the first of which, Following Portents, is available for free to download and comes to a total of 38 pages. The remaining chapters will be released sequentially as paid-DLC, and will vary between 25-30 pages in length.\nDo I need to be Familiar with Half-Life?Nope! The first chapter features a three-page prologue designed to bring new readers up to speed with the world of Half-Life. A Place in the West is also set in the interim between Half-Life and Half-Life 2, which means that you needn't be familiar with Valve's later games anyway. That isn't to say, however, that you won't find exciting things to enjoy if you are familiar with the series.\nWhat Other Features Are There?The comic is displayed and presented in an app designed by ourselves for the best possible reading experience. Through a fully-animated menu screen, derived in style from the menus of Half-Life 2, you can quickly and easily navigate between the comic pages and chapters, adjusting zoom & language options, the credits, and the extras section. The extras section will be continuously updated over the course of the comic's production, and will include a series of three-to-five-page comic 'shorts' that further develop the world of New Franklin and its occupants, as well as \"Behind the Scenes\" commentary videos for each central chapter!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ross Joseph Gardner","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":602357,"name":"The Great Ace Attorney Chronicles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/74a/74a324529a14915adfc887d257f16f86.jpg","description":"Set in late 19th century Japan and England, each title features five murder-mystery episodes filled with all the drama, laughs, twists, and “turnabouts” you’ve come to expect from the legally labyrinthine legacy of Ace Attorney. Join Ryunosuke Naruhodo, ancestor of series mainstay Phoenix Wright, as he attempts to uncover the secrets behind an international criminal conspiracy and solve a hauntingly baffling cold case, while tackling a series of tricky trials along the way. Dozens of hours of attorney action awaits you!\n\nIn the course of each case, you’ll speak to witnesses, examine evidence and clues, and attempt to deduce the dastardly intent behind the crime before proceeding to the courtroom. In court, you will hear testimonies, cross-examine witnesses, and present evidence. And of course, it wouldn’t be an Ace Attorney game if you couldn’t shout “OBJECTION!” when you know you’ve got the facts and evidence needed to contradict the prosecution’s claims and prove your client’s innocence.\nThe game includes a convenient assistance feature in case you hit a dead end in your investigation, so even if this is your first Ace Attorney game, you can get into your amateur sleuthing adventures with ease! Will you be able to crack these clever cases? The game is afoot!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 3DS"}]},{"id":327212,"name":"Cris Tales","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f8/3f8b4bd09fa2e84eeb6d8590840a0531.jpg","description":"Cris Tales is a gorgeous, indie love letter to classic JRPGs with a new perspective. Peer into the past, act in the present, and watch as your choices dynamically change the future -- all on one screen as you play! Join the newly awakened Time Mage Crisbell and her fantastical companions on their journey across a dark, fairytale world facing a grim future.\r\n\r\nCrisbell must embark across Crystallis and the four Kingdoms in a bid to stop the powerful Time Empress and rewrite the future of the world and all those living in it. Along the way, she’ll meet and recruit powerful allies with their own unique stories and skills like Matias the Frog and Willhelm the Child Mage.\r\n\r\nAs she explores the world and meets her unique companions, Crisbell will have to make choices with far-reaching consequences for the people she meets – consequences that will impact the world you’ll experience in real-time throughout your journey. Each companion will be invaluable as you face these choices and the myriad enemies who stand in your way. Will you buffet them with attacks, or discover creative ways to use Crisbell’s time powers to alter the reality of each fight?\r\n\r\nBeautifully hand-drawn 2D art is animated frame by frame to bring the branching pasts and futures of each region, enemy, and NPC to life across more than 20 hours of gameplay. Experience a unique combination of branching stories, innovative combat, and classic RPG excitement in Cris Tales’ exciting and unforgettable exploration of how our actions echo through time.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dreams Uncorporated","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":19618,"name":"Strike Suit Infinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c21/c21127493c2c1088bd8487893ecc4a37.jpg","description":"Ok, cadet. This is it. All your training has brought you to this point - you are here for one reason only: to be the best.\nStrike Suit Infinity is a frantic high score chaser where your skill is the only thing that matters. Whatever combat experience you have had so far is considered irrelevant. There is no end to the enemies you will face. There is no winning. There is only the fight for survival.\nTake to the cockpit of one of three Strike Suits, engaging waves of enemies, building your multiplier and putting as many points on the board as possible. You’ll need to use your head, though. In between rounds, use credits to purchase upgrades and reinforcements, maximizing your potential in the next round. The longer you can stay alive, the bigger your score, and the higher up the leaderboard you’ll find yourself.\nEngage intelligent enemy fighters and take on colossal capital ships, exploiting weak points in their super-structure to blow them apart piece by piece. Upgrade your Strike Suit and customize your weapon load-outs to tailor combat to your tastes. Take advantage of three very different Strike Suits to experience dogfighting action as you’ve never seen it before.Key Features\nFast, frantic space combat: freely engage multiple enemies, dogfight other pilots and fight massive fleet battles.\nThe Strike Suit: strategically switch from Pursuit Mode (speed and power) to Strike Mode (a powerful, highly maneuverable combat mode).\nIt’s all about your score – build your multiplier, take down waves of enemy as fast as you can, and race to the top of the leaderboard.\nManage your strategy – use credits in between rounds to purchase upgrades and reinforcements for the next round.\nCapital Ship Destruction: take capital ships apart piece by piece – take out their turrets and target weak-points to blow out entire sections of their superstructure.\nShip Designs from renowned Mechanical Design engineer Junji Okubo (Appleseed: Ex Machina, Steel Battalion).\nMusic from award-winning sound designer Paul Ruskay (Homeworld) including a collaboration with Japanese singer/songwriter Kokia (Tales of Innocence, Gunslinger Girl: II Teatrino) and Subsource.\nJoystick compatible: as well as being fully optimized for mouse and keyboard, and gamepads, Strike Suit Infinity is compatible with a range of joysticks for full immersion.\nVicious new enemy types *DOES NOT REQUIRE STRIKE SUIT ZERO TO PLAY*","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Born Ready Games","platforms":[{"id":0,"name":"PC"}]},{"id":10157,"name":"Brothers in Arms: Earned in Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/00e/00e4b3fa7b85e54f468331584a49c4fd.jpg","description":"With its unprecedented combination of authenticity, compelling story and squad-based action, the Brothers in Arms franchise has established itself as a benchmark for military action games, receiving the highest average review scores of any console WWII game to date (www.gamerankings.com).\nBrothers in Arms Earned in Blood adds new features and game modes and builds upon the elements that made Brothers in Arms Road to Hill 30 a runaway success.\nFeaturing a new single player narrative, new multiplayer missions, an all-new cooperative style game mode, and new weapons and vehicles.\nNext volume of Brothers In Arms - The award-winning WWII shooter returns with more of the action, story, and authenticity that has critics and fans raving.\nNew single-player narrative takes you beyond Hill 30 - Play as Sergeant Joe Hartsock and lead your squad beyond Carentan. It will be up to you and your squad to defeat the last enemy bastions and bring freedom to Normandy.\nNew cooperative Multiplayer mode - Take on the enemy with a friend by your side. Work together and utilize each other's squads or face certain death.\nUnrivaled authenticity  Fight actual Airborne Infantry battles of D-Day accurately recreated under the direction of author, historian and Airborne Ranger Col. John Antal, using thousands of official photos, maps, After-Action Reports and eyewitness accounts.\nNew multiplayer missions - Taking online tactics to new heights, Brothers In Arms Earned In Blood offers more unique multiplayer missions.\nSkirmish mode - Brothers In Arms Earned In Blood features an all-new Skirmish mode that allows players to take a tour of duty through a series of authentic and increasingly difficult custom combat missions.\nNew weapons and vehicles - Arm yourself with new weapons like the M3 grease gun, and command new vehicles like the M10 \"Wolverine\" Tank Destroyer.\nMore challenging and dynamic combat - Featuring close-quarter urban environments and a new, next-generation artificial intelligence system, Brothers In Arms Earned In Blood promises to take authentic military action to the next level.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":3135,"name":"WRC 5 FIA World Rally Championship","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ce/0ce64243e06482c5bdf5956d08cb23c5.jpg","description":"Find all the cars, all the drivers and all the official rallies of the 2015 FIA World Rally Championship in THE racing standard. Feel the impact of the different road surfaces on how your vehicle handles thanks to a brand new physics engine. Experience the spirit of the 13 rallies held around the world! Drive both night and day in sunshine, rain and snow.\nLearn the basics with the new Rally School mode, perfect your skills in Career mode, customise settings, compete against other drivers online and become a true rally champion!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Milestone","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":1067,"name":"Here They Lie","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/864/8644fe94a0dc93f1e541182ef737798d.jpg","description":"DEATH IS NO ESCAPE\nDeveloped by Tangentlemen under the banner of Santa Monica Studio’s external development group, Here The Lie is an uncanny horror experience where death is not a checkpoint. Delve into an inescapable, surreal world where unsettling encounters and environments come to life.\nFeatures HDR compatibility, 4K support for PlayStation®4 Pro.\nVR Games may cause some players to experience motion sickness.\nPlayStation®VR Compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 Sony Interactive Entertainment America LLC. Developed by Tangentlemen. Here They Lie is a trademark of Sony Interactive Entertainment America LLC.All of the game can be played in VR.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":485195,"name":"eFootball PES 2021","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a8/6a805daef1a6eb02d4254fbc3fa74607.jpg","description":"Please note that the latest data for certain licensed leagues and teams will only be available via an update post-release. You will need an internet connection in order to download this update. See the official website for more details.\n*Due to the ongoing impact of COVID-19, certain real-world football leagues and/or tournaments may undergo sudden regulation changes. As a result, there is a chance that in-game regulations may not perfectly match their real life counterparts. Other changes that impact leagues and tournaments may also be implemented in future updates without prior notice.\nCelebrate 25 years of PES with the eFootball PES 2021 Season Update* - available at a special anniversary price!\n*This product is an updated edition of eFootball PES 2020 (launched in September, 2019) containing the latest player data and club rosters. Please note that some leagues will have their rosters updated post-release.\nPre-order the eFootball PES 2021 Season Update now to receive exclusive content:\n• L. MESSI (Loan)\n*Pre-order content is subject to change without prior notice.\nSTANDARD EDITION\nPurchase this version of the game and receive the following myClub content:\n• 3 Player Contract Tickets x 10 weeks\n• Premium Agent x 10 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 2000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nARSENAL EDITION\nPurchase this edition and get the following Arsenal content:\n• 'Iconic Moment Series' x 1 player\n• Full squad (manager and players)\n• Digital kit\n• Original in-game menu theme\n• 3 Player Contract Tickets x 30 weeks\n• Premium Agent x 30 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 3000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nFC BARCELONA EDITION\nPurchase this edition and get the following FC Barcelona content:\n• Full squad (manager and players)\n• Digital kit\n• Original in-game menu theme\n• 3 Player Contract Tickets x 30 weeks\n• Premium Agent x 30 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 3000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nFC BAYERN MÜNCHEN EDITION\nPurchase this edition and get the following FC Bayern München content:\n• Full squad (manager and players)\n• Digital kit\n• Original in-game menu theme\n• 3 Player Contract Tickets x 30 weeks\n• Premium Agent x 30 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 3000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nJUVENTUS EDITION\nPurchase this edition and get the following Juventus content:\n• Full squad (manager and players)\n• Digital kit\n• Original in-game menu theme\n• 3 Player Contract Tickets x 30 weeks\n• Premium Agent x 30 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 3000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nMANCHESTER UNITED EDITION\nPurchase this edition and get the following Manchester United content:\n• Full squad (manager and players)\n• Digital kit\n• Original in-game menu theme\n• 3 Player Contract Tickets x 30 weeks\n• Premium Agent x 30 weeks\n*Premium Agents can sign players from a large variety of clubs, including players from the club of whichever edition you have purchased.\nIt also contains the following purchase bonus:\n• 3000 myClub Coins\n*The pre-order bonus, purchase bonus and myClub content can only be claimed on the account used to purchase the game.\nProduct Overview\nThe eFootball PES 2021 Season Update features the same award winning gameplay as last year’s eFootball PES 2020 along with various team and player updates for the new season. Also comes with the UEFA EURO 2020™ mode - all at a special anniversary price!\n・The Biggest Clubs\nPlay with the biggest teams in world football; including German champions FC Bayern München, Spanish champions FC Barcelona, global giants Manchester United and exclusive PES partner Juventus!\n・myClub\nCreate your very own dream team from scratch and face off against human rivals from all over the world.\n・Matchday\nCompete in online PvP events themed after real-life football rivalries and other big matches.\n・Master League\nTake the helm of a football club and lead them to the top in this engrossing single player mode.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":257195,"name":"Minecraft: Dungeons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c14/c146d28ceb14c84ea9fdbd7410701277.jpg","description":"Discover an all-new action-adventure game, inspired by classic dungeon crawlers and set in the Minecraft universe! Brave the dungeons alone, or team up with friends to survive truly spectacular battles! Up to four players can fight together through action-packed, treasure-stuffed, wildly varied levels, all in a quest to save the villagers and take down the nefarious Arch-Illager!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Double Eleven","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":44255,"name":"City of Brass","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/65b/65bb899dca77643d52aff3647416c1d0.jpg","description":"Become a daring thief in City of Brass, a punishing first-person, Arabian Nights-themed rogue-lite. Armed with scimitar and a whip that can grab, trip, disarm, stun or shatter as well as swing, players will lash and slash, bait and trap their way through hordes of undead, making it to each level’s exit before the Sands of Time run out, collecting treasures and looting chests for weapon and armour upgrades or powerful relics on the way. But the city itself also has teeth. Players will have to leap across pits, slide under blades, avoid spears or arrows, evade or employ sprung paving slabs, and skirt round poison gas traps – all the while manipulating these dangers to their advantage against enemies.\nIncarcerated within the city are genies, most of them friendly, who will barter benefits in return for loot or grant wishes for a powerful advantage – or for a ransom, free them to secure their help in the final battle.\nThe rhythmic interplay between sword and whip is carefully tuned along with sprinting, crouching, sliding, leaping and vaulting to give a fluid, balanced and natural feel to the movement and melee. Eternal replayability is granted by a design that encourages combinative gameplay within an ever-changing but logical procedurally generated world. Players will die in the City of Brass – often, and quite horribly – but they will always want to come back for just one more try…","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Uppercut Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21085,"name":"Tank Universal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b5/4b51fe49db918238f34a78d125b2b279.jpg","description":"Tank Universal creates a huge virtual 'Tron-like' world where you take part in immense 3D tank battles involving scores of units both friendly and not so friendly in wide open levels!\nPlayers can bombard the enemy from a distance or close the gap and dodge shells point blank - all in an immersive first person perspective.\nFeatures:\n20 levels of highly addictive and intense tank battles\nSome missions require you to leave the safety of your tank and explore the world on foot\nAbility to upgrade weapons and tank equipment\nFight alongside allies against highly intelligent and numerous enemies\nSpectacular looking virtual world and eye-popping particle effects\nTake the battle in any direction with wide open levels allowing freedom of play\nIntriguing storyline switching between the 'real world' and the digital virtual world\nEnhanced resolutions, including widescreen support up to 1680x1050\nUnlock over 25 achievements, including Roadkill, Sheep Master and the all important; Saviour of the Resistance","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Dialogue Design","platforms":[{"id":0,"name":"PC"}]},{"id":17558,"name":"Trials Evolution: Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab877daa449c496bde61f17f70791a0.jpg","description":"Trials Evolution: Gold Edition marks the Trials franchise’s triumphant return to the PC gaming platform. RedLynx’s signature franchise, the Trials series first made its mark in gaming with the 2008 release of Trials 2 SE for the PC. That breakout indie success led to further success on the Xbox, but ever since then PC gamers have been clamoring for more Trials. Trials Evolution: Gold Edition is what they have been waiting for.\nThe Gold Edition Is Two Trials In One\nTrials Evolution: Gold Edition will contain all the content of the original, best-selling XBLA game Trials Evolution. In addition, all of the single player tracks and skill games from Trials HD will be found in Trials Evolution – effectively doubling the content offering with two complete games, neither of which have ever before been available on PC.\nOPTIMIZED AND ENHANCED FOR PC\nTrials Evolution: Gold Edition will be optimized and enhanced for the PC gaming platform. All of the features of its forerunners – from the in-game editor, player sharing of tracks, and global Leader Boards, will be re-integrated into the game in a way that fits the new platform.\nKey Features\nMultiplayer\nTrack Editor\nIndoor and Outdoor environments\nBike and rider customizations\nGlobal competition","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft Shanghai","platforms":[{"id":0,"name":"PC"}]},{"id":17024,"name":"Color Symphony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/923/92356cc7c19444256ef5717b5ae67285.jpg","description":"Color Symphony is basically a side scrolling game.\nBut it has the added element of color and gives you something different.\nYou can be a main character in the game and fight the enemy,\neliminate the obstacles or find a new route by using color.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"REMIMORY","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":16362,"name":"Jets'n'Guns Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/104/1045f6194c2e3d5fd8afb0036d21825c.jpg","description":"Jets'n'Guns is a heavy piece of ground shaking rock blasting action with graphics and special effects that will blow you eyes out! Enjoy yourself in almost-insane action adventure of saving the universe from the deadly threat of more than 270 unique monsters in the campaign of 43 levels. Stand as one-against-many armed with tons of different weapons of a devastating armament fitted into one of the awesome spaceships.\nGame features:\n43 levels full of thrilling action, shooting and demolition\nmore than 270 unique enemies including 16 boss monsters\n70 different weapons\nupgrade your ship with 20 special devices\nsuperior graphic and particle effects enhancing the destruction\nmore than one hour of breathtaking original soundtrack\nnew scenario in every level (deep space, jungle, undersea, lava planet...)\nfly in 12 different vessels, even in a horrible boss ship\ncombination of weapons give hundreds of possibilities how to equip your ship\nsounds and sound-effects just like from a Hollywood movie","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Rake in Grass","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]