[{"id":46180,"name":"Death Coming","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61a/61a2b7683223e015a129fec6f0bafe3c.jpg","description":"EA noticeThe game is expected in September 2017 EA demo\nAbout the Game\n《Death Coming》 is a non-linear puzzle game where you take on the role of a grim reaper. Your sole objective? Cause death while abiding by the free will clause.Background StoryYou Died.\nPure and simple, but death was not the end. You have become an agent of death: a Reaper. You have the powers of death, but there are rules in this supernatural afterlife.\nReapers can cause death, but they cannot control humans directly due to the Free Will Clause. As a reaper, you must plan, time, and execute your killings by using the environment to your advantage. Be wary, Minions of Light work against you and will try and save humans from their grim fate!.Key Features●  Isometric ‘God’ PerspectiveLook down on your hunting grounds from a top-down perspective. Follow the lives of your targets and those out to stop your reaping.\n●  Non-linear DesignThere isn’t a singular solution and a single item can kill multiple targets. Each level has a sandbox-esque design. So it’s up to you to use whatever way you wish to complete your objective.\n●  Observe, Plan, ExecuteObserve the pattern of victims to know their behaviors and characteristics. Utilize dangerous items at the right time to perform effective kills. The better you know their routine, the better you can prepare extreme death traps.\n●  Reactive AIVictims will hang around spots they like and will change their actions and behavior when something happens to them, such as seeing death.\n●  A Morbid Sense of HumorFrom suburbia to missile bases, there’s always a wacky way to cause destruction. Don’t be afraid if you laugh at someone’s demise. If you do what you love (slaughtering the unaware in this case), you'll never work a day in your life!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NEXT Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":17860,"name":"Hocus Pocus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/333/333f799ead924f1d145e74d871a34c5d.jpg","description":"This mission will take Hocus to 16 unique realms, each filled with unique dangers and enemies. Few have survived Terexin's final test. For many it's a one-way trip.\nAlong the way Hocus will encounter dragons, imps, ghosts and 30 more unique creatures, demons and enemies. Survive, and Hocus becomes a full-fledged, card carrying Wizard. The other option is not so favorable. After every two levels of play the level graphics, background and enemies completely change, giving this game unparalleled variety. Hocus Pocus is a action platform game, with exciting puzzles built into each level's structure.\nHocus is armed with a standard magic spell (he's not yet a full Wizard, after all), but he can find several potions that give him a temporary boost of magical energy. There are potions that give Hocus the ability to shoot rapidly, jump higher, teleport and fire a devastating energy blast, among others.Features\nSo Smooth, It's Magic: Smooth 360-degree scrolling, with a parallax background.\nSix is the Magic Number: Over 6 megs of 256-color VGA animated graphics.\nMonster Mayhem: Over 30 different monsters, four huge bosses and 36 huge levels.\nA Wizard's Tale: Game saves, selectable skill levels and four cheat passwords!\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Apogee Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16834,"name":"The Marvellous Miss Take","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab911c31bd27f91d9c2e22d78202d13.jpg","description":"The stealth genre gets turned on its head in The Marvellous Miss Take – the only heist adventure that invites you to steal with style!\nBreak into 25 unique art galleries as three different thieves in search of the ultimate score, evading guards and using gadgets to get away with your priceless haul. Unlike other stealth games though, there’s no time for waiting in the shadows until the right moment! Wandering guards decide their patrol routes on the fly, security cameras keep watch over everything and even innocent gallery goers just visiting to admire the art might raise the alarm if they see something suspicious. Only quick wits and even quicker reflexes can help you grab the loot and escape unseen – there’s no option for violence and the clock is ticking!\nGame features\nOrganised Chaos – More than your typical stealth game, The Marvellous Miss Take is a fluid, high-speed game of cat and mouse! Random guard patterns require players to think on their feet rather than hiding in the shadows, and one false move means escape can be snatched away from you in seconds.\nWits, Not Fists – Forget violence, takedowns or picking off guards one by one… distraction's the key to success here! Each stage stays tense from the first step to the last, so put your gadgets to good use to keep out of trouble and pilfer everything you can before someone spots you!\nThe Bigger Picture – Sneak into the 25 multi-floored galleries as one of three different characters, each of which has their own unique skills and goals. Can you escape safely with the maximum amount of loot and grab yourself a perfect ranking?\nArtfully Accessible – Streamlined, intuitive mouse controls let you explore the colourful world of The Marvellous Miss Take with ease, making the exciting puzzle-cum-stealth action accessible to players of all ages and skills.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wonderstruck","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15461,"name":"ReignMaker","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80e/80ed8317b25110b1a1609f9755986a33.jpg","description":"ReignMaker is a match-3 game with tower defense, city building, and political strategy elements. From your capital city you lead your Kingdom against the invading Void Army that threatens all life.\nYour match-3, tower defense, and strategy skills will determine the fate of your armies, but the many political decisions you make as a leader affect the story and the culture of your kingdom. As your capital city improves, you will have access to more powerful spells, mightier elite troops, and better battlefield gear and armaments. Along the way you will also earn achievements, complete quests, and fill your Bestiary with enemies.\n50 towers across 3 continents.\nMillions of story possibilities determined by your policy choices.\nDeep strategy elements.\n4 cultural spectrums: Martial, Druidic, Elemental, Republic.\n20 spells.\n10 types of troops.\n12 implements of war.\nReignMaker: Saving the World One Tower at a Time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Frogdice","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14854,"name":"Steam Marines","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/863/863bddd552ac201dcc1f8d91a1061757.jpg","description":"Steam Marines is a squad based Roguelike set on a steampunk spaceship. It features tactical play focused on positioning and careful use of resources. Built to keep you on your toes as you progress through the decks of your besieged ship while clearing enemies and trying to reach each level's elevator.\nPermadeath\nBuild your marines up into long range or up close death machines, but don't expect any mercy. Death is permanent and fallen marines are gone forever. Finding survivors not guaranteed.\nTurn and Squad Based Gameplay\nCommand up to four marines, each with their own gear, talents, and Action Points. Positioning is critical - even a lone enemy can be lethal! Sight and snipe or funnel enemies into a choke point and blow them up!\nFive marine classes - long range death, shotgun knockback, grenade launchers, all to help the squad\nFour ranks for promotion and talent tree access\nFive perks to further differentiate each marine\nExoskeleton suits stripped from the hulks of dead enemies - flamethrowers and face punching\nDeck bosses that will challenge you but do not negate the tactics you have learned (no \"immunities\"!)\nProcedural Generation\nThe steampunk spaceship is composed of multiple decks you must progress through. Different environments and creatures await, and you'll never know for sure what lies beyond the next corner.\nFive human ship decks with a sixth Alien Deck\nProcedural decks with destructible walls, high/low ground, and tactical variations\nRandomized weapons, armor, and enemy units\nScore, Difficulty, and New Game Plus\nGet rated on your overall performance. Manage to fight your way past 30 levels of mayhem? New Game Plus offers fresh challenges. Four levels of difficulty with one being for the truly masochistic!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WorthlessBums","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11722,"name":"Trolley Gold","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ad/6ad6bacc11f25004ee9643118c7efdb3.jpg","description":"Do you want to collect all the gold in the world? The game “Trolley Gold” gives you this opportunity! In this game you have to get into the role of gold miners team. You control the two crew members who using uncomplicated mechanism drive the trolley. You need to catch the gold nuggets, which another friend of yours produces. He skillfully wields a pickaxe and never gets tired. Also you have other friends who are happy to help you with a variety of useful things, so that your team would be able to fulfill its main goal - to collect as much gold as possible. But it’s not so simple, throughout the game you will have to face many obstacles and enemies that with all the forces want to hinder you. Well, who said it would be easy? During the game you will visit several places around the globe and learn a lot of interesting things in the life of these gold diggers.\nFeatures of the game:\n-5 original colorfully drawn locations;\n-Original enemies and obstacles throughout the game;\n-System of assessment of passing the level;\n-Realistic physics in the 2d world;\n-Fascinating and original gameplay;\n-Historical facts as the game progresses.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mantis Games","platforms":[{"id":0,"name":"PC"}]},{"id":383546,"name":"AVICII Invector","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4d6/4d617f342d30db08715f44ef2741d07c.jpg","description":"Belt up and blast into the rhythmic regions of unexplored space in AVICII Invector.\nCreated in collaboration with the late superstar DJ, AVICII Invector is a pulse-pounding, frenetic rhythm-action experience.\nSoar through vocal melodies, sweep each fade and attack every beat in 25 of AVICII’s biggest hits, including global chart toppers: Without You, Wake Me Up and Lay Me Down.\nFly solo or recreate the party feeling of an AVICII concert with heart-thumping, competitive gameplay.\nEach track is built to perfectly match the on-screen visuals taking you through a musical odyssey of serene exploration.\nFind your rhythm, feel the beat and keep the musical journey flowing.\nMaster 25 hit anthems from the phenomenal talent of late superstar AVICII.\nFlow through SIX mesmerising worlds wrapped in a magnificent musical experience.\nTurn up the volume and set yourself a challenge across THREE complexity levels.\nPlay solo or with up to 4 friends in split-screen multiplayer action.\nLay down your high score and rise up the Global Leaderboards.\nExplore a pure-hearted narrative journey set against the globally celebrated works of AVICII.\nSupport The Tim Bergling Foundation with a percentage of sales going to support mental health awareness.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hello There","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":59081,"name":"Creative Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff0/ff06832f9468edafdf4d5b3c45131545.jpg","description":"Welcome to the world of Creative Destruction where everything is fully destructible! Creative Destruction is a new FPS/TPS sandbox survival game that features the utmost fun of building and firing.\nIn this virtual world, explorers can experience:Various ResortsIn this large-scale battlefield of 16,000,000 square meters, there are 13 interesting enchanted spots. In this wonderland, you can experience varied weather and time systems. There are always surprises waiting to be explored!\nFree dismantling & Interesting buildingBeware, all elements in sight can be built or dismantled. You are born to be armed with an secret weapon named Destructor, whereby anything can be harvested and transformed into building materials. You can build bastions at your fingertips via an innovative workshop system.\nUnique WeaponryPick creative weapons, race against snowstorms, and dive into the do-or-die battle! There are 14 basic weapons including pistols, shotguns, submachine guns, rifles and sniper rifles, and also special weapons like Flame Thrower and Bowling Bomb.\nDiverse gameplayOther than the classic battle royale mode, explorers can participate in various battle modes during specific time. We have developed an all-round system that integrates functions like Season, Friend, Look, Supply, Gallery, Chat and so on. Explorers will have everything they need in game. Besides, we also prepared some fun stuff hidden somewhere in the game. Hope you can find it!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NetEase Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":23260,"name":"Tesla vs Lovecraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbd/dbd921ec28a06f59d4745ea19fd5b079.jpg","description":"Tesla vs Lovecraft is an intense top-down twin stick arena shooter from the creators of Crimsonland and Neon Chrome. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\nYou are Nikola Tesla, world-famous inventor and genius extraordinaire. At the eve of your greatest invention, your laboratory is burned down by the horror author H.P. Lovecraft, who claims that your actions have put the world in peril. With the help of his occult book, and a vast army of monsters, he has stolen your most precious inventions!\nTesla-Mech, an immensely powerful machine of war at your disposal. Mow down your opponents with twin-mounted Tesla-Miniguns, and trample over monsters like they were ants.\nQuantum Teleportation, packed neatly into one handy portable backpack. (Includes a warning label about Theseus-paradox, whatever that is)\nIf nightmares had nightmares, this is what they’d look like. Monsters so horrible they’ll make you eat up your own sanity!\nSave the world with a plethora of inventions and gadgets, including (but not limited to) X-Ray Blade and Death Ray Gun.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"10tons","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":20647,"name":"Pink Heaven","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/027/0279a525850f90ecb4fd4aa07a378e1a.jpg","description":"Kero Blasterhttp://store.steampowered.com/app/292500/\nPINK HOURhttp://store.steampowered.com/app/409670/\nAbout the Game\nPINK HOUR is a 2D action game that was developed following the release of \"Kero Blaster\".\nIn PINK HEAVEN, the pink office lady from Kero Blaster takes center stage as the protagonist and player character.\nOvercome foes, jump to evade danger and save the young Shopkeeper from the clutches of UFOs!\nBy fulfilling certain conditions, you can unlock an additional Hard Mode.\nA short, fun game that can also be used to familiarize oneself with the play-style of Kero Blaster.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Studio Pixel","platforms":[{"id":0,"name":"PC"}]},{"id":19367,"name":"MDK 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a34/a34ba27adb076cc8e63916fef5cdde54.jpg","description":"3 Unlikely Heroes, 1 Ultimate Goal\nKurt Hectic is back to save the universe. This time he is teamed with the genius Dr. Hawkins and the 6-legged gun-toting robotic dog, Max. Together they must out-sneak, out-blast and out-think their enemies as they attempt to reclaim earth from a vile alien menace.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"BioWare","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Dreamcast"}]},{"id":19356,"name":"Roogoo","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5db/5db257fd8784c84b933d455a205183eb.jpg","description":"Roogoo is an innovative and unusual 3D puzzle game that has players guide and stack different shaped blocks through various platforms to not only save planet Roo, but the entire Roogoo race.\nRoogoo tasks players with guiding meteors in the form of shaped blocks through a series of rotating disks as a means of saving planet Roo and the entire Roogoo race. If aligned correctly, the disks allow the blocks to reach the ground and scores are awarded. Various obstacles and enemies will impede the blocks' movement and with the flow of meteor blocks steadily increasing as the game progresses, players will have to think on their feet to save the Roogoo and rack up seriously high scores.\nContains 45 levels of action packed puzzle racing games\nEasy to play, starting with two buttons and adding more functions as you advance\nCute and funny short story segments throughout the game\nAppeals to everyone including both casual and serious gamers alike\nInteresting world objects and multi-layered game play progression\nFilled with fun imaginative creatures\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Spidermonk Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":5649,"name":"Rogue Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/013/01307f219833be28e3b1ed6a4582604d.jpg","description":"Rogue Warrior is a character-driven, first-person-shooter, featuring Richard 'Demo Dick' Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat.\nPlaying as Richard 'Demo Dick' Marcinko, you go behind the iron curtain to disrupt a suspected North Korean ballistic missile program. Soon into the mission, you uncover a conspiracy that could turn the tides of the Cold War in the communists' favor. You must then take the mission into your own hands as you enter into the bowels of the USSR to destroy a technology that could change the balance of geopolitical power, leaving a trail of destruction in your wake!\nPlay as a Real Life Legend  - Play as Richard \"Demo Dick\" Marcinko — a real-life American badass. His defiant, crude, and sometimes ruthless behavior has earned him both glory and infamy in the history books. Now you take on his explosive nature as you engage in black ops and go against the rules of conventional warfare to get the job done.\nBrutal Kills  - With more than 25 uniquely brutal kill moves, do what it takes to take out the enemy. No trick is too dirty as you maintain the element of surprise whenever possible - find and kill the enemy before they find you.\nTargets of Opportunity  - Be an instrument of destruction as you create tactical advantages by eliminating any and all targets that would otherwise benefit the enemy.\nMultiplayer Mode  - Go head to head against others online and even perform brutal kill moves on your friends.\nAward-winning Talent  - Golden Globe winner and Oscar nominee Mickey Rourke voices Dick Marcinko's in-game character.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2487,"name":"The Park","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98f/98fe09e42b703987dc17e3b991ac6021.jpg","description":"Set in a creepy amusement park hiding a dark and sinister secret, The Park is a one to two hour long first-person psychological horror experience focusing on intense storytelling and exploration instead of combat and action.\nA day at the park... a lost teddy bear... a missing child. As the sun sets over Atlantic Island Park, you must explore its dilapidated rides in search of your son, Callum. As darkness falls, you will experience panic and paranoia through a narrative written by a team of award winning storytellers.\nAmusement parks are happy places, filled with the joys of childhood and the exhilarating rush of fantastic rides to be dared. That was the vision of eccentric business man Nathaniel Winter when he opened the doors to Atlantic Island Park in 1977.\nUnfortunately, the park's history turned out to be one plagued by tragedy and drama. Its freak accidents, grotesque killings and ghostly hauntings have inspired many a sensational headline, and locals worry the park is far from done claiming innocent lives.\nFor Lorraine, it's where her worst nightmare began.\nWARNING: This experience deals with subject matter that might prove emotionally distressing to some. Player discretion is advised.\nExplore Atlantic Island Park and step onto rides such as the Ferris Wheel, the Bumper Cars and the Rollercoaster; just beware, some of them have a life of their own\nEnter the mind of Lorraine, a woman facing every parent's worst nightmare, and unravel her story as well as the dark and tragic history of the park\nCall out for Callum to respond, and interact with the environment around you while examining clues and listening to Lorraine's own inner voice as the game progresses\nCompelling graphics and audio deliver a uniquely atmospheric setting rich in mood and mystery, developed by a team of award-winning AAA developers\nBONUS: The Park is inspired by a setting within the modern-day myths and mysteries MMO The Secret World. This copy of The Park includes unique in-game items that can be applied to one The Secret World account; the Killer Chipmunk outfit and three powerful, legendary talismans.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Funcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":270730,"name":"D.R.O.N.E. The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be1/be121ccb4d716a581772351ff29243c9.jpg","description":"No one gets hurt, at least they say so.\nIn community created arenas you compete with self-designed drones in order to become the smoothest drone operator in the galaxy.\nNot hooked yet?\nExperience an all-new game mode that merges the thrill of rugby with armed-to-the-teeth drones and highly tactical teamplay.\n3-dimensional, fast paced and direct, stealthy or brute force action, team based or lone wolf, racing or fighting, you make it what you want it to be. You can amplify your drone piloting skills by creating the unique set of drones that compliment your playstyle and adjust in realtime to whatever challenges other players impose on you. With an infinite supply of community created arenas, which rank from fresh, over trending, to hot on the D.R.O.N.E. community hub, you can be sure to always have a challenge worth to take on. Heck, you may even create your own arenas, tournaments, and rulesets gaining yourself a reputation as an awarded architect.\nNOTE: The racing game-mode is not publicly available at the moment.\nNot our conquest of space. Not our level of civilization. Not art or philosophy. Not even our scientific progress as such… when the first contact fleet of the Interstellar Committee of Advancement & Integration (ICAI) darkened the skies above the UN headquarters in New York 2137, the motivation for their intervention was clear cut: we were deemed a beast with tools and habits too dangerous to be left alone.\nAnd to a subset of civilizations in the galaxy that meant: READY FOR THE GAME.\nWarfare out there had become a regulated affair long ago. A ritual. A kind of sport. A source of entertainment backed by a vast and complex industry. Disputes over resources and territory, even the appropriation of some technology were no longer the subject of messy and uncontrollably destructive conflict. Such commodities would often become the formal prizes of tournaments, fought on a variety of natural and artificial stages all over the galaxy by teams representing companies, nations, a planet, an entire species… or just themselves.\nRead more on the official website of D.R.O.N.E.\nD.R.O.N.E. is currently in a successful ongoing on-site crowdfunding campaign. Unlike other crowdfunding campaigns, we promise to complete the game and we have proven that we have what it takes to do so.\nBy purchasing this early access pass you are supporting the development of D.R.O.N.E. and get the \"Traveler\" crowdfunding tier unlocked for you. Among other perks, this tier grants you early access to every feature as it is developed and you will receive a digital copy of the final game once it’s done.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Five Studios Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":62638,"name":"Zero Caliber VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/221/22130497c8066579969fe1b6405d7c57.jpg","description":"ABOUT THIS GAMEZero Caliber VR is a first-person tactical shooter developed by XREAL Games exclusively for premium Virtual Reality headsets.\nThe story brings the player to a dystopian United States in the not too distant future where physics-based interaction combined with hyper realistic weapon handling and stunning graphics will make you feel like you’re physically part of the action. Fight either alone, or with your friends throughout the whole campaign, which is fully playable in Co-Op.\nAction-oriented story, gripping gunfights, realistic weapons with an on-the-fly swappable attachment system. Immersion like you’ve never felt before in a VR military shooter!HYPER REALISTIC COMBAT SYSTEM - USE YOUR BODY TO FIGHT AND FIND COVER\nHandle, aim and reload your weapons with real-life movements! We modeled the in-game weapons based on their real-life counterparts paying extreme attention to detail. Each weapon has its unique reloading method that you have to learn and practice to fully master them.\nIf you fancy explosions, just grab a grenade and throw it at the enemy. After you pulled the pin of course.\nStay in the open for too long and you’re dead. Try to find cover instead, duck, crouch, sneak, peek around a corner, clear obstacles with real-life movements. Military combat isn’t all about shooting. Being aware of your surroundings, the terrain, and working together with your squadmates are all part of a successful mission. Don’t let your fellow soldiers down!REALISTIC WEAPONS - CUSTOMIZE YOUR FAVOURITE GUN\nEveryone has a unique playstyle. Is accuracy your thing? Put a laser sight on your assault rifle and take accurate shots in semi-automatic mode, or just grab a sniper rifle. Are you more of a shoot first, ask later type of person? Take a shotgun, or dual wield your machine guns in fully automatic firing mode. Be careful though, recoil can make your job really difficult! Combine your favourite gun with your favourite attachments on-the-fly to find out which variation suits you the most!THE STORY - DIVE INTO AN ENGAGING DYSTOPIAN ADVENTURE IN THE NOT TOO DISTANT FUTURE\nWater is life. Someone should’ve made that clear before humanity started poisoning Earth with microplastics. Now water is death. People are fighting for drinkable water, for survival.\nThe military tried their best to keep order, but inevitably they got overwhelmed. That’s when mercenaries appeared.. then entire private armies.. and then when hope started to fade away came the religious cults. The most fearsome of all is a secretive organization worshipping Tlaloc, the aztec God of rain. The “Tlalokii”, as they call themselves. Their motto? “Join us or perish”. What is even worse, they know something that can change the fate of humanity.\nBe part of this action-packed, story-driven VR adventure where you fight alongside your fellow soldiers trying to keep order… or what’s left of it anyway.STUNNING GRAPHICS\nWe place realism above anything else. Graphics and ambiance are crucial parts of this, that’s why we took extreme care in audio and visual design. Explorable open environment, stunning graphics, background noises, realistic weapon sound effects.\nA constantly developing military VR FPS experience that will surely make you forget that you are in a video game!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"XREAL Games","platforms":[{"id":0,"name":"PC"}]},{"id":52512,"name":"Donkey Kong","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23e/23eecccb588a4a9c97f35ebf8f9f00ef.jpg","description":"Donkey Kong (Japanese: ドンキーコング, Hepburn: Donkī Kongu) is an arcade game released by Nintendo in 1981. An early example of the platform game genre, the gameplay focuses on maneuvering the main character across a series of platforms while dodging and jumping over obstacles. In the game, Mario (originally named Mr. Video and then Jumpman) must rescue a damsel in distress named Pauline (originally named Lady), from a giant ape named Donkey Kong. The hero and ape later became two of Nintendo's most popular and recognizable characters. Donkey Kong is one of the most important games from the golden age of arcade video games, and is one of the most popular arcade games of all time.\nThe game was the latest in a series of efforts by Nintendo to break into the North American market. Hiroshi Yamauchi, Nintendo's president at the time, assigned the project to a first-time video game designer named Shigeru Miyamoto. Drawing from a wide range of inspirations, including Popeye, Beauty and the Beast, and King Kong, Miyamoto developed the scenario and designed the game alongside Nintendo's chief engineer, Gunpei Yokoi. The two men broke new ground by using graphics as a means of characterization, including cutscenes to advance the game's plot, and integrating multiple stages into the gameplay.\nDespite initial doubts by Nintendo's American staff, Donkey Kong succeeded commercially and critically in North America and Japan. Nintendo licensed the game to Coleco, who developed home console versions for numerous platforms. Other companies cloned Nintendo's hit and avoided royalties altogether. Miyamoto's characters appeared on cereal boxes, television cartoons, and dozens of other places. A lawsuit brought on by Universal City Studios, alleging Donkey Kong violated their trademark of King Kong, ultimately failed. The success of Donkey Kong and Nintendo's victory in the courtroom helped to position the company for video game market dominance from its release in 1981 until the late 1990s (1996–1999).","review":"","timePlayed":0.0,"releaseYear":1981,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Atari 2600"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Atari 7800"},{"id":0,"name":"Apple II"},{"id":0,"name":"NES"},{"id":0,"name":"Atari XEGS"},{"id":0,"name":"Commodore / Amiga"}]},{"id":52217,"name":"Defender's Quest: Valley of the Forgotten DX","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40e/40ee56e743d3983eea871b85c20448f6.jpg","description":"Defender's Quest is a Tower-Defense/RPG Hybrid that focuses on tactical depth, customization, and story.  That means no random encounters, no spikey-haired emo kids, no forced time sinks, and no tedious, repetitive battles.\nThe battle system builds off of tower defense, with individual characters taking the place of towers.  Each character levels-up, learns skills, and equips gear individually, allowing the player to customize their battle experience and strategy.  The overall game structure is similar to 'tactical' RPG's, but with a real-time battle system.  Game speed is adjustable, and commands can even be issued while the game is paused.\nIt also features an engaging, character-driven story written by an actual English major! The story strives to be fast-paced, snappy, and always relevant to gameplay with minimal exposition. Finally, it's got options and accessibility settings out the wazoo, so that you can have the best possible experience!\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1 player\n350MB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCopyright 2012-2018 Level Up Labs, LLC\nDefender's Quest, Defender's Quest: Valley of the Forgotten, and the Defender's Quest logo are registered trademarks of Level Up Labs, LLC","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Level Up Labs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21236,"name":"House of 1,000 Doors: Family Secrets Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/044/0446a8635a9ce2ba67d52ea2be18b586.jpg","description":"A young bride who lost her husband in a gruesome accident refuses to leave a train.\nA sculptor who disturbed his wife's grave is suffering in a wintry hell.\nAnd a young girl who posed for a cursed portrait haunts the charred remains of her father's studio.\nWhen the dead cannot find release, the House of 1000 Doors appears at locations around the world to serve as a portal for gifted individuals to help them. What secrets do these souls share with Kate Reed, a struggling writer hoping to recapture her past success? These lost souls cannot move on. To save them, you must guide Kate between these mind-bending worlds as you explore the House of 1000 Doors.\nTormented souls imprisoned in a netherworld cry out to the living for help in this Collector's Edition of HOUSE OF 1000 DOORS FAMILY SECRETS that includes additional plot lines, and integrated strategy guide and more!\nExplore stunning locations and discover the dark secrets of the Lancaster family as you delve into the supernatural on your quest for the truth in this compelling mystery.\nWhen the dead cannot find release, they beckon to an unlikely medium to pass between the spirit world and our own to free them from their twisted past lives and the endless horror that they cannot escape.\nWhat secret do all these souls share? Pass between all the mind-bending worlds when you enter the House of 1000 Doors to find out.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17283,"name":"Might & Magic Heroes VII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b5/9b503edbb24bde53c60be57f8e2b941b.jpg","description":"Complete Edition\nMight & Magic® Heroes® VII has made a triumphant return bringing you the essence of turn based strategy gaming.\nThis Complete Edition includes:\n- the main game,\n- exclusive hero,\n- a scenario map,\n- the full digital soundtrack and Heroes® III - HD Edition\n- The Lost Tales of Axeoth extensions\n- the new Trial By Fire add-on !\nThis Complete Edition will allow you to master the whole Heroes VII universe, with dozens of gameplay hours and maps, hundreds of heroes, all of this set in a high fantasy universe with RPG progression and strong story narrative, you will embark in a journey you will never forget!\nThe story of Heroes VII depicts the civil war that changed the ruling dynasty of the Holy Empire.\nThe Empress’ murder has left an empty throne, a realm in flames and too many hungry rivals intend on claiming it. The Duke Ivan calls together a prestigious council of six trusted advisors in search of a viable path for putting an end to this war of succession. Discover a new fantasy story :\n• Experience the “Best-Of” Heroes\nEnjoy one of the most acclaimed turn based strategy franchises\n• Explore a spellbinding world\nPowered by the Unreal 3.0 engine, the world of Heroes VII has never been so detailed and immersive\n• It ain’t over ‘til you say it’s over!\nOver 60 hours of game content in the massive solo campaign with virtually unlimited replayability in the Skirmish and Duel modes\n• A unique mix of Turn-Based Strategy and RPG\nExplore and conquer an enchanted world, develop and manage your economy, lead armies of legendary creatures to battle ...\nIn Trial By Fire, five years after the epic events of Might & Magic Heroes VII, you will lead the new Fortress faction to define the destiny of the Dwarves and shed light on some of the darkest chapters of their history. Set in a fantasy universe with RPG progression and a strong story narrative, Trial by Fire is an ideal way for newcomers and existing fans to enjoy the authentic Might & Magic Heroes experience and many new features :\n• Master the Rune Magic :\nLead the new Fortress faction on a path to define the destiny of the Dwarves\n• New characters :\nTake control of a full new lineup of charismatic heroes and iconic creatures such as Fire Giants, Valkyrie and Red Dragons\nThe following extensions bring the players in new worlds with new factions, powers and stories. In The Lost Tales of Axeoth you can discover Iranese, one of the continents of Axeoth, where the campaigns of Heroes IV took place.\nDigital Deluxe EditionThe Deluxe Edition contains:\nan exclusive hero,\na scenario map,\nthe full digital soundtrack\nand Heroes® III - HD Edition. The Heroes® III HD Edition copy will be sent as soon as Might & Magic® Heroes® VII is released.\nAbout the GameOur story takes place during a war of succession. The Empress’ murder has left a realm in flames with many hungry rivals ready to seize the throne by force. The Duke Ivan then calls together a prestigious council of six trusted advisors to restore order and end the conflict that set ablaze Ashan’s lands.\nMight & Magic® Heroes® VII makes a triumphant return bringing you the essence of turn based strategy gaming. Set in a fantasy universe with RPG progression with a strong story narrative, you will embark on a journey that you will never forget!\nExplore and conquer the enchanted world of Ashan\nDevelop and manage your economy\nLead armies of legendary creatures to battle\nBuild up Heroes of Might & Magic with hundreds of abilities and powerful artifacts","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Limbic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":12329,"name":"StarMade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e81/e8125576abfe77d72a0194bd7d198075.jpg","description":"Try out the full game for free in Alpha!We are currently offering the full version of the game for free on our demo. This will be throughout Alpha as we believe a user wanting to purchase an open alpha game, should get to try out and test the current full state of the game first. We also need as many testers as possible, your reports, feedback and input is invaluable!\nSo... why should you purchase the game if it's currently free?\nSupport the developers!\nPurchased users will still have access to the latest updates when the demo stops being supported/updated in beta.\nGet it cheaper! As more features are added, the price will progressively increase. This will benefit those who supported the game earlier.\nWe're adding upgraded only features to our Registry system, this will not directly affect any game features, however, it will give more access online. For example, blueprint hosting and multiple skin uploads for selection.\nWhat are you waiting for? Click that demo button, and try out the full game for free!\nAbout the GameA voxel-based 3D sandbox set in the never-ending darkness of space. Create your own ships, explore new galaxies, stars and planets. Discover and salvage space stations, fight against pirates or opposing factions in multiplayer. Equip your ships with completely customisable weapons and conquer the galaxy. Trade and make a fortune, mass produce materials in gigantic factories. Design your very own space station. Create warp gates and network the universe at your front door.\nThe universe is a vast, mystical, beautiful, awe-inspiring place.... the universe is yours.\nBuilt for scalability to facilitate massive fully interactable objects, almost anything is possible. Gameplay elements have been skillfully constructed to bring the ultimate space sandbox experience.\nDive into your own unique universe, and choose your path.Key Features:\nProcedurally generated infinite universe, with quadrillions of galaxies - The universe is massive. It'd take approximately 10,000 years to cross from one end to the other! Singleplayer and Multiplayer worlds can be heavily customised with our extensive config options.\nDeveloped for scalability- We have a broad range of graphical and performance options that cater to our low-end users as well as those with heavy rigs and servers.\nAdvanced Build Tools - Powerful and easy to use building tools, quickly design awesome ships, stations and bases. Including functions: Copy & paste, undo, redo, replace, symmetry modes, shape assistance systems (spheres, cycles, torus and more) and rotation of templates.\nModular Weapon Systems - Combine weapon systems for countless configurations of weapons. From sniper beams to swarm missiles.\nComprehensive Rail & Logic Systems - Use the rail system to build moving parts. You can do anything from simple elevators, sliding or rotating doors,  to complex cranes.\nTinker with our logic systems to control any system in the game, be it weapons, lights, rails, or explosives. Logic covers all basic gate types for convenient use (AND, OR, NOT, DELAY, Flip-Flop), allows in flight control and wireless connections between entities. You can use it for simple things like timers, switches, buttons. Or, build complex systems like working clocks and even a real CPU. Community multiplayer (dedicated servers) - Play with others in our community hosted servers. Our configs allow administrators to customise core game mechanics for a tailored experience. Most settings can be tweaked to squeeze the best performance out of hardware.\nPlatform independent (Windows, Linux, Mac) - StarMade is completely platform independent. We support the three most widely used operating systems.\nFree to play in alpha - We offer the full game free to play while in alpha development. Play our game through this period for free while in return we receive invaluable feedback and bug reports.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"schine","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11459,"name":"Sairento VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/657/65747fbe4efc94db22c60540d5a74ba8.jpg","description":"We're a bunch of indie developers on a mission to create the one true must-have ninja experience for VR. We hope you join us for the ride!\nSince its launch, Sairento VR has been gaining fans worldwide with its unique locomotion system. It is the one game in VR that allows you to experience the iconic \"bullet-time\" scenes from The Matrix, blended with the slow-motion mayhem of the Max Payne game series, all while looking and feeling as badass as the Bride from Kill Bill.\n\nIn Sairento VR, you will be able to perform double jumps, run along walls, and slow down time while blasting away at a foe before landing to deliver a lethal strike on another. Kit yourself with your weapons of choice - katanas, firearms, bows, throwing glaives - they are all at your disposal.\n\nPopular gamers like Node call it their ‘favourite VR game’ and Nathie, Cix Liv, JoshDub, TimDotTV and more all give it a thumbs up.\nSairento VR was designed to be easy to pick up, but tough to master. The more time you spend with Sairento VR, the better you will perform the moves in the game and the more you will be rewarded with the unparalleled feeling of being the action hero of a big budget move production.\n\nAt the moment, we are still in beta production. The full version of our game will be released sometime between October to November 2017 and it will encompass more content and come with a multiplayer feature and a story mode.\n- GET TRANSFORMED INTO A DEADLY CYBER NINJA -\nSairento VR is a mission-driven, VR action role-playing game set in a re imagined Japan in the near future. In Sairento, you play as a member of the Silent Ones - a righteous but covert organization of seemingly ordinary people who practice the long forsaken code and martial arts of the ancient samurais and ninjas.\n\nCrafted painstakingly to provide an engaging and visually stunning first-person sword-fighting and gunplay - expect awesome weaponry, intuitive controls, challenging levels, menacing enemies and beautiful environments in your fight to restore order to the world.\nGet transformed into a mighty warrior with an arsenal of ancient weapons with a futuristic twist and engage an endless horde of enemies across different locations.\n- GAME FEATURES -\nChosen to be a Silent One for your outstanding character and trained by a sensei skilled in the art of ancient Japanese martial arts and modern fighting, you not only yield a mean katana, but are also skillful with guns and projectile weapons. Built for non-stop slash and shoot action, Sairento aims to set a new standard in VR games in terms of excitement and engagement.\n\n• Leap 15 feet into the air, perform double jumps, run across walls or slide across the floor like only a true action super star could.\n\n• Soak yourself in blood-pumping, exhilarating music as you become God in your own action movie.\n\n• Engage enemies using our innovative combat system, allowing you to fight in slow motion and parry incoming projectiles like a boss.\n• Cut your enemies down with a futuristic katana or blast them to smithereens with good old fashioned guns.\n\n• Fancy hurling blade beams from your katana? You can do so by upgrading your abilities and weapons as you accumulate experience from completing missions.\n\n• Traverse a reimagined futuristic Japan in unique oriental locations.\n\n• Upon full release, the game will include a story campaign as well as co-op play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mixed Realms Pte","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9055,"name":"Zenge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32a/32a99cec5b0f205bc5ad7fc7ba3cf1e1.jpeg","description":"Zenge is relaxing a puzzle game. The main character, Eon, finds himself between the worlds and time. \n\nYou'll experience an immersive journey told through beautiful art, intriguing puzzles and original soundtrack. This game is absolutely distraction free. Don't expect to see here any tutorials, level up's, point to score or gems to collect. \n\nGet in the mood, find some free time and embrace yourself in this unique puzzle experience.\n\nGame music is available on Soundcloud: https://soundcloud.com/hamster-on-coke/sets/zenge-soundtrack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hamster On Coke Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":7563,"name":"Galcon 2: Galactic Conquest","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddf/ddfc2b209d66aba39bd1cf8f210b03e1.jpeg","description":"Galcon 2 is a demolition derby in space! Send swarms of ships from planet to planet to conquer the galaxy in this fast paced multiplayer strategy game!  Galcon 2 includes:\nClans battling for galactic supremacy\nTournament to prove your amazing skills\nBetting to take Galcoins from the weak\nMultiple ship shapes like triangle and trapezoid\nSlick planets made of lava and ice","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hassey Enterprises","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2,"name":"Extreme Exorcism","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67d/67d0e74fd74fd2ea9b847856fb388736.jpg","description":"Extreme Exorcism is a paranormal platformer where every move you make comes back to haunt you.\nTake on the role of Mae Barrons; an Extreme Exorcist with extreme measures. Her supernatural skills are called upon when everything and everyone else has failed to rid a haunted house of its ghostly presence.\nConventional methods won’t cut it with these ghosts. Instead, Mae comes armed with a deadly arsenal of ghost-busting weapons, from rocket launchers to razor sharp boomerangs.\nBut these aren’t your average poltergeists. At the end of each round, a ghost appears and mimics your every move from the round before. The longer you survive the more extreme the game becomes.\nEngage in non-stop ghost annihilation in 10 eerie areas of the haunted house – each room presenting its own hellish hazard. Brave the winds on the balcony and the fire in the kitchen, surviving for as long as you can.\nWith a devilish local multiplayer – you can play co-op or deathmatch modes with up to 3 of your friends, and with 50 unique challenges even the most daring Extreme Exorcist will be put to the test.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Golden Ruby Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":720937,"name":"Serious Sam: Siberian Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/261/261f147b8cbe9fed2da8d81a1bb52d68.jpg","description":"Welcome back to the world of Serious Sam in 'Siberian Mayhem' - a new standalone chapter in the adventures of 'Serious' Sam Stone. Make your way through the vast Russian landscapes on a quest to catch up with the traitorous General Brand, who remains one step ahead of Sam at every turn. The road is long, and there is oh so much to see.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":487914,"name":"Super Mario 3D All-Stars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/58a/58a051c3626dcac72bc111fb056b082c.jpg","description":"Play three of Mario’s greatest 3D platform adventures—all in one package!\nPlay three classic games at home or on the go—all in one package on the Nintendo Switch™ system! Jump into paintings in Super Mario 64™, clean up paint-like goop in Super Mario Sunshine™, and fly from planet to planet in Super Mario Galaxy™.\n\nRun, jump, and dive with ease!\n\nMake Mario move using the Nintendo Switch system’s Joy-Con™ controllers. You can also pass a Joy-Con controller to a friend to play the Super Mario Galaxy game in Co-Star Mode! Mario’s movements are as smooth as ever with HD resolution for each game, while still retaining the look and feel of the originals.\n\nListen to timeless Super Mario tunes\n\nListen to a total of 175 iconic tunes from all three games! Whether you want to get up and dance or take a minute to relax—this collection has music to fit your mood!\n\nDiscover (or rediscover) three of Mario’s most iconic 3D platform adventures, all in one package, available on the Nintendo Switch™ system. Experience Mario’s first foray into 3D platforming in the Super Mario 64™ game, originally released in 1996. Wall jump, backflip, and even fly as you explore paintings and collect Power Stars to save Princess Peach!\nSoak up the sun in the Super Mario Sunshine™ game, originally released in 2002, and spray the goop away with your water-spouting pal, FLUDD! You’ll need to collect Shine Sprites and clear the picturesque Isle Delfino of pollution—just look out for Bowser Jr.\nDefy gravity as you explore space in the Super Mario Galaxy™ game, originally released in 2007! Help Rosalina restore her ship by collecting Power Stars and save Princess Peach. Gently shake a Joy-Con™ controller to activate Mario’s Spin ability or pass a Joy-Con controller to a friend for some extra help in Co-Star Mode*.\nEven when you aren’t playing, you can enjoy the sounds that these worlds (and galaxies!) are so famous for. With three games, modern upgrades, and music-player mode, this collection is filled with fun for both new players and 3D platforming Mario masters. Super Mario 3D All-Stars will be available as a limited-run retail edition and a digital edition that is available for a limited time until the end of March 2021.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":303589,"name":"Subverse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc5/cc53e34ef5665e6497686d3f4127aed3.jpg","description":"Welcome to a new era in adult entertainment!\r\nTired of crappy, low effort hentai games? Then enter the Subverse – an old school PC gaming experience developed from the ground up for the discerning adult by an experienced team of filthy apex perverts.\r\nEXPLORE A WACKY NEW GALAXYDiscover the Prodigium Galaxy – filled to the brim with original lore and thick, meaty content. Explore dozens of star systems and hundreds of planets to find all sorts of missions, anomalies and other interesting stuff like sexy bounty hunter squidgirls that relentlessly stalk you and your equally sexy crew of waifus..\r\nFIGHT IN SPACE OR PLANETSIDEThrow down in either SHMUP-style space missions dripping with retro nostalgia or take the thinking man’s approach and duke it out on the ground with dynamic turn-based combat. Mastering both modes will lead to glorious booty so you can upgrade your ship and troops.\r\nYOUR OWN SHIPThe Mary Celeste not only holds the record for fastest sub-light delivery of weed in the galaxy but she’s also your base of operations. Watch your ship evolve and grow as more aliens join your crew and start living in the various quarters. Just make sure you clean up after them. And watch out for Dallick from maintenance, he’s kind of a dick.\r\nROGUE’S GALLERY OF BADASS BABESThere are no good girls in Subverse. Well, not until you train them, anyway. These are the baddest babes in the galaxy complete with exceptional combat potential and drop-dead gorgeous looks. Earn their loyalty and get some other exceptional benefits in the process. Like sex.\r\nUNWIND AFTER A HARD DAYIt’s time for some fully animated StudioFOW-quality rewards! Experience a diverse array of scenes from\r\nF/F pairings\r\nF/M pairings\r\nF/whatever the FUCK that thing is pairings all animated by the same team that brought you such cinematic classics as “Bioshag Trinity” and “Mila Red Riding Hood”\r\nFEATURES LIST\r\nNo Pay2Win, no Gacha, no Lootboxes and no daily logins. Get rewarded for winning, not for losing. Spend your XP and loot to unlock filthier sex scenes.\r\nNine unique waifus to join your crew, all fully animated and voice acted by the sultriest VA’s in the biz.\r\nPowered by the latest Unreal Engine 4 tech, this is Studio FOW like you've never seen them before! Beautifully rendered babes and the trademark cinematic quality has been given the next-gen treatment.\r\nUnlock fully animated sex scenes as rewards. Enjoy a diverse range of fetishes catering to every perverted whim.\r\nCinematic slides and fully animated models drive the story forward.\r\nCustomize your waifus appearance by equipping impractically sexy skins.\r\nFight in space SHMUP and JRPG-inspired ground combat missions.\r\nUpgrade and progression system where you can improve your ship and waifu's combat abilities.\r\nBreed an army of bio-engineered aliens to fight alongside your waifus...and keep them company.\r\nEnjoy an absurdist comedic singleplayer storyline alongside a free-roam mode where you can explore at your own pace.\r\nFull 3D environments and backgrounds. No 2D backdrops.\r\nA pulsating 25+ track OST with chillstep, trap and synthwave tunes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Studio FOW Interactive","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":56114,"name":"Medal of Honor: Frontline","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08c/08ca27b7fd35a76a3ec7b44b3643c30e.jpg","description":"Medal of Honor: Frontline is the fourth game in the Medal of Honor series, and was published by EA Games. The player character is Lt. Jimmy Patterson, from the American OSS. Frontline takes place during the events of the first game and chronicles Patterson's journey as he fights his way across Europe into Nazi Germany during World War II. Frontline was released in North America for the PlayStation 2 on May 29, 2002 and for the Xbox and GameCube consoles on November 7, 2002.\nIn 2010, an HD port of the game was included in the \"Limited Edition\" PlayStation 3 version of Medal of Honor.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":39053,"name":"Return to Mysterious Island 2: Mina's Fate","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62f/62fb1f9365f0e29dc16e0ddc4a2c10fa.jpg","description":"Mina’s rescue from the end of the first game is cut dramatically short and she and primate pal Jep are left again on the mysterious island to fend for themselves! Mina needs to dress her wounds and keep safe against the local wildlife, but now she has the assistance of the player controlled Jep who can fit in smaller spaces, move deftly through the jungle and even communicate with other animals in their bid to survive. Using even more combinations of items throughout the island, Mina and Jep will need to recover from their traumatic circumstances and find another way, any way, off the mysterious island!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Kheops Studio","platforms":[{"id":0,"name":"PC"}]},{"id":24392,"name":"Bejeweled 2","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d52/d52a59d2304947b2be1e3a9989e25bed.jpg","description":"Get set to play the world's #1 puzzle game, now for the Wii console!\nMatch sparkling gems three at a time to make them burst in showers of\ncolor and points. Match four or more to create flashy power gems that\nboost your score and your mood with brilliant cascades and combos. Soar\nto gem-matching heights in Classic mode, or speed through matches\nagainst the clock in Action mode. For even more dazzling fun, bump up\nyour brainwaves with multi-faceted Puzzles, or enter the Zen state of\nEndless play. Every match is high-carat fun!\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"PopCap Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"},{"id":0,"name":"Android"}]},{"id":21703,"name":"Clandestinity of Elsie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/746/74658c66f8a311e816d9551dbada9c4a.jpg","description":"About\nClandestinity of Elsie is a Survival/Psychological-Horror game based in the post-WW2 New York State cities of Albany and Troy.\nStory\nYou play as Hayden Warrick, a mentally damaged alcoholic and war veteran. Haunted by his past, he must unravel the mystery of his wife Elsie's sudden disappearance. You must scavenge, kill, and survive long enough to find her. Mostly taking place in vast darkness, you must continue your objective of finding Hayden's wife Elsie while ensuring his own all-important survival.\nFeatures\nIntense combat against otherworldy monsters\nUncomfortable atmosphere to keep players on their toes\nPsychological storyline with mind-bending qualities\nVarious enemies representing Hayden's insecurities and fears\nMysterious characters with unknown intentions\nCan play in 1920x1080 resolution\nFull gamepad controls including vibration\nIncludes Achievements, Trading Cards and Steam Cloud","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Albin Bernhardsson","platforms":[{"id":0,"name":"PC"}]},{"id":12051,"name":"Master Spy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e42/e42941f131f5b4025d6a1d4531fc3a41.jpg","description":"Throw on your invisibility cloak and put your reflexes to the test in this brutal precision platformer brimming with espionage, intrigue, and betrayal!You are Master Spy.\nIn a world of corruption and decay, you're not just good at what you do - you're the best. And with the aid of your prototype cloaking suit and quick wit, you'll sneak your way past a multitude of enemies and obstacles, all while uncovering a plot of conspiracy and intrigue that thrusts you into a role far greater than your contract promised.Confidential Details:Jump, sneak, and cloak your way through more than 50 challenging levels, with locales ranging from churning electro factories to mystical ninja command centers!\nCinematic pixel art cutscenes pull you into the experience, weaving a tale of espionage, intrigue, and betrayal!\nDiscover Secret levels hidden throughout the game, allowing you to change the story!\nPut your skills to the ultimate test in the unlockable limited-visibility Blind Master mode!\nTrain in Novice mode with checkpoints that aid you on your mission!\nJam in that cheat code to play any level and watch the cutscenes at your leisure!Featuring an Original Soundtrack by Grammy Award Winner André Allen Anjos / RAC.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"TURBOGUN","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3602,"name":"Madden NFL 15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/329/32944df35db110454152ac969cf73090.jpg","description":"Madden NFL 15 transforms you into your rival’s worst nightmare with a new breed of defense built to challenge the best offenses in the NFL.  A new arsenal of pass rush moves, an intuitive tackling system, improved coverage logic, and immersive new camera angles make defense exciting and fun to play.  Call plays with confidence thanks to an all-new crowd-sourced recommendation engine built from millions of online games played by the Madden community.  Add in all-new NFL Films inspired presentation and it’s not just football, it’s Madden Season!\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2014 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc. The mark 'John Madden' and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear, Inc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. All rights reserved. 'Officially Licensed Product of NFL PLAYERS INC.' and 'NFLPLAYERS.COM' All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":325032,"name":"Shadows of Doubt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b03/b0340e6cf8f30568de68471619ac4181.jpg","description":"An open world stealth game with a whole city of secrets at your fingertips!\nShadows of Doubt is set in an alternate reality hyper-industrialized 1980s, where the government outsources police work to private corporations and contractors. You play the role of a private intelligence investigator, making money by finding and selling information.\nThe capture of the rampant serial killer carries a hefty bounty, but who knows what secrets you’ll find along the way. In this world of secrets & lies, information is power, and the cards you hold are determined by how far you’ll go to acquire it.\nBreak into apartments, rifle through secret documents and hack security systems. The entire world is fully simulated. Each citizen has an apartment, a job, a daily routine, favorite things to do, places to go, and people to interact with. Uncover this knowledge and use it to your advantage!Features\nEvery room in every building is able to be explored. Lose yourself in an incredibly detailed sci-fi/noir world.\nOpen-ended gameplay: How you achieve your objective is up to you. Choose where to go and who to pursue.\nA Powerful blend of procedural generation and hand-crafted design will mean your city, it’s buildings, addresses and citizens will be completely unique to your game experience -but not feel random.\nFollow the main story to hunt down a serial killer. It could be anyone, hiding anywhere...\nDig into the lives of hundreds of simulated citizens to earn extra cash. Secrets are valuable, and everyone has them.\nLocking-picking, hacking, sneaking, climbing. Level up your skills and become a master of stealth.\nEarn enough to upgrade your own apartment and home office, or even purchase a new one.\nIncredible film-noir soundtrack.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"ColePowered Games","platforms":[{"id":0,"name":"PC"}]},{"id":50410,"name":"PickCrafter","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b36/b36abc5515a6cd011fd92f0f26af61db.jpg","description":"Mine gems, collect Pickaxes and discover treasure filled Biomes in PickCrafter!\nThe popular mobile game PickCrafter is now available on your desktop!\nBreak blocks and earn Picks in this pixel-style clicker! Craft and upgrade Legendary Pickaxes. Prestige to reach Extravagant, Transcendent, Preposterous, and Legendary tiers.\nDiscover all the Biomes - find snow in the Tundra or explore space and alien worlds like the Moon or Mars.\nUnlock and use Abilities to boost your strength.\nBattle with your friends and rank up on the leaderboards! There are over 90 achievements to unlock. Rare, Epic, and Legendary items await you!\nDownload now to unleash your inner treasure hunter in PickCrafter!\nNote: PickCrafter is free to play game and all items can be obtained through standard gameplay, however the option to purchase content using real money exists.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fiveamp","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":36941,"name":"Caesar 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99a/99aa7b5d2e7b814166172562f7bbef8e.jpg","description":"Hail Caesar! Starting as governor of a newly formed province in the Roman Empire your goal is simple: advance up the empire's political ladder to become the next Caesar. As governor, you will have total control over your province: including city planning, finances, and defenses. As you succeed you will be given new challenges in other provinces within the Roman Empire ultimately ending in the heart of the empire: Rome.\nCaesar™ IV represents the culmination of more than a decade of development experience in the city builder genre making it the definitive ancient city builder. Plebs need not apply.\nBuild Your Rome: Build your city in any imaginable combination. Bask in the awe-inspiring glory of more than 100 unique structures.\nExpanded Economic Control: With over 30 tradable goods, 10 industries, 4 markets and foreign trade routes the economic possibilities are vast.\nLeading Edge Graphics: High dynamic range lighting, specular & bump mapping along with realistic weather effects and a complete day / night cycle bring Rome to life in never before seen detail.\nExperience Life in Ancient Rome: Interact with more than 75 unique characters within your city.\nImproved Combat Functionality: Take direct control over your legions, who gain experience through combat and training, as you ward off barbaric invasions.\nOver 100 Hours of Gameplay: Including career mode, standalone competitive scenarios, and sandbox mode.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Tilted Mill Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19531,"name":"Alter Ego","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69a/69ac1deb12e630a8ab37587d8e07e7f3.jpg","description":"Winona is the perfect girlfriend. She's so giving and kind, and the light of Reese's life - until one day, she winds up dead in Reese's kitchen. Reese is accused by a gargantuan tiger named The Judge of murdering Winona, and stumbles through a mindscape of her own making, exploring old memories and feelings about Winona in order to find the true culprit behind Winona's death.\nALTER EGO is a 2D point-and-click narrative-based adventure game featuring psychological elements. Reese the Rat discovers the dead body of her girlfriend, Winona the Sheep in her kitchen. Explore two levels with atmospheric environments, solve puzzles, and use the items in your inventory to uncover the mystery behind Reese and Winona’s relationship, and find the real culprit—if there is one.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Caramel Column","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17027,"name":"YOU DON'T KNOW JACK HEADRUSH","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8af/8af7ac6d497e475e03850be81c5f5f48.jpg","description":"Were you a teen in the late 90s? If you didn't play HeadRush back then, now’s the perfect time! Tons of trivia about the teen-y topics of the day await your now-aging brain and fingers!\nForget everything you know about a YOU DON’T KNOW JACK game because YDKJ’s horribly deformed, mutant offspring HEADRUSH has been birthed! Twisted animation, insane question types, and a bizarre appetite for all human excretory fluids and gassed add up to the most over-the-top YDKJ game ever! Fire this game up and stand back, because this is not your Mommy and Daddy’s YOU DON’T KNOW JACK!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":16276,"name":"Noct","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13d/13df44a81e4e85e5569fe1ebf10b96d1.jpg","description":"Once our home and record of modern civilization, the Earth is a ruined wasteland engulfed in perpetual darkness. Older than any recorded texts, an ancient evil descended upon our world without warning, consuming the population and leaving only despair behind in its wake. The unfortunate survivors of this purge now struggle to overcome the horrific terrors of the Nocturnal.\nNoct is a 2D top-down multiplayer survival horror game that blends arcade combat with RPG survival elements. You are a survivor of the apocalyptic purge that formed the desolate wasteland now known as Noct and view your experience in the world through a thermal image satellite system high above the Earth.\nScavenge and Survive: Players must scavenge weapons, rations, utility items, and other provisions from the wasteland to survive the harsh world and defend themselves from the evil in the dark.\nPersistent Online World: The entire game world is persistent. Players may choose to connect to, or host their own world servers which they can adventure in. This allows players to interact with other survivors in Noct if they wish, or make their game experience strictly a solo affair.\nUnspeakable Horrors: Battle the dozens of nightmares that stalk around in the night and leave their dead carcasses as a warning to others or flee into the wild and leave your fellow companions to satiate your pursuers.\nHaunting Soundtrack: Slip on your headphones and dim the lights to let the haunting soundtrack from Nine Inch Nail's Robin Finck and composer Wordclock wash over you and ratchet up the tension.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"C3SK","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]