[{"id":2960,"name":"TowerFall Ascension","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b61/b6193c5c1f917f38dce568f335f80c16.jpg","description":"TowerFall is an indie action-game with focus on local multiplayer. It was initially developed as an exclusive for OUYA microconsole and was later ported on other systems as TowerFall Ascension. The gameplay represents an arcade-style fighting arena where four people combat each other to score points in a series of rounds. There are for several characters to choose from in the game. Every one of them has two main ways of killing opponents: bow and stomping. Every player starts with only 3 arrows which, after being shot, can be picked from the spot where they fell. The player can also jump on each other in retro-platformer style. The arenas exit is connected with exits on the opposite side of the map, so if the player falls down the pit, he immediately appears from the top of the arena. There also several powerups that can be found in treasure chest scattered across the map.  \r\nThe Ascension version of the game also features single-player mode in which player has to kill waves of enemies on the arena. It has no story whatsoever and is more like a series of challenges with different monsters, powerups and unique peculiarities on locations.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Matt Makes Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":23037,"name":"Victor Vran","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d3/6d35c69d8435af5fcd448b08e82c3fd4.jpg","description":"Victor Vran is an isometric action-RPG, set in a fictional town, where the player’s character must hunt demons and other vile creatures and rid the world of darkness.\n\nThe gameplay despite being similar to other games in the hack’n’slash genre features unique elements based on player’s reaction. Dodging bullets and moving around hordes of enemies can be tricky, but the game emphasizes that the main way to achieve is not just spamming two skills, but employing techniques and developing character’s abilities in the way that would be comfortable to the player. The different loot system helps the character in his journey, as various weapons have their unique abilities, and often improves character’s skills.\n\nThe game’s art style is highly reminiscent of Dracula movies and other vampire-based stories. The grim locations and fearsome enemies leave a mark on any player, and the soundtrack of the game also adds to the overall mood of evil lingering in the dark.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Haemimont Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19627,"name":"Commandos 2: Men of Courage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39b/39beb43bceb3dcca896c128ddeccec48.jpg","description":"Set during the World War II, this isometric tactic game offers the player to lead an Allied commando squad through a series of secret military operations. The game was inspired by war movies like Bridge on the River Kwai and Saving Private Ryan, and some missions are set at the background of the real events shown in this films, such as the Battle of Normandy. There are ten main missions, not counting tutorial, and ten bonus missions are unlocked after you complete the storyline. Most missions require sneaking, camouflaging, and stealth action. The maps are not covered by the fog of war, so you can study them beforehand to thoroughly plan the squad’s movements.\nFor each mission, you're given a predetermined set of characters. Each member of the squad is named after his or her specialization, such as Sniper, Diver, or Seductress, and has a set of unique abilities and a colorful personality. Spy, for example, can disguise himself as an enemy officer to send the guards away, while Sapper can set and disable landmines. Most characters are from the original Commandos, but there are also new members, such as a sneaky Thief and Whiskey, the squad’s bull terrier. The variety of characters’ skills was also increased to make them more versatile.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":303576,"name":"Vampire: The Masquerade - Bloodlines 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb5/fb5e0fdb1f6bb0e8b5da5d08bb83a5fc.jpg","description":"Sired in an act of vampire insurrection, your existence ignites the war for Seattle's blood trade. Enter uneasy alliances with the creatures who control the city and uncover the sprawling conspiracy which plunged Seattle into a bloody civil war between powerful vampire factions.\r\n♞Become the Ultimate Vampire\r\nImmerse yourself in the World of Darkness and live out your vampire fantasy in a city filled with intriguing characters that react to your choices. You and your unique disciplines are a weapon in our forward-driving, fast-moving, melee-focussed combat system. Your power will grow as you advance, but remember to uphold the Masquerade and guard your humanity... or face the consequences.\r\n♝Descend into Seattle’s Dark Heart and Survive the Vampire Elite\r\nSeattle has always been run by vampires. Hunt your prey across Seattle locations faithfully reimagined in the World of Darkness. Meet the old blood founders present since the city’s birth and the new blood steering the tech money redefining the city. Everyone has hidden agendas - so choose your allies wisely.\r\n♚Enter into Uneasy Alliances\r\nChoose a side among competing factions, each with their own unique traits and stories, in the war for Seattle’s blood trade. The world will judge you by the company you keep, but remember no one’s hands stay clean forever.\r\n♛Experience the Story\r\nWritten by the creative mind behind the original Bloodlines, Vampire: The Masquerade® - Bloodlines™ 2 brings the ambitions of the first game to life and sees the return of a few fan favorite characters.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Hardsuit Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":8923,"name":"Faeria","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f64/f6429c7e6e66c178fde186977ea1af75.jpg","description":"The game is played with cards on a special field. The goal of the game is to \"kill\" the opponent, laying out cards on the field. The game lets you compete with other players or AI. \n\nThe game takes place on an empty hexagonal field, two corners of which are occupied by avatars (against each other), and the other four corners are wells of Faeria (mana). Each player starts the game with thirty cards.\n\nAt the beginning of the turn, the player draws a card from their cards and receives three points of Faeria (mana). If by the player manages to take a well of mana, the player receives one mana point additionally for each well. The game also uses the Power Wheel, different cards have different potentials and affect the game in many ways. Laying out cards on the field also matters - laying out cards is regulated by the rules and gives as a result combinations of different strength and quality. Playing cards spends mana reserves, each card requires a certain amount of mana in reserve to play. And the enemy is harmed through a decrease in the health - the cards affect this figure. Victories give in-game currency to the player, which they can pay for new cards with and make the stock of cards unique.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Abrakam","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":295001,"name":"Batman: The Telltale Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/674/674b67b66f510f5b273f50ca09341ee2.jpg","description":"Batman: The Enemy Within, 2017, is an episodic point-and-click graphic adventure video game, a sequel to 2016's Batman: The Telltale Series.\n\nThe player controls the character, who, on the one hand, is the well-known billionaire, entrepreneur and philanthropist Bruce Wayne, and on the other hand, a crime fighter named Batman, hiding his real name from people.\n\n###The series\nThe Enemy Within is set in the same Batman continuity introduced in Batman: The Telltale Series - within Gotham, a city infested with crime and corruption. Both games are set in mid-to-late 2010s with technologies such as drones and smartphones. The places where The Enemy Within takes place are the same as in the previous game - Batcave, Wayne Enterprises and Gotham City Police Headquarters. The Enemy Within follows the events of the previous game, taking place between a couple of months to a year after these events.\n\n###Fresh interpretation of Batman in games, film, or comics\nThe creators of the series claim that the game offers the player to choose how to perceive certain situations - like Batman or Bruce Wayne. They promise a \"fresh interpretation of the universe set in current times, not tied to any existing iteration of Batman in games, film, or comics». To preserve this freshness, the creators of the game begin their story about Batman a few years after Bruce Wayne became Batman - they claim that it gives them the opportunity to be flexible in describing the character; As a result, the player, according to the creators of the game, also receives a certain freedom, playing for Batman in the branching narrative, which the game offers.\n\nPlayer selection influences what happens in the game next.\nThe game includes situations where it is necessary to act quickly, as well as the investigation sequences. \n\n###Crowd play\nIn the games of the series there is also the so-called \"crowd play\", it allows the game to be watched by an audience who can participate in the decision-making process.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":16552,"name":"Dead Bits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e17/e170c8d8082a31897e38cfd3cbd9c1e6.jpg","description":"In Dead Bits, everything, from the environment to enemies, is entirely made of cubes. The game is intentionally made with extremely minimalistic graphics and simplest textures, and is set to dubstep music. Visually, Dead Bits somewhat reminds Minecraft, but gameplay-wise, it’s a combination of the first-person shooter with platforming elements. \nThe protagonist named Quilly was kidnapped by the aliens led by Quanton. Quilly has to complete a series of tests for Quanton before he is released. The “tests” actually consist of short levels in which you fight zombies and giant humanoid robots made of boxes. The protagonist starts each level armed with either a gun, an iron stick, or even nothing at all at some levels where you have to find the weapons yourself. Most levels are set on the platforms floating in the middle of nowhere, though there’s also a claustrophobic corridor level with limited visibility. Outside of the cutscenes, there’s no character model. Quilly has no visible legs and casts no shadow, which makes navigating the platforms way more difficult than one might expect. Each Quilly’s death is followed by a cutscene that cannot be skipped.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microblast Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3734,"name":"Mercenary Kings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/809/809fd6c9fedf0a13bb6c197176c102a7.jpg","description":"Indie genre is getting bigger and stronger every day and one of the most successful and desired by fans sub-genres of indies – pixel art is evolving too. This genre is dedicated to those players who feel deep nostalgia while thinking about old memories connected to playing classic video games on systems such as (S)NES or Sega. Mercenary Kings is one of those games which brings nostalgia at its fullest. For the most part, this is the re-imagining of old and classic game called Metal Slug. It is a side-scrolling 2D-action game made by Tribute Games company. In Mercenary Kings you can run, jump, crouch and roll but most importantly – you have to shoot. And shoot a lot. There are about 100 missions in the game, also you can play it with three of your friends in local co-op mode. There is main hub where the player has to prepare for missions before going out. Also, there are boss battles, hostage rescues and item collection. Enemies when killed drop loot with witch player can upgrade his or her weapons. This is simple yet addicting and fun game for those who search for something nostalgic.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tribute Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":40104,"name":"Sam & Max: The Devil's Playhouse - Episode 1: The Penal Zone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53b/53b07d7d8979bd4a5cb4e484c7aacc33.jpg","description":"Wield psychic powers against fearsome foes in this epic 5 game comedy saga.\nIn The Devil’s Playhouse series, a mysterious power calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane.\nThis first episode starts with a bang as gorilla invader Skunk'ape sets his sights on Max’s mysterious abilities.  While mastering his future sight, teleportation, shape shifting and mind reading powers - and investigating their source - Sam & Max must fend off villainous Skunk’ape and get him banished to The Penal Zone.\nThe saga plays out in a surreal symphony of mayhem that gets deeper and more twisted with each episode.\n* Episode 1: The Penal Zone\n* Episode 2: The Tomb of Sammun-Mak\n* Episode 3: They Stole Max's Brain!\n* Episode 4: Beyond the Alley of the Dolls\n* Episode 5: The City That Dares Not Sleep\n2010 Telltale, Inc. Sam & Max created by Steve Purcell.  Sam & Max copyright and trademark Steve Purcell.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":4023,"name":"Deadly Premonition: The Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f41/f41531613687833e943fd1d3d8811327.jpg","description":"Deadly Premonition: The Director's Cut is an open-world horror game with a dramatic shift to the exploring the world and realistic time-management. It is a reboot of a previous game of its developers — Access Games. Rainy Woods has never been published due to technological problems. \nThroughout the game, the player, as Francis York Morgan — the FBI policeman — tries to inquire the identity of a Raincoat Killer. We can explore the in-game world by foot or with the help of a car. Walking by foot consumes more time and strength, but driving a car forces the player to buy fuel and compensate for repairs.\nThe game also features combat mechanics — the player may use the melee weapons and firearms against the forces of another world. The latter, however, cannot catch sight of them if they get a hold of their breath.\nThe story follows the investigation of the murder of Anna Graham,. The events depicted take place in the universe in which good and evil intentions may be shared within the world by the messengers.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Access Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":2359,"name":"Divide By Sheep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d4/9d45ba1c76712ad692fadda67f2777a9.jpeg","description":"Divide By Sheep is a math puzzler about the Grim Reaper's devious plan to make some sheepy friends. Grim can only befriend the dead, so he decided to unleash a great flood and drag the sheep under. Now stranded on small islands and sinking fast, the sheep need you to help them reach safety.\nYou save the little animals by solving clever math puzzles. Divide By Sheep is a game of addition and subtraction by any means possible, where puzzles start off fairly easy and playful, yet quickly escalate in both difficulty and dark humor.\nThe mighty features:\n120 mind bending puzzles spread across 4 worlds\nDark humor inbound, parental guidance advised!\nWhat happens when you divide a whole into half? You get two halves!\nLasers, wolves... oh, and also a kraken (The Grim Reaper's pet)\nDrown sheep. Or wolves. Or pigs. Do whatever it takes to succeed\nFabulous art-work that quickly goes from cute to disturbingUSE PARENTAL CONTROLS BEFORE GIVING THE GAME TO KIDS! Main menu has the option to disable blood.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"tinyBuild","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2503,"name":"Party Hard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a1/5a1ce6908dc401fa9f805d5db4e832d7.jpg","description":"The genre of this game is defined as stealth-action. However, its plot is very unusual, although it does not contradict such a definition of the genre.\n\n###Plot\nYour character is a person who is deadly tired of a very common problem: the neighbors who threw a noisy party, not taking into account that they do not live alone in the world.\n\nIn ordinary life, you usually silently endure or call the police. But in this game you should just kill everyone who has the imprudence to make noise. You can do it with a knife, and you can use other, very simple, improvised means. At first, you only have a knife, but over time, the tools appear more interesting.\n\n###Gameplay\nThe game has ten unique levels. Some details of each level are generated randomly, so each game is somewhat different from the other.\n\nAfter loading the level of the hero finds himself standing in front of a building or a complex of buildings, where there is a party with the participation of about fifty people.\n\nIt is assumed that by this time your character is already quite angry. And now he faces only one simple task - to destroy all.\n\nThe character has the skills to work with a knife, can set a variety of different traps, use various items.\n\nThere are also obstacles in the game. For example, party members may call the police, there are guards in the building, and if you kill a police officer, FBI agents will arrive. There are also others who may suddenly appear.\n\n###Bonuses\nYour character is not always the same person. There are several characters in the game that you can become as you play. These characters are more capable of killing, among them there are ninja and even a policeman.\n\nYou may have allies, someone you can call for help.\n\nThere is also a spin-off simulation game titled Party Hard Tycoon.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":10364,"name":"911 Operator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5e/a5eb5de9041397ca0f8b933c96a593b9.jpg","description":"In 911 OPERATOR, you take on the role of an emergency dispatcher, who has to rapidly deal with the incoming reports. Your task is not just to pick up the calls, but also to react appropriately to the situation – sometimes giving first aid instructions is enough, at other times a police, fire department or paramedics’ intervention is a necessity. Keep in mind, that the person on the other side of the line might turn out to be a dying daughter’s father, an unpredictable terrorist, or just a prankster. Can you handle all of this?\n\nPLAY ON ANY CITY IN THE WORLD*\n\nCheck out thousands of cities from all around the world. The Free Play mode lets you choose a city to play on - the game will download its map, along with real streets, addresses and the emergency infrastructure. You can also try the Career mode, which contains 6 cities with unique events – survive an earthquake in San Francisco and save Washington, D.C. from bomb attacks.\n\nMANAGE TEAMS\n\nA number of police, fire department and paramedic units are at your disposal. The forces may use a variety of vehicles (from common ambulances to police helicopters), essential equipment (e.g., bulletproof vests, first aid kits and technical tools) and consist of team members with different abilities.\nPEOPLE’S LIVES ARE IN YOUR HANDS!\nMain features:\nOver 50 recorded dialogues inspired by real calls: serious and dramatic, but sometimes also funny or annoying.\nReal First Aid instructions.\nOpportunity to play on any city in the world!\n6 selected cities in Career mode, featuring unique calls and events.\nMore than 140 types of reports to encounter.\n12 types of emergency vehicles (including helicopters, police cars and motorcycles).\n***\nThe game requires Internet connection to download free maps. The offline game is available after downloading the maps.\nAll map data ©  OpenStreetMap authors\n* The term “city” is used within the meaning of OpenStreetMap service and relates to urban areas described as “city” or “town” therein.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PlayWay","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":22123,"name":"Hellpoint","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a65/a6539d3373835ee27f26abc626b8bc61.jpg","description":"Hellpoint is a dark sci fi action RPG set in the aftermath of a massive quantum cataclysm. Every living being quickly lost their mind as their memories and bodies were merged with alternate versions of themselves from parallel universes. The accident also attracted entities of immense power that should have been left alone, in the depth of other dimensions.\nYou play as a mysterious nameless character whose intentions are entirely determined by your choices. You wake up in the derelict Irid Novo space station, in orbit around a super-massive black hole.\nIn the game, the space station orbits in real time around the ominous black hole. Its position in the sky directly impacts the sanity of the inhabitants of the station. The singularity is doing more than simply distorting the fabric of space and time; based on the time of the orbit, enemies in the levels get crazier or struck by fear, unknown entities roam the corridors and dozens of other mysterious events can occur.\nHellpoint is based on a peculiar structure called the Quantic System. It is a series of interconnected systems that are utilizing a server clock to decide when and where a particular dynamic event should occur. You can see a preview of that system in our demo linked below. You venture in a corridor that you previously walked through, and suddenly a new passage is opened. A tall menacing mini-boss is now patrolling where there was no one before. Enemies cower in fear as you approach them, or charge you in a fit of rage. A boss suddenly grows tougher and more aggressive, but also drops more valuable loot. It is up to you to figure out what events happen where and when so that you can exploit them to your advantage.\nIn Hellpoint, the Black Hole is truly the master of the dungeon.\nIrid Novo was once a shining beacon of intergalactic collaboration, built to research advanced artificial intelligence and quantum mechanics. Now, it is a dark and dangerous place dominated by the will of the cosmic gods. It is best to explore Irid Novo with the help of a friend.\nHellpoint supports splitscreen co-op and player versus player on all platforms. You can play the whole game with a friend, or have him jump up in and out anytime he likes. The loot is shared, and the experience of player two is saved and not watered down. In our youth, we've had countless nights of couch gaming fun, playing with friends and siblings until the sun rose. With Hellpoint, we want to bring back couch gaming into a genre that we think cruelly lacks it.\nFor centuries, the galaxy has been at peace. With the discovery of interstellar travel and the access to infinite resources that ensued, brutal wars are now a thing of the past. To survive the wrath of cosmic gods and hordes of monsters, you will have to find ancient blueprints and craft long forgotten weapons and armors and acquire forbidden powers. You play the way you want, will it be a sword and a shield, or a firearm and your mastery over the cosmic energies?\nHellpoint allows you to play the way you want. Using our crafting and customization system, you can adjust your weapons and powers according to your own play style. Do you prefer your healing power to heal more over time or instantaneously? Go edit your power in one of the crafting station, and make it work the way you like. Would you prefer your energy missiles to explode on impact, or to ricochet off enemies? The choice is yours to modify them as you see fit.\nThe more you fight with a weapon, the more proficient you become with it and eventually you unlock powerful abilities. This can go from an extra long range combo attack to a shattering explosion that sends enemies flying.\nA terrible quantum cataclysm happened on board Irid Novo and is spreading to the whole multiverse. Piercing the very fabric of space to reach parallel universes is not something mortals should be allowed to play with. However, those breaches into other universes could very well be the key for you to make things right...\nEvery time you start a new game, the station is different. Rooms, enemies, puzzles, events, all are parts of the multiverse. This means that while our level design is carefully hand crafted, no two games are exactly the same. The game stay fresh as you never know what to except around the corner. As you die, you are pulled away from your universe of origin, and you wake up into the next. The more you die, the more the world changes around you.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Cradle Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":28150,"name":"Anthem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc4/cc43daf431c44420c7f602025d250fb1.jpg","description":"Anthem is a multiplayer-oriented game where teams of players share a common futuristic world while fighting enemies with the use of their armored power suits.\r\n\r\n###Premise\r\nThe players assume the roles of Freelancers, the warriors who use armored exoskeletons. Those battle suits, called Javelins, grant their wearers superhuman powers and abilities such as flight. The Javelins can be customized and upgraded with various weapons and gadgets. There are four main classes of Javelins, such as the Ranger (the “Jack-of-all-trades”), the Colossus (the party's “tank”), the Storm (high-tech aerial fighter), and the Interceptor (the fast-moving class for close combat).\r\n\r\n###Setting\r\nThe game is set in the future in an alien world. The starting point of the game is Fort Tarsis, in which the players can accept quests and help various factions. From there, they undertake the expeditions into the wilderness. There are four main factions in the game. The Sentinels protect law and order with force. Corvus uses espionage to eliminate the threats. Cypher have superhuman powers like telepathy and making complex calculations. The Arcanists is the faction of scientists and explorers.\r\n\r\n###Gameplay\r\nThe multiplayer mode is the main mode of Anthem. It is cooperative and allows up to four players to participate in a game together. They fight together against the monsters, marauders, and other enemies they encounter. The game also includes a strong RPG element, such as dialogues with non-player characters.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BioWare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":15852,"name":"STAR WARS Jedi Knight - Mysteries of the Sith","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ee/3ee387f0e1681ec4c7f082ce371ce904.jpg","description":"As a full-fledged expansion of the Star Wars Jedi Knight: Dark Forces 2 changes several things,  one of which is ignoring the ending of the dark side. As a direct story continuation, Star Wars Jedi Knight: Mysteries of the Sith picks the story from the light ending, and players meet the protagonist of the previous game, Kyle Katarn, in the role of the Jedi Master training Mara Jade. After the introduction, where Katarn defends the New Republic outpost from the imperial troops, players will control the apprentice, Jade, on her mission to find a Sith temple.\nSWJK: Mysteries of the Sith is a first-person shooter with a possibility to switch to the third person view. Unlike the original game, players don’t have the moral choice system, because the single-player story has a single positive route. The game has 14 levels as a story campaigns as well as 15 maps for multiplayer battles. As a Jedi apprentice, Jade will have not only to the ranged weapons, like blasters but lightsabers and force powers. But in multiplayer, that supports up to eight players to fight as the characters from the Star Wars films.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":49236,"name":"Despotism 3k","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eee/eeebf5eb9b8c8fbcbf3981268c2edd53.jpg","description":"Humanity is enslaved by an artificial intelligence! And that's wonderful, because you are on the right side of things. Manipulate those pitiful humans to produce the energy needed for the machines. You'll have to make sure they don't die of hunger or fatigue, but it can even be fun. And by the way, you may recycle the spares in a bioreactor at any moment!\nAnyway, this is a resource manager with roguelike elements, as kids say these days. The project got started at Ludum Dare 39 and is now being turned into the game of our dreams.Key features Black humor, full immersion in being a soulless despot!\nResource manager on steroids. Your decisions have to be fast, precise and merciless!\nRoguelite - every attempt to complete a game Act is unique due to random event generation. Every loss is fatal - you have to start again.\n\"Easy to learn, hard to master.\" With a detailed step-by-step tutorial the gameplay is easy to understand, but it is hard to achieve victory.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Konfa Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":369158,"name":"The Dark Pictures Anthology: Little Hope","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/643/6431f15213a854efd273943f2cf6a925.jpg","description":"The Dark Pictures Anthology is a series of intense, standalone, branching cinematic horror games featuring single and multiplayer modes.\n\n4 college students and their professor become stranded in the abandoned town of Little Hope. Trapped by an impenetrable fog they try desperately to escape whilst witnessing terrifying visions from the past. They must figure out the motivation of these apparitions before the evil forces at work drags each of their souls to hell.\n\nWitness terrifying visions of the past, haunted by the events of the XVIIth century Andover Witch Trials\n\nEscape the hideous apparitions that relentlessly pursue them through the fog!\n\nPlay online with a friend or up to 5 friends offline.\n\nAbandon Hope...all who enter here!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":57607,"name":"Metal Gear Solid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbc/bbce6f1659d35ffc16aed8b66e9990a1.jpg","description":"You are Snake, a government agent on a mission to regain control of a secret nuclear weapons base from terrorist hands. Lightly armed and facing an army of foes, Snake must avoid firefights in order to survive. If Snake can locate them he can utilize advanced hardware, ranging from silenced pistols to ground-to-air missiles. Enemies react to sight and sound - so stay quiet and stay in the shadows. State-of-the-art graphics: textures, transparencies, models and explosions. Taut, gripping story with multiple endings - a truly cinematic experience.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PlayStation 3"}]},{"id":268446,"name":"Barotrauma","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/862/8620fd3d08ecce0e806507299333058d.jpg","description":"Overcome crisis and the unrelenting pressure of a frozen ocean. In Barotrauma you're a submarine crew member beneath the ice of Jupiter's moon Europa. Flee or fight alien lifeforms, explore a strange new world, command your crew, and craft equipment in a tense 2d co-op experience.Key FeaturesCommand and manage your submarine and its various systems in adrenaline-filled co-operative gameplay.\nPlay as the captain or any of the 4 other character classes, with up to 16 players per submarine.\nSingle Player campaign, sandbox mode, and single missions also available.\nProcedural levels and events ensure no two games will ever be exactly alike\nEach submarine has multiple crew operated systems, from nuclear reactors to sonar, guns, engines and more\nComprehensive crafting system to create tools, drugs and weapons\nNavigate dangerous environments to achieve mission goals or simply explore and travel deeper into the game world\nExplore alien ruins and wrecked submarines along the way to discover rare and powerful artifacts and other resources\nFully integrated mod tools allow you to create and transform the game via Steam Workshop. Submarine editor, character and procedural animation editor, procedural level editor, sprite and particle editors - unleash your creativity!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Undertow Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19345,"name":"Command & Conquer: Red Alert 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/776/776e601c2c37f50bb11f9054f54c60da.jpg","description":"Command & Conquer Red Alert 3 is a real-time strategy game set during an alternate scenario of World War II. In the game the United States confronted the USSR. To provide their victory, the Soviets went back in time and changed the future. As a result, the third power appears - the Empire of the Rising Sun, and all three forces get involved in a new war. All factions in the game are playable and provide different playstyles. While the Soviet army is suitable for a fast-paced expansion, the Japanese side focuses on technological progress. The US keep the medium position.\n\nIn Red Alert 3 you need to build a base and develop technology to create weapons. The main difference from other RTS is that the campaign in the game is fully cooperative, played either with a friend online or with an AI teammate. The game also features Naval Warfare mode with facilities built on water and various marine units. Additionally, each country has 15 unique abilities to use during battles.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":7353,"name":"Back to Bed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43a/43a648790000e1317c81c268cf6c0ed7.jpg","description":"Back to bed is an indie surreal puzzle game developed by Bedtime Digital Games. The game was initially developed as a student project for DADIU. The prototype was later expanded with the help from Kickstarter.\n\nThe player's objective is to help a sleepwalker to safely get to his bed moving the objects in each level. The sleepwalker follows a distinct path. The players have to change this path and guide him in the right direction. The players have to be careful with their decisions as the sleepwalker can just walk off the level. Several entities can also prevent the sleepwalker from arriving at his destination. Most of these entities just block the path and have to be moved out of the way by the player.\n\nThe game features a surreal art style which is somewhat inspired by Pablo Picasso and Salvador Dali. There's also a small mix of the sixties inspired artwork which can be seen in the sleepwalker's outfit or simply the typography of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bedtime Digital Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3679,"name":"Worms Battlegrounds","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/772/77272915ed66e464986ad6afcdf52407.jpg","description":"Worms™ Battlegrounds brings friends and families together in the noble pursuit of self‐improvement, world domination and exploding sheep.\nForm Clans, Take On The World\nJoin together with friends and other Worms™ Battlegrounds players to form a fearsome team name your clan, design your own emblem, promote other players to act as leaders and officers. Enter your clan into the league and fight together to make your mark on the leaderboards. Nobody wants an empty trophy cabinet!\nSlick Single Player Gameplay Too\nStory Mode’ adds a ton of variety by introducing physics based contraptions for the first time ever. A plethora of interesting machinery spices up the gameplay, and makes solo Worms™ much more fun! The single‐player game isn’t only about dealing death and destruction, it’s also about negotiating tricky swinging rope bridges and rescuing friendlies from death defying traps! The player spends much more time playing, and much less time waiting for their A.I. opponent to take a shot.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-4\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nWorms™ Battlegrounds Developed by Team17 Digital Ltd. © 2014. Team17 Digital Ltd‚ Worms™‚ and Worms™ Battlegrounds are trademarks or registered trademarks of Team17 Digital Limited. Original concept by Andy Davidson. All other trademarks‚ copyrights and logos are property of their respective owners. Developed and published by Team17 Digital Limited.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":10638,"name":"Book of Demons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ef/4efd33ac1ca2e3799cda7ff379f03708.jpg","description":"Not convinced? Try the free demo!\nWarrior / Rogue / Mage Gameplay Preview\nAbout the Game\nBook of Demons is hack & slash distilled to its purest form. Devilishly charming and fun as hell. Slay the armies of darkness in the dungeons below the Old Cathedral and save the terror-stricken Paperverse from the clutches of the Archdemon himself. The game is the first installment of Return 2 Games - a series of original mid-core titles, inspired by the early golden days of PC gaming.Decide the length of quests!Have only 5 minutes for a game? No problem! Book of Demons allows you to set the length of each quest, thanks to our Flexiscope™ system. It learns your way of playing and gives you the best experience, making Book of Demons the first truly accessible hack & slash!Build your own deck of devastating skills!Collect powerful skill cards, combine them depending on the enemies you're facing and assemble your favorite set of devastating powers! But be warned: efficiency of each card will greatly depend on the situation you're in, so be prepared to make constant adjustments!Relive the classic with a good laugh!Book of Demons is a universal tale of good and evil about saving the world from total destruction and ultimate devilry! Sounds familiar? Well, how about retelling the story in a different way, with a humorous twist of a parody?Be a part of a one-of-a-kind adventure!Never explore the same dungeon twice - in Book of Demons every level is a procedurally generated, randomly-populated adventure of its own! You won't get bored by the diversity of monsters either - there are over 70 kinds of creatures waiting to be slain: lurking scorpions, snake archers, mad goatmen, not-so-sexy succubi... you get the idea.Hack & slash in the world of Paperverse!Book of Demons is indeed a dark fantasy hack & slash, but unlike other action role-playing games, it's set in the pop-up book world of Paperverse. The paper-cut universe is one of the hallmarks of Return 2 Games - a series of mid-core games, inspired by the early golden days of PC gaming. Book of Demons is the first installment of the Return 2 Games series.Looking for even more challenge?Slaying the Archdemon won't be the end of the story. In Book of Demons, you can master the campaign with 3 different classes (Warrior, Rogue or Mage), revisit your favorite quests in Freeplay mode or rise to the challenge and explore the dungeons on higher difficulty levels (the last one is called Massacre, with good reason).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Thing Trunk","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":3923,"name":"Lost Planet 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e33/e33934ed780db4c2256bd02b280e5eb0.jpg","description":"Lost Planet 3 is an action third-person shooter developed by Spark Unlimited. It is the first game in the Lost Planet series timeline.\n\nSeveral colonists and miners are sent to a planet of E.D.N. III by a company called NEVEC. You play as a miner named Jim that works for NEVEC. All the mined resources are sent back to Earth. Jim unravels the secrets of the corporation Throughout the story.\n\nThe game features giant mining mech rigs that are upgradeable to some degree. Players can also upgrade their weapons and suit. In order to buy new upgrades, the players have to find specific parts and scrap that also can be bought. Using the mission-based mechanic, the game allows the players to go on completing the main quests or get some side-quests to help their comrades and gain some new equipment.\n\nThroughout the game the players fight an alien race of Akrid. Akrids have thermal energy flowing in their veins instead of regular blood. That's why they can survive extremely cold temperatures on E.D.N. III.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":288796,"name":"MORDHAU","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a96/a96619e930d6999d15420d061e6870c6.jpg","description":"MORDHAU is a medieval first & third person multiplayer slasher. Enter a hectic battlefield of up to 64 players as a mercenary in a fictional, but realistic world, where you will get to experience the brutal and satisfying melee combat that will have you always coming back for more.Features: Massive battles: From small-scale engagements to 64-player all-out war in modes such as Frontline and Battle Royale.\nCooperative & offline play: Fight waves of enemies alongside your friends in the cooperative Horde mode, or practice your skills offline against AI.\nFree-form melee and ranged combat: Gain complete control over your character and attacks and develop your unique style.\nIn-depth character customization: Sculpt your face, create your weapon from parts, and pick out individual pieces of armor to create the perfect warrior.\nHuge arsenal of weapons & equipment: Take on enemies with a greatsword, rain arrows from above, or even sit back and build fortifications.\nFight anywhere: Experience cavalry charges, fight on ladders, and operate siege engines such as the catapult and ballista.\nVisceral and gory combat: Feel the impact of every blow, and send limbs flying as you wreak havoc upon your foes. (Blood & gore are optional)\nBelievable fights: A game where fights look believable, MORDHAU strikes a balance between gameplay and realism.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Triternion","platforms":[{"id":0,"name":"PC"}]},{"id":3214,"name":"Ziggurat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/929/92962e1c3902b9a89b91c09c8f1a17b2.jpg","description":"Ziggurat is an indie first-person adventure dungeon crawling game developed by Milkstone Studios.\n\n###Gameplay\nThe game was heavily inspired by Heretic and Hexen, which are considered classic first-person shooters. You play as a sorcerer who seeks fame. He enters a mysterious labyrinth and faces all the dangers of an ancient dungeon. \n\nThe game revolves around fast-paced and action-packed first-person shooting classical mechanics. Several roguelike elements were also added into the mix which resulted in a completely different addition to the genre. The levels are procedurally generated so that every playthrough will be different. Leveling up and improving your skills is a must in order to survive countless enemy encounters. \n\nA perk system is also present in the game. Most of the perks featured in the game are designed for the players to create their own play style. The choice between the perks was purposely made simple. For example, the players have to choose between increased movement speed at the expanse of lower health or mana regeneration. \n\nThere is no inventory present in the game as it was streamlined in order to increase the gameplay speed. Instead of that, all the players have to manage is the comparison of several items, weapon selection, and the amount of mana and health.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Milkstone Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":326229,"name":"FIFA 20","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/031/031af38e6a558d4cd4bf91ee80904cdf.jpg","description":"Powered by Frostbite™*, EA SPORTS™ FIFA 20 for the PlayStation 4, Xbox One, and PC brings two sides of The World’s Game to life - the prestige of the professional stage and an all-new authentic street football experience in EA SPORTS VOLTA FOOTBALL. FIFA 20 innovates across the game, FOOTBALL INTELLIGENCE unlocks an unprecedented platform for gameplay realism, FIFA Ultimate Team™ offers more ways to build your dream squad, and EA SPORTS VOLTA FOOTBALL returns the game to the street, with an authentic form of small-sided football.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":14612,"name":"State of Decay YOSE - Day One Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b7c/b7ca1cb806aa0c4212757d1fb9aa9255.jpg","description":"State of Decay, along with major Add-Ons Breakdown and Lifeline, is now fully remastered in stunning 1080p.  New missions, weapons, and extra content, along with improved lighting, textures, animations and combat mechanics, will pull you even deeper into the post-outbreak world.  How will you survive the zombie apocalypse?\nNew Missions\nMysterious supply crates start dropping into remote areas across the map, attracting massive hordes of zombies. Wipe out the infestation and you can grab some of the rarest and most powerful equipment seen in State of Decay.\nNew Survivors\nYour favorite characters from Lifeline can now be unlocked in Breakdown, including the previously unplayable Kelly “Sasquatch” Eldridge.\nNew Vehicles\nNot only do players get a brand-new SUV, but custom vehicle skins are also distributed across all maps for greater personalization.\nNew Weapons: Under-Barrel Grenade Launchers and Incendiary Shotguns\nFind new assault rifles equipped with under-barrel grenade launcher attachments as well as shotguns that fire incendiary rounds.\nMake your stand against the collapse of society in the ultimate zombie survival-fantasy game. Explore an open world full of dangers and opportunities that respond to your every decision. Recruit a community of playable survivors, each with their own unique skills and talents. Design and fortify your base against the relentless hordes of the undead. Perform daring raids for food and ammunition, and do whatever it takes to live another day.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Undead Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":3574,"name":"Sherlock Holmes: Crimes and Punishments","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9b8/9b86078de72fce4c535153e805b8c01d.jpg","description":"Sherlock Holmes: Crimes and Punishments is an adventure whodunnit by Frogware. The studio specializes on Sherlock Holmes games. 'Crimes and Punishments' is six out of seven games in the series.\n\n###Gameplay\nThe player takes a role of Sherlock Holmes — famous detective. The game consists of 6 non-related cases.\nThe first accentuation in levels is made in investigating the crime scene and searching for clues. After the examinations section comes the deduction one — the player must interconnect the evidence and find out who the culprit is. The burden of punishment is also on the playing one, thus the game title. \n\n###Story\nThree out of the six cases — The Fate of Black Peter, The Riddle on the Rails and The Abbey Grange Affair are reminiscent of the original Conan Doyle stories. Thus, the narrative flow and plot twists are adapted from the original whodunnit as well. \n\n###Features\nOne of the key features of the game is the possibility to guess the culprit wrong ergo making the false accusation. This, in turn, would affect the outcome of further cases. However, with the cases not being firmly tied down together, the impact of player's mistakes is insignificant. The loading screen as it appears rarely provides one with not only the loading bar but also the evidence to inspect and clues to examine thus using the loading time fully.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Frogwares","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":58829,"name":"Super Smash Bros. Ultimate","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f3/9f3c513b301d8d7250a64dd7e73c62df.jpg","description":"Super Smash Bros. Ultimate is the fifth game in its franchise. It is also the first game in its series to be released for Nintendo Switch.\r\n\r\n###Premise\r\nThe series is a crossover of characters from various video game franchises, such as The Legend of Zelda, Pokemon, Sonic the Hedgehog, Super Mario, Metroid, and Mega Man, among many others. Their famous protagonists fight each other on an arena. In accordance with its name, the game is the “ultimate” installment of the series, in that it offers the players all the characters ever featured in Super Smash Bros. The game also introduces five new characters, most famously, Castlevania's Simon Belmont.\r\n\r\n###Gameplay\r\nUnlike most fighting games, Super Smash Bros. series is built around knocking opponents out of the arena rather than lowering their health bars. However, the damage meter increases the character's chances to be knocked out. Each fighter has a limited number of lives and loses one when he or she is knocked out. The player is eliminated when he or she loses all lives.\r\n\r\n###Multiplayer\r\nSuper Smash Bros. Ultimate includes several competitive multiplayer modes. Besides the traditional versus mode, there are several new modes not featured in the previous games. These include Tournament (the playoff mode for 32 players), Smash Squad (team multiplayer), Smashdown (a mode in which the defeated characters are eliminated).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":18853,"name":"Puzzle Agent 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a067c93dd1f331ac7a2e77bb3fc46e0.jpg","description":"Puzzle Agent 2 is an adventure/puzzle game and it is the sequel to Nelson Tethers: Puzzle Agent video game. In this game as well as in the previous one the player has no inventory and can talk with other characters. There is a huge emphasis on puzzle solving which also can be done through dialogues with other characters. Some of the dialogues change the way the story goes and has consequences in the game’s progress. But there are also other kinds of puzzles like a jigsaw, or involving math and logic. There are always some clues or rules on how to solve puzzles in the game. During a puzzle, the player can ask for no more than three hints that help to solve puzzles but it costs a chewing gum. About gum – it seems that there is a shortage of gum in the city the game is set and Nelson Tethers, the same protagonist from the previous game, has to collect pieces of chewing gum throughout the game. During each puzzle, Nelson has not only to solve it but also to send his answer to HQ, who either approves it or not. If he succeeds, he gets a reward depending on how much hints he used and how many failed attempts he made.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":18347,"name":"Beat Hazard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47c/47cb2bf92060596d42ab0afefe39808b.jpg","description":"Beat Hazard is a game in which everything is synchronized to your favorite music. Gameplay-wise, it’s a regular 2D shoot ’em up in space, not unlike Asteroids or Project Starfighter. The player controls a small starship that fires at everything on the screen, from asteroids to enemy spacecraft, in order to survive. When hit by an obstacle or by enemy fire, the ship explodes. The goal is to survive as long as possible and score more points to unlock bonuses and receive ranks.\nWhat makes gameplay in Beat Hazard innovative is that every level is based on a song from the player’s music collection. The song defines the speed and rhythm of the game. A similar approach was previously used in Audiosurf, but never before in a shoot ’em up. Enemy attacks, your ship’s fire, and power-ups are synchronized to the song and can be predicted if you remember the tune well. The difficulty is also dependent on music. A power ballad or an ambient piece will do for a slow, meditative play, while a trance or heavy metal composition will turn the game into madness. The game’s visuals are very bright and feature many rapid flashes, which makes Beat Hazard not recommended for people with epilepsy.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cold Beam Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":275641,"name":"Moving Out","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/726/7263e11b6bfb15abe35dcfa3b26147f5.jpg","description":"It’s orientation day at the Smooth Move company. To become certified Furniture Arrangement & Relocation Technician (F.A.R.T.), employees need to pop the training tape into the VCR and take in the dos and don’ts of moving furniture.\nTrain alone or with friends in this action, puzzle, physics based moving simulator. Expect plot twists, irreverent humor, cameos and borderline trademark infringing scenarios as you complete the 50+ levels. With party mode you'll be able to compete for the highest score locally or against the community.\nGuided by narrator Mick “RicePirate” Lauer players will learn the ropes in a series of increasingly precarious and fantastical instructional lessons. These span everything from unloading cargo off moving planes to smuggling giraffes out of the zoo and transporting goods to strange locales like haunted houses and outer space.\nNo matter what the job entails, customers appreciate prompt delivery. So, whether on a heist or doing a repo job, load as much into the truck as possible before zooming off to the next gig. How freight gets from one place to another is entirely up to players, though, so toss the manual out the window and get creative. Break down the walls, throw things, and use technology like portals and ray guns across more than 50 levels. Anything goes, as long as the work gets done!\nEnjoy the game solo as an independent contractor or team up with a friend or loved one. Moving Out features both local and online play across its arcade, story, and versus modes. Each level also adjusts the experience dynamically to account for the number of players on screen, thereby welcoming Smooth Move employees of all ages and skill levels.\nMoving Out is currently in development as the premiere title from SMG’s Melbourne studio and is made in collaboration with Stockholm-based developer Devm Games.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SMG Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":680,"name":"Red Faction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a81/a81632a0060ca9fc0e33552a5c52bb9e.jpg","description":"The series of video games, known for the destructiveness of virtual environments. The action takes place at the end of the 21st century. Humanity has colonized Mars and now is extracting minerals that are no longer available on Earth. The player takes control over the miner who goes by the name Parker, and who helps rebel forces with the uprising against the evil Ultor Corporation. The latter is entirely out of hand and violates the fundamental human rights: does not provide workers food and medicine and treats miners as slaves.\n\nThe main game mechanics is the GeoMod technology, which allows players to extensively change the virtual environment. For example, with the help of explosives or other improvised instruments. Unavailable earlier freedom of action allowы players to complete levels non-linearly, and change them beyond recognition. The version for the PC included an additional level of Glass House, in which GeoMod's capabilities could be used in full, and a multiplayer with 25 maps.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"THQ Nordic","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":58766,"name":"Kingdom: Two Crowns","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f15/f15236ba62fdb1c04cfb4d5a40168f54.jpg","description":"In the award-winning Kingdom series, players took on the role of a monarch struggling to build their kingdom up from nothing. Hundreds of thousands of players across the world explored, recruited loyal subjects, and defended nightly against the persistent threat of the Greed – but they did so in isolation, and as with all things in Kingdom, nothing lasts… until now.\n\nKingdom Two Crowns builds upon the challenging micro strategy experience with an evolution of the celebrated franchise. Introducing the brand-new campaign mode, monarchs must now work to build a kingdom that stands over time until finding a way to defeat the Greed for good. Recruit new unit types and develop advanced technologies to bolster your defenses. Explore fresh environments to discover new mounts and secrets hidden in the deep. Revisit and revitalize your kingdom in its entirety as you move onward through the campaign.\n\nBut you don’t have to rule alone! Introducing a cooperative play experience that is totally unique to Kingdom Two Crowns, monarchs can now choose between a classic solo experience or seek the assistance of a friend, working together locally or online, dropping in or out at will.\nA challenge awaits all who seek it here, whether you are a first-time ruler or a longtime fan. So be brave, great monarchs, for in the end Two Crowns shall reign stronger than one!\n\nKey Features:\n👑 **BRAND-NEW CAMPAIGN MODE:** Built upon the classic micro strategy that made Kingdom successful, monarchs can now build lasting kingdoms in a multi-stage campaign to stop the assault of the Greed for good.\n👑 **TWO CROWNS TO RULE THEM ALL:** The struggle to build your kingdom need not be ventured alone! Strategize and defend your realm together in local or online drop-in/drop out co-op.\n👑 **NEW FEATURES, NEW STRATEGIES:** A wealth of new features from technology upgrades to unit types to secrets to enemies, monarchs will need to plan wisely to see their kingdom flourish.\n👑 **FORMIDABLE CHALLENGE ISLANDS:** Whether you seek the fierce threat of Skull Island or unique lands that modify the gameplay through special rules, the secret challenge islands expand the Kingdom experience to all players new and loyal.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Raw Fury","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"}]},{"id":40936,"name":"Jamestown: Legend of the Lost Colony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/245/245579c536d2a06e69d391573d911679.jpg","description":"Jamestown is a modern approach to the classic top-down shooter for four players. Developers abandoned the mechanics with a number of lives players have for every walkthrough and until at least one of the party is alive, he can revive the rest. The action takes place in the 17th century: the British Empire colonized Mars. The decent story plays a secondary role, the main focus on gameplay.\n\nThe game includes wild intensity, handcrafted visuals of the classic arcade and an insanely flickering screen like in Japanese bullet hell games. Developers used real Roanoke Colony and its inhabitants as a reference and animated films of Hayao Miyazaki as an inspiration.\n\nThere are 4 types of ships in total, each with two attacks: the primary one and the secondary one. There are 20 additional steampunk levels available for players to complete, which even those who have never played bullet-hell will like. The soundtrack and careful work on visual styles put gamers into a trance and creates an illusion of full immersion in the world of the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Final Form Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":53446,"name":"Need for Speed: Underground 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc6/dc68ca77e06ad993aade7faf645f5ec2.jpg","description":"Need for Speed: Underground 2 is a cross-platform racing video game and the eighth installment in the popular Need for Speed driving game series published and developed by Electronic Arts. Released in 2004, it is the direct sequel to Need for Speed: Underground, and is part of the Need for Speed series, available on Microsoft Windows, Game Boy Advance, GameCube, PlayStation 2, Xbox, PlayStation Portable, Nintendo DS and mobile phones. Like its predecessor, it was also commercially successful, breaking sales records in the United Kingdom.\nThe game entails tuning cars for street races, resuming the Need for Speed: Underground storyline. Need for Speed: Underground 2 provides several new features, such as a broader customization, new methods of selecting races, the \"explore\" mode (similar to the Midnight Club series, in a large city known as \"Bayview\"). The City Center was based on Philadelphia, Beacon Hill was based on Beverly Hills and Coal Harbor was based on Camden, New Jersey, and Bayview as a whole is a microcosm of the west coast of the United States. Underground 2 also introduces several SUVs, which could be customized as extensively as other Underground 2 vehicles and used to race against other SUV racers. Brooke Burke is the voice of Rachel Teller, the person who guides the player throughout the game.\nThe game has been ported to PlayStation Portable, under the title of Need for Speed: Underground Rivals. The Nintendo DS port introduces a new feature in which the player is able to design custom decals to adorn any vehicle in the game.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":9877,"name":"Beat Cop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5df/5df2b7a91454900a9efafaa003338b1b.jpg","description":"New York, more like a beast than a city. Explore it’s darkest corners and uncover its secrets as Jack Kelly, a former detective who has been framed for a murder. Degraded and forgotten by old pals, it’s your last chance to find the truth behind this whole terrible mess. The thing is, your new boss treats you like shit, your wife is a money sucking spawn from hell and the local mafia wants your head on a plate. I guess you could say, that things are complicated down here, in the middle of Brooklyn. Oh, and don't forget about writing tickets, reprimanding pedestrians & such. You're a beat cop after all.\nNONLINEAR STORY WITH MULTIPLE ENDINGSSomeone framed you and no one gives a rat’s ass about this but you. Turn every stone in this city and find out who did that. The further you investigate the more missing puzzles you’ll find, but be careful. Some things should never be brought to daylight.\n\nTHE ESSENCE OF '80 COP SHOWSHave you ever dreamed of being one of the heroes of cop movies? Of course you did, like we all. Now you have a chance! Be sexier than Sonny Crocket and tougher than Dirty Harry. And if witty comebacks won’t  work, you can always do some old school ass kicking. It’s ’80s after all!\nTHE HUMOR THAT YOUR MOM WOULDN'T APPROVEBe sarcastic. Be gloom. Be whatever you want. There are thousands of things in this world you can laugh at, and even more you shouldn’t, but who cares. It’s jungle out there baby, and sometimes you just need something to release the stress.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":4143,"name":"Rocketbirds: Hardboiled Chicken","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e8/1e899a215976efa776de62187dfab1b1.jpg","description":"The game is set in the cartoonish universe of birds that was first introduced in Rocketbirds: Revolution. The city of Albatropolis was subdued by a ruthless army of penguins led by dictator Putzki. You assume the role of Hardboiled Chicken, a rebel commando rooster who is tasked with killing the tyrant. He will, however, eventually discover there’s much more behind the penguins’ plot. \nThe game is divided into “chapters” which are split into very small levels, usually the size of one screen each. There are also several air levels in which Hardboiled Chicken flies on his jetpack. Most of the time, though, he walks through penguin military bases, climbing, hiding, solving puzzles, and shooting the guards on his way with various firearms. This is where the game’s “childish” visual style and tongue-in-cheek humor contrast its bloody action. There’s a co-op mode for two players that mostly uses the same maps but is based on a different plot about a kidnapped general's daughter.  \nRocketbirds: Hardboiled Chicken is most famous for music. Many intros, animated cutscenes and even some of the levels are set to synth rock music by the Austrian band New World Revolution.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ratloop Asia Pte","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]}]