[{"id":62068,"name":"Tunche","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96c/96ca0d195890f13ba0b86438dbe42e6b.jpg","description":"Tunche is a glorious return of classic 2D beat'em up gameplay mixed with roguelike elements, 4-player co-op and some creepy voodoo witchcraft. Explore breathtaking, hand-drawn Amazonian world, defeat epic bosses and master the ancient magical arts!\nTunche is a 2D beat'em up which tells a mysterious story based on a legend of Peruvian folklore. Combining hand-drawn animation with risky roguelite gameplay and fast-paced combat, Tunche creates an unfortgettable experience of fighting through hordes of monsters crawling deep in the Amazonian jungle.  Go solo or form a team of up to 4 players and embark on a journey that creates new challenges every time you play!\nExplore the breathtaking, hand-drawn world of Amazonian rainforests!\nUnravel the secrets of mysterious Peruvian legend!\nTeam up with friends in 4-player co-op mode!\nUse vast arsenal of fighting moves and magical arts to defeat your enemies!\nFace epic bosses and show them what you've got!\nLearn and adapt — every playthrough is unique!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"LEAP Game Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":60397,"name":"Mortal Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd4/dd46846c79ece08e2b50121e2205494e.jpg","description":"Mortal Royale is a battle royale game on a massive scale in a fantasy setting.\nUp to 1000 players are thrown into a massive world in the eye of a deadly chaotic storm that is slowly closing in on them.\nFind and tame mounts to give you not only speed but a powerful advantage on the battlefield.\nScavenge the lands for armor, weapons,bows and powerful magic to execute the unworthy and stand as the final surviving champion when the storms finally ends.\n\nKey Features\n- Battle Royale on a massive scale with up to 1000 players in a match.\n- Melee,archery,magic and mounted combat.\n- No registration required simply login with your Steam-account.\n- Deep combat system with individual hit boxes all with their own armor mitigation.\n- Hundreds of weapons.\n- 21 Different armor sets with 10 individual pieces.\n- 60+ powerful spells.\n- Free to play\n- Ancestry character customization with lots of options.\n- 64 sqkm map\n\nMortal Royale uses a dynamic set of server rules that changes depending on how many players enters the match.\nEverything from the size of the playing area to timers and loot dynamically changes to best fit the amount of players in the battle.\nThe servers are based of our own MMO server technology meaning we can scale up the battles to support as many as 1000 players in a single chaotic war!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Star Vault","platforms":[{"id":0,"name":"PC"}]},{"id":47513,"name":"Scream Collector","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/979/97946321eef8e95fb442afefc68dad92.jpg","description":"Build up a haunted house in this Halloween themed Idle Clicker game!\nStarting with modest beginnings, build up to a terrifying haunted house, unlocking secrets and mini-games along the way. Then enter the house, and build up more!\nNew for Halloween, 2018\nA whole new room is ready for you to dive into and build up – with new secrets to discover, and all new achievements.\nThe Dungeon is here!\nDo you dare enter?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PuzzleRoo","platforms":[{"id":0,"name":"PC"}]},{"id":43426,"name":"Dying Light: The Following","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/deb/debe45018f4d8a8b84631202d69cb04e.jpg","description":"Dying Light: The Following is a new chapter of Kyle Crane's story and a vast expansion to the base game. Offering the amount of content fit for a stand-alone title. All this, coupled with numerous improvements to the original Dying Light gameplay.\nThe impossible turned out to be true. There is a secret passage leading outside the walls of Harran. The unfair race against time to save countless human lives has just begun…\n\nBRAND NEW MAP\nDiscover a brand new, breathtaking region, larger than all of the base game maps combined. New locations, characters, quests and secrets await you.\n\nNEW STORY\nBecome Kyle Crane once more and uncover a mystery in which zombies are not the only threat anymore. Discover the secret of an ancient cult possessing the power to change Harran's fate.\n\nMODIFIABLE VEHICLES\nNew means of survival – a fully modifiable tool to spread carnage among the zombie hordes. Customize your buggy to turn it into a deadly weapon and hit the road.\n\nNON-LINEAR PROGRESSION\nGain reputation with the locals to discover new secrets guarded by the cult. Earn their trust by performing quests and choose your own path to infiltrate the sect.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Techland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":31859,"name":"Oni","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/60e/60ec0cee4c7dfdec953e608332b7a472.jpg","description":"A dark future... an uncertain past... no one left to trust. An intense action anime thriller comes to life in Oni. As an elite member of the tech crimes task force, Konoko is an agent on a mission to fight the evil Syndicate. But things are not always as they seem ... Konoko is haunted by unknown demons of her past, and the truth threatens to send her over the edge.\r\n\r\nCan you master this explosive hybrid of hand-to-hand combat and cutting edge weaponry to free Konoko from the evils that surround her?","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Bungie","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":26946,"name":"Retro City Rampage","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/077/077d73563fe77c0cf19cc4a293c35e7c.jpg","description":"This 8-bit throwback warps you BACK TO THE '80s.\n\nCruise through the open-world in stolen vehicles while outrunning the\nlaw and mowing down fellow citizens! Jump on pedestrians for coins, or\nuse them for target practice with over 25 weapons and power-ups! WHOA!\n\nFEATURES\n\n• SPECIAL BONUS: Includes Prototype \"ROM\" Version!\n\n• An interactive open-world filled with shops, arcades and casino games.\n\n• Over 60 Story Missions\n\n° Driving, shooting, stealth, rhythm, swimming, questing and more.\n\n• Over 40 Arcade Challenges\n\n° Quick pick-up-and-play action.\n\n• Official Crossovers and Bonus Games\n\n° Super Meat Boy, BIT.TRIP: Runner, Epic Meal Time, Minecraft and more.\n\n• Over 50 Vehicles to Drive and Equip\n\n° How about a skateboard with a rocket launcher or a shopping cart with\nnitro?\n\n• Over 25 Weapons and Power-ups\n\n• Customize your character with one of over 200 styles.\n\n• Over 2.5 Hours of Music\n\n• Video Replays","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"VBLANK ENTERTAINMENT","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":21800,"name":"Corrosion: Cold Winter Waiting [Enhanced Edition]","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/842/8423ea3100b63e24542ba69d21335a78.jpg","description":"Corrosion: Cold Winter Waiting is a dark, shocking, and fear charged mystery horror adventure game, that casts the player in the role of Sheriff Alex Truman as he attempts to piece together the origins of a disturbed and unidentified car crash victim.\nSet entirely underneath an idyllic country farmhouse, in the deserted and claustrophobic confines of a mysterious and secret underground complex, players will explore a place nobody knew existed, and uncover a twisted past that gets more and more terrifying with every corner turned, every door opened, and every note read.\nWhat happened beneath Cold Winter Farm? What does it have to do with the stranger, who survived a terrible crash, only to sit and mutter the farm's name? And if the place is supposed to be deserted, who keeps opening all the doors?\nTold from a 1st person perspective, in the style of Myst and Dark Fall, and backed by atmospheric pre-rendered 3D scenes, and a chilling score, Corrosion: Cold Winter Waiting weaves a tangled and brutal tale of love, revenge, jealousy, and bitter rivalry to create a horror experience that will bring new meaning to the concepts of hope and trust, and leave you questioning whether what you know, is really what you know!Key Features:\ndetailed storyline and characters\n1st person point and click slideshow style movement\natmospheric 3D scenes\npuzzles integrated into the narrative\n1280x 720 (16:9) screen resolution\nchilling and emotive original scoreThe Background Story\nDeacon Oaks is a small and quiet town, where nothing bad ever happens. Sheriff Alex Truman has a peaceful life dealing with lost dogs, trivial disputes, and a few drunks here and there. He should be the happiest lawman in the world. But there's just one small part of him that longs for some excitement, for something that would break the monotony he doesn't even realise is eating him alive.\nOne cold November night it seems his unspoken wishes may have been granted when he’s involved in a car accident with a man who appears suddenly in the middle of the road. Alex is fine, but the man ends up in hospital with a broken leg, and several cracked ribs. Nobody knows who this guy is or where he has come from, and to make matters worse, he won’t speak. Finally the town has its first real mystery, and Alex is overjoyed. But that joy is to be short lived.\nWith no way of finding out the man’s identity, he’s moved to the local state mental health facility, and life in Deacon Oaks goes back to normal, until two months later when Alex gets a call informing him that the “road guy” has at last spoken. Three words were all he would say – “Cold Winter Farm, Cold Winter Farm, Cold Winter Farm”, over and over again.\nAlex has no idea what it means, but he does know that Cold Winter Farm is on the edge of town, and that’s good enough. The mystery is back, and Alex wants to get to the bottom of it right away. Problem is, the biggest storm in fifty years is heading towards town – he’ll never make it out to the farm and back before the storm hits. But Alex doesn’t care – something deep inside is driving him – he has to know who the “road guy” is, and he has to know now. Abandoning all rational thought and ignoring the warnings of his deputy, he grabs the keys to the 4x4 and heads out.\nTen minutes after he arrives at the farm, the storm is so out of control, that it uproots a tree, which falls onto the house, crushing the roof, and trapping Alex in the basement. That’s not all though. The fallen tree has opened up a hidden doorway, which leads to a secret corridor. At the end of the corridor is an elevator, and the only place it can go is down. With no chance of being rescued until the next day, and with the overpowering need to find answers drowning out the fear he feels, Alex decides to take the elevator down.\nBut what will be waiting for him at the bottom? Will it explain the origins and identity of the “road guy”? Will it explain why the “road guy” was walking in the middle of the road, in the middle of the night, in the middle of the freezing winter? Will it explain why he wouldn’t speak for two months? And if it does, will the answers be simple, or will they be ultimately more disturbing and terrifying than anyone could imagine?Enhanced Edition\nThe \"enhanced\" edition of Corrosion: Cold Winter Waiting has been converted from its original square (4:3) resolution of 1024x768 to a higher widescreen (16:9) resolution of 1280x720 to better suit widescreen displays.\nOther updates include a new inventory and larger in game text for easier reading, as well as several general improvements throughout.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Viperante","platforms":[{"id":0,"name":"PC"}]},{"id":21783,"name":"Gardens Inc. 2: The Road to Fame","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47e/47e9f4c5fff566a4995cd369c20ef40d.jpg","description":"Jill & Mike have established their gardening company in Sunnyvale and now they are ready for the next step. Unfortunately, the dastardly Cliff Gold escaped prison and it seems that he is out for revenge on those who brought him to prison. Help Jill & Mike to win a contest that will be followed by contracts all over the world and uncover, what the villain is really up to.\nManage your time and resources effectively in this time-management gardening adventure. With both limited time and resources, you must work quickly and efficiently to get the highest possible score. Gardens Inc. might start off simple, but get ready for a challenge the further you plow through all 50 levels! Keep collecting and managing valuable resources that are used to complete goals on each level. Master these aspects, and you can get to the bottom of Cliff Gold's plan!\n50 dynamic & varying levels\nCreate beautiful gardens to your liking or try to guess your customer’s desires\nCountless achievements\nHigh replayability","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"World-Loom","platforms":[{"id":0,"name":"PC"}]},{"id":20115,"name":"3 Stars of Destiny","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/347/347be7b552a1843b28f47f70f1259b96.jpg","description":"Backstory\nRandom, Sarah and Luciana are three teenagers who do not know each other yet. They also do not know that they hold a very special power inside of them.\nBut someone knows. An evil god. His goal is to lure the three of them into the deadliest of traps and absorb their power. Will he succeed? Or can you lead the soon-to-become heroes to face and defeat their worst nightmare? Play this oustanding adventure and find out!\nDetails\n3 Stars of Destiny is a fantastic 2D RPG by the makers of the Millennium series and The Book of Legends. In this extensive adventure, explore countless unique places, defeat tons of enemies and complete richly developed quests. The game features addictive gameplay and an adventure worth tens of hours of playtime.\n3 Stars of Destiny was rated:\n4.2/5 by Gamersgate players\n4.9/5 by Big Fish Games players\nKey Features:\n50 achievements to unlock\n80 hours of playing\n10 Legendary Heroes\n50 Quests\n9 Relics and Artifacts to discoverFull List of Aldorlea Games Available on Steam\nMillennium - A New Hope\nMillennium 2 - Take Me Higher\nMillennium 3 - Cry Wolf\nMillennium 4 - Beyond Sunset\nMillennium 5 - The Battle of the Millennium\nThe Book of Legends\n3 Stars of Destiny\nDreamscape\nVagrant Hearts\nAldorlea Useful Links\nOfficial Website (contains 100+ games including all 20+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Aldorlea Games","platforms":[{"id":0,"name":"PC"}]},{"id":19244,"name":"Silverfall: Earth Awakening","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2be/2be9e3baf5dfaaf23ff9661b3b8cf671.jpg","description":"Silverfall Earth Awakening is an action RPG with unique graphical feel offering a fantastic quest to explore the new territories of Nelwë. In this heroic fantasy world where nature and technology collide you will have to make important choices which will lead you to side with one or the other. Play any one of the available six races, of which 2 are new: the stocky and lucky 'Dwarves' and the agile and treacherous 'Lizardmen', and prepare yourself to confront an impressive array of creatures and formidable bosses to save the realm of Nelwë.\nAlongside the Elves, Goblins, Trolls and Humans, discover 2 new playable races with 5 specific skills each : The dwarves and the Lizardmen, and then customize your hero ( skin, gender , hair, etc .)\nMaster over 156 skills and magic spells, including 8 new exclusive 'Ultimate' skills and 12 unique 'High Level' skills for an even more devastating result.\nUse different object crafting skills and make thousands of new and unique weapons, armour and spells.\nDiscover a new, fully adaptable game interface with improved ergonomics in which you can now control your hero with the mouse or keyboard.\nImport your hero from Silverfall to Earth Awakening and keep your level, equipment and skills...or start the adventure from the beginning with a level 45 hero.\nPlayable with up to 8 players in multiplayer mode via LAN and in cooperative or PVP mode via the Internet.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Monte Cristo","platforms":[{"id":0,"name":"PC"}]},{"id":16906,"name":"Clover Tale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a3/9a38926dac8ee72f8d25992833617197.jpg","description":"Addictive Match-3 game with exciting levels and super-cute graphics!\nWho doesn't like Match-3 games? That's exactly what 'Clover Tale' is about. Get ready for pure amusement and peek into an amazing fairy-tale world!\nExplore a beautiful world, complete quests, unlock new levels and gather collections! There's always something going on in the Nifflings' Valley. Sometimes it's funny, other times very dangerous. Even now, when everything seems so perfect, a black mist approaches their lands. What will happen to the peaceful valley of the Nifflings? Only you can solve all the mysteries and save the Valley!\n• 10 challenging game modes!\n• Over 200 exciting quests!\n• A vast world to explore!\n• User-friendly interface!\n• Free to play!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"FIVE-BN GAMES","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":16072,"name":"Etherium","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f60/f6009176f146f135c845cbf2f212e068.jpg","description":"Just Updated\nhttp://www.twitch.tv/focushomeinteractive/v/3946619\nAbout the GameEtherium is a real-time strategy game set in a science-fiction universe, where three factions battle it out for a mysterious and rare resource known as ‘Etherium’.\nManage your resources, develop your base, and take command of infantry, tanks, aircraft, and gigantic colossi of war to battle not only your foes, but weather anomalies and mysterious secondary factions in richly strategic and original RTS gameplay. In the single player Conquest mode, develop your technological capabilities and expand your colonies over the furthest sectors of space, assembling a formidable armada.\nEach of the three factions have their own strengths and weaknesses, as well as different tactical command skills such as map exposure, climate control, or planetary bombardment. Define your own strategy, deciding to either fell your enemy by striking their mother-ship from the planet's surface, or rapidly crushing their colonies. In multiplayer, team up or wage battle in all-out deathmatches with up to 4 players!\n3 empires with distinct characteristics, units, and special skills\nA dynamic weather control system that directly impacts your strategy\nA challenging multiplayer mode where up to 4 players can compete in intense matches\nA dynamic campaign where each decision counts","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tindalos Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":15546,"name":"Crush Your Enemies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/787/7872b4775703ce47c05cbd4f4dc48541.jpg","description":"We have all had enough of those cliché fantasy worlds with brave knights, ladylike elves and little people obsessed with jewellery. Generia is just another of those worlds... Thankfully there are evil barbarians coming to plunder, impale, drink beer, use inappropriate language and generally to make things interesting. And guess what? It's you who will lead them!\nGo back to the days when you thought real time strategy games were awesome. But this time you don't need to spend a whole hour to just win a skirmish. Jump right into battle and use your rusty strategic and tactical skills to crush hundreds of enemies within minutes! Crush Your Enemies has everything you like in strategy games: planning, choosing different types of units, managing resources, taking enemy territory and outwitting your opponents with  the ingenious formations of your men. Only of this strategic goodness is packed into a tight and intense experience you can enjoy no matter how little time you have.Game Features:\nTrue strategic challenge in a small package: Levels are packed with deep strategic options, but can be completed in shorter bursts\nSuper simple controls: Despite the depth of its systems, the game can be controlled with just one Mouse button\nEpic Single-Player campaign: The game features hours of strategic single-player goodness\nCross-platform multiplayer: Play against your friends and loved ones on PC and mobile devices. The battle never has to end!\nVarious Unit Types: Different unit types each have a different role on the battlefield\nPlundered Inventory: Expertly utilize and manage special items that can change the course of battles when used wisely\nWeird Boss Battles: Have you ever battled a Giant Death Snail that has a passion for head-butting? No? What are you waiting for!?\nStory filled with Naughty Humour: So your momma won't mistake the game for her favourite Medieval Village Clickfest!\nViolence, Beer and Curse Words: Enough said……","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":12002,"name":"Age of Cavemen","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f57/f57ccbf947edac265db4d87bde4566ad.jpg","description":"Fend off dangers of the wild, battle ancient armies and create alliances in your mission to conquer the world. As village chief, you are to build a prosperous settlement while defending your people from prehistoric dangers. This will be no easy task for other clans occupy this world; clans whose intentions might not be so pure. Set in a time long before modern civilization caveman operated on one basic law, conquer or be conquered. Which will you be? Start your settlement today to find out.\nAge of Cavemen is a free-to-play multiplayer strategy game where the main goal of the player is to face the dangers of wild, prehistoric world as a village chief. Build the prosperous settlement, lead your army, create alliances and destroy your opponents!\nNetwork connection is required to play this game.\nFEATURES\n●  Build a strong and prosperous village\n●  Survive attacks of the enemies\n●  Train a huge army\n●  Lead the warriors to victory in battle\n●  Explore the prehistoric world with other Chieftains and conquer the world","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fuero Games","platforms":[{"id":0,"name":"PC"}]},{"id":11861,"name":"Lionheart: Legacy of the Crusader","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25f/25fd4c8d9225bf931a631ffed4da097a.jpg","description":"Award-winning Black Isle Studios unleashes an epic RPG like no other. In the 12th century, a supernatural catastrophe tore the fabric of reality, unleashing spirits and magic, forever changing medieval Earth. Cast into this world and besieged by spirits and power groups, you must gain allies, take up arms and find your destiny.\nTo the common folk, magic was something to be feared and undoubtedly the handiwork of evil demons. People across Europe sought protection from the forces of evil and therefore relinquished utter control of their lives to the Inquisition.\nTo this day, the Inquisition still governs most of civilized Europe, directly or indirectly. In their relentless hunt for heretical wizards and magical creatures the Inquisition inspires awe and faith among many, and is despised and feared by others.\nChoose your champion – Feralkin, Sylvant, Demonkin, or Human Pureblood – and align yourself with the Knights Templar, the Inquisition, or the Wielders. Explore 16th century Europe, twisted and changed by magic, and encounter the likes of Leonardo da Vinci and Galileo.\nAn original story set in a warped alternative timeline\nMeet historical characters such as Leonardo da Vinci, Gallileo and Shakespeare\nOne of the greatest, if often overlooked, RPGs of all time","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Reflexive Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":11653,"name":"Origin Of Destiny","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb7/eb7782ab7699b60ffb12ca891f134431.jpg","description":"Sophie and Mike have been separated by an evil group and must now try and rejoin forces before taking on a great evil. But something more sinister is happening and may change the world forever!\nWith the help of their friends as well as other travelers Sophie and Mike must try to stop the Dark Lord and a mysterious organisation from not only taking over the world but taking over history.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Michael Howard","platforms":[{"id":0,"name":"PC"}]},{"id":11011,"name":"Oik","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fba/fba8ecdb68ba5aee63555d4e389f7a55.jpg","description":"Casual physics puzzle. The player's goal to keep the blue block on the platform for 3 seconds in order to pass the level.\n- 60+ levels\n- 200+ Achievements\n- Relax music\nOik - Puzzle in the style of Zup!Credits\"Oik\" powered by Clickteam Fusion 2.5\nMusic: Delone","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dr_Crewcut","platforms":[{"id":0,"name":"PC"}]},{"id":10034,"name":"Therian Saga","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/817/81752424ec1a4a5b8a958a405dee7536.jpg","description":"Therian Saga is a MMORPG that tries to stand out of the crowd by offering a compelling storytelling surrounded by a massive mathematical set of rules that define the world your hero will evolve in. It could be said that it borrows elements from old-time MUD games, strategy games and even tabletops RPG.What to expect from the game:Skill Based: We use a system based on your hero, your tool, your companion, your location and some magic to calculate your capability to execute an action.\nSandbox: It’s up to you to understand how to progress in the game.\nStorytelling: Old school style with text as the main medium for storytelling.\nCrafting: Complex, with a skills distribution mechanic from material to final product.\nHuge: The game is online since 2012, there are years of content available right now.\nAsynchronous: Play how much you like, be it 15 minutes or 20 hours, and program your hero’s actions. He will be doing them when you are sleeping, partying or working.\nIndies: The game is rough on players; you have to work hard to reach your goals.\nDevs: We are close to the players and you can discuss the future of the game with us.Asynchronous made coolTo break the prejudice that asynchronous game had to be simple games. That was really important to us. We wanted a game that people could spend less time on than live MMO, but that could offer more for each second online. Your characters work while you are offline, but you will be also thinking about what you are going to make them do next time you log in.\nThere are lots of games out there that are time-consuming for nothing. Building an asynchronous game that goes deeper into RPG gameplay: that was a battle worth fighting.A typical day in Therian SagaYou can play the game the way you want. There is never a situation in the game where you have to stay at the computer. You can quit in the middle of a dungeon, even in the middle of a fight, and come back the next day and pick up where you left off. If you quit in the middle of a fight with another player, your characters will continue to fight as well as they can while you are offline.\nWhat about the typical day? As an example, suppose you can manage only short-playing sessions during your day. You might schedule tasks for your hero in the morning, then just check if everything is ok at lunch time and maybe indulge in some trading and social activities. In the evening, when you have a bit more time, you'll have lots of “live gameplay” options: quests, adventures, dungeon-raiding, fights with other players in the arena, maybe even a boss run. At the end of your play session, you might ask your hero to sleep, or carry on working during the night. If you miss one of your normal play sessions, your heroes usually have enough tasks left that they can continue to evolve anyway.\nNow that gives you a lot of flexibility and, as you can see, the game goes beyond asynchronicity and offer lots of live gameplay possibilities.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Virtys","platforms":[{"id":0,"name":"PC"}]},{"id":8655,"name":"The Frostrune","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72b/72bb9e0826ee4269ead62484a4a291f8.jpeg","description":"Unravel a mystery inspired by Viking myth and legend in The Frostrune, a classic point-and-click adventure based on ancient Norse culture and environments.\nFind yourself shipwrecked on an island after a summer storm. Nearby, a recently abandoned settlement shows signs that its inhabitants left in a panick. Surrounding the village is a dark, dense forest filled with ancient rune stones and burial mounds. Among them are hidden relics and other well-kept secrets that will bring you closer to solving the mysteries of the island.\nThe Frostrune is made by game developers who are passionate about Norse culture and history. We have taken extra care to make The Frostrune as authentic and historically accurate as possible.\n2 to 5 hours play time\nKEY FEATURES\nRich Story\nThe Frostrune embraces the Nordic tradition of storytelling: One filled with magic, myth and wonder common in Viking lore.\nHand-Painted Art\nBeautiful, hand-painted art and an original Viking age themed soundtrack bring the The Frostrune’s desolate Norse landscape to life.\nChallenging Puzzles\nThrough exploring the rich environment, you will unravel the mystery of the deserted island. Use the objects that you collect to solve puzzles on your journey of discovery.\nCulturally & Historically Accurate\nAn authentic Norse environment where elements from myths and folklore come alive.\nOld Norse speech with subtitles. All objects faithfully recreated from archaeological sources.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Snow Cannon Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":7576,"name":"Hexoscope","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c4/7c4fe887129828c2778d47f99e705e27.jpeg","description":"Hexoscope is a new puzzle game that challenges your skills to create from Chaos.\nYou should arrange the chaotic combination of hexagonal Chips to create a Chain from Power Source to Power Receiver. You should swap Chips with each other to combine their pins into solid Chain from Source to Receiver.\nThe puzzle is arranged when the Receiver gains Power from the Source through the Chain.\nFeatures\n- Unique gameplay.\n- The relaxing music which is composed by Dmitriy “Cyberworm” Vasilyev specifically for Hexoscope.\n- 72 chaotic levels of various complexity.\n- Levels are randomized on each replay.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artem Saakyan","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":3963,"name":"R.I.P.D.: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40c/40c6d8c0b1123ebc0e93a13e462011a7.jpg","description":"Based on the 3D supernatural action-adventure film, R.I.P.D., you and a partner will take up the holsters of two lawmen dispatched to the otherworld to protect and serve the living from an increasingly destructive array of souls who refuse to move peacefully to the other side. Top-notch teamwork and an arsenal of badass weapons are the keys to defeating your enemies and bringing order back to the world.Key Features Film Authenticity – Working directly with Universal, Old School received ongoing access to the movie materials so that players could experience a faithful adaptation of the unique world of R.I.P.D., including environments, enemies, weaponry, effects and humor from the film.\nPartner with your Friends Online – Two-player online co-op allows wanna-be gunslingers to use teamwork as they battle their way through the game.  Your enemies won’t have a chance against the right team strategy.\nOver-the-Top Action – Gunslingers will blast, impale, explode, and arrest enemies just as the heroes do in the film.\nUnique In-Game Betting System – Co-op partners can put their in-game currency where their mouth is with a new feature that allows them to bet on who’s a better R.I.P.D. officer.  Measured by which player can capture the most enemies, who can stay standing the longest, and other action-packed challenges, the virtual betting system allows players to always keep the stakes high.\nChallenges Galore – Being an R.I.P.D. officer doesn’t mean blasting deados all the time. Random challenges will appear during each stage to allow players to test their mettle for extra gold pieces.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":2902,"name":"Star Wars: Racer Revenge","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7df/7df46e4b093a99def4db9469b5e61935.jpg","description":"It has been eight years since the first spectacular Podracing showdown between Sebulba and the young Anakin Skywalker. Seeking payback for his humiliating loss, Sebulba has a new beefed-up Podracer and lust for revenge. But it's not going to be easy: Anakin has grown into a boldly skilled Podracer pilot...\nThus the stage is set for Star Wars Racer Revenge, bringing newer, faster, and even more dangerous Podracing to the galaxy-taking you on a one-way ride to ultimate victory. Jockey for position with a tangle of Podracing opponents or leave the pack behind at intense, nerve-jangling, planet-scorching simulated speeds of up to 600 mph. Crash and bash competitors into oblivion as you take them out of the race for good.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":2415,"name":"The Last Blade 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c9/5c9d21b8de81ec72c1717a52d2951319.jpg","description":"“Hell’s Gate” is a boundary between life and death. Four 'Mythological Symbols' are about to fight an ultimate spirit awakened from the netherworld to the death, and send him straight to 'Hell's Gate'. In addition to 12 combatants from the previous title, 4 brand new characters and 2 hidden characters join the fight in the gorgeous roster of 18 characters. Select your favorite sword attack type among the “POWER”, “SPEED”, and “EXTREME” modes. Master the ”REPEL” mechanic to counter your opponent’s attacks,  and when the time comes activate the “SUPER SECRET SLASH”, “HIDDEN SECRET SLASH” and “ENIGMA FRENZY-ATTACK” ultimate techniques in order to change the outcome of the battle! Discover or rediscover “THE LAST BLADE 2”, which is still considered as the pinnacle of the blade-based fighting game genre around the world to this day!\nPurchasing this content entitles you to both the PS4™ system and “PS Vita” system versions!\nCROSS PLAY, CROSS BUY, CROSS SAVE\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.  This account may download item to up to 3 PlayStation® Vita systems activated with this Sony Entertainment Network account.\n© SNK PLAYMORE CORPORATION ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"SNK","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":975425,"name":"The Lullaby of Life","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8a/f8ae8e28ab415496da50ddc05d2a6fa7.jpg","description":"Born in the origins of the universe, you are a particle with the power to play musical notes in the form of waves. Experience this fascinating music-driven adventure that transforms sound into puzzles using timing, focus, dexterity, and agility.\nSOLVE MUSIC DRIVEN PUZZLESThe Lullaby of Life is a puzzle adventure where you encounter puzzles solved through timing-based music notes. Solve these challenges using sound waves matched in sequences of different colors and symbols. Challenge the way you think with each level featuring unique puzzles, mechanics and ambience. Awaken new companions, bring life to inert beings, and solve your way in this abstract universe!\nEXPLORE THE ORIGINS OF THE UNIVERSEYou are the catalyst of new life everywhere in this curious universe. Explore, avoid obstacles, uncover secrets, escape enemies and dangers, and behold this journey where each level brings its own unique setting, characters, and aesthetics.\nBRING LIFE TO DORMANT BEINGSWhile venturing into this universe you will encounter different beings. The main quest of each level is to awaken your Dormant Elders. Bring them to life through sequences of sound waves produced by you and your found companions picked up along the way.\nIMMERSE YOURSELF IN A HYPNOTIC WORLDThe Lullaby of Life presents a vivid and melodious universe like no other. Let the tranquility of the colors, animation and sound waves calm your body while your mind focuses on solving puzzles of increasing difficulties. An immersive game that leaves you feeling peaceful and attuned!FEATURESChallenging puzzles solved through sound, timing and mental agility\nUnique levels with distinct colors, atmosphere, and challenges ahead\nA hypnotic soundtrack that provides focus and tranquility\nVisual narrative accessible to all ages, languages and abilities\nGame mechanics that are mentally stimulating while in a calm environment are perfect for kids’ screen time or to destress at the end of the work day!\nSimilar to games like Osmos, Flower, Webbed, Botanicula, and Journey","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"1 Simple Game","platforms":[{"id":0,"name":"PC"}]},{"id":818051,"name":"Fire and Maneuver","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/134/134f4dcf1bb8c7f471ab1037dc533158.jpg","description":"OverviewFrom The Armchair History team comes Fire & Maneuver, a unique strategy game made by history buffs for history buffs, wargame enthusiasts, and casual players alike. Striking the perfect balance between history and playability, F&M combines true-to-life units created through extensive historical research with clever but engaging mechanics developed by a passionate team to create a strategy title that has a little something for everyone.\nFind yourself plunged into Victorian warfare, where every moment seems to bring some new tactical or technological innovation. Forget about such matters as politics and economic affairs, as your sole purpose in F&M is military victory. Fight against your friends in recreations of historical battles, or forge a new path for Europe as you veer off the tracks of history. Consider carefully whether to push your campaign offensively or cede the initiative to your opponent, as constant offense will drain your precious resources. And with new countries and units always in development, discover new ways to write your name on the pages of history.\nTurn-Based Combat with a TwistNo plan survives first contact with the enemy, and F&M places you in the same position as historical generals: anticipating your opponent’s movement.\nThe game’s innovative  “simultaneous turn system” requires careful consideration of your opponent’s potential actions. Instead of passively waiting to react to a move already made, you must actively consider all possibilities, deciding which tactical choice your opponent is most likely to make… and which you can accept not responding to. Withdraw to better ground, vigorously attack, or simply dig in and see what your opponent does - the choice is yours, and your orders are final.\nFactions 1853-1871Take command of the greatest armies of Europe and beyond, and marvel as your troops develop through the Early and Late Periods of gameplay.\nSecond French Empire\nA well-balanced and versatile force with a bevy of units to choose from, including the highly durable Foreign Legion… but beware your foes’ superior numbers and quality of artillery.\nNorth German Confederation\nFormerly the Kingdom of Prussia, this new nation boasts strong commanders who lead a patchwork of well-armed units from across the German States, from Bavarian and Württemberg infantry to the dreaded Krupp artillery… but beware the short range of your fast-firing rifles and the danger this poses to your men.\nBritish Empire\nRigorously drilled infantry lay down punishing volleys, and the famed Highlander infantry from Scotland can repel any foolish enough to charge their lines… but beware the cost of your units, the highest in the game.\nRussian Empire\nDraw upon weight of numbers and the zeal of your soldiers to sweep the enemy from the field, with aggressive columns of infantry while the feared Cossack Cavalry flank behind enemy lines… but beware losing control of your men in the heat of battle.\nOttoman Empire\nFill the battlefield with your forces comprising a seemingly endless tide of militiamen, including the bizarre “Bashi Bazouks,” known in the West as “The Crazy Heads”… but beware the lack of discipline endemic to Ottoman armies.\nAustrian Empire\nFind the balance between two forces in one army, including expert skirmishers to engage your opponent at long range… but beware this sole advantage becoming a liability as the fight draws closer and closer.\nKingdom of Italy\nNationalism allows you to draw on expert mountain troops and political paramilitaries both… but beware your specialized troops’ lack of professionalism.\nMultiplayerFight your friends or match wits against other armchair generals as you engage in everything from preset historical scenarios, stepping into the shoes of Moltke or Bazaine, to utter historical fantasy, pitting British redcoats against German Krupp guns on the Steppes of Russia.\nF&M is designed to reward good generalship over random luck. Wear your laurels proudly as you defeat other players, confident that you truly earned each victory.\nCustomization (COMING SOON) As you win battles and earn merit, you will unlock the ability to create your own regiments to bring onto the battlefield. Design your own unique style of uniform down to the buttons, allowing you to field a signature force that will let your opponents know who they’ve trifled with.\nOptional in-game purchases will allow for greater cosmetic customization, but there will be NO paying-to-win or wagering on loot boxes. War is enough of a gamble already.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Targon Studios","platforms":[{"id":0,"name":"PC"}]},{"id":587621,"name":"Loot River","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e1/0e1bdc71ba5de3a7403ad9882c31ce36.jpg","description":"Loot River is an upcoming island-shifting action-roguelike coming to Xbox and PC.\nPrepare to journey down an otherworldly river in search of knowledge and loot! Set in a series of procedurally-generated labyrinths, Loot River is a dungeon-crawling action-roguelike that combines the tense, real-time combat and dark fantasy stylings of Dark Souls with the spatial block-shifting puzzles of Tetris.\n\nArmed with the power of the Relic, players can shift the ground beneath them, sliding floating ruins together in a series of tile puzzles. As players venture through these endless catacombs, they’ll encounter beasts, lost travellers, and bosses. These cosmic grottos offer a wealth of new weapons and gear to discover, as well as unholy knowledge to unearth for permanent upgrades.\n\nDrawn to shards of an unholy relic, wandering nomads have found themselves in a perpetual cycle of life and death, losing their sanity as they journey through endless parallel realities, devouring each other to absorb the knowledge of their fellow travelers. No two journeys are ever the same as countless lost souls float through the Loot River.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"straka.studio","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":530345,"name":"Tchia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/859/859bf45f635a04fa16eab64b9d02da03.jpg","description":"POSSESSING MECHANIC\nTchia's special gift lets you take control of any animal or object you can find. Use their unique gameplays and abilities to travel, solve puzzles and uncover secrets. Fly around as a bird, explore the ocean as a fish or dig treasures as a dog. Over 30 playable animals and hundreds of objects.\n\nEXPLORATION & TRAVERSAL\nJump and glide your way across a vast archipelago and use the Tricks system for cool stunts and dives. The free climbing mechanic lets you ascend anything in the world without restriction including any physics-driven tree. Sail your customizable boat on turquoise lagoons and dive around coral reefs and shipwrecks.\n\nUKULELE\nJust jamming by yourself or playing alongside NPCs, your fully playable ukulele will be a trusty companion throughout the game. Use it at key story moments during rhythm sections, or play unlockable melodies at any point in the open world to trigger special events such as attracting animals, triggering rainfall…\n\nSTORY & MUSIC\nTake Tchia on a heartfelt adventure and meet a diverse cast of characters inspired by New Caledonian cultures. Fully animated cutscenes voiced in traditional language will punctuate your journey while an original orchestral score infused with local sounds creates a unique and immersive world. \n\nCUSTOMIZATION & ITEMS\nStylize Tchia’s clothing and boat with hundreds of unlockable cosmetic items ranging from a traditional look to the most over the top options. You will also unlock useful and fun tools along the way such as a flashlight, slingshot, compass, camera...\n\nNEW CALEDONIA\nThe world of Tchia was inspired by New Caledonia, A tiny island in the Pacific Ocean, homeland of Awaceb's co-founders. Inspiration was taken from the rich and varied local landscapes, cultures, music, languages, folklores and traditions and was used to create a fictional world and to tell a universal story that anyone can understand and enjoy. The characters are voiced by local talent in traditional languages, and subtitled in many languages including English, French, Russian, Chinese, German, and more.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Awaceb","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":495432,"name":"Democracy 4","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f86/f861b55ec58a564828d54ada1c24aed0.jpg","description":"Democracy 4 lets you take the role of President / Prime minister, govern the country (choosing its policies, laws and other actions), and both transform the country as you see fit, while trying to retain enough popularity to get re-elected...\r\nBuilt on a custom-built neural network designed to model the opinions, beliefs, thoughts and biases of thousands of virtual citizens, Democracy 4 is the state-of-the-art in political simulation games. A whole new vector-graphics engine gives the game a more adaptable, cleaner user interface, and the fourth in the series builds on the past while adding a host of new features such as media reports, coalition governments, emergency powers, three-party systems and a more sophisticated simulation that handles inflation, corruption and modern policy ideas such as quantitative easing, helicopter money, universal basic income and policies to cover current political topics such as police body cameras, transgender rights and tons more.\r\nDemocracy 4 is the ultimate sandbox for testing out your political ideas. We all think our politicians are useless and that we could do a better job ourselves, but is that really true? With one eye on the budget, one-eye on the polls, and somehow finding time to watch out for terrorist attacks at the same time, you will find that staying in power while changing society for the better is a tougher job than you ever imagined.\r\nWould it really be a good idea to legalize all drugs? to give the police machineguns? to ban abortion? to invest heavily in green energy? would UBI really work? can you stay elected after cutting pensions in half to pay for your science budget? There is only one game that lets you find out!\r\nThe intention in designing this game is to have no implied bias whatsoever (tricky, but we try!) so this is NOT a game that is going to lecture you about politics, or tell you that your beliefs are wrong. This is a strategy game, not a political protest :D. If you want to turn your country into ayn rand's fantasy, abolish all public spending and all taxes, you can do that. it might work, it might not! depending on how you handle it. On the other hand if you want to nationalise the railways, the energy companies, the water companies, cap CEO pay, ban second-home ownership and put universal income in place, you can do that too. All the game tries to do is model the *likely* effects, short and long term of any action you take.\r\nBecause modders have so enthusiastically supported earlier games in the series, we are doing our bet to make Democracy 4 as mod-friendly as possible too, and steam workshop support will make choosing and installing mods easy. Ultimately all our data is in text files that you can edit yourself, so if you think our analysis of the link between car tax and car usage is wrong (for example), its trivial to edit it, and share your changes with other players.\r\nUltimately Democracy 4 is not a game about simply winning an election, but about running the country. Losing an election is just  the end-game (unless you get assassinated), the real challenge to the game is whether or not you can create a country you are honestly proud of. I hope you enjoy trying :D","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Positech Games","platforms":[{"id":0,"name":"PC"}]},{"id":397469,"name":"SWORD ART ONLINE: Alicization Lycoris","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e14/e14b7d0931765bf7a871e66b448e57a1.jpg","description":"For the first time ever, players can experience SWORD ART ONLINE's anime storyline in game format with SWORD ART ONLINE Alicization Lycoris! Play as the protagonist Kirito and immerse yourself in \"Underworld,\" a mysterious virtual world set in the anime's Alicization arc. Featuring intense battle action, stunning JRPG visuals, and an expansive world to explore; your journey through the latest VRMMO SWORD ART ONLINE game is ready to begin!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"AQURIA Co","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":302921,"name":"Stela","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f19/f199981afd285a14ffe26ae8d05887c7.jpg","description":"Stela is a cinematic, atmospheric platformer about a young woman witnessing the final days of a mysterious ancient world.\nOvercome daunting challenges, treacherous terrain, and gargantuan beasts while traversing a decaying land. Manipulate the environment to solve elaborate puzzles and creep past dangerous creatures under cover of muted landscapes, all set to an original soundtrack. Survive sweeping environments including mysterious towns, haunting forests, and massive subterranean ruins brought to life in an atmospheric experience.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SkyBox Labs","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":52467,"name":"Track & Field","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/681/681f4eadecbbac4abf09581482cc1ba8.jpg","description":"Track & Field, known in Japan and Europe as Hyper Olympic (ハイパーオリンピック, Haipā Orinpikku), is a 1983 Olympic-themed sports arcade game developed and published by Konami. The Japanese release sported an official license for the 1984 Summer Olympics.\nThe arcade version was released in 1983. The simple gameplay, based on quick repeating button presses, set the basics for sequels and similar games in the genre for the next decades. There were several home versions of the original; the ZX Spectrum and Amstrad CPC versions were only released as part of the Game, Set and Match II compilation in 1988, and are poorly regarded by fans. The NES version was especially well-received, and sold well.","review":"","timePlayed":0.0,"releaseYear":1983,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"NES"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Atari 2600"}]},{"id":44916,"name":"The Ranger: Lost Tribe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58d6e808c457d7ce34f35abfff30b225.jpg","description":"Hi, we are the developers of \"Deadly Hunter VR\" an Archery Game we released earlier this year. It's free and very positive, so be sure to check it out.\nWith \"Deadly Hunter VR\" we gained a deep insight into VR development. We learned a lot while making it and we want to use our skills in our next project:\nThe Ranger: Lost Tribe\nIt is an Action RPG with focus on real time fights and exploring. Now the content of the game is just part of the full version, but it offers over four (4) hours’ worth of glorious gaming experience and will give you a good challenge.\nYou will start at the Base Camp were you can play around with Sword, Crossbow, Bow, Shield and Spear. Once you leave the Camp you will only have your Sword and your Shild and it is up to you to find the other ones.\nBesides of the standard sword fighting mechanism we also included stealth kills and dismemberment. On top of it you can also enchant your weapon with your found recources. We also support different locomotion styles.\nWe basically opened up for you a big area for you to explore. You may stumble across some things that you can't use yet because they belong to the story we have planned.\nYou can help to make \"The Ranger: Lost Tribes\" an awesome game. Simply download our demo an play it. Write us what you think about it in the discussions. Any suggestions, freature requests and feedback in general is very valuble to us in this current state.\nKey features:\n- huge environment for you to explore\n- save feature (checkpoints)\n- you decide how you approach the enemys\n- different weapons\n- stealth kills\n- dismemberment\n- different locomotion options\n- enchant feature\nhelpful hints for your survival:\n- Regain life by eating fruits or meat that you can find on plants or as drops.\n- Plan your steps and how you approach the enemy. Tanking on several enemys at once can be   dangerous.\n- Use the stealth kill feature to avoid unnecsessary fights.\n- Use the throw mechanic to take out enemys further away.\n- Cast fire on your sword to gain advantage of bigger enemys.\nPlease have fun and leave some feedback.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Leiting Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":43868,"name":"Merri Puzzle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c4/3c4596c63e0a4d019a795505aba34013.jpg","description":"We did it!Thank you to everyone who voted for Merri Puzzle on green light. I hope everyone has as much fun playing the game, as I did making it.\nAbout the GameMerri Puzzle is a physics based puzzle solving game, with a unique look and feel to it. The goal is simple, getting an object, often a ball to the end of a maze. Your only controls are the forces of gravity, and building blocks. There are multiple ways to solve most levels. You can make block slides, block elevators, or just fill in the gaps. Other levels may need you to build walls to help avoid lava, or to get a key shape to the exit. As the game goes on, the amount of strategy required to solve each puzzle will go up.\nMerri Puzzle features a range of different mechanics. Some exits may be locked, some rooms may require making a path for two shapes to reach each other. Different shapes have different physical properties. Instead of building a bridge with blocks, you may try floating your ball across a sea of other physical objects you generated. Each level is unique with a different challenge.\nMerri Puzzle includes a simple check-point system. You can pick the way you play with point and click control buttons or key binding macros. This way you can play with a mouse and keyboard or your Steam controller.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Merriman Games","platforms":[{"id":0,"name":"PC"}]},{"id":22484,"name":"Catmouth Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5c/b5c380dea0392245fee1e3cc119f831e.jpg","description":"Catmouth Island is a laid-back, relaxed and comfy episodic point-and-click adventure game set on an island group called Catface Islands in the middle of the pacific. :3\nYou control Mya, a student who enjoys solving puzzles in her spare time. She attends the Silvestri Schooledge, and lives in a nice house in Meow Village on Catmouth Island. She wants to find out more about the islands' neighbourhood, environment, its mostly unknown past, and investigate what the secretive B3 Corp. is up to, all the while juggling her studies as not to end up like the steak house girl. :3\nThis game follows the same convention as most classic point-and-click games like Sam & Max: Hit The Road, Day of The Tentacle and Monkey Island, except that it addresses a few of the issues with trying every object in the inventory together to see if they work, and a few other things.\nIt is created in a low-poly graphical style in which as few polygons as possible have been used to create objects. Very inspired by the games on the Nintendo 64 and Sony Playstation.\nFeaturesOver 60 NPCs to interact with, from humans to non-humans and even secret ones!\nA scrapbook with a task list that keeps track of your progress!\nA personal teleporter system to help you get around quicker if would like!\nUnique location-based theme music that changes depending on where you go!\nEpisodic progression that will advance the game and the story.\nThis game was voted by you through Greenlight. :3\nReleases for Linux and Mac are coming soon!\nEpisode listEpisode 1: The Infinitely Tall HouseEpisode 1: \"The Infinitely Tall House\" - One of Mya's neighbouring families have a house that is infinitely tall. There are stories about what has happened in the house over the years, but Mya has yet to be inside it. One day, driven by curiosity during the annual \"Don't lend your boat day\", she wants to discover what's on top of The Infinitely Tall House.\nDisclaimer: There's occasional swearing and coarse language, and a topless sunbather. Therefore it is not suitable for younger players.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Colonthree Enterprises","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22133,"name":"Ambre – a heartbreaking kinetic novel","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b7/0b73de557d54416d122342a06e28001c.jpg","description":"A classic story available for free now with new enhanced graphics!\nAs he is passing by a park, a depressed thirty years old named Tristan Mallory discovers a lost little girl. Touched, he decides to help by taking her in. But something is off about their relationship, very off. Will you be able to figure out their terrible secret?\nAmbre is a kinetic novel, thus you cannot choose the fate of the characters. However the story will take you on an emotional roller-coaster you won’t quite see coming. Even if things seem wrong, do not ever give up…or you’ll regret it.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Träumendes Mädchen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":22030,"name":"One Dog Story","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f44/f44ad2d8cdb7767aa2da539edf5a671a.jpg","description":"Do You Miss Those Good Old Platform Games?\nDo you have a soft spot for extensive storylines and original dialog?\nDo you enjoy not just destroying hundreds of enemies, but also exploring new worlds?\nThen We Have Something For You!\nOne Dog Story is an engaging pixel adventure game with RPG elements, gameplay that’ll get you hooked for hours, and well-developed characters. You can expect:\nHardcore BossesA Wide Variety Of LocationsOriginal Gameplay DecisionsFull Interaction With the Game WorldLots Of Different Weapons and ModificationsFantastic Sfx and Background MusicDifferent endings, secrets, and collectibles for the especially sharp-eyed among you\nYou wake up in an underground laboratory, once again free after a horrific accident. You have no idea who you are or how you got there, but don’t worry—you aren’t alone. As you play your way through the game, all sorts of other creatures living in this strange underground world will help you piece together your memories. But don’t let your guard down! The path to the truth is also littered with insidious and ruthless monsters.\nStill, you’re far from helpless. Unique experiments augmented your canine intellect to the point that you can use weapons and equipment, not to mention your ability to solve puzzles. Get ready for epic battles with bosses. Prepare to explore this expansive game world and its many secrets and mysteries. Where you actually end up depends in large measure on you. You have tough decisions ahead, and you’ll have to live with their consequences. As we all know, all that is secret will one day see the light of day. Are you daring enough to follow the path to its bitter end and learn the truth about yourself and this daunting world?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Big Way Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19497,"name":"TRISTOY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9e/d9e0fed6a06b6bceff9a37c317ef8ec8.jpg","description":"TRISTOY is a story-driven 2D co-op platformer designed from the ground up exclusively for two player co-operative gaming enjoyment!\nSet in Tristoy, an ancient fortress in the middle of the Sea of Shards you play together as Prince Freedan and the Wizard Stayn. You and a friend are forced to team up to try and escape the dungeon and defeat a common enemy, the Witch Ink.\nExplore dungeons filled with traps and monsters - puzzle, jump and fight your way out as you attempt to escape from Tristoy. Designed to be played together on one screen, Tristoy’s engrossing non-linear story features multiple endings and requires you to work together, testing your friendship and forcing you to confront moral dilemmas and make some hard choices.\nDeveloped by German studio Uniworlds Game Studios, the game features a dynamic split screen, which moves, rotates and seamlessly joins back together, keeping you locked in the action. Play with a keyboard, controller or use your smartphone to control the game with the companion app.\nGrab a friend and try to escape from the dungeons of TRISTOY in this story-driven co-op platformer.  Play locally or over Steam. Meaningful choices and deadly consequences are waiting for you!Key featuresThe ultimate couch multiplayer game for two\nMetroidvania style story driven 2D platformer\nPlay locally or via Steam (giftable copy included - This will be available in your inventory)\nAn epic co-op game (for 2 players only)\nDesigned to be played together on one screen but can also be played via online co-op\nDynamic split screen that moves, rotates and joins together\nDeep character play through individual story and dialogue choices\nEngrossing non-linear story with multiple endings\nUnique cooperative puzzles and quests\nNumerous types of enemies, puzzles, quests and additional unlockable content\nFull controller support or use your Smartphone as a controller using the developers own technology UNIPLAY (Android and iOS App available)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Uniworlds Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17763,"name":"Cosmochoria","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d60/d609741f3ad49b75cdc1cdc81b9bc739.jpg","description":"Cosmochoria is a love letter to old-school action / arcade games like Asteroids, Sinistar, and Mario Bros. Cosmochoria is a mesmerizing way to kill hours: hopping between planets, unraveling forgotten mysteries, killing aliens & giant space monsters and planting mysterious seeds to sprout new life across a long-barren galaxy.\nYou play the role of a tiny pink naked cosmonaut who 'finds himself' in a distant galaxy. While no story is immediately apparent, consecutive games will begin to reveal some of the deeper mysteries surrounding the universe around you.\nYou are free to roam the galaxy in search of these secrets, or to remain on a single planet, establishing a home base to fight aliens and tend to your galactic garden.\nGame Features:\nSo much Pew Pew Pew High Score arcade action.\nSuper secrety mystery STEAM ACHIEVEMENTS for unlockable braggeryness.\nPlant seeds to sprout new plants, new plants give more seeds.\nGrow plants to fill dead planets with your Love Juices.\nMassive UltraNova Explosions Like from Contra III.\nBuild Towers like a construction BOSS.\nProcedurally generated galaxy. Each game is unique like a snowflake.\nAliens poop crystals from their bums before they explode.\nSpend said poop crystals at the upgrade shop to improve your abilities.\nRadical interstellar screen sized boss fights.\nMini-Map Upgrade plots your cosmic journey.\nWarping around the whole place like U really mean it.\nFresh electronic soundtrack by Ilkae, Zebra & Mantrakid.\nHand Crafted Vector illustration stylee.\nForm Deeply Special Bonds with Secret Cartoon Animal Pets.\nBefriend an old hermit alien at his wooden shack.\nDiscover hidden artifacts strewn across the galaxy.\nFire Bullets into a whole bunch of Bad Guy Faces.\nFloat NAKEDLY all over Outer Space!!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nate Schmold","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16409,"name":"Black Moon Chronicles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c0/5c0e95b8324c08b479d524cd053e2dac.jpg","description":"OVERVIEW:\nWishmerill, a half-elf on a quest for power in a medieval world, is ready to grant you his experience and powers.\nSide with one of the kingdom's four factions (Light, Black Moon, Empire or Justice) and fight to restore balance among the people and prevent the Empire's destruction... or alternatively choose to destroy it.\nthe Kingdom's Fate Lies In Your hands!SYNOPSIS:\nthe Kingdom Is In Danger!\nEvil archmage Haazheela Thorn has raised a formidable army of orcs and demons in his bid to secure world domination.\nPlaying as Wishmerill, an intrepid war hero with a devil-may-care attitude and dreams of riches and glory, you will need to choose your faction to determine the kingdom's fate.\nJoin the forces of good led by Emperor Hagendorf or side with the fearsome Haazheela Thorn as you seek to achieve your goals in this strategy game featuring a blend of adventure and tactical skill.\nManage your troops on the battlefield, hone their skills in the castle's enclosure and upgrade your technology to keep your enemies trailing in your wake in this highly tactic-oriented strategy game.\nExperience a truly epic adventure, where your chosen alliances will shape future events.KEY FEATURES:\nDirectly inspired by the comic series of the same name by Ledroit and Pontet.\nBefore each campaign, choose one of the four factions, each with its own specific attributes.\nTrain, manage and lead your troops to victory through approximately 100 missions.\nCreate your own storylines using the built-in map editor.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Cryo Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":14248,"name":"Fruit Arranger","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edf/edfdabaf353063e39ce870e37c96f264.jpg","description":"Fruit Arranger is a fun puzzle game where you have to place fruits on a 9x9 table. When you match 3 in a same row or column the last fruit placed will transform into another fruit. Your goal is to place as many fruits as possible without getting stuck.\nOVER 100 ACHIEVEMENTS to gain\nTrading cards pending approval.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mihai Morosanu","platforms":[{"id":0,"name":"PC"}]}]