[{"id":12782,"name":"Ninja Stealth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/033/033f9667f8d25eb544f600429f145b14.jpg","description":"Ninja Stealth Collectionhttp://store.steampowered.com/app/552950/Ninja_Stealth__Supporter_Edition/\nhttp://store.steampowered.com/app/585830/Ninja_Stealth_2/\nAbout the GameAs a ninja you will need to be always hiden in the shadows, your objective is simple:\nEscape the evil facility from a company that is trying to conquer the world, the Polo Jocos, is an evil facility founded by one of the worst man ever encountered, the evil Mr Tinger Ninger.\nHe is building a new chemical that will affect humanity on the worst way ever possible, he plan to use his chemicals to sell it in the Black Market and then extend his empire even more.\nYou as a hero, entered in the facilities to get this chemical, steal the formula of it and put an end to the Mr Tinger Ninger evil empire!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SC Jogos","platforms":[{"id":0,"name":"PC"}]},{"id":9526,"name":"Guts and Glory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a68/a683b4e44927b9ac1e1aec940d0ac806.jpg","description":"Workshop Level EditorEasily build custom levels with the powerful in-game Level Editor, then upload them to the Workshop with a single button.  Subscribe to levels in the Workshop and they will be added to the Community Tracks list in-game for infinite new content to play!\nAbout the Game\nWelcome to Guts and Glory -- The craziest game show on earth, where ordinary people compete in extraordinary challenges of life and death, for glory!\nThe objective is simple:  Race to the finish line while everything tries to kill you.\nDodge spinning saw blades, deadly spikes, explosives, turrets, and a growing list of other hazards—while navigating insane tracks set in a wide variety of environments.  A game full of LOLs and WTFs and OMGs, where failing can be just as much fun as winning.  Do it to prove your awesomeness.  Do it for the laughs.  Do it for the glory!Featuring a Level Editor to create your own Death Traps!\nCurrent Features:\nPhysics-driven vehicles with dynamic damage and destruction\n100% ragdoll riders, with realtime dismemberment and blood (guts coming soon!)\nIn-Game Level Editor with Steam Workshop integration\nPedestrian characters to run over (no AI yet)\nAI Vehicles that can race in traffic patterns or even chase the player! (NEW)\nDestructible props and environments: smash through windows, fences, etc.\nLoads of Hazards: cannons, explosives, wrecking balls, circular saws and so much more\nSpecial Items: Mega Fans, Turbo Boosters, and more\n5 Unique Vehicles and their associated Heroes (8-12 planned)\n[*}Manual driver ejections (NEW)\n32+ Official Tracks (many more planned)\nCommunity Tracks for endless new content!  (Over 600 so far and growing!)\nPLUS new features/content being added each month, using your feedback in the Community!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"tinyBuild","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18207,"name":"Hyperdimension Neptunia Re ; Birth1","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56f/56f6a6aba11b73f49caf0ec1f8205b59.jpg","description":"Key Features\nPreviously only available on consoles, now you can immerse yourself in the zany JRPG madness of the / 超次次元ゲイム ネプテューヌRe;Birth1 series for the first time on PC!\nMajor graphical updates let you savor the true power of these Goddesses in glorious HD!\nBattle with up to 3 characters on the field, with 3 more as support. Use them to perform special attacks, or swap them out at any time!\nUse \"Plans\" to customize the game - change up enemy difficulty, dungeon treasures, and more!\nCraft unique equipment imbued with one or more abilities!\nThe game now features a Japanese language mode!\nHow to play in Japanese.\n1. Launch Steam Client\n2. Click Library\n3. Right click Hyperdimension Neptunia Re;Birth1 under games\n4. Click properties\n5. Click on the Language tab\n6. Select Japanese\n7. Japanese language version will be downloaded","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Idea Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":3699,"name":"Bound by Flame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b80/b8035df01ad6626401f49a38ac69625a.jpg","description":"Buzz\nAbout the GameYou are a mercenary possessed by a flame demon in a desperate world ravaged by seven Ice Lords and their Dead-Army.\nIn this RPG where all your choices lead to consequences, you will have to choose between unleashing the powers of the beast within and rejecting the demonic influence that wants to claim your humanity.\nFreely develop your abilities and combat style through three skill trees: swing the heavy weapons of the Fighter, wield the sneaky dual daggers of the Ranger, or use the devastating flame spells of the Pyromancer.\nRecruit companions who will live, love, hate and fight alongside you against the dreadful creatures of Vertiel, in real-time epic battles based on tactics and reaction.\nThe bigger the danger, the greater the temptation to draw on the demon’s power at the cost of your soul… which way will YOU choose?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spiders","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":282825,"name":"Pokémon Sword and Shield","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82f/82f7b1424c5ee7eebee83faf694889c5.jpg","description":"Pokémon Sword and Pokémon Shield will be set in Galar, an expansive region with many environments—idyllic countryside, contemporary cities, thick forests, and craggy, snow-covered mountains. The people and Pokémon live together in this region, and they’ve worked together to develop the industries here.\n\nThe adventure begins in Pokémon Sword and Pokémon Shield when players choose one of three new Pokémon—Grookey, Scorbunny, or Sobble. Grookey, a Grass-type Chimp Pokémon, is mischievous and full of boundless curiosity. Bursting with energy, Scorbunny, a Fire-type Rabbit Pokémon, is always running about. The stealthy Sobble, a Water-type Water Lizard Pokémon, shoots out attacks as it hides itself in water.\n\nYou’ll visit the various Gyms in the Galar region, aiming for the enviable and admirable title of Champion!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":272421,"name":"Tales of Vesperia: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bde/bdeec8652a076c7b6d3dfaa13ad9fc38.jpg","description":"Celebrate the 10th anniversary of Tales of Vesperia and the return of this fan-favorite with the Definitive Edition!\nA power struggle begins in a civilization dependent on an ancient technology, the blastia, and the Empire that controls it. The fates of two friends traveling separate paths intertwine in an epic adventure that threatens the existence of all.\nDive into the Definitive version of this game with updated full HD graphics, brand-new music tracks, exciting mini-games, bosses, and a collection of unreleased costume DLC!\nTwo more playable characters join the fray!\n• Patty Fleur, a cheerful and tough young pirate girl in search of treasure, adventure… and her forgotten memories.\n• Flynn Scifo, Yuri’s best friend and an Imperial Knight, now joins the rest on their journey!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":59677,"name":"Lethal League Blaze","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ae/2ae1c72fcdf0d9fa2e950129c1ce7880.jpg","description":"Lethal League Blaze is an intense, high speed ball game, with unique characters, outta sight sounds and none of that weak shit. In Shine City, the anti-gravity ball game has long been illegal. The group who kept playing was dubbed the Lethal League. Even now, with their sport pushed underground, players and crews compete in the League for challenge and respect.\nLethal League Blaze is coming at you and the world in Q4 2018.\nIn the game, the goal is to beat your opponents with the ball. You can manipulate the ball to get the perfect angle and use your character's special moves to surprise them. But every strike speeds up the ball or even doubles its speed, up to shatteringly extreme velocities. You can tag the ball to your color, but on those high speeds the tables are quickly turned. You can play locally with friends and foes, by yourself in the singleplayer modes or battle it out online!\nFeaturing\nUp to 4 players:\nPlay locally AND online with up to 4 players.\nEasy to pick up, hard to master gameplay:\nStart off simply hitting the ball faster and faster back and forth. Improve by learning how to use Smashes, Bunts and Special Abilities to your advantage. Then go further beyond with parries and countering with throws ending with the pure psychological goodness: taunts.\nTons of unlockable extras and secrets:\nUnlock characters and their outfits as you play. New modes and stages are in there too and even the soundtrack can be unlocked to play at leisure.\nPlay on your own:\nStep up to the plate by yourself and beat a series of opponents in the Arcade Mode to reach the beat-blasting bossfight. Then check out the event-based Story Mode that has you playing all sides of the going-downs in Shine City.\nModes and options:\nPick your preferred style of play like with HP, one-shot kill or points. And then there are game modes like Strikers, using goals, and something called Lethal Volley...\nWicked Tracks:\nA Breakbeat, Hip-Hop and House soundtrack featuring the likes of Frank Klepacki, Pixelord, Bignic and of course Klaus Veen.\nLethal League Blaze is the sequel to the popular projectile-fighting game Lethal League known for it's ridiculous speeds and hitstun, the original game was intense to watch and intenser to play. This time around there will be double the characters at launch and more to come after.\nAmong the newcomers are Jet, a bubbly jetpacked inline skater and Grid, an electro mafioso who doesn't hold punches. What's more, the boss of the previous installment, Doombox, will return as a fully playable character in Lethal League Blaze.\nWhen it comes to the soundtrack, Klaus Veen will be returning with a remix of the infamous Ordinary Days. Frank Klepacki of Command & Conquer fame is contributing a track and Moscow based producer Pixelord joined the fray as well. Then there is a secret composer whose name should ring a bell, to be unveiled further down the line along with other additions to the game.\nFind out more about the game in the coming months! That is, if you're in the official Discord server, Reptile Hideout, or following any of the Team Reptile social outlets!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team Reptile","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":45409,"name":"Dead In Vinland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af2/af24579d27f2af7c6e15dae912530d72.jpg","description":"DEAD IN VINLAND is a survival/management indie game with RPG and adventure elements, and is the sequel of DEAD IN BERMUDA.\nExiled on a faraway, unknown land, lead Eirik and his family on their quest to survive.\nManage their physical and mental health, explore the island, organize your camp and deal with other human beings. Some will help you, if you want, and some will be less docile…\nUnveil the esoteric mysteries of Vinland. They could save your life… or lead you to your demise.\nKEY FEATURES\nDeep survival management simulation: Manage the physical and mental health of your team, ration their food, choose their daily activities.\nChallenging and turn based: Take your time to make the best decisions to adapt to the situation! Randomized elements make it that there is no perfect strategy, you must make the best of what is given to you.\nBuild your community of up to 14 playable characters. Meaningful choices will alter the relationships in your team and the story. Expect romances, hatred and betrayals!\nEvolutive camp: craft more than 150 upgrades to help you settle on this cursed island.\nFight the elements: face terrible storms and droughts. Manage your potable water stocks wisely!\nAn island to explore: more than 150 map areas, discover the secrets of the island in a non-linear story. And maybe... Other survivors?\nFull RPG system: usable objects, skills to upgrade, characters to level-up, character Traits, ...\n*************************** Secret Feature ****************************\n*************************** Secret Feature ****************************\n*************************** Secret Feature ****************************\nDEAD IN WHAT?\nWe started the big adventure with Dead In Bermuda. From the start, we wanted to build a world where all the games in the series would fit. If you played DiB, you may have noticed... Strange... Things. With no real explanations. More explanations will come in DiV, which is not a direct sequel but shares the same base gameplay and backstory.\nEach game is totally independant, you won't miss a thing if you haven't played DiB, but in the end you'll learn in each game more about a common thread that ties everything together.\nGameplay-wise, while keeping the same basic original gameplay we developed in DiB, DiV is a major improvement in nearly all aspects: More characters, more stories, deeper survival mechanics, more crafts, more to explore, more replayability... And other surprises!\nABOUT US\nCCCP is a small french development studio. For a dozen years, we've kept on surviving by making educational games, but now we want to focus on making games that we'd like to play ourselves, especially MANAGEMENT and RPG games, with NARRATIVE elements. We want to make CHALLENGING and MEANINGFUL SOLO, PREMIUM games, where the player has to THINK and DISCOVER by himself.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"CCCP","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":430464,"name":"Bright Memory: Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/137/137fea1c90714b6b65d81a0258ec2fa6.jpg","description":"Infinite is an all-new lightning-fast fusion of the FPS and action genres, created by FYQD-Studio. Combine a wide variety of skills and abilities to unleash dazzling combo attacks.\nBright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science Research Organization (SRO) has sent agents out to various regions to investigate this phenomenon. It is soon discovered that these strange occurrences are connected to an archaic mystery – an as-of-yet unknown history of two worlds, about to come to light...About Bright Memory: Episode 1\nDuring the initial stages, since it was pretty difficult to estimate the number of copies that would sell, I decided to create the kind of game that could start out as a demo and later use crowdfunding support to develop further. I’ve finally managed to amass enough time and funding, so the action and general gameplay will remain as-is but the story and stages are all being reworked.\nFrom here on out, I will no longer be developing Bright Memory: Episode 1 any further, but I plan on making regular “experimental” additions of various new features, etc., which players will be able to try out. Once development of Bright Memory: Infinite is complete, it will be distributed as a separate game, but those who have already purchased Bright Memory: Episode 1 will receive a special “100% off” discount coupon for Bright Memory: Infinite prior to its release.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"FYQD-Studio","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":43534,"name":"Where the Water Tastes Like Wine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/239/239055dd98d2af881b696b3e38ae8eb7.jpg","description":"Where the Water Tastes Like Wine is an upcoming game about traveling, sharing stories, and surviving manifest destiny. Featuring gorgeous illustration by Kellan Jett, Where the Water Tastes Like Wine combines 2D visuals with a 3D overworld US map. Players wander through the United States - and through a century of history - to meet a variety of people, each with their own stories to tell.Game Features: A variety of folk tales and personal stories to encounter, told by characters from all over America\nBeautiful combination of 3D overworld and 2D illustration in its own unique style\nStories by a wide selection of excellent writers\nAn emerging fantastical, psychedelic, surreal, and creepy tinge as the game continues","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Serenity Forge","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13345,"name":"Space Pilgrim Episode I: Alpha Centauri","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/733/733ff91dad3e6f7cb26c93efc2f2ba70.jpg","description":"Captain Gail Pilgrim has been flying starships since she was a kid, ferrying passengers between planets and space stations across the galaxy. She has no reason to expect that this latest trip to Alpha Centauri will be anything special, even if her passengers are a little more diverse than usual: a fusion scientist, a retired space marine and a priest.\nHowever, it turns out to be far from a routine interstellar voyage …\nFeatures\nRelive the days of good old fashioned point-and-click adventure games\nMouse, keyboard and controller support\nIn this first episode, solve puzzles and begin to engage in an epic science fiction narrative written with humour and passion for the genre\nAcross the four episodes in this saga you will travel to space stations, colonies, cities and islands across an immersive and intricate futuristic universe, interact with dozens of unique characters and enjoy 10+ hours of gameplay (Please note: this purchase is for episode one only)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":3942,"name":"ibb & obb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18b/18b9ed77db141e5ec026fa4de8d3eb51.jpg","description":"ibb & obb is a two player cooperative game set in a puzzle filled world where gravity goes both up and down. You can only succeed by working closely together.\nFind a friend for some true local co-op couch fun or match up online.\nFall up and jump down through 15 levels filled with double gravity puzzles and discover 8 hidden worlds that will test your new non-Newtonian skills to the maximum.\nAll levels have their own unique music, composed by Kettel, known for his warm melodic electronica.Key FeaturesLocal and online co-op\nWarm electronic soundtrack by Kettel\nSteam achievements, leaderboards, multiplayer, cloud saving and trading cards\nSecret levels that will test your skills to the max","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Codeglue","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":285712,"name":"KurtzPel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f25/f257d8410ceb0b84485ce16753c8b088.jpg","description":"KurtzPel is a 3rd Person, Anime-Inspired, Action Battle Game created by KOG, the developers of Grand Chase and Elsword Online.\nYou can enjoy various 2vs2 PvP Modes queued up by a smart, automated match-making system.\nOr, you can embark upon a larger-than-life, raid style, quest driven battle system against big, bad boss monsters.\nIn KurtzPel, classic action game dynamics are enabled when players empower their characters with 2, separate jobs (Karma) that can be used interchangeably.Main Content\nPromotion Mission(PVP)\nDeathmatch (PVP) - Defeat your enemies and whoever scores more points will win.\nCapture the Flag (PVP) - Acquire the Flag in the battlefield and whoever scored the most point at the end of the match will win.\nConquest (PVP) - Split to Red & Blue team and whoever has captures the zone when the match is over wins.\nEpic/Repeat Mission (PVE)\nFight important enemies in the KurtzPel universe and discover the story of KurtzPel by interacting with Hero NPCs.\nAlso, has a low chance to drop special reward (Accessories and etc.) and has multiple difficulties and provides challenges in PVE fashion.\nCharacter Customization System\nSelect your personality and provide appearance options depending on your selection to lessen the difficulty of selecting your character’s appearance.\nYou can select body type, height, and other appearance feature to create your unique character.\nKarma (Weapon) Switching System\nThere are two roles, breaker and slayer. You can switch your karma at any time during the battle.\nNPC Affinity System\nYou can increase the NPC affinity through dialogues or by collecting provided keywords and acquire various rewards (Karma, Karma Fragment, Weapon, Costume, Accessories and etc.).\nCostume System\nWeapon, Costume (Top, Bottom, Innerwear), accessories (Shoes, Gloves, and 10 other slots), and dye system to customize the look of your characters even more.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"KOG co","platforms":[{"id":0,"name":"PC"}]},{"id":60474,"name":"DEAD OR ALIVE 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/44d/44d4175fd0c0869e5f954d8bd2db609a.jpg","description":"[Introduce DOA Series]\r\nThe Dead or Alive franchise is a AAA fighting game series produced by Koei Tecmo Games' Team NINJA. Composed of fast-paced 3D fighting games that began with the original Dead or Alive in 1996, Dead or Alive 6 will be the sixth entry in the series. This game features fighting entertainment with multi-tiered stages that are now both dynamic and critical parts of the competitive experience.\r\n[Story]\r\nThe story will follow that of Dead or Alive 5, shedding light on 2 main narratives; namely, the battle between “Ninja and DOATEC” versus “M.I.S.T. lead by Donovan”, and the tournament “Dead or Alive 6”. New episodes will also be added for returning characters.\r\n[The New Visuals]\r\nThe visuals of DOA6 express dramatic lighting that goes beyond the genre of “fighting games” and focus on serious, intense combat. It also features improved skin and sweat textures, introducing wounds, as well as flexible, varied facial animations.\r\n[Triangle System]\r\nFights in Dead or Alive 6 are based on a Traditional triangle system: strikes beat throws, throws beat holds, and holds beat strikes. When you land an attack of one type that beats another type, like landing a strike when an opponent tries to throw, that attack becomes a Hi Counter attack and does even more damage.\r\n[Break Actions - New Combat Mechanics]\r\nWith this title, we are introducing a new Special Move Gauge (Break Gauge) to the DEAD OR ALIVE series, making the fights more strategic than ever before. Because the actions can be performed by simply pressing the [RB] button, even beginners can enjoy the new system.\r\n[Break Blow] A strong, high-damage special move that knocks the opponent away. The first part of the move also parries attacks, working as both an offensive and defensive move!\r\n[Break Hold] A convenient counter technique that can also be used while the player is heavily stunned. It should only be used in tight situations due to its light-damage output.\r\n[Fatal Rush] Players can achieve unique combos by consecutively pressing the [RB] button. Beginners can even play by using this move exclusively, though its disadvantages will prove to be a calculated risk for more experienced players.[New Danger Zones]\r\n[Rumble Danger] If knocked into onlookers, they will push the player back into the center of the stage. It is a trap that combines the atmosphere of a real street fight with strategy.\r\n[Mass-Destruction] If the opponent is knocked into a large stack of nearby boxes with a “Break Blow” or ”Fatal Rush”, they will plow through them all in one hit! This causes a huge burst of damage and provides an exhilarating rush.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":20851,"name":"Sparkle 2 Evo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d3/0d3b915b3daf1aa6babaaa16301a155e.jpeg","description":"Sparkle 2 Evo is an evolutional game designed by Forever Entertainment.\n\n###Plot\nThe game is structured around the evolutional ladder. The player begins with being a minimally possible creature and then consequently evolves into the bigger forms of life. The essential objective is to let the subject develop into the maximal number of organic entities.\n\n###Gameplay\nThe starting point for the whole narrative is a sparkle which transforms into other various organisms. The possibility of transformation mostly depends on what the player eats, that is the nutrition is the standpoint which determines the development of the narrative.\nThe game may be explored in two ways. In the first mode, the player is competing as a form of life against artificially controlled substances. The second way is more experimental — the contesting point is removed, and the target is to explore different possibilities of becoming anything or anybody else.\n\n###Key features\nThe game provides three possible ways of evolutional forms: herbivore, carnivore, and omnivore. Each path is unique, and the scenario of evolution can remarkably differ even if you follow substantially the same ration. The game is customized with an ambient soundtrack curring in the background throughout the process.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":3937,"name":"Mars: War Logs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/243/24305913e19227799014430ecd52dd18.jpg","description":"Mars: War Logs is a cyberpunk RPG developed by Spiders. It is the first title of a two-part series, with its sequel, The Technomancer, released in 2016.\n\n###Setting\n200 years before the beginning of the game, Mars was finally colonized. It was not possible to fully change its climate, so humans built a few small settlements at first, the atmosphere was created. \n\n70 years pass since the arrival of the first colonists, a terrible catastrophe happened. As a consequence of such an event, the planet's axis shifted, most of the buildings were destroyed, and contact with Earth was lost.\n\nPeople gathered under the flags of four different water companies, that are called guilds. They participate in an ongoing fight with each other.\n\nYou play as Roy Temperance, an ex-convict, that gets caught in a war between the two biggest corporations.\n\n###Gameplay\nPlayers complete different quests during their adventure. Your main character levels up powering through the game's missions. Select your own specialization with a specific amount of skills and talents. \n\nThe game features a crafting system that allows for creating, modifying and specializing your equipment to gain an advantage over your enemies. \n\nThe game features a branching dialogue system. Every your choice, every action, will influence your relationship with the person you interact with, and possible the destiny of the whole planet.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Spiders","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2288,"name":"Zero Escape: Zero Time Dilemma","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e77/e77ceadde635a080738bcde211687776.jpg","description":"The experiment wasn’t supposed to be like this.\nNine participants awaken in an underground facility, imprisoned with a strange black bracelet on their wrists. To escape, they must play a game with deadly consequences. The rules are simple--after six people are killed, the escape hatch will open. Who will live, and who will die? The choice is yours. Let the Decision Game begin…\nGame Features\nThink Your Way Out\nExplore 3-D environments for clues to solve mind-bending puzzles and escape your prison.\nDecision Game\nQuestion your morality in a series of life-or-death decisions where even the best option carries horrifying implications.\nCinematic Gameplay\nFully voiced and animated story sections push the boundaries of interactive fiction.\nNon-linear Narrative\nJump freely between events and characters to piece together the fractured narrative and unlock multiple endings.\nOld Faces, New Mysteries\nCharacters from the award-winning Nine Hours, Nine Persons, Nine Doors and Virtue’s Last Reward are joined by a new cast of participants to bring first-time players up to speed and conclude the series for longtime fans.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 3DS"}]},{"id":41389,"name":"Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness, Episode Three","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6d/c6d343d0c37620186793258ba9ffb06d.jpeg","description":"Penny Arcade's On the Rain-Slick Precipice of Darkness 3 is an indie action-adventure game developed by Zeboyd Games. It is the third part of the series.\n\n###Plot\nThe game is loosely based on Penny Arcade web-comic. Set in the 1920s version of Howard Phillips Lovecraft's novels, where the mysterious Doctor Blood steals the Necrowombicon, which can revive the dead. The world is on its way to complete annihilation. Tycho Brahe has to save humanity from oblivion.\n\n###Gameplay\nAt the beginning of the game, the players create their own unique character from scratch, as it is not possible to carry over your character from the last two games.\n\nPenny Arcade's On the Rain-Slick Precipice of Darkness 3 is heavily inspired by titles like Final Fantasy. The gameplay consists of two main parts: combat and exploration. \n\nThe game features a turn-based combat system, like the one present in the Final Fantasy franchise with the player characters appearing on the left side of the screen and their enemies on the right. The players decide which abilities to use in their turn to either attack the enemies or defend themselves by using medkits or putting up shields. There are also several role-playing games in the game, as the players can level up their characters and unlock new skills and abilities.\n\nDuring the exploration of the game's world the players learn more about the game's lore, find crucial items or take their time off upgrading their characters.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Zeboyd Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":11941,"name":"Labyronia RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f5/8f5fc58659059747db22061aef78545c.jpg","description":"Labyronia RPG is a role-playing game developed using RPG Maker software.  \n \n###Setting \nThe game takes place in fantasy land. 50 years before the events of the game, the land was plagued by war. Four wizards created a magic device to prevent armies from fighting. The device is known as Pedant of Labyronia — it reshaped large parts of the world into mazes. However, this had awful consequences thus its spawned hordes of monster that invaded the world for long years.  \n \n###Plot and gameplay  \nThe game follows young wizard Arres. As a player, you have to a player you have to guide him through for temples of elements which would give you the power to vanquish the monsters.\nThe gameplay shares many similarities with other RPGs made with RPG Maker. According to developers, Labyronia’s visual style, story and battle system are heavily inspired by classic RPGs of the 16-bit era such as Final Fantasy VI, Chrono Trigger and Dragon Quest series. The player can for a party of several characters. The battles are turn-based and require strategical usage of attacks, items, abilities as well as knowledge of enemies’ weaknesses. The player can explore dungeons for new items, money and “cues” – individual objects that teach your characters new abilities and spells. There are several towns and settlements in the game in which you can interact with various NPC, buy items and gear.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Labyrinthine","platforms":[{"id":0,"name":"PC"}]},{"id":25064,"name":"Call of Duty 3","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fa/8fa1dd3783c7c3042ca704b76c95dfa8.jpg","description":"Call of Duty 3 delivers the intensity of being closer than ever to the\nfury of combat during the Normandy Breakout, the historic campaign that\nmade the liberation of Paris possible and brought the Allies a step\ncloser to Berlin. Through a seamless narrative that delivers the rush of\nunrelenting battle and breathtaking action, players assume the roles of\nfour ordinary Allied soldiers—American, British, Canadian and Polish—and\nare thrust onto an authentic, living battlefield for an unprecedented\nvariety of combat with advanced high-definition graphics, detailed\ncharacter animations and explosive on-screen action, providing the most\nimmersive and cinematically intense war experience ever.\n\nBranching Mission Paths – Next-generation level design provides\nmultiple attack routes that let players decide how to confront the\nenemy – flank an opponent, or hit him head-on. Each unique mission\npath requires special tactics, from sniping and demolition to all-out\nhead-on clashes.\n\nBattle Actions – An all-new close-quarters battle mechanic allows\nplayers to fight hand-to-hand, improvise explosive devices, and\nexecute a host of other battlefield situations that require cunning\nand rapid reflexes to survive.\n\nNowhere to Hide – Environmental physics allow players to destroy enemy\nsoft cover hideouts, forcing foes out in the open. But be wary,\nopponents can eliminate your protective cover as well.\n\nUtilizing the Wii Remote – Call of Duty 3 utilizes the precise\ncontrols of the Wii Remote controller to immerse the player into the\naction. Steady your aim to accurately snipe at targets with your\nrifle, swing the Nunchuk down to lob a grenade, motion forward to row\nor quickly jab the Wii Remote to strike your enemy with the butt of\nyour rifle.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Treyarch","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":23498,"name":"Tannenberg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/564/56435d913e39a6ad5fa8e75ed46d8c87.jpg","description":"Tannenberg is the latest entry in the 1914-1918 WW1 Game Series that started with WW1 FPS Verdun, expanding the focus to encompass the Eastern Front. Warfare on the border of the Russian Empire offers a fresh experience for new and veteran players alike, with new squads and weapons, open maps that give players tactical freedom, and a whole new 64 player game mode!\nThis historical game takes place across the lakes, forests, and snowy plains of the Eastern Front - it was inspired by the Battle of Tannenberg in 1914 where the Russian Second Army was dealt a heavy blow by the Germans. Tannenberg offers a range of game modes - including the exciting new mode reflecting the different nature of war on the Eastern Front - and a wealth of historical detail: realistic WW1 weaponry, authentic uniforms, horrendous gore, and maps based on real battlefields, this time in the forests, plains and mountains along the border between the Russian Empire and the Central Powers.\nTannenberg key features include:\nRealistic World War 1 gameplay\nTactical squad-based FPS\nWarfare on the Eastern Front\nMajestic backdrops and map detail\nVariety of game modes for player counts of up to 64\nExperience World War One on the Eastern Front\nIt’s all-out war on the Eastern Front! From artillery barrages and poison gas to the deadly machinegun and humble rifle, there are many weapons to master. The battlefield is a dangerous place, and a little thought will help you stay alive – lead your shots, keep your eyes open, and be ready to engage in ferocious close combat at any moment.\nAuthentic Eastern Front Warfare\nThe development team is aiming to recreate the atmosphere of the Eastern Front with the same level of accuracy as in Verdun. Uniforms have been recreated to the tiniest detail, the weapons are modeled to exact references and the maps use realistic props and terrain layouts.\nFollow us on Twitter and Facebook, or contact us via Discord.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"M2H","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14527,"name":"The Guild II Renaissance","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f8/5f87ab439af5b7dddd8307d7456c382a.jpg","description":"The Guild II Renaissance is a role-playing game with elements of real-time-strategy and life-simulation game. This is a stand-alone add-on for the 2006 title The Guild II. \n\n###Gameplay\nGuild II Renaissance takes place in Europe at the dawn of the XV century. You create a character and start a life of a popular townsman.\nYou can choose your appearance, characteristics and one of four specializations each of which offers you several professions. The specialization system serves as the game’s variation of the RPG class system. It determines your initial skills, available activities and what structures you can build. The gameplay is centered on the economic aspect. There are four game modes in The Guild II all of which revolve around creating a vibrant and thriving dynasty. You start with the minimum capital and almost no property, but as you gain money with your skills, you can buy new buildings, hire new workers, start a family, raise kids that later take your place as a head of the family as your main character dies. \n\n###New features\nThe new features of The Guild 2 Renaissance include eight new professions to choose from, new buildings, three new scenarios, difficulty adjustment. The size of the map was increased almost four-fold. The was drastically improved and some gameplay tweaks.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Runeforge Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10349,"name":"Painkiller Redemption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea55ae1dfd84c1210ccf60dc3b7da4ff.jpg","description":"Welcome to a world of pain. Heaven is once again in danger and threatened by a reckless army of hell spawn monsters - and they will stop at nothing. This time, only two heroes can save heaven from total destruction: Daniel and Belial, two champions from previous Painkiller stories, have to team up and put an end to the conflict in the old epic struggle between heaven and hell. Unfortunately hell’s army is even greater and stronger than before: The new general of the abyss has been endowed with powers of all the previous leaders combined, and she’s determined to see the next war through until hell’s victory. Her legions won’t back down without a long and bloody battle. Can you survive the endless attacks of nightmarish minions and terrifying fiends?\nKey features\t\t\t\t\t\tA new campaign guarantees for 7-10 hours of new and genuine Painkiller action\nEven more bloodshed and action per square meter: immerse into freaking intense gameplay & ultimately challenging FPS action\nMore dense maps and sick enemies than ever before: kill over 6.000 uniquely spawned wicked monsters\n6 all new maps and an easy to use map editor for your very own Painkiller experience\nTwo familiar heroes with unique weaponry and specific powers\nImproved graphics, AI, environments as well as new atmospheric soundtrack\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Homegrown Games","platforms":[{"id":0,"name":"PC"}]},{"id":5674,"name":"Test Drive Unlimited 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d1/6d16e484fd7218b2d082fae7240d9510.jpg","description":"Test Drive Unlimited is an arcade car and motorcycle simulator developed by Eden Games. It is not linked to the previous installment of the series in any way.\n\n###Setting\nThe game starts on a Spanish Island of Ibiza. The customizable main character works as a car valet. One day, they are offered to participate in an island-wide championship called Solar Crown due to his dream of becoming a professional racer.\n\n###Gameplay\nLike in the previous game of the Test Drive franchise, the game features a completely open world and is set on two islands - Ibiza in Spain and O'ahu, Honolulu.\n\nThe players are free to buy whichever vehicle they want as long as they have the required driving license and money. There are four licenses in the game, Asphalt, Off-road, Classics, and Motorcycles. Each license has several levels that must be acquired in the in-game driving school.\n\nThe cars are not the only thing available to the players. The game features a wide variety of social options. The players are free to buy new clothes, houses, visit casinos or even start their own crew by purchasing a club building.\n\n###Multiplayer\nThe game features a free-roaming multiplayer mode, with up to eight players playing together in one game session. Apart from free-roaming and competing in races, it is also possible to visit the game's social hubs, other players houses or drive in one car with other players.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Atari","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":16160,"name":"Dreamfall: The Longest Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbc/cbc0786c7618d6db01a2d659b190c0c3.jpg","description":"Dreamfall: The Longest Journey, winner of multiple E3 awards as the best game in its genre, is the continuation of a saga that began in the award-winning The Longest Journey, considered to be one of the finest adventure games ever made. In Dreamfall, players are taken on an epic journey of exploration and adventure as they venture through a thrilling and emotional storyline. Dreamfall features a fully interactive world where beautiful music, stunning graphics, fascinating characters and unparalleled gameplay variety promises to bring the adventure genre into a new era. Prepare for a spiritual, fantastic and powerful gaming experience.\nUnparalleled Gameplay Variety Never before has an adventure game brought this much gameplay variety! Use your brains or your brawn; sneak, fight or talk your way through the many challenges the game offers. Be polite or rude, threaten or sweet talk; in Dreamfall you make the choice, resulting in a game where you never quite know what to expect next.\nThree Playable Characters Experience the story from three separate perspectives, and learn how their destinies blend together in an epic finale. Each character has unique abilities and world views, giving you constant gameplay variations.\nThree Worlds Dreamfall spans three beautifully realized worlds, multiple chapters and a stunning amount of detailed locations. Travel across a futuristic version of our earth, journey into a magical fantasy realm and unravel the mysteries of the Winter.\nUnique World Interaction Bridging the gap between the classic point and click adventure game, where you could click on any given point at the screen, and the action adventure, where you need to move up to an object to interact with it, Dreamfall introduces the brand new focus field feature. In this easy-to-use context-sensitive interface you can scan your entire visible environment as seen by the characters, and use it to get information on far away objects as well as triggering remote gameplay opportunities.\nMature \"Thriller\"-type Storyline Dreamfall delivers a mature and compelling storyline that mixes the futuristic, fantastic and spiritual with a tale of murder, deceit and a conspiracy threatening our very existence. Bringing the classic adventure game into the world of the modern action game, Dreamfall delivers a rare and special story experience.\nStunning Sounds and Soundtrack Listen to an emotional and epic soundtrack in 7.1 surround. Hear gripping voices as recorded by more than 50 professional actors, and enjoy soundscapes bringing players to the edge of their seats.\nA game for everyone 50% of the players of the original The Longest Journey were women. With its cinematic approach, believable characters, mature storyline and easy-to- grasp interface, Dreamfall is a game that any teenager or adult can pick up and enjoy, regardless of their gaming background.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Funcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":11044,"name":"Car Mechanic Simulator 2015","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/306/3067f48f9c2156d85678ec4995373966.jpg","description":"Featured DLChttp://store.steampowered.com/app/434910/\nhttp://store.steampowered.com/app/434900/\nhttp://store.steampowered.com/app/434901/\nAbout the GameNew cars, new tools, new options, more parts and much more fun in the next version of Car Mechanic Simulator! Take your wrench!Create and expand your auto repairs service empire. Car Mechanic Simulator 2015 will take you behind the scenes of daily routine in car workshop.\nTake on the role of the car mechanic and repair cars for your clients. Spend the earned money on expanding your workshop and improving your skills.  Buy worn out cars, renovate them and sell with profit or become a famous car collector. If you manage your business well, you will surely succeed in the market.\nCar RepairsThe essence of the game. It is your job. It is the way you get cash. It is the way you live... Ok, it is maybe not that important, anyway that is the basic activity in the game. Customer comes in and mysteriously says that his car is broken but he needs it for tomorrow. The clock starts right now.Mission systemJobs are generated randomly so you'll have to choose on which car you will work. It seems like there is a group of customers waiting in front of the workshop for the mechanic...\nAdditionally you can take limited amount of jobs in the same time and every one of them is time-restricted. With different difficulty and complexity levels and of course, different payment levels, wise management is the key here.Workshop managementAfter whole day of hard work it is time to count your cash and then look around your business. What should I buy to improve my performance? What would attract more clients? You can always just buy more posters on the wall but it is not something called 'great investment' for such a serious business, right?Car auctionsSpeaking of investments.There is a chance for making even more money in the car auction house. Choose wisely, buy used or old cars and renovate them to sell with profit... Or, if you are one of those vintage car lovers, you can have your own collection.Car ModelsCars are fully dismountable to the car frame with amazing level of detail. Every car is made of more than 200 interactive parts, which includes  an interior, a car body and the whole engine.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PlayWay","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16437,"name":"Still Life","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd0/fd0dd78822bc49c5be7f80b277813e83.jpg","description":"The Producers of Syberia I and II are proud to present Still Life.\nVictoria McPherson, is a brilliant young FBI agent who’s investigating a serial murder case. The body count is now at five and with the lack of real leads and a mountain of circumstantial evidence, Victoria is beginning to show signs of fatigue and stress.\nShe decides to take a break and go rest at her father’s home in suburban Chicago; after all, it is close to the Christmas holidays. However, Victoria does not find rest. Instead, she finds one of her grandfather’s old case files and begins to read. Oddly enough, Victoria’s present case resembles the one from the past, right down to the killer’s MO…\nKey Features:\t\t\t\t\tCompelling storyline set in modern Chicago and Prague in the late 20s\nRich and intriguing characters\nCrime scenes investigations of gruesome serial homicides\nChallenging puzzles finely integrated into the storyline\nBeautifully detailed environments\nBreathtaking cinematics","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Microids","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":11385,"name":"Refunct","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d9/3d95811100f46f68d74ff10329dfdf49.jpg","description":"A short experience about restoring a world featuring:\nPlatforming: Wall-jumps, slides, pipes, lifts, springboards\nBeautiful: Emotional soundtrack and vibrant visuals\nPeaceful: Non-violent, open world without death\nPlayful: Learn to play without tutorials\nRelaxing: Play at your own pace without pressure\nDynamic: Changing world and music-synced day/night cycle\nSeamless: Half an hour of uninterrupted quality playtime\nFor everyone: Enjoyable by a wide variety of player skill","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dominique Grieshofer","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10373,"name":"Genital Jousting","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7a/d7a839a667ded013ddb140437ca9b768.jpg","description":"Genital Jousting is an online and local multiplayer party game about flaccid penises and wiggly anuses for up to eight players at once. Players control a detached penis complete with testicles and an anus. Multiple game modes provide a stimulating orgy of objectives: penetrate and be penetrated as fast as possible or compete in absurd, silly and sexually suggestive games and challenges.\nIf this is something that makes you uncomfortable or sounds unappealing, please do not purchase or play Genital Jousting, or even continue reading.\nOnline and Local Multiplayer for Eight: Genital Jousting is more fun with friends and can satisfy up to eight players at once! Find a few willing partners, cuddle up on the couch, and share controllers or go online to joust with anonymous players from all over the world.\nTraditional and Party Modes: Dabble in the throbbingly fast-paced Traditional Mode or jostle your way through some stiff competition in Party Mode including challenges like Double Delight, Obstacle Intercourse, and Weiner Round Up.\nCustomize Your Member: Genitals come in all shapes and sizes so pick your favorite color and decorate it with the most appealing outfit to customize a penis you can really get behind!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Free Lives","platforms":[{"id":0,"name":"PC"}]},{"id":45342,"name":"Orwell: Ignorance is Strength","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/658/658569d224d07f0b12d171542bf2d259.jpg","description":"Inspired by the rise of fake news, social media echo chambers, and the displacement of truth, Orwell: Ignorance is Strength is the second--darker--season of the award-winning surveillance thriller, Orwell. With the power to both uncover and play with \"the truth\", you must decide for yourself how far you will go in the service of your country and whether the truth is sacred or ignorance is strength.\n\nInducted into “The Office”--a top-secret department of the government’s Orwell security program--you’ll take on the role of an investigative agent during a time when civil unrest threatens to become a major political crisis between the Nation and neighboring country Parges.\n\nReporting directly to Orwell adviser, Ampleford, you‘re tasked with uncovering the truth behind the escalating political tension, and delving deep into the lives of Raban Vhart, editor of The People’s Voice and self-proclaimed guardian of truth, his wife, Karen, and his brother, Illya, to uncover their potential involvement.\n\nTo assist you in your task, you will be given new tools and mechanics that provide opportunities to control and impact the narrative. A new “time of day” system puts you in time-sensitive situations, making who you chose to investigate and when, more important than ever. You can also research more widely and dig deeper into citizen’s lives, gathering additional information to influence the way events are reported and perceived by the public.\nFEATURES:\nInvestigate the agitators - Enter the world of Orwell and join a top-secret department of agents known as “The Office” during a time of civil unrest and political tension. Profile persons of interest by exploring web pages, social media and private communications. Make connections. Find the information you need to know.\n\nUncover the truth - Separate the stories from the facts, the propagated myths and fake news from what’s really happening. Identify the hidden agendas of all those involved and expose them.\n\nManipulate the information - Use Orwell’s upgraded toolset and the information you have uncovered to create your own version of the truth. Then use that to gain influence and control over the situation.\n\nEnd the threat - Expose the truth. Destroy the lives and influence of those who seek to bring harm to the government and diplomatic relations with neighboring countries. Put an end to the civil unrest threatening to destroy the Nation.\n\nReleasing over three episodes - The game will release on PC, Mac and Linux across three bi-weekly episodes, with episode one available February 22. Be part of the investigation as it unfolds.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Osmotic Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16612,"name":"NEKOPARA Vol. 0","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c6/1c62af786f7fa586e33905f41edeefda.jpg","description":"Please note that NEKOPARA Vol. 0 is a fandisc for NEKOPARA Vol. 1\nWhat's NEKOPARA? Why, it's a cat paradise!\nThis is a story just before Kashou opened \"La Soleil\".\nThe eldest daughter of the Minaduki household and their 6 catgirls go to wake up their master; prepare breakfast; clean up the house; go out on a walk; make dinner; take a bath; sleep together; et cetera, et cetera.\nEnjoy a page from the leisurely, daily lives of Shigure and the Minaduki household's catgirls!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"PC"}]},{"id":72757,"name":"Pumpkin Jack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3b/b3bf532ebe510c5db85e5914009bdaaa.jpg","description":"Dive into an Epic Adventure and help the Evil annihilate the Good!\r\nFollow the will of the Devil himself and slay your nemesis in an epic quest that will take you on a journey in the Boredom Kingdom, a mythical realm shattered by the Curse. You will meet friends along the way, from a haughty Owl to a snarky Crow!Discover Stunning atmospheres in a Colorful yet Spooky Scary Kingdom\r\nTravel through epic and dramatic settings, with each level having its own eerie atmosphere. Using a vibrant palette and high quality lighting effects, Pumpkin Jack invents its own unique cartoon universe inspired by the classic PS2 graphic style.Jump, Run & Climb to carve your own way in Unique Levels\r\nPumpkin Jack is a classic 3D Platformer before anything else! Every level will challenge you through several themed platforms, all giving you new trials to complete.Fight for your life against Evil Beasts by using awesome Unlockable Weapons\r\nYou will have to master the arts of dodging, timing and movement to vanquish Jack's foes. During the dynamic real time battles, choose which weapon you want to use and strike at the critical moment!Face Breathtaking Challenges and discover tons of Original Gameplays\r\nSolve puzzles that focus on physics, gravity and reflection. Inhabit a pumpkin head and burn books, hammer some moles, create a path for magic spheres… But also more! In each level, you will be faced with an action sequence using a new exclusive gameplay!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"NicolasMey","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":62359,"name":"Monster Sanctuary","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32e/32edbec542dceb12ddf0d868e0a42dbd.jpg","description":"As the youngest heir of an ancient bloodline of proud Monster Keepers, you step out into the world to follow in your ancestors' footsteps. You will gather a party of monsters to grow and train. Meanwhile, a series of unsettling events worries the experienced Keepers of the Monster Sanctuary. This is the beginning of a journey to unravel the cause of this mystery that threatens the peace between humans and monsters.\nMonster Sanctuary is the idea of combining monster collecting, turn based combat and metroidvania-like exploration. Any monster you encounter can become a part of your own party. Additional monsters provide a lot of tactical options in combat or allow you to overcome certain obstacles to explore new areas.\nEvery monster has a unique skill tree. This lets you individualize your monster to pursue different strategies. Feeding and equipping your monsters to improve their stats further emphasizes this aspect.\nThe combo system gives additional depth to the combat. Each individual hit increases the damage of the next moves within the same combat turn. The loot system challenges you to find the quickest and most efficient way to end a battle - rewarding you with better loot. Grind and find the best combo to earn the rarest monster eggs!\nFollow the development\nMonster Sanctuary is still early in development. You can follow the progress on\nFacebook\nTwitter","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Denis Sinner","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":16342,"name":"Outcast 1.1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bf/4bf43345c91808b30de09ff9e78d45c3.jpg","description":"Fresh3D is bringing you Outcast 1.1, an enhanced version of 'Outcast', an action-adventure game featuring software voxel rendering, developed in 1999 for the PC.\nOutcast was one of the first 3d games to offer:\nnon-linear gameplay,\nfree-roaming environments,\ncombats against clever reactive AI,\nexcellent voice acting,\nsymphonic music,\n20+ hours of highly engrossing adventure.\nOutcast has been critically acclaimed to the point it has reach some cult status among many PC gamers. Today,  we have the opportunity to bring this fantastic game for the first time to the Steam community.About this versionOutcast 1.1 has been recompiled from the original source code and improved to run smoothly on today's computers.The main improvements compared to the original version are: multithreaded voxel renderer for higher performances, software bilinear filtering on polygonal meshes, part of the HUD redesigned to match higher resolutions, new high-resolution sky paintings, new launcher, native support of xbox gamepad, user-friendly controller configuration, a lot of bugs fixed and improved stability.Story\nIn 2007, the U.S. government successfully sends a probe to an alien world in a parallel universe. As the probe is transmitting video images of the world, an alien life form discovers the probe and damages it, causing a disruptive backlash of energy to form a black hole threatening Earth. Former U.S. Navy SEAL Cutter Slade is given the job of escorting three scientists (William Kauffmann, Anthony Xue and Marion Wolfe) on a mission to this alien world to recover the probe and stop the threat. Arriving in this alien world, Cutter is separated from the other scientists and is hailed by the natives as their messiah, the Ulukai.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Fresh3D","platforms":[{"id":0,"name":"PC"}]},{"id":21751,"name":"The Desolate Hope","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/566/5664397f017f32f3c4bddc464eeed180.jpg","description":"The Desolate Hope I an adventure game with RPG elements developed by Scott Cawthon.\n\n###Story\nThe story takes place in an abandoned research station o an unnamed planet. The station contains five computers knowns as Derelicts. Their purpose is to run simulations that would show whether the planet is suitable for human colonization. As the initial interest for the station faded away, the transmission from Earth stopped, a strange virus started ravaging Derelicts. \nYou play a Coffee – a coffee-pot-like robot and the last mobile resident of the station. Your goal is to fight the virus and provide Derelicts the conditions to perform their daily tasks.\n\n###Gameplay\nThe gameplay of The Desolate Hope is a mix of various genres. You explore the station and enter the Derelicts’ simulations in 2D platformer style.\nThere are some mini-simulations in the game which incorporate top-down dungeon crawler gameplay. Throughout the game, you have to face some bosses. Battles with them are semi-turn-based and reminiscent of classic jRPGs. The Desolate Hope mostly focuses on battles and exploring the station. Your character can advance by gaining new abilities, getting new items and increasing your stats to become active for the fight.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"PC"}]},{"id":49069,"name":"Sword Legacy Omen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff9/ff95a4e23cc4bbb2f7ea9917647fdc93.jpg","description":"Welcome to Broken Britannia\n\"Before Arthur’s Golden Age, our realm was lost, shattered and decadent; kingdoms torn apart by blind selfishness. A broken Britannia, void of hope.\"\nThe lord of Mercia has been assassinated, your love kidnapped and home is no more. As Uther, the disgraced Knight Commander, you must lead your misfit band of companions throughout quests riddled with trials. Forge uneasy alliances to acquire the mythical Excalibur sword and defeat the sinister power-obsessed duke of Wessex\nCombat in Sword Legacy: Omen is always a challenge. As a strategist, you will need to plan your course of action with four heroes at a time. However, be ready to adapt and improvise because combat results always change based on the chosen abilities and chances of landing an attack.KEY FEATURESTactical Combat: Learn the importance of strategic positioning and unleash powerful skill combos with your party.\nFree Exploration: When not in combat, investigate the environment, find treasures, solve riddles, and uncover secrets.\nParty Customization: Adapt characters to your play style, manage your team, and progress by unlocking over 70 unique skills.\nHordes of Enemies and Unique Bosses: Fight a variety of vicious mobs and face powerful monsters in grueling battles.\nStress System: Use all your might to become victorious, but deplete your willpower and witness your heroes fall prey to panic.\nOld-School Art Style With a Dark Twist: Relive the beautiful aesthetic of classic animations fused with the visuals of obscure and gothic comics.\nA Different Take on a Classic Myth: Experience the Arthurian legends as never before, as famous characters and locations are revamped in a mature storyline of vengeance, honor, conspiracy and alchemy.\nInteractive Environment: Study your surroundings and make deadly moves by blowing up explosive barrels and pushing enemies off edges.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Firecast Studio","platforms":[{"id":0,"name":"PC"}]},{"id":2937,"name":"Infinifactory","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fa/0fa7a9223cefa62aaa0bf546b0be56e8.jpg","description":"Infinifactory is a sandbox puzzle game by Zachtronics, the creators of SpaceChem and Infiniminer. Build factories that assemble products for your alien overlords, and try not to die in the process.\nLIKE SPACECHEM… IN 3D! Design and run factories in a first-person, fully 3D environment.\nHISTOGRAMS ARE BACK! Optimize your solutions, and then optimize them more when you see how much better your friends did.\nVISIT EXOTIC ALIEN LOCALES! Explore a story-driven campaign with 50+ puzzles, audio logs, and more.\nBLOCKS THAT MOVE! Go beyond the campaign and push the limits of Infinifactory’s next-generation block engine in the sandbox.\nSTEAM WORKSHOP INTEGRATION! Create, share, and play custom puzzles on Steam Workshop.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zachtronics","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1236,"name":"Thimbleweed Park","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bcd/bcd1dad21dcaec5426c8dfa61e7b1373.jpg","description":"Welcome to Thimbleweed Park. Population: 80 nutcases.\nA haunted hotel, an abandoned circus, a burnt-out pillow factory, a dead body pixelating under the bridge, toilets that run on vacuum tubes... you’ve never visited a place like this before.\nFive people with nothing in common have been drawn to this rundown, forgotten town. They don’t know it yet, but they are all deeply connected. And they’re being watched.\n...Who is Agent Ray really working for and will she get what they want?\n...What does Junior Agent Reyes know about a 20 year old factory fire that he’s not saying?\n...Will the ghost, Franklin, get to speak to his daughter again?\n...Will Ransome the *Beeping* Clown ever become a decent human being?\n...Will aspiring game developer Delores abandon her dreams and stick by her family?\n...And most importantly: how come no one cares about that dead body?\nBy the end of a long, strange night in Thimbleweed Park, all of this will be answered -- and you’ll question everything you thought you knew.\nIn a town like Thimbleweed Park, a dead body is the least of your problems.\nKey Features:\nFrom Ron Gilbert and Gary Winnick, creators of Monkey Island and Maniac Mansion.\nA neo-noir mystery set in 1987.\n5 playable characters who can work together… or get on each other’s nerves.\nNot a walking simulator!\nSatisfying puzzles intertwined with a twisty-turny story that will stay with you.\nA vast, bizarre world to explore at your own pace.\nA joke every 2 minutes... guaranteed!*\nCasual and Hard modes with varied difficulty.\nEnglish voices with English, German, French, Italian, Russian and Spanish subtitles.*Not a guarantee.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Terrible Toybox","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":115,"name":"Zero Escape: The Nonary Games","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28f/28f81553112c263932cc5157f6ff92ec.jpg","description":"Kidnapped and taken to an unfamiliar location, nine people find themselves forced to participate in a diabolical Nonary Game by an enigmatic mastermind called Zero. Why were they there? Why were they chosen to put their lives on the line as part of a dangerous life and death game? Who can be trusted? Tensions rise as the situation becomes more and more dire, and the nine strangers must figure out how to escape before they wind up dead.\nTwo spine-tingling Nonary Games\nZero welcomes you to take part in both the Nonary Game and the Nonary Game: Ambidex Edition as the award-winning escape-the-room visual novels Nine Hours, Nine Persons, Nine Doors (999) and its sequel, Virtue’s Last Reward (VLR), are together for the first time.\nA remastered and revamped Nine Hours\nThe well-received classic Nintendo DS game 999 has been updated with hi-res graphics and a variety of new features including both Japanese and English voice acting!\nSeek a way out\nSearch for clues within numerous locked rooms and solve mind-bending puzzles in order to escape. VLR even has two difficulty settings for more of a challenge.\nFascinating theories and pseudo science ideas abound along the twisting, turning journey to uncover who Zero is, why everyone was kidnapped, and the shocking connection between the Nonary Games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":19093,"name":"Another World – 20th Anniversary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78e/78e2e5d3e3fff048d3b272bd2446ae5f.jpg","description":"Also known as Out Of This World™, Another World is a pioneer action/platformer that released across more than a dozen platforms since its debut in 1991. Along the years, Another World™ has attained cult status among critics and sophisticated gamers alike.\nAnother World™ chronicles the story of Lester Knight Chaykin a young scientist hurtled through space and time by a nuclear experiment that goes wrong. In an alien and inhospitable world, you will have to dodge, outwit, and overcome the host of alien monsters, while surviving an environment as deadly as your enemies. Only a perfect blend of logic and skill will get you past the deadly obstacles that lie in wait.Key Features:Remastered presentation: a joint effort between visionary game-designer Eric Chahi and developer DotEmu, Another World is back in its 20th Anniversary Edition with High Definition graphics faithful to the original design.\n3 difficulty modes: Normal (easier than original game), Difficult (Equal to original game) and Hardcore (more difficult than original game)\nA new immersive experience: rediscover a cult adventure with 100% remastered sounds and FX\nSocial features: Steamworks™ integration with 13 achievements.\nExtra features: development diary, making of video, technical handbook","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"DotEmu","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]}]