[{"id":4179,"name":"Darksiders II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/848/8482235332f4518da363c3cb4e5cd075.jpg","description":"Darksiders II is a third person slasher/RPG, the second installment in the Darksiders series. The game shares many similarities with its predecessor, but also exhibits new features such as an open world, overhauled quest system and dialogues.\nThe main character is the second Rider of Apocalypse, Death, out on a quest to support previous game’s protagonist, War, and to restore what has been lost by the world. The key features of the series, the extensive combat system, and various riddles have also seen significant improvements. RPG elements exist in the form of leveling up your protagonist and acquiring new skills for both combat and battle support. The game also features an immersive soundtrack, which will accompany the players throughout every location and battle.\nDarksiders II has implemented many traits common to third-person RPGs of the time, but it still manages to be outstanding with its unique design of locations and enemies, a more realistic combat system and other overhauls of the game mechanics, all resulting in a refined experience for any player.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"}]},{"id":19375,"name":"Far Cry 3: Blood Dragon","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5e4/5e4bff02098b2b6f824c68286d5da1a6.jpg","description":"The game uses part of the world Far Cry 3.\nIn 2007, a devastating nuclear war was interrupted by a temporary truce between world powers. But the state without war is not pleasant to everyone - on a remote island someone creates an army of robots called Omega Force, to force the world to resume the war. On the island comes the fighter of the special division Mark IV Cyber ​​Commando, cyborg Rex Power Colt, to prevent the villain to realize his plan.\n\nThe character moves through the levels, destroys enemies, collects useful items and performs certain tasks. For example, to save a hostage or destroy an object. Successful execution of missions brings him points of \"experience\". As the game progresses, the hero's weapon and skills are improved.\nThis game is characterized by a visual solution in the style of fantastic fighters of the 80s. In the same style, the soundtrack is designed. Many decisions directly cite the classic footage from the films of this time.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":11974,"name":"Mark of the Ninja","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b17/b17485d757ca36b5f1ad376b6b096885.jpg","description":"Mark of the ninja is a side-scrolling stealth-action. The game follows an unnamed ninja who is tasked to revenge a private military company that attacked ninja’s clan dojo.  \nThe gameplay can be described as a mix of 2D platformer and stealth-action. Throughout the whole game, it is much more useful to neutralize enemies silently. The ninja protagonist has different abilities and tools which allow him to kill enemies from hiding spots, distract enemies, slow them down, and so on. They can be unlocked in exchange for honor – points that you get for performing different types of silent kills, completing tasks, challenges, finding collectibles.  \nThe enemies are sensitive to sound, they interact with each other and can be terrified if the witness an assassination of their allies. There are different types of collectibles in the game and few secret challenge rooms in each level. Usually, they consist of some puzzles which can be solved by using the ninja’s unique abilities and items.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":53341,"name":"Jet Set Radio","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd7/fd794a9f0ffe816038d981b3acc3eec9.jpg","description":"Jet Set Radio (2000) is an action game that allows players to dive into the atmosphere of teenager gangs of early 2000s Tokyo. The action is set in a 3D fictionalized Tokyo torn by teen gangs clash. Things clarify when Professor K, DJ of the Tokyo-to pirate radio station announces a gang war between Japanese rudies (teenagers, who skate and paint graffiti for self-expression). According to the main idea, teens skate and paint graffiti spots throughout the city and dodge police forces. The story is following a 17-year-old rudie Beat, who, being inspired by Professor K, organizes his own gang to burst into the conflict and to defeat rivals. The gameplay is about skating across the city (using only a few buttons) and tagging all possible graffiti spots. In the course of the game, players will face troubles caused by police riots and especially Capitan Onishima (the main antagonist), whose only aim is to pursue the rebellion of the youth. Jet Set Radio also features cel-shaded visuals in favor of 3D cartoon-like picture.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"SEGA","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":12019,"name":"BattleBlock Theater","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/388/388935d851846f8ec747fffc7c765800.jpg","description":"BattleBlock Theater is a platform game developed by The Behemoth.\n\nThe player was aboard the S.S. Friendship when the ship encounters a heavy storm that causes the ship to crash into a strange island. After the player awakens, no ship's crew members seem to be around. Moreover, it is revealed that the crew is held prisoner by cats that force the crew members to act out deadly performances in the cats' theater. The player has to pass all the levels in order to save Hatty Hattington, the best friend to one and all.\n\nThere are two game modes featured in BattleBlock Theater: Adventure Mode and the Arena. Adventure Mode resembles the game's campaign, which can be played alone or in co-op. There are multiple chapters in this mode that consist of several levels. In order to unlock the next chapter, the player has to get a certain amount of gems and pass the \"Boss Level\" which is a usual level but with a time limit. Players have the ability to collect balls of yarn in order to buy new equipment from cat guards.\n\nArena Mode is a competitive game mode for 2 to 4 players. Players take part in various mini-games to score the most points for their team and win the round.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Behemoth","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2300,"name":"Drawful 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eeb/eeb9e668da5fd07bab9f655acfbbe579.jpg","description":"The team behind the hit party games Fibbage, Quiplash, and YOU DON’T KNOW JACK presents Drawful 2 the game of terrible drawings and hilariously wrong answers! Use your phone or tablet to draw funny and challenging things like “creepy tiger” or “two moms having a great day.”\r\nPlayers type in what they think the (probably terrible) drawing really is and then everyone - even an audience of potentially thousands of players – votes on what they think is the correct answer.\r\nDrawful 2 is a go-to party game that everyone can play and enjoy!\r\nDrawful 2 includes new features like the ability to add your own user generated prompts to make even weirder games full of in-jokes with your friends, as well as expanded tools for streaming.\r\nNote: Drawful 2 is in English only.\r\nNote: This game is local multiplayer, but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":58813,"name":"Resident Evil 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/053/053fc543bf488349610f1ae2d0c1b51b.jpg","description":"Resident Evil 2 is the remake of the 1998 game of the same name. \n\n###Plot\nThe plot of the remake is identical to that of the original game. The story follows the survivors of a zombie virus outbreak in the fictional Raccoon City. There are two protagonists: Claire Redfield, a high school student, and Leon Kennedy, a policeman. They both search for the ways to escape the infested city. Companions, such as Ada Wong and Sherry, occasionally follow the protagonists. The characters eventually uncover the dark secrets of the Umbrella Corporation, which created the virus as a biological weapon, and fight its monsters, such as the Tyrant.\n\n###Gameplay\nThe player controls either Leon or Claire from the third person view in a 3D environment. The two protagonists' storylines are intertwined. The player can complete the scenario playing one of the protagonists, and then replay it from the other character's POV, with all his previous actions taken into account. The game combines puzzle solving with zombie fights. Both protagonists use firearms as their main weapon; however, ammo is scarce.\n\n###Changes from the original\nBesides the updated graphics, the remake features a new camera and controls. In the original game, the controls were relative to the position of the player's character rather than the camera. The remake uses an over the shoulder camera, and the movements are relative to its angle. There's also no more loading screens, and the characters move between locations seamlessly.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":10064,"name":"Assassin’s Creed Brotherhood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/116/116b93c6876a361a96b2eee3ee58ab13.jpg","description":"Digital Deluxe Edition2 Exclusive Single-Player Maps: The Trajan Market & The Aqueduct\n2 Multiplayer Characters:The Officer - Death's Finest Ally: Few have seen him. Even fewer have lived to tell about it. Fear is his friend, and Death is his ally.\nThe Harlequin - The Walking Nightmare: Behind the gaudy costume and twisted smile lies the soul of a merciless Assassin.img.padding {padding-right: 10px;}\n1 Ezio Skin - Helmschmied Drachen Armor: Fashioned by the Helmschmied Armory in 1489, only a few sets were completed due to the weight of the metal. Very few men proved strong enough to wear it.\n\nimg.padding {padding-right: 10px;}\nThe Original Codex Written by Altaïr: Take a closer look at the history of the Assassins and art of Assassin’s Creed Brotherhood.\nMultiplayer Characters Collectible Trading Cards: A set of trading cards featuring all the characters of Assassin's Creed Brotherhood Multiplayer, including their kill moves and biographies.\nMap of Rome\nAssassin’s Creed Lineage - The Complete Movie: Explore the events that revolve around Ezio’s father, Giovanni Auditore da Firenze, and gain insight on the Assassin’s Creed story and universe.\nMaking-Of Assassin’s Creed Brotherhood - Behind the Brotherhood: Go behind the scenes with the development team to learn about how the game was made and Ezio’s continuing story.\nGame Soundtrack: 22 songs from the original game soundtrack by Jesper Kyd.\nDigital Premium Edition content is only available via download\nAbout the GameLive and breathe as Ezio, a legendary Master Assassin, in his enduring struggle against the powerful Templar Order. He must journey into Italy’s greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy.\nDefeating the corrupt tyrants entrenched there will require not only strength, but leadership, as Ezio commands an entire Brotherhood who will rally to his side. Only by working together can the Assassins defeat their mortal enemies.\nAnd for the first time, introducing an award-winning multiplayer layer that allows you to choose from a wide range of unique characters, each with their own signature weapons and assassination techniques, and match your skills against other players from around the world.\nIt’s time to join the Brotherhood.\nKey FeaturesBE A LEGEND – Take Ezio, now a legendary Assassin, on a new adventure with 15+ hours of story-driven single-player gameplay.\nLEAD AND CONTROL A LEGENDARY BROTHERHOOD – Recruit and customize your own guild. Train and level up assassins and command them to aid you in your quest.\nDEPLOY SECRET WEAPONS – Swiftly eliminate your enemies using tools such as poison darts, parachutes, double hidden blades, hidden guns, and an advanced flying machine at your disposal.\nWIN THE HEART OF A CITY – Use your hard-won currency to revitalize the crumbling capitol city. Rally the citizens to your cause and unlock extra factions and missions.\nAWARD-WINNING MULTIPLAYER – Choose from multiple authentic character classes, each with their own signature weapons and killing moves. With richly detailed maps and a wide variety of unique multiplayer modes, you’ll never fight the same way twice.\nBONUS CONTENT:Project Animus Update #1 Multiplayer DLC:\nTo survive the treacherous, narrow roads and the multi-leveled architecture of the Mont Saint-Michel map and the challenging Advanced Alliance multiplayer mode, Abstero recruits will need to use free-running and refined hunting skills to their advantage.\nProject Animus Update #2 Multiplayer DLC:\nThe Pienza Map provides the perfect free-running playground where predators and targets can blend and disappear. In the Chest Capture Multiplayer Mode two teams comprised of three players each partner with fellow Templars to either defend or capture Chests. Also included is the new Templar Score feature to reward diligent work by Abstergo recruits.\nThe Da Vinci Disappearance Single-Player and Multiplayer DLC:\nAfter the fall of the Borgias, Leonardo Da Vinci is kidnapped and Ezio will embark on a relentless quest to recover him discovering new locations and gameplay features. The multiplayer addition is the biggest expansion to the award-winning multiplayer yet, including a new map, new characters and game modes.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2166,"name":"Game of Thrones - A Telltale Games Series","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c81/c812e158129e00c9b0f096ae8a0bb7d6.jpg","description":"Game of Thrones is an episodic game composed of six parts with an emphasis given to a TV series by HBO. The game consists of the first season with the second one being on hold. The events depicted in the game do not correlate with those of a TV-show, but rather complement them with the in-between details.\nThere is a total of five playable characters, the game like the other TellTale titles is made as the point-and-click adventure with high attention paid to the choices. The gameplay is formed of QTEs, dialogues, cutscenes and the investigation parts. QTEs are forcing a player to mash the buttons repeatedly, in the dialogues section one can choose options to answer, and the investigation part involves pointing-and-clicking on the objects.\nAfter every episode, the player is given the information about his or her choices. On the same screen, one may compare own decisions to the preferences of the other players in the world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":47137,"name":"Fortnite Battle Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dcb/dcbb67f371a9a28ea38ffd73ee0f53f3.jpg","description":"Fortnite Battle Royale is the completely free 100-player PvP mode in Fortnite. One giant map. A battle bus. Fortnite building skills and destructible environments combined with intense PvP combat. The last one standing wins.  Download now for FREE and jump into the action.\r\nThis download also gives you a path to purchase the Save the World co-op PvE campaign during Fortnite’s Early Access season, or instant access if you received a Friend invite.\r\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\r\n1 player\r\nNetwork Players 2-99\r\n10GB minimum save size\r\nDUALSHOCK®4\r\nOnline Play (Required)\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\r\nFortnite © 2017, Epic Games, Inc. Epic Games, Fortnite, Unreal, Unreal Engine 4, UE4, and their respective logos are trademarks or registered trademarks of Epic Games, Inc. in the United States of America and elsewhere. All rights reserved. The rating icon is a registered trademark of the Entertainment Software Association. All other trademarks and trade names are the properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Epic Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":295021,"name":"Orwell: Keeping an Eye On You","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e1/2e187b31e5cee21c110bd16798d75fab.jpg","description":"Season 2, Orwell Ignorance is Strength is out now! Check out the store page for more information...\n\nhttp://store.steampowered.com/app/633060/Orwell_Ignorance_is_Strength/\nAbout the GameBig Brother has arrived - and it’s you. Investigate the lives of citizens to find those responsible for a series of terror attacks. Information from the internet, personal communications and private files are all accessible to you. But, be warned, the information you supply will have consequences…\n\nOrwell is a new governmental security program that has the power to survey the online presence of every person in The Nation. It can monitor all personal communications and access any computer. To preserve the privacy of citizens, human researchers examine the data Orwell finds and decide which pieces of information should be passed on to the security forces, and which should be rejected.\nSelected from thousands of candidates, you are Orwell’s first human researcher. And when a terror attack rocks the Nation’s capital city of Bonton, Orwell, and you, are immediately put to the test. Starting with a single person of interest, you'll help the security forces build out and profile a network of potential culprits.\nBut are these people really terrorists? What does the information you reveal to Orwell say about them? What if you find out things about them that not even their loved ones know? What is the real price of maintaining the security that the Nation is yearning for?Key Features\nInvestigate the digital lives of citizens.\nSearch web pages, scour through social media posts, dating site profiles, news articles and blogs to find those responsible for a series of terror attacks.\nInvade the private lives of suspects.\nListen in on chat communications, read personal emails, hack PCs, pull medical files, make connections. Find the information you need to know.\nDetermine the relevance of information.\nOnly the information you provide will be seen by the security forces and acted upon. You decide what gets seen and what does not, influencing how the suspects will be perceived.\nSecure the freedom of the Nation.\nFind the terrorists so the citizens of the Nation can sleep safe, knowing Orwell is watching over them.\nMATURE CONTENT WARNING\nPlease note, Orwell includes mature language at multiple points throughout the game as well as mature themes and is not suitable for younger players.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Osmotic Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":455597,"name":"It Takes Two","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d47/d479582ed0a46496ad34f65c7099d7e5.jpg","description":"Bring your favorite co-op partner and together step into the shoes of May and Cody. As the couple is going through a divorce, through unknown means their minds are transported into two dolls which their daughter, Rose, made to represent them. Now they must reluctantly find a way to get back into their bodies, a quest which takes them through the most wild, unexpected and fantastical journey imaginable.\r\n\r\nIt Takes Two further builds on Hazelight’s proven track record of making rich and engaging co-op experiences. While developing It Takes Two it has been the team’s number one priority to truly merge story and gameplay. Allowing both to influence each other guarantees a game that is as engaging to play as it is compelling to experience.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Hazelight","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":397477,"name":"Resident Evil 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a4b/a4bb55f42fe837ae7bf1307e7b41cc85.jpg","description":"Taking a trip back to Raccoon City won’t be a walk in the park, of course. The city is in the throes of an outbreak, with the shuffling undead wandering the streets and the urban jungle becoming a tangle of overturned cars and crumbling buildings. Picturesque, isn’t it? It’s against this backdrop that Jill Valentine prepares to make her escape, though there’s a bit of a twist in the timeline for those of you who aren’t familiar with the original. If you played Resident Evil 2 earlier this year, you may know that Leon and Claire arrived in the city on September 29th. Jill’s story, however, starts a few days earlier. As an accomplished member of S.T.A.R.S. and a survivor of the incident in the Arklay Mountains (the site of the original Resident Evil), Jill has some experience with the horrors that await.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":28121,"name":"Slay the Spire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f52/f5206d55f918edf8ee07803101106fa6.jpg","description":"We fused card games and roguelikes together to make the best single player deckbuilder we could. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and Slay the Spire!\n\nFeatures:\n\n- Dynamic Deck Building: Choose your cards wisely! Discover hundreds of cards to add to your deck with each attempt at climbing the Spire. Select cards that work together to efficiently dispatch foes and reach the top. \n- An Ever-changing Spire: Whenever you embark on a journey up the Spire, the layout differs each time. \n- Choose a risky or safe path, face different enemies, choose different cards, discover different relics, and even fight different bosses!\n- Powerful Relics to Discover: Powerful items known as relics can be found throughout the Spire. The effects of these relics can greatly enhance your deck through powerful interactions. But beware, obtaining a relic may cost you more than just gold...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":4000,"name":"Remember Me","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/569/569ea25d2b56bd05c7fa309ddabe81ff.jpg","description":"In 2082 memories and influence on people’s behaviour are just goods for sale, and \"personal life\" or \"unique biography\" are vestiges. Nilin, the heroine, can penetrate into the memory of people, she changes the past on which people base their actions in the present. Once she is subjected to a complete erasure of memory. She has to start a battle for herself - for the self that she does not even remember.\nSetting, plot, design and lighting immediately evokes a masterpiece of cyberpunk - «Blade Runner». But the game is noticeably superior to the movie regarding «volume» of space, the sensation of «air» and «presence» in the game. There is an impression that you see the world of the game 360 ​​degrees around you. Mimicry and plastic of characters are directed in each detail, undoubtedly dramatic, give a full impression of a play of live actors. It seems that even the movements of inanimate objects are filled with the same expressiveness - for example, the trajectories of a thrown pistol or splinters ... High level of directing and corresponding levels of design and graphics. A mass of significant finds, filling every frame with emotion and senses.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9551,"name":"Deep Rock Galactic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c92/c9207a31f0eeb9904a840fc26eae6afb.jpg","description":"Closed AlphaWant to try the game - earlier than early access?\nhttp://www.deeprockgalactic.com/\nAbout the GameJoin a team of badass space dwarves and fight, dig and explore your way through enormous cave systems and uncover the greatest riches.\nDEEP ROCK GALACTIC is a first-person co-operative sci-fi shooter for up to 4 players, featuring fully procedural and destructible environments to explore, mine, and explode your way through to reach your objectives. As a team of veteran dwarven space miners, you must take on perilous missions for the interplanetary mining corporation DEEP ROCK GALACTIC and go where no-one else dares - into the deepest, most dangerous cave systems of the most hostile planet ever discovered.\nTEAMWORK ABOVE ALL - For efficient traversal and exploration as well as combat, you will need to rely on your teammates.\nA MATTER OF CLASS - Pick the right class for your play style - mow through enemies as the Gunner, scout ahead and light up the caves as the Navigator, chew through solid rock as the Driller, or support the team with defensive structures and turrets as the Engineer.\nCARVE YOUR OWN PATH - Fully destructible and procedurally generated environments means there is no set path - it is up to you how to reach your goal.\nTHE TOOLS THAT YOU NEED - A plethora of tools and gadgets at your disposal means no obstacle is insurmountable.\nINTO THE DARK - The only light is what you bring, and the pitch-black alien caves will not give their riches up easily.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ghost Ship Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":4032,"name":"Dragon's Dogma: Dark Arisen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/639/639ce7d7fecbb9f0717e9fbc1180f8f8.jpg","description":"Dragon's Dogma: Dark Arisen is an action-RPG from a third-person perspective. The story unfolds in a medieval world filled with magic, riddles and mysterious creatures.\n\nA dragon attacks the village in which the main character lives. Trying to protect his home, the character controlled by the player becomes a victim of a beast. The Dragon takes his heart and flies away to the vast unknown. The hero goes after him to discover the mysteries of the dragon and find out why he needs a human heart.\n\nThe open world of the game is available immediately after the introduction of the introductory mission. The player is invited to choose a character class and its gender. One of the innovations is the system of partners. As the game progresses, the main character will be joined by comrades-in-arms. Thanks to the size of the game world and its details, the game is often compared with The Elder Scrolls series, and for a dynamic battle system with Devil May Cry.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":10040,"name":"Stellaris","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92b/92bbf8a451e2742ab812a580546e593a.jpg","description":"Nova Edition\nStellaris Nova Edition includes:Digital Original SoundtrackThe Stellaris soundtrack delivers two and a half hours of original music, including bonus tracks and alternate versions not included in the game. Composed by Andreas Waldetoft with appearances by the Brandenburg State Orchestra and Mia Stegmar, listeners will hear themes meant to evoke discovery and far-reaching exploration through the vast expanse of space through the fusion of orchestral and electronic music. MP3 and lossless FLAC are included.Nova Forum IconShow your love for Stellaris on the Paradox Forums and other social networks.Exclusive Alien Race (Cosmetic DLC)Colonize the unknown and build a glorious spider empire! An exclusive alien race will be added to your game with a unique arachnid design. When your friends ask how you obtained these new spacefaring spiders, be sure to tell them you found the deal on the web.\nGalaxy Edition\nStellaris Galaxy Edition includes:Digital Original SoundtrackThe Stellaris soundtrack delivers two and a half hours of original music, including bonus tracks and alternate versions not included in the game. Composed by Andreas Waldetoft with appearances by the Brandenburg State Orchestra and Mia Stegmar, listeners will hear themes meant to evoke discovery and far-reaching exploration through the vast expanse of space through the fusion of orchestral and electronic music. MP3 and lossless FLAC are included.Exclusive Alien Race (Cosmetic DLC)Colonize the unknown and build a glorious spider empire! An exclusive alien race will be added to your game with a unique arachnid design. When your friends ask how you obtained these new spacefaring spiders, be sure to tell them you found the deal on the web.Digital Collectorís BookJoin the creative team behind Stellaris to learn how the game's aesthetic was designed and realized for Paradox's most visually unique game to date. From concept art all the way through full illustrations and 3D renderings, this exclusive 130-page  book includes a collection of game art unavailable anywhere else -- along with insight into the thoughts and research that drove these designs, the problems the team faced along the way, and the ways they finally brought these visuals to life.Stellaris: Infinite Frontiers novel by Steven Savile (ebook)From best-selling author Steven Savile comes an original novel based on the science-fiction setting of Paradox's Stellaris. When the Commonwealth of Man receives proof that they are not alone in the universe, humanity is divided: should our species seek salvation in potential friends among the stars, or prepare for an inevitable war? What discoveries await the colony ship as they journey into the unknown to find the source of a mysterious alien signal? Download and read on epub, mobi (Kindle) and PDF.Exclusive Avatar and Galaxy Forum IconShow your love for Stellaris on the Paradox Forums and other social networks.Signed WallpaperPay your respects to the pioneers who ventured forth into the unknown with this desktop wallpaper signed by the Stellaris development team.\nAbout the GameExplore a vast galaxy full of wonder! Paradox Development Studio, makers of the Crusader Kings and Europa Universalis series presents Stellaris, an evolution of the grand strategy genre with space exploration at its core.\nFeaturing deep strategic gameplay, a rich and enormously diverse selection of alien races and emergent storytelling, Stellaris has engaging challenging gameplay that rewards interstellar exploration as you traverse, discover, interact and learn more about the multitude of species you will encounter during your travels.\nEtch your name across the cosmos by forging a galactic empire; colonizing remote planets and integrating alien civilizations. Will you expand through war alone or walk the path of diplomacy to achieve your goals?Main FeaturesDeep & Varied Exploration.\nEnormous procedural galaxies, containing thousands of planets.\nExplore Anomalies with your heroic Scientist leaders.\nInfinitely varied races through customization and procedural generation.\nAdvanced Diplomacy system worthy of a Grand Strategy Game.\nShip Designer based on a vast array of technologies.\nStunning space visuals.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5687,"name":"The Playroom","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/363/36306deef81e7955a5d0f5c3b43fccee.jpg","description":"The Playroom is a collection of augmented reality games, requiring camera and VR gear to run. It consists of seven mini-games for up to five players: Mini Robots (a hub), Monster Escape, Cat & Mouse, Ghost House, Wanted!, Robot Rescue, and Toy Wars. In all these games players take control of tiny VR Bots. Players are offered to assume roles of robots, as the game follows their endless adventures including fights against gigantic monsters (in Monster Escape), the classic cat/mouse confrontation (in Cat & Mouse), and rescuing other robots stranded somewhere (in Robot Rescue). Mini Robots, as a central hub for all actions, is a VR toybox simulator, which is a home for VR Bots. Actually, the game is set as if robots lead their own living being periodically interrupted by players. Playing other games will give coins that can be spent on the in-game toys. As far as all the games are in the same ecosystem, progressing in the other six games will impact the upgrades of robots’ dwelling. Mini-games also feature the multiplayer mode for the game experience improvement.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":295,"name":"Oxenfree","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ba/7baf4663962bad7197e2470d59a6e322.jpg","description":"SUMMER 2016's HUGE CONTENT UPDATE: The most mind bending game of the year has new storylines, scenes, and endings, plus a multi-episode behind-the-scenes documentary.\n\"OXENFREE: The emotional adventure game you need to know about\" - IGN\n\"A mix of Freaks and Geeks, Poltergeist and the best teen films of the ’80s\" – Polygon\n\"Part teen drama, part terrifying ghost story\" – Kill Screen\nOxenfree is a supernatural thriller about a group of friends who unwittingly open a ghostly rift. Play as Alex, a bright, rebellious teenager who brings her new stepbrother Jonas to an overnight party on an old military island. The night takes a terrifying turn when you unwittingly open a ghostly gate spawned from the island’s cryptic past. How you deal with these events, your peers, and the ominous creatures you’ve unleashed is up to you.\nYOU determine every aspect of Alex's story while exploring Edwards Island, uncovering the base's dark past, and changing the course of your friends' lives.\nFeatures:\nAn intelligent conversation system that changes the story and your relationships based on every decision\nA unique radio mechanic that allows Alex to communicate with mysterious spectres and manipulate her world\nArt from Disney alum and an original soundtrack by scntfc (Sword & Sworcery, Galak-Z)\nMultiple mysteries to unravel, spanning decades and lifetimes\nInspired by little-known events of World War II\nFeaturing voice talent from The Wolf Among Us, The Walking Dead, Borderlands and more\nStarring:\nErin Yvette (The Wolf Among Us, Tales From the Borderlands)\nGavin Hammon (The Walking Dead, The Wolf Among Us, Tomb Raider)\nBritanni Johnson (Borderlands, Borderlands 2)\nMusic and Sound by scntfc","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Night School Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":3350,"name":"Broken Age","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ef/3eff92562640e452d3487c04ba6d7fae.jpg","description":"Broken Age is a classic point-and-click adventure game, which tells a story of two completely different teenagers seeking to change their life pace. The action takes place in an imaginary universe shown in a 2.5D perspective. The gameplay is divided into two main storylines, so players are able to assume the roles of both Vella Tartine and Shay Volta. The game allows switching characters at any time. Firstly, events move players to Sugar Bunting town occupied by fictional monsters called Mogs, which demand a sacrifice of young girls every 14 years. Once the protagonist Vella finds herself chosen to be the sacrificed maiden. As she tries to stay alive, she realizes that the only way out is to fight the monster and to liberate her hometown. The second story tells about Shay, a lone boy imprisoned in a spaceship between two AI systems. The boy seeks independence and starts to explore the entire ship then moving to the whole war-torn galaxy. Both storylines are not expected to connect somehow, but in the course of completion game levels, players start to notice similar slight details.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":259801,"name":"Final Fantasy VII","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d89/d89bd0cf4fcdc10820892980cbba0f49.jpg","description":"The world is under the control of Shinra, a corporation controlling the planet's life force as mako energy. In the city of Midgar, Cloud Strife, former member of Shinra's elite SOLDIER unit now turned mercenary lends his aid to the Avalanche resistance group, unaware of the epic consequences that await him.\n\nFINAL FANTASY VII REMAKE is a reimagining of the iconic original with unforgettable characters, a mind-blowing story, and epic battles.\nThe story of this first, standalone game in the FINAL FANTASY VII REMAKE project covers up to the party’s escape from Midgar, and goes deeper into the events occurring in Midgar than the original FINAL FANTASY VII.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":442855,"name":"Mafia II: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d73/d7364906c530ccc2d89b0b5d8695e03c.jpg","description":"Part two of the Mafia crime saga – 1940’s - 50’s Empire Bay, NY\nRemastered in stunning HD detail, live the life of a gangster during the Golden-era of organized crime. War hero Vito Scaletta becomes entangled with the mob in hopes of paying his father’s debts. Alongside his buddy Joe, Vito works to prove himself, climbing the family ladder with crimes of larger reward, status and consequence.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hangar 13","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9575,"name":"VRChat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/11f/11fd681c312c14644ab360888dba3486.jpg","description":"VRChat is a massive multiplayer online game which allows you to communicate with other players in virtual reality. In fact, it’s a social simulator focused on user-generated content: you create your own world, explore and develop it, meet guests and start relationships. The environment you create is only limited by your imagination.\n\nVRChat provides full body customizable avatars and emotes, emoji, and hand gestures for you to express your feelings. The game features multiple activities, such as Bowling, VR Karaoke and Capture a Flag matches. You can also explore the worlds created by other players and organize and participate in various social events, for example, start a dancing class or musical performance. The abilities are unlimited. VRChat works as a social network that allows you not only chat and share content but produce it in the form of realistic 3D models and take part in activities you maybe not have a chance to try in real life.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"VRChat","platforms":[{"id":0,"name":"PC"}]},{"id":19600,"name":"Far Cry 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89e/89e913f4ba5260cfb8b775667f81c23a.jpg","description":"Jump in the boots of a mercenary sent to an African country where the civil war breaks out. Your target is a notorious arms dealer that supplies both sides of the conflict. As the player arrives at the hotel, they pass out due to malaria. Waking up, you find your target standing over you, reading the mission briefing. The player is too weak to eliminate the arms dealer due to malaria-induced weakness. The Protagonist is left for dead by their target as shooting begins outside the hotel. Get out there, find the target and eliminate him.\n\nFar Cry 2 is the first game to feature an open world. It offers a large set of means of transportation. A day-night cycle is also featured. Far Cry 2 is a very realistic game featuring weapon degradation, dynamic weather, simulated fire, vegetation regeneration, the players even have to take out the physical map and GPS in order to find their way in the game world. \n\nA class-based multiplayer mode with up to 16 players is also featured.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":442854,"name":"Mafia: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/345/3452d9d4483686c602372e0e6b3bb4cc.jpg","description":"Part one of the Mafia crime saga - 1930s, Lost Heaven, IL\nRe-made from the ground up, rise through the ranks of the Mafia during the Prohibition era of organized crime. After a run-in with the mob, cab driver Tommy Angelo is thrust into a deadly underworld. Initially uneasy about falling in with the Salieri crime family, Tommy soon finds that the rewards are too big to ignore.\n\nPlay a Mob Movie:\nLive the life of a Prohibition-era gangster and rise through the ranks of the Mafia.\n\nLost Heaven, IL:\n\nRecreated 1930's cityscape, filled with interwar architecture, cars and culture to see, hear and interact with.\n\nRe-Made Classic:\nFaithfully recreated, with expanded story, gameplay and original score. This is the Mafia you remembered and much more.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hangar 13","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2100,"name":"Tales from the Borderlands: A Telltale Game Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/264/2642b17a7885f7abc4fd018e98943242.jpg","description":"The game is a continuation of the games Borderlands 1 and 2. But those games were fantastic shooters (Borderlands 1 - even with RPG elements), and this is a graphic adventure. The player controls two different characters: Fiona is a fraudster, and Reese is a programmer for Hyperion. Characters are found on the planet Pandora after the defeat of Handsome Jack. The story will show the common events of both characters in view of each of them.\nEach character has its own unique abilities. For example, Fiona can steal and use the money, and Reese with the help of an implant and a cybernetic hand knows how to crack electronic devices and scan various elements.\nThe game contains five episodes in which the player explores the outside world, communicates with non-player characters and interacts with the elements of the location, and also collects and uses various items. The choice and actions of the player in the initial episodes will affect the plot in later episodes. The game has a few shootouts too.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":7381,"name":"ABZU","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba9/ba9ad92b6d04825bd15a407c6059db94.jpg","description":"Abzu is a classic adventure game, the action of which unfolds in the endless ocean. The protagonist is a female diver, wakes up alone drifting on the ocean surface.\n\nThe main gameplay is aimed at exploring the surrounding world: the main character finds the ruins and traces of an ancient civilization that existed in symbiosis with the world's ocean. The outside world reacts to the player's actions and changes under his/her influence. However, it will not only be necessary to explore the underwater world: ground fragments also come into play in the game. Despite the simplicity and serenity of the game, there are dangers in the form of sea predators.\n\nThe story is told without a single word and the silence only helps to create a unique atmosphere of peace and tranquillity that reigns in the world of the game. The mosaic of the game setting is completed by the implementation of the game camera and the opportunity to look at the world through the eyes of fish - you need to enter the meditation mode for this.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Giant Squid","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3647,"name":"Child of Light","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c47/c4796c4c49e7e06ad328e07aa8944cdd.jpg","description":"A girl named Aurora is the daughter of the Duke of Austria, who recently married again. Aurora suffers from a physical ailment, because of which she sleeps a lot. Once upon awakening, the girl finds herself in the mythical world of Lemuria. The princess meets a firefly named Ignikulius, who leads Aurora to the Forest Fairy, who was captured in a stained-glass window. After liberation, the fairy tells that the dark Queen Umbra stole the sun and the moon of Lemuria.\r\nThe fairy gives Aurora a flute, stars and, together with them, the ability to fly. But the Aurora pursues her own goals. She seeks to return to her father, who became very ill after his daughter disappeared. After going through numerous adventures with many characters, faced face to face with her own nightmares and defeating them, Aurora defeats Umbra and becomes the new queen of Lemuria.\r\nYou can play not only for Aurora but also for her companion firefly - in multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":3290,"name":"PlanetSide 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fd/2fd1b58116b10cc1f4442bee5593ca7c.jpg","description":"Planetside 2 is a massive multiplayer first-person shooter with an emphasis on large-scale battles developed by Daybreak Game Company.\n\nAlthough considered as a continuation of the series, Planetside 2 is a re-imagining of the original game featuring the same world, factions and time period. The game revolves around territory control mechanics with large battles with up to 2000 players participating. Combat takes place on the continents of a fictional planet which are broken up into many territories. Control over these sectors grants bonuses to the faction in control. Teamwork and coordinated attacks are a necessity on the way to victory.\n\nThere are three factions present in the game: the Terran Republic, New Conglomerate, and Vanu Sovereignty. Each faction has its own unique visual style and playstyle. For example, the Republic relies on conventional ballistic weaponry while railguns and gauss rifles are widespread in the Conglomerate.\n\nPlanetside 2 features a freemium business model similar to League of Legends. While the game can be played for free, there is an in-game shop where players can buy new weapons, vehicles, and cosmetics for either real money or in-game currency.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5565,"name":"F.E.A.R. 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1da/1da9a7af524e81d257f972fbc06baefd.jpg","description":"The third game of the FEAR series of games. The general outline of the whole line of these games is the confrontation of special forces, to be more precise, a soldier named \"Operative\", and a squad of super-soldier clones who refused to obey their superiors. Rebellious clone soldiers are capable of even cannibalism, and other details of the setting correspond to this level of fear.\nProtagonists and antagonists have unusual abilities or conventional abilities, developed to an unusually high level. This is manifested, among other things, in the possession of ghostly forms, by which it is possible to mislead other people.\n\nThe game is strictly from the first person. A notable feature of the gameplay is the slow motion mode. In this mode, the player accelerates the perception to such an extent that it can see the flying bullets. This gives him obvious advantages. The slow motion mode, in the game, is explained by the increased content of adrenaline in the blood, which occurs in a person, in a situation that threatens life. If this condition is caused in a natural way, then it does not last long. It can be extended with the help of a special drug, which is included in the number of useful game stuff. Sometimes this mode is \"turned on\" during visions that visit the hero and act on him as much as the danger.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":894,"name":"Destiny","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/062/062420d85c7143f72ad3557f32c41ead.jpg","description":"Destiny is a first-person shooter featuring MMO-elements with much attention paid to online raids and shared-world mechanics. It is the first game in the series produced by Bungie — the studio is mostly known as the Halo series creator — and followed by Destiny 2, released three years afterward. The original title also has 4 DLC packs. \n\nThe game is centered around the Guardian — main playable character divided into three classes: Hunters. Warlocks and Titans, each with unique abilities. The main peculiarity is interfering in other's games. Nonetheless, unlike other MMOs, the game does not include communication with all of the server — just with the team that is matched for him or her. \n\nThe game emphasizes PvE and PvP types of play the first one being divided into strikes and raids, while the latter is the typical FPS multiplayer type. Strikes are the quests played by three characters with the boss in the end. Raids, on the other hand, are story-related, implement six players and also contain boss in the end.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bungie","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":5564,"name":"F.E.A.R. 2: Project Origin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1d/d1dd46e2ef7f8a1ee946d3ab779c3754.jpg","description":"F. E. A. R. 2: Project Origin is a first-person shooter with elements of horror, the sequel to the game F. E. A. R.\n\nThe game has an abundance of scenes of violence and anatomically detailed images of dead bodies, what makes the atmosphere oppressive.\n\nYou play as a Delta Force operator Michael Becket during your most common mission, which is gradually turning into a struggle for survival against the wrath of Alma. After the terrible power of Alma is out of control, your squad is forced to break through the apocalyptic wilds, defending their lives in parallel, as well as looking for a lot of clues about how to destroy it!\n\nMost of the gameplay the game borrows from the first game of the series. Now in the game, there is no possibility to look out from behind a corner on which replacement the system of shelters is entered (the player can use objects which surround him, for the creation of the essential shelters, for example, to turn a table or to open a car door). Also, there was an indicator of \"fatigue\" (if the scale is full, it will give the opportunity to make a short-term sprint).","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":23557,"name":"Gwent: The Witcher Card Game","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/742/7424c1f7d0a8da9ae29cd866f985698b.jpg","description":"Join in The Witcher universe’s favorite card game! In GWENT, you clash with your friends in fast-paced duels that combine bluffing, on-the-fly decision making and careful deck construction. \r\n\r\nPlay your cards right and manage a three-row battle formation as you unleash your hand over a best-of-three series of rounds. With heroes, spells and special abilities that dramatically turn the tide of battle, deception and clever tricks will be necessary parts of your arsenal.\r\n\r\nPick your side – command five different factions: the mighty Nilfgaardian Empire, proud Skellige, brutal Monsters, cunning Northern Realms, or shadowy Scoia’tael. \r\n\r\nBuild your deck – collect new cards and deploy armies full of versatile units, unique heroes and rule-flipping cards that summon fog to blind your opponent’s archers or call down dragon fire to destroy their strongest units. \r\n\r\nCraft new cards – break down unwanted cards and craft new ones to build an ever-evolving deck.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":17037,"name":"Monaco: What's Yours Is Mine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f4/4f4722571e32954af43a4508607c1748.jpg","description":"Monaco: What’s Yours Is Mine is a top-down stealth and action game, which provides players with both single and multiplayer experience. The main storyline is divided into four parts: the first three follow the characters, while the last one is played for the police side. To start another “big score” players have to select one of eight available characters. Each character has different skills and special abilities, so the squad should be appropriately chosen in advance. From the very beginning, players are able to assume the roles of four criminals: the Locksmith, the Cleaner, the Lookout, and the Pickpocket. The remaining four – the Mole, the Gentleman, the Redhead, and the Hacker – will be unlocked during the further game progress. The gameplay is about completing levels in multiple ways depending on the players’ character choice. Monaco: What’s Yours Is Mine gives an opportunity to dive into the crime world and participate in heists and robberies throughout the world alone or in co-operation up to four players.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Pocketwatch Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":23587,"name":"Sonic Mania","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbf/bbf8d74ab64440ad76294cff2f4d9cfa.jpg","description":"Experience the ultimate celebration of past and future in Sonic Mania, an all-new 2D Sonic adventure running at a crisp 60FPS with stunning HD retro-style graphics. Multiple playable characters give you the ability to go explosively fast as Sonic, soar as Tails, or power through tough obstacles with Knuckles’ brute strength. You can re-live the Sonic of the past with an exciting new twist on classic zones while fighting against new bosses and Dr. Eggman’s evil robot army. Go head to-head with players in Competition Mode or play in Co-Op Mode with a friend. Sonic Mania was developed by Christian Whitehead, Headcannon, and PagodaWest Games in collaboration with Sonic Team. Welcome to Sonic Mania!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":685577,"name":"Vampire Survivors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/501/501e7019925a3c692bf1c8062f07abe6.jpg","description":"Vampire Survivors is currently a time survival game with minimalistic gameplay and roguelite elements.\nThere's no place where to hide, all you can do is try to survive a cursed night and get as much gold as possible for the next survivor, before Death inevitably puts an end to your struggles.\nContent in the early access version:7 characters\n22 weapons and 12 power-ups\n10 pickups\n23 achievements\n1 stage\nSupports mouse, keyboard, controller, and touch screen.\nStarting tips:Take your time to grab gems and items, they won't disappear.\nGet just two or three offensive weapons, but focus on leveling them up one at a time.\nArmor and Luck are good starting power-ups to spend money on.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"poncle","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Web"}]},{"id":4882,"name":"Lara Croft and the Guardian of Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a92/a92272ea5cfc35b8ad6317fbd81ce0f6.jpg","description":"Lara Croft and the Guardian of Light is an action adventure game developed by Crystal Dynamics. The title serves as a spin-off to Tomb Raider series and is not connected to the series storyline whatsoever.\n\nTwo thousand years ago there was a battle between the Guardian of Light and the Keeper of Darkness. The Keeper won using the Mirror of Smoke with which he summoned a horde of horrible monsters, but the Guardian survived the encounter and imprisoned the Keeper in his own mirror. Fast-forward to the present day. Lara Croft finds the legendary mirror, but she does not know what evil it contains. \n\nThe game puts a strong emphasis on cooperative play, yet it is possible to complete the game alone. While the previous installments in the series featured an action third-person camera, Guardian of Light is using a fixed isometric camera. The players can choose to play either as the Guardian himself or as Lara Croft with each character having their own abilities.\n\nPuzzles differ when played alone or in co-op mode. This was done in order to make the players rely less on AI.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":6879,"name":"The Flame in the Flood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/87a/87a29bcc56b6b6082ead1dd5e2510aaa.jpg","description":"The Flame in the Flood is a roguelike survival game developed by The Molasses Flood.\n\nThe players objective is to survive the long river journey through the post-societal America. In order to survive, it is crucial to scavenge resources, look for food, find shelter, mend your boat and take care of your health. \n\nThe players have a certain time limit as they have to advance further the river before the rains catch up with them. \n\nThe game features a crafting system, hence why it is important to look for various objects in the game world. A complicated wound treatment system is also present in the game as players have to know how to treat a snake bite or hypothermia. \n\nThe developers put a strong emphasis on procedural generation used in the game. Anything from the river itself to every AI encounter is generated on-the-go. Fear, hunger, and aggression affect the NPCs behavior.\n\nResembling a roguelike genre, the death in-game is permanent to some degree. You will have to start from the head of the river but you are able to save some of your items using your faithful dog.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Molasses Flood","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":13820,"name":"The Elder Scrolls III: Morrowind","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ccf/ccf26f6e3d553a04f0033a8107a521b8.jpg","description":"The Elder Scrolls III: Morrowind® Game of the Year Edition includes Morrowind plus all of the content from the Bloodmoon and Tribunal expansions. The original Mod Construction Set is not included in this package.\r\n\r\nAn epic, open-ended single-player RPG, Morrowind allows you to create and play any kind of character imaginable. You can choose to follow the main storyline and find the source of the evil blight that plagues the land, or set off on your own to explore strange locations and develop your character based on their actions throughout the game. Featuring stunning 3D graphics, open-ended gameplay, and an incredible level of detail and interactivity, Morrowind offers a gameplay experience like no other.\r\n\r\nIn Tribunal, you journey to the capital city of Morrowind, called Mournhold, to meet the other two god-kings of Morrowind, Almalexia and Sotha Sil. Your journey will lead you to the Clockwork City of Sotha Sil and massive, epic-sized dungeons, where strange and deadly creatures await you, including goblins, lich lords, and the mysterious Fabricants.\r\n\r\nBloodmoon takes you to the frozen Island of Solstheim where you'll experience snow, blizzards, and new creatures, including frost trolls, ice minions, and wolves... just to name a few. You'll have a choice of stories to follow and have the opportunity to defend the colony, take control over how the colony is built up, and eliminate the werewolves. Or, you can decide to join the werewolves and become one of them, opening up a whole new style of gameplay.\r\n\r\n**Key features:**\r\n\r\n* Players can take their existing Morrowind characters and save games and continue their adventures in the Morrowind GotY edition\r\n* Adds up to 80 hours of new gameplay and quests for current Morrowind players\r\n* Explore the forests, caves, and snow-covered wastelands of the island of Solstheim\r\n* Delve into new, epic-sized dungeons and visit the Capital City of Mournhold and the Clockwork City of Sotha Sil\r\n* Fight new creatures including bears and wolves, lich lords and goblins, ice minions and spriggans\r\n* Direct the construction of a mining colony and face the threat of savage werewolves\r\n* Become a werewolf and indulge your thirst for the hunt\r\n* New armor and weapons including Nordic Mail and Ice blades","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]}]