[{"id":22371,"name":"Pizza Connection 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/654/65457694285fbcd44708250be5b0a6b8.jpg","description":"It's your empire... Take control!\nThe game has it all! the depth of gameplay will have you on the edge of your seat for hours on-end. Build, manage, strategize and conquer the competition with the richest gameplay tycoon product ever offered!\nAre you up to the challenge of becoming the Pizza Tycoon of the world? Get started today and find out!\nThe decisions are many, choose carefully:\n- which recipes?\n- which location?\n- staffing requirements?\n- strategic advertising?\n- mob control?\n- sabotage competitors\n- customize restaurant mood?\n- pricing options?\nThey all make a difference in the ultimate success of your franchise but watch out, there is evil lurking around every corner and these gangsters want a piece of the pie with shady deals and they aren't afraid to use blackmail!\n- Exciting to play, but very difficult to master!\n- 1000s of strategic choices will determine your success or failure!\n- In-game players speak the language of the country they are in!\n- Employ guards and police to keep the mob at bay!\n- 1000s of unique situations specific to each location\n- Hire employees and customize your restaurant and take the pizza world by storm!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":21471,"name":"Psichodelya","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eee/eee3751194cd0dcb026ca0835e5bdebc.jpg","description":"Psichodelya pays homage to old-school style top-down shmups (shoot-em-up’s) such as DoDonPachi, Ikaruga, Espgaluda, R-Type Delta, Aero Fighters, Giga Wing, Raiden, and more recent Jamestown.\nPlayers control one of 3 playable ships - dodging bullets and destroying wave after wave of enemies for points in either single or 2 player local coop modes.  There are 5 manic levels, each with an epic boss and 5 difficulty levels.\nSet in futuristic environment, two races of mechanized alien species wage air-warfare over Earth-like pieces of land.  Each ship has a coloured shield that protects the player from bullets that are the same colour.  Enemy ships are also colour coded, making them more vulnerable to player shots of colour opposite to their colour.Features:Easy to pick up and play, difficult to master\n5 huge levels each with huge epic bosses\n1 and 2 players co-op\nControls for 2 players on Keyboard or Gamepads\nIn-game leatherboards: local and global\nOn-line leaderboards\nNo two play-throughs are identical\nMusic by Dylan Barry (NPPD Rush, Super Killer Hornet: Ressurection)\n5 difficulty levels","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ennoble Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18014,"name":"Flight of the Icarus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f60/f605aad88f4a33b9edb84efa9ed77cd7.jpg","description":"Flight of the Icarus is a game where you play as a privateer who owns an airship that helps ferry goods from town to town in a post-apocalyptic world where the skies are dominated by pirates and danger.  Shoot down enemy aeroplanes with a variety of deadly weaponry.  Keep the ship from falling out the sky.  Make sure the cargo reaches its destination.  Made by 4 people in 6 months, Flight of the Icarus is the humble beginnings of the premier airship-to-airship combat game Guns of Icarus Online.\n\nKey features:\nUnlock the Fallen Hero Cap in Guns of Icarus Online when you purchase this game!\nFrantic blend of turret shooting from the deck of your airship, with repair time management mechanics to keep the ship afloat\n18 Epic Levels & 8 Powerful Guns\n4 Enemy Types (Duster, Gunship, and Pirate Ace aeroplanes, and Airship)\nExtra ‘Into the Breach’ Survival Mode\nTime of Day & Weather Effects","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Muse Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17918,"name":"Hustle Cat","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2f/f2f8b2efbf1c46a325d0595d194f32fb.jpg","description":"A Cat Cafe With a Little Secret\nYou are Avery Grey, the newest employee at a popular cat cafe called A Cat's Paw. The coffee's good and the staff is friendly (and kinda cute!) but mysterious. One day, you find a strange book in the basement, with letters you can't quite read...Meet Your New Best Friends\nYou'll work hard at A Cat's Paw, but there's still time to get to know your new coworkers! Who's your favorite? The brusque, but devoted cook Mason? Or maybe Reese, the fashion-obsessed waiter who knows more than he says? And there's always your strange-eyed boss, the enigmatic Graves.Brought to You By\nKasey Van Hise: Creator/Writer\nLindsay Woods: Creator/Art Director\nSamm Neiland: Music\nAudra Furuichi: Artist\nJenn Doyle: Artist\nConrad Kreyling: Technical Lead\nJo Fu: Product Manager","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Date Nighto","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15518,"name":"Japanese School Life","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f5/9f564cfd6bd582c314491292694191bc.jpg","description":"Welcomed by the fluttering of cherry blossom, the main character, Brian, starts a new high school life in Japan. Brian soon starts to get along with two girls in the same class after they start to talk to him.\nWith their help, Brian gradually learns Japanese culture and customs.\nHe deepens his friendships with each girl as they teach him how to study and spend time together after school.\nHe gradually is able to survive through the commuter rush, May sickness, the rainy season, and more as he experiences Japanese culture for the first time.\nSummer\nAfter a particularly unpleasant rainy season, summer vacation starts at last.\nBrian gets to experience a lot of fun things, including a beach trip with the girls in their swimsuits and summer festivals in yukata. He also experiences popular Japanese summer activities, such as suikawari (watermelon splitting) and summer festival food stalls.\nAnd what he looks forward to more than anything is the most popular otaku event in the world, held twice a year– Comic Market. He goes to the venue with his heart racing with excitement, having long dreamt of experiencing his first Comiket.\nWhat he sees there is……a battlefield, just as rumored!?\nFall\nThe destination of the annual school trip is Japan’s most famous ancient city, Kyoto. The three enjoy sightseeing among the old streets and alleys, and experience the traditional culture of Japan to the fullest.\nBack at school, Brian gets to experience an actual cultural festival, which he has seen a lot in anime. He is ecstatic when he gets to help run the maid cafe booth.\nHe also enjoys cosplaying for Halloween, which has rapidly developed in Japan in the last few years. With the beautiful colors of autumn in Japan, he deepens his understanding of Japanese culture further.\nWinter\nAfter experiencing a Japanese-style Christmas party, Winter Comic Market has arrived! This time, he doesn’t just go, but actually participates as a circle!?\nWith the coming of the new year, he goes to experience Hatsumode.\nSetsubun and Valentine’s Day arrive and makes him start to realize that soon it will be time to say good bye.\nJust like when he first met her, cherry blossom buds are about to bloom.\nWhat enters Brian’s mind is her smile.\nAlong with those parting words, he embraces a new resolve…\nFeatures:\n-See the characters come to life through the power of the e-mote system!\n-In-game text available in both English and Japanese\n-An in-game accessible tips glossary with Japanese cultural and otaku terminology to enhance your game experience\n-Nekomimi Mode! because everything is better with cat ears.\nVoice Cast:\n-Honda Chiyoko (CV: Taneda Risa)\n-Suzuki Arisa (CV: Takada Hatsumi)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"code:jp","platforms":[{"id":0,"name":"PC"}]},{"id":14674,"name":"Oh My Gore!","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e93/e93b0c2606da1535263a8436013afe31.jpg","description":"News from Hell\nAbout the Game\nYou’re tired of keep fighting against the Powers of Light from within square shaped, piddling Dungeons?\nYou never really understood why you should make the effort to run after your stupid minions while being a mighty, powerful Overlord?\nYou want to be more than just a third-class theme park for obsolete do-gooders and self-proclaimed Knights of Justice?\nWelcome to “Oh My Gore!”, the alternative in the subgenre of Evil-Overlord-Simulations!\nIn this mixture of Tower Defense, RTS and Reverse Tower Defense, you’re taking control of the revived God of War Raelius and pursue a path full of sweet revenge and bloody footprints.\nCommand your inferior servants who will bring death and ruin to your enemies with their evil forces and powerful spells. Build up your Towers of Defense to hold against the “Heroes” of Light and send out your swarm of deadly henchmen at the same time to conquer and enslave the whole empire of Eridia.\nA campaign with 20 unique levels in 3 challenging difficulties\n6 unique Heroes with different spells and their own elite units\nDetailed death animations which were made with the high-tech GoreCap technology.\nOver 9000 liters of blood!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"bumblebee.","platforms":[{"id":0,"name":"PC"}]},{"id":14300,"name":"Skeet: VR Target Shooting","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc7/dc76ff7d89c9f8d060b67e86938a81c6.jpg","description":"A Skeet shooting simulator for the HTC Vive. Play Skeet mode (with a proper range and rules), Trap mode (with arcade-style gameplay), or Quickdraw mode.\nLightgun games were a childhood staple. We wanted to recreate some of that fun in a true VR experience. Featuring three modes and three guns (Over Under, Side By Side, and Pump Action), and highscore tracking.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Flatbox Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14037,"name":"Marble Age","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c2/1c28a974c612fd0b05ddc3b894f40861.jpg","description":"Turn-based historical simulation strategy. Develop the Greek civilization from the small village to the great city-state when it will dominate the world!\nFEATURES\nDuring the 4000 years (from 3000 BC to 1000 AD), you will have to:\n• Raise the population\n• Invent technologies\n• Construct buildings\n• Trade goods\n• Explore world\n• Found new cities\n• Start and end wars with neighbors\n• Survive through the hundred real historical events.\nThe key to victory is choosing the right development priorities, allocating resources and managing the foreign policy. Mechanics of the game is a mix of old-school game designs.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Clarus Victoria","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":10974,"name":"8-Bit Commando","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/086/086bc83feec07eea4af9b94214eb60fa.jpg","description":"8-Bit Commando is a run and gun platformer with fast-paced action, a rocking soundtrack (from the chiptunes artist Ozzed), local multiplayer and explosions. The graphics will take you back to the classic age of gaming and the gameplay is bound to challenge even the most seasoned vets.\nFeatures\n7 stages of intense action\nLocal coop and versus mode\nBeautiful retro graphics\nOnline hiscore\nRocking chiptunes soundtrack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"2DEngine","platforms":[{"id":0,"name":"PC"}]},{"id":10601,"name":"Luke Sidewalker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/643/643d0bf0fc5d41bc7b79135ccd397d36.jpg","description":"In a city that never sleeps, one man has a lot of places to be.\nDeadass, my man Luke has places TO BE! Luke is so ambitious, he doesn't even look before crossing the street. Luke is a New Yorker, and New Yorkers always have somewhere to be. Guide a hurried Luke through the chaotic sidewalks of NYC, across 7 familiar neighborhoods including Times Square, Central Park, and LES. Eyy I'm walkin here!\nBravely navigate the streets of New York as you majestically weave through a city festering with tourists, hipsters on fixies, little dogs, and the dreaded pigeon. Dodge traffic, catch the L train, avoid those hipsters, and complete your arduous task so you can desperately cling to your distanced girlfriend! Even try to catch an L train from Union Square during rush hour.\nYou better be smart! Walking around New York can be a challenge even for a brilliant tesseract of knowledge such as yourself. While avoiding obstacles, you must to also multi-task and solve puzzles. What are you signing up for?! Outsmart hot-dog stands, evade angry bouncers, avoid signing up for green peace, dodge projectile newborns, and more! But don't worry, even though you cannot run forever, you can collect coffee and dim-sum from the gum-spotted streets themselves to give you a short boost. Use subway vents to fly over the huddled masses, and twice per level, give a loud \"Excuse me!\" to disperse a particularly dense crowd.\nTons of New York City related trading cards to find and achievements to unlock!\nFeaturing totally unique unGooglable music and a 4:3 resolution. This is one game you don't want to miss.\n“a mundane nightmare familiar to all eight million New Yorkers.”\n- Game of the Year, Geek.com 2017\n\"10/10 would dodge babies again.\"\n- Random comment 2016\n\"That's nice dear.\"\n- Mom 2016\n\"I'm just gonna go out and get a pack of cigarettes.\"\n- Dad 1998","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Giant Fox","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9956,"name":"Bibou","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/558/558fe91b22a1d42e45da42b1969f8525.jpg","description":"The evil cocus have invaded Bibou's island. The island was a peaceful home for him and his family.\nThe cocus and their leader want the Yellow Stones, which are scattered around the land.\nBibou must explore each area of the island and collect these stones before they fall into the hands of the cocus.\nSelect and explore the different areas of the island.\nYou can play minigame for make points or win lives in the case you have few.\nChoose the difficulty and cool effects at any time in the stage selection screen.\nThat way you can choose the stage, difficulty and cool effect of way you want.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"André Bertaglia","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9572,"name":"Cosmic Trip","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d8/3d843e9c3412bfb4ca500e374c325f06.jpg","description":"Digital Deluxe Edition\nThe Digital Deluxe edition includes the following:\nCosmic Trip\n50+ Page Art Book\nOfficial Soundtrack\nAbout the GameYou’ve been deployed on an alien planet full of hostile enemies. You must defend yourself by building and commanding an army of cosmo bots to gather resources and destroy the opposition.\nBuilt from the ground up for VR, Cosmic Trip lets you experience real-time strategy like never before. Feel what it’s like to destroy alien enemies using futuristic weapons. Strategically build swarms of badass robots to defend yourself and gather materials.\nFEATURES\nIntuitive VR-Native Controls\nNo more sitting and clicking! Cosmic Trip places you in the center of the action with some of the most intuitive controls found in a VR game to date.\nStunning Visuals\nNominated for best art direction at the 2016 Proto Awards and best visual design at the 2016 VR Core awards, Cosmic Trip features color-rich alien worlds and beautiful environments.\nTrue Real-Time Strategy in VR\nCosmic Trip features a full no-compromises real-time strategy mode, built natively for VR with help from our Early Access community. Feel what it’s like to blast away enemies with your turret, listen to groovy tunes provided to you by your pal, friend bot and watch as your army of robots gather resources and destroy alien forces right in front of your face!\nMAJOR FEATURES ADDED SINCE EARLY ACCESS LAUNCH:\nNew Game Modes: 3 New game modes have been added since launching to early access (including the fully featured strategy mode!)\nNew Environments: The starting planet has been greatly expanded and 4 all-new areas have been added, including the new Cave and Waterfall areas.\nNew Bots: The bot family has grown since launch, now with a variety of attack types and a Medic to keep everyone in good shape.\nNew Weapons: Many new futuristic weapons have been added, including the Bubble gun, Plasma shield,  and grenade weapon.\nOculus Touch Support: Full Oculus Touch support with in-game model of touch controllers for Rift version.\nTwitch Mode: Join in from chat while watching a live stream. Spawn items to help, or enemies to hinder the player.\nOther Additions: Added home spaceship, added Leaderboard, added Minimap and much more...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Funktronic Labs","platforms":[{"id":0,"name":"PC"}]},{"id":4225,"name":"Zero Escape: Virtue's Last Reward","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a3/1a362e6f238f56574c9acfe7980a8ab3.jpg","description":"Zero Escape: Virtue's Last Reward is a suspense-driven visual novel/puzzle game and spiritual sequel to the hit, 999. Zero has kidnapped nine people and placed them in a warehouse to play the deadly Nonary Game. These seemingly nine strangers have bracelets that will kill them if they don’t play the game correctly. However, how can they trust each other, and do some have ulterior motives? Play as Sigma and decide who to trust and who to betray in this plot twisting visual novel!  Who is Zero, why has Sigma been brought here and who exactly are the others? With fully voiced dual language support, mind-bending puzzles and more, solve the mystery that is Zero!\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\n5000KB Minimum\nTouchscreen\nMotion Sensor\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© Spike Chunsoft Co., Ltd. All Rights Reserved. Licensed to and published by Aksys Games.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Aksys Games","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"}]},{"id":622517,"name":"Dark Deity","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d55/d555efdbe7036919220e1007519c87f0.jpg","description":"Command legendary heroes to reshape a land fractured by broken oaths, reckless wars, and secret arcane powers. Claim ancient artifacts and powerful weapons to empower your cast of 30 voiced, playable characters as they form bonds and battle their way to become legends.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sword & Axe","platforms":[{"id":0,"name":"PC"}]},{"id":387334,"name":"Faith: The Unholy Trinity","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/242/242caa9d132f80fd84eee19d2637a3f7.jpg","description":"On September 21, 1986, two priests arrived at the Martin Family home in rural Connecticut to investigate an apparent case of demonic possession. Only two people would leave the house alive.\nFAITH is a pixel horror game inspired by the era of classic 8-bit gaming and the \"Satanic Scare\" of the 1980s. Use your holy crucifix to perform exorcisms, fight back against possessed cultists, and cleanse haunted objects. Discover a world of dread, isolation, and mystery as you explore haunted forests, abandoned churches, and the inner sanctums of a Satanic cult.✞ EXPERIENCE ALL 3 CHAPTERS OF THE UNHOLY TRINITY ✞ FAITH - Haunted by nightmares and searching for answers, a young priest returns to the house where an exorcism went horribly wrong a year before.\nFAITH: Chapter II - After confronting unspeakable paranormal entities and narrowly escaping with his life, a young priest descends into a new nightmare.\nFAITH: Chapter III - Aided by a mysterious stranger, a young priest travels the dark countryside to stop a Satanic cult from summoning a horrifically powerful demon.✞ HORROR THE OLD-SCHOOL WAY ✞ Wickedly chunky pixels\nHand crafted rotoscope animations\nHaunting retro soundtrack\nMultiple/secret endings\n1980s religious paranoia\nDemonic EVPs channeled through abandonware speech synthesizers","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Airdorf","platforms":[{"id":0,"name":"PC"}]},{"id":46742,"name":"The 25th Ward: The Silver Case","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e1/5e107b3a265667b6b7bc865dc64be7cb.jpg","description":"Return to the city of Kanto in The 25th Ward: The Silver Case with a new government project behind the city’s utopian 25th ward. When multiple supposed suicides in the Bayside Tower Land apartment complex threaten to disrupt the ward’s order, you will be called upon to dispose of the criminals responsible for the cryptic deaths. Experience this story from three different perspectives to piece this grim puzzle together.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":25548,"name":"Madden NFL 09","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/712/712c08689bfb07c6ba7b92ee69a88183.jpg","description":"Celebrating 20 Years of Innovation, Madden NFL 09 delivers its most fun\nand exciting football package ever for the DS, combining Wi-Fi\nmultiplayer games and Rec Room mini-games with all-new EA SPORTS Family\nPlay, featuring an easy-to-use game control system.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts Tiburon","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":23746,"name":"Fire Emblem Echoes: Shadows of Valentia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92e/92e5b4cfad8f83c4e37893fcf314221e.jpg","description":"In a continent that was torn asunder by warring gods, guide two armies \n      through brutal tactical battles—as this reimagined RPG epic invades the \n      West! Uncover the intertwining stories of Alm and Celica, engage foes, \n      fend off dragons, and explore 3D dungeons. Your prowess will grow as you \n      master this melding of modern and legacy Fire Emblem™ gameplay.\n    \n      Alm and Celica lead separate armies united by a common goal: to stop the \n      war and unify Valentia. Each army has its own path, units, and supplies, \n      so balance their needs. Here, battle is waged in the traditions of elder \n      Fire Emblem™ games, when the rules of battle were simpler, yet the \n      challenge formidable as ever. When you encounter a dungeon, explore it \n      in action-adventure style: smash false walls, break pots, or ambush \n      enemies with a slash of your sword. You never know; you may stumble upon \n      some uncommon items…or a hidden tactical battle with a brutal boss.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"8-4","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21598,"name":"Spelunx and the Caves of Mr. Seudo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93c/93cf579d0919f60ce2038fb1b7f6c95c.jpg","description":"Professor Spelunx and Mr. Seudo are studying Planet X, a place full of mystery and adventure. There's a surprise around every turn, a huge world to explore and dozens of mini-games to enjoy. Spelunx and the Caves of Mr. Seudo is an educational title for elementary and middle school kids, but the learning is so cleverly hidden in the enchanting gameplay that even adults will find something to enjoy in this early gem from the creators of Myst.\nSpelunx is an educational game cleverly disguised as an exploration in a cave. The cave contains many toys, games, and activities that are fun to play with but also happen to teach principles of math, biology, physics, etc.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":20136,"name":"The Music Machine","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/342/342ffaa97cbd0ceab68eb6a234344eb0.jpg","description":"Haley, an eccentric 13 year old girl, has a complicated relationship with her old friend Quintin. He's a ghost now, and he's puppeting her body with the intent of finding a satisfactory way of killing her. This dubious quest has led them to a mysterious abandoned island, where several people were recently murdered.  And where, among the rotting cabins and dense trees, a strange new building hides a bizarre secret...\n\"He met a man an eyeless man a toothless man and he looked at the man and the man looked at him and he saw that the man was beloved and dearest of friends and the man spoke to him 'how long since you've tasted bone marrow' and he told him he told him truthfully and the man said 'come' and he came with the man and they vomited pure cold clean water into the endless eternal infinite sea and then, the end.\"\nFEATURES\nBlend of non-linear exploration, puzzle solving, and narrative, similar to The Vanishing of Ethan CarterHorror based on an atmosphere and story rather than jumpscares or chase scenesThis is not a Unity Asset Store collection.  Modeling, music, environments, and programming were done from scratch.  Sound effects were manufactured from creative commons samples.Rich storyline that stands on its own, but also expands on the plot of The Moon SliverStylish monochromatic visual style that enhances the feeling of mystery and uneaseAtmospheric original soundtrack (which can be purchased as DLC, or purchased here)A short but satisfying narrative experience that can be completed in one sitting","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"}]},{"id":18659,"name":"Pilot Crusader","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccb/ccbabcfaaed7acc0497cd5438a0630a3.jpg","description":"Pilot Crusader is a retro shoot-em-up with a sleek 90's atmosphere, plenty of explosions, a bucketful of nostalgia, and a plethora of bullets.\nTake control of a powerful spaceship and wage war against alien invaders in Pilot Crusader! This game features classic space shoot-em-up mechanics, smooth, addictive gameplay, and polished visuals. Choose from several options of spacecraft that give you the options of slower ships with more bullets to quicker ships with fewer bullets.\nLove to fight bosses? This games got them! Fueled with powerful music, this game will satisfy.  It’s screen shaking, loud sound making fun with Pilot Crusader!!\nTake control of a powerful spaceship and wage war against alien invaders in Pilot Crusader! Featuring classic space shmup mechanics, smooth, addictive gameplay, and polished visuals,\nPilot Crusader will keep you entertained for hours while you watch enemy ships explode into flames!\nFeatures\nRuthlessly destroy enemy spacecraft\nUpgrade and train your arsenal\nHours of addictive shoot-em-up gameplay\nExplore the galaxy and annihilate your opponents\nPolished visuals and smooth gameplay","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"RadLabGaming","platforms":[{"id":0,"name":"PC"}]},{"id":18645,"name":"Minds Eyes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/083/08385d136af407764da8380c710c959b.jpg","description":"Minds Eyes brings you to a world of dreams. You wake up from your slumber to constantly discover you are still asleep. You venture throughout your own home as well as some pieces of your imagination to discover who or what is keeping you at sleep. Will you ever wake up? will you ever finish the journey?\nVenture through tense full moments of a chilling and nerve wrecking atmosphere that will keep you wondering \"When will something happen!\". Interact with the game and collect game objects which will overall affect your score in the end. Can you locate all game items?, can you make it without a single death? Check what the mind has in store.\nNOTE: This game is to be played with a single sitting. The estimated game time is 30-45min.\nThis game also includes flashing lights. If flashing lights affect any of your medical conditions, please avoid the game.\n**SO! what is Minds Eyes really? think of it as an experiment. I have developed Minds Eyes to experiment with new mechanics, features, animations, interactions, and more. Ultimately, I am using this game to gather information in order to build my ultimate horror experience. Think of it as research and development!. I will be watching a large portion of videos that you all send out to me, and note what was good and bad. With that said, If possible, please give me a full on review of the game. Tell me what you likes, disliked and/or would change. This will ultimately let me know what to, and what not to include in future projects.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stanislaw Truchowski","platforms":[{"id":0,"name":"PC"}]},{"id":16592,"name":"VERGE:Lost chapter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a70/a70f63c6fe7e4e3eb5e43d5b3600c8bf.jpg","description":"Our hero has decided to get away from the urban bustle and out into nature to relax. On his way to his cabin, while anticipating the amazing sunsets, fresh air, the tranquility of the mountains, a heavy rain began to fall. His car breaks down in the middle of nowhere, the cold torrential rain dashing any hope of getting the car moving again. He hadn’t seen another person in hours, and as far as he could recall, there was nothing around…but for an abandoned building. He approaches it, seeking shelter, but is it really abandoned?\nFeatures:\n-Multiple endings\n-High quality graphics\n-Tense atmosphere of fear\n-No cheap jump scares\n-High quality audio support.\n-Simple but enjoyable gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GDNomad","platforms":[{"id":0,"name":"PC"}]},{"id":16422,"name":"Necronomicon: The Dawning of Darkness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0f/c0f71d1737e3100e1b4531ab2396cb7d.jpg","description":"Enter the world of Necronomicon- where quiet scholar William H. Stanton is suddenly thrust into the dark and enigmatic world of the occult.\nThe year is 1927. Stanton is in the drawing room of his Providence, Rhode Island home when his childhood friend, Edgar, appears at his door.\nEdgar, seems distraught and delirious and gives Stanton a metallic pyramid, telling him not to give it to anyone- especially himself.\nStill reeling from Edgar’s appearance, Stanton is visited by a doctor who tells him that Edgar has lost his mind and must be institutionalized. William knows there is more to the story and decides to find Edgar, but on his way discovers a horrifying secret that threatens all of mankind.\nIn this thrilling point-and-click adventure based on the works of H.P Lovecraft, you’ll traverse the haunting world of Gothic New England, solving puzzles and acquiring information to help Stanton solve the mystery of the Necronomicon.\nCan you help Stanton save humanity as we know it?\nUpdates in this new version of Necronomicon\n18 inventory documents that you can access anytime\nGraphic and design bugs fixed\nMore helpful videos\nAdditional texts and in-game hints\nImproved sound design","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Cryo Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":16205,"name":"Codename: Rogue Fleet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b0/4b0428b108418ea1b101c91734b55d66.jpg","description":"Just UpdatedVersion 2.0 of Codename: Rogue Fleet come with completely revamped ships, new intuitive controls with keybinding profiles and more.\nAbout the GameCodename: Rogue Fleet is a multiplayer team-based game about spaceships combat. You can choose to play as huge capital ships, tiny fighters or anything in between. A match as a fighter pilot is packed with action as you leave the thinking to the player who choose bigger ships.\nA match of Rogue Fleet will pit two team of 12 players against each other. At the start of a match, players will choose their ship and with the help of their team, by managing the strengths and weaknesses of their respective ships, players will achieve victory by destroying all enemy ships.FeaturesDestructible turrets, missile launchers and ship's sub-systems.\n10 ships to choose from, with various strengths and weaknesses , split between 5 classes.\nRadically different gameplay when playing capital ship as opposed to fighters.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SionoiS","platforms":[{"id":0,"name":"PC"}]},{"id":15080,"name":"Hyperspace Invaders II: Pixel Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60c/60cbdddf9cd00bb62ffb6208f3a77ab3.jpg","description":"Hyperspace Invaders II: Pixel Edition is a hardcore, uncompromising vertical scrolling bullet hell/invader hell shooter (shmup) that doubles as a techno-based lightsynth, triggering bursts of funky invaders at the pulse of a relentless beat.\nHIII:PE also features an extra track/level by French flashcore artist HFK, pushing the engine to a gameplay tempo of 360BPM.\n- Hardcore, uncompromising vertical scrolling bullet hell/invader hell action.\n- Tempo-synced Gameplay (invader movement, bulletpatterns and more get triggered at the pulse of a beat)\n- Adaptive Difficulty (harder as you play better)\n- Generative Gameplay (never the same level twice)\n- Dominate the Steam Leaderboards and unlock all the Achievements!\n- Full Controller Support (+ Vibration)\n- An OST of 10 tracks by renowned artists in the world of electronic music, such as: Carl Finlow / Ronny Ragtroll / Karl Lihagen / Atomhead / Subjex / Zuvuya / Mergel / NoProblemCore / Psykovsky & Arcek / HFK and WK(ES).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Entity Medialab","platforms":[{"id":0,"name":"PC"}]},{"id":14477,"name":"Freddi Fish 2: The Case of the Haunted Schoolhouse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0c/b0ce32f782fbaf34d608b95b614febc8.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameSo who is haunting the schoolhouse, taking the toys and practically scaring the scales off all the guppies?\nGood thing super-sleuths Freddi Fish and Luther are on the case. Their plan: build a trap to capture and expose the phony ghost. To reach their goal the two friends need your child's help to find a few things-and the list of items changes every time they play. Kids will dive right in to direct this undersea mystery filled with old friends, new faces and a festive sing-along soundtrack.\nLike the real world, Freddi Fish's world changes every time you play.\nSearch through fascinating places like a submarine, a ship or Atlantis.\nOut of time? You can save the game and finish it later.\nTake breaks with Freddi Fish: play games like Crab Invaders, solve puzzles, draw pictures or just sing songs.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":11072,"name":"PIGMENTUM","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51a/51a0e1ca9991543cfdf7875820f0b23d.jpg","description":"PIGMENTUM - is a fast and simple geometric non-stop game with elements of minimalist . You have only one life and the ability to change the color of the main character.\n▃ The uniqueness of the game\n▃ 50+ hardcore levels\n▃ Check your color reaction","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kirill Gurman","platforms":[{"id":0,"name":"PC"}]},{"id":10392,"name":"MetaMorph","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28e/28e276ef4fb15d20e8421099b42ec7ac.jpg","description":"Metamorph is an independent work of basing on \"morph\".Wandering in the solitude of the forest,eveyone can change freely the original body shape so as to adapt to the environment,or inherit the racial talent in order to survive.\nFOREST Of SOLITUDEI entered into the forest,felt the generosity and sadness of life.\nThe sunshine is bright,I enjoy the cool air who under the tree.\nThe tiger roars in nearby,The wolves wander in the path.See the source of water and food consumed in the forest,I silently am willing to survive to the end in this game for the brave.\nThe environment is quiet and cruel.\n--- how long can you survive?\nDifferent forms of life, derived from the same source of life.\nWho am I?\nAnimal life?Mechanical life?Light-collecter life?\nThere is no comparison between the animal behavior and the divine thought.\nThere is no comparison between the law of the jungle and the common fate.\nWelcome to \"Metamorph\",here has the innovation of the origin of life forms - the soul world view to build,we together search for the meaning of existence and the value of life.CRAFT BACKGROUNDIn a parallel world without knowing,where over millions of years of evolution.Many animals had learned to walk uprightly,formed the world outlook and methodology to\ncreat their own racial civilization.These humans who had super intelligence through unique technology to changed their physical form,froming the animal form to\nlight-collecter form.\nIn the summer afternoon,TigerMan,WolfMan,LionMan,FoxMan,SnakeMan,FrogMan,EagleMan,and DoveMan go to the party together.These clever human take a group photo with having portraits of their ancestor,which starts the survival game called \"Metamorph\".\nExtraordinary genius can freely change the permutation and combination of light,so as to change their outward appearance to confuse opponents.Having unique talent,they can freely cross obstacles of ordinary construction.\nThis is a survival game to prove your brave heart,surviving to the end is the only winner.CRAFT CREATIVITYrendering effect of forest scene,obtaining changes of 24-hour light and shadow.\nracial reputation system for advanced performance.\nunique freely morph system,different forms have different ethnic talent and properties.\nvirtual intelligence system is based on humanity,any player's behavior will influence each other.\ninteresting equipment and property system.\nthe design of the stochastic system for a better ideal world.USER INTERFACE ROLE PORTRAITUSER INTERFACE TALENT DESIGN","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"FireFly Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9899,"name":"Aquanox Deep Descent","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee2/ee266b77b44ff50c0c9d855ce2cb6ee5.jpg","description":"Aquanox Deep Descent is a first person underwater vehicle shooter, in which players control a variety of customizable ships to engage in fierce battles in the dystopian deep sea world of Aqua.\r\nIn the near future the Earth's surface has become uninhabitable. What remains of humankind lives in former mining and research stations, deep below the surface of the sea. Born and raised in the only world we know, the loose network of underwater settlements, torn by the war for resources and dominance between various factions.\r\nTake control of a team of highly trained fighter pilots and experience an epic story in the dark world of Aquanox. Send your enemies down to Davy Jones's Locker with well-aimed torpedoes, mortars, mines and more. Explore the deepest corners of the oceans - mysterious, hazardous, uncharted.\r\nFight - Action-packed vehicle shooter combat that supports a wide variety of play styles\r\nCo-op - 4 player drop-in co-op, with four unique pilots who are all involved in the game story\r\nCustomize - Create your ship from an extensive range of ship pieces and various customization options\r\nExplore - Discover the deepest corners of the ocean\r\nRPG Elements - Mining, salvaging, trading and looting\r\nPVP - Classic multiplayer modes, including Deathmatch and Team Deathmatch Dogfighting\r\nThe Original Series\r\nAquanox Deep Descent is a re-imagining of both the gameplay and world of the original AquaNox-series. The Aquanox-series has its roots in the game Archimedean Dynasty (German: Schleichfahrt), released in 1996, which was followed by AquaNox in 2001 and AquaNox 2: Revelation in 2003.\r\nAll games are vehicle-based shooters set in a dystopian future where mankind has had to flee the surface and live in underwater stations in the oceans.\r\nThe AquaNox games were powered by the groundbreaking KRASS Engine that lead to the popular benchmark AquaMark.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Digital Arrow","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":9892,"name":"Asura","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/26a/26ab09853c080a20acb35692e708c0a5.jpg","description":"Asura is an indie, top-down, Hack 'n' Slash game set in a fantasy world inspired by the richness of Indian mythology. It features heavy rogue-like elements and a unique procedural skill tree which changes on every play-through.\nReincarnated as a demon, use your new-found powers and hatred to invade the 'Pancha Dvora'- the five fortresses of the Daeva empire. Embark on a journey to exact your vengeance against Hasirama - The God-King, Maharaja, and Slayer of Innocents.\nAsura is inspired by rogue-like genre and is brutally difficult but FAIR…\nNote: Asura is best experienced with a controller!\nProcedural Skill tree:\nCraft your Demon using a Skill tree which changes every time you die.\nAbsorb or Scavenge:\nAsura can either Absorb enemies for experience points or Scavenge their corpse for loot.\nUnique Combat system:\nEngage the enemies with a variety of Melee, Range, and Magic weapons. Melee attacks will deal reduced damage to range enemies, Magic enemies will resist spells, and the Stamina system will always require you to strategies and adapt during battle.\nUnique Loot:\nEvery item in Asura is unique by itself. Slash your enemies with Claw weapon or batter them with a Mighty Hammer. Shoot your enemies with your bow or ignite them with your Magic weapon. There are tons of loot to be discovered in Asura which synergies with your skills.\nBrutal Mechanics:\nWhen you get burnt, a random equipment will get destroyed from your inventory. When the enemies or traps poison you, you can't heal. When your health is low, it does not regenerate automatically. When you die, you don't get to save your progress.\nPerma-Death: Inspired by Rogue-like genre, on death you lose all progress.\nProcedurally Generated Skill Tree\nMold your character using the unique, procedurally-generated \"Shastra\" tree (with over 80 skills!) for near-infinite replayability.\nRandomly Generated Levels\nRampage through the \"Pancha Dvora\" - 5 randomly generated fortresses, each with its particular aesthetics, enemies, and challenges\nUnlock New Demon Characters\nUnlock 3 different Demon variants with unique alignments to each of the core Shastras. Maximize the return on your choices to surpass your previous personal best.\nUnique Weapons & Armour\nFind epic loot with each play through and adapt your play to make the most of what you’ve scavenged from the corpses of your enemies.\nEnemies Inspired by Indian myths\nBattle hordes of enemies, each with their unique characteristics and abilities, inspired from Indian Mythos!\nIndian Inspired Lore\nImmerse yourself in a fantasy setting based on Indian mythology and discover a whole new take on the battle between good and evil\nPerma-Death\nWhen you die, you start all over again from the very beginning with a new skill tree.\n(May contain spoilers)\nA procedurally generated skill tree which changes on every play through (82 skills)\n4 Enemy Races - Daeva, Naga, Vanara, and Hathira.\n12 Bosses.\n9 Champions.\n50 Unique enemies.\n41 Armors.\n82 Weapons.\n5 Randomly generated fortress.\n3 Unlockable Demon variants to enhance your customization options.\nFeatures a fantastical lore inspired by Indian Mythology.\nOgre Head Studio\nOgre Head Studio is two man indie game company by Zainuddeen Fahadh and Neeraj Kumar based in Hyderabad, India. We make games all about Hack, Slash & everything Epic!\nSupport\nFor any issues or feedback with the game, join our discord HERE!\nor contact us at support(at)ogrehead(dot)com","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Debuz","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9751,"name":"Narcosis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b07/b075422bbed5da271305c3c06cd43cf6.jpg","description":"Survival, horror at the sunless depths of the Pacific Ocean: Stranded on the seafloor with low light and few tools, an industrial diver takes desperate steps to surface before his oxygen — and sanity — give out.\nConceived as a student project, this first person survival story unfolds following an industrial catastrophe, from inside a half-ton, high-tech dive suit — a “walking coffin.\" Influenced and inspired by a growing appetite for unconventional horror and narrative-driven games, Narcosis is rooted in reality, but steeped in the surreal.\nFeatures:\nPressure Kills: High-stress situations accelerate oxygen intake, distorting sight, sound, space and time.\nHostile Waters: A knife, flashlight and flares are essential to surviving the nightmarish flora and fauna of the abyss.\nPhantom Narrative: The survivor’s account unfolds in inexplicable ways alongside the player’s journey.\nBeyond Good and Evil: No shadowy organizations or eldritch terrors at Narcosis’ dark heart,  only primal fears and human limits.\nTerror Verite: Primal fears — darkness, confinement and isolation — take on new levels of immersion when experienced in VR.\nAbout Honor Code:\nBased in France and California, Honor Code’s collective resume includes such games and series as Assassin’s Creed, Dance Central, Metal Gear Solid, Remember Me, Republique, The Silent Age, and Silent Hill.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Honor Code","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9591,"name":"Die Young","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff0/ff08f672723a5b23c49c61f6a3bc6435.jpg","description":"Kidnapped for no clear reason to a dazzling yet mysterious island on the Mediterranean Sea, a young girl has to find a way to escape. Armed with only her wits, agility, and the will to survive, she must make her getaway or Die Young.Die Young is an open world, dynamic exploration-survival experience presented in first-person perspective. You awaken, on a picturesque 12 sq km island in the Mediterranean, buried alive and left for dead. Starving and dehydrated, your struggle to survive is just about to begin. Jump, climb, take advantage of your athletic and parkour skills to survive the dangers and wildness of nature!SurviveWeakened by your ordeal, you must nourish your body to gain strength and above all stay hydrated. While it brings life and beauty to the island, the scorching summer sun is not your friend. Scavenge for food and water, gather herbs with medicinal properties, and stay alive.Equip and FightStripped of everything of value down to the shoes on your feet, you have to make a run for it. You have no chance of escaping relying on your wits alone. Search for items and combat equipment that can help you survive the nightmare.ExploreExplore the island and find out more about its enigmatic dwellers, ancient ruins, dark mines and caves. Uncover the awful truth behind the quiet, bucolic life of the island.EscapeThe ultimate goal is to find a way to escape from the island, in which the astonishing beauty of the natural landscape hides deadly threats and foes. Fighting your way out is hopeless. Run, jump, climb, and leave those who want you dead behind.BEFORE YOU BUY keep in mind that Die Young development is still in progress. There may be bugs and performance issues. You may even want to checkout some recent gameplay video to see if this game is your cup of tea:\nhttps://www.youtube.com/watch?v=xwnZmvETbSw\nhttps://www.youtube.com/watch?v=oRMz3kZLIb0\nhttps://www.youtube.com/watch?v=Q_9rJ-fR1zQ\nNerve-racking and brimming with suspense from the moment you press start, Die Young is an immersive thriller that will take you on an unforgettable dash for freedom and survival.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"IndieGala","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":816324,"name":"Cultic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bc4/bc4b59a5172e271115c4ab627f1dbd4b.jpg","description":"Death is only the beginning. Crawl from your grave and gear up to fight your way through the ranks of a mysterious and twisted cult. You, your guns, and your dynamite will have to shoot, slide, blast, duck, dodge, and maybe throw a gib or two to survive in this old-school-inspired shooter.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Jasozz Games","platforms":[{"id":0,"name":"PC"}]},{"id":548157,"name":"Garbage: Hobo Prophecy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdc/cdc699466c41a28eee1892a8b715c139.jpg","description":"Garbage: Hobo Prophecy is an extended demo/prologue for the \"Garbage\" game. It has all the game features of the game but the story is limited to first boss fight.\nGarbage is a fighting simulator game with management and building elements. Experience the struggle which a homeless man goes through in a humorous yet non-offensive manner. Primitive elements of contemporary life that we take for granted, such as staying warm, well-nourished, and hygienic, will become an issue.\nThis is an extended demo version of the full game Garbage https://store.steampowered.com/app/1253710/Garbage/\n\nExperience a chilling story through hand drawn comics that narrate the silliness of Garbage world. Don't experience any of the negative emotions while being sucked in by the Garbage.\nGarbage world features a grim city environment with Garbage visual effects and catchy music. Listen to unique sounding character voices that resemble no words but a weird hobo mumble.\n\nGarbage fights are automatic, all preparations are done before the fight. A unique system that explores the uncharted grounds of the simulation genre.\n\nChoose between hundreds of skills to build something of a masterpiece fighter. Combine techniques to build a team that works together.\nGame features an in depth construction system with many unique buildings and upgrades. Surviving with minimal garbage resources makes it a challenge. Build wisely and prioritize the necessities.\nTake care of your bums as if they were a Tamagochi - feed, shower, train them and much more. Hobos are unique creatures that require no special care to survive: they don't cry, they don't ask for any fancy pleasures.\nThe game is very similar to real life, it has a weather system. Day, night and even seasons. This amazing system can both positively and negatively influence the survival.\nGarbage world has an inventory system with hundreds of items. Items that you can equip, craft, consume and trade for garbage.\nEmploy bums to work at your camp. Those tireless workers that work for no pay are crucial to your survival.\n\nKids are vicious bosses for the homeless. But who would be our next generation of homeless if not kids? Children are not the only bosses that control Garbage world, in fact they are the weaklings.\nParticipate in organized events: legal and illegal. Join arenas for competitive fights. Influence story based on the path you choose.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Homebased","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":522990,"name":"Children of Silentown: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f99/f99694d8852d429bf6dcb925deb19533.jpg","description":"WISHLIST THE FULL GAME!!https://store.steampowered.com/app/1108000/Children_of_Silentown/\nAbout the Game\nDuring the day the forest is calm and peaceful.\nIt is during the night that you hear the roars...\n...of monsters.\nAccompany Lucy and her friends in this grim, beautifully hand-drawn adventure game by the creators of Little Briar Rose, in collaboration with studio Luna2.\nLucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play.\nPeople disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks.\nExplore Silentown in search of hints, but beware: do not enter the forest.\nA unique, unsettling 2D art style fitting for a mysterious, dark tale.\nMusic plays a crucial role, and learning how to sing will help Lucy in times of need.\nCombine items to obtain widely unexpected results!\nMany quirky characters (and animals!) to interact with. Be nice to them before they disappear.\nPlay minigames with the other children of the village!\nA very mean cat, programmed to mess with Lucy at any given chance.\nCurious, original puzzles: use a leash and a pair of shears to break in your mother’s best friend’s house, all in order to steal… a flower?!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Elf Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":518615,"name":"Gravewood High","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfe/cfeeb54b7420ce7ef06f4dcfb0d99326.jpg","description":"Alpha 2 Demo Avaliable!\nAbout the GameSeveral students have gone missing at Gravewood High but none of the adults seem to have noticed. The school is a trap and your task is to get out of it. But there are two problems. One, the building has turned into a deadly labyrinth that constantly shifts and changes. Two, you are being chased by the Teacher - a crazed overlord of this place.\nDynamic environment\nThe school’s layout changes every time you get caught and the interior can be destroyed by both the player and the Teacher, creating a tense and unique adventure.\nTricky opponent\nAs the game progresses, the Teacher transforms physically and develops new abilities, becoming smarter and much more dangerous.\nSimply hiding is not enough. In order to win, you must outwit the Teacher by finding and destroying objects that he holds dear or by luring him into traps.\nAn elaborate mystery spanning centuries\nThe game’s plot plunges you into the atmosphere of several iconic periods of history - from the wild 80s to the American Civil War.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"HeroCraft","platforms":[{"id":0,"name":"PC"}]},{"id":471020,"name":"Hello Neighbor 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d32/d32160f66590e4507e63d7ea672c5084.jpg","description":"Hello Neighbor 2 is a Stealth Horror Game where you’re being stalked by a mysterious creature as you try to track down Mr. Peterson (The Neighbor) who has disappeared after the events of the first game. Play against an advanced, self-learning AI that tracks and adapts to your every move.\n\nSelf-learning AI\nAI explores the environment and constantly seeks ways to ambush the player\nAI watches player navigation patterns and if these seem to be effective, will replicate them\nAI has a daily routine that gets disrupted by the player: sleeping, eating, cooking, and possibly going into the woods to dig up bags of non-bodies\nAI will use the same objects as the player, using them for the same purposes. If the player uses a fire extinguisher to get up top, so will the AI.\n\nOpen world\nExplore the Raven Brooks, there are no limitations and players can go anywhere from the beginning of the game. The AI protects its house when the player is trying to break in, and stalks the player when out in the open world.\nPlayers have their own stories. Narrative is emergent, depending on how players decide to play the game.\nThe world changes depending on your actions\n\nSandbox experience\nPlayers should find creative solutions to solve the puzzle by combining different items, terrain features and platforming skills\nMany in-game events are persistent and scheduled in random order, that gives a feeling of a living world. Players may examine each random in-game event to find a different outcome","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"tinyBuild","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":364954,"name":"Filament","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/348/348f01151f16b4c08a59aa3014381ae1.jpg","description":"Filament is a laid back, story-rich and fully narrated puzzle game centred around solving sets of cable-based puzzles whilst exploring a seemingly abandoned spaceship.\nBoard The Alabaster, one of The Filament Corporation’s flagship research vessels, and meet its one remaining crew member, Juniper, left alone, orbiting a mysterious planet.ExploreFreely explore the ship, solving over 300 challenging and varied puzzles. Approach them at your leisure, in (almost) any order you like.SolveAs you survey the ship and solve puzzles, you will be in constant contact with Juniper. Learn more about her, her crew, and what happened as she opens up to you.InvestigateSearch crew logs, messages, records, as well as personal items and knick-knacks found around the ship on your quest for the truth as to what has happened aboard The Alabaster. Learn who the crew were, and maybe in doing so, find out why they left.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Beard Envy","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":339957,"name":"Disintegration","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e6/1e607f3c2a5467478dd029cb879a7d9d.jpg","description":"Disintegration is a new sci-fi first-person shooter set in the near future on Earth where the only hope for human survival is through Integration, a process developed to preserve human brains in robotic armatures. You play as Romer Shoal, a former Gravcycle pilot in command of a small Integrated resistance still grasping onto fading memories of their human selves. With the domineering Rayonne forces set on eliminating the final remnants of human society, it’s up to Romer and his crew of Outlaws to fight back and reboot humanity. Pilot a variety of armed Gravcycles and command your crew on the ground by leveraging a variety of unique unit abilities and mastery of your own personal arsenal to dominate the battle.\nDisintegration features a thrilling single-player campaign and frenetic PvP multiplayer where pilots and their crews compete in three exciting game modes across a variety of maps.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"V1 Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]