[{"id":15749,"name":"Found","genre":"Adventure","price":0.0,"description":"“A dimly lit train cabin …\nswaying grassy plains …\nflickering fireflies …\na mighty dragon.”\nFound immerses you in a journey that has left early reviewers with an awe “eerily reminiscent of a Miyazaki film.” Fans of beautifully handcrafted worlds like Limbo and Journey may find VR’s worthiest heir, which melds a captivating realm with a narrative that unfolds in fragments of gradual discovery. Built in less than a month, this departure from traditional gameplay delivers the feels we’ve been dreaming of since VR landed.\nEnter Found, and you just might lose yourself…\nPlease comment or send any initial feedback as we plan to polish. Stay tuned for updates!\nWe would like to thank our incredible team below that made this all possible!\nCREDITS\nCreative Director: Priyam Parikh\nTechnical Director: Andrew Moran\nAnimator & CG Artist: Jake Stull\nProducer: Jewel Lim\nComposer: Niko Korolog\nDigital Strategist: Aaron Bales","imageUrl":"https://media.rawg.io/media/screenshots/859/8598924b1db9b5d3c8d77085e9a45909.jpg","releaseYear":2016,"developer":"Priyam Parikh","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15450,"name":"SickBrick","genre":"Action","price":0.0,"description":"SickBrick is an action-packed science fiction first-person-shooter (FPS) with vivid graphics and fast, frantic game play. Destroy hundreds of hostile robots with a wide variety of weapons on a strange alien planet.Features11 maps that take place on a strange alien world and a sprawling underground facility.\n5 devastating weapons. Blaster, Shotgun, Lightning Gun, Grenade Launcher, and the Shock Rifle.\n16 deadly robotic enemy types each with custom animations, sounds, and weapons.\nRetro synth wave soundtrack with 8 tracks.\nDesigned to run at 4k resolution @ 60 frames-per-second (FPS) to make full use of DirectX 11 capable hardware.\nPhysical based rendering for materials, meaning metal reacts to light as it would in real life.\nAdvanced tactical AI that can flank and dodge your attacks.","imageUrl":"https://media.rawg.io/media/screenshots/f6f/f6ff1ca32fa63b3af9f82707d2cd1e11.jpg","releaseYear":2015,"developer":"Fox","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13412,"name":"Out of Reach","genre":"Action","price":0.0,"description":"Area Control modeCompletely new game-changing mode available from 13 Feb 2017 on every official Standard and PvP server.The point is not only to survive, build and explore but also to take over territories, defend them and try to beat other clans by the end of each week!\nPlayers have to:join a clan or create one\ncustomize their flag and hang it on top of flag masts to conquer up to 12 territories\nmake use of received bonuses to gathering from each taken territory\ntake over opponents' areas by hanging the flag and gathering more points\nincrease flag points and influence over each territory by fighting other clans and destroying their properties\nfortify and protect borders of their territories\nuse siege weapons, boats and gliders to reach strategical positions, lead in a clan ranking and get new ranks and rewards\nUpcoming updatesCurrent Top 5 biggest add-ons requested by players that will come along with the next patches:\nIsland claiming! Released!\nOld stronghold\nWhen you really want to settle down and a big base is not enough, you may want to claim the island as yours. Look for abandoned fortifications and use it's masts to stick your clan's flag on top. The longer you own the spot, the longer it will take to depose you.\nOf course, owning certain areas means bonuses for every clan member, for instance faster gathering.\nImproved 6th sense! Released!\nAs a proper pirate you should be able to smell goods and treasures from a long distance.. or at least know where to find basic resources to survive. The 6th sense mode together with compass will let you do that to improve gameplay's dynamics.\n6th sense turned on/off\nFemale pirates! Released!\nStart over or just re-customize your character - this time as Miss Pirate. Use the creator to choose skin color, hair style, age and every single detail of the face.\nCustomization window\nGunpowder! Released!\nSince the pirate traders found out where your archipelago is, they won't stop on selling clothes and resources. Gunsmith is on his way to equip you with new kinds of long range weapon. Nonetheless, as you can see in the pic below, we still want to keep the gameplay balance and stick to the single-shot, flintlock pistols.\nPistols and cannons\nAlthough handguns are meant to serve the way bows and crossbows do, the medieval cannon will surely be too heavy to carry, that's why you can expect new means of transportation in the near future!\nBattle mode (Experimental)\nHere we need a brainstorm and your thoughts about it. Battle mode is dedicated for those who like fast-paced deathmatches. Right now we've got some sketches that can be framed in a few points:\n1. All the players start together in gliders during storm (some kind of an escape from sinking ships)\n2. There's a special island to land on\n3. The flood or tectonic events make the island sink slowly (and the level of surrounding water rises)\n4. Players need to search old pirate villages and shipwrecks to equip themselves, build shelters and fight to be the one who survives the longest\nAbout the Game\nThe one who said that a combination of thunder storms and sea rocks is the worst thing that can happen to sailors, clearly didn't have to survive one. The real deal starts the morning after, and this is the exact time when you, dear player enter the cruel world of Out of Reach.\nThe first enemy to encounter after surviving the storm will be your own body. Even the tropical forests have rainy days and cold nights... at least for a castaway in shorts. Searching for a shelter to stay over night could be almost as essential as finding food before someone considers you as something to eat.\nAlthough the archipelago was considered deserted before ships started to crash into sea rocks nearby, every kind of area on the island has its natural inhabitants who just don't give a warm welcome. Thinking twice every time before moving ahead could be one of the smartest things to do.\nStaying on a beach after crushing your boat allows you to hunt for slowly moving animals and gives the ability to see at long distances. Disadvantage - you can be seen from exactly the same distance and there's always someone to call you his own slow-moving food.\nBefore being able to found your first wooden settlement, you will need to stay constantly on the move, hunt and avoid being hunted at the same time. Getting to know the nearest neighbourhood could be your first step to stop looking like a bait. In Out of Reach, you are put into diverse environments of jungle, desert, plain, mountains and forest. Due to constantly changing weather and surrounding under players' influence and interaction you need to travel across the land in search of a minute of peace or gather enough resources to build a boat and find home on other parts of the archipelago.\nIn order to stay on the top of the food chain, you need to work harder than others. Everything starts from finding certain resources. Chop trees, mine stone, gather flax and food. Equip yourself and start searching for more sophisticated materials like copper and tin to produce bronze and other alloys.\nUse a variety of workshops, furnaces and tools to craft armour and weapons. Check which combination of gear has better performance and suits your game style best. Upgrade equipment using new resources or items obtained in battle. Store, collect or trade your stuff with other players!\nLooking for a place to store your timber or a quiet and cosy room to forge a sword and tan a skin of an elephant? Build your own stronghold! Use dozens of building elements like walls, stairs and floors to assemble the house of your dreams in an environment of your choice... or just take control of one.\nThe best solutions to problems are most often invented during battles. Everyday life on islands full of castaways is not an exception. To successfully protect your territory or gain control of a new one, you will need the advantage.\nBallista\nThe greater the distance, the safer you are. Ballista may be slow to load and unable to move but the ability to pierce a target with a 1,5m dart few hundred meters away in no time shouldn't be underestimated.\nTrebuchet\nUnusual situations require extraordinary solutions. When an axe doesn't help or doors are just too thick it's time for a trebuchet. Construction costs both time and resources but nothing surprises like a forced entry through a wall.\nTraps\nWell, there's actually one thing that surprises more - a tricky and deadly trap! Use trip wires at the doors, stairs or wherever you want, connect them with ballistae or boulder throwers, place a bait and wait for the unwelcome guests.\nGlider\nWhen everything fails, you might consider an attack from above. Construct a tower, install a launcher ramp and take off on a glider to bomb enemies' bases, get through walls or just take a look from a different perspective.","imageUrl":"https://media.rawg.io/media/screenshots/51c/51c5508edd6b5b0648ad54be2e133a72.jpg","releaseYear":2015,"developer":"Space Boat Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11517,"name":"Introvert Quest","genre":"Adventure","price":0.0,"description":"Introvert Quest is a comedy based JRPG set in a  fictional, modern setting. In it, the player will experience the life of a socially awkward shut-in named Bryce Han, who is pushed into (for him Herculean) tasks by his therapist and friend of his late father, Dr. Abe Eisner.\nThrough the intensive four day therapy, the player will tackle tasks such as: going to the store, making new friends, finding a part time job and many more. But, even such menial tasks can hold may dangers of a big city for one not used to its streets.  Scammers, beggars and delinquents lurk around every corner waiting for unsuspecting targets.\nMake friends and enemies in this twisted modern day RPG where every day activities seem like a grueling tasks for the player  to deal with. Be careful what you do or say for every choice will have some consequences in the future, for the past choices cannot be rewritten!\nThe gameplay of Introvert Quest will feature mostly dialogue based adventuring, concentrated on a multiple choice system. Choices will impact future events and interaction with other characters inhabiting Sky City. Introvert Quest also features JRPG style battles, but not as a main focus (mostly optional, plus an entire optional mini game aspect: Digital Duels a game that a lot of people play). Battles will be turn based with highly animated attacks. And lastly, but most importantly, after finishing the game successfully, the player will be thrust into a new, completely different experience.\nFEATURES\n\tBranching storyline\n\tMultiple choices that impact the story\n\tAction packed turn based battles\n\tBig city to explore which unlocks as the hero gains more and more confidence\n\tHyperbole version of various human weaknesses\n\tForm social links with other inhabitants of  he city\n\tLove life and your fellow man!\n\tNew Game + with a lot of new content","imageUrl":"https://media.rawg.io/media/screenshots/783/783e6e0456ec97a6e757d1d504d5a785.jpg","releaseYear":2017,"developer":"Amaterasu Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9905,"name":"Nightork Adventures - Beyond the Moons of Shadalee","genre":"Action","price":0.0,"description":"\"Everburning battles between light and shadow,\nclanging through the time,\ndestroying even the most beautiful meadow,\nthe song of war has no sense and has no rhyme.\"\nBook of Tears, discovered 17 years ago in the Zunkara sector, age: unknown\nFor centuries, there was peace in this region of the universe. But dark shadows appeared at the border of this galaxy. Some call them angels, others call them demons. You are an ork from the honourable Nightork tribe, piloting your well proven Warg XJ-85 spaceship. You don't know what the angles or demons are, but a few weeks ago, they attacked in the Darharra sector. Planet Brog is under heavy siege now. You have to free this planet and save many lives. You travel with your ship to planet Brog...\nNightork Adventures - Beyond the Moons of Shadalee has the following features:\nPilot your spaceship through procedurally generated dungeons.\nFight against evil demons, to save the galaxy in 30 missions.\nBuild your own levels with the included level editor.\nYou can shoot projectiles in three different colors: red, green and blue.\nEach enemy ship has a specific color.\nYou have to complement the enemies to white color.\nE.g. if an enemy is yellow, shoot it with blue projectiles.","imageUrl":"https://media.rawg.io/media/screenshots/5a6/5a6ee8f40f9ae7193b9064b35d676f3b.jpg","releaseYear":2016,"developer":"Warptear Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9498,"name":"Western 1849 Reloaded","genre":"Action","price":0.0,"description":"A bullet-fast, third-person Shooting Gallery, that takes you through ultimate gunfights across various locations of the Wild West!\nBack in 1849, when the West was Wild and gunslingers faced off on the street, gold was discovered in the sleepy town of Sunset Bluff. Like a coyote drawn to the scent of blood, the Quicksilver Bandits rode into town to seize the mines and establish the law of the gun. The helpless citizens have suffered, and now they're looking to you, their savior. Draw your weapons! It is time to clear Sunset Bluff of the bloodthirsty vermin!\nArcade High Score Shooter with roguelike progression,\nFive action packed levels - Town Square, Railway Station, Gold Mine, Outskirts and the Old Canyon,\nOld school, upgradeable weapons (Revolvers, Shotguns, Rifles) and unlockable Charms,\nImmersive toon shaded graphics with ultra smooth framerate,\nRage Mode - to make you invincible and boost the pace even more,\nLeaderboards - to let you compete with your friends,\nPerk Cards - to refine each playthrough,\nSteam Achievements and Trading Cards.","imageUrl":"https://media.rawg.io/media/screenshots/b07/b0744c77a3cd70e27dd5e235f2d632e7.jpg","releaseYear":2017,"developer":"Nawia Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5276,"name":"Shin Megami Tensei: Persona","genre":"Action","price":0.0,"description":"Set in 1996, Megami Ibunroku Persona centers around the protagonist and his classmates at St. Hermelin High School in Mikage-cho (Lunarvale in Revelations: Persona). Hidehiko Uesugi talks all of his friends into playing a game called \"Persona\", which is played much like the ritual game \"Bloody Mary\". While playing, the students lose consciousness and meet Philemon, who gives them the ability to summon reflections of their personalities, which are known as Personas.\n\nA short time later, the protagonist and several of his friends go to visit Maki Sonomura, who is ill and bed-ridden. During their visit, they discover that the town is changing and demons are roaming the streets. The party is told by Maki's mother, an engineer working for SEBEC, that the culprit behind the incident is Takahisa Kandori, president of the company.\n\nAfter taking Maki's mother to the school (the only place in town safe from demons), the protagonist's actions decide the course of the story. If the protagonist opts for going after Kandori, it'll start the SEBEC Chapter which is the main storyline of the game. Alternatively, the protagonist may opt for investigating a series of incidents that occurred in the school eight years ago and start the Snow Queen Quest, an alternate storyline unrelated to the SEBEC incident.","imageUrl":"https://media.rawg.io/media/games/c0b/c0b90804a936a729636ec8f09ddf8ff7.jpg","releaseYear":1996,"developer":"Atlus Persona Team","libraryGames":null,"platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation"}]},{"id":4266,"name":"The House of the Dead: OVERKILL Extended Cut","genre":"Shooter","price":0.0,"description":"A NEW DEFINITION OF GORE\nThe signature horror b-movie style from the original OVERKILL remastered in High Definition and available in gore-splattered 3D for the first time ever.\nPLAYSTATION®MOVE READY\nUse your PlayStation®Move motion controller to shoot your way down waves of infected mutants. Also compatible with the PlayStation®Move Sharp Shooter!\nEXTENDED NIGHTMARE\nFeatures the 7 remastered levels from the original House of the Dead: OVERKILL and 2 brand new exclusive levels unveiling an insane side story featuring two angry and armed strippers!\nMORE MUTANTS, MORE WEAPONS\nFace the new baby mutant threat and skewer enemies with the new crossbow, fully equipped with explosive bolts.\nBRING YOUR FRIENDS\nTeam up with a friend to experience the 9 levels of the story mode the way they should be played and keep track of your high scores in the new online Leaderboards.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©SEGA, SEGA, the SEGA logo, THE HOUSE OF THE DEAD and THE HOUSE OF THE DEAD: OVERKILL are either registered trademarks or trademarks of SEGA Corporation. PlayStation®Move features require PlayStation®Move motion controller and PlayStation®Eye (sold separately).","imageUrl":"https://media.rawg.io/media/games/88c/88c5c22c27b1e03cd025b313516ae6f7.jpg","releaseYear":2012,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":941,"name":"Exile's End","genre":"Action","price":0.0,"description":"Exile's End is an homage to early 90's action-adventure PC games like Flashback and Another World, but with a Japanese flair. The core of the game is from Australian game maker Magnetic Realms with art, cutscenes, and music provided by legends of the 8 and 16-bit eras from Japan. It draws its thematic influence from the science-fiction films and anime of the 80's and its gameplay from classic Amiga and Commodore 64 action-adventures.\nMusic From Keiji Yamagishi (Ninja Gaiden NES, Tecmo Bowl, Captain Tsubasa)\nArt by staff from Secret of Mana,First Kiss Story, Mother 3, and more!\nNES-style cutscenes by OPUS (Half-Minute Hero)","imageUrl":"https://media.rawg.io/media/screenshots/f16/f16cc9387663341d124f9e8945dc2656.jpg","releaseYear":2015,"developer":"XSEED Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"}]},{"id":964285,"name":"Call of Duty: Modern Warfare III","genre":"Action","price":0.0,"description":"ADAPT OR DIE IN A FIGHT AGAINST THE ULTIMATE THREAT\n\nIn the direct sequel to the record-breaking Call of Duty®: Modern Warfare® II, Captain Price and Task Force 141 face off against the ultimate threat. The ultranationalist war criminal Vladimir Makarov is extending his grasp across the world causing Task Force 141 to fight like never before.\n\nIT’S TIME TO SETTLE OLD SCORES AND START NEW ONES\n\nModern Warfare® III celebrates the 20th anniversary of Call of Duty® with one of the greatest collections of Multiplayer maps ever assembled - both fan favorites and all new ones. All 16 launch maps from the original Modern Warfare® 2 (2009) have been modernized with new modes and gameplay features and will be available at launch to get everyone started, while over 12 all-new core 6v6 maps will fuel post-launch live seasons.\n\nALL NEW OPEN WORLD ZOMBIES\n\nFor the first time, team up with other squads to survive and fight massive hordes of the undead in the largest Call of Duty® Zombies map ever. Modern Warfare® Zombies (MWZ) tells a new Treyarch Zombies story with missions, core Zombies features, and secrets to discover.","imageUrl":"https://media.rawg.io/media/games/b17/b17ce7ab3187cc3f42d263d9511adac0.jpg","releaseYear":2023,"developer":"Raven Software","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":872778,"name":"Call of Duty: Warzone 2.0","genre":"Action","price":0.0,"description":"With over 125 million players dropping in to play the original Call of Duty®: Warzone™, and over 200 streamers and content creators playing an early Alpha version of Call of Duty®: Warzone™ 2.0 at the Call of Duty®: Next event, the first official intel has dropped regarding this massive, free-to-play Battle Royale experience featuring a huge and incredibly detailed new map, a host of innovations, and many more details we plan to share between now and November 16, when Call of Duty: Warzone 2.0 is officially launched – free for everyone – as part of Modern Warfare® II Season One.","imageUrl":"https://media.rawg.io/media/games/abd/abd4fe622907a3bb98ac6c290037dd5a.jpg","releaseYear":2022,"developer":"Raven Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":868095,"name":"The Jackbox Party Pack 9","genre":"Casual","price":0.0,"description":"About The Jackbox Party Pack 9\nIntroducing the ninth installment of the best-selling Party Pack Franchise you know and love! Whether you’re hanging out with friends, having a remote happy hour, trying to make the holidays less awkward, or looking for your next game to stream, The Jackbox Party Pack 9 is here to spice things up.\nLet’s keep it simple. You don’t need extra controllers for extra players - everyone uses their phones or tablets to play! Games support up to 10 players and 10,000 audience members joining in the fun to impact the outcome of the game.\nThe Jackbox Party Pack 9 is in English only at launch but a patch is coming soon with French, Italian, German, and Spanish localization. This game does not support online matchmaking but can still be enjoyed remotely using livestreaming services or video conferencing tools.\nAbout Each GameFibbage 4 (2-8 players) - The hilarious bluffing party game returns with an all new Final Fibbage, video questions, fan-submitted questions, and Fibbage Enough About You mode! It’s a game so beloved that we decided to slap a 4 on it.\nQuixort (1-10 players) - In this trivia sorting factory, work with your team to sort falling answers into their proper order before they hit the floor! Or, play the single player mode and see how many blocks you can sort before topping out. It’s as easy as A, C, B!\nJunktopia (3-8 players) - A strange wizard has turned you into a frog! Create hilarious backstories for weird objects and then get them appraised. The player with the most valuable items becomes human again!\nNonsensory (3-8 players) - Professor Nanners is here to test your NSP (Nonsensory Perception) in this drawing, writing, and guessing game! How close can you get to guessing where another player’s prompt ranks on the silliest of scales?\nRoomerang (4-9 players) - Channel your inner reality TV star in an attempt to come out on top! Respond to prompts, bring the competition and role-play to avoid being voted out. Never fear though, even when you’re out you’ll find yourself Roomerang-ed right back into the drama!\nHow to Play Remotely\nhttps://www.jackboxgames.com/remoteplay/\nIn The Jackbox Party Pack 9, players use any web-enabled device (like a smartphone or tablet) to join the game and play along. When playing with remote players, you can use a video conferencing tool like Zoom, Steam Broadcast, Google Hangouts, Discord, and more to connect with others! Just share your screen while on a call and make sure you look for prompts to share audio. Visit our Remote Play page for more tips and tutorials.","imageUrl":"https://media.rawg.io/media/screenshots/286/286a939d311b552e8f516b12518ec924.jpg","releaseYear":2022,"developer":"Jackbox Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":650635,"name":"If On A Winter’s Night, Four Travelers","genre":"Adventure","price":0.0,"description":"THE SILENT ROOM\nIn a luxurious hotel room in Rome, freshly arrived from Turin, Carlo awaits for his lover Patrick to arrive. However, as the shadow of fascism looms ever larger, the tension of meeting in constant hiding is beginning to take its toll.\nTHE SLOW VANISHING OF LADY WINTERBOURNE\nLady Winterbourne has lost her husband in a tragic accident. Now letters from pretenders to her vast fortune keep arriving every day at her mansion, yet the only thing she's interested in is the bottle of laudanum in her cabinet.\nTHE NAMELESS RITUAL\nHarassed, ridiculed and belittled by his peers, Dr. Jordan Samuels has resorted to the occult sciences in a desperate attempt to turn the tables on his tormentors. But is he truly ready to face the Guardian of the Threshold?\nIF ON A WINTER'S NIGHT\nAs much as Laylah enjoys her job, sometimes she yearns for a bit of variety to distract her from her daily routine -- even if it means going against her very powerful bosses' orders.","imageUrl":"https://media.rawg.io/media/screenshots/4d5/4d5342cd29caaa6c15c57434c8b9848c.jpg","releaseYear":2021,"developer":"Dead Idle Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":455519,"name":"Undungeon","genre":"Action","price":0.0,"description":"Undungeon is an action role-playing experience that brings back the spirit of old school action/RPGs wrapped in modern design. Restore the order in the Multiverse, influencing not only the events of the present, but the future and the past as well.\nHeated real-time battles: combine melee and ranged attacks to vanquish your foes, heal carefully so that enemy doesn’t steal your remedy, use various buffs and debuffs to have the advantage in combat.\nColorful pixel art aesthetics: each tree or rock is hand-drawn, each enemy has dozens of carefully crafted animation frames to create a one-of-a-kind visual experience.\nSeveral customizable heroes: implant organs into the body of the herald of your choosing to enhance them. Equip different skill runes that substantially alter the gameplay.\nWast open world: explore distant lands beyond belief, meet their exotic inhabitants and Between missions, recover, gear up and rest in Herald's Undercover Bay. H.U.B. is located in a neutral expanse between dimensions.\nAdvanced NPC interaction system: you can trade with Arhaban locals or recruit them to join your crew in the H.U.B. Need some crucial information from some stubborn nomad who refuses to cooperate? Interrupt a dialog to torture them right in the middle of a conversation!\nMind-bending sci-fi story: several worlds had been suddenly merged together, shattering one another to pieces in a cataclysm known as the Great Shift. The very fabric of time and space was damaged, seemingly beyond reconstruction. As a member of a secret interdimensional organization—Herald's Undercover Bay—you, a Herald, are sent to the ancient city of Arhaban to remedy the aftermath of the catastrophe.\nTravels between timelines and dimensions: changes you make in one timeline will apply to all other timelines, altering environments, NPCs, and enemies. Destroyed a forest? A lifeless desert will greet you when you visit this location in the future. Switch between heralds to be able to complete different kinds of objectives in different dimensions","imageUrl":"https://media.rawg.io/media/screenshots/b2d/b2d14dcea835b45fe6b35a856f0fec26.jpg","releaseYear":2021,"developer":"Laughing Machines","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":353491,"name":"Hello Neighbor Alpha 2","genre":"Adventure","price":0.0,"description":"Good old memories, huh? This is an ALPHA#2 VERSION of the famous Hello Neighbor.\nHello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\nSuspenseful horror gameplay that focuses on sneaking around your neighbor's house\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\nSandbox-style gameplay with plenty of environmental interaction and physics","imageUrl":"https://media.rawg.io/media/screenshots/318/31896523212946b0a429985e2fa2e183.jpg","releaseYear":2019,"developer":"Dynamic Pixels","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":350412,"name":"OUTBUDDIES","genre":"Action","price":0.0,"description":"A Word From The DevOUTBUDDIES' development started as a spare time passion-project in early 2013, influenced by timeless classics of my childhood starring Super Metroid, Castlevania, Super Mario Bros., and Mega Man. The quality, depth, and acceptance of indie metroidvanias like Axiom Verge & Hollow Knight proved what can be achieved by small teams or even single persons. Those developers inspired me to allocate even more personal resources and dedication to the project so it could eventually evolve into something really special.\nAs a father, daytime employee, and gamer myself I loved how progression and iteration were tackled in outstanding indie platformer Celeste, so OUTBUDDIES was designed to provide challenging and encouraging gameplay while skipping punishing throwbacks and grinding mechanics in total. I listen to feedback and I'm dedicated to support and improve the game further after release, so shoot me your feedback anytime!\nJulian Laufer, Game Designer & Developer\nAbout the Game\nEnter Bahlam, a sunken city of the Old Gods, located deep in the South Atlantic Ocean. Following a shipwreck, adventurer and maritime archaeologist Nikolay Bernstein regains consciousness 36.000 feet under the sea. He's severely wounded and unwillingly connected to a supernatural Buddy-unit. Searching for answers about his displacement our main protagonist digs deep into the lost undercity, gradually realizing an ominous presence hollowing in its shadowed caverns.\nOn your journey home you will share your fate with a friendly tribe of mining creatures, the Wozan, who fear the Old Gods and strive to get back to the surface since their ancestors had been enslaved 5000 years ago. Some of them were able to flee and founded secret colonies deep inside the sunken ruins, others are still exploited by the hostile creatures that have overtaken the city since the Old Gods suddenly disappeared.\nExperience real non-linear Metroidvania gameplay and uncover five distinct areas, all with remarkable puzzles, environmental hazards, epic boss encounters and captured Wozan to uncage. Your Buddy unit will procedurally map the area and function as a handy quality of life tool that can be controlled at will to manipulate your surroundings using various abilities like hacking, scanning, and telekinesis.\nExplore Bahlam with high freedom of movement like climbing, crawling and diving right from the start. As you progress your set of options will expand by discovering ancient weapon systems, suit upgrades and hacking protocols for your droid. All gear will be carefully balanced in terms of combat abilities and has to be used selectively to overcome specific hazards and puzzles.\nThe local Co-Op option invites a second player to explore and experience this adventure together by taking control over the invincible Buddy unit. Support each other on your journey home, solve puzzles and overcome Bahlam's hostile maze. This will also provide an opportunity for team-speedrunning as a very unique take on the scene.\nOutbuddies is a humble budget project but that does not mean it will run poorly or lack the quality of life features. All pixel art will scale crisp and free of distortion artifacts to your native screen resolution. The game runs at 60 FPS. A hybrid physics engine ensures realistic accelerations and object movements while maintaining the pixel perfect control of the old classics. Enemy and boss AIs are carefully crafted and will kick your ass in a Souls-like manner! Outbuddies also supports various mappable devices like keyboard, mouse and multiple gamepads to ensure you´re able to play with your preferred setup. We listen to feedback, so shoot us a mail anytime!\nExplore an open vibrant fantasy world\nReal Metroidvania gameplay with lots of gear, puzzles and Easter eggs\nUnique dual-hero scheme with local Co-Op support\nEpic boss battles & believable enemy AIs\nIntriguing narrative and memorable characters\nHigh freedom of movement @ 60 FPS\nHandcrafted pixel art with distortion-free scaling to your native display resolution\nSupport for various input devices & key rebinding\nOriginal soundtrack by OGRE musicGames I love & was inspired by:Super Metroid\nCastlevania\nSuper Mario Bros.\nMega Man\nAxiom Verge\nHollow KnightThanks for such good and inspiring games <3!","imageUrl":"https://media.rawg.io/media/screenshots/f33/f337a1ba43dd88c413c4d009736e5a1a.jpg","releaseYear":2019,"developer":"Julian Laufer","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":302916,"name":"Dandy Ace","genre":"Action","price":0.0,"description":"Dandy Ace is an over the top action game that follows this fabulous magician seeking to combine and use his magical cards, fighting and looting his way to defeat the Green-Eyed Illusionist and free himself from a cursed mirror. Play with Dandy Ace, the amazing hero, and survive the challenges of the extravagant, lavish and ever changing palace created to defeat him, filled with bizarre creatures and outrageous bosses. Find all precious cards, gather shards and gold, and get help from other imprisoned magicians that now work as shopkeepers or other jobs.Features- Rogue-lite experience: Try, die and try again until you beat the Green-Eyed Illusionist with the replayability and adrenaline of a rogue-like with permanent upgrades that makes you stronger.\n- 2D isometric fast-paced action: In a tough but fair combat, battle your way through bizarre creatures and outrageous bosses.\n- Create your own builds: Combine cards with more than a thousand possibilities, each with its own gameplay style and powers.\n- Challenges of the ever changing palace: explore the extravagant and lavish aesthetics of the game through the nonlinear progression of the palace, until you reach the Throne Room and leave the cursed mirror","imageUrl":"https://media.rawg.io/media/screenshots/249/24931141a32dcaf441f0c3cad9a5b176.jpg","releaseYear":2021,"developer":"Mad Mimic","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":259870,"name":"Contractors","genre":"Action","price":0.0,"description":"Contractors is a team-based competitive multiplayer shooter game for virtual reality devices. Experience the next level virtual warfare with hardcore controls, lethal weapons, customizable load-outs, and intense firefights.\nContractors features:\n* Immersive full body IK system\n* Super realistic weapon handling\n* Objective oriented game mode\n* Customizable weapon load-out system with different weapons and gadgets.\n* A shooting range serves as hub area with all kinds of activities.\nBECOME AN OPERATOR and join the fight.","imageUrl":"https://media.rawg.io/media/screenshots/155/155d08d43f0b5bcb8b36f8a60cf530cd.jpg","releaseYear":-1,"developer":"Caveman Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60327,"name":"Maximum Action","genre":"Action","price":0.0,"description":"\"Maximum Action\" - A brutal and satisfying physics-based linear first-person shooter influenced by Hong Kong action, heroic bloodshed, and other old-school first-person titles.\nKey Features:\n*Active Ragdoll Physics\n*Physics Based sliding, diving, kicking, and drop kicking\n*Action Time mechanic, time moves as you shoot\n*Large variety of pistols, shotguns, sub-machine guns and rifles\n*Dual wield ANY weapons to make action-packed combinations\n*Extreme blood, gibs, and dismemberment\n*Fast-paced, from punching to shooting, nonstop combat\n*Retro aesthetic\n*Level Editor\n*Sandbox Mode\n*Endless Mode\nAction to the Max!","imageUrl":"https://media.rawg.io/media/screenshots/307/307e8b04d4f3cf96fb9b8ee6b0f60c6f.jpg","releaseYear":2018,"developer":"George Mandell","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53191,"name":"Adventure Island (1986)","genre":"Action","price":0.0,"description":"Hudson's Adventure Island is a side-scrolling platform game produced by Hudson Soft that was first released in Japan for the Famicom and MSX on September 12, 1986. It was later released in North America for the Nintendo Entertainment System on September 1988 and in the PAL region in 1992 under the title of Adventure Island Classic.\nAdventure Island is an adaptation of the arcade game Wonder Boy, developed by Escape for Sega. Adventure Island was followed by a series of sequels with no connection to the Wonder Boy series.","imageUrl":"https://media.rawg.io/media/games/d51/d519cdf7f6c11951ce87a01fab5ee34e.jpg","releaseYear":1986,"developer":"Hudson Soft","libraryGames":null,"platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy Advance"}]},{"id":50625,"name":"Dungreed","genre":"Action","price":0.0,"description":"Dungreed is 2D side-scrolling action game with a Rogue-LITE element.\nPrologue :\nSuddenly, strange structures appeared in the peaceful village. It was a dungeon! And the dungeon swallowed and destroyed everything in the village. You must rebuild the village and explore the dungeon. Go in to the dungeon, against potential dangers and rescue villagers to solve the problem.\nThere is no checkpoint. When you are falling, you come back to the village. Learn and grow to reach deep in to the dungeon.\nGet help from rescued villagers, and native people in the dungeon. They will surely help you!\nKey Features :\n- Procedurally generated, but elaborately designed level.\n- Growth system to help dungeon exploration\n- From obsolete sword to high-tech sniper rifle, various weapons and magic items\n- Food pixel art to enhance your appetite!\n- Rebuild the village\n- Various themes in the dungeon such as prison, jungle, lava-zone\n- Monsters, traps, and BOSSES","imageUrl":"https://media.rawg.io/media/screenshots/832/8320688bf301adc39d48314b298fea41.jpg","releaseYear":2018,"developer":"TEAM HORAY","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":49372,"name":"Lines 2 by Nestor Yavorskyy","genre":"Strategy","price":0.0,"description":"Lines 2 is a Numberlink-based puzzle game involving finding paths to connect colored tiles in a grid.\n50 brain-teasing Numberlink puzzles\nbeautiful abstract design, more than 10 color themes\n8 ambient relaxing soundtracks\n500 achievements\n15 Trading Cards, Badge, Emoticons and Backgrounds (Coming soon)\nCross-platform saves via Steam Cloud\nWindows, Mac & Linux\nFirst game - Lines\nFree version - Lines Free\nFree DLCs with community-generated achievements","imageUrl":"https://media.rawg.io/media/screenshots/0e9/0e9d4bb6753d5d823fb2c8217135d605.jpg","releaseYear":2017,"developer":"Nestor Yavorskyy","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":44151,"name":"Grav Blazer","genre":"Action","price":0.0,"description":"Grav Blazer is an arcade space shooter with a focus on fast paced action. Players will experience procedurally generated levels with increasing difficulty. To beat a sector all space bases need to be defeated. Each base will constantly construct enemy ships to defend themselves and the ship type and strength is determined by what sector you are in. Skill based firing mechanics, rotational controlled power attacks, increasing level difficulty, and endless procedurally generated levels are some of the features players will experience.\nSpecial Features:\n*Procedurally generated levels\n*Rotational controlled, skill based firing mechanics\n*Endless levels with increasing difficulty\n*Rotational controlled, skill based special attacks","imageUrl":"https://media.rawg.io/media/screenshots/bb1/bb1a401f527f204c75e2a1ad8fe4fe3f.jpg","releaseYear":2017,"developer":"Ripknot Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":27973,"name":"Pikmin 3","genre":"Action","price":0.0,"description":"In the Pikmin 3 game, players take command of three explorers and a\nlegion of adorable Pikmin in a fight for survival. By employing the\nunique abilities of these tiny Pikmin creatures, players will solve\npuzzles, battle dangerous predators and recover food needed to save the\nexplorers' depleted home planet.\n\nWant more Pikmin? Download Pikmin™\nShort Movies, directed by Shigeru Miyamoto, exclusively on Nintendo\neShop.\n\nFEATURES:\n\nDiscover the charming personalities of the plant-like Pikmin creatures\nas they come to life in multiple shapes and sizes. Five different\nPikmin types, including new Rock Pikmin and Winged Pikmin, each offer\nunique abilities. Rock Pikmin are sturdy creatures who can be tossed\nat solid objects to break them down. Winged Pikmin have the ability to\nfly and can carry objects in the air.\n\nDivide and conquer! Split your Pikmin squads among the three explorers\nto maximize your strategy.\n\nUse the Wii U GamePad controller as an in-game camera to capture the\nalien-safari environment from a pint-sized perspective. Snap and\ncaption photos, then share them via Miiverse.\n\nShow off your skills in a variety of modes or challenge a friend in\nthe wild and frenetic multiplayer battle mode. (Additional accessories\nare required for multiplayer mode and are sold separately.)\n\nThe intuitive controls of the Wii Remote and Nunchuk controllers make\nit easy to lead your explorers and pinpoint the location where you\nwant to throw Pikmin.\n\nThe game can also be played off the television using only the Wii U\nGamePad.\n\nIntense new challenges come to Pikmin 3 in downloadable stages!\nThe new Collect Treasure! DLC pack for Pikmin 3 adds five remixed\nstages to Mission Mode. The first stage is available free of charge\nand is included as part of a software patch. To purchase the entire\nstage pack, select \"downloadable content\" from the Pikmin 3 page in\nthe Nintendo eShop.\n\nIn-game content available for purchase using stored account funds.\n\nPrice effective March 11, 2016.","imageUrl":"https://media.rawg.io/media/screenshots/450/450788922a6ca76924fffd0f4daf363a.jpg","releaseYear":2013,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"}]},{"id":27965,"name":"Phoenix Wright: Ace Attorney - Spirit of Justice","genre":"Adventure","price":0.0,"description":"Phoenix Wright: Ace Attorney – Spirit of Justice sees Phoenix in a brand\nnew location: a courtroom situated in the Kingdom of Khura'in, origin of\nthe Kurain Channeling Technique, where mysterious séance trials decide\nthe fate of all defendants. Meanwhile, defense attorney Apollo Justice\nfaces his own challenges holding down the fort at the Wright Anything\nAgency, as he takes on a case that will have explosive implications.\nBoth our heroes are joined by a host of returning friends and\nadversaries in their fight to bring about justice. Filled with puzzling\nmysteries to solve, a cast of memorable characters, and all new\ninvestigation techniques, this is one case you'll definitely want to\ntake.","imageUrl":"https://media.rawg.io/media/games/d38/d389186cb8ce5b40f74bcf48d90d8e4c.jpg","releaseYear":2016,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo 3DS"}]},{"id":26090,"name":"Pokémon Mystery Dungeon: Explorers of Sky","genre":"Action","price":0.0,"description":"Pokémon Mystery Dungeon: Explorers of Sky is the newest\ninstallment in the Pokémon Mystery Dungeon video game\nseries. The game expands on the fun found in Pokémon Mystery Dungeon:\nExplorers of Time and Pokémon Mystery Dungeon: Explorers of\nDarkness. Players be a Pokémon and team up with a partner Pokémon.\nTogether the two set out on an adventure of exploration and discovery,\nultimately saving the world from destruction. With additional Pokémon to\nbe, new “Special Episodes” and enhanced communication features, this is\na grand adventure with a moving story and stunning finale. This game is\na great starting point for players to enter the world of Pokémon\nMystery Dungeon and for returning players to discover even more\nsecrets.\n\nBe a Pokémon and experience the world in a whole different way. Enter\ninto a spectacular adventure to save the Pokémon world.\n\nUncover new chapters in the immersive Pokémon Mystery Dungeon\nstoryline by playing new Special Episodes.\n\nPlay as one of 19 different Pokémon (including five new hero Pokémon).\nFind out which one you will be. Interact with more than 490 Pokémon as\nyou explore.\n\nTrade items with your friends via a local wireless connection. Also,\nyou can trade with Pokémon Mystery Dungeon: Explorers of Time\nand Pokémon Mystery Dungeon: Explorers of Darkness and see\nwhat happens.\n\nSend a demo dungeon to your friend’s Nintendo DS or Nintendo DSi™\nsystem via a local wireless connection.\n\nWith a wireless broadband Internet connection, access special Missions\nor rescue fallen friends over Nintendo® Wi-Fi Connection.\n\nPackage illustration by Ken Sugimori\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/screenshots/da9/da9d31d5e52d1d3fdcf3adb4209292ce.jpg","releaseYear":2009,"developer":"The Pokemon Company","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii U"}]},{"id":23636,"name":"Ironbound","genre":"RPG","price":0.0,"description":"Sharpen your sword and join the fray in IRONBOUND, the turn-based multiplayer strategy game where you use your wits to prevail in fast-paced duel matches.\nOnline games last between 5 and 10 minutes and reward strategic thinking as well as quick tactical decisions. Familiar gameplay makes Ironbound easy to pick up, while rich character customization options give you plenty of opportunities to refine your play style and surprise your opponents.\nThe game client is a free download on all supported platforms and gives players access to all the single player missions and a limited number of multiplayer games. After the free games are used up, a one-time purchase must be made to continue playing.KEY FEATURESPLAY YOUR OWN WAY\nChoose the hero that matches your style: the aggressive Berserker, the resilient Crusader, the stealthy Assassin or the cunning Witch. Use the gold you gain by playing to upgrade your character and buy better equipment.\nDEEP META-GAME\nWith hundreds of weapons, shields and magic trinkets to choose from, there are countless tactics to devise and master in the race to outsmart the other players and rise to the top of the multiplayer ladder.\nCROSS-PLATFORM MULTIPLAYER\nThe game will soon be available on iOS and Android devices, and you will be able to use a single account to play everywhere. Cross-platform multiplayer will be fully supported.","imageUrl":"https://media.rawg.io/media/screenshots/6e3/6e36b93449f96bd5ce618adab2840648.jpg","releaseYear":2017,"developer":"Secret Level","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":23415,"name":"Stormworks: Build and Rescue","genre":"Simulation","price":0.0,"description":"BUILD, PLAN, RESCUE\nStormworks: Build and Rescue is the game where you design and pilot your own sea-rescue service, in a rich and dramatic physics playground.\nTake your custom-designed, block based and programmable vehicles into fierce oceanic storms. Plan and execute thrilling rescues in a variety of challenging crisis scenarios. Export and share your meticulously designed vehicles with others.\nVEHICLE DESIGN\nDesign vehicles by placing blocks in a rich editing suite, customise them with paint, and program the behaviour using the powerful logic system. Choose from a wide array of components for designing helicopters, boats, and more.\nNAVIGATE, STEER, PILOT\nTake charge of your vehicles in a physics driven sandbox simulation - where your vehicles' performance is a direct result of your design. Use dials and indicator components to display feedback on the vehicles logic system, whilst pushing your designs to the limit in fierce weather.\nRUN YOUR OWN COASTGUARD\nTake on missions to run your own coastguard service. Design specific vehicles to respond to emergencies and cargo missions across open oceans, island facilities, remote rigs and more.\nDRAMATIC, SIMULATED WORLD\nThe day-night cycle and dynamic weather system creates diverse environments - from still sunny mornings, to fierce stormy nights. Strong winds can turn the ocean from gentle ripples to fierce heaving waves, affecting the vehicles using a physics based displacement-buoyancy system.","imageUrl":"https://media.rawg.io/media/screenshots/2db/2db39d2a3c115a403cc8ab2884397103.jpg","releaseYear":2018,"developer":"Geometa","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":22746,"name":"Cannon Fodder","genre":"Action","price":0.0,"description":"Don't wait till you see the whites of their eyes...\nDon't kid yourself it will be over by Christmas...\nDon't try to shut out the screams...\nAnd don't forget to wash your hands afterwards...\nFrom a queue of some 360 \"eager\" conscripts waiting to go to war, a team of up to six will \"volunteer\" for each new mission. Encourage your soldiers to shoot anything that moves, throw grenades, fire bazookas, drive tanks, fly choppers, split up and do their own thing... and die...\nGuide your no-hoper's troop straight through deadly missions.\nAnd if you lose some of them? There's more where that came from...Action-driven, fast-paced classic arcade gameplay\nA mix of tactical insight and fast reflexes required, a good micro would be a plus\nWar has never been so much fun!","imageUrl":"https://media.rawg.io/media/screenshots/241/24188738ed8141b03c767e6bbba28401.jpg","releaseYear":1993,"developer":"Sensible Software","libraryGames":null,"platforms":[{"id":0,"name":"3DO"},{"id":0,"name":"Genesis"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Jaguar"},{"id":0,"name":"SNES"}]},{"id":22418,"name":"Biology Battle","genre":"Action","price":0.0,"description":"In this classic space-shooter, you take the role of a medical nanobot and embark on an exciting journey into the depths of a biological cell. Evade the defense tactics of the other cells and try to survive for as long as possible.\nFeatures:\nEleven different versus modes (e.g. lasso, froghop, worms)\nPlay online against thousands of real opponents\nComprehensive tournament mode and demanding coop mode\nImprove the ship´s capabilities with various bonuses\nAdaption of the XBLA-hit","imageUrl":"https://media.rawg.io/media/screenshots/617/617c467ecdaf37874ab221bb47385499.jpg","releaseYear":2015,"developer":"Novaleaf Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21437,"name":"Crazy Plant Shop","genre":"Strategy","price":0.0,"description":"Become the ultimate botanist by running your own plant shop full of wacky and exotic plants. Whimsical clientele place orders for plants in your catalog, but not all plants you can order have the right traits your customer is looking for in a specimen. It’s up to you to use a special machine in your shop to breed the correct plant with the right traits to complete a customer’s order. Earn gold for each completed order and participate in the World Fair by submitting your best plant specimens. Use your gold to earn upgrades for your shop, and unlock all the species in Crazy Plant Shop to win the game!Key FeaturesLearn about plant genetics and heredity by breeding plants to fulfill customer orders\nEarn gold for each fulfilled customer order that can be used to upgrade your shop\nParticipate in local competitions to earn prestige and work your way up to the World’s Fair\nBecome the ultimate botanist by unlocking all plant species in the game","imageUrl":"https://media.rawg.io/media/screenshots/f7e/f7ec3ec39b9b92f2ca75e97aeccf33f3.jpg","releaseYear":2014,"developer":"Filament Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21204,"name":"Mr. Bree+","genre":"Action","price":0.0,"description":"Are you up for a real hardcore platformer?! Do you have what it takes?\nMr. Bree+ is a sidescroller adventure game about a householder family pig captured by wild boars and sent to work as a captive. Tired of that, Mr. Bree decides to run away!\nDuring his escape, Mr. Bree had a trauma and forgot about his family, the way home and also his movement skills. Now he needs to remember all that, return home and find out what happened to his wife and son.\nAlong his journey, Mr. Bree will face some mindblowing challenges and revelations.\nFeatures45 Story levels that would set any pig into tears15 Secret levels to unveil the dark past of Mr. BreeOriginal music score so amazing that you will dream about for daysOver forty achievements for you to extract every single bit of the game!Boss Battles that will make you backflip of excitement!Feel the Emotion of helping a householder pig into returning home and search his family!\n### Mac and Linux version coming soon ###","imageUrl":"https://media.rawg.io/media/screenshots/9ba/9bab3916d3556ab511351f42f8c9e75d.jpg","releaseYear":2013,"developer":"TawStudio Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20365,"name":"SOLRAVEN","genre":"Simulation","price":0.0,"description":"This Game is designed for Virtual Reality. must need a HMD Device.\nSOLRAVEN is rail scrool shooter game for Virtual Reality.\nMove Your HMD for Fly through the Valley.\nLock on your Enemy and Shoot'em! ---------- Feature ---------- 4 Campaign Mission\nHigh Quality Musics\n8 types of Enemys\nFree Play\nSOLRAVEN was made to study the VR.\nYou may be disappointed with the content of the short game.\nBut I think this is better now than when the enemy will be randomly generated.---------- Control ----------HMD Control : Fighter Pitch/Yaw/Roll\nRight Mouse Button : Fire Missile\nLeft Mouse Button : Fire Gun\nESC Key : Quit Game\nEnter Key : Calibrate HMD Position\nLeft/Right Arrow : Tutorial On/Off (In Main Menu)\nExcept Oculus DK2 was not tested in the device.\nBut I think it would go well with most of the HMD.\nIf you have problems, please send an e-mail.---------- Developer ---------- LuiCypher(Lee Jae Hyeong) / Inception Soft.","imageUrl":"https://media.rawg.io/media/screenshots/26c/26c7218ababb81b65dc72d29dd76457c.jpg","releaseYear":2016,"developer":"Inception Soft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20105,"name":"Crazy Steam Bros 2","genre":"Action","price":0.0,"description":"Crazy Steam Bros is a classical horizontal shoot'em up inspired by the gameplay of old arcades. Anton and Dupont are brothers, inventors, and a little mad also! With the help of their landlady, Miss Lily, they must defeat the evil Baron and their hordes of moustached soldiers. Fly the \"SteaMobile\" trough five levels of steampunk action. Traverse cities, jungles, caves and more. Collect Power-Ups for your machine and defeat the bad tempered bosses before the tea time!\nTo play you can use the keyboard or a compatible gamepad, and Keys can be redefined at the options menu.\nPredefined keys are:\nArrows for movement for player 1, \"RFDG\" keys for player 2\n\"K\" key for player 1, \"Q\" key for player 2:\nShooting. It will activate all your weapons, except bombs and air mines. This is a game with automatic autofire, so there's no need to ravage your keyboard or your fingers :D\n\"L\" key for player 1, \"W\" key for player 2:\nBombing. Hitting things with bombs is trickier, but the damage done by them is huge! This also activates air mines, if you have collected them.\n\"P\" key:\nPress it in game to show the pause menu.\n\"ESC\" key:\nTo finish and quit the game.\nGameplay is easy. Just advance trough the levels and survive the battle against the stage's bosses.\nEventually, Miss Lily will drop random powerups. Collect them for increased firepower.\nThese powerups have a limited life, so use them sparingly.\nThe different powerups are:\nSupershoot:\nIncreased damage for the machinegun.\nTrishoot:\nThe machinegun will shot in three directions at once.\nAir Mines:\nThey will pursue the nearby enemies.\nTesla Shield:\nA force field that will protect you against enemies shots.\nRocket:\nA powerful weapon, but not much precise.\nSuper Bomb:\nThis bomb will release a pair of normal bombs after exploding.\nTesla Cannon:\nAn electro ray that will hit the nearby enemies without need to aim.\nTesla Drones:\nYou can collect up to two of them. They will protect you from the damage, and also shoot a laser ray. They can be damaged and destroyed by enemy fire.","imageUrl":"https://media.rawg.io/media/screenshots/8bb/8bb707ed9790ec5544655db7aac357af.jpg","releaseYear":2015,"developer":"Ars Creativa","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19890,"name":"Forgotten Myths CCG","genre":"Strategy","price":0.0,"description":"Forgotten Myths is a free to play online collectible card game that incorporates deck building, card collection and strategic gameplay in a fantastic historical background incorporating several civilizations, myths and legends in the same storyline.\nFeatures\nFree to Play – You can acquire every card in-game by buying booster packs using earned currency, as long as you can devote more time in the game. This is the good free to play, no \"energy gates\" or \"exclusive to buying with real world cash\" cards.\nDoma City, 3D Starting Zone – Players will be immersed in this 3D environment where they will be able to access main game features.\nRPG Style Level and Rank Progression – You will be able to advance in levels and ranks to unlock special content and rewards, and compete in monthly leader boards.\nGuilds – Form your guild, gather your friends and challenge other guilds to reach the top! Work as a team, wage guild wars, and unlock special guild cards.\nTournaments – We are designing Draft, and Sealed tournament modes, where you can enter, defeat your opponents, and win special rewards!\n\"Duel\" Mode – A hard core duel match mode, where players will be able to bet cards from their collections against other players in a \"winner takes all\" duel.\n\"Multiplayer Co-op\" Mode – We are designing a special game mode where you will fight against dreadful monsters and sinister characters in a co-op mode with groups of 2 or 4.\nImmersing 3D Effects – Majority of the cards in Forgotten Myths have a specially designed 3D effect associated with an action or an ability; this is the true evolution of Trading Card Games to Digital.\nSimultaneous Gameplay – Each attack turn is taken at the same time allowing for constant interaction and positioning tactics.\nRemote Turn-Based Multiplayer – Play games with anyone in the world, from anywhere with internet access.\nHardcore Strategy – Most digital trading card games have oversimplified and gone all mainstream with their game mechanics. We've done the opposite and increased strategic depth by including positioning, and allowing different card types on the field.\nComprehensive Ever Changing Single Player Campaign – We have in depth Single Player Campaigns, that will have new maps, AIs and new quests added to it frequently.\nTransformable Battlefields – The default 3D Battlefield can be changed by unlocking quest rewards that allows you to completely change or customize the table top battlefield.\nDon't forget to visit http://forgottenmyths.com for game guide, media, full card list and more!","imageUrl":"https://media.rawg.io/media/screenshots/73d/73d686bb6d98f00d05aea93be16a8290.jpg","releaseYear":2016,"developer":"Anchora Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18376,"name":"DreamBreak","genre":"Action","price":0.0,"description":"'This looks like the most terrible mix of differing types of gameplay. I must have it!' - RPS Commenter\nAn authoritarian state pacifying the masses with propaganda. A brutal police force that shoots first then shoots some more.\nAn ordinary everyman named Eugene, dragged by coincidence and circumstance from a life of mundane menial tasks into a baffling world of sudden, inexplicable murder, hidden conspiracy and unrelentingly lethal robots with nasty sharp pincers and lasers coming out of everywhere.\nDepicted in a distinctive Cyrillic pixel art style the cyberpunk city crackles with tech-noir intrigue and neo-digital deceptions. Using every tool at your disposal help Eugene to unpick the knot of mystery that he has become enmeshed within – your equilibrium will be rocked as you point and click a path through this briar patch of tangled meaning and unexpected quixotic quirks.\nWill Eugene make sense of the conundrum that unfolds before him, learn who is an ally or a foe and collect lots of vinyl records for his listening pleasure? He'll race rapid hover bikes to earn sub-cultural respect, rub shoulders with high society in a post-modern nightclub, hack the brains of pursuing drone cops in thrill-packed chase sequences, strive to survive tense shootouts with merciless law enforcers and enjoy some 8-bit cowboy coin-op action in a dingy dive bar with a broken toilet.\nMultiple endings\nUnique blend of action, point and click and Russia\nGet fingered for murder\nSoviet Bloc Edition contains DreamBreak game with good Russian stuffs like:Original 19 track soundtrack recorded by Egor Gritsukov (.mp3 & .wav)\nDigital art book (.pdf)\nPack of 5 Wallpapers\nWalk-through (yeah good luck with that!) in Russian and 'English' (.pdf)","imageUrl":"https://media.rawg.io/media/screenshots/0f9/0f97804010f515022adbcf51a1b780fd.jpg","releaseYear":2016,"developer":"Digerati Distribution","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":16218,"name":"Enola","genre":"Adventure","price":0.0,"description":"Enola is a psychological adventure game that delves into the inherent darkness of love, death and revenge. As Enola, you must survive a macabre world conjured up by the tortured memories of her lover, Angelica.\nImmersed in this emotionally-charged and gripping story, as you decipher challenging death-traps. However, choose your path very carefully - An evil presence lurks in the shadows, watching your every move...\nHeavy on atmosphere, Enola is an experience that will crawl under your skin and stay there long after you’ve uncovered the disturbing mystery of this twisted, psychological nightmare.\nStory-driven - Enola is an adventure game that presents a captivating and intriguing story of death, revenge, and above all, love.\nMultiple endings - Your actions will ultimately decide whether or not you will be able to help Angelica.\nSuspense without paranormal elements - Enola pushes the emotional boundaries of the player, putting them in an isolated, defenseless state of mind.\nUnconstrained mechanics - The mix of first person mechanics and old-school adventure games allows players to keep track of clues and figure out puzzles without the constraints of traditional point-and-click interfaces.\nFrighteningly calculated traps - Death traps meant to put players' nerves to the test, where failing can mean death.\nSuperb voice acting and musical score. - Enola now offers a spine chilling soundtrack and immersive voice acting and sound effects. Superb voice acting and musical score.\nNIGHTMARE MODE: The updated ‘Nightmare Mode’ includes the anticipated and chilling in-depth look to Angelica’s broken mind, in addition to revelations about her traumatic past. New areas to explore are part of the update, as is three new endings, and predictions to the girl’s future…","imageUrl":"https://media.rawg.io/media/screenshots/5fb/5fba67506e28dcf786677e4c2de6eb38.jpg","releaseYear":2014,"developer":"The Domaginarium","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15049,"name":"Rescue the Great Demon 2","genre":"Adventure","price":0.0,"description":"Notice: This is a standalone full game. Any player who hasn’t played the previous game in the series can also enjoy it.\nHumans controlled the Sino continent. They made the rules, and annihilated every race that opposed them. Every one of them became their slaves, except other humans.\nDemons had been enslaved for 80 years since their army was destroyed and their leader, the Great Demon, was captured. This is where our story begins.\nIn Rescue the Great Demon 2 you will play as the weak Great Demon and discover a unique storyline. You will need to escape from your prison with your last six followers and try to survive in this chaotic continent.\nA horse, a carriage, a map, a story. Could you find the truth behind all this?\nFeatures\nA detailed semi-open world.\nPlay as the villain: Control the demon and fight humans.\nA game that mixes adventure with a classic RPG atmosphere.\nExplore the landscape of Baal-zebul full of different regions and created with a hand-drawn art style.\nAn original soundtrack\nA game made in RPG Maker that pushes the engine to its limits.","imageUrl":"https://media.rawg.io/media/screenshots/cb9/cb96a1533bae6806b63510a02cf09553.jpg","releaseYear":2016,"developer":"SleepAllDays Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14347,"name":"The Last Leviathan","genre":"Action","price":0.0,"description":"The Last Leviathan is a physics-based, ship building and destruction adventure. You construct battle ships to crush your adversaries and massacre the monsters you encounter around the ancient seas of Middenhir.\nOn your voyage to uncover where The Last Leviathan lies you will discover a world full of rival ships, mythical monsters, wrecked flotsam, physics-puzzles and hidden treasures.\nBuild Ships\nWith blocks bought, found or plundered, you’ll craft boats capable of conquering pirates, out manoeuvring racing ships, disintegrating towers high on the coastal hills and solving mysteries.\nNaval Encounters\nAcross the busy seas of Middenhir you’ll encounter many ships from clans far and wide. Some will be friendly and want to trade, others are looking for blood and booty - Yours!\nBattling Monsters\nSome say these behemoths are the descendants of The Last Leviathan, others just refuse to accept that they exist. Once you’ve seen one on the horizon you’ll wonder how you ever thought of anything else.\nMonster battles will be the pinnacle of your experience in The Last Leviathan. You’ll need to analyse the monster’s weaknesses, craft bigger weapons, build a specialised ship and then unleash the dogs of war with true, commanding skill.\nVoyage: Build, sail, navigate and fight across the seas, unveiling the secrets of Middenhir in a voyage of survival and discovery.\nCreative: Completely open sandbox for you to be inventive or just enjoy the sights and relax in.\nBattle Seas: An ocean of fights and challenges including: survival, last man standing, racing, waves, and many more that we (and you) haven't thought of yet!\nFull Steam Workshop integration allowing your ship designs to be shared and battled with or against. Leaderboards will track your uploaded ship’s performance in battle against members of the community.\nYou'll be able to Mod in many ways from Ship-AI, Cannon-AI, ship block creation and potentially even Battle Seas events.\nOur current version is a limited set of polished features for both Battle Seas and Creative modes. Voyage mode & Real-time multiplayer will be developed during Early Access.\nWe’ll be releasing on PC initially, then Mac and Linux versions during Early Access.\nWe’re Super Punk Games, a small indie developer based in Nottingham, England.\nTo get in touch about the game, you can find us hanging out in the Steam Community HUB or on our subreddit, Facebook & twitter. Use the link above to our website to find out more!\nThank you for reading to the end, you are clearly a Super Punk!","imageUrl":"https://media.rawg.io/media/screenshots/dd4/dd4869a887029493f112fe005ade9022.jpg","releaseYear":2016,"developer":"Super Punk Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14073,"name":"Tank Operations: European Campaign","genre":"Strategy","price":0.0,"description":"Tank Operations: European Campaign is a turn-based, tactical wargame featuring a dozen nail-biting historical scenarios set on the diverse battlefields of World War II. With more than 50 faithfully-rendered, authentic military combat units, along with sabotage options and the need to manage your supply chain, the game will keep armchair generals occupied for hours in realistic combat scenarios.\nBattle scenarios range from the landing of Allied troops in northwestern Africa to the invasion of Southern Italy, and wrap with the liberation of Paris and the final battle in Berlin.Key Features: Engaging and intense turn-based gameplay, feel the weight of the war on your shoulders as the AI reacts to your every move on the battlefield\nA dozen historical scenarios to challenge your combat acumen\n50+ authentic combat and support units, based on real-world tanks, planes and infantry\nDestroy bridges, Capture buildings or Jam Weapons with 10+ special skills,\nSupply Chain Management is key - make sure your forces are well armed and well fuelled for battle\nSabotage options allow you to covertly break the enemy’s supply chain, disrupting their well-laid combat plans","imageUrl":"https://media.rawg.io/media/screenshots/c1b/c1b6cd21fef8822bd97957d6175208ae.jpg","releaseYear":2013,"developer":"Headup Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]}]