[{"id":15747,"name":"After The End: The Harvest","genre":"Action","price":0.0,"description":"Humanity has all but disappeared from its original planet and home, with only its remnants remaining loosely scattered across the universe. Those who were not worthy did not graduate the cycle. By chance encounter with an intelligent being, you begin your journey to unravel the great mystery of the universe itself.\nAfter The End: The Harvest is an expansive open-universe RPG with the classic look and feel of a classic action adventure game. Be prepared to spend dozens of hours in this game collecting items, capturing and training creatures, hunting for achievements, and exploring derelict planets.\nKey Features\nA unique & non-linear story-driven experience\nCombines open-world game elements and classic RPG aesthetics\nAction RPG Combat with Rune/Socketing system\n100+ weapons,armors and spells\nPlenty of unique planets to discover, towns to explore and secrets to unearth\nOver 100 unique monsters to catch, train, and battle\nA plethora of side quests to explore\nTwo Modes with varying difficulty levels (Story Mode, Adventure Mode)\nTwo endings to discover\nNew Game+\nReal-time spaceship combat","imageUrl":"https://media.rawg.io/media/screenshots/9b3/9b31654c149c4ec2d06221b7f1c7521d.jpg","releaseYear":2015,"developer":"Elushis","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15296,"name":"Ohio Jack and The Cup Of Eternity","genre":"Action","price":0.0,"description":"InfiniTrap is a fast paced puzzle game for hardcore players. The game contains 40 levels and is available on Windows, OSX and Linux.\nEvery level starts with the player character standing on the start tile. The start tile is perfectly safe-- No, trust me. It's safe. Once you leave the start tile, you have a limited time to reach the treasure before the level crushes you. To complicate things, each level will include a number of obstacles to waste your time and possibly kill you. You can make your own levels!FEATURES\n40 challenging levels.Blood and gore can be disabled.Full gamepad support.A full-featured level editor.Custom levels support.Supported languages: English, French, German, Spanish, Russian, Japanese, Portuguese","imageUrl":"https://media.rawg.io/media/screenshots/037/037d5dfd14cd12d9d8dc9334a258059b.jpg","releaseYear":2015,"developer":"Shadebob Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14958,"name":"Balrum","genre":"Adventure","price":0.0,"description":"Balrum is an old-school, hybrid turn-based, open world indie RPG with deep tactical combat. Explore a huge living fantasy world with dozens of side quests next to an epic main quest. In addition to traditional RPG features Balrum has deep crafting which allows the player to craft their own custom items. Balrum also features farming your own crops, building your home, and survival mechanics complemented by the game's main features. In Balrum you will have a faithful animal companion as your pet. Your pet is fully controllable and adds greatly to the complexity of the combat.\nThe player takes control of a young man whose peaceful life is suddenly interrupted by events which will change his life forever.Features:Real-Time world with Turn-Based Combat\nA huge Open World with dozens of Dungeons to explore\nSpend your learning points to create a pure class or a hybrid class\nDozens of Side Quests and an Epic Main Quest\nThree separate paths leading to the end\nBuilding\nFarming\nTame various animals to be your loyal Companion\nDeep Crafting System which allows you to create custom items\nDay/Night Cycle with Weather Effects\nSurvival MechanicsStoryIt's twenty years after your village fled the kingdom and took refuge in Darkwood. You always knew that these woods hold dark secrets but now you start to feel it's evil on your own skin. Horrible things are happening. You discover fragments of the woods dark history and come to the conclusion that you have to leave your home. You know in your heart that once you step out of the protection of the place where you grown up, nothing will be the same. You have to face a world that's in chaos. A world without laws. Nevertheless you feel something else too. You feel freedom. A completely new world awaits you to explore it, but the feeling quickly turns into guilt. There are people in Darkwood who are counting on your help. You are their last hope.\nNOTE: Thank you to all our backers on Kickstarter for making this game possible.","imageUrl":"https://media.rawg.io/media/screenshots/b62/b6230f3269f31d53bfa3a8332b2fec65.jpg","releaseYear":2016,"developer":"Balcony Team","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14943,"name":"Kokurase - Episode 1","genre":"Adventure","price":0.0,"description":"Complete Bundle is Available now!Get 30% discount : store.steampowered.com/bundle/2204/\nAbout the GameEpisode 1 StoryThe Kokurase gang, also known as Cupid’s Helpers, is out to help freshman Sakura woo Yoshimitsu, a popular senior with every other girl in school vying for his heart.  Switch between Genji the leader, the newest member of the crew, Riho, the mysterious Meg, and Kanta, the supernatural sleuth, to bring these two lovebirds together in an intertwining tale.\nThe game begins with Sakura pining for Yoshimitsu to notice her, which catches the ear of Riho and the gang, who quickly make contact and begin to draw up plans to bring the two together.  Days of preparation pass culminating in a gambit to bring the freshman and junior together, requiring the player to execute a series of intricate tasks involving all characters.\n+*.COMPLETE BUNDLE IS AVAILABLE NOW.*+\nhttp://store.steampowered.com/bundle/2204/GameplayIn Kokurase, the player takes control of the various members of the Kokurase crew, Cupid’s Helpers, to facilitate Sakura and Yoshimitsu getting together in a winding tale of clever interactions.  Using Key Phrases, the different characters interact with each other and NPCs in the game world to move the story forward.Featuring:A Visual Novel in RPGmaker\nBeautiful art by an illustrator Doromizu\nFull of humor\nCast of quirky protagonists\nTake control of multiple characters to advance the plot\nUse Key Phrases to progress conversations\nExplore a High School campus\nSpeech Puzzles\nTeenage, Highschooler angst\n* Epsode 1 is free to play\n* Episode 2-3 are available as DLCs","imageUrl":"https://media.rawg.io/media/screenshots/e97/e9717712d644097ef5f3b9e44ed5ef09.jpg","releaseYear":2016,"developer":"Den-fami Nico Game Magazine","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11905,"name":"Microcosmum: survival of cells","genre":"Action","price":0.0,"description":"Microcosmum: survival of cells - real-time strategy game with a relaxing atmosphere and original gameplay.\nJoin the wonderful and amazing world of microorganisms. Become part of a natural selection in the microcosm. Enjoy the atmospheric music and this beautiful world. Relaxing gameplay and the whole atmosphere will let you lose yourself in the game. The freedom of control will let you create a large amount of different strategic manoeuvres. Become the only winner in this battle for survival.\nThe aim is to catch all your opponents. Improve your microorganisms to make them stronger. Attack and catch your opponents using parts of your microorganisms. Your way to victory lies through the circumspected strategy.\n•  High-quality graphics\n•  The originality of the gameplay\n•  Original game setting\n•  Full freedom control\n•  Opportunity for strategic maneuvers\n•  72 levels","imageUrl":"https://media.rawg.io/media/screenshots/c23/c23daa4152402d4ca3e4ed72f4ab27b2.jpg","releaseYear":2015,"developer":"Alexander Byzov","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10527,"name":"50 years","genre":"Strategy","price":0.0,"description":"- 50Year's is the strategy game that you protect clan and nations.\n- The number of nations is 11 and they have their own unique units.\n- You can make use of various strategies because clan members have many kinds of characters and ability levels.\n- You need to locate simple AIs and engage 5:5 battles.\n- You have to think about clan management as well as food, and the population of the nations.\n- Every 10 years, strong enemies will invade. If you cannot protect, the game will be over.\n- The difficulty level of the game is quite hardcore. You can see the ending with many challenges.\n- There are more than 100 politicians. Please vote carefully so that guide the clan to the right way.\n( There are some mal functioning functions in Early Access .\nIt will be open to the public later through the upgrading announcement, It will be fully opened in official release. )","imageUrl":"https://media.rawg.io/media/screenshots/421/4212d3fad00fb5d9d1f3c0f06b4c76f7.jpg","releaseYear":2016,"developer":"Aleksandr Golovkin","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10184,"name":"Last Days of Spring Visual Novel","genre":"Simulation","price":0.0,"description":"Check outhttp://store.steampowered.com/app/551520/?snr=1_7_7_230_150_1\nAbout the GameDo you remember your last week of high school?\nDo you remember the feeling of equal parts excitement and melancholy, as you knew your high school student days were coming to an end?\nHow about the nostalgia that ran through your body, as you knew you’d be saying goodbye to a place that had so many memories for you?\nLast Days of Spring is a YA (Young Adult) Otome Kinetic Novel following a group of high school seniors in their last week of school as they come to terms with questions about love, life and destiny. Follow the steps of Yuka Kishimoto as she navigates across her final week as a high school student and sees her life come to a complete change!\nWith a wistful and flowing narrative mixed with soothing music and a tasteful art-style this Visual Novel will bring you to a time when everything and nothing mattered. A time when you felt there was so much to explore but also so much to miss. Immerse yourself in this touching and sweet tale and decide how you would re-live your “Last Days of Spring”.\nGame Features:\n\nJapanese setting but using Native English vernacular and vocabulary.\nDeep and immersive story with charming and realistic characters.\nHigh quality original and unique artwork.\nOriginal Pop and Ambient Music\nFive different endings.","imageUrl":"https://media.rawg.io/media/screenshots/a15/a15c43a7fcca3c82569e4131ffe5e67c.jpg","releaseYear":2015,"developer":"Sapphire Dragon Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9556,"name":"Lazarus","genre":"Action","price":0.0,"description":"ADD LAZARUS TO YOUR WISHLIST AND/OR FOLLOW US!\nJOIN US ON DISCORD\nAbout the Game\nLazarus is a top-down action-oriented sci-fi twist on Groundhog Day where thousands of players survive together in a huge persistent real-time world, where dogfights, foraging for resources and exploring exciting new tech combine into a tumultuous 'MMO Roguelike' that turns back in on itself every week like some kind of ultra-futuristic Ouroboros.\nPlayers fight for their lives and the fate of the universe in a huge open universe stretching across 160,000km² of stars, black holes, nebulae and alien tech - vying for territory and power against three alien factions.\nExplore the world, dock and communicate with giant alien Xenotaphs, equip your ship, unlock new tech and then boost back out into fast paced real-time combat alongside hundreds and thousands of other players!\nCan humanity embrace the technology and capriciousness of the all-powerful Ourobeans and finally defeat the monstrous Apophis, or will the final battle repeat again and again into infinity?\nSOCIAL\nTwitter: @spiltmilkstudio\nDiscord: Channel here, Invite here\nCaffeine.tv: watch us stream here","imageUrl":"https://media.rawg.io/media/screenshots/c65/c65d8b00b30158ab263db7142a906f07.jpg","releaseYear":-1,"developer":"Spilt Milk Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":6679,"name":"Nevermind","genre":"Adventure","price":0.0,"description":"NOTE: You do NOT need a heart rate sensor to play Nevermind.\nWith or without a heart rate sensor, emotion-based biofeedback will be available via almost any standard webcam on a min-spec (or higher) Windows or Mac machine*.  Without a webcam or heart rate sensor, the biofeedback-specific features will be unavailable, but the core game itself will be fully playable and enjoyable as an atmospheric mystery-adventure game.\nNevermind is a biofeedback-enhanced psychological thriller that takes you into the dark and surreal world within the subconscious minds of psychological trauma patients.\nAs you solve puzzles and explore the twisted labyrinths of the mind, biofeedback technology monitors your feelings of fear, tension, and anxiety with each passing moment. If you let your fears get the best of you, the game becomes harder. If you’re able to calm yourself in the face of terror, the game will be more forgiving.\nNevermind’s goal is to create an unforgettable gameplay experience that can help teach you to be more aware of your unique internal responses to stressful situations. If you can learn to control your feelings of stress and anxiety within the disturbing realm of Nevermind, just imagine what you can do when faced with those inevitable stressful moments in the real world…\nA one-of-a-kind atmospheric terror game that can sense your feelings of fear—creating an experience unlike anything you've played before.\nA hauntingly surreal interpretation of psychological trauma.\nPlayers must unravel the mystery of each patient's buried trauma, exploring darkly beautiful landscapes, solving puzzles, and unearthing clues along the way.\nIf played with biofeedback technology, Nevermind challenges you to stay calm in the face of stressful scenarios, helping equip you with the tools to manage stress and anxiety in everyday life.\nSupports a range of biofeedback technology, virtual reality, and the Tobii EyeX eye-tracking controller.\nExtensive Intel® RealSense™ technology support for physiological biofeedback tracking, unique gesture detection, and facial recognition events that can ONLY be experienced with RealSense!\nAffectiva’s Affdex technology enables emotional biofeedback tracking via virtually any standard webcam!\nConfirmed physiological biofeedback detection via the Apple Watch**, Wild Divine IomPE, Garmin Heart Rate Chest Strap, Mio LINK sensors, and more!\nPlayers can combine both physiological and emotional biofeedback for an incredibly accurate and responsive experience!\nFor more information about supported devices, please see http://www.nevermindgame.com/tech\n* Note: Webcam-based biofeedback is unavailable when played on VR platforms. For more information on our supported technologies and compatibilities, please visit: www.nevermindgame.com/tech\n** To play Nevermind while using an Apple Watch, you must also download the Apple Watch app. For more information on how to use the Apple Watch with Nevermind and links to where you can download the app, please visit: www.nevermindgame.com/AppleWatch\n...\nDISCLAIMER\nThis game has not been evaluated by the U.S. FDA and is not intended to diagnose, treat, cure, or prevent any disease. The consumer-grade technologies supported by Nevermind are not medical devices nor should they be considered medical instruments.\nTobii EyeX Eye-Tracking Controller\nWith a Tobii EyeX eye-tracking controller, several aspects of the game can be influenced by simple eye movement - unlocking new features throughout the entire game as well as some brand new surprises within each level.\nFor more information about the Tobii EyeX, please see http://www.tobii.com/xperience/\nGAME PADS\nNevermind currently has limited controller support for several D-pad based controllers (NOTE: a keyboard is still needed to enter the doctor’s name during the registration process).\nWe currently support:\nWired USB Xbox 360 Controller\nWired USB Xbox One Controller\nLogitech’s RumblePad 2 Controller\nLogitech Gamepad F310\nLogitech Gamepad F710\nNevermind supports Razer Chroma technology! For more information about Razer Chroma, please see http://www.razerzone.com/chroma\nWe are hoping to support additional controllers in future updates.","imageUrl":"https://media.rawg.io/media/screenshots/18b/18bab6f6e7e008453a256abbba9d8bbe.jpg","releaseYear":2015,"developer":"Flying Mollusk","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3762,"name":"PAC-MAN MUSEUM","genre":"Action","price":0.0,"description":"PAC-MAN stars in a nostalgia-packed collection of the greatest PAC-MAN games of all time. PAC-MAN MUSEUM will include classic PAC-MAN titles as well as newer releases, allowing gamers to play through the evolution of PAC-MAN from his humble beginnings from 1980 through current hits like PAC-MAN Championship Edition and PAC-MAN Battle Royale.KeyFeaturesClassic PAC-MAN Games – Includes hits such as PAC-MAN, SUPER PAC-MAN, PAC-LAND, PAC-MAN Battle Royale, PAC-MAN Championship Edition, and more\nPAC-MAN Navigation System – Assists players by helping them find the best routes through mazes\nStage Save Function – Allows you to save your progress between stages\nMultiplayer PAC-MAN – For the first time, PAC-MAN Battle Royale brings the 4-player arcade hit homeOnline FeaturesWorldwide Leaderboards – Challenge the best players in the world on your favorite PAC-MAN games","imageUrl":"https://media.rawg.io/media/screenshots/ba5/ba54ae1f28bcc1164c777e87ffd185c0.jpg","releaseYear":2014,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":785,"name":"Gary the Gull","genre":"Adventure","price":0.0,"description":"Gary the Gull is an VR Interactive Animated Short Film where you are part of the story!\nYou're about to enjoy a tasty lunch on a beach when a seagull shows up and starts talking to you. And you can talk back! Answer Gary's questions by nodding or shaking your head, talking (using voice recognition), or by doing nothing at all. Your decisions affect how the story plays out, giving you different experiences of the same narrative when you try it again. Interact with the environment by using motion controllers to draw in the sand, pick up your drink, or toss your flip-flops around on the beach.\nGary the Gull is directed by Mark Walsh of Motional, an 18-year Pixar writer-director and animation supervisor, including the director of the Pixar short film Partysaurus Rex. It was built in partnership with the ex-Pixar ex-Bungie team at Limitless.","imageUrl":"https://media.rawg.io/media/screenshots/bfc/bfcf9735b82c91431d838bbc649d3ec9.jpg","releaseYear":2016,"developer":"Limitless Sky Squadron","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":966237,"name":"Heretic's Fork","genre":"Action","price":0.0,"description":"Thank you for submitting your application for the position of Hell's Manager. We are pleased to offer you the job and extend a warm welcome to our team. As you may know, we have some overpopulation issues that we believe can be resolved with your help.\nYour role will involve not only managing the current population but also implementing innovative strategies to streamline our operations. You will be tasked with punishing sinners using our state-of-the-art computer system, HERETIC'S FORK, developed by DeusVult Inc.\nWe are confident that your skills and expertise will greatly contribute to maintaining order and efficiency in our unique environment. We look forward to having you on board and seeing the positive impact you will bring to our organization.\n1. Choose a demon to act as your subordinate who will manage all site operations.\n2. Protect the rift between Hell and Earth from escape attempts by dwelling heretics.\n3. Punish sinners with monstrous towers that deal Holy, Unholy, and Hellfire damage.\n4. Plan strategies and build strength using our deck-building system.\n5. Achieve great results to receive more cards for your deck.\n6. Work for various departments, each representing a circle of Hell, and cooperate with them.\n7. Ensure that sinners do not damage our property by keeping them from passing through.\n8. Receive wages for each shift based on the number of sinners punished. Your success depends solely on you.\n9. Be an integral part of our fun and delightful team with a shared dark sense of humor.","imageUrl":"https://media.rawg.io/media/screenshots/954/9540cf4960fa3a3880ccfa2cc63b8d2f.jpg","releaseYear":2023,"developer":"9FingerGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":764999,"name":"King of Kinks","genre":"RPG","price":0.0,"description":"King of Kinks is the latest quick pace fantasy RPG that will have you coming back for more.\nWith a perfect balance of relaxing gameplay and strategy-based squad building, you’ll be getting the best of both worlds.\nKing of Kinks sets you out on a mission to reclaim the throne of the Kingdom of Clouds while recruiting each and every merciless beauty that comes across your way in this expansive fantasy world.\nYou will have your pick of hotties, from noble kink queens to thirsty temptresses. You might also stumble upon inhuman beauties, ready to suck you dry - whether in a nice or naughty way, that’s all up to you.\nBeyond the sex, King of Kinks is also a compelling and engaging RPG. The auto quick-speed combat and strategic elements work to give players the best experience on the market.\nFor bonus points, rewards work on an AFK basis: play the game, go do your thing, come back and collect the rewards that piled up while you were offline.\nThrough various game modes, limited events, and the good ol luck of the draw in the Gacha, you’ll be ready to take over the kingdom in no time.\nBuild up your team of hotties! Heroes will battle for you automatically, you can collect offline rewards just by tapping the AFK chest when you log in next. You can always jump right back into the adventure, with new content being regularly updated!\nProgress through the campaign, see how long you can last, and climb to the top of the ranks!\nEnjoy automated and double-speed battles that allow you to win big with just a few taps! There are more than a thousand combat stages to take part in. Figure out the perfect combos & skills and get yourself an unbeatable squad.\nStrategize your squads while keeping each girl’s unique fighting style in mind! The active and passive skills of the girls can be crucial in battles. Evolve your heroes to unlock bonds to strengthen your squad!\nMeet over 40 beauties and have kinky sex with each and every one of them! Summon hot girls and evolve them to unlock their uncensored H-scenes!\nGet spicy private messages from the girls you meet during your adventure via the Chat functionality! Fulfill their desires and unlock their secret scenes.\nUnlock and level up goddesses and they will aid you in your battles! By seducing goddesses you can raise their Intimacy and unlock three videos for each of them. Plus, they are powerful allies that will help you overcome the difficult stages.\nEvents are held every month at regular intervals, giving you the perfect opportunity to exchange event items to obtain character fragments and rare items.","imageUrl":"https://media.rawg.io/media/screenshots/8bc/8bc4a377414d6e1ae1f6bf47efe682c3.jpg","releaseYear":-1,"developer":"Dragon Power House","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":627610,"name":"UpGun","genre":"Action","price":0.0,"description":"Get one skill each round\n...to oppose your friends!\nSurprise and counter play your opponent by choosing the wisest upgrade each round!\nChoose from more than 50 skills and upgrades!\nSkills go from Health bonus, to exploding bullets, or even grenade-spawning-grenades.Make your build and make your own strategy!Equip specific upgrades to counter synergies, specialize in long-range shooting if your opponent has explosives, or turn into a bomb if your opponent is playing melee.Customize your characterCollect cosmetics and hats to customize your robot to your image! Over a hundred cosmetics are available.Diverse mapsEach of the maps is different and unique. Each of them emphasizes one type of game and gives more interest to certain abilities to vary the synergies.Other featuresLAN is supported\nCartoon inspired style\nAnimation variations\nSteam inventory","imageUrl":"https://media.rawg.io/media/screenshots/bb1/bb1e3f73362078bc85b0fe15d44a1222.jpg","releaseYear":-1,"developer":"MaxEstLa","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":622494,"name":"Mario Party Superstars","genre":"Arcade","price":0.0,"description":"A Superstar collection of classic Nintendo 64™ boards\nCalling all superstars! The Mario Party™ series is back with 5 classic boards from the Nintendo 64 Mario Party games. Race to get the most stars (and sabotage your opponents) on boards like the stellar Space Land or the spooky Horror Land! Party at your own pace by suspending a game and picking up right where you left off! The tides can turn quickly in Mario Party, so stay vigilant, partygoers. All modes can be played online*, too!\n\nPlay 100 classic minigames from the Nintendo 64 and Nintendo GameCube™ games and more in Mt. Minigames!\n\nTry your hand at a superstar collection of minigames from throughout the Mario Party series. Whether you are saving up coins for stars in board game mode or enjoy one of the 7 modes included in Mt. Minigames, there is nothing quite like being the last one standing in Bumper Balls or the first team making it out of the darkness in Dungeon Duos. All minigames are played with button controls, so you can stick to the Joy-Con™ controller or bust out the Nintendo Switch™ Pro Controller or a Nintendo Switch Lite system.\n\nParty with superstars near or far\n\nBring the party anytime, anywhere with same-system**, local wireless**, or online* play. Use stickers to praise or pester fellow players as you race across the board collecting stars. All modes support online multiplayer, so you can hop in with friends for a few minigames or a marathon 30-turn match. Victory is just as sweet (and stealing stars is just as satisfying) from anywhere across the globe.","imageUrl":"https://media.rawg.io/media/games/92c/92cb7c505365879a95d08fe11cc6ac8b.jpg","releaseYear":2021,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":485226,"name":"Cobra Kai: The Karate Kid Saga Continues","genre":"Action","price":0.0,"description":"Choose a side, master your moves, and embrace your destiny in an epic beat 'em up adventure inspired by the hit show. Take control of 8 playable characters with deep movesets, combos, progression, real-time character swaps, ultimate attacks, and much more! 34 years after the events of the 1984 All Valley Karate Tournament, the rivalry of Daniel LaRusso and Johnny Lawrence continues. The fight is in your hands now!\n\n•Two-Fold Storyline - Featuring an all-new storyline filled with unique cutscenes and dialog-choose to take control of Daniel and his students at Miyagi-Do Karate through a storyline campaign. Or select their rivals, Johnny Lawrence and his disciples at Cobra Kai to play their side of the story. Completing both sides of the campaign unveils an ultimate ending.\n•RPG-Like Dojo Progression - Master 40 unique skills and upgrade your characters' stats as you karate your way through enemies.\n•Character Swap System - Choose your Dojo then seamlessly swap between your favorite characters within, including Miyagi Do's Daniel, Robby, Sam and Demetri; or Cobra Kai's Johnny, Miguel, Hawk and Tory.\n•Live the Cobra Kai Universe - Explore Los Angeles across 28 missions filled with characters and enemies from the show!\n•Authentic Cobra Kai Experience - Featuring the voices of William Zabka, Ralph Macchio and other top-tier cast, along with an exclusive soundtrack from the creators of the Cobra Kai show.","imageUrl":"https://media.rawg.io/media/games/d59/d595e078405821fb3f75dab4591d64af.jpg","releaseYear":2020,"developer":"GameMill Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":400295,"name":"Soul Calibur II","genre":"Fighting","price":0.0,"description":"SoulCalibur II (ソウルキャリバーII Sōrukyaribā Tsū) is a 2002 fighting game developed by Project Soul and published by Namco and the third installment in the Soulcalibur series of weapon-based fighting games. It is the sequel to Soulcalibur, which was released in July 1998. Originally intended to be released on Sega's NAOMI board,[4] the game was released on the Namco System 246 arcade board before being ported to the PlayStation 2, GameCube, and Xbox in 2003.\n\nThe game's plot revolves around the legendary weapon Soul Edge having been shattered into pieces, with different characters seeking to collect all the pieces to gain possession of the complete weapon or to destroy it once and for all. Compared to Soulcalibur, Soulcalibur II had improvements in graphics and the game system and introduced several new and guest characters. This is the first Soul game depicting the 1590 A.D. trilogy, which ends in Soulcalibur IV.\n\nThe game was a major critical and commercial success. Its high-definition port, titled SoulCalibur II HD Online, was released for the PlayStation 3 and Xbox 360 in 2013.","imageUrl":"https://media.rawg.io/media/screenshots/570/570a6ed91febd5f3ffc889368e13a46e.jpg","releaseYear":2002,"developer":"Project Soul","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":292958,"name":"Creo God Simulator","genre":"Strategy","price":0.0,"description":"BUILD. SMITE. REPEAT.\nCreo God Simulator is a game of building, decision-making, survival, and a ton of peasant smiting. As a newly-assigned lesser god, it's your job to build a society bit by bit, while convincing your new population to believe in you as their one true god.\nDuring your time as a god, you will discover new powers to use and more advanced buildings to place, but beware, as you progress, the randomized events generated by the AI enemy gods become more difficult. Can you beat the enemy gods and prove yourself as the one true God, or will you slowly fade from the memory of the people you created?FEATURES\nWith God Powers come God Responsibilities\nIn Creo God Simulator, you are the god. You are given incredible power to build great cities and smite the lowliest peasant. Here are some of the features regarding your newly-found godhood:\nName your Religion and God NameFaith/Fear System: Your actions affect your follower's opinions of youAwesome God Powers: Meteors, lightning, the power's in your handsTown villagers have the ability to convert each other without your influence or approval (just like in the real world!)\nBuild a Great Civilization\nCreo's unique build system allows you to place buildings in any position you want. Do you want a new shopping center? Go for it! Or perhaps a ghetto surrounding your mines? With Creo's build system, your imagination is the limit!\nFree-form building placementA variety of building types and modelsCreo-specific architecture style\nA New Gaming Experience—Every Time You Play\nCreo God Simulator boasts a procedurally generated world, quests, and events! No two playthroughs will ever be the same. Things could be going smoothly for your town, when suddenly, a raiding party attacks, while a volcano erupts, and locusts swarms descend upon your farms—this is just one example of the limitless stories that you can experience in Creo.\nProcedurally-generated maps, quests, and game eventsA wide variety of quest types and solutionsVillagers have unique names, beliefs, and opinions","imageUrl":"https://media.rawg.io/media/screenshots/38e/38e4d7903423f2c0d1d658d87add19d8.jpg","releaseYear":2018,"developer":"8bit_bento","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":266219,"name":"Where The Water Tastes Like Wine: Fireside Chats","genre":"Adventure","price":0.0,"description":"Where the Water Tastes Like Wine: Fireside Chats is a free standalone experience which acts as a companion to Where The Water Tastes Like Wine.\nAvailable as a separate download, Fireside Chats adds exclusive story content for all of the folktales from the main game’s sixteen characters. It also makes the entirety of the Dire Wolf’s first chapter from the full game playable for free for those who have yet to experience this unique journey through a century of Americana.\nWhere the Water Tastes Like Wine is an imaginative trek through history featuring gorgeous 2D/3D visuals and original folk music. Meet surreal characters as you explore the nation’s most distant haunts, collecting and sharing an eclectic medley of stories from some of today’s most prolific writers. Bringing them all to life is a remarkable cast of voice talent, including renowned singer-songwriter, musician and actor Sting, Dave Fennoy (The Walking Dead: A Telltale Games Series), Cissy Jones (Firewatch), Kimberly Brooks (Mass Effect) and more.\nLike the full game, the Where The Water Tastes Like Wine: Fireside Chats experience allows players wander through the United States - and through a century of history - to meet a variety of people, each with their own stories to tell.FeaturesA variety of folk tales and personal stories to encounter, told by characters from all over America\nBeautiful combination of 3D overworld and 2D illustration in its own unique style\nStories by a wide selection of excellent writers\nAn emerging fantastical, psychedelic, surreal, and creepy tinge as the game continues","imageUrl":"https://media.rawg.io/media/screenshots/045/045c024f37a4b27548d17a4f1d478c66.jpg","releaseYear":2018,"developer":"Serenity Forge","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":220156,"name":"Zoo 2: Animal Park","genre":"Adventure","price":0.0,"description":"ZOO 2: ANIMAL PARK – YOUR AMAZING ZOO AND ANIMAL GAME\nIn the captivating animal game Zoo 2: Animal Park, you slip into the role of a zoo director. Take care of ferocious tigers and wily wolves, play with cute foxes and pandas, or pet the elephants and giraffes. Dive into an exciting zoo game story with lots of quirky ideas and unexpected plot twists.\nFANTASTIC ANIMAL GAME FEATURES\nDiscover an extraordinary combination of zookeeper simulation and tycoon game. Explore a colorful and captivating game world full of snuggly bunnies, playful horses and sweet chimpanzees. Breed all sorts of cute animal babies, scrub enclosures and expand your park. Zoo 2: Animal Park boars a wide range of animal game features and customization options. This one-of-a-kind zoo game has a lot to offer:\nTake care of cute domestic and wild animals: Mischievous goats, playful pandas, majestic lions and more want to play with you!\nDesign your zoo: New tycoon features or items are unlocked with every level up. Get more flowers, bushes, and trees; build new types of enclosures, shops, restrooms, benches and more\nDive into a lovingly-detailed world: Meticulous animal animations and impressive 3D graphics will keep you immersed in the action\nBreed adorable baby animals: Rare coat color variations will make your animal world even more colorful!\nBe part of a gripping story: Entertaining tasks and quests will guide you along in the flourishing zoo of your dreams and introduce a quirky cast of lovable characters\nParticipate in exciting events: Regular updates and thrilling events with exclusive rewards provide long-lasting fun\nExpand your zoo: Earn achievements in this animal game as you make the zoo of your dreams a reality\nA FUN WILD ANIMAL SIMULATION\nZoo 2: Animal Park whisks you away into a breathtaking zoo game setting. There’s always something new to discover! Prove your skill as a manager and turn the small family zoo into the greatest animal park paradise on the planet! Experience the animal game sensation.\nNote: Zoo 2: Animal Park can only be played online. Existing browser game or app accounts cannot be linked to Steam.","imageUrl":"https://media.rawg.io/media/screenshots/0ca/0cac4676dc1c13884a0475ab03f3ec9a.jpg","releaseYear":2018,"developer":"KING Art","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":61190,"name":"Her Lie I Tried To Believe","genre":"Casual","price":0.0,"description":"Disclaimer: This game contains disturbing subject matters, and might not be for everyone.\nFor reasons he doesn’t even know about, Tim has always felt hatred toward her. It could be because of her eyes. It could be because of her smile. Or it could simply be because she’s alive. The underlying causes can sometimes come from unexpected depths after all.\nThe only thing he knows for sure is that he saw her as a rival.\nTo defeat her. To humiliate her. To destroy her. For the first 16 years of his life, he drew breaths for those reasons alone.\nBut then… nothing. They eventually went their separate ways, as change is the inevitability that comes with those younger years.\nConfronted with this sudden change, Tim had no other choice but to keep on moving forward, and finally adapted to a dull, productive lifestyle, forgetting even the fact that he once bore such animosity inside of him.\nUntil he met her again, that is.\nHer Lie I Tried To Believe is a short kinetic novel about the persisting hatred of a boy throughout his life, the destructive relationship that was born from it, and the consequences he had to face as a direct result.","imageUrl":"https://media.rawg.io/media/screenshots/86c/86ccd7146373b87e247faa5339dbf68e.jpg","releaseYear":2018,"developer":"Hangover Cat Purrroduction","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":60074,"name":"Arkham Horror: Mother's Embrace","genre":"Adventure","price":0.0,"description":"In 1926, a team of investigators try to uncover the dark secrets of an eerie mansion. Finding weapons, tools, and information will be the only way to solve complex puzzles and fight living nightmares, insanity, and death.\nIt will take more than just survival to conquer the evils terrorizing the town.\nWill the team make it out alive and solve the mystery?\nAbout Mansions of Madness\nInspired by the award-winning board game, Mansions of Madness, this Lovecraft-inspired third-person game combines horror, mystery and adventure, where investigators, searching for answers in cursed places, will be struggling to survive with their minds intact.\nDo you dare enter the Mansions of Madness ?","imageUrl":"https://media.rawg.io/media/screenshots/f27/f270efa9dcca45a3b06af5bea96329a2.jpg","releaseYear":2021,"developer":"Asmodee Digital","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":58327,"name":"The Bard's Tale IV: Barrows Deep","genre":"RPG","price":0.0,"description":"Over one hundred years later, the terrible events of Skara Brae’s violent destruction are nearly forgotten. In dark ruins below, an evil has waited patiently. Until now. Fanatics are gathering control, the famous Adventurers Guild has been outlawed, and you must rise up in defiance to become the hero that the realm needs.\nCraft Your Characters\nCreate your own characters and play as a Bard, Fighter, Practitioner or Rogue. Each archetype features 60-70 skills and between 4-6 unique classes. Choose one of seven cultures to build an array of characters which make each playthrough a unique experience.\nChoose Your Companions\nStart your party with a single adventurer. Recruit new heroes to bolster your ranks. Level up and customize their skills and gear. Build a party that suits your unique play style!\nOutsmart Evil\nBattle your enemies in challenging turn-based tactical combat that rewards clever thinking. Use superior strategies, thoughtful positioning, and deadly combos to bring down your foes.\nUnlock the Secrets of the Past\nExplore mysteries that challenge the sharpest minds. Solve over 200 demanding puzzles. Claim advantageous rewards hidden for those bold enough to seek them out!\nRecover Powerful Artifacts\nRetrieve varied kinds of ancient Elven weapons which inherit mystical powers from a long-forgotten past. Unlock their true potential step-by-step by solving their unique mysteries, providing you with deadly advantages in the battles that lie ahead.","imageUrl":"https://media.rawg.io/media/games/872/8720af516f3a3d6c5ef6a848ad724714.jpg","releaseYear":2018,"developer":"InXile Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":49622,"name":"King of the Couch: Zoovival","genre":"Action","price":0.0,"description":"The gameNature is harsh. Only the most adapted will survive. Following a thorough study of nature, Loophole Interactive is proud to bring you King of the Couch: Zoovival! Take up the role as one of nature's toughest zoovivors as they battle it out using tools commonly found in nature, such as a mind control gun. Save yourself from a cheese wheel running amok by swinging yourself to safety using a grappling hook. Chug baguettes at your friends under the wrathful eyes of a pissed of volcano. All part of natural selection!Features:2D battle platformer with 3D graphics\nUp to 4 players versus eachother\nUse a grappling hook to move around\nLots of funky weapons commonly found in nature\nAll-natural, realistic weapon-classes\nPlay as a bear, a fish, a frog or a chicken\nVarious arenas with game-changing mechanics","imageUrl":"https://media.rawg.io/media/screenshots/14f/14f9a4403ad7c087fa37fc3e50294295.jpg","releaseYear":2018,"developer":"Loophole Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46229,"name":"Skyraine","genre":"Strategy","price":0.0,"description":"Skyraine is an action packed platform/missile defender game. Stranded on an alien planet, an ancient turret is your only defense against the invasion. Between waves of enemies rush repair your base and collect supplies and power-ups. As the game progresses new enemies enter the battlefield, each with their own devastating weapons. While aim and precision may help you get through the early levels, only with the perfect strategy can you hope to conquer the final difficulty. Play with up to 3 players in local multiplayer, and face 4 exponentially challenging difficulties.\nThe Base:\nWalled in between a shield generator, your turret lies on the ancient ruins of an extinct civilization. A few rusted girders and ladders are all that remain.\nThe Power-ups:\nBasic ammo- It's unlimited. I don't know how, I don't know why, I don't really care, it's free. Spray and pray, baby.\nShotguns- The most plentiful power-up, instead of shooting one bullet, it shoots like 20. Limited range though.\nDiscblades- The most versatile ammunition, it'll shoot through almost anything.\nVortexes- The most dangerous one. It destroys anything that gets caught in it's void, so don't shoot things too close.\nZappy's- The best way to clear the screen, hit an enemy with one of these and it will chain to nearby enemies as well. They drop rarely though, so use them wisely.\nThe Supplies:\nSupply ships- When the music changes you know they're coming. That's your cue to grab all the crates it drops and repair your base.\nLadders and girders- The most basic of supplies, use these to expand the reach of your base above and below ground.\nBatteries: Load these into a shield generator and it will completely heal the shield AND fix the generator.\nMines: Quite useful devices, you can place them on the ground, or send them into the air! Just don't be around it when it goes off...\nAutoguns: Why shoot when you can get something to shoot for you? While they have limited ammo, they're nice to have around to take out those pesky spiders.\nZappy mines: zappy + mine = ???\nThe enemies:\nBomber- The most basic of bad guys, shoot it before it shoots you.\nSpiders- Instead of catching bugs these evil insectoids catch your supplies! While they can't go too far above ground, they might catch you when they pop up to the surface!\nSuckerships- Possibly the most destructive enemy, these breathing blimps suck the life out of you by taking anything that gets caught in it's whirlwind.\nMech Dogs- Clanking across the screen, these mechanical beasts want to feast... on your shield generators! Breaking through girders and ladders, nothing short of a mine will stop this beast from reaching its target!\nSuicide ships- While the ships themselves don't do too much, it's the explosion that counts! Don't let it hit you while you're out of the turret!\nShield Ships- With a ton of health, these low-cruisers like to steal the attention while it's buddies blow up your base. Find the right power-ups to take it out fast.\nTransports- Light-armored ships, they don't cause too much of a threat. What they drop does.\nCorrosive bugs- After a nice long trip on the Transport, these little guys are hungry for just about anything, girders, ladders, your shield, it's all food to them.\nSoldiers- These guys come out of a crate like a clown car. Running at your base, they pile on top of each other like zombies until they find a way in. After that...it's all over.\nScorpions- Scorpions can't be that scary right? Wrong. Very wrong.","imageUrl":"https://media.rawg.io/media/screenshots/b6d/b6d696d455705fd690ac6892d07c46af.jpg","releaseYear":2017,"developer":"DHTstudios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45998,"name":"Juniper's Knot","genre":"Casual","price":0.0,"description":"Juniper's Knot is a short (~30 mins) kinetic novel about the meeting of a demon and a boy. A kinetic novel is a game that uses text, sound, and illustrations to tell a story. There is no gameplay, just click to progress!What is Juniper's Knot?\nJuniper's Knot is a short kinetic novel about the meeting of a demon and a boy. It begins on an autumn afternoon in a silent town. Due to its length, saying much more might spoil it for you. It's free, so if you're curious just try it out!Key Features An engaging story that won't take up much of your time!\nA soundtrack of 9 unique songs from CombatPlayer!\nAn unlockable gallery of 30+ illustration, concepts, and guest art!Soundtrack Included\nJuniper's Knot includes the official soundtrack absolutely free! Enjoy a total of 9 tracks in both MP3 and FLAC. The album is included with the game files. To access, right click the \"Juniper's Knot\" entry in your library, click \"properties\", then go to the \"local files\" tab, and click the \"browse local files\" button. Look for the \"soundtrack\" folder.","imageUrl":"https://media.rawg.io/media/screenshots/fa8/fa8796e8be9581580464e03f72719b9d.jpg","releaseYear":2012,"developer":"Dischan Media","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":42191,"name":"Yakuza","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/f50/f5023ef71feabf852b538b1d45e6466c.jpg","releaseYear":2005,"developer":"Amusement Vision","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":29021,"name":"DEF JAM: ICON","genre":"Arcade","price":0.0,"description":"DEF JAM: ICON™ features hip hop’s hottest music seamlessly infused into the world around you, the game’s environments pulsate, crumble, and explode to life with every bone-jarring beat. Time your attacks to the driving bass and use falling debris and exposed environmental hazards to pound your rivals.","imageUrl":"https://media.rawg.io/media/screenshots/77d/77d970c796548d818a67273ba39cd93c.jpg","releaseYear":2007,"developer":"Electronic Arts Chicago","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":28504,"name":"Bankshot Billiards 2","genre":"Sports","price":0.0,"description":"Play nine different styles, from classic 8-Ball to Trick Shots. Turn on Aiming Aid to practice your shots, then challenge opponents on Xbox 360 Live.","imageUrl":"https://media.rawg.io/media/games/0d7/0d780246925118cc8095eeae53e441dc.jpg","releaseYear":2010,"developer":"Pixelstorm entertainment studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":26968,"name":"Skylanders SWAP Force","genre":"Action","price":0.0,"description":"Embark on an exciting new adventure with the Skylanders and the SWAP\nForce. For generations, the SWAP Force protected the volcano that\nreplenishes Skylands’ magic. That is until an epic battle caught them in\nan eruption that blasted them apart, sent them to Earth and gave them\nthe ability swap powers. Only you can mix and match their tops and\nbottoms, put them on the new Portal of Power and help save Skylands.\n\nStarter Pack includes: 1-Video Game, 1-Portal of Power, 3-Skylanders\nFigures, 1-Character Collector Poster, 3-Sticker Sheets with Secret\nCodes and 3-Trading Cards.","imageUrl":"https://media.rawg.io/media/screenshots/554/554ad6e1503372d32b04c5591ded9fc8.jpg","releaseYear":2013,"developer":"Beenox","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"}]},{"id":26410,"name":"Green Day: Rock Band","genre":"Arcade","price":0.0,"description":"Green Day: Rock Band puts players on stage as multi-platinum selling and\nGrammy Award winning group Green Day, featuring the band’s most-defining\nalbums and key moments throughout their career to date. Players perform\nvocals, guitar, bass and drums using award-winning Rock Band technology.\n3D visuals and archival material give players a unique view into the\nmusic and vision of this pioneering band.\n\nFeatures\n\n• 3D custom characters featuring likeness of Green Day members Billie\nJoe Armstrong, Mike Dirnt, and Tre' Cool, as well as select venues and\nart specific to the band's history.\n• Unlockable prizes as you\nproceed through the game.\n• All Green Day DLC can be imported onto\nyour Green Day game disk, unlocking unique venue visuals and archival\nmaterials.\nTRACKLIST\nExperience 47 Green Day songs, featuring a\ncollection of the band’s greatest hits, including American Idiot, Wake\nMe Up When September Ends, Boulevard of Broken Dreams, Brain Stew/Jaded,\nand Hitchin’ a Ride.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","imageUrl":"https://media.rawg.io/media/games/c89/c89d98435e3ff94624370c996ef7bf63.jpg","releaseYear":2010,"developer":"Harmonix Music Systems","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22573,"name":"Intelligent Design: An Evolutionary Sandbox","genre":"Strategy","price":0.0,"description":"In a universe driven by targets, a faceless corporation employs you to create an evolving ecosystem you can never hope to control...\nIntelligent Design: An Evolutionary Sandbox is a god game with fully simulated genetics and evolution. Create species of plants, herbivores and carnivores and try to control the ever evolving ecosystem. Design and create genetically modified organisms, but remember when you start tampering with genetics it is hard to undo your mistakes...Key Features\nFully modelled genetics and evolution\nThe behaviour and appearance of each organism are determined by their genetics.  How tall will a plant grow? How fast can an herbivore run? How often does a carnivore seek prey?  These genetics are passed down generation after generation, with random mutations caused by radiation.  Evolution is fully simulated, there are no tricks or statistical approximations. You are watching life evolve on your computer.\nWeather and Climate Model\nTemperature, humidity and wind are all modelled in the game.  The weather and climate effect your organisms and perhaps your actions affect the climate as well…\nGenetic Engineering\nOne of your key objectives is to investigate the organisms you create.  Build collectors to harvest resources and research stations to observe the organisms.  Eventually you will unlock the secrets of genetic engineering.  Create your own genetically modified organisms, but be careful, once a genome has entered your ecosystem it may be hard to undo the damage…\nScience to be Done\nWhat do all those genes actually do?  How is the world score calculated?  What does world efficiency even mean?  Much like a real scientist you will need to investigate, analyse and work with other players to try and answer these questions.  To help you along the way the game outputs data in xml files so you can really get your science on.\nSecrets to Discover\nWho is employing you to create this ecosystem? Why are they doing it? Why are you doing it? What are those targets for? The answers to these any many other questions are out there, you just need to work together and find them...","imageUrl":"https://media.rawg.io/media/screenshots/bc3/bc3092dfc95ca8313eea2998eb52787e.jpg","releaseYear":2017,"developer":"Pill Bug Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":22488,"name":"Project Freedom","genre":"Action","price":0.0,"description":"Get your dream job with a company called Project Freedom. Become a space pilot and serve for the corporation. You're going to get all the excitement and adventure you've ever wanted.\n\nPerhaps even more...\n21 missions in the campaign\nOutstanding 3D graphics and special effects\nOriginal storyline with unexpected turns and surprises\nA variety of space combat missions including escort, strike, and rescue operations\nMissions in open space, on planets and moons\n","imageUrl":"https://media.rawg.io/media/screenshots/c5c/c5c8eeed4ac0d54098b55fa13af43f3c.jpg","releaseYear":2009,"developer":"City Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22408,"name":"Bejeweled 2 Deluxe","genre":"Casual","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/0b4/0b4c625c0730e0f3a417c013a7f2060e.jpg","releaseYear":2006,"developer":"PopCap Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21132,"name":"Airport Madness 4","genre":"Adventure","price":0.0,"description":"\"You land a million planes safely. Then you have one little mid-air collision, and you never hear the end of it...\" —Air Traffic Controller, New York TRACON, Westbury Long Island\nYou are a hot new Air Traffic Controller, eager to prove yourself and show off your skills to the world. Sure, you are brilliantly gifted. But are you safe? Can you handle real pressure? You are the world's last line of defense against inevitable air disaster! You are paid the big bucks for your visualization skills and guts. Just like the real job of an air traffic controller, you must pay attention and keep your eyes moving. There is always something that you should be doing. Give takeoff clearances, landing clearances and taxi clearances in a strategic effort to maintain safety and efficiency where there would otherwise be total chaos. This is not a spectator's sport! Can you hack it?\nAir Traffic Control: The World's Most Stressful Job\nAirport Madness 4 offers human pilot voices, bad weather, emergencies, aircraft carriers, plus a radar scope. Helicopters, float planes, F15 fighter jets, and space shuttles are just a few of the aircraft you will handle.  It offers you 12 unique challenges, plus some very unusual activity at an 'Area 51' airport.  This is a must-have game for any aviation enthusiast. It's incredibly simple to learn, yet insanely addictive and challenging. More than 100,000 copies of Airport Madness have been sold to date.\nChoose from six unique airports, including a dozen different airport challenges. Our revamped physics engine offers smoother motion and more realistic aircraft behavior. The addition of several new aircraft will challenge your ability to recognize performance differences between different aircraft types, such as the Boeing 747, Airbus A380 and even the Concorde.\nReal human pilot voices\n6 awesome levels\nRadar\nEmergencies\nNasty weather\n12 ridiculous challenges Keep 'em separated!\nAir Traffic Control is a talent. It's a skill that you are hopefully born with. Much like that of a heart surgeon, you take people's lives into your own hands when you are at the radar scope. Strive to keep the traffic moving, but don't let 'em hit. Push yourself to handle the traffic! Work quickly, but be cautious.\nIf you like this game, you must also try Airport Madness: World Edition on Steam!\nhttp://store.steampowered.com/app/369290/","imageUrl":"https://media.rawg.io/media/screenshots/73c/73c87bafb5e893b445de49ef2a7d9688.jpg","releaseYear":2014,"developer":"Big Fat Simulations","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":19021,"name":"Putt-Putt Enters the Race","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameCartown racers, start your engines!\nPutt-Putt® and Pep are ready to take your kids on the ride of their lives! Today's the big day as our curious little convertible prepares for the Cartown 500. Redline Rick is eager to start the race, but Putt-Putt® and Pep need a few items before they are ready to roll. Kids join in the adventure as they explore brand-new Cartown locations like Torvil Tractor's farm and Rover's Rocket Drive-in, looking for a safety helmet for Pep. Old friends like Smokey the Fire Engine and Outback Al help Putt-Putt® get to the track in time for the big race. As the grand finale, kids hop behind the wheel for the first time ever as they race their favorite purple car toward the checkered flag at the Cartown Speedway!\nKids actually drive Putt-Putt® as he races the speedway!\nA fantastic original soundtrack will have your kids dancing in their seats!\nThere are hundreds and hundreds of the fun Click Points children love!\nOut of time? You can save the game and finish it later.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/8fb/8fb2d00e6ac2f7ae2fdd6d006365d665.jpg","releaseYear":1998,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":19012,"name":"Freddi Fish and Luther's Water Worries","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameDive in to help Freddi Fish and Luther keep the ocean from draining and save the sea creatures!\nLuther’s got to pop an ocean full of air bubbles before they make it to the surface. A souped-up slingshot, a little fancy finwork and some help from you are all he’ll need! Sea sponges, boulders and teleporting whirlpools are some of the useful tools you’ll need to succeed. Stinging jellyfish, spraying octopi and smelly seaweed are the least of Luther’s Water Worries!\nChallenging, arcade-style games for kids ages 3 to 8 (and children of all ages)\nBrand new action with all the quality you’d expect from Humongous Entertainment\nSave your game after each level and track the scores of up to 75 players\nTwo-player mode allows Freddi Fish to get in on the action\nOver 100 levels of fin-flapping fun!\nJunior Arcade games are jam-packed with fast-and-furious gameplay that satisfies kids’ hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/9e2/9e2789fb65307d799fb790f18ee8d136.jpg","releaseYear":2014,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17819,"name":"Infinite Space III: Sea of Stars","genre":"Adventure","price":0.0,"description":"Sea of Stars continues the Infinite Space series of games that defined the genre of short-form space roguelikes in Strange Adventures in Infinite Space (2001) and Weird Worlds: Return to Infinite Space (2005). It compresses a galaxy-spanning starship adventure into the space of a single sitting, but as the game world is randomly generated each time you play, you will keep coming back for more. There is enough variety in items, aliens and special encounters that you will always discover something new - no two sessions play the same.\nSea of Stars begins in the Glory star system, in an area of space known as the Purple Void for its colorful nebular clouds. The long-isolated Terran colony of Hope has discovered the secret of faster-than-light travel, and an age of interstellar adventure has begun. Choose your starship and blast off into the Infinite Space in search of fame and fortune! Travel from star to star, explore planets and discover strange lifeforms and artifacts left behind by ancient empires. Find technology to upgrade your ship and gain allies to grow your flotilla. Encounter bizarre and delightful alien races, trade with them or blow them up - the decision is yours. And sometimes, you will face an existential threat to all life in the sector, and get to save the world.","imageUrl":"https://media.rawg.io/media/screenshots/3d6/3d6cd9197ac34803ed0bc5f616fd05a0.jpg","releaseYear":2015,"developer":"Digital Eel","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16670,"name":"Meridian: Squad 22","genre":"Action","price":0.0,"description":"Humanity is in peril. The first colonization attempt of mankind has failed and the colonist crew is missing. The leaders of the United Earth decide to send a highly trained specialist squad to planet Meridian to find the crew and bring them home safely.\nMeridian: Squad 22 is a single-player science-fiction real-time strategy game with a focus on base building and advanced tactics. Every single choice, every tactical decision you make, shapes the outcome of your story. Will you take the offensive route or stay on the defensive? Will you consider the lives of your crew a priority or will you sacrifice them mercilessly to gain the upper hand?\nEde Tarsoly, the lone developer behind Elder Games has teamed up with Hexany Audio, the award-winning sound design team, to bring you an experience like none other with unparalelled fidelity.Key FeaturesControl the fate of Squad 22 and the colonists in the 10+ hour story-mode campaign\nVanquish your foes on planet Meridian in over 100 procedurally generated missions in Planetary Conquest\nPolished, dynamic and fluid unit control\nOver one hour of immersive music\nFantastic sound effects brought to you by an award-winning sound design team","imageUrl":"https://media.rawg.io/media/screenshots/bac/bacea1d606ffb456d14522462aefdadd.jpg","releaseYear":2016,"developer":"Elder Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16436,"name":"Ground Control Anthology","genre":"Strategy","price":0.0,"description":"A classic blend of action and real-time strategy\nThe year is 2419 and mankind is on the brink. War has devastated Earth, and mega-corporations take to the stars to fight over colonised planets. Your employer, the Crayven Corporation, chose you to command an army of ground and air forces on the distant world of Krig-7-B. You thought it would be just another brush-fire war in a longstanding dispute. You were wrong.\nGround Control Anthology offers a thrilling RTS experience beloved by fans and critics alike. With a trendsetting mixture of 3D action and strategic combat, it’s still just as epic as it ever was.Ground Control Anthology includes\nThe original Ground Control\nThe Dark Conspiracy expansionKey Features\nA unique mix of 3D action and classic real-time strategy.\nAn intuitive interface designed for both novice and advanced players.\n30 singleplayer missions split across two factions in the original game.\n15 more singleplayer missions and a new faction in the Dark Conspiracy expansion.\nExtensive multiplayer* for up to 8 players, including both co-op and competitive modes (LAN only).\nDozens of customisable units.\nExpansive terrain and timeless, highly detailed visuals.\n*Multiplayer notice: Because WON.net is no longer operating, playing over the Internet is no longer possible. Playing through a LAN is still available.","imageUrl":"https://media.rawg.io/media/screenshots/7e9/7e9f81f33b2e989488770871b0f98288.jpg","releaseYear":2000,"developer":"Massive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]