[{"id":4691,"name":"EA SPORTS MMA","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dda/ddadcd651e29975587b5e3ff221717e3.jpg","description":"EA SPORTS™ MMA brings the authenticity of the world’s most intense combat sport home like never before. Go on the offensive with a dynamic control system for strikes, elbows, knees and kicks and strategically manage advances and counters with an intuitive submission system.  Battle it out in the Strikeforce cage or deliver vicious soccer kicks and head stomps in a ring in Japan. Are you ready?  Let’s get it on!\nThe multiplayer functionality of this title is NO longer available.  You will ONLY have access to the single player aspects of the game after download.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© 2010 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks or registered trademarks of Electronic Arts Inc. in the U.S. and/or other countries. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":966589,"name":"Resident Evil 4 - Separate Ways","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/235/23507cdd4268752b10f4dfc9cba52e9c.jpg","description":"Separate Ways – the missing link in the main story – is a thrilling survival-horror adventure starring Ada Wong. See the other side of the story from her eyes as her mission, and fate, intertwines with Leon Kennedy's a second time.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":804855,"name":"Anger Foot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/da9/da93ffb65843f39b240ffd97c07a3acb.jpg","description":"Anger Foot is a lightning-fast hard bass blast of kicking doors and kicking ass. Crash through the caffeine-fueled fever dream of Shit City, putting the boot to a menacing menagerie of merciless gangsters.\nUnleash the world's deadliest feet on a colorful cast of anthropomorphic enemies. Clearing out slums, sewers, and skyscrapers as you grab new weapons, unlock new sneakers, and upgrade your powers in absurd and wonderful ways. Kick and shoot your way to the exit as you leave behind a smoldering trail of shattered doors, broken bones, and crumpled energy drinks.Fast-Paced Ass Kicking ActionShit City is a disease and your foot is the cure. Lace-up a capricious collection of formidable footwear to fight through a diverse series of deranged city districts.Vibrant Visuals, Relentless BeatsEnjoy a concussive, bass-thumping soundtrack as you stampede through a feverish criminal underworld. An assault on all your senses. Including common sense.Run. Kick. RepeatAre you the god of style, speed, or power? Discover secrets and unlocks that encourage replayability - and learn to tackle levels in new creative, ridiculous, and devastating ways.Master The FootBecome one with the toes and be quick on the trigger. Your skills must surpass human comprehension if you are to prevail and learn the secret of the Anger Foot.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Free Lives","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":593250,"name":"Insurmountable","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/504/50420975e04da88dd17fc666d88e117d.jpg","description":"​\r\nInsurmountable is an adventure roguelike with permadeath, in which the player has to overcome huge mountains. Thanks to the procedurally created environment, no two climbs are the same. Make sure that your climber stays alive by always making sure that your vital values don't get into the critical range. This task is made more difficult by a dynamic weather system, day/night changes and a multitude of randomly generated events, where you never know in advance how they will end. Your decisions matter....every single one. Because anyone could be your last.\r\nChoose one of three characters with different skills and background stories and start by climbing the first mountain. Search crates, caves and ancient ruins for equipment from past adventurers. You'll need it, because even the first mountain will demand everything from you. But don't worry. As time goes by, you'll become stronger and stronger. Decide freely in a sophisticated skill system, which strengths should have your*s climber*in.\r\nIn the course of each of the three mysterious stories, you will meet dangerous animals, overcome deadly abysses, encounter sinister and well-meaning characters, who do not always have to be human. Here, too, each of your decisions decides the following events.\r\nThree mountains have to be conquered at the end. One higher and deadlier than the previous one. Divide your forces and your equipment correctly, because you don't have a second attempt and you can forget about learning a route. In Insurmountable you have to cope with unknown dangers, react spontaneously to unpredictable events and realize in the end that, as in life, you can't always know the consequences of your decisions, but you have to cope with them anyway and in the end, it often turns out differently than you thought.\r\nFace the challenge of ever new and changing dangers, face snowstorms and the sheer force of nature, always keep your eyes on the summit and overcome the insurmountable.Keyfeatures\r\nno two climbs are alike\r\nprocedurally generated mountains\r\ndynamic world with different weather effects\r\nhundreds of events with ever-changing outcomes\r\nstrategic gameplay in path finding, stat and equipment management\r\n3 characters with different abilities","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"ByteRockers' Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":379603,"name":"Valakas Story","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a82/a8211d51022510f4d99ce1ff6a050af3.jpg","description":"ATTENTION: The game is create by one person, bugs and errors are possible!\nAll events and heroes are fictional. Any coincidences with reality are random.\n-Excellent facial animation\n-Original plot\n-Worked out fights, with different opponents and bosses\n-Perform various combos for your victory\n-Listen carefully to the NPCs for completing assignments.\n-Unique Russian flavor and humor\n-Hand-crafted locations with many easter eggs\nIn the distant Russian outback, there lived a rural elderly streamer of games. The name is our main character Valakas, he is 54 years old and from a boring, old life, he began to stream online games on the Internet. Valakas quickly became popular and won the hearts of all Russian players. His beloved granddaughter, named Ralinka, also lived with him.\nAfter Valakas became very popular in 2015, he got very big donations, people loved him and threw money at him. Everything went very well, but in 2015, Valakas suddenly changed and people began to suspect that another person was sitting at the monitor. All of Russia began to worry that Valakas was killed, and his streamer channel was captured by some Denisk, wearing a mask to change his voice. We have to find out what really happened in 2015 and solve this case.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Narko Games","platforms":[{"id":0,"name":"PC"}]},{"id":259811,"name":"Game Builder","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e2/8e28de7c46fe9ffc6c5e105f28f9a98f.jpg","description":"Game Builder is designed to empower any person to create 3D video games.\nFeatures:\nEasily find and use free 3D models from Poly and images from Google Image Search.\nCreate levels and environments with easy-to-use construction tools.\nShare your game on Steam Workshop to get feedback.\nExplore games made by others to play and learn.\nKnow how to code? Live-code your game using JavaScript.\nDon’t know how to code? Use built-in behaviors to bring your game to life!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Area 120","platforms":[{"id":0,"name":"PC"}]},{"id":245088,"name":"Paperbark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f6e/f6e3aed370d057620bb99e3a83378ba6.jpg","description":"Paperbark is a charming game that tells a beautiful short story of a wombat, the bush and a very hot Australian Summer. Follow a sleepy wombat who spends its day exploring and foraging, while in search for a new home.\nWander through a beautifully stylised interpretation of Australia, and watch as you bring the illustrated landscape to life, through vibrant watercolours and sounds.\nInspired by iconic Australian storybooks and landscape artists, Paperbark will make a wonderful addition to anyone's library.\nStory by: Renee Treml\nNarrated by: Georgia Maq\nMusic by: Biddy ConnerFeatures Vibrant Australian Landscape\nCharming Short Story (About a Wombat)\nRelaxing Gameplay\nInteractive Sticker Library\nOriginal Soundtrack\nUpdated Visual Quality for Desktop\nOver 25 Steam Achievements\nSteam Trading Cards","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Paper House","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":241044,"name":"Tekken 4","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/16b/16b73bcf19d9a1c6d33e56b35401ad87.jpg","description":"Tekken 4 marks the return of Namco's premier fighting franchise. Tekken strikes back with new jaw-dropping graphics, game play mechanics, and fearsome fighters. Newcomers engage old favorites in interactive, multi-leveled arenas. New strategies in fighting are introduced with the addition of walls, terrain effects, position changes, and enhanced side-stepping. Expanded game modes such as Training, Team Battle and the new Tekken Force provide the player with a deeper game play experience. [Namco]","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"NAMCO","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":65059,"name":"How To Cope With Boredom and Loneliness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/030/0307773541191e478eb8de0b6fc43b98.jpg","description":"Hello. I'm Nigel Wimble.\nTonight I am filming my final episode of How to Cope with Boredom and Loneliness: A Guide for the Isolated. I am meeting with Harold Fletcher, a 43 year old man who has been grounded to his bedroom for over 30 years.\nHelp me create an award winning documentary by picking the right scenes to shoot. Explore Harold's bedroom to find items that might shed some light on how he's coped with the boredom and loneliness from 30 years of isolation. Then we'll get the camera rolling!\nOnce the scenes are chosen you can sit back and watch the documentary unfold. Then we'll see what the focus group thinks. Let's make some hard hitting TV! Choose the most on theme items for the perfect score.\nHow to Cope with Boredom and Loneliness joins the crowded  'create your own documentary simulator' market but we hope to stand out with a touching story and memorable characters.Features No real gameplay\n20 minutes you wont get back\nA joke that makes you laugh through your nose\nMusic\nRealtime 2D visuals\nSomething to do while you download a proper game\nWhat started life as a humble Ludum Dare project, HTCBL has since blossomed into a questionably better but still humble experience. It is less a game and more of a cartoon generator with dozen of scenes to combine with multiple intros and outros. We hope you enjoy it and play it multiple times to create all the possible documentaries.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Point Bleep Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":65041,"name":"Squidlit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/588/5884eafa2c4ab4e9cb6248120203425b.jpg","description":"Are you ready for an invertebratey adventure? Do you have the gumption to take on a mighty quest for the good of oodles of squidlits everywhere? If so, many trials await you as you squrp your way to victory in the squishiest of escapades!\nThe mechanics are simple!\nAfter jumping, jump again to ink downwards on the enemies you encounter as you blip and squip along your merry way! Can you stop Skwit Skwot before it’s too late?\nSquidlit does everything it can to be as accurate to Game Boy hardware as possible, including:\nNo more than 10 8-pixel wide sprites in a line.\nNo more than 40 sprites at any time.\nFour sound channels that are shared between “voices” of music and the sound effects.\nAll sounds were made on a real Game Boy (using LSDJ).\n160 x 144 pixel resolution.\nAnd a whopping 4 shades of... “grellow”.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Alex Barrett","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":60004,"name":"Zanki Zero: Last Beginning","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a30/a3003fa7bea4287b9ec6314bb8b2995d.jpg","description":"God created the world in seven days. It only took one day for humans to destroy the world. Life as we knew it sank to the depths of the sea...until yesterday. We do not yet know the broken world and the reasons left behind there. An earth where ruins drift about. Buildings, houses, light posts. Cars, traffic lights, asphalt... Modern civilization was destroyed, becoming nothing more than debris wading in the sea. New ruins drift one after the other before the protagonist, who lives on one of those decaying islands.\n\n###Key Features\n* 8 Clones, 7 Deadly Sins, Infinite Lives - Play from the POV of one of eight protagonists in each chapter and explore the dungeons, towers, and islands to uncover the deadly sins of their past.\n* Survival of the Fittest - Hunt for materials and food while fending off monsters in real-time battle environments,  but don't forget to go to the bathroom (seriously, it's bad for your health and fatal for your party).\n* Live, Die, Repeat - With only 13 days in one life cycle, each clone's stats, abilities and capabilities differ from youth to old age. Depending on how you die, you can even earn bonus upgrades for your next life cycle. Take advantage of each life cycle to the fullest!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":59344,"name":"Wolfenstein: Cyberpilot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4e/b4eca3fc180a934f75665c14453aaa97.jpg","description":"The Resistance has upped its tech game in the two decades since the events of Wolfenstein II: The New Colossus. Wolfenstein: Cyberpilot drops you into the role of a resistance hacker on a mission to tear apart the Nazi forces in Paris using their own machines. Take control of a fire-breathing Panzerhund and more as you fight Nazis in the City of Love in order to aid the French resistance. Wolfenstein: Cyberpilot will be available as a standalone VR game in 2019. Saddle up, Cyberpilot. You’re one of us now.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":34777,"name":"Black & White 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4fd/4fdf302f1f1e1ef0354c8f42fa1287bd.jpg","description":"Will you be an evil or benevolent deity?\n\nThat's the choice you must make upon returning to a warring land in Black & White 2. Like its wildly successful predecessor Black & White, the sequel is all about moral choices.\n\nThe land, however, has transformed itself. The inhabitants of this breathtaking 3D world have lost their innocence and developed new weapons and technology. As you enter this warring world, will you make tribes coexist peacefully; encouraging villages and towns to grow into sprawling metropolises, or prompt them to inflict their will upon others by, creating and commanding large armies that seek to dominate and conquer?\n\nCreatures in the game have grown too. They can learn strategies, master new abilities and skills, lead armies into battle and be your ultimate unit. Black & White 2 includes other new elements, such as improved graphics and miracle effects such as rivers of fire and earthquakes that yield massive destruction.\n\nEvery choice you make will have an impact. Each action and inactions prompts obvious changes to buildings, flora and fauna, all morphing to reflect your personality.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20400,"name":"Legend of Dungeon: Masters","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/384/384a8f00d32f4be38a94bb5eaeaf5751.jpg","description":"You are the Master of this legendary dungeon! Well.. one of them at least!\nLegend of Dungeon Masters lets you toy with people streaming Legend of Dungeon. Help your friends and favorite streamers on their quest for treasure, and send them mighty swords, potions, and bazookas... or don’t! Rally the other viewers and laugh evilly as you rain hell upon them with beasts, kittens, and demons.\nHelp or hinder, it’s entirely up to you!\nFollow development and find out when we stream with http://twitter.com/RobotLovesKitty or our steam group! http://steamcommunity.com/groups/robotloveskitty\nThis is a new kind of online multiplayer experience that you can play with a few close friends, or a whole livestream audience!-Features-\nPlot and discuss all you want with in stream chat\nSymbiotic reward system.Whether you’re beneficial to the host or a parasite is up to you.\nPersistent inventory, items in your inventory are useable in any livestream.\nFree to play, with only slightly evil monetization (very roughly implemented in beta please think of this primarily as supporting development!)\nA new kind of asymmetric multiplayer experience when you live stream LoD.\nShort messages can be attached to “gifts” sent in.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Robot Loves Kitty","platforms":[{"id":0,"name":"PC"}]},{"id":20266,"name":"Marvin's Mittens","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f35/f35cd893ba978e386be1fddbd0ae16f5.jpg","description":"Marvin's Mittens is a 2D platformer with a focus on exploration and collection. With gorgeous, hand drawn art, Marvin presents a soothing world to explore, free from enemies and danger. Collect magic snowflakes to increase your jump height and race your sled across the landscape to reach new areas before your mother calls you back home. Learn the secrets of snow elf magic and traverse the world beyond Marvin's backyard to solve the mystery of the missing mitten. Immerse yourself in this charming indie title!\nKey Features:\nBeautiful winter landscapes and charming characters\nCarefully placed collectibles encourage exploration and revisiting of levels\nEver-increasing jump allows access to new parts of the world\nCoast down hills on your sled, find jumps to reach new areas\nNearly an hour of beautiful original music\nFind shortcuts to venture further before Marvin is called back home by his mom\nSneak up on wildlife to add animals to Marvin's sketchbook\nAlso on offer is the Marvin's Mittens Original Soundtrack that includes over 35 tracks from the game along with bonus tracks you've never heard. The soundtrack is available separate or in a combined bundle with the game.\nGo for an adventure!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Breakfall","platforms":[{"id":0,"name":"PC"}]},{"id":19014,"name":"Let's Explore the Farm (Junior Field Trips)","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bed/bed2e79cbc51a21d37cc3ef3ca25b94a.jpg","description":"All the fun of a field trip without leaving home!\nThe Farm captures all the fun, energy and excitement of a real working farm. Kids can visit the big red barn and watch a cow being milked. Take a peek inside the chicken coop and find out where eggs come from. Help harvest the corn and feed the pigs. Don't miss the pond- there's a beaver dam to explore. And that's only the beginning.\nJunior Field Trips turn kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to visit The Farm again and again. It's a place where understanding and experience grow and fun never ends.\nLet Buzzy the Knowledge Bug guide your child on a fun-filled trip to the farm!\nMeet your tour guide.\nBuzzy the Knowledge Bug is your official Farm guide. He'll tell you all about the farm animals, how crops grow, and what's cooking on the farmhouse stove. All at the push of a button.\nLet your child's natural curiosity run free!\nWhat is a silo used for? How does a well work? Why do pigs wallow in mud? The answers to these and hundreds of other questions are just a click away.\nJust about everything has a story.\nMore than 215 animals, plants, tools and machines are defined and explained in detail. Click on the screen and Buzzy will read the description out loud.\nSurprise click points.\nYou never know what's going to happen when you click on apples in the orchard, the pulley in the barn, or the grinder in the mill. Things transform and create a magical world children love.\nLearning has never been so much fun.\nThrough exploration, experimentation, and play- kids improve their spelling, test their memory skills, learn how to mix colors, and enhance their dexterity and vocabulary- all in 5 fun-filled games.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18053,"name":"Crime Secrets: Crimson Lily","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/385/38509d49bcf619bfc7d2f3c9f1273301.jpg","description":"Fantastic hidden object puzzle adventure game from the creators of Enigmatis and Grim Legends!\nCrime Secrets: Crimson Lily is a captivating blend of hidden object challenges, puzzle solving, and daring detective work.\nWhen a grim murder interrupts a private detective's vacation at the very gate to the hotel at which she was going to stay, she puts her plans for R&R on hold and sets out to do what she does best: solve violent crimes. All she has to go on is a single clue: a mysterious paper lily attached to the victim's frozen body. Could it be the killer's calling card?\nCrime Secrets: Crimson Lily features more than 30 stunning hand-painted hidden object scenes set within a snowy environment!\nCut off by a blizzard and left to her own devices, the protagonist will need to put her detective skills to work as she questions possible witnesses, searches for clues, and follows a trail that leads her deep into the dirty dealings of a small town filled with big fish and other enigmatic characters.\nFind clues in the game's unique Detective Mode to solve the mystery!\nWas the tragic death of a young journalist, Lilly, a few years back only an accident, or was it somehow connected to the mysterious new murder? Is the killer trying to send a sinister message? If so, why, and to whom?\nSurprising puzzles and unexpected twists!\nAs it turns out, there's more to the grim story than meets the eye, and not everyone at the hotel is who they appear to be. Will the private investigator manage to track down the culprit?\nTake the game with you wherever you go!\nSign up to receive our newsletter and play new hidden object puzzle adventures every month!\nCaptivating adventures, thrilling stories, impossible tales, and eerie mysteries await in our catalog of  hidden object puzzle games!\nLook for  \"Artifex Mundi\"  to discover more hidden object puzzle adventure games like this one!\nFeaturesMore than 30 hand-painted hidden object scenes set within a snowy environment!\nFind clues in the game's unique Detective Mode!\nSurprising puzzles and unexpected twists!\nTest your reasoning skills in challenging mini games!\nDetermine the killer's identity at all costs!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":16421,"name":"Moto Racer Collection","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2c/e2ca5e7ef5f3f0e0630bba5bcfb009bb.jpg","description":"Moto Racer Collection features the original Moto Racer, Moto Racer 2, Moto Racer 3 Gold Edition + Moto Racer 15h Anniversary.\nMOTO RACER / MOTO RACER 2: Retrace the series roots and tackle legendary races such as the famous Great Wall of China. Put your skills and reflexes to the test in Arcade and Simulation modes.\nMOTO RACER 3: Feel the thrill of speeds 300 km/h and over on some of the world's greatest racetracks including Suzuka and the Sachsenring. Hop on a trial bike and negotiate the trickiest of obstacles. And take a nerveshredding high-speed trip through the streets of Paris.\nMOTO RACER 15th ANNIVERSARY: Race against fierce competitors in GP Mode. Challenge the best bikers in spectacular Supercross races Perform the best aerial tricks in Freestyle Mode. Break the records in Time Trial Mode.\nKey Features:\nEVERY MOTORCYCLE CATEGORY UNDER THE SUN, BROUGHT TOGETHER IN ONE GAME\nMOTO GP:\nHit speeds of over 300 km/h as you race flat out against the toughest of rivals.SUPERCROSS:\nGo head-to-head with your rivals in all-terrain races and tease them with your fanciest tricks.FREESTYLE:\nPull off amazing Superman seat grabs, Indy backflips and can-cans as you fly through the air.GAME PACKAGE INCLUDES:\nMoto Racer, Moto Racer 2, Moto Racer 3 Gold Edition and Moto Racer 15th Anniversary","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"PC"}]},{"id":15007,"name":"Fate Tectonics","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fef/fef6bafa14843d4548b6fe5f01ebb3a1.jpg","description":"Build up a world piece-by-piece using the power of the god-like Fates, while keeping them happy enough to avoid world-shattering temper tantrums!\nFate Tectonics is a world-building puzzle game featuring a handcrafted pixel art style and a 16-bit symphonic soundtrack. Carefully place terrain tiles, piecing together the world in a way that will appease a growing number of god-like beings called Fates. One wrong move could mean angering the Fates, resulting in a chain reaction of destruction and chaos. Unlock the powers of the Fates to build a stronger and increasingly beautiful world and face off with final Fates for the ultimate world-crumbling finale.Features\nEasy to pick up and play casually, but also offers deep challenge for more strategic players.\nHandcrafted in-game pixel art, a soundtrack of symphony & steam by composer Robby Duguay, and Twitter-shareable worlds!\nThe powerful Book of Fate keeps track of your progress and chronicles your adventures!\nTwo game modes—test your world-building skills in timed cycles of creation and destruction under Ragnarosa and Fortuna's vigilant watch, or take your time and build up a world as large as you can at your own pace, under the calming influence of Serenity.\nAccessibility options cater to gamers with motor skill, cognitive and vision impairments.Accessibility Options Include:\nMultiple control schemes, remappable keys and input options\nDesign and colour palette are resistant to 3 types of colour blindness\nAdvanced options for cursor speed, font size, game speed and more\nSeparate volume controls for music and sound effects\nFull-screen and windowed modes\nAll menus and screens have a half-second cooldown between inputs\nIn-game hints and guidance for new players\nAssistive tile auto-rotate feature that learns your preferences\nComprehensive save system featuring overview of progress, multiple save states per save file, and thumbnails for each save state for a quick visual reference of progressWhat they're saying about Fate Tectonics\n“Last night, I decided to play Fate Tectonics [official site] for five minutes, just to get an idea about how its world-building puzzles worked. It was a long five minutes. Around an hour and a half, all told. (…) It’s rather good.”—ADAM SMITH, Rock Paper Shotgun\n“The combination of strategy and puzzle solving is certainly unique and makes for a very addictive gameplay experience.”—GAMERAMBLE\n“(The game) allows players to derive meaningful satisfaction from creating expansive worlds one piece at a time. It’s almost meditative during the early going. Then it starts to get a bit tricky.” - CHAD SAPIEHA, Post Arcade (Financial Post)\n“I personally found that it brought back a sort of childlike joy that came from building things with blocks or legos as a kid, then destroying it all in a cathartic burst of destructive control.”— ALEXX APLIN, Mod Vive.\n“My main piece of advice is be willing to fail. It has some of the best game over gameplay since Sim City of old.”—CHRISTOPHER DEMELO, The Snarge.\n“The strategic spin on a world-building game gives Fate Tectonics an added challenge many people won’t expect.” — CONOR BAILEY, The Spew.\n\"If you play only one real-time polytheistic tile-placement world-building strategy puzzle game, make it this one!\"—RAIGAN BURNS Metanet Software (N++)\n\"Has all the joys of creating with all the pains of having it crumble away around you.\"—JAMIE TUCKER, Asteroid Base (Lovers In A Dangerous Spacetime)\n\"Fate Tectonics is a beguiling game; it lures us in with the cathartic pleasure of clicking together puzzle pieces. The satisfaction in snapping the precise piece into the perfect place is matched only by games like Carcassonne. That is until you realize that you are actually playing a precarious game of house of cards with three angry toddlers stomping about.\"—JOHN Z. LINDVAY BigSushi.FM\nFate Tectonics is a proud GDC 2015 alumni of the Indie Megabooth.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Golden Gear Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14842,"name":"Beach Bounce","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f92ef41d9a0b82144e0c1b926da67ac.jpg","description":"Tomoyo finds himself at his grandmother Umi's beach resort, looking forward to a great summer where he can finally put the past to rest and possibly take his life forward in a better way than the coasting he was doing up until now.Of Course there Is Always A Catch...And now it looks like his summer vacation is dashed on the rocks before it begins.\nThe only upside is the many beautiful female staff members working at the resort.Resort Staff\nFeatures\n* Multi-Choice and directional story\n* Multiple pathways and multiple endings\n* Good, Bad and Fun endings\n* Several different possible romances\n* Huge variety of characters and locations","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"AJTGames","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14692,"name":"Empire TV Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/604/6041b9da007fad881cf5716f97d8b425.jpeg","description":"Empire TV Tycoon is a game in which you manage a TV channel and fight for audiences taking decisions that will project your channel to fame and fortune.You will decide the content of your channel, select advertisers, hire workers, make your own productions, hire actors, and engage in much more activities! It's inspired by games such as Mad TV, Mud TV, and other movie management games, with a modern approach on how to produce custom content such as movies or tv-shows.\nEmpire TV is a big corporation having serious losses, and It can't afford to maintain three channels, but only one, any longer. You have been hired to lead one of the channels to achieve fame and be the one that remains.\nFeatures\nManage your channel and determine the best content for the current audience. Also, increase your fame and win the war between the three Empire TV channels.\nEach audience group has its likes and dislikes. Make them happy and your fame will increase; make them sad and your channel will sink into the TV deeps.\nBuy and sell movies or TV shows that suit your audience best. Also, you can select your favorite movies from about 1000 movies.\nDon't be tempted to use illegal content. While pirated movies are cheaper, the risk is high and police is always watching.\nIf you can help the advertisers to reach your audience, you will win some money. But be careful: Sometimes, their requests and deadlines are hard to fulfill.\nHire workers who will help you to execute different tasks, and each one with their own level and skill.\nMake your own productions, movies or tv-shows. Distribute your resources  effectively for each available movie genre.\nEnjoy a personalized and randomized movie script for each production. Lots of combinations for each movie genre.\nHire actors, knowing their own strengths and weakness, to act in your production. Do your best to keep them happy and utilize their skills efficiently.\nAs the director, you will have to take prudent decisions during the production, and these decisions will affect the final quality of the production.Submit your productions to the industry awards in different categories. Try to be the best and win glory and fame.\nAnd discover many secrets and other surprises related to the film industry in the last 50 years.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kalypso Media","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":12219,"name":"Sounds of Her Love","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ca/7cae61af640bf47a988b5f0b2764eac8.jpg","description":"Story\nIn the midst of their hearts, something is blossoming between two students. Both of whom go about their daily lives at an international school in Tokyo.\nJust what is flowering? Of course, it's love.\nStarting your new life after transferring into an international school, you find yourself dismayed when it turns out to be the same as any other. Except for one thing... or person, rather. As your newly founded relationship increasingly tightens with the girl you just met, find out what there is to learn about each other as your lives intertwine with one another, discovering things about her stashed away behind a veil of timidity.Characters\nCeridwen Erwood (CV: Amber Barile)\nCeri, a student of the Welsh International School of Japan (WISJ) is a warm-hearted girl, prone to being found immersed in the pages of a novel or the strings of a classical celtic harp. She has a desire to study literature, though she had been known to have had a large period of time away from school due to an illness. As stated by her.\nOf Welsh origin herself, Ceri's a lot more readable than her language. Or so it might seem. Timid and docile on the outside, nobody can really tell what surprises she might have in store. As you get to know her however, the truth about her becomes much more clear to you. Learn about her past, be with her in the present, and join her in the future. That is, if she opens up to you. She's an extremely shy person, so getting her to open up isn't going to be easy.\nProtagonist (Player Named)\nYou \"play\" as a half Japanese, half English transfer to the WISJ.\nHis second week at an international school has just started. Many students seem to be pompous in his eyes. It costs a lot of money to attend, after all. Within his first week, he has managed to make a grand total of zero friends. Socialising isn't easy, at least that's what he thinks.\nUnlike his father, a well-regarded owner of a publishing company, he wastes his time daily doing nothing productive. Things change however, when he meets \"someone\" who piques his interest.Features1920 x 1080 resolution.\nCinematic CGs.\n3 Endings\nRoughly 40,000 words.\nRating: 13+ Mild use of language and provocative content.TeamStory, Programming and GUI: ds-sans\nBackgrounds Art: Kimagure After, Mugenjohncel\nCharacter Sprites: Jun Project\nCGs: Joko JMC/jmc5221, Ezekuro\nCeri CV: Amber Barile\nPublisher: DEVGRU-P\nOpening Theme: Tandess\nFrequent updates on the project can be found on twitter @dssansVN","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ds-sans","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4024,"name":"Katamari Damacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4e/c4ea10607b6df252b45b1820f2fcaaf5.jpg","description":"When the King of All Cosmos accidentally destroys all the stars, he orders you, his son, to put the twinkle back in the heavens above.  Roll up everything to get the job done!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":1734,"name":"LA Cops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85c/85c13f1379281ea805b8e02def112015.jpg","description":"Alright, listen up! I got the Mayor on my ass about this like a hernia, and he wants you guys on the case. Why he wants you guys, I don’t know. You’ve cost this department more than all the Precincts in the rest of the state combined!\n\nAnyways. You’ll be headin’ up a team of cops in LA, and you’ll be goin’ up against all manner of bad guys, packing some serious heat! Not ta mention The BIG Boss, Hawaiian Mo. Sure, it’ll be dangerous, but heck, it’s nothin’ you ain’t done before.\n\nLA Cops is a fast, action packed 3D top down shooter set to a theme of 70s Cops in LA trying to do a tough job in a tough town. Gameplay includes an extra edge as you control two cops, using them strategically to get one up on the bad guys!\nA smart targeting system UI allows, you, the player to position your cops tactically whilst taking out the bad guys in real time.\nWhen you buy this game you get:\n8 main and 5 optional levels  to play through. Each level is broken down into multiple sections totalling twenty overall.\nSix Cops to choose from each with their own attributes that can be upgraded with experience points during play. Attributes include health, speed, ammo clip size & damage.\nFive weapons to take out bad guys with including Pistols, Uzis, Shotguns, Assault Rifles & Grenade Launchers.\nDestructible scenery\nMultiple cut scenes tell the story of these Cops in full 3D. Just like people, not all Cops are bad & not all Cops are good.\nPlus a Rock soundtrack that needs to be played loud!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":983212,"name":"Call of Duty: Black Ops 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e89/e89f9a409bce5d36873f65ea9659c36e.jpg","description":"Initial Intel: Campaign: The Black Ops 6 Campaign takes players to a new point in time – the early 1990s. In true Black Ops fashion, the fictional story builds on the history of the time, thrusting you into a strange and clandestine conspiracy where a shadowy force has infiltrated the U.S. government. Anyone who resists is branded as a traitor, forcing players to go rogue for the first time to fight the very machine that created them. Nothing is what it seems, and the truth may be hard to fathom, drawing you ever deeper into intrigue, distrust, and mind-bending psychological revelations. This is true, signature Black Ops style.\n\nInitial Intel: Multiplayer: Offering a massive amount of content at launch, expect 16 brand new Multiplayer maps on Day One, including 12 Core 6v6 maps and four small-sized Strike maps, the latter of which are unique, stand-alone locations designed to be played in 2v2 or Face Off 6v6 matches. Multiplayer is also where you’ll test your skills and learn how to move like an action hero, with innovations like Omnimovement – allowing you to sprint, slide and dive in any direction – as well as Intelligent Movement (sprinting, mantling, and crouch assists allowing you to focus on achieving incredible and complex maneuvers with ease), increased enemy hit zones, an incredible lineup of gear, HUD optimizations, and the return of Theatre Mode and Classic Prestige!\n\nAll designed to ensure this game is the ultimate Black Ops Multiplayer experience.\n\nInitial Intel: Round-Based Zombies: Black Ops 6 also marks the epic return of Round-Based Zombies, the fan-favourite mode where players will take down hordes of the undead. Expect two brand-new maps at launch, and an impressive number of secrets to discover.\n\nPRE-ORDER NOW ON XBOX GAMEPASS","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":502138,"name":"The Solitaire Conspiracy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3b/e3b5a61c8c877b9495c46c604e6a2e6c.jpg","description":"Protego, the world’s leading spy agency, has been destroyed. Only one person can wield C.A.R.D.S to take control of Protego’s scattered spy crews and save the world.\n\nYou.\n\nGuided by Protego’s only remaining analyst, Jim Ratio (Greg Miller), you must master the unique powers of each crew in a game of tactical Solitaire like none you’ve ever played before. Guide your crews home in a tale of intrigue where nobody can be trusted. Keep your cool in a world of AI spies and cyber-enhanced operators.\n\nOnce you’ve taken back control of Protego, play infinitely via Skirmish, or test your skills against the clock in Countdown, a survival mode that will test your grasp of the game’s surprising tactical depths.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bithell Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":451578,"name":"Samurai Shodown NeoGeo Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/401/4012ef24baa80d4f61887b3bec7b519f.jpg","description":"SAMURAI SHODOWN released on the NEOGEO in 1993, followed by its sequel SAMURAI SHODOWN II in 1994, and the series became a trilogy in 1995 with SAMURAI SHODOWN III. Soon after SAMURAI SHODOWN IV AMAKUSA’S REVENGE came in 1996, and seven years later SAMURAI SHODOWN V was released in 2003, with SAMURAI SHODOWN V SPECIAL releasing the following year in 2004. Never before released to the public, SAMURAI SHODOWN V PERFECT is a mysterious final version of SAMURAI SHODOWN V that is the stuff of legends to SNK fans. Players can select between either Japanese or English MVS arcade versions for each title. Additionally, there are features such as scanlines for that retro flair, save functions, and arcade mode can even be set to FREE MODE meaning no more game overs!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Digital Eclipse","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":428789,"name":"Hentai Mosaique Neko Waifus","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/552/552e32852cef9ba44ae16912e2da758d.jpg","description":"Now with cards!\nThings to do while playing:\n• Chill out.\n• Just relax.\n• Level up special abilities.\n• Follow the story!\n• Play with one hand even.\n• Stop the girls  from romancing with each other. Just kidding. Why would you even try to do that?\nFeatures:\n• Novel way of solving puzzles by rotating the right elements\n• 3 Girls.\n• 20 Puzzles.\n• 6 Abilities\n• 100 Achievements\n• Gallery/Album\nSo, why won't you meet the girls already:\nKumi. You just met her through friends, she's really friendly. She loves rollercoaster rides and dressing up. She might have the urge to know you a bit closer.\nSayouri. You have a strong feeling she might be bisexual. It's hard to convince her to not use her phone. The girl is playful like a kitten!\nJiya. Wild girl. It will probably be better to just be careful with her, before she breaks your heart. Take it easy!\nGallery!\nWatch every image after it has been solved: Cinematic mode. Zoom in and out.\nAbilities.\n• Peek and see.  Never get lost in the world of puzzle solving. This ability will always show you what you are looking for.\n• Punch of love. use when you want things done a bit faster. Activates itself automatically turning nearby blocks\n• Rain of love. Helpful, solving the puzzle step by step, or rather drop by drop.\n• Sonar of love. This can get out of control if leveled up too much. You have been warned\n• Airstrike of love. Sure... Use it... At your own risk!\n• Earthquake. Shakes up stuff pretty seriously. Solves a good portion of the puzzle randomizing the rest.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Lil Hentai Games","platforms":[{"id":0,"name":"PC"}]},{"id":379485,"name":"Barro 2020","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/262/2625a4fe4ac85850421f9feb0e46f076.jpg","description":"Barro 2020 is the sequel for Barro with 8 new challenging race tracks.\nGame modes:\nArcade: You vs 3 opponents, do your best and finish the race as the winner.\nTime trial: You against yourself, finish the laps as fastest as you can.\nMultiplayer:  Play the multiplayer (split screen) with a friend and have fun.\nCars:\n4 types of cars, choose the one that fits you better.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SC Jogos","platforms":[{"id":0,"name":"PC"}]},{"id":370125,"name":"Yakuza Remastered Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c5/5c57884270513c4baf3ad0d43a869ffe.jpg","description":"Celebrate Kazuma Kiryu's saga with the beautifully remastered Yakuza 3, 4, and 5. With restored content and updated localization in 1080p and 60fps, experience the complete Yakuza collection on one console for the first time in history.\r\n\r\nYakuza 3 Remastered, available on August 20, 2019.\r\nYakuza 4 Remastered, available on October 29, 2019.\r\nYakuza 5 Remastered, available on February 11, 2020.\r\n\r\nComplete The Dragon of Dojima’s journey.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":353494,"name":"Hello Neighbor Alpha 4","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81b/81bbefe1b76649aa997c0c94f7f73c8c.jpg","description":"Good old memories, huh? This is a ALPHA#4 VERSION of the famous Hello Neighbor.\nHello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\nSuspenseful horror gameplay that focuses on sneaking around your neighbor's house\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\nSandbox-style gameplay with plenty of environmental interaction and physics","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dynamic Pixels","platforms":[{"id":0,"name":"PC"}]},{"id":61165,"name":"Cadria Item Shop","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b7/8b764c6317d36fc910282ea7ad32d347.jpg","description":"Partial English Support AddedDear Shopkeepers,\nWe've added \"minimal interface localization\" English support to Cadria Item Shop, you can switch the language settings to English from the Options menu (it's in the upper-right corner of the game screen). Currently many strings like quest objectives and achivement requirements are localized to English, while others like quest dialogues are still in Chinese. We'll keep the translation going in the future. Thanks for your patient and understanding:)\nOrange Cat Studio\nEnglish Update On The WayGreetings, Shopkeepers!\nWhen Cadria Item Shop was released on Steam last week, it only supports Simplified/Traditional Chinese, as a small Chinese dev team we didn't have the plan to support other languages at that point. But then many non-Chinese players have joined the game and we seriously think it's our duty to improve their experiences. So we are working hard on the English localization, and the first English update will be available soon (hopefully later this week).\nSince we only had a few days to work on the English localization, this first update will be a \"minimal\" one. That say you can expect many key strings (like quest objectives and menu interfaces) are localized while many others (like story dialogue) are still not. No kidding, there are like 100k Chinese characters in the dialogue, that is around 70k English words when translated....\nOur goal, of course, is to have a fully localized English version available in the future, but for the first step we wanted to make sure every shopkeeper could, well, at least know what they are clicking at.... so please accept our sincerely apologize for the inconvenient and wait a few days for the update. Thanks very much for your support and understanding!\nOrange Cat Studio\nAbout the Game在充满魔法与幻想的卡德里亚大陆，身负天命的勇士们创造着属于自己的传说。但是拯救世界的任务实在太危险啦，还是交给别人去完成吧！本店主只负责赚钱！目标就是经营卡德里亚的最佳道具屋！制造道具从零开始，制造各式各样的道具装备。\n\n——\t雇佣工匠：从武器锻造到布料裁剪，从炼金符文到珠宝加工，雇佣拥有各种技能的工匠，打造不同类型的道具。\n——\t精益求精：在制造的过程中，图纸也在不断完善发展。想要加快打造速度，提高成品品质，甚至解锁新的道具图纸，就要熟练掌握制造工艺。\n售卖道具将成品卖给拯救世界的英雄们，迎接蜂拥而至的订单！\n\n——\t售货热潮：随着道具的不断热销，店铺的人气也在疯狂增长。顾客数量和售价暴涨的售货热潮就快开始了，小心数钱数到手抽筋！\n——\t商铺订单：与卡德里亚世界中的各种小店签约合作，为他们批量供货。\n——\t势力订单：与商会好友合力完成利润惊人的势力订单，开启神秘的军需宝箱。\n城镇建设合理分配经营所得的资金，重建故乡小镇。\n\n——\t重振经济：投资您的城镇，繁华的城镇也会给您带来更多厉害的工匠和高级的原料。\n——\t解锁英雄：随着城镇发展，越来越多的英雄也会慕名而来，快准备迎接新顾客吧。\n英雄冒险派遣冒险小队，收集各类稀有材料。\n\n——\t签订契约：招募各路英雄，组建强力的冒险小分队。\n——\t整装待发：为英雄们换上非凡的装备，派遣他们外出冒险，赢得稀有的战利品。\n——\t阵营战争：与其他店主合作，参与规模宏大的势力战争，获得丰厚的贡献奖励。\n——\t商会委托：与好友一起创建商会，各种古怪要求的委托需要大家一起来完成。\n缤纷装扮自定义属于自己的精彩世界。\n\n——\t店铺装潢：添置五花八门的装饰品，打造独一无二的店铺风格。\n——\t店主装扮：为自己和猫咪搭配不同的造型配饰，展现独特个性。\n——\t英雄时装：冒险者也爱美，换个时装光头大叔也能变美少年。","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Orange Cat Studio","platforms":[{"id":0,"name":"PC"}]},{"id":53146,"name":"Baldur's Gate: Dark Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0d/a0d24e2e37d0710a63df12df089e71f6.jpg","description":"Baldur's Gate: Dark Alliance is a 2001 action role-playing/hack and slash video game developed by Snowblind Studios for PlayStation 2 and Xbox. It was ported to GameCube by High Voltage Software, and to the Game Boy Advance by Magic Pockets. The game was published for PlayStation, Xbox and GameCube by Black Isle Studios, a division of Interplay Entertainment, and distributed by Vivendi Universal Games. The Game Boy Advance version was published by DSI Games. CD Projekt was developing a version for PC, but it was ultimately cancelled.\r\nThe game is set in the Forgotten Realms campaign setting of Dungeons & Dragons, and the gameplay is based on the rules of Dungeons & Dragons 3rd Edition, which were released in 2000. It is the first video game to implement the real time application of the new rules. It is also the first game in the Baldur's Gate series released on consoles as opposed to a PC and/or Mac.\r\nDark Alliance was well received on all four platforms, with the PlayStation 2 version going on to win the Academy of Interactive Arts & Sciences award for \"Role-Playing Game of the Year\" (2001). A sequel, Baldur's Gate: Dark Alliance II, was released in 2004 for PlayStation 2 and Xbox. A third game was planned, but was cancelled early in development due to legal problems.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"High Voltage Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"}]},{"id":43604,"name":"Pro Evolution Soccer 2016 myClub","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e4/8e443dd447fd6f7cad32be381fb82b5b_XJ8BxJy.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PES Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":40243,"name":"Harry Potter and the Deathly Hallows: Part 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/460/4600a6929ece4e8d5cbf837704b61f72.jpg","description":"The Harry Potter and the Deathly Hallows – Part 1 videogame is the most challenging yet, packed from start to finish with action and combat.\r\n\r\nDeadly enemies lurk around every corner\r\n\r\nFight Voldemort’s minions, including Death Eaters, Snatchers and Dementors. Overcome a host of fierce creatures attacking on instinct alone. No other Harry Potter game has had this level of action!\r\nOut of Hogwarts and on the run\r\n\r\nYour dangerous journey takes you through a host of new environments, from city streets to remote wilderness areas, to new and iconic wizarding locations; each presents different enemies to fight, challenges to uncover and que…\r\n\r\nBecome a master in stealth\r\n\r\nUse the Invisibility Cloak, Polyjuice Potion and Peruvian Instant Darkness Powder to avoid detection and sneak past adversaries.\r\n\r\nNew game engine\r\n\r\nA new game engine built specifically to leverage the technology of HD consoles ensures high definition graphics and visceral gameplay that will immerse you in the action like never before!\r\n\r\nPowerful potions\r\n\r\nFind and trade goods for potions that can be used to attack, escape, restore health or increase your luck.\r\n\r\nThe wand is the ultimate weapon\r\n\r\nHold nothing back! Unleash an arsenal of formidable magic to defeat attackers, protect yourself from harm and evade capture.\r\n\r\nUnique cover mechanics\r\n\r\nUse magic to create and wield cover. Utilise the environment to make shields out of trees, tables and statues, and then throw them at enemies, turning defence into attack.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":24975,"name":"Castlevania: Dawn of Sorrow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/579/5790020dbfad5acad35b421ea9e70d00.jpg","description":"The year is 2036, one year after the events of Castlevania®: Aria of\nSorrow™. Soma Cruz finds himself at the center of a mysterious cults\nplan to resurrect their evil lord and master Dracula. In order to save\nhimself and protect the lives of those he loves, Soma must infiltrate\nthe enemys home base, a towering replica of Draculas castle that is\nteaming with monstrous creatures.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":23620,"name":"Woodlands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86a/86aecab4489d8ddb9360e17d9f620861.jpg","description":"Your goal in Woodlands is solely to survive. To survive you will need to be able to provide yourself with food, water, and anything else you feel you need to comfortably live in the conditions you are surrounded by. Build a fire, a shelter, kill enemies around the woods trying to kill you and collect their meat and bones, hunt animals for food. Craft new things from the items you have scavenged and killed to Protect yourself and survive to your needs.\nJust survive.\n*This game is in early access. What is seen right now should not be a representation of what the final product may look like. Purchase if you are okay with what is included in the current build and are okay with having features added continuously and if you are interested in playing an unfinished product as it updates towards the full released product.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Acuze Interactives","platforms":[{"id":0,"name":"PC"}]},{"id":21606,"name":"Project Aftermath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1e/a1ea563a78efca06b3a8086a8506d4bb.jpg","description":"Project Aftermath is the PAX10 winning Arcade RTS where you command up to four squads of soldiers in exciting battles in a retro-futuristic world. Equip your squads to suit your playing style, researching new items using the spoils of war; choosing from over 100 different weapons, armour, power-up augmentations and spell-like special attacks.\nEngage in hectic massed battles against hordes of enemies. Capture strategic locations, rescue hostages and slaughter indiscriminately! Explore the landscape to locate hidden treasures and uncover the secrets of both your enemy and the mysterious planet you find yourselves on. Replay missions using fewer soldiers and items to earn greater rewards.\nAction, mystery, hideous manmachine hybrids; Project Aftermath has it all.\nJoin the fight!\nExperience 10 missions of fast-paced action on a mysterious alien world.\n20 Challenge missions to test your skills to the limit\nCommand up to 4 Heroes and see them become more powerful as they gain experience.\nClassless Heroes mean that you can equip your squad your way, using over 100 different items in 1000s of combinations.\nIn-game tactical deployment. Create turrets, deploy grunt-hunting drones, call for backup, request equipment changes mid-mission and more...\nYou decide how tough a mission is. Over or under equip your Heroes to blast your way through or to challenge the online high score tables.\nCollect Honours for exceptional skill in battle.\nUnlock all the Steam Achievements.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Games Faction","platforms":[{"id":0,"name":"PC"}]},{"id":20999,"name":"Call of Cthulhu: Shadow of the Comet","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8a/a8ac4b6f134bb78069fc1f6e282de008.jpg","description":"The year is 1910. Bathed in pale Spring sunlight, the small fishing port of Illsmouth is a sleepy New England town where time seems to stand still. Appearances can be very deceiving, however .... Beneath the peaceful tranquility of this small village, a horrifying truth lingers.\nWhispers in a dusty, secluded library ripple with fear as questions of the past are brought into the present. Is there a link between the return of Halley's comet and the resurgence of the Great Ancients who once dominated the land in a reign of terror? Legend tells tales of an ancient ritual ground, hidden deep in the shadows of the tangled forest, marked by an ornate and mysterious cross. Once, long ago, this site was the stage for wild and terrifying rites that no one dare speak of, lest they suffer the wrath of the Ancients.\nWhy are the townspeople of Illsmouth struck by such shattering terror? Why are they drawn to the ancient ritual grounds after so many years? What has released this curse from its deep sleep to play havoc upon the souls of innocent people?\nYou'll take on the role of John T. Carter, a brilliant young astronomer, piecing together the puzzling history of the village and its cryptic inhabitants. Incredibly realistic action and supernatural chaos intertwine to draw players deep into the puzzling mysteries within the Shadow of the Comet.\nIncludes the CD-ROM and floppy versions of Call of Cthulhu: Shadow of the Comet.\nBone chilling sound effects that hurtle you into the depths of chaos!\nConfront your deepest fears as you enter once more the realm of Lovecraftian horror!","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Infogrames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20219,"name":"Death Goat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4be/4bed4a511c12002673e5eca591efea33.jpg","description":"Death Goat is a bloody arcade shooter featuring hordes of brutal enemies & eardrum destroying Heavy Metal.\nZone out, sharpen your arcade twitch skills and decimate demons to a metal soundtrack featuring killer songs from:\nBetween The Buried And Me\nByzantine\nHoly Grail\nGod Forbid\nBloodshot Dawn\nI Legion\nTyrant of Death\nThe Raven Autarchy\nDethlehem\nWarforged\nKonkeror\nLorelei\nVanisher\nImmortal Guardian\nAegaeon\nBrutai\nKardashev\nDawn Of Leviathan\nExtinction Level Event\nMare Cognitum\nNYN","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Terminal Press","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]