[{"id":19981,"name":"Love is Blind: Mutants","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/849/8498f5eb893124e7191d193760a57669.jpg","description":"This is an Early Access Alpha - we will be updating the game periodically.\nLove is Blind: Mutants is a stealth game that relies on the character's mutant powers in order to overcome obstacles such as guards and blocked pathways. The game utilises a low-poly, high-contrast aesthetic akin to early PSX games, for that genuine 'no frills' nostalgic gaming experience of yesteryear.\nThe Subject, our main protagonist is a mutant who was living with his girlfriend in an abandon desert, believing that no one can know about them. Things turns bad, when some mysterious military people attacks and then abducts his girlfriend. Using various bread crumbs he reaches HyRL Facility. With only one aim to save his girlfriend, he is not aware about the dark secrets waiting for him.\n- The game is an action-adventured, and will be played from Top-Down view. Each level would be missions-focused and self-contained. Player can explore the environment to pick, tweak, hack and manipulate elements contained by it. All/some of this will lead player to accomplish the mission. The missions would be part of the story that the game wants to deliver.\n- The Subject, our main player is a mutant. He has power of telekinesis, and so he can interact with object without touching them. Here, the telekinesis power is visualized as some \"orange\" humanoid being.\n- The Subject, is also a shape shifter and so he can morph and disguise his identity. He can turn into a Vase, Box or any other object to remain hidden from his enemies.\n- The game is story driven, with mysteries and suspense. Player's every notion will be challenged during the progress of game.\n- Stealth is the effective way to play this game, where the player needs to plan each and every move. Player can use Telekinesis power, Morphing and stealth tactics to distract, sneak or kill enemies.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hybriona Labs","platforms":[{"id":0,"name":"PC"}]},{"id":19290,"name":"Brigade E5: New Jagged Union","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/931/9316997ed2b17b45a1fd7a97b28a561e.jpg","description":"Brigade E5: New Jagged Union is a tactical game that places gamers in the small tropical nation of Palinero on the verge of a civil war. The mission: hire a band of mercenaries and take control of the deteriorating situation before the country finds itself in complete ruin.\nThe story offers players an opportunity to experience three different viewpoints of the conflict or work out the political structure to achieve their own goals in the global domination. Game play for the title is based on an innovative combat system called SPMÂ® (Smart Pause Mode) that successfully blends together real-time and turn-based games.\nUnlike standard turn-based systems, Brigade E5: New Jagged Union does not use \"action points\" while in turn-based mode, but takes into consideration the character skills and attributes resulting in more natural and diverse behavior of units. Furthermore players can issue a chain of commands that will be carried out automatically.\nThe choice of weapons will satisfy even highly demanding fans, with more than 100 accurately modeled firearms, varied ammunition types, grenades, body armor and special equipment. Players will be also able to modify and upgrade weapons by adding various gadgets, sniper scopes, mini grenade launchers, bayonets, etc. The game provides extensive LAN and Internet Multiplayer modes, with CTF, Deathmatch and Fortress dynamic gameplay. SPM® is a brand new feature for the squad combat strategy genre. It gives all players a chance to command their soldiers at the same time, using even an enemy's pause.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Apeiron","platforms":[{"id":0,"name":"PC"}]},{"id":19009,"name":"Freddi Fish 5: The Case of the Creature of Coral Cove","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ac/9ac6b17ee52a6949060684d70d3e93c1.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameThere's more to this case than meets the eye!\nJoin Freddi Fish and her best friend, Luther, for the grand opening of beautiful Coral Cove Park - But wait! A mysterious sea creature has been seen lurking inside. If the park is to open on time you have to help Freddi and Luther find the clues, solve the puzzles and get to the bottom of this watery predicament.\nNew locations and puzzles each time you play!\nPacked with puzzles, games and activities!\nFind the clues and collect the tools to solve the mystery!\nIncludes 11 exclusive Freddi Fish audio tracks!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18048,"name":"planetarian ~the reverie of a little planet~","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a1/2a183db71b801fe6bec257631364bd1d.jpg","description":"Why don't you come to the planetarium?\nThe beautiful twinkling of eternity that will never fade, no matter what.\nAll the stars in the sky are waiting for you.\nIn time for the 10th anniversary since its original release in Japan, planetarian is an engaging and emotional visual novel from legendary game studio, Key. A sub-brand of VisualArt's, Key are also famed for creating Kanon, AIR, CLANNAD, Little Busters!, Rewrite, and Angel Beats!\nPlease do not divide Heaven in two...\nIt is thirty years after the failure of the Space Colonization Program.\nHumanity is nearly extinct. A perpetual and deadly Rain falls on the Earth.\nMen known as \"Junkers\" plunder goods and artifacts from the ruins of civilization.\nOne such Junker sneaks alone into the most dangerous of all ruins -- a \"Sarcophagus City\".\nIn the center of this dead city, he discovers a pre-War planetarium.\nAnd as he enters he is greeted by Hoshino Yumemi, a companion robot.\nWithout a single shred of doubt, she assumes he is the first customer she's had in 30 years.\nShe attempts to show him the stars at once, but the planetarium projector is broken.\nUnable to make heads or tails of her conversation, he ends up agreeing to try and repair the projector ...\nFor the first time, this heartwarming and memorable title is available on Steam!\nIt is fully voiced in Japanese, and can be experienced with both English and Japanese text.\nDesign, Scenario: Yuuichi Suzumoto\nMusic: Magome Togoshi\nVoice Cast: Hoshino Yumemi - Keiko Suzuki\nThe Junker - Daisuke Ono\n* This product is a localization of \"planetarian ~chiisana hoshi no yume~ Memorial Edition\", originally released for Windows on 30 April 2010.\nWhat is Kinetic Novel?\nA new form of entertainment for the sole purpose of storytelling -- not a novel, not an anime, not a game -- Kinetic Novel.\nMade with the goal of providing the reader with an unprecedented sense of presence and empathy for the characters through the use of a high-quality scenario, graphics, music, and other production values.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"VisualArts/Key","platforms":[{"id":0,"name":"PC"}]},{"id":17434,"name":"Armed and Dangerous","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b29/b2923546f8c6a98a77f41a9bf52ba3e6.jpg","description":"Meet the Lionhearts.\nA smack-talking rag-tag band of rebels bound on an impossible quest. With an arsenal of outrageous weapons, they're destined for victory in 12,000 bullets or less. If they can make it through an army of psychotic robots and a wall-smashing Goliaths, they just might save the world... if they don't burn it down first.\nNavigate through a richly entertaining story with your smack-talkin' partners in crime.\nTake down wicked enemies like half-man, half-animal Grunts, eliminator droids, wall-smashing Goliaths, evil monks and wild twiglets.\nBrandish over 17 outlandish weapons like the Topsy-Turvy, the Vindaloo Rocket Launcher, or the World's Smallest Black Hole and the Land Shark Gun.\nExplore five diverse environments including icy and snowy regions, mountains with breathtaking vistas, deep and foreboding woods, and rain-spattered cliffs.\nShoot your way through 21 action-packed missions.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Lucasfilm","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":17431,"name":"Disney Bolt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ba/9bace541629b998ba635e519f6e14b98.jpg","description":"In Disney's Bolt, players take on the heroic personas of the TV star dog, Bolt, and his owner, Penny, from the high-action television series featured within the film. As Bolt, players can use his superpowers, including laser vision and his superbark, which sends out a sonic blast to devastate opponents, and as Penny, players utilize stealth, hacking skills and a wheelbar, inspired by her scooter seen in the movie, to outwit enemies.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":15985,"name":"Secret Files 2: Puritas Cordis","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8a/a8afe3b83528ef33d2acc8060da4e38a.jpg","description":"The sequel to the award winning adventure hit Secret Files Tunguska. Famine in Africa, floods in Southeast Asia, economic crisis in Europe, and civil wars in South America, the world is on the brink of disaster. Nina Kalenkow is trying to escape all of this as well as her failed relationship with Max Gruber on a nostalgic cruise to Portugal.\nNina becomes a witness to murder in the Hamburg docks and is soon thrust into the spotlight of events that encompass not only continents but also centuries.\n\"Facial animation\" for visualizing emotions and speech\nInnovative puzzle design that always remains logical and fair\nDetailed and impressive pre-rendered backgrounds\nReal-time light and shadow effects of 3D characters and environments","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Animation Arts","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14694,"name":"Elemental Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d1/0d16b8a6bd2a4ba0e7f3d07b736e710b.jpg","description":"Elemental Heroes is a PVP MMO RPG with classical turn based combat. You will fight monsters, collect resources, improve your magic and army - do everything to win real people in tough PVP! There is a world consisting of three portals to fight and to explore. Each portal has its own rules, opponents and treasures. This game is about tactics, get in if you like this stuff!\nFeatures:\n- Classical turn based combat system\n- Free world PVP\n- PVE battles\n- Concurrent PVP game mode in 3rd portal\n- Upgradable magic and army\n- Real-time exploration mode\n- Numerous artifacts with random parameters\n- Live in-game chat\n- Dungeons with treasures\n- Powerful raid bosses\n- Lots of new game features in upcoming updates and lots of real players that will make your game experience always new!\nSee you in game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"JED GAMES","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9727,"name":"Empires Mod","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e79/e7935d0c8fcd497c6824f490455988c7.jpg","description":"Empires, the award winning Source SDK game, combines the best of the first person shooter and real-time strategy genres. Fight as either the Northern Faction, remnants of the fallen nation of Jekotia, or as the imperial Brenodi Empire.\nEmpires features:\t\t\t\t\t\tFour infantry classes - Prepare a surprise attack as the scout or take the enemy head-on as the rifleman. Drive back enemy tanks as the grenadier or support your team as the engineer. With four different infantry classes, each with customizable skills, you can create the perfect class to fit your playing style.\nSquad-Based Teamwork - Players can organize themselves into highly-effective squads, overwhelming their opponents with superior tactics. Squad leaders can not only direct their respective members, but also use special squad powers such as reviving dead squad members or calling down an artillery strike on the enemy.\nVehicle Combat - Whether you're ferrying troops around the battlefield with the Armored Personnel Carrier or reigning fire upon your foes with the Artillery tank, Empires features a variety of vehicular combat. Choose from six different vehicle types, including three levels of tanks, and customize your weapons, armor, and engines.\nReal-Time Strategy Commander - For those more inclined to RTS gameplay, you can play as the commander. Place buildings, build defensive turrets, construct vehicles, and conduct research on your way to leading your team to victory.\nWith 15 official maps and dozens more community-created ones, no two matches are ever the same. Empires brings FPS/RTS gameplay to a whole new level. Join up today and see what you've been missing.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Empires","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3373,"name":"MonsterBag","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f47/f4737d442e0d1b7c69990cfaabbdabb3.jpg","description":"Forgetful Nia leaves behind her monster backpack, V, on her way to the bus stop. In a world afraid of monsters, help V catch up to Nia while avoiding been seen by the humans. Oh, yeah! Watch out for the apocalypse.\n• Embark on an odyssey to reunite a monster bag and his owner Nia, while accidentally starting an apocalypse along the way\n• Avoid humans by remaining hidden. You’ll need your best puzzle solving skills, distractions and timing to avoid certain death.\n• Journey through 18 levels and face off against challenging bosses in a battle of wits and skill.\n1 player(s)\n100KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\n©2015 Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":625,"name":"Puzzle Quest 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb9/fb9d86c8fb6be0c7acf09dc02064ee1d.jpg","description":"Escape to a puzzle game fantasy world filled with amazing creatures, powerful weapons, and challenging minigames! Addicting Match 3 gameplay is blended seamlessly with immersive role playing in this sequel to the award-winning Puzzle Quest! Jump right into the action and customize your character with any one of four classes, each with different skills and abilities. Gain experience and earn treasure as you progress through the adventure, unlocking new spells and harder Match 3 challenges! Are you a brave enough hero to reclaim the once peaceful village of Verloren from the evil clutches of the demon Gorgon?\nKey Features\n\nLearn to use new mana gems, spells, weapons and much more.\nCustomize your characters with 4 classes in both genders.\nExplore an immense and immersive fantasy world in story mode!\nPlay tons of unique minigames to earn treasure and experience.\nUpgrade and equip your character then battle your friends online!\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":934643,"name":"The Thaumaturge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a55/a5525093eae1be7906c527e1bf62228a.jpg","description":"The Thaumaturge is an isometric, story-rich RPG with a unique take on tactical combat, character development features, and investigation mechanics, facing you with morally ambiguous choices – set in a world teeming with mysterious powers and strange ethereal beings called Salutors.\nThe year is 1905. Warsaw lives under the yoke of imperial Russian tsardom. Its inhabitants constitute a diverse group of different ancestries, views, and beliefs with often conflicting interests: Russian soldiers, Jewish merchants, Polish townspeople, and more. Despite the circumstances, the city is a buzzing metropolis, where one can attend a breathtaking party with the high society, and later get robbed in one of the dark alleys of the Praga district. A city of great hopes and dreams on one hand and dark desires on the other.\nIn this world, a force that cannot be ignored are Thaumaturges – individuals versed in taming spirit-like beings called Salutors, used for manipulation of the temperaments and affinities of other people and even ultimately in combat. The devil is in the detail - only Thaumaturges are fully aware of the Salutors’ nature and only they can perceive them in their true essence. Their capability to influence others significantly and demonstrably increases their ability to change the surrounding world - however, Thaumaturgy is a power that should be used with caution.\nFeatures:\nShape your story – as a full-fledged RPG, it allows you to alternate your choices and make you deal with the aftermath.\nDevelop your character – creating your own version of the Thaumaturge will allow you to approach situations in different ways.\nExperience unique combat and defeat your foes using human attacks and skills as well as psychic strikes delivered by Salutors.\nInfluence and manipulate the temperaments of other characters to bend their will to your liking.\nTame the power of Salutors – use the unique set of their skills to gain an advantage while exploring the world and when bringing your adversaries to their knees.\nSee the world that’s inevitably gone – explore the uncommon, heavily researched historic period of the early XX century Warsaw, where crime and luxury are often two sides of the same coin. Meet historical figures and learn about their involvement in the story.\nCreated in Unreal Engine 5 to deliver a detailed & beautifully crafted world.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Fool's Theory","platforms":[{"id":0,"name":"PC"}]},{"id":804851,"name":"The Plucky Squire","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/15b/15b8dfa78091b549baa744597e49edd3.jpg","description":"The Plucky Squire follows the magical adventures of Jot and his friends - storybook characters who discover a three-dimensional world outside the pages of their book.\nWhen the malevolent Humgrump realizes he's the villain of the book - destined to lose his battle against the forces of good for all eternity - he kicks the heroic Jot out of its pages and changes the story forever.\nJot must face challenges, unlike anything he's ever seen if he is to save his friends from Humgrump's dark forces and restore the book's happy ending.\nJump between 2D and 3D worlds in this charming action-adventure - solving puzzles, boxing badgers, flying with a jetpack, and enjoying many more delightful and surprising mini-challenges as you become the hero of a living storybook.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"All Possible Futures","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":688753,"name":"Spirit of the Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a2/3a2048e1c05a7efc4aaa9daf1ef1492a.jpg","description":"Spirit of the Island is a relaxing life simulation RPG set on a distant tropical island. Explore the once-prosperous tourist destination, meet the locals, and lend a hand to restore the towns to their former glory as you embark on a long journey that will help you rediscover your past!\n\n\nTHE POWER OF TWO\nSpirit of the Island will feature a 2-player cooperative mode, so grab your friend and embark on an epic journey together! Explore the Archipelago, fight the pirates, find epic loot, and discover the secrets of the tropical paradise!\n\n\nBE READY TO FIGHT\nSwords, scepters, axes, and other mighty weapons will help you protect yourself in your adventures! Be ready to battle against wild animals, ancient creatures, and evil pirates to reach your ambitious goals!\n\n\nBUILD, CRAFT & FARM\nInteract with almost every object in the game and express your creativity with hundreds of recipes to unlock and items to craft!\n\n\nCREATE A TOURISTS’ UTOPIA\nBuild new attractions, hire staff, develop the island, and plan parties that will attract visitors from all over the world!\n\n\nBE ONE WITH NATURE\nExplore a beautiful yet dangerous world, discover unique animals and plants, brave the weather and the changing seasons, and collect rare artifacts scattered throughout the islands!\n\n\nHELP YOUR COMMUNITY THRIVE\nMeet quirky characters, complete fun quests, make new friends, and contribute to the life of Island’s inhabitants!\n\n\nFOLLOW THE STORY\nBut do not forget to forge your own, as you tackle each challenge in Spirit of the Island and find out the secrets locked in your memories!\n\n\n\nAs a new arrival, you will have the chance to restore the archipelago back into the thriving tourist destination it once was. Build new tourist attractions and shops, create farms and take care of animals, explore beautiful beaches and dangerous caverns, and even plan unique festivals that will attract visitors from all over the world!\n\nBut it’s not its attractions alone that make the Island a paradise. Spirit of the Island features more than 14 unique characters to encounter, each with their personalities, quirks, and hobbies. So join the community, make new friends, and let them join you on a journey that will teach you more about your traditions and heritage than you could ever imagine!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"1M Bits Horde","platforms":[{"id":0,"name":"PC"}]},{"id":589194,"name":"Lacuna: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fa/2fa481018ae7188097a91135ac6e46d7.jpg","description":"WISHLIST THE MAIN GAMEhttps://store.steampowered.com/app/1364100/Lacuna__A_SciFi_Noir_Adventure/\nAbout the Game\nLacuna: Prologue tasks you – CDI agent Neil Conrad – with investigating the murder of a high-profile victim whose death could plunge the solar system into war. Solve the first in a series of connected cases that lead you deeper and deeper into the conspiracy at the core of this captivating 2D sci-fi noir adventure. Don't forget to wishlist the full game Lacuna, which will be released this summer.\nAnother cigarette tumbles into the abyss. The sun is slowly coming up, glistening in the sea of buildings below.\nI look up at the stars one last time before they disappear. They don't provide any guidance. They don't give a f*ck.\nI have to make this decision on my own, and very soon. Problem is, I don't know how. I've never been able to figure out why I do what I do. Not really.\nNo more time to think. I have to go.\nHere's the deal\nYou are Neil Conrad, CDI agent. Awoken by the news of a murder, you rush into a case that will soon turn your life and the whole solar system upside down. Ask questions, collect evidence, and put the pieces together until the ugly truth reveals itself... or not.No takebacks\nThe story branches and ends based on your actions. There's no going back. Sure, you can rush your way to the end – if you don't mind paying the price. Play your cards right, and you might make it out alive.How far will you go?\nSome questions don't have a right answer. Will you sell out a friend to protect your family? Will you endanger a loved one in exchange for public safety? Will you keep the peace or reveal the horrible, world-shattering truth?\nHungry for Point & Click Adventure?\nWhile the classics were great in their time, Lacuna does away with the baggage of many adventure game tropes:\nPointing & clicking Platformer movement controls (WASD / controller)\nSelecting all dialog options one by one anyway Non-repeating conversations and choices\nInventory management and counter-intuitive puzzles Immersive, story-driven mysteries\nPixel hunting Optional outlines on anything interactable\nStory grinds to a halt at every puzzle can always be driven forward\n\"x will remember this\" Real choices and multiple endings","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"DigiTales Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":520300,"name":"Atelier Ryza 2: Lost Legends & the Secret Fairy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/29f/29f6e16599aff2bee1ea544304603d5c.jpg","description":"Even if my strength is lost, I will always be by your side...\n\nAtelier Ryza 2: Lost Legends & the Secret Fairy is the newest entry in the Atelier series, and a direct sequel to the hit title Atelier Ryza: Ever Darkness & the Secret Hideout. Ryza returns as the protagonist, making history as the series’ first character to star in two successive titles. Join Ryza and her friends as they take on an exciting new adventure.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"KOEI TECMO GAMES CO","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":462685,"name":"Vampire: The Masquerade – Swansong","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/26e/26e184ce84eb999099da2c022dfa919d.jpg","description":"Based on the cult role-playing world and developed by specialists in the genre, Vampire: The Masquerade – Swansong is a narrative RPG in which your every choice determines the fate of the three main characters and of the Boston Camarilla.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Big Bad Wolf","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":428862,"name":"Pretty Angel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b94/b9490202fb9428212477944d00f41331.jpg","description":"Introduction In the game, your goal is to  swap the bricks to restore the pictures. Features   Complete levels quickly   Browse the gallery with one hand   100 achievements TradingCards","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GirlGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":286572,"name":"Snakeybus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7a/b7a8cf20c8cf8996edc1043923873f15.jpg","description":"Snakeybus is a casual arcade game that requires a balance between reflexes and forethought. Weave through the city streets and pick up as many passengers as you can. Drop your passengers at their destinations to cash in. The more people you drop off, the more your bus grows in length. Play smart and avoid crashing into yourself!Features4 playable maps with unique themes\n5 different types of buses\nEndless play\nDynamic and original soundtrack\nPlayer progression with maps and buses to unlock\nGlobal leaderboards\nFull controller support","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Stovetop","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":46899,"name":"Stormbound","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff5/ff5c3c3243f3f728448629720227d48b.jpg","description":"Immerse yourself in the rich world of Stormbound, as four kingdoms struggle for dominance. Construct a deck of unique and powerful cards and then dive into real-time battles against other players.\nNovel gameplay combines your favorite aspects of collectible card games with the tactical strategy of board games. Play cards from your hand to the game board and then watch your units march on the enemy base.\nChoose one of four kingdoms and build out a deck leveraging powerful synergies between your units and spells. With an ever-shifting meta, can you craft the deck that stands out above the rest?\nBattle players around the globe in head-to-head battles. Use in-game emojis to congratulate your opponent on a hard-fought game or rub a devastating board clear in their face.\nStormbound's unique gameplay combines the positional awareness of chess with the resource management of a collectible card game. Push for control of the board while minimizing your opponent's options.\nCollect dozens of cards, all with unique and powerful abilities, to craft your deck. With positioning being so key, there are endless possibilities to valid deckbuilding strategies.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kongregate","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":41456,"name":"The Elder Scrolls V: Skyrim - Dawnguard","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41b/41bdc2174dce7d9c47e2bf4ee7ecb80a.jpg","description":"Dawnguard™ is the first official game add-on for The Elder Scrolls V: Skyrim® - the 2011 Game of the Year. The Vampire Lord Harkon has returned to power. By using the Elder Scrolls, he seeks to do the unthinkable - to end the sun itself. Will you join the ancient order of the Dawnguard and stop him? Or will you become a Vampire Lord yourself? Featuring an all new faction questline and locations, the ultimate choice will be yours.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":40002,"name":"Shin Megami Tensei: Persona 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18e/18ecb5f7f733726319e4f6f4a4a104a2.jpg","description":"In Persona 3, assume the role of a high school student, who was orphaned as a young boy, and has recently transferred to Gekkoukan High School on Port Island. Only days after he arrives at the school dorm, he is attacked by a Shadow. The assault awakens his Persona, Orpheus, his only chance at defeating this creature of the night. He soon discovers that he shares this special ability with other students at his new school. From them he learns of the Dark Hour, a hidden time that exists between one day and the next, swarming with Shadows that have been slowing claiming victims known as The Lost - poor souls who have inexplicably been turned into walking zombies. Under the supervision of school chairman Shuji Ikutsuki, he joins his new friends in confronting this evil threat... With your school as the primary battlefield, you are forced to juggle between two lives: student by day, defender against evil by night. And your greatest challenges await you on the eve of each full moon.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":35225,"name":"Harry Potter: Quidditch World Cup","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/477/47700e321facfd148188a09c2408811f.jpg","description":"Lead any of the Hogwarts houses to victory in the Hogwarts Quidditch Cup. Then select an international team and use your new skills to take aim at the Quidditch World Cup!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":32846,"name":"Command & Conquer: Renegade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb7/fb7634700e0f4d97e569ec768a08c780.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"}]},{"id":30175,"name":"Alien Rampage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea6/ea6b1a9ec8a9a5e9ce8d8545f0ed1896.jpg","description":"Your ship is in ruins. your cargo is lost... and you are one ticked-off alien trapped on a planet overrun by bloodthirsty mutants with the help of a handful of enslaved natives and enough firepower to level a city. Nothing can stop you from eradicating the low-life untharians who trashed your ship. blast everything in sight and you may survive...\n21 bone-crushing, gut-blasting levels of alien butt kicking to complete.\n7 ultra-lethal weapons\nHuge blistering explosions\nOver 30 festering life forms including 3 fully-rendered “overlords”\nQuad-parallax scrolling\nFighting, jumping, shooting. action-packed adventure!\nAn equal test of brain & brawn\nHigh impact graphics","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Inner Circle Creations","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":30162,"name":"Re-Volt","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a53/a539c1d1426617bbce254db92cc3d7dc.jpg","description":"For years Toy-Volt had been producing games and toys for children all over the world. Within months of introducing their first products they shot to the top of their trade.\nHowever, it appears that the products have gained minds of their own. Escaping from the shelves that held them prisoners they have entered the real world, and are now creating chaos as they enjoy their new found freedom... the Toy-volt R/C cars have Re-Volted!\nRe-Volt lets you guide one of 28 remote control cars through insane race tracks set in unusual environments. Since the cars are the size of real remote control vehicles, objects found around the track are bigger than life. Curbs become huge walls, toys are obstacles, and everything is fair game to drive on, through, or over.\nThere are 13 different tracks spread throughout four Cups, including races set in museums, supermarkets, and settings which may look like your own neighborhood.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Acclaim Cheltenham","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":23051,"name":"The Elder Scrolls Adventures: Redguard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca3/ca33d086330031d9ad4e8e79a7943d7e.jpg","description":"When you buy this game, The Elder Scrolls: Arena and The Elder Scrolls Chapter II: Daggerfall will be added to your GOG.com account for free!\nThe year is 864 and Tiber Septim has begun his crusade to establish an empire in Tamriel, conquering all who stand in his wake. Though the Redguards of Hammerfell put up a valiant fight, they eventually crumbled to internal mutiny and the might of the Septim forces. Now under Imperial control, the Redguards are kept in line by the oppressive rule of Septim’s retainer, Amiel Richton. It is within this setting that Cyrus, a Redguard mercenary that has travelled Tamriel for over a decade, begins his adventure. Investigating the disappearance of his sister, Iszara, Cyrus is brought back to Hammerfell and thrown into the political intrigue that besets Hammerfell and its inhabitants. In his search for his sister, he must also play his part in this war between the Crowns and the Forebears.\nSet 400 years prior to the events of The Elder Scrolls: Arena, Redguard contrasts with the other games in many ways. As a third-person action-adventure game, it removes its RPG gloves and instead focuses on bringing you on an immersive journey through the eyes of Cyrus. If you’ve wanted to try the Elder Scrolls series, but haven’t quite enjoyed the RPG elements such as character building and customisation, this is definitely the game for you. But, despite taking a different path, this addition still contains many of the elements that the Elder Scrolls series is renowned for: a vast world, lore-laden narrative and compelling characters. So, whether you’re a native or a newcomer to Tamriel, this swashbuckling adventure will keep you captivated to the very end.Thrilling adventure rich with lore, dialogue, backstory and atmosphere\nExplore the Island of Stros M’kai, from the darkest catacombs to the highest towers\nNon-linear story progression, allowing you to explore the world at your own pace\nPut your wits to the test by solving puzzles and uncovering the mystery of Iszara’s disappearance","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":22289,"name":"Shogo: Mobile Armor Division","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/952/95273e46087beeb1b52a4471b2b298d5.jpg","description":"You play Sanjuro Makabe, a Mobile Combat Armor (MCA) pilot and Commander in the UCA Security Force. The UCA was originally formed by three dominant megacorporations (Andra Biomechanics, Armacham Technology Corporation, and Shogo Industries). Originally intended as a joint venture that would ensure the continued profitability of the three organizations that founded it, the UCA is now independent, and the dominant military power in existence.\nYour mission is to locate and assassinate a rebel leader known only as Gabriel. All of the action takes place either on the planet Cronus or on the spaceship Leviathan. The Leviathan is the flagship of the UCA and is commanded by Admiral Akkaraju. Cronus is the only known source of the biologically active material known as Kato, an incredibly powerful energy source essential to the process by which interstellar travel is possible.\nYour deadly enemy is The Fallen, a fanatical terrorist group lead by the mysterious Gabriel, threatens the balance of power on Cronus, and ultimately, control of Kato. You will fight them on your feet or from within one of the different types of Mobile Combat Armor, a giant mech which can run, duck, strafe, swim or transform into an ultrafast hovertank.\nYou will know the true power of giant robots!\nAnime-influenced graphics and gameplay design\nFight on foot or pilot a giant mech in both open and urban environments\nAn interesting storyline with two possible endings","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Monolith Productions","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Linux"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"}]},{"id":21484,"name":"A.I.M. Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b87/b8736eb88ac3308bfb1c83d519d3d1ba.jpg","description":"A.I.M. Racing welcomes you to the planet Polygon-4, where deadly vehicles of the distant future compete, swishing planet’s dusty atmosphere at a tremendous pace. Years ago humans along with the Arlings used Polygon-4 for a number of military experiments, but later left the test complex. However, the intelligent machines, AIMs, continue to fulfill objectives they are programmed for: further evolution and self-perfection. AIMs of the Reckoners clan built a network of tracks to test multi-purpose combat machines in action.\nIf you are not afraid of awesome speed, fatal traps and plasma charges, tearing apart your racing glider’s sheeting, A.I.M. Racing is a game of your choice. There is no need to save money to buy a new glider, no need to think, where you can acquire energy supply for a more powerful canon. The clan will give you everything – but you must win!\nOver 50 rounds in a Championship\nOver 30 various gliders\nDiverse tactic to destroy your opponents\nUnique glider dynamics\nTreacherous traps and useful bonuses.\nVast number of weaponry, including mines and rockets\nDetailed statistics for each race to show your skills\nOnline records table\nMultiplayer options","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SkyRiver Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21191,"name":"Tiestru","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ee/9ee6915c38f5c4a59b02f8629fa463ce.jpg","description":"The world was surrounded by darkness. Too much suffering was endured by human in the fight for freedom. Freedom was the light, the light to absorb Tiestru. It was believed that, if light was brought to the tower of Tiestru, Evil would fail.\nIn Tiestru, where you are in control of everything, you will test your warlock skills through cities and deep dungeons.\nENTIRELY CUSTOMIZABLE DEFENSE LINES\nBuild the structure of your choice with cubic crystals & Define your battle line.\nMULTIPLE SPELLS\nBlock, Frost, Prism, Lightning, Generator & Different levels of power, health and damage.\nDEPTH AND COMPLEXITY\nCreate new spells by building different structures\nIncrease your powers\nBuild new structures for enhanced powers\nGenerate resources & Find special locations\nControl the enemy & Shape their path\nMake special connections & Activate new spells\nPOWER TRANSPORTATION\nIncrease your power, transport energy from the core, on the ground or up in the air.\nFREEDOM TO USE ALL OF THE MAP\nEverything is up to you, define your strategy.\nA MINI GAME\nGain extra resources.\nSECRET LEVELS TO UNLOCK\nNew enemies & New maps. Each new level is another experience.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Warlock Arts","platforms":[{"id":0,"name":"PC"}]},{"id":20363,"name":"Anti-Opoly","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a4/4a42721b0c6c614aa90ba0704c9ddc7d.jpg","description":"The property trading board game with a twist! Based on the real-world board game that took a stand against big business and plunged its creator into a ‘David vs. Goliath’ legal battle, Anti-Opoly is the property trading game that lets players choose free enterprise or monopoly, with different rules for each path. Decide for yourself: who wins? Is it the Competitor who charges fair market value for rent? Or is it the Monopolist who amasses control over whole regions and can charge much higher fees?\nFeatures:\nEnjoy a twist on classic Monopoly play by taking the role of a Competitor or Monopolist\nIncludes Anti-Opoly and two historical games that preceded Monopoly: Original-Opoly and Quaker-Opoly\nInformation about the true history of the Monopoly game and the legal battle over Anti-Monopoly\nLocal multiplayer for up to six players\nSupports English, German, Russian and Dutch language options","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Webfoot","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20024,"name":"Dark Heritage: Guardians of Hope","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a56/a5635223e668ea8761749292e189e4df.jpg","description":"Explore the story of the former student of Professor Child, who comes to her mentor's aid following his mysterious disappearance on a quest to uncover the secrets of the philosopher's stone.\nEmbark on a wonderful adventure which will lead you to an island inhabited by a mysterious order. Face a dangerous enemy trying to claim an unbelievably powerful ancient artifact and save your mentor!\nFeaturesexplore 37 Intriguing Locations!\nDiscover the secrets of 31 challenging mini-games!\nSearch for clues in 14 scenes with hidden objects!\nDon't let evil take over the world!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":19031,"name":"Fatty Bear's Birthday Surprise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddc/ddcea780856264e4d63d51661e853b07.jpg","description":"Help Fatty Bear and His Friends Cook Up A Birthday You'll Never Forget!\nKids are wrapped up for hours in this fun-filled midnight adventure.\nWhat if you had just a few short hours to put together the best birthday party ever? Help Fatty Bear, Matilda Rabbit and Gretchen the Doll work together through the night to prepare a surprise party for Kayla. There's so much to do! Find ingredients for the cake, decorate - plus stop a pesky puppy who keeps running off with their stuff. Children can't resist having a whole houseful of fun things to see and explore. It's a recipe for discovery, laughter and learning, all in one. Delightful talking characters and enchanting animation keep your child fascinated, time after time.\nFatty Bear's Birthday Surprise is so entertaining and original, kids will have a hard time keeping adults out of Kayla's kitchen. What's more, Fatty Bear features hours of activity and learning that is always fresh, never boring. Kids meet up with exciting new surprises every time they play. Surprise Click Points. Click on a toy, a piano, a cabbage or just about anything, and watch what happens. Things come to life, play music, dance, fly and more. It's a magical world kids will delight in every time they play.\nFatty Bear Brings a Lot to the Party. Get to know the alphabet by finding missing letters, or learn how to count by bowling and blowing up balloons.\nIt's a Piece of Cake. Perception and memory skills are developed as kids help Fatty Bear, Gretchen and Matilda get it all together for the party with a simple click of the mouse.\nJust One of The Party's High Points. A tea set, a pulley and a telescope that really works! Isn't Kayla's treehouse a fun place to explore?\nLook What's Cookin' A loose puppy, a stuffed refrigerator and a flying rabbit are just some of the ingredients you'll find in this kitchen!\nSurprise Click Points. Click on a toy,a piano, a cabbage or just about anything, and watch what happens. Things come to life, play music, dance, fly and more. It's a magical world kids will delight in every time they play.\nThis product uses ScummVM across Windows, Mac and GNU/Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17858,"name":"Construction Machines 2014","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e8/6e85c971d78d803f4ac3ef1fa71aa5cd.jpg","description":"Become a boss of a construction company. Demolish old houses, flatten the ground, fill foundations with concrete and build new buildings - this is what you do. Sit behind the wheel of different construction machines - from trucks and diggers to huge cranes. Win contracts and gather money to expand your company and buy or upgrade your machines.\nGame Features:\nadvanced physics and interaction with environment\n8 different construction machine types\nrealistic handling\n20 contracts to fullfill\nadditional challenges and free play mode","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"GameCask","platforms":[{"id":0,"name":"PC"}]},{"id":17112,"name":"Candy Blast","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32d/32dbcf104418f082fe30712d9c71fc6f.jpg","description":"Candy Blast literally is the sweetest chain-reaction puzzle game, once you get started, you won't stop. In the game you have to kill pastries, which shoot in 4 directions, starting the chain-reaction.\nEveryone will be trapped by this game. You can start, but you'll never be able to stop. This is a very addictive puzzle game. The combination of beautiful arts and challenging levels.\n- PLAY through over 1200 levels of Candy Blasting\n- FIND the correct places to start the chain\n- Crush only one sweety, and it will blast the others, so you can make a huge chain-reaction\n- COMPETE against your friends for the top score\n- Skip the level if You can't made it\n- Collect the stars. If You dodn't collect enought stars, you can't go to the next package (you can see the requirements at the top of the level selection)\n*** ADDICTIVE GAME FEATURES ***\n- Cool game based on delicious pastries\n- Super awesome graphics\n- Great sound effects and music\n- Leaderboards\n- Achievements\nPS.: Recommended for diabetics","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"White Rabbit Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":16727,"name":"Astro Lords: Oort Cloud","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/589/5898d0d31068aa15b0514f33b6da4746.jpg","description":"Astro Lords: Oort Cloud is a free-to-play, science-fiction MMORTS. The game seamlessly combines construction management with click-and-drag Artillery style combat and strategy elements such as exploration, raiding and espionage. The game takes full advantage of stunning Unity 3D graphics to provide a visually rich experience.\nYou will take on the role of an Astro Lord, leader of your own asteroids in the Oort Cloud on the fringes of the solar system. As well as vying against other players for dominance in PVP combat, you must also face off against a mysterious alien race which has invaded the Cloud.\nBuild!\nAsteroids are at the heart of your Empire. You begin the game with a home asteroid which you must develop through the construction of facilities such as mines, power plants, factories and laboratories. Resources must be gathered, or stolen, to construct ammunition and cyborgs to fuel your expansion. Secondary asteroids can be added through colonising empty ones, or capturing developed asteroids from your enemies.\nAstro Lords: Oort Cloud is the first MMORTS to feature moving bases on a spherical map, putting you in the driving seat. Will you manoeuvre your asteroid in pursuit of your enemies, flee from hostile foes, or explore vast nebulae and alien ruins?\nShoot!\nLeading the charge against your enemies are the Captains. You can recruit up to 6 Captains from 7 different classes. Will you recruit a Warrior and focus your efforts on combat? A Scientist, to boost your research output? A Spy, to keep tabs on other Astro Lords and alien bases? With over 50 different skills to develop, you can tailor your Captains to suit your gameplay style. Each Captain can be fully controlled in battle against other players and AI alien enemies, and will fight to defend your base while you're offline too.\nCaptains and starbases can be improved through skills, runes, artifacts and officers, giving you complete control over your combat style and abilities. The click-and-drag Artillery style combat in Astro Lords: Oort Cloud provides fast-paced real-time combat – think Worms, but without having to wait your turn! Players can choose between a number of different battle modes including Team Deathmatches, Duels, Boss Fights and Alien Challenges.\nRaid!\nTo maintain your power in the Oort Cloud, you'll need to have strong friends and rich enemies. Forge alliances with other players and help defend each other’s asteroids, and send your spies to infiltrate and sabotage enemy bases. Lead daring raids against other players to steal their resources for yourself. Deploy Explorer cyborgs into the Cloud to discover ancient technology and mysterious artifacts. In the Oort Cloud, it's up to you whether you want to be the hero or the villain...\nAbout the Game\nAstro Lords: Oort Cloud was inspired by classic games such as Master of Orion, as well as modern MMOs like OGame and Dark Orbit. As an MMO in constant development, Astro Lords: Oort Cloud receives free regular updates containing new game features and improvements.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aratog","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13622,"name":"Crown Champion: Legends of the Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/318/3183b8667266c8f8e7c232b2c2cea272.jpg","description":"A Realm DividedWe stand at the death of an empire.\nFor three hundred years, the eight cities of the Crownlands have been ruled by the ancient throne of Aldmoor.\nNow the northern earls have risen up in revolt, and King Darius has been overthrown and executed by his own royal council. His former marshall Ademar has seized the crown, while much of the realm has returned to the days of squabbling petty kingdoms.\nIn chaotic times such as these, it is possible for even a lowly commoner to rise high in the world.\nThe people cry out for blood and entertainment. The brutal games of the arena provide both in equal measure. Now is your chance to establish a house and train a worthy team of fighting slaves who might someday compete in the grandest of all arenas.\nTheir glory will be your glory. Before the sun sets on this once-mighty empire, there is still time to carve out a legacy in blood and steel ...\nAbout the GameFrom the creators of The Deed, The Deed: Dynasty and the Space Pilgrim Saga comes a fantasy RPG/Management simulator set in the ruthless world of gladiatorial combat.\nIn Crown Champion: Legends of the Arena you are not a hero, a noble ruler, or even a combatant. Instead, you are the new owner of a team of fighting slaves, one of the many factions who compete for the adoration of the common people in the ancient storied arenas of the Crownlands.\nYour task will be to oversee the training of your fighters and build your estate into an effective school of combat, all while trying to enhance your personal reputation and standing among the nobles of the realm. This is an expensive business, and the king demands his taxes - so you must make sure to manage your treasury with care and attention.\nGlory awaits those with a bold heart and a steadfast mind, as well as a place for their faction among the legends of the arena ...\nFeaturesInherit a dilapidated estate and a couple of fledgling fighters, and then over time develop it into a prestigious academy for your team of fighting slaves. Restore the ruined buildings and hire new staff to serve your every need, from doctors and trainers to cooks and scribes.\nProgress through twelve arenas and dozens of opponents to reach the royal arena in the city of Aldmoor, where your slaves will fight for the glory of the king and queen.\nDevelop relationships with whichever fighters you choose to acquire from the slave ship, each of whom comes with a unique personality and a fully fleshed-out backstory.\nTrain your fighters and purchase new and stronger equipment as your fortunes increase, progressing through shortswords and basic leather coverings to halberds and full plate armour.\nAs your reputation grows you can also choose to become engaged with the turbulent politics of the realm, following a series of 'choice and consequence' based storylines and meeting many important characters along the way.\nAnd of course, you must have a life outside of the arena. Find a husband or wife to share in your glory. Build stables and start keeping a team of racing horses to bring more money into your household. Forge a legacy to last the ages.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":11597,"name":"Holdfast: Nations At War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/129/129d6a8af31f1fb4111bbb1063eddcd0.jpg","description":"Holdfast: Nations At War is an online multiplayer first and third person shooter focusing on a combination of teamwork and individual skill. Take part in historic clashes on land and at sea waged by the most powerful nations during the great Napoleonic Era.\r\nPlay the way you want!\r\nCommand and crew historically inspired sailing vessels in powerful duels or within squadron operations where cooperation in running your vessels leads to victory. War at sea is an entirely different setting and these clashes will take place off the coast in a selection of beautiful arenas.\r\nTake the King’s shilling or fight for the Emperor in glorious Napoleonic field battles. Join the ranks and keep the line steady or provide support from the rear with cannon fire as you strive for dominance over the battlefield.\r\nJoin the Navy\r\nExperience what it’s like to be a crew member on board a military sailing ship. Raise the sails, fire the cannons, test the water depths and cooperate to keep your vessel afloat!\r\nEnlist in the Army\r\nWork with your comrades to storm enemy fortifications or support the fight from the rear with artillery fire. Keep the line steady in open field battles and lead your men to victory!\r\nPlay as a Captain, Sailor, Line Infantry and more! Every class comes with its own traits and roles which are crucial for your team’s survival.\r\nHoldfast: NaW’s order-based system allows for intuitive cooperative play where your ability to work as part of a team matters just as much as your personal skill.\r\nWhether you are manning a cannon, firing a musket or swinging a sword, Holdfast: NaW's combat mechanics are easy to learn but hard to master. The game rewards player skill via a precision and timing based directional melee system.\r\nThere will be plenty of chances for you and your mates to take on other groups in tournaments and fierce competitive events. Hone your skills because you can be sure that your opponents will too!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Anvil Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10646,"name":"Alien Shooter TD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbf/fbf478acf816068a7cb08dbcc9ca88cc.jpg","description":"Be careful when downloading the game: you run the risk of escaping the real world for a long time to get completely absorbed in saving the Earth from the imminent threat!\nWe are happy to present our innovative game in the genre of Tower Defense inspired by the legendary Alien Shooter series! Here you will not just build towers to protect your territory, but will also get in charge of a platoon of elite warriors. Each one of them has their own field of specialization, unique features, as well as development possibilities. It is also possible to equip each class of warriors with weapons of your choice.\nThe attack is under way. The armed forces are mobilized. Violent battles are happening across the whole globe.\nYou are the commander of an elite warrior platoon and find yourself in the midst of large-scale war events, and your actions will determine whether blood-hungry monsters will destroy our planet, or if  humanity will come out victorious!\n\nThe game was created in keeping with the best traditions of Sigma games, no concessions of any kind - everything is just like in real life!\nTotally real-life presentation of events – there is a limited munitions stock for each weapon, and it has to be replenished during combat.\nPowerful supply crates that include ammunition, weapons, coins, and ammo.\nYour enemies’ dead bodies don’t disappear - wait to see what happens when you finish each level!\nSeven character classes with unique characteristics and development possibilities.\nHundreds of types of weapons – equip your troops according to your personal gaming style.\nAny kind of weapon can be modified by expanding its basic features. You can disassemble it and get money, as well as auxiliary supplies.\nSend your troops to get training, so they can develop a variety of combat skills.\nBy combining different kinds of forces, you can develop your own tactics needed to accomplish each mission.\nIn a critical situation, you can use bombs land mines, as well as supply Drones that will momentarily replenish munitions stocks for all the combatants.\nAnd, of course, in keeping with our traditions, there are unprecedented crowds of monsters, plenty of bloodshed and explosions, as well as many other things you would usually see when you play our games on your devices!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sigma Team","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":10217,"name":"Automobilista","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/386/386e2ea10ce7ba40805c3dbf2b69b8b4.jpg","description":"AUTOMOBILISTA puts you in the driving seat of one of the most advanced racing simulators and delivers a uniquely diverse motorsports experience!\nAs the natural successor to Reiza Studios´ previous title - the highly regarded Stock Car Extreme, originally released in 2013 - AUTOMOBILISTA continues to simulate the premium Brazilian racing series such as Stock Car V8, Copa Petrobras de Marcas, Formula 3 Brasil and Mitsubishi Lancer Cup, now packing every car and every track from their respective 2015 championships.\nBeyond the brazilian core, AUTOMOBILISTA is extensively complemented with one of the most diverse selections or racing vehicles you will find in a racing game: only in AUTOMOBILISTA will you be able to jump from a rental kart to a 800-HP single-seater; from drifting a Rallycross EvoX to jumping ramps in a Supertruck; from mastering the driving basics in a Formula Vee to managing a full 24h race in an endurance prototype; back and forth through historical and modern content featuring a sample from several decades of racing history - all of this and much more within a few mouse clicks. Thoroughly researched and cohesively developed for maximum simulation accuracy, AUTOMOBILISTA captures the fun only motorsports in its various forms can provide.\nIn addition to the content already present in Stock Car Extreme - all of which comprehensively upgraded - AUTOMOBILISTA turns it up to a new level by adding all the new cars & tracks proposed in the SimRacing Bonanza crowdfunding campaign, new simulation features such as dynamic track conditions, advanced transmission and tire modelling, substantial upgrades to physics, graphics & audio, new game modes and much more!\nThese are some of the features that make AUTOMOBILISTA stand out as a purebred racing simulator:Upscaled 720 Hz physics and 500 Hz input rates grants AMS super-accurate, high fidelity physics and Force Feedback\nVehicle physics based on models developed for professional racing teams with in-depth exclusive data\nMinutely detailed and accurately modelled race tracks with 3D bumps with distinct surface properties\nEngine sounds sampled from high-quality recordings of real cars\nCapturing the ever-changing demands of racing.\nCars with old-style gearbox mechanisms will demand proper gear engagement by using the clutch or synchronizing revs.\nModern cars will demand handling of advanced electronic systems.\nHigh downforce cars will create an aerodynamic wake for those that follow.\n24h cycles will allow racing from dusk to dawn and at night.\nDynamic track conditions turn the racing line into a grippy rubbery trail and builds up marbles offline\nDynamic tire damage & dirt pickup add further extra dimensions to the driving experiencesumption & estimate; Small tire revision in 86 version[/list]","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Reiza Studios","platforms":[{"id":0,"name":"PC"}]}]