[{"id":45613,"name":"MagiCat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab0/ab0a8d48ccc7b0d7cf6f05dbf614950c.jpg","description":"MagiCat takes players on a quest to retrieve a stolen artifact and explore the astounding magical worlds of the MagiCat universe. Using  the powers of dashing, high jump, and fireball, along with items that can be unlocked as the story progresses, players must help MagiCat regain the world’s lost relic. Players will indulge in a memorable adventure packed with excitement and addictive gameplay.\nThe game features:\nHandcrafted retro experience ranged from the colorful pixelated art, nostalgic music, and classic platformer gameplay mixed with modern elements.\nWorld map with many secrets to explore.\n63 levels each with their own unique boss battle spread across 7 worlds.\nGorgeous level design with a learning curve that will satisfy those that love to face challenges.\nVarious unlockable skills and color schemes for the main character.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kucing Rembes","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":39118,"name":"Guitar Hero: Metallica","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b4/5b4b871003501327cd08085023d1f085.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Neversoft Entertainment","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":36848,"name":"Asterix & Obelix XXL 2 - Mission Las Vegum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbd/cbd274d003424bfd317c66b94f8af500.jpg","description":"By Toutatis! The indomitable Gauls are back with a new video game!\nMore than 10 years following their last appearance on games consoles and PC, Asterix and Obelix are back and in better shape than ever! Asterix & Obelix XXL 2 is a superb blend of action and adventure for all ages, with a winning combination of comedy and brawling.\nBut where has Getafix gone? The long-bearded druid has disappeared after betraying his own people for Julius Caesar! The Gaulish village is in uproar! They must find out the truth! Always ready for a fight, Asterix and Obelix are sent to Rome on a mission by their chief Vitalstatistix. There, they find a new amusement park - Las Vegum - built by the famous Roman emperor. To what end? What is Getafix hiding?play As Asterix and Obelix\nExplore Las Vegum with the inseparable Asterix and Obelix, not to forget their faithful companion Dogmatix, who will be no small help in facing the Roman legionaries. And he will not be your only ally, as the unrivalled magic potion remains your number-one weapon against the Romans!\nSwitch between the shrewd Asterix and the superhumanly strong Obelix to take on the hordes of Romans, solve puzzles and overcome the many challenges that lie in wait!a Unique and Immersive Adventure\nDiscover the huge amusement park Las Vegum, never before seen in the franchise! Our two happy adventurers make their way through this richly detailed and colorful world, which remains faithful to the iconic series of comics created by Goscinny and Uderzo. Playing Asterix and Obelix is an experience that is truly worth a trip all the way back to 50 BC!a Game For All Ages\nWhether you're a diehard fan of the Gaulish tribe or have just discovered their adventures, Asterix & Obelix XXL 2 is an accessible game that's enormously fun to play. You can also enjoy the many references to be discovered. It's hard to not to love the game's endearing characters and environments. There are special bonuses to be found and a new difficulty mode for the more experienced players.an Updated Version\nAsterix & Obelix XXL 2 brings the experience of the original game to an unparalleled level. The enhanced graphics pay tribute to the comic books and the gameplay has been totally redesigned to make fighting the Romans even more fun! It also features a new system to improve your attacks and the ability to set yourself special challenges!","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":28336,"name":"Beautiful Katamari","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e6/4e62622998394d17d53f6cc9a5df7f6a.jpg","description":"(Online Interactions Not Rated by the ESRB) Roll your katamari and collect lots of stuff in order to increase its size in this fun and quirky action game! There are no refunds for this item.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":20816,"name":"Anno Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35a/35ab605cb64e6bba457e5c356bc6cc24.jpg","description":"Anno Online upholds the traditional in-depth economics that are the hallmarks of the award-winning Anno franchise.\nThe key element of the game is the player’s main island, where the foundations of your commercial empire will be set. By satisfying the needs of your population, constructing new buildings and managing the production, you will unlock new buildings and face new challenges as your population’s demands and consumption habits evolve. Soon, one island won’t be enough to satisfy all their needs and you’ll have to discover and claim additional islands and connect them via ship trading routes to your main island. For the first time in the Anno series, players have the opportunity to be part of a giant empire and get organized in powerful guilds to work towards joint goals and server-wide quests. A key element is the trade of goods with other players creating a social environment of continuous player-to-player interaction for the first time within this traditional franchise.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19067,"name":"Cyber City 2157: The Visual Novel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59e/59ef20e3c9de80810f8ed0fde0268355.jpg","description":"You wake up looking at the cell and trying to remember a dream you have seen last night. There are only vague memories in your head - It was something connected with the cosmos and with the frightened astronaut's face. You have no time to think - you have to go to the work. There you create a perfect simulations of a human, called Molds.\nSo your journey through the parks, cemeteries, suburbs and dreams begins. Your adventure is in the City where the sun never sets.\nIt's a surreal mix of classical visual novels, odd choices, cyberpunk, mysticism and everyday life of a man lost in a rapidly changing reality.\nYou'll see the game, inspired by the numerous arthouse films, postmodern literature and dreams that come closer to dawn.\nThis game is the memory of the games that have never existed.Features:\n150 background images, some of them are animated, made in the old-school pixel art\nGraphics, based on a simulation of the old systems and monitors (mostly on the Commodore 64 and MSX)\nDive into the crazy world full of mysticism and cyberpunk\nThe atmospheric and varied music (40 songs)\nThe total duration of the game: more than 4 hours\nJust read, watch, listen to and ponder the riddles of the game world\nSteam Trading Cards\nThank you and happy reading!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Harotobira","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17890,"name":"Aztaka","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a2/9a2cb12c1a94864f2f07fccf2a91fb74.jpg","description":"Inspired by Aztec legend, this action/rpg side-scroller will casts you into the middle of a war between the Gods and Mankind. As Huitzilo, heir of the Sun God, skilled in both the arts of combat and magic, only you can save your people from the wrath of the Aztec Gods by reuniting the seven phonograms. Accompanied by your faithful companion Ayopha - trapped in the form of a hummingbird by a magical curse – you will overcome the obstacles in you path through a combination of fighting prowess and spiritual magic.\nPlunge into a new and fresh universe\nManipulate spiritual energy, through an innovative hybrid control scheme to solve mysteries and vanquish foes\nEnhance and customize your character by training skills and abilities, and acquiring ancient artifacts\nEmbark on optional side-quests to acquire valuable items and gold\nVisit shops to buy and sell potions, rings, piercings and skills to aid in your travels\nTwenty-one unique and detailed levels with grand, richly-detailed backdrops and fluid character animations","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Citeremis","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16286,"name":"Quadrilateral Cowboy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b53/b5382152af0dacd08d53c1e0dfdc624c.jpg","description":"Hacking. Dial tone. Cassette decks. Sabotage. Suitcase decks. Brainbox injectors.\nQuadrilateral Cowboy is a single-player adventure in a cyberpunk world. Tread lightly through security systems with your hacking deck and grey-market equipment. With top-of-the-line hardware like this, it means just one thing: you answer only to the highest bidder.\nThe Standard Edition includes:Quadrilateral Cowboy.\nDeveloper Commentary.\nReference Manual.The Deluxe Edition includes:Everything In the Standard Edition.\nQuadrilateral Cowboy interactive art book.\nPDFs for box art, poster, and papercraft characters.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blendo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11769,"name":"Spaera","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/92f/92f762ed7e6110f7f25db9df59abbc62.jpg","description":"SPAERA is a head-to-head puzzle fighting game, using an unique match-3 cascading mechanic as its core system.  The world of SPAERA is heavily inspired by characters, gameplay and themes from games that we loved to play as we were growing up.  We've created a roster of eight original characters that you can select, each with his or her own individual story.  Players can battle the computer in the game's campaign mode, or against live opponents in local and online matchmaking.HOW TO PLAYPlayers choose a unique character as their avatar, each with four of their own unique spells that can vary from Attack types to Protection types.  Once the game begins, Players receive a continuous stream of puzzle pieces that are arranged in different color and shape configurations.  Players are then tasked to match 3 or more of the same color blocks in order to trigger a clearing response.  When clearing is initiated, any color on the active puzzle piece that is not the same colors as the cleared ones will cascade downwards on the board, enabling setups for complex combos and chains.  There is also a power meter that will increase as you clear blocks or obtain and clear special block types that enable the player to issue magic spells to either support their own board or attack their opponent.  The first person to force their opponent to have nowhere else to place their puzzle piece wins the match.SPAERA FEATURESOur lead artist and his team are amazing.  Seriously, check out the screenshots for yourselves.  All graphics and animations were hand drawn!  We like to think of SPAERA as something that everyone can enjoy; it's pretty easy to pick up, but you can add a lot of depth to your strategy.  In many ways, SPAERA represents a mashup of a lot of the games that we love: games that you can just pick up and play by yourself or with friends without too much fuss.  It's fun, quick, and easy, just like a favorite snack.  Head-To-Head multiplayer with server supported Matchmaking, Ranks, and Ladders enables endless fun and depth.  We are trying to build a community of people that can be positive and enthusiastic about playing with us and each other, and hopefully help us to continue develop more games that everyone can enjoy.WHO ARE WE?Blazing Orb is founded by a pair of coders that have always been gamers at heart with huge love for RPGs, platformers, side-scrollers, fighting games, and puzzle-strategy games.  SPAERA is our attempt to pay homage to all the influences and good times that we've had growing up playing these games, and hopefully be able to pay forward all the fun to others.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blazing Orb","platforms":[{"id":0,"name":"PC"}]},{"id":6561,"name":"Bridge Constructor Stunts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba5/ba5c033f68375551b3f61e85c569dfd9.jpg","description":"Stuntman and engineer in one? No problem with Bridge Constructor Stunts!\nBuild imposing ramps and loops to reach your goal in the diverse stages. But building structures alone isn't enough this time: you sit behind the wheel of the vehicles yourself and have to maneuver them skillfully to the goal. Collect stars, complete daredevil jumps, flips and spectacular stunts, leaving behind a trail of destruction across the entire level to beat the high score. But you can only do all that with perfectly constructed bridges and ramps.\nJoin the huge Let's Play community\nTo ensure none of your jumps are forgotten, you can save your runs as videos and GIFs, directly upload them to GIPHY and share them with your others (video export and GIF upload functions for Windows version only). Let the world be part of your most outrageous jumps!\nImproved Construction Mode\nOnce again you have access to a variety of building materials with different properties. Numerous improvements make building even easier: simply click to convert a beam you have built into road, and vice-versa. Click and hold on a part of the construction and you now have the option to reposition your structures without having to build them from scratch.\nLoose Screw!\nWe have hidden some hard-to-reach screws in some of the levels. Find and collect them, and you might be able to put these screws to good use in the future...\nFEATURES:\nThe latest instalment in the internationally successful Bridge Constructor series!\nImproved and simplified Construction Mode\nBuild ramps and drive vehicles across them yourself\nDiverse level with different objectives: collect stars, score target, reach the goal…\nDelivery vans and dump trucks with cargo that wreaks havoc when coming loose, but is also useful to help you collect items\nVarious building materials\nSpectacular stunts and rampages of destruction\nAchievements and rankings\nReplay feature and video/GIF sharing: save your best bridge crossings and stunts and share them with your friends (video export and GIF upload functions for Window- s version only)\nController-Support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":5506,"name":"3D Dot Game Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10e/10ebfb0634654983b0c8ab8df1ccfdb1.jpg","description":"Retro chic meets modern sleek in this, the ultimate love letter to retro gamers. Seamlessly fusing new and old, the golden era of gaming is felt in every detail of this adventure.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Silicon Studio","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":477,"name":"Pineview Drive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/149/149bd3ae593d755b7838db9f1b4fe17f.jpg","description":"A one-of-a-kind horror shocker – a game aware of your fear!\nAn old abandoned mansion lies at the dead end of Pineview Drive. A troubled man is standing at its gates, looking over the property. 20 years ago he had visited this estate with his wife Linda. During their stay his beloved vanished without a trace – her mysterious disappearance unresolved.\nFor 20 years no clues, for 20 years no peace, for 20 years this house on Pineview Drive has not relinquished its tormenting grip on him. Now, he returns in hopes of coming to terms with his nightmarish past.\nThe ominous legends haunting this seaside lodge have become renown. The stories abound that no one has been able to endure more than 30 days within the mansion since Linda’s disappearance. Facing a force greater than you ever imagined, you must cross the threshold and confront the evil that envelops this cryptic cottage. To solve the mystery of Linda’s disappearance and lift the veil on this troubling history, there is no time to spare.Features\nThe game watches your every move and reaction - you will need steady nerves if you want to survive the game unscathed.  In this extraordinary gaming experience, any trace of fear comes at a price – your life. Get ready for a ground-breaking spine-chiller.\n30 in-game days: Each one allows you to delve further into the secrets of the house on Pineview Drive\nEvery move and reaction is being watched: Do not get yourself worked up or you will lose precious health\nPremium sound scenery and effects: Every tone will run your blood cold\nBreathtaking horror atmosphere: Face your deepest fears within the house\nAdditional game modes (introduced with Update 1.5):\nOpen House Today: Explore the mansion in bright daylight\nScarecrow - The Eight Letters: Collect eight Letters that are scattered within the house and garden - but watch out for the scarecrow","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":573193,"name":"SMASH LEGENDS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/049/0493da9807a136fc5aae29be91d686fc.jpg","description":"\"SMASH Must Go On!\"\nTo return the Library World back to normal, or to protect one’s honor.\nEach LEGENDS joined the battle for their own cause.\nTheir ultimate brawl competition begins now.\nWho will prove themselves to be the true LEGENDS?!\nSMASH LEGENDS is a casual brawl-action game that unfolds in the Library World,\nan island that floats above a vast sea of clouds.\nJoin now and play for free in a cross-platform environment against players from Steam, iOS and Android devices.\nKey Feature:* SMASH with epic knock outs!SMASH, SMASH, BOOM! Enemies are more likely to get knocked out when their HP is low.\nKnock off enemies from arenas set in floating islands to achieve victory.* SMASH across variety of game modes and maps!Multiple modes are available in SMASH LEGENDS, including 3 vs. 3, 1 vs. 1 and Free-for-all.\nSmash your enemies in a battlefield filled with fairy tale SF fantasies.\nAnd release your energy in this thrilling world.\n- Dominion (3 vs. 3): Capture and hold an area with your teammates to achieve victory.\n.\n- Team Deathmatch (3 vs. 3): A team competition to the death.\n.\n- Battle Royale (8 Player FFA): Only 1 final player will survive in this 8 player free-for-all mode.\n.\n- Crown Guard (3 vs. 3): Defeat the enemy with the Crown while protecting your team’s Crown.\n- Harvest (4 Player FFA): Player who harvests the most fruits by destroying Mandrakes win.\n- Duel: A 1 vs. 1 duel where only your controls and skills count.\n(* Game modes will continuously be updated.)* SMASH with unique characters!There are multiple unique characters, each with a different story.\nYou will be able to grow various Legends by playing with them, and unlock new Legends in the process.\nAnd your choices will decide whether or not you will be able to make great plays.\nAre you ready to wreak havoc in the Library World?\nExperience the fun in SMASH LEGENDS now.\"SMASH Must Go On!\"- SMASH LEGENDS -","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"LINE Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":532167,"name":"Evil Dead: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ea/2eaa2999318c5bb1f46e70032d272dab.jpg","description":"Inspired by the iconic horror, humor, and action of the \"Evil Dead\" universe, Evil Dead: The Game brings the biggest characters together from the franchise in an over-the-top, gore-filled experience against the forces of darkness. Work as a team of four survivors, including Ash, Kelly Maxwell, Pablo Simon Bolivar, Scotty, Lord Arthur and more, to fight Deadites, banish the vile Kandarian Demon. Or become the mighty Demon yourself, using your powers of possession to stop the good guys dead and swallow their souls!\n \nBattle across memorable sights from the franchise, including the infamous Knowby cabin, brought to life with tons of terrifying visuals and all-new dialogue from Bruce Campbell. Discover more than 25 weapons, including Ash’s Gauntlet, Boomstick, and chainsaw, and level up a variety of skill trees to grow even stronger and survive the night.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":45603,"name":"Zup! 6","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/011/011116fcc9469fc49e38f441301f5b75.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ 2440+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":42039,"name":"Dishonored: The Brigmore Witches","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e7d/e7d6791ee5969a8d7736f3e7cf8a20cd.jpg","description":"In The Brigmore Witches, continue your journey as the legendary assassin, Daud, and bring his twisted narrative that began with The Knife of Dunwall to a close. After discovering the identity and intentions of Delilah, the leader of the Brigmore Witch coven, you set out to disrupt her from completing a powerful ritual that will spell your doom. Having already been betrayed by your lieutenant, Billie Lurk, you must rely on feuding gang factions-the Dead Eels and the Hatters-to negotiate your way through previously unseen districts of Dunwall en route to Delilah's stronghold. Regardless of the way you reach your destination, one thing is for certain - you will finally answer for your treacherous actions and fall before the mercy, or punishment, of the Royal Bodyguard and Assassin, Corvo Attano. Additionally, your power, weapon and item upgrades, Chaos level, and player actions from The Knife of Dunwall will carry over via a compatible save file option.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arkane Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":41776,"name":"Dishonored: The Knife of Dunwall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/528/528d9f7d92a011bf0858ce066ef6883a.jpg","description":"In The Knife of Dunwall you assume the role of Daud, the legendary assassin who killed the Empress, and access his weapons, gadgets, allies and supernatural abilities. After assassinating the Empress, and forever changing the fate of Dunwall, you embark on a search for redemption. The Outsider reveals the key to your atonement, but who-or what-is Delilah? Accompanied by the Whalers, your loyal band of mercenary assassins, your search will take you through never-before-seen districts of Dunwall as you face off against new and terrible foes. Employ a unique arsenal of new weapons and powers that enhance Dishonored's dynamic combat, mobility and stealth systems. In the struggle to hang onto the last shred of your humanity, the choices you make will ultimately determine your fate.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arkane Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":21742,"name":"Mashed: Drive to Survive","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b31/b31465896d71334036df8effc1cbb2b6.jpg","description":"Combat-heavy racer from developer Supersonic, played from a top-down perspective. Mashed features four players racing at one time either in teams of two or every man for himself. The 13 different race environments are spread over various terrain including ice, sand and highways. An assortment of weapons are used to batter opponents into submission and gain rank in the race. However, once another car is blasted off road the player will still be able to target the race leader with air missile strikes.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Supersonic Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":20909,"name":"The Knobbly Crook: Chapter I - The Horse You Sailed In On","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/837/837812f9e1e181264391a1c0d21422f2.jpg","description":"Enter the surreal, disturbing, and ridiculous world of the Knobbly Crook in the first chapter of this old-school point and click adventure. O'Sirus the Snip is a simple paper farmer driven to epic adventure by a spooky face with a spookier voice. He will ultimately seek to become a Knobbcrookian royal guard–a Guffaloon. Stories of their heroic battles against the fearsome Bogold empire echo throughout the Crook. Unfortunately, they’re not currently recruiting simple paper farmers. He’s going to have to use every dirty trick in his book to cheat his way to the top and that means YOU will need to understand the key elements of the Knobbly Crook - Rock, Paper, and Scissors. Creatures of stone crush the metallic Knobbcrookians. The Knobbcrookians herd and farm paper animals. Fearsome stone giants fear tiny paper animals.\nIn the first chapter, The Horse You Sailed In On, O'Sirus finds himself on trial for all the crimes you have not yet committed. Retell his nonsensical story as his journey begins, finding himself a stowaway on a ship that is half horse, half boat, and half whale. Every moment that passes takes you further from your goal--the Knobbly Crook. It's up to you to torment the Drafthorse's unsuspecting crew in an attempt to alter their course.\nThe Knobbly Crook will be released in several chapters, all of them completely free. No ads, no tricks.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gnarled Scar Manipulations","platforms":[{"id":0,"name":"PC"}]},{"id":11732,"name":"Super Duper Party Pooper","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6a/c6ad8dc2893b749fa42b197ac5e4b25d.jpg","description":"Have you ever wanted to poop on party goers but were too socially awkward to just go for it? Well, Super Duper Party Pooper is about to change all that. In this follow up to the smash hit There’s Poop In My Soup by Rudder Games the player will find themselves in the middle of a raw human story of existential panic.\nVisit exotic locations, travel from beijing to paris, from the polar ice caps to desert islands Sample the local delicacies, let them pile up inside until you couldn’t possibly take anymore, then, turn around, take aim, and drop a deuce or two on the party crowd.\nSuper Duper Party Pooper is a rhythm based party pooping simulator that has the player chomping down as much food as possible to the beat of the music. The more food you eat, the more poops you create, much like real life. The player then unleashes those poops onto the party crowd trying to rack up as many points as possible, allowing them to unlock new locations and bonus features.\nBut the fun doesn’t stop there, Players can add their own music to the game and poop to the beat of their favorite tunes, you can pinch a loaf to the beat of beyonce’s new hit single, drop a deuce to michael jackson's thriller or drop the kids off at the pool while listening to Adele’s relationship problems, the poosibilities are endless. The game also features Steam Workshop integration and the characters are completely customizable allowing the community to edit or create new characters, animations, pooping styles and more.\nThere are parties out there just begging to get pooped on, what are you waiting for?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"K Bros Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11716,"name":"Dragon Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2a/d2a6572e317a6bd288087cf3c9a1e883.jpg","description":"My ability is limited, but I am still aspired to make an exciting IG (independent game). The second IG Dragon Knight is a 2D side-scrolling action game with Rogue-like random elements. From the sketch design of original characters and monsters, you could probably guess that I am a big fan of MH series games. Yes, from P2 till now, my path to hunter has never stopped.\nSmooth striking is pretty important for an action game, which is also a great challenge for me. Now my idea is to try to make a game with more violence aesthetics. Besides, I can design weapons and equipment based on monsters’ characteristics. Characters can not only change their appearance but also obtain skills and attributes randomly after picking up the equipment, which gives you a new experience every time you replay it. Rampage Knights and Lost Castle did a great job on that aspect, which have given me great help and inspiration.\nOf course, all of the above is just the beginning of my dream, your participation and encouragement are what really matters in order for this rough beta version to evolve, step by step, into a genuinely unique and excellent game. Thank you all again for your support!\nMain Game Features:\n■ Plenty of Rogue-Like random elements\n■ Randomly generated passes, equipment and monsters\n■ Elaborately designed Boss combat, pretty exciting\n■ Inspired from the Ultimate Skill in Mortal Kombat, add violence aesthetics-reflecting special skills in the combat.\n■ Over 200 weapons, using different weapons will produce different moves and skills\n■ Over 20 armors, changing armors will also change character’s appearance, moreover, if character is being continuously struck by enemies, the armor will be destroyed","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SakuraGame","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10997,"name":"de Blob","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b53/b5369b0c2b182122a65a868aa2aaae01.jpg","description":"Don't know about art but you know what you like? Whether you are a master of the brush or a finger painting fool, just say no way to gray and join with de Blob and his pals as they launch a color revolution. A mischievous and unlikely hero, only de Blob can flip, bounce and smash his way past the all-powerful I.N.K.T. Corporation to ignite a revolution and save Chroma City from a future without color.\nBattle against massive tank battalions, speedy I.N.K.T. racers and elite Inky soldiers on your quest to free the citizens of Chroma City. Avoid hot plates, electric shocks and inky turrets to create your own path to the impenetrable I.N.K.T. Fortress. Just remember that the struggle to reclaim Chroma City is to be fought on your terms. Remix the city in your own image using custom paints, patterns and soundtracks. Super-size your blob to attack larger and stronger enemies. Join the Color Revolutionaries to refine your skills while making a mess. The race to rescue Chroma City has just begun, and only de Blob can save the world from a black-and-white future.\nde Blob is a 3D platformer where players maneuver their hero, de Blob. Equal parts amorphous blob of paint, struggling artist, revolutionary and juvenile delinquent, de Blob's goal is to replace the drab, lifeless gray coloring that the I.N.K.T. Corporation has imposed on Chroma City and its inhabitants, the Raydians, with a range of vibrant life-giving colors, all the while avoiding and battling the gray-clad forces of the Inkies.\nPlayers must acquire paint and hurl de Blob at the buildings, walls, statues, roads and skies above Chroma City. As de Blob bounces around, adding color wherever he lands, his supply of paint is depleted and he begins to dry out. As this happens players must collect more paint and rehydrate in pools and in front of hydrants scattered across the city. As the game starts access is limited to the colors red, blue and yellow, but these can be blended to create a number of other colors. Being able to create and apply these colors becomes important as Chroma City and its inhabitants come to life, and de Blob makes contact with a range of other characters known as the 'Color Revolutionaries' and receives an increasing amount of missions that charge him with splattering color all over town. Success at these mission gains the player point which drives the game forward, eventually leading to a direct assault on Comrade Black's I.N.K.T. fortress guarded by elite Inky soldiers and massive ink turrets.Key Featuresde Blob: Flip, bounce and smash your way past the all-powerful I.N.K.T. Corporation to launch a revolution and save Chroma City from a future without color\nLong Live Color! Join the Color Revolutionaries in the resistance against Comrade Black and his diabolical array of hot plates, electric shocks, and ink turrets\nFree The Citizens: Free your friends from a black and white world by painting the city back to life as you dodge ink cannons, flatten I.N.K.T. tanks and outsmart Inky soldiers\nMultiplayer: Compete to control Chroma City in 4-player split screen in eight different multiplayer modes\nSave your City: Paint Chroma City's towering skyscrapers, expansive bridges and massive landmarks in your own style using custom colors, patterns and soundtracks Plenty of Play Modesde Blob features both a deep story-driven singleplayer mode where players get to dig into the Raydian's struggle against all-powerful I.N.K.T. Corporation, as well as a diverse range of multiplayer options. These multiplayer campaigns support up to four players, come with street and sewer maps and include four player split-screen functionality.\nJust a few of the multiplayer campaigns include:\nPaint Match - Paint as many buildings as possible and steal points from opponents by re-painting the buildings that they've already covered.\nBlob on the Run - A variation of 'Capture the Flag,' in this mode only one blob can paint and is pursued by opponents who attempt to slam him into submission and gain the ability to paint and accumulate points themselves.\nBlob Race - In this mode buildings can only be painted once and are indicated by in-game arrow. With time limited it's a race not only to paint the town but also to keep opponents from doing the same.Steam Edition Features:Improved texture and lightmap resolution\nUpscaled videos\nAdded FXAA Anti Aliasing\nAdded Resolution and graphic quality option\nKeyboard & mouse and Gamepad (360/ps4) support and UI adaptation, also added remap feature\nUnofficial Wiimote support","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9552,"name":"rFactor 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ed/8ed75fa39f5bdd232c05cf495b828e2b.jpg","description":"Summary\nrFactor 2 is a realistic, easily extendable racing simulation from Studio 397. It offers the latest in vehicle and race customization, great graphics, outstanding multiplayer and the height of racing realism. rFactor 2 features mixed class road racing with ultra realistic dynamics, an immersive sound environment and stunning graphics.\nYou can race against a field of AI cars, or in multi-player mode against others. The simulation supports a full day-night cycle as well as dynamically varying weather conditions such as rain. Tracks feature \"real-road\" technology that changes the grip as more cars drive on it. You can run full 24 hour endurance events and in multi-player mode, driver swaps are also supported. Everything can be customized by the community, including adding new tracks and cars, and a wealth of add-ons are available on-line.\nrFactor 2 is also an evolving product, which will be updated and added to for many years, so the list of features will expand!Features\nPhysics\nUpdated to use multi-core CPU technology\nAdvanced physics engine\nNewly updated tyre model\nDriving surface construction, even painted line thickness, affects grip levels\nEngine boost and Turbo modeling\nComplex aerodynamics\nHead physics, cockpit vibrations, detailed bump modeling\nDynamic Racing Experience\nReal-time day/night lighting transitions\nRealistic wet/dry weather transitions\nDynamically laid rubber increases grip throughout racing session(s)\nRubber chunks (“marbles”) roll off tyres and can affect grip\nTyres sustain damage from poor driving (such as \"flatspotting\" a tyre) or setups, affecting grip immediately and over time\nDynamically drying racing line after rain\nEnvironments filled with animated events like planes, flag marshalls and more…\nGraphics/Sound\nReal-time day/night lighting transitions\nProjected headlights for night time driving\nLook to apex and head motion tracking support\nDX9 advanced graphics engine\nReal-time day/night transitions\nAdjust player and opponent volume ratio\nSee the apex with the Look Ahead slider\nAdjust your seat and mirror while in the driver’s seat\nUpdating real-time scoring towers\nExpanded and enhanced gauge and LCD features for vehicle cockpits\nImproved loading times\nUpdated sound engine\nChanging engine sounds based on upgraded vehicle performance\nGameplay\nNew AI who will race for and defend positions\nDefine AI opponent types, strength and aggression\nRaces can be lap based, time based or both\nVehicle upgrade system that affects both the appearance and performance of a vehicle\nCamera/Replays\n“Resume from Replay” allows you to resume a race from a saved replay\nFull screen monitor and ability to rewind\nFreely move camera from any position including the ever famous exclusive Swingman\nSpectator mode\nMultiplayer\nOpponent car skins automatically transmitted\nCompletely new multiplayer engine\nDedicated server\nNative voting system\nAdd AI to multiplayer games\nBoot and ban player lists that can be passed around\nSecurity checks to combat potential cheating\nOpen Architecture\nSupport for modder created car and track content\nFully adjustable Showroom, UI and HUD layouts\nMore Plugin Interfaces\nEasy to use customizable multi-language support\nRules to simulate different types of racing\nCompletely customize your controller\nDrop in new vehicle liveries\nCars and Tracks\nSteam Workshop support for installing cars and tracks\nFor a current list of cars and tracks shipped with the simulation visit this link to the workshop: http://steamcommunity.com/id/ImageSpaceIncorporated/myworkshopfiles/?appid=365960","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Studio 397","platforms":[{"id":0,"name":"PC"}]},{"id":7089,"name":"MacGuffin's Curse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7c/f7cde69edb65c9af61ffc5057125c115.jpeg","description":"Just UpdatedNew update includes:5 unlockable art pages\n2 pieces of furniture\n1 music track\n1 tileset\n13 rooms\n2 inventory items\n5 quests\nnew developer commentary (per new room)\nlots of new dialogue\n1 achievement\nAbout the GameHelp Lucas MacGuffin (magician turned thief turned werewolf) sneak and smash his way through this fiendishly addictive comedy-puzzle-adventure for PC and Mac.  Winner of the Freeplay Award for Best Game Writing!  With hilarious dialogue, charming hand-drawn art and huge replay value, it's perfect for seasoned adventurers and casual gamers alike.\nWhen fugitive magician Lucas MacGuffin bungles a museum robbery, he finds himself:\nmagically bound to an ancient amulet;\nup against a city in full high-tech security lockdown; and\nsuddenly dealing with the worst body hair problems he's ever had.As a human, Lucas is agile and cunning. Wolf Lucas would rather smash anything in his way.  Only by transforming between the two forms and cleverly utilising both sets of skills will he stand any chance of lifting his curse.\nAnd with the city's most powerful billionaire after his blood, a jaded Private Investigator on his (now-literal) tail and the rent long overdue, he'll need every ounce of ingenuity he manage.\nAlong the way he'll need to befriend a hilarious cast of characters, convince the city its most beloved citizen is a terrifying criminal mastermind, and hardest of all, teach his daughter it isn't funny to fill the fridge with dog food.\nFrom the award-winning indie developers behind Jolly Rover (Australian Game of the Year, 2010 Freeplay Awards), MacGuffin's Curse is a story brimming with humour, personality and heart.Key Features:Friendly for all players - Enjoy a quick, fun logic puzzle fix, or lose yourself in a sprawling full-length cartoon adventure.\n150+ Puzzle Rooms - Inspired by classic top-down console adventures, these increasingly mind-bending challenges will push your logical thinking skills to the limit!\nChallenge Without Frustration - Stuck on a room?  P.I. Strump is on the line to help you along (at least between thinly veiled insults) with a seamlessly integrated hint system.\n90+ Sidequests - Meet the colourful nightlife of Feyre - a carnival city under curfew - and earn their trust with bizarre, legally questionable favours!\nCharming Hand-Drawn Art - Collect 50 lavishly-illustrated comic panels to piece together - each expanding on the scandalous secret backstories of key characters!\nRazor-Sharp Dialogue - With witty banter straight the golden age of point-and-click adventure games, you'll want to chat to every stranger and examine every park bench!\nInsanely Catchy Soundtrack - From spooky strings to acoustic gypsy power-rock, this fun, upbeat score is destined to have you humming along!\nExtensive Replay Value - Post-game challenges, hidden easter eggs, unlockable comics and developers' commentary will keep you coming back long after the credits roll.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Brawsome","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3417,"name":"Toby: The Secret Mine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a98/a9827e4dbac2c85181f4e2aecf5eb84a.jpg","description":"Toby: The Secret Mine\nA challenging puzzle platformer inspired by games like Limbo and Badland.\nA peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of it’s residents. A couple of brave hearts tried to rescue their friends but none of them has returned. Little Toby didn’t want to just sit and wait so he decided to find them by himself. He went to the near deep forest but he soon realized this is just a beginning of a big adventure.\nGo with Toby on an eerie adventure in a dark and creepy world full of dangerous situations, enemies and challenging puzzles.Features:Various beautifully handcrafted environments and great visual effects\nLots Of Different Puzzles\nMany dangerous and challenging traps and enemies\nController support\nMany hours of fun\nGet lost in the shadows and pray you find your way out.\n...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":581066,"name":"NGU INDUSTRIES","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10f/10fc01b16b8858e04ec37656edf29630.jpg","description":"From the crayon-eaters that brought you NGU IDLE, we present: NGU INDUSTRIES!\nNGU INDUSTRIES is a brand-new Idle Clicker and Factory Manager game featuring:\nHundreds of unique, hand drawn materials to manufacture! Mine some Cardboard Ore, construct a glucose-based explosives, or build a Buttbot complete with twin machine guns!\nPlace Buildings, Beacons, Labs, Army units and more in a wide variety of layouts to try to optimize and min-max your Factory! Math nerds love this stuff.\nEncounter or Fight a wide variety of characters to expand your control of the NGUniverse! Mow down Fleshy Demons, meet the infamous Brian, destroy an entire armada of futuristic spaceships, make friends with a Cool Camel, or stomp on sentient candy corn!\nPlay around with a unfolding set of Features and resources that unlock as you progress! Complete Work Orders for customers to receive BDSM (oh my)! Use labs to research stupid topics to earn mysterious Elementium! Plant and breed crops that give you... stats! somehow!\nProgress Bars! They fill and then give you stuff and it feels nice.\nA great mix of active and Idle gameplay for everyone to enjoy!\nA Gripping, hilarious, and sometimes sexy story that unfolds as you progress!\nEven more awful-er puns.\nA page dedicated to showing off all your progress and giving you shiny medals and trophies for making Numbers Go Up.\nWay better Graphics than the last game! Featuring revolutionary new COLOURS and SHADING technology.\nA Badly Drawn Kitty!\nPremium currency you can PASSIVELY OBTAIN at a reasonable pace, without paying a cent. Only toss some money my way if you want to support me, not because you need to in order to progress.\nAbsolutely no rats this time. Nope. No rats whatsoever. c:","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"4G","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":536886,"name":"The Binding of Isaac: Repentance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f76/f76b46caccc642a46fa7e9ef7406b38b.jpg","description":"Experience the modern classic, The Binding of Isaac, like you've never seen it before. It's a game too big to be called a sequel: Repentance takes Isaac to new heights of roguelike dungeon adventure, as the brave boy descends into the basement for his greatest challenge yet! Isaac's new quest takes him to unknown places he's never been, filled with horrible new enemies and bosses, weapon combos you've never synergized before and items he's never seen... unholy terrors from his wildest dreams and worst nightmares!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nicalis","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":484950,"name":"Hello Neighbor 2 Alpha 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f0/5f00e2338ab8fa6c48d05d4a2bb9dc60.jpg","description":"Hello Neighbor 2 is out!https://store.steampowered.com/app/1321680/\nAbout the GameAlpha 1 is BACK!\nHello Neighbor 2 is a Stealth Horror Game where you’re being stalked by a mysterious creature as you try to track down Mr. Peterson (The Neighbor) who has disappeared after the events of the first game. Play against an advanced, self-learning AI that tracks and adapts to your every move.\nSelf-learning AI\nAI explores the environment and constantly seeks ways to ambush the player\nAI watches player navigation patterns and if these seem to be effective, will replicate them\nAI has a daily routine that gets disrupted by the player: sleeping, eating, cooking, and possibly going into the woods to dig up bags of non-bodies\nAI will use the same objects as the player, using them for the same purposes. If the player uses a fire extinguisher to get up top, so will the AI.\nOpen world\nExplore the Raven Brooks, there are no limitations and players can go anywhere from the beginning of the game. The AI protects its house when the player is trying to break in, and stalks the player when out in the open world.\nPlayers have their own stories. Narrative is emergent, depending on how players decide to play the game.\nThe world changes depending on your actions\nSandbox experience\nPlayers should find creative solutions to solve the puzzle by combining different items, terrain features and platforming skills\nMany in-game events are persistent and scheduled in random order, that gives a feeling of a living world. Players may examine each random in-game event to find a different outcome","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"tinyBuild","platforms":[{"id":0,"name":"PC"}]},{"id":368992,"name":"Young Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/70a/70a009eae06ac608b9d8274125e68bb4.jpg","description":"Jenn and Tristan are two teenagers who find themselves suddenly abandoned and without a family until a good-hearted scientist adopts and brings them into his home settled within a small port town. Life in Portsbourgh for Jenn and Tristan proves uneventful. Uneventful, that is, until they uncover a portal to another world which threatens the very existence of life on Earth as we know it.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"1P2P","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":362937,"name":"Minute of Islands","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b0/9b0da0b537e067ac71ed569d4e9982e0.jpg","description":"Talk to us!\nTwitter | Facebook | Discord | Youtube\nAbout the GameYou are Mo, a skilled tinkerer in an unstable world. It is a mysterious land, formed not only by humans but also by inscrutable giants. Giant-kind all but vanished since, leaving behind otherworldly tech deeply entwined with the islands themselves and in desperate need of maintenance. Now, an almost forgotten threat must be kept at bay. Mo is on a quest to become a hero, but is this truly what she needs?\nFeaturesWield your wand-like Omni Switch throughout story-based environmental puzzle & platform gameplay.\nUnravel an emotional poetic story.\nExplore a fantastic colorful world across multiple unique islands, meet curious characters & uncover the archipelago’s secrets.\nEnjoy hand-drawn comic visuals and a deeply atmospheric soundtrack.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Studio Fizbin","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":262384,"name":"Tekken 5","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff8/ff8bdb62481960550013c57025d47812.jpg","description":"Tekken 5 (鉄拳5) is a fighting game developed and published by Namco in 2004 for the arcades and in 2005 for the PlayStation 2. It is the fifth canonical installment, and sixth main installment, in the Tekken series, marking the tenth anniversary of the series. The game was upgraded to Tekken 5.1, which had mostly balance changes to the gameplay, and later an update Tekken 5: Dark Resurrection which was released for arcades in 2005 and later ported to the PlayStation Portable as Tekken: Dark Resurrection and on the PlayStation 3.\n\nThe game removes several major gameplay changes introduced in Tekken 4, such as uneven stage terrain, in favor of a faster gameplay akin to the older games in the series. It is also the first game in the series to feature the ability to customize characters with accessories, clothing, and other aesthetic items purchased with in-game currency. There are up to 32 characters to choose from, including seven new fighters. The home version includes a mode known as Devil Within, a variant of Tekken Force introduced in Tekken 3. Unlike Tekken 5.1 which merely tried to balance the game, the update Dark Resurrection adds a host of new content, especially in its home version for the PSP.\n\nTekken 5 was a critical and commercial success, selling over six million copies. A sequel, Tekken 6, was released in 2007.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"NAMCO","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":28978,"name":"Undertow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f26/f264d7e29abb1a72ec37d3e541342dc2.jpg","description":"Single Player, Xbox LIVE Multiplayer 2-16, Local Multiplayer 1-2, System Link 2-16, 5.1 Surround Sound, HD (High Definition). Buy the full version of Undertow and join up to 16 players in underwater battles for the survival of humanity! Non-stop action ensues through four multiplayer modes and robust 15-level single-player and co-op campaigns, featuring stunning graphics and special effects. Hours of explosive gaming action await you in Undertow's immersive underwater environments with depth charges, missiles, and vehicles. There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"ChAIR Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28374,"name":"Dance Central 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/305/3053a8559184d4902184aa702f4e1f32.jpg","description":"Music Downloads Not Rated by the ESRB  The Games on Demand version supports  English, French, Italian, German, Spanish, Dutch, Polish, Potuguese, Russian, Japanese, Korean, Chinese.  Get ready for the sequel to the best-selling dance game for Kinect™ for Xbox 360®! Featuring another killer soundtrack, new simultaneous multiplayer and all-new dance crews, Dance Central™ 2 is sure to get your party started!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":21718,"name":"Raptor: Call of The Shadows - 2015 Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/395/3953b9bcd4559245d98700a9bc68cb00.jpg","description":"Raptor: Call of The Shadows is a 2D vertical shoot ’em up originally released on MS-DOS in 1994.\nFight as a mercenary in a futuristic world and try your best to defeat the MegaCorps competitors. Use your super-tech Raptor, considered as the future’s most awesome warplane, and face hordes of relentless enemies on ground, air and sea through a total of 27 missions!\nOver missions you will earn credits, you will discover bonus or secrets, which will allow you to buy new weapons, shields and bombs to improve your ship.\nKey points:\n•\tGrowing difficulty\n•\tUpgradeable ship\n•\tA considerable arsenal of weapons and explosives!\n•\tA pulse-pouding soundtrack\n•\tAchievements to unlock (exclusive to the 2015 version)\nRaptor is the most action-crazed, guns blazing, shoot ‘em up game you’ve ever played!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"}]},{"id":20699,"name":"Comedy Quest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a66/a66a9d9108d22bd9da830e48996b6fbd.jpg","description":"Comedy Quest is a point and click adventure game set in the magical world of standup comedy. It meshes the retro look of 80's Sierra games with the feel of Lucas arts adventure games.\nThe game begins with you as a young hopeful open mic'er. Trying to be the worlds greatest comedian. Armed with no money and a note book for writing new ideas down. Your adventure will take you to some pretty amazing places.\nFeaturing the voices of: Fabian Lapham, Jarrod Fitch, Ted Wilson, Doug Gordon, Angus Hodge, Demi Lardner, Mog Thistlethwaite, Ged Cogley, James Masters, Bert Goldsmith, Lauren Bok, Neil Sinclair, Nellie White, Craig McLeod and Trav Nash.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Trav Nash","platforms":[{"id":0,"name":"PC"}]},{"id":20488,"name":"3089 -- Futuristic Action RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf6/cf64d5fd329f590870b76795f5cf01ef.jpg","description":"3089 is a futuristic, procedurally generated, open-world action role-playing game. All terrain, enemies, weapons, items, quests & more are uniquely generated.\nPlease follow Phr00t's Software for giveaways, updates & more! https://www.facebook.com/phr00ts.software\nYou are a promising robotic android design, made by the Overlord, placed on planet Xax. Your performance in common combat, support & intel scenarios is being closely evaluated. However, will you become too much for them to handle? What else on planet Xax exists that the Overlord doesn’t know about?Java Requirement3089 requires Java 7 Update 45 (or later) to run.\nOn Windows, if you have issues, you may need to uninstall other versions.\nYou can get Java here: http://www.java.com/getjavaFeatures of 3089Limitless terrain is smoothly generated in all directions\nUnique quests made from individually generated task lists\nWeapon construction & customization based on individual parts\n2-player co-op multiplayer; join up with your buddy to make a super-robot!\nInteresting storyline with multiple endings\nCool abilities like gravity guns, time stopping, cloaking, short-range teleporting & more\nUnique building features that allows blocks to be placed of any size or rotation\nFriendly & aggressive robots that range from small to very large\nVaried combat scenarios mixing stealth, melee and projectile weapons\nExceptional draw distance with low computer requirements\nDynamic lighting & smooth day / night transitions\nSmooth weather system including dangerous lightning & realistic rain\nDynamic shadows being cast by the sun\nIntegrated physics engine\nCompatible with Windows, MacOSX & LinuxGame Serieshttp://store.steampowered.com/app/329770\nhttp://store.steampowered.com/app/259620/3089 on Twitter3089's Servers Twitter: https://twitter.com/3089game\nDeveloper's Twitter: https://twitter.com/phr00t_","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phr00t's Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17979,"name":"Lili: Child of Geos - Complete Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/905/9053e2fcb608b8dd4ad0edbdc870c307.jpg","description":"Lili is a quirky adventure RPG hybrid with stunning visuals, silky-smooth graphics, a cinematic story-line, and a fresh new way to deal with enemies.\n\nOn the mysterious island of Geos, Lili will meet a number of hilarious locals, explore beautiful environments, solve some puzzles, and even challenge an oppressive regime or two along her way.\nIf you've enjoyed Zelda, Broken Age, or Psychonauts come on an adventure with Lili! And if you have never played any of those games, come with us on a journey which will make your sides ache with laughter, where you will get to know and love Lili, and maybe even shed a tear or two.Feature Highlights\nOpen and flexible gameplay - Lili: Child of Geos sports a huge number of quests and adventures for the player to experience.  The player is free to mix and match how they progress through the game by either fighting spirits or completing quests, or anything in between.\nLili as it was meant to be - Lili started its life as a game for iPhones and iPads.  We've since taken that game as a starting point and run with it.\nImprovements include:\n-Vastly improved and updated visuals across the whole game\n-Completely redone UI\n-More than doubled the number of interactive NPCs in the world\n-4x the number of quests\n-Full Controller support\n-A long list of bug fixes and tweaks\nCheck out the Comparison Guide: http://steamcommunity.com/sharedfiles/filedetails/?id=260470840\nCollectible Hats - Hidden throughout the game are a multitude of fun and exciting hats to collect and wear.  Can you find them all?\n45 unique NPCs - Every area of Geos has unique NPCs to interact with and talk to!  And believe us, they all have A LOT of problems for Lili to help solve.\nVisually Stunning World - Lili takes place on the beautiful and whimsical island of Geos.  It takes full advantage of the ample power available in the modern gaming PC.  We lovingly call it the tour de force for UnrealEngine 3.\nSteam Achievements - 47 achievements to acquire!\nSteam Leaderboards - Every single Spirit in the game has its own leaderboard.  Can you beat your friends' scores?\nChoices Abound - Most of us have over 40 hours of playing Lili on Steam.  That is 40 hours of just doing play throughs to test the game.  And after those 40 hours, we still love playing.  Our daily play through is one of the best parts of our day!About BitMonster\nBitMonster is comprised of five senior developers, previously with Epic Games, who headed out to explore the world of indie game development.\nWe have spent the last 5ish months completely redoing our first game, morphing it into a phenomenal PC gaming experience.  We can't wait for you all to experience Lili: Child of Geos!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BitMonster","platforms":[{"id":0,"name":"PC"}]},{"id":17074,"name":"The Political Machine 2016","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f7/7f7159db791f6423da090c1359cd672d.jpg","description":"Let the campaign begin!\nYour goal: Win the hearts and minds of America’s voters to achieve victory in the 2016 presidential election. Play as one of more than a dozen candidates such as Bernie Sanders, Donald Trump, Hillary Clinton, and more!\nThink you can do better than the other candidates? Create your own candidate from scratch and show the rest of those windbags how to make a real run for the White House. Take to the campaign trail and try to out talk, outsmart, and out spend your opponents!\nThe Political Machine 2016 features updated relevant political topics from across the 2016 presidential campaign. Dozens of national issues including the Keystone XL Pipeline, human trafficking, and the Iran Nuclear Deal have been added, with more updates on the way as the season continues. Regional issues require the candidate to walk a fine line between appealing to the widest range of voters or appearing to “flip flop.”\nGaining favor from your voters by interviewing on talk shows might grant you some sympathy, but not everything can be swept under the rug forever. You must always be on the lookout for career-ending scandals like a torrid affair, natural disaster, or an unsavory email trail. They can pop up at any time and change the course of the campaign -- which can put you down in the polls!\nDo you think you have what it takes? Take to the campaign trail and show the nation why you should be the next President of the United States of America!Core Features Time for some Mudslinging! - Use your power and money to purchase ads to discredit your opponent and influence voters.\nDozens of Candidates - Play as one of several pre-made past and present candidates like Donald Trump, Hillary Clinton, Sarah Palin, Barack Obama, and more.\nTurn Friends into ‘Frenemies’ - Challenge a friend for the presidency in multiplayer mode.\nCreate a Candidate - Not a fan of the candidates? Create your own custom front runner and race for the White House.\nOut-talk, Out-smart, and Out-spend your opponents - Gain favor with the public by interviewing on talk shows, navigate disastrous random events, and buy advertisements to gain an advantage over your adversary.\nPractice your Politics - A sophisticated underlying simulation model uses census data and real issues to test your political savvy.\nBe Ready for Anything - Torrid affairs, natural disasters, email scandals, and other random events can come out of nowhere and change the direction of the campaign for better or worse.\nCheck your Standings - With poll tracking and leaderboards, you can see how well people are playing as their candidates or what issues they are supporting over time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16621,"name":"Nyctophilia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d8/3d8621886769b53e679c0428f0b63d37.jpg","description":"NYCTOPHILIA\nNyctophilia is an 2D psychological thriller.\nIt's not about monsters. It's not about maniacs or magic. It's about bad things in your head.\nYou arrive to the house in the hope to forget something. Over time this place will become a scary place. House tells its own dark story. Here past and present blend into each other, and you already can not understand difference between reality and illusion. Only questions and no answers.\nNyctophilia - it is an experience concentrated on narrative that tells you story that might surprise you. Also this game has unusual gameplay based on exploring the house and solving simple but interesting puzzles.FEATURES Weird and crazy dark story\nPuzzles about different realities\nWatch your condition. Don't forget about food and hygiene\nHouse tells its own story\nTwo endings. Each of them tells you one side of story\nMusic:\nGouldenberg https://gouldenberg.bandcamp.com\nNyctophiliac https://soundcloud.com/nycthropian\nNyctophilia from Latvia http://nyctophilia3.bandcamp.com\nEnglish Proofreading\nAshley Howard http://steamcommunity.com/id/seigagenesis","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"CAT IN JAR GAMES","platforms":[{"id":0,"name":"PC"}]},{"id":15740,"name":"Crazy Machines 1.5","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07f/07fd45f50e4f2e9ffa4844471f0bd66f.jpg","description":"Create Your Own Zany \"Rube Goldberg\" Devices! Go crazy with over 200 brand new gizmo-twistin' levels! Enjoy all-new elements, music, backgrounds and more. Start off in the Inventor's Training Camp to sharpen your skills.\nGet ready for explosive action and building fun using 100 awesome & wacky parts  including bottle rockets, cannons, bombs, and robots.\nThe Ultimate Brain-Teazing Puzzle Game! Continuing the fun, but not including puzzles from Crazy Machines: The Wacky Contraptions Game.\nKey Features:\t\t\t\t\tAll-new levels!\nBrand new elements\nFun for the whole family\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Fakt Software","platforms":[{"id":0,"name":"PC"}]}]