[{"id":11706,"name":"STRAFE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82d/82d3a3e1260817e2e7a4e2b67fc64812.jpg","description":"SURGEON GENERAL’S WARNING: The Surgeon General was brutally murdered by STRAFE®.\nSTRAFE® is a roguelike first-person shooter pushing the limits of computer-generated photorealism and hardcore sci-fi action into unimaginable territory.\nWith virtually no load times and infinite replayability, just choose your gun and be instantly blown away by:\nPERMANENT DAMAGE AND GIBS! ÜBER-GORE® technology means enemies explode with near never-ending fountains of blood, which never fades away. Create wicked works of death art that mark your explored territory from the unventured.\nENDLESS CHANGING LEVELS! Randomly-generated levels are always different and violently unpredictable. Rooms, enemies, power ups, monster closets, and secrets move around every time you die and die and die and die!\nFACE MELTING SPEED! The blazing fast action will hit you like the blast wave of a 50 megaton thermonuclear warhead, liquefying your skin cells and rupturing your internal organs. Yet still leave you coming back for more.\nAs a Scrapper on a impossibly dangerous mission at the edge of the galaxy, you only have one life to navigate all the nightmarish terrains of STRAFE®. When you die, nothing will ever be the same again.\nSTRAFE® ALSO INCLUDES:\nFour unique zones (three levels each) that demand different death-defying gameplay styles\nGun upgrades that turn your average tool of death into an outright Holocaust machine\n30+ insane weapons and 20+ blood-thirsty enemies\nWild _______*\nThe sickest soundtrack of 1996 and at least the next 25 years\nUnsigned 32 bit colors!\nLifelike digital gravity\nColored lighting!\nSTRAFE®!\n*Secrets","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":3165,"name":"Pumped BMX +","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/122/122d8e0a9267040c74d9a29a3a4d0555.jpg","description":"Pumped BMX+ is a fast-paced arcade BMX game full of tricks, stunts and combos which originates from one of the most well-known BMX franchises in the world. Master over 500 challenges in this breathtaking sports game.\nOriginally developed by one-man studio Yeah Us!, Pumped BMX + is all about tricks, speed and skill. Players ride their way through increasingly challenging levels while pulling off crazy and impressive trick combinations. The game lets players choose their rider style and throw down their best stunts whilst racing through more than 500 challenges to reach the top of the leaderboards.\n- Beautifully rendered and varied environments: Bike through four distinct environments, ridin the simplest dirt tracks right up to lengthy and complex tracks filled with half-pipes, loops and death-defying leaps.\n- A new enhanced and intelligent control system: Play via the keyboard or with a controller, with easy to learn controls and an 'instant reset' button for those trickier stages.\n- A fully licensed electronic soundtrack from some of the best upcoming artists and bands.\n- Authentic BMX tricks which can be combined for almost unlimited creativity: Play with 8 basic and 8 advanced real-world tricks, and chaining them together to create a nearly unlimited amount of combos!\n- Customisable Bikes and Riders","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Curve Digital","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":367044,"name":"Pesterquest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09c/09c91a8e9b718909e8c2fbf3cff1e597.jpg","description":"Who are you again? And what the hell are you doing here? Wait… is this Earth, and who exactly is that kid over there? He looks nice!\nEmbark on a quest of epic importance in Pesterquest, a grimsical episodic visual novel set in the darkly funny Homestuck/Hiveswap universe created by American author and artist Andrew Hussie.\nFind all the answers you're looking for across 14 volumes of idiosyncratic adventure packed with visual mastery and shrewdly written narrative. As you zap between Earth and Alternia, you’ll discover and reconnect with up to 20 friends both extra and terrestrial.\nWith 14 volumes in total, you'll reconnect with familiar friends in a series of short visual novels as a new volume is released every 2 weeks. The first 2 volumes will release together at launch.\nTimelines collide in the next chapter of the Friendsim story! Pesterquest is the latest visual novel in the Homestuck universe; discover all-new stories about Homestuck’s classic cast of characters.\nContinue the friend-finding escapades of MSPA Reader from Hiveswap Friendsim, meeting and developing a relationship with a new character in each volume.\nDive deeper into Homestuck lore in this rich visual novel with a darkly comedic tone and an unapologetically irreverent story.\n14 volumes will unfold with regular releases—make EVERY friend in one affordable bundle!\nReturning artists, writers and musicians from Hiveswap Friendsim have collaborated with new talent to bring you these zapping adventures.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"What Pumpkin Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19287,"name":"Heroes of Might & Magic V: Hammers of Fate","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ef/3efc65fee643fbf5a1c0748009501a67.jpg","description":"Take part in a thrilling new adventure in the world of Ashan with the Hammers of Fate expansion. Discover uncharted territories and experience new ways of playing Heroes of Might & Magic V.\nIntroducing a brand-new Dwarves faction, made up of heroic warriors and rune magic adepts who stalk the deepest mountains and most hostile regions of the North.\nFeaturing 15 new missions, new heroes, and improved cut-scenes.\nIncludes new spells and abilities, 5 new single-player maps, 10 new multiplayer maps, new buildings, new artifacts, and new neutral creatures.\nThanks to new features such as Caravans and a random map generator, you will enjoy an even smoother experience and unlimited replayability. In addition, the simultaneous turn feature will speed up your online games.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":13008,"name":"She Remembered Caterpillars","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c0/1c09ccd81f8f6f5a105c9f466955a2fd.jpg","description":"She Remembered Caterpillars is a color-matching puzzle game with an unsettling fungipunk aesthetic. Set in a phantasgamorphic world of writhing caterpillars, brightly-colored Gammies, and living architecture, the game will have players eavesdropping on what appears to be one scientist’s quest to save her father.\nAs the chapters progress, more of this strange universe will reveal itself: what manner of cataclysm occurred here? Who are the players involved? And what exactly are the Gammies doing in these dreamscapes?\nWinner of Intel Level Up Game Demo’s Best Puzzle Game Award, She Remembered Caterpillars will test your capacity for problem-solving, dropping you into puzzles of escalating difficulty, each building on the lessons of the last.\nFeaturesGorgeous artwork from Symmetrain (IGF 2014 Student Showcase Award) creator Daniel Leander Goffin.\n40 levels of brain-bending puzzles, with each new act presenting a fresh mechanic or a different color.\nA haunting soundtrack by Thomas Höhl, composer for Galaxy On Fire and the well-known Deponia (1–3) franchise.\nShe Remembered Caterpillars can easily be played by the color-blind, thanks to its unique usage of shapes and symbols","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"jumpsuit entertainment UG","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5640,"name":"Resistance 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/76c/76c2e0c8186879e159fcd1ac72f12aa5.jpg","description":"Resistance 2 is a sci-fi first-person shooter developed by Insomniac Games. It is the second part of the Resistance trilogy.\n\n###Plot\nThe game takes place right after the ending of Resistance: Fall of Man. Nathan Hale wanders somewhere in a snowy forest after the destruction of an alien tower in London. Suddenly, a black ops squad finds him. They put their guns up on the protagonist and demand that Hale goes with them. At first, Nathan wants to blow himself and all the soldiers up with a grenade, but changes his mind and complies. His fight against the alien Chimeras continues.\n\n###Gameplay\nResistance 2 is mainly a singleplayer game. Many weapons from Fall of Man were reused, with several new additions such as the Marksman and a minigun. The game is based in the 1960s, so the weapons resemble a mix between the common weaponry of the time and advanced alien tech. Unlike the first game, the players can only carry two weapons at all times. \n\nResistance 2 goes away from the health bar system in favor of regenerative health. That means that now the players have to stick to cover when their health is low to regenerate it.\n\n###Multiplayer\nA multiplayer mode is also present in the game. However, there is no cooperative play in the singleplayer campaign. \n\nThere are two multiplayer variations: a separate co-op campaign and a competitive one. The game was praised for having up to 60 players in one competitive session and up to 8 in a cooperative mode.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":322240,"name":"Crown Trick","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d94/d9406db56b580415379a33d3a16c66e0.jpg","description":"Crown Trick is a rogue-like RPG adventure characterized by turn-based combat and skill-item interactive strategy.\n-------------------------------------------------------------------------------\nFrom dark mages to zombies, from plants to beasts, the unique hand-drawn style dungeon is filled up with a great diversity of evils. Swords, bows, guns and staves......choose your own way to fight off whatever is in front of you.\nWater, fire, ice, wind, poison and oil make up the world’s elements and they mutually affect one another and bring various new ways to damage your enemies. Discover more skills within the crown as you explore deeper and darker.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"NEXT Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":16225,"name":"Spacebase DF-9","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/885/88583a6eaa558372165862f6f0ce97b8.jpg","description":"In Spacebase DF-9, you'll build a home among the stars for a motley population of humans and aliens as they go about their daily lives. Mine asteroids, discover derelicts, and deal with the tribulations of galactic resettlement in Earth's distant future. Meteor impacts! Explosive decompression! Unbearable loneliness!Key Features:Base Construction\nBuild your base using available matter and expand by mining more from nearby asteroids.\nGradually expand from a small oxygen-filled room to a thriving, well-decorated hub.\nBuild Gardens, Pubs, Fitness and Research facilities, and more.Citizen Management\nAssign citizens to duties to ensure survival-critical duties are performed efficiently.\nMonitor citizen needs to ensure overall morale, balancing duty demands with citizen happiness.Base Defense\nSend security forces to investigate mysterious derelicts that appear near the base.\nFend off hostile invaders as well as parasites that\nConstruct turrets to lend firepower to hostileResearch and Progression\nResearch new equipment, armor, weapons, and base structures.\nDiscover blueprints for new technologies aboard derelict ships.\nResearch cures for deadly space diseases.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3467,"name":"Guilty Gear Xrd -SIGN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef7/ef7aff4685592b1784995bc251d4e47d.jpg","description":"Kept you waitin'.\nGUILTY GEAR Xrd -SIGN- is finally here on Steam!ABOUT THE GAMERevolutionary graphics, Overwhelming battle system!\nCarrying on the legacy from 1998, comes the newest addition to the \"Guilty Gear\" series! All visuals, especially the characters, have been redrawn in full 3D, tweaked to the finest detail and hand-polished by the animation masters to produce the top quality hand-drawn anime effect!\nThe game's battle system has also been revamped, with a central emphasis on it's core system, \"Roman Cancel\"! Devise your own game plan with this new system, and craft your own battle strategy!Clash of 17 characters, new and old!Starting from Sol and Ky, a total of 12 characters from previous Guilty Gear series take to the battle, along with 5 totally new characters having their first appearance in GUILTY GEAR Xrd -SIGN-! With Bedman, Sin, Ramlethal, Elphelt and Leo joining the fray, the fight gets more intense!\n*Sin, Elphelt and Leo can be unlocked using in-game currency, or they can be easily acquired by purchasing their respective DLCs.Unique Game ModesLearn the ropes of fighting games through the comical episode of Sin and Sol in \"TUTORIAL Mode\", and try to challenge yourself to complete all the missions in other training modes!\nIllustrations and BGMs can be unlocked in the \"GALLERY Mode\", and players can customize their favorite characters for use in \"M.O.M. mode\" with different moves from other characters, such as having Ky shoot Gunflame!\nThe new \"STORY Mode\" takes a unique approach of combining standard Adventure games with TV animation, blended together to unfold the lore of the Guilty Gear.NETWORK MODEPlace your personal ranking score on the stake and battle with other players in \"Rank Match\", or simply enjoy the new \"Player Match\" mode without any frets!\nCommunicate with worldwide players in the new Player Match room and take to the seat for a battle! In addition, you can set an entry to the Rank Match queue, and while waiting to be matched up you can access other offline game modes such as \"ARCADE\" and \"TRAINING\".\nYou can also spectate other players' matches by entering their Player Match rooms, and take to a spectator seat!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Arc System Works","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":57842,"name":"Tekken 3","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4aa/4aa1440932f4a12d9d0ea70a5e2164f6.jpg","description":"Tekken 3 (Japanese: 鉄拳3) is a fighting game, the third installment in the Tekken series. It was released in arcades in March 1997, and for the PlayStation in 1998. The original arcade version of the game was released in 2005 for the PlayStation 2 as part of Tekken 5's Arcade History mode.\nTekken 3 was the first game released on Namco System 12 hardware (the original two Tekken games used System 11). The game features a largely new cast of characters, including the debut of several now-staple characters such as Jin Kazama, Ling Xiaoyu, Julia Chang and Hwoarang, with a total of twenty-three characters. The home version included a new beat'em up mode called Tekken Force, as well as the bonus Tekken Ball mode.\nTekken 3 is considered one of the greatest games of all time. With more than 8.5 million copies sold worldwide, Tekken 3 is the second best selling fighting game of all time and the fourth best-selling PlayStation game. A non-canonical sequel was released in 1999 and 2000 in arcades and on the PlayStation 2 respectively, titled Tekken Tag Tournament. It was followed by the canonical sequel Tekken 4 in arcades and on the PlayStation 2 in 2001 and 2002, respectively.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"NAMCO","platforms":[{"id":0,"name":"PlayStation"}]},{"id":481920,"name":"EA Play Hub","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Don’t just get the game. Get more from your game with a full year of EA Play. Members get more rewards, more exclusive content, and unlimited access to more top titles.\n*  Get more from the games you love with members only challenges and in-game rewards. Take your favorite titles to the next level with members content that lets you stand out from the competition.\n*  Get instant access to a collection of EA’s best loved games on PlayStation 4. Plus try select new-release games – not betas or demos – and your progress carries over if you decide to buy.\n*  Members receive a 10% discount on EA digital purchases on PlayStation 4 including full games, Season Passes, DLC, and more.\nReady to play the best of EA?\nWhen you join EA Play, you must accept EA's User Agreement (terms.ea.com) and the EA Play Terms (https://tos.ea.com/legalapp/eaplay/US/en/PC/) and Privacy and Cookie Policy (privacy.ea.com).\nCONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE https://tos.ea.com/legalapp/eaplay/US/en/PC/ FOR DETAILS.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Desconocido","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":21631,"name":"Stellar 2D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/928/92838a3545e2fe8104440ba2a637994e.jpg","description":"Features:\n★Three player ships to choose from.\n★Fifteen enemy ships, with diverse attack modes.\n★Five bosses, with varying difficulty.\n★Gain experience by destroying enemies and level up.\n★Multiple pick-ups to collect. Ship power ups, health and traps to use against your enemies!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"quad games","platforms":[{"id":0,"name":"PC"}]},{"id":871264,"name":"Dave the Diver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ee/1eec43616e3ff00a674124d746926b23.jpg","description":"Welcome to 'DAVE THE DIVER', a marine adventure set in the mysterious Blue Hole. Explore the sea with Dave by day, and run a sushi restaurant at night. Uncover the secrets of the Blue Hole, and unwrap this deep sea mystery involving 3 friends, each with distinct personalities. New adventures await.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"MINTROCKET","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":39035,"name":"Killzone 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9d8/9d88739254a63a59352f3c27a9c5d694.jpg","description":"Killzone 2 is an FPS developed by Guerilla Games and the second part of the main trilogy with two additional titles being released for the handhelds: PSP and PS Vita and one unnumbered sequel — Shadowfall. The game features typical FPS attributes: covers, vehicles and much shooting. \nAs the player proceeds through the trilogy's storyline, they encounter a decades-long conflict between the Helghast and Vekta. Let alone two planets, both Helghan and Vekta are dwelled by humans after the Earth became uninhabitable. Killzone 2 explores a superplanet conflict through the eyes of Vekatn officer named Tomas \"Sev\" Sevchenko who is eager to find out the reasons conflict have burned up. \nOne of the main attraction of a gameplay part is multiplayer — the first installment has not starred it. Online game reminisces the main story: the players play a role of either ISA or Helghast commander trying to defeat the opposing team. There are a total of 14 maps (8 being distributed on disc and 6 via DLC), 15 weapons and 7 classes in total.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":28460,"name":"Forza Motorsport 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/609/6093bea01151a43078264e33e91bbf83.jpg","description":"Forza Motorsport 4 is the fourth game in its series that allows the player to race a variety of 500 cars.\r\n\r\n###Modes\r\nThe main career mode is called World Tour Mode. It allows the player to race a series of challenges to receive a better car as a reward. 26 locations include famous real-world tracks, such as Hockenheimring and Indianapolis. There's also a multiplayer mode that supports up to 16 players\r\n\r\n###Changes from previous games\r\nThere are several differences between Forza Motorsport 4 and its predecessors. One of the most notable is the automatically adjusted difficulty. The game keeps track of the user's score and abilities and alters the AI and speed of the rival drivers accordingly. Another new feature is that the player can choose the prize car he or she receives.\r\n\r\nThere's also a new option called Autovista. In this mode, the player can explore a car in details, both inside and outside of it, including the parts not usually seen. Autovista provides the user with information about certain parts of the car through the voice messages. There are 24 cars that the player can observe in this mode.\r\n\r\n###Controls\r\nBeing an Xbox 360-only game, Forza Motorsport 4 allows the player to use Kinect as part of the controls. When included, Kinect can control either the vehicle or the player's vision. In the former mode, the game uses automatic acceleration and deceleration, while the player steers an imaginary wheel. In the latter mode, Kinect tracks the player's head movements to let the user look left, right, or back.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Turn 10 Studios","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":60864,"name":"Rapture Rejects","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb1/fb14702a69242a4ad9bfddc4fdcc1e27.jpg","description":"THE RAPTURE HAS HAPPENED. YOU DIDN'T MAKE THE CUT.\nRapture Rejects is a top down isometric last man standing game set in the apocalyptic Cyanide & Happiness universe.\nWhen God leaves the worst of us to fight for ourselves, all that’s left to do is to kill each other.\nScavenge for weapons and kill every other person on Earth, to impress the almighty enough to let you into Heaven.\nRapture Rejects is a dark comedy Battle Royale game based on the Cyanide & Happiness web comics.\n50 players drop into a world that only one can survive in. Scavenge for resources and fight off enemies until there is only one person left. That person gets to go to heaven.\nCreated by Galvanic and tinybuild in close cooperation with Cyanide & Happiness, Rapture Rejects takes the Battle Royale genre into a brand new direction with a topdown isometric perspective. This allows for much more accessible gameplay and fancy character customization that's very easy to distinguish.\nAdd all the Cyanide & Happiness humor into the mix, and you've got a game nobody should really be playing.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Galvanic Games","platforms":[{"id":0,"name":"PC"}]},{"id":51584,"name":"Total War: THREE KINGDOMS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4c/b4cd6c7a2712b88eec149536882d6c3b.jpg","description":"The year is 190CE. China is in turmoil.\nThe Han Dynasty crumbles before the child-emperor. He is but a figurehead; a mere puppet for the tyrant warlord Dong Zhuo. It is a brutal and oppressive regime, and as Dong Zhuo’s power grows, the empire slips further into the cauldron of anarchy.\nBut hope yet blossoms.\nThree heroes, sworn to brotherhood in the face of tyranny, rally support for the trials ahead. Scenting opportunity, warlords from China’s great families follow suit, forming a fragile coalition in a bid to challenge Dong Zhuo’s remorseless rule. Will they triumph against the tyrant, or will personal ambition shatter their already crumbling alliance and drive them to supremacy?\nThe crucible fizzes. Allegiances shift. The fires of conflict stoke opportunity. Only one thing is certain: the very future of China will be shaped by its champions.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Feral Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":44469,"name":"Just Cause 3: Multiplayer Mod","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba8/ba8fc30d38ad2d60f5e73d82ca3e9b5f.jpg","description":"Just Cause 3 Multiplayer mod is a free fan-created project bringing an explosive and highly-customizable multiplayer to the critically acclaimed action sandbox game. Get ready for countless hours of hilarious brawls, stunts and races with hundreds of other players!\nFor a more detailed list of the current options and instructions on how to install and play the mod, please see our FAQ on the Steam discussion board here:\nhttp://steamcommunity.com/app/619910/discussions/0/1457328927827817919/\n\nWe at Nanos are an enthusiastic team of coders from Germany, Austria and the UK who have worked towards releasing Just Cause 3 Multiplayer for more than a year. Our goal is to bring multiplayer to the next level by allowing the players themselves to build upon our work!\nKEY FEATURES:\nBattle, race, chase and play tag with fighter jets with up to hundreds of players per server.\nEnjoy community created gamemodes, ensuring a constantly evolving play set.\nCountless hours of fun including racing, deathmatch, skydiving, freeroam, etc.\nDon’t see the game mode you want? Make one!\nState-of-the-art synchronisation helps reduce lag to a minimum.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"nanos GbR","platforms":[{"id":0,"name":"PC"}]},{"id":42393,"name":"The Last of Us: Left Behind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e0d/e0da9a0e997d062fbfce98a4a59fc86e.jpg","description":"The Last of Us: Left Behind is a single-player DLC of The Last of Us. It was released February 14, 2014 for $14.99 on the PlayStation Network and acts as a prequel to The Last of Us.[1] It was later re-released as a standalone title on May 12, 2015, priced at $9.99, for both the PlayStation 3 and PlayStation 4.[2] Left Behind tells the story of Ellie and Riley, portrayed by Ashley Johnson and Yaani King respectively. For the entirety of the DLC, the player controls Ellie.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":26316,"name":"Pokémon HeartGold, SoulSilver","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9b/a9b87910722fd2ce7d14d8f9a7fa4d5a.jpg","description":"Pokémon HeartGold and SoulSilver Versions are available for the Nintendo DS and Nintendo DSi systems today!\n\nIt's been nearly a decade since Pokémon fans first traveled to the scenic Johto region. With Pokémon HeartGold and SoulSilver Versions, they can return there to experience the exciting adventure of Pokémon Gold and Pokémon Silver on the Nintendo DS and Nintendo DSi systems. Check out updated graphics and sound, as well as awesome new touch-screen features and lots of surprises! Pokémon HeartGold and SoulSilver Versions bring dozens of Pokémon characters, such as starters Chikorita, Cyndaquil, and Totodile, back into the limelight for a new group of Pokémon fans—and long-time Trainers—to catch, train and battle!\n\nMore to Touch!\n\nPlenty of enhancements have been to the gameplay, including all-new touch-screen controls! You can navigate your Pokédex, check out the inventory in your Bag, and even move Pokémon around inside your PC Boxes. If you’re a Trainer who would rather use the buttons, don’t worry—both methods will be available, so you can play in whatever way suits you best!\n\nThe Pokéwalker!\n\nPokémon HeartGold and SoulSilver Versions come with the brand-new Pokéwalker, an accesory that brings a dimension to Pokémon games that you’ve never seen before. The Pokéwalker is a special pedometer that you carry with you that lets you take Pokémon fun wherever you go! You can transfer a Pokémon onto the Pokéwalker accessory using an infrared connection between the Pokéwalker and your Game Card. Then as you Stroll around with your Pokémon, it’ll earn Experience Points. And you can even find items and new Pokémon while you’re on the go! The Pokéwalker is small enough that you can keep it in your pocket and take wherever you go. It also has a clip to hook it on your belt, and a hole for attaching a strap. It’s never been easier to take Pokémon with you!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":15553,"name":"ADOM (Ancient Domains Of Mystery)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f2/5f220ba5dc7124acd0ff2ddb2c88883c.jpg","description":"ABOUT ADOM\nADOM (Ancient Domains Of Mystery) is one of the most successful roguelike games ever created, boasting a brilliant mix of story, RPG, exploration, and intensely strategic and flexible combat. The Steam version adds various Deluxe features like achievements, difficulty level customization and various play modes (e.g. a story mode allowing to save and restore games, a weekly challenge game, an exploration mode and more). ADOM has been in development since 1994. In 2012 its development was revitalized with an immensely successful crowdfunding campaign on Indiegogo, now allowing us to offer ADOM both with ASCII and graphical modes enabling you to choose freely.\nADOM is primarily known for being the first roguelike to include vibrant towns, NPC dialog, and quests, but it offers more than just a rich story line in a complex fantasy world:\na huge game world with hundreds of locations such as towns, randomized dungeons, elemental temples, graveyards, ancient ruins, towers and other secrets\nloads of races (dwarves, drakelings, mist elves, hurthlings, orcs, trolls, ratlings and many others) and even more classes (fighters, elementalists, assassins, chaos knights, duelists and much more) allowing for infinite play styles\nhundreds of monsters and items, many with enhanced random features\na corruption system forcing you to balance lust for power with fear of damnation (corruptions slowly transform you into a vile monster but at the same time grant inhuman benefits - most of the time)\nspells, prayers, mindcraft, alchemy, crafting and more\ndozens of quests and branching story lines\nnumerous wildly different endings that might alter reality itself (simply drive Chaos away or slay a god or even become an immortal yourself, and others more)!\nvarious game modes (story mode to be able to load and save games, challenge mode to face peculiar weekly challenges, exploration mode for a free wand of wishing and more)\nvarious customization options (turning hunger off, turning corruption off, modifying monster difficulty or treasure rates)ABOUT THE ANCIENT DOMAINS OF MYSTERY\nDeep in the mountainous ranges of the Drakalor Chain, Chaos has broken through into Ancardia and it's up to you to decide the fate of the entire realm. You control a single character with a wildy varying set of skills, talents, spells and other abilities. Customized equipment makes each race/class combination a very different experience. Explore a mostly randomized underworld, fight monsters, loot treasures and uncover the many secrets lurking in the world of Ancardia.\nJoin a generation of gamers in playing a remastered version of this classic rogue-like!\nWith an overhaul of the graphics, music, new playable races and classes, over 400 monsters, tens of thousands of items, crafting, magic, religion, corruption, randomized dungeons and so much more, this reimagined version is one of the most in-depth roguelikes on the planet.\nSo, come join us as we return to Ancardia and choose your fate.ABOUT ADOM ON STEAM\nADOM on Steam will take ADOM gameplay to the next level by introducing the following features (among others) in the next couple of months:\n70+ achievements,\ngame customization features (e.g. turning corruption off, increasing treasure rates adjusting monster lethality),\nghost creation and exchange between players - be haunted by dead player characters and try to win their treasures,\nstory mode - save and reload your games,\nexploration mode - use a wand of wishes to discover completely new sides of the game,\nchallenge mode - try to score highest under complex conditions in weekly challenge games,\nshared and global highscores (TBD),\npoint-based character generation (TBD),\nstar sign selection (TBD),\ncloud based save files and so much more (TBD).THE FUTURE OF ADOM\nIs ADOM a complete game? Yes, a very complete game. A multitude of endings, varied approaches to game play, thousands of starting combinations and an extensive storyline filled with endless details makes for an extremely satisfying experience that justly positions ADOM as one of the big five foundational roguelike games.\nIs ADOM a finished game? No. As long as there is interest in the game we will continue to evolve and enhance it. In this respect ADOM differs from many other games on Steam in the best tradition of roguelike classics: We will continue to add both UI enhancements and new content to the core game in order to make it the most complete RPG ever. Buy once, play forever!","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Zeno Rogue","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":25965,"name":"Ghostbusters: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4d/b4d2004ef9afea5c14317fe94bcc8996.jpg","description":"Ghostbusters: The Video Game is a third-person action-adventure game based on the Ghostbusters franchise. The game features voice acting from the principal cast members from the original movie. \n\n###Plot \nThe game’s plot is partially based on the script of the unreleased Ghostbusters III movie. The game follows Rookie, a new member of the Ghostbusters team. A large psychokinetic energy wave hits New York which results in releasing many ghosts in the city and providing main heroes with many calls to capture them. During their ghost hunts, Ghostbusters team reveals the plan for merging real word with ghost world and that Ivo Shandor, the architect of 55 Central Park West building is behind it. \n\n###Gameplay \nThroughout the game, the player participates in several ghost hunting missions. They consist of exploring the environments, solving puzzles and fighting ghosts. The combat part of the game shares some similarities with other third-person shooter games. You have several different weapons at your disposal mostly centered on your Proton Pack. However, the player does not only need to shoot ghosts to weaken them, but also have to entrap them using Capture Stream.  \n\n###Game versions  \nAside from PlayStation 3, Xbox 360 and Windows, the game was also released for PlayStation 2, PSP, Nintendo DS, and Wii systems. The later four versions are often referred as “Stylized Version,” as opposed to the original “Realistic versions” and feature some changes in controls, visuals and, especially for DS port, in gameplay.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Terminal Reality","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":16431,"name":"Robin Hood: The Legend of Sherwood","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c5a/c5abca57a329fb408d6822e1809da3c3.jpg","description":"England, Anno Domini 1190 – Richard the Lionheart is held prisoner and his brother, Prince John rules over the simple peasants with an iron hand and this pure force of arms forces them to bend to authority. Only one man takes up the struggle against the oppressors, supported by a small band of brave and loyal followers. His name; Robin Hood.\n\nRoam the dense foliage of Sherwood, come face to face with royal trouble and battle against Prince John’s forces as you take on the role of legendary nobleman, Robin Hood. Team up with Little John and the rest of the Merry Men as the battle for the King’s throne ensues in this stealth-based, real-time strategy game.\nKey features:\t\t\t\t\t\tNon-linear campaign system with over 30 different missions\nMission types from Robbery and Infiltration to Castle Attack and Ambush\nCombines action and adventure with stealth tactical elements\nInnovative combat system, interact with the mouse while fighting to access special combat skills\nPlay as Robin Hood, Little John, Friar Tuck or even Maid Marian, nine characters in all, each with specific abilities and attributes\nSpectacular graphics with realistic atmospheric conditions like day, night and fog\nExplore historic locations; Sherwood Forest, Nottingham Castle, York and many more\n","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Spellbound Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11098,"name":"Dead Age","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbfb0f0a6b393d1ec3d32fddfe5a5952.jpeg","description":"Survive the zombie apocalypse with turn-based combat and permanent death! Manage survivors, go on dangerous scavenging runs, build alliances, craft equipment, make difficult story-influencing decisions, defend your camp against undead hordes and experience non-linear rogue-lite elements. An innovative Indie Survival-RPG!\nJust after the zombie outbreak you were fortunate enough to join a group of survivors and hole up in their camp.\nBut that doesn't set you out of danger! Food supplies are running low, injured survivors must be tended  to and materials need to be scavenged to keep the camp intact.\nThe zombie threat increases steadily and gangs of hostile survivors keep you on the defensive.\nEvery survivor should be protected because you'll need all hands on deck to defend against the dangers of the apocalypse.\nScavenge supplies in zombie-infested areas, craft survival gear and buy and sell equipment to keep yourself and your camp members alive long enough to learn the skills necessary for long-term survival.\nThe combat system has its roots in classic role-playing games. You can fight strategically, learn to utilize various weapon types and use a range of bombs or traps.\nShould you fail to survive the apocalypse, you can purchase upgrades with medals earned in previous playthroughs to give your new character an edge to start with.\nUnlocked pre-apocalypse professions of your character allow you to specialize in various jobs.\nEach new playthrough offers different random missions and survivors to meet.\nA praised feature of Dead Age is its non-linear story with real in-game consequences. Decisions you make in conflict situations affect the story's future.\nYou can choose to be a hero and save more survivors, or let them die to stock up on supplies. You can build romance relationships with other survivors or start rivalries that may have disastrous chain reactions.\nDaily events offer new dangers and situations in which you must make choices that affect the survival chances of your camp.\nLive long enough, and you'll have a chance to unlock one of the game's six possible endings.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":274761,"name":"Scavengers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f48cb1479b65cb33262b19e557b22d6.jpg","description":"Scavengers is your strategic survival battleground. Enter a free-to-play action shooter where squads of three compete to survive and dominate in a hybrid of sandbox-style PVE and class-based PVP. Choose from a roster of adaptive Explorers, arm yourself with a combination of unique abilities and weapons, and conquer the challenges of a hostile wasteland. Outthink and outfight enemy players and the dwellers of the frozen Earth.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Midwinter Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20850,"name":"Blackwell Unbound","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/886/886cdc03930d853910fb6ed9f8f754fb.jpg","description":"The year is 1973. The sound of a lone, ethereal saxophone drifts over the Roosevelt Island promenade, while a series of accidents plague a midtown construction site. The citizens of Manhattan take no notice of these events, let alone think they are connected.\nEmbittered medium Lauren Blackwell and her spirit guide Joey Mallone are the only ones who believe that there is anything strange going on, and they are the only ones who can stop an enigmatic killer from striking again...","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3917,"name":"KickBeat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15c/15c99314ac9e31f3b10f7366ee9d532d.jpg","description":"KickBeat is a martial-arts inspired rhythm game developed by Zen Studios. The game draws massive inspiration from the Dance Dance Revolution series and Gitaroo Man. \n\n###Plot\nAll the music in the world got stolen. Only the player can recover the music by using the last 18 tracks that were saved by humanity.\n\n###Gameplay\nJust like in Dance Dance Revolution, the gameplay of KickBeat relies on the player pushing one out for four prompted buttons at the right time. Enemies come at the player from four directions, and by pressing the buttons, the player character attacks them in the right direction. All the action corresponds with the beat of a current playing song. By pressing the correct buttons, the players create a unique fight scene.\n\nDespite having its own soundtrack, the players can import their own music into the game, just like in Audiosurf. There are 11 artists with 24 songs featured in the Special Edition of the game, with Celldweller, Pendulum, and Styles of Beyond featured in it.\n\nThe game is also inspired by the classic Hong Kong Kung Fu flicks, with all the character animations being hand-drawn to ensure the best quality possible. To focus the player's attention on the on-screen action, the developers got rid of action prompts and replaced them with well-made 3D characters.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zen Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":44735,"name":"Halcyon 6: Lightspeed Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f35/f356f6b5806d6de5b975207972a78408.jpg","description":"LIGHTSPEED EDITIONHalcyon 6: Lightspeed Edition brings together the original Halcyon 6 base game along with all of the additional content (Combat & Customization, Diplomatic Diversions, Loot’em Up, and Morale Booster updates) released since launch in Sept 2016 as well as brand new Lightspeed Edition optimizations and features as follows:\nStreamlined Campaign Greatly speeds up progression and tightens the campaign to an action and adventure packed 12 hrs depending on your play style and pace\nStreamlined All Systems For faster progression, including economy, starbase, resources, and officer levelling.\nNew Officer Progression System With 6 subclasses, 3 Prestige classes, new skill tree, and over 20+ new Prestige/Epic powers.\nNew Ship Loadout and Config Screen Will let you customize loadouts (and save them) for your ships just before entering combat\nNew Difficulty Mode  Called Vice Admiral and slightly increased difficulty across the board\nEnhanced Combat  Includes 25+ new alien faction space combat abilities, more combos for both players and enemies, increased faction weaknesses and resistances, and other balancing tweaks\nNew UI Overhaul Designed for greater readability and usability. Many many UI quality of life enhancements to all areas of the game, too many to list here.Halcyon 6On the edge of Terran space lies Halcyon 6, a derelict starbase left behind by a mysterious precursor race. Your mission is to reclaim the derelict station and rebuild it.\nA mysterious alien force is making a beeline towards Earth and this starbase is the best chance for the New Terran Federation to establish new alliances, research new technologies and otherwise figure out a way to stop the impending invasion.\nUsing only the resources you can salvage from the derelict station and gathered from nearby star systems, it’s up to you to rebuild the starbase to lead the Terran Republic’s scientific research, exploration and diplomatic efforts on the edge of known space.\nHalcyon 6: Lightspeed Edition is a passion project whose design is inspired by our years spent playing classic games like Star Control, Master of Orion, X-COM, Civilization and new classics like FTL.Features:Base Building: spend resources to build station facilities (rooms) to enhance your production and technological capabilities, or build ships to help you control more territory\nExploration: assign your fleets to nearby star clusters, where they can handle emerging enemy threats, do missions for alien factions or secure bonus resources\nCrew Management: assign crew to station facilities to greatly improve their output efficiency, or to ships where they can contribute in unique ways to combat, missions and events\nDeep Tactical Combat: fight tactical ship or ground battles to resolve hostile events, create a foothold in the sector and ultimately defeat the enemy mothership!\nStory Events: based on game criteria like rooms-built, alien diplomacy scores or officer traits/skills, the game will produce story events (often with multiple choice outcomes) that can lead to combat, time-related applied bonuses/negatives, officer attribute changes or any number of crazy in-game stories.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Massive Damage","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":10824,"name":"The Book of Unwritten Tales","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/334/33466043c943029b8f13e6c83e87a09c.jpg","description":"In a world torn by war, the aged gremlin archaeologist Mortimer MacGuffin harbors the dark secret of a powerful artifact. Whoever calls this artifact his own, will determine the fate of the world.\nWhile the Army of the Shadows sends out its best and most devious agents to discover the secret, the Alliance's four heroes find themselves involuntarily drawn into the crisis...Key features:Humorous Point & Click homage to the RPG and fantasy genre.\nAbout 20 hours of gameplay in a massive game world with detailed graphics.\nMulti-character gameplay: Play as Wilbur, Nate, Ivo, and the Critter - in turn or simultaneously - and use the skills of your heroes wisely.\nMeet numerous crazy characters - from two-headed ogres and vegetarian dragons to good-natured zombies.\nSolve over 150 mind-boggling puzzles and discover more than 300 items that can be used and combined.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"KING Art","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10174,"name":"Pirates, Vikings, and Knights II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb3/fb3d19e8da6a4fc13515c344c0e8c6ce.jpg","description":"Pirates, Vikings, and Knights II boasts a unique three-team symmetry and a myriad of colorful characters to promote exciting, strategic, and fun gameplay. It features several game modes, each requiring its own special brand of cunning to master. Do battle on a tropical island for control of bountiful treasure. Appease your gods by spilling the blood of your enemies deep within a Mayan temple. Conquer your foes by taking control of precious badlands territory. But most importantly, have FUN!Features & Accolades\nThree teams with 9 unique player classes\nFun, skill-based combat\nSwords, axes, guns, and explosives\nUnique voice acting for every character\nA variety of gorgeous levels\nWhimsical and challenging achievements\nCommand-able attack parrots\n100% FREE!\nPiratesSkirmisher: A light-footed scallywag who can blow enemies away with his gunpowder-packed keg.\nCaptain: Brandishes a peg-leg, hook, and an attack parrot, which will seek out enemies and peck them to death!\nSharpshooter: A Spanish sweet-talker who snipes his enemies from a safe distance, or cuts them to pieces with his butter knife.VikingsBerserker: A shirtless and battle-crazed warrior capable of mowing enemies down with his dual-wielded weapons and giant axe.\nHuscarl: Throwing axes, a two-handed battle axe, and sword/shield combo allow this warrior to take on the toughest enemies.\nGestir: A well-seasoned master of the spear and javelins who has no problem skewering his enemies either up close or from a distance.KnightsHeavy Knights: Wearing a full suit of armor, this battle tank can cut his foes in half with his great sword.\nArcher: There is no match for a skilled archer with a quiver full of arrows. He sometimes reigns fire down upon his enemies.\nMan-at-Arms: A Frenchman with a sense of humor. He brandishes a halberd, mace & buckler, and his fart special will leave enemies dazed and confused.Game ModesBootyBooty is a unique version of Capture the Flag. Players fight each other for treasure chests filled with gold and jewels. Bring chests back to your base and hold onto them to win the game.TerritoryTerritory is a king of the hill style game mode, where teams fight for territories throughout the map. Hold onto the territories for as long as you can to win the game.Trinket WarsTrinket Wars is the caffeinated version of Team Deathmatch. Teams must gain control of their trinkets, and then use the power of their trinket to destroy their enemies.Last Team StandingLast Team Standing is exactly what the name suggests - all three teams square off, fighting to the death. The last team alive wins the round.Objective PushThis game mode can range from a simple break-in and destroy your opponents' bases, to a more advanced sequence of map-specific objectives. The only limit is the mapper's imagination!Team DeathmatchTeam Deathmatch is a fight for dominance. Teams square off against one another to see who can rack up the most kills. Like the other game modes, you should stick together to achieve victory!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Octoshark Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":28505,"name":"The Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/600/600e767c60988351728d012d32f5c117.jpg","description":"The Darkness is a first-person action/horror shooter with a twist: You are the horror! You will step into the shoes of Jackie Estacado, a mafia hit-man who becomes the latest bearer of the Darkness, a powerful demonic entity, on his 21st birthday. Having his fill with life as a thug and struggling to control the Darkness you must use your newfound powers to put an end to your “Uncle” Paulie Franchetti, the don of the family, and get out of the mob. Featuring an assortment of both earthly and otherworldly guns as well as powers that allow you to conjure demons and manifest the Darkness into a variety of lethal elements, The Darkness will take the FPS genre to the next generation.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Starbreeze Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":415171,"name":"Valorant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b11/b11127b9ee3c3701bd15b9af3286d20e.jpg","description":"VALORANT is your global competitive stage. It’s a 5v5 tac-shooter matchup to plant or defuse the Spike in a one-life-per-round, first to 13 series. More than guns and bullets, you’ll choose an Agent armed with adaptive, swift, and lethal abilities that create opportunities to let your gunplay shine.\r\n\r\nCreativity is your greatest weapon.\r\n\r\n## The Agents\r\n\r\nAgents and their signature abilities are how you win with skill and style. Adapt and outplay in the role of either a Duelist, Initiator, Controller, or Sentinel.\r\n\r\n## The Maps\r\n\r\nHaven. Bind. Split. Ascent. Each a stage for a multitude of savvy plays, agent clutches, and team strategies.\r\nUnique with their own strategic environment","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Riot Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":13289,"name":"Construct 2","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bef/bef5fbb7d48149d9a3c7692c7e7c5c6a.jpg","description":"You can be a game developer!  Construct 2 redefines game making and allows everyone to make their own games - no programming required.\nConstruct 2's intuitive editor makes it straightforward to bring your ideas to life.  Share and publish your games on the web and a wide range of devices.\nJoin the Game Making Revolution!#MadeWithConstruct2Games on Steam built with Construct 2:\nThe Next Penelope http://store.steampowered.com/app/332250/\nAirscape: The Fall of Gravity http://store.steampowered.com/app/317260\nCosmochoria http://store.steampowered.com/app/293240/\nCould the next Steam game be yours?Key Features Make the games you've always dreamed of\nDesign any genre of 2D game\nNo programming required: use the drag-and-drop event system to design your game logic\nPublish your games to the web (HTML5), iOS, Android, Windows Store, PC/Mac/Linux desktop, Wii U (requires Nintendo developer registration), and more!\nGet all platforms for one price - no need to make additional purchases for each platform you want to use!\nComprehensive documentation, tutorials and examples\nIntuitive editor with a simple interface\nAdvanced visual effects with shaders\nPhysics engine\nPreview instantly over Wifi for testing on mobile\nLayers system, including parallax effects\nIntegrated debugger and profiler\nTilemap editor\nOnline multiplayer game support via WebRTC\nInstant savegames\nAutomatic pathfinding features\nAudio effects like filters, convolution, and more\nReal-time 2D shadow casting effects\nJavascript plugin SDK for extensibility\nA full-featured editor for everyone from beginners to expertsFree Edition Make your own games for free!\nNo time limit - use as long as you like!\nUse 100 events, 4 layers, 2 shader effects\nNot for commercial use\nExport HTML5 web gamesPersonal Edition For individuals & educators\nAll Free Edition limits removed\nExport to iOS, Android, and more\nPreview mobile games over Wifi\nUse the debugger 'Watch' tab, profiler, and event breakpoints\nMake online multiplayer games\nUse in-app purchases (IAP)\nOrganise project in to subfolders\nUse event search, Z order bar, and object families features\nCommercial use up to $5000 USD revenueBusiness Edition For businesses\nNo commercial use limit\nSame features as Personal edition","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Scirra","platforms":[{"id":0,"name":"PC"}]},{"id":650604,"name":"Marvel's Midnight Suns","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d47/d471344cc698b2dc660ab09880e1e884.jpg","description":"Marvel’s Midnight Suns is a new tactical RPG set in the darker side of the Marvel Universe, putting you face-to-face against demonic forces of the underworld as you team up with and live among the Midnight Suns, Earth's last line of defense.\r\n\r\nAfter centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire with hellfire and enlist the help of the Midnight Suns - Nico Minoru, Blade, Magik and Ghost Rider - young heroes with powers deeply rooted in the supernatural, formed to prevent the very prophecy Lilith aims to fulfill. Together, they resurrect an ancient warrior - the Hunter, Lilith’s forsaken child and the only hero known to have ever defeated her. In the face of fallen allies and the fate of the world at stake, it will be up to you to rise up against the darkness!\r\n\r\nFrom the legendary studio that changed strategy and tactics games forever comes a new title, offering cinematic tactical combat with a Super Hero flair, friendships to forge with iconic heroes, and an unforgettable adventure that dives deep into the darker side of Marvel.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Firaxis","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":327210,"name":"Per Aspera","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/734/7345371632d35f93aea61d4d38ba96b5.jpg","description":"What is humanity’s role in the grand scheme of the universe? What are we willing to endure to find out?\nPer Aspera is a planetary simulation experience that combines hard science fiction and base building. You control a superintelligent Artificial Consciousness with the prime directive of terraforming Mars for human colonization—a mission that is rife with challenges. Explore a map based on geographical data from NASA, harvest available resources from the surface, and utilize technology based on real-life engineering and scientific principles to create a thriving interplanetary operation.\nThough you are alone at first, you will have assistance from your crew in Houston. Forge or test relationships based on your choices—choices that will impact how your mission concludes.\nExperience the actual conditions and challenges that a terraforming process involves as you implement studies and scientific theories proposed by real space agencies and engineers. Try out various colonizing strategies, expand throughout the entire map, and live the experience of transforming humanity into a multi-planetary species!ABOUT THE STORY: In Per Aspera, you take control of an Artificial Consciousness named AMI, whose prime directive is anything but simple: terraform Mars into a lush, verdant paradise and prepare it for human colonization. But you aren’t the first to attempt this mission, and as you face the hardships before you, in time you may uncover the truth of their fate.\nHardship awaits.AWESOME FEATURES🌑 Experience how a real-life terraforming mission would be.\n🌒 Build huge structures across the entire world map. All of Mars is your playground!\n🌓 Unravel the twists and turns of mankind's first missions to Mars in a riveting single-player narrative.\n🌔 Develop your base and test your theories at your own pace in sandbox mode.\n🌕 Research new technologies and special projects based on real-to-life science.\n🌖 Explore real Martian landscapes portrayed in a unique graphical style.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tlön Industries","platforms":[{"id":0,"name":"PC"}]},{"id":50775,"name":"GTFO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/814/8140301ae3791d2cd4303d6c6f485b9a.jpg","description":"GTFO is a 4 player action/horror cooperative game for those looking for a real challenge.\r\nPlayers get to play as a team of scavengers, forced to explore and extract valuable artefacts from a vast underground complex that has been overrun by horrifying monsters. Gather weapons, tools and resources to help you survive - and work to unearth the answers about your past and how to escape.KEY FEATURES4 player cooperative PvE gameplay that puts you and your teammates through ultimate co-op test.\r\nTogether, explore treacherous and thrilling environments framed by atmospheric lighting.\r\nPlan your expedition, equip and operate tools, combine your fire power, communicate and coordinate as a team - every detail counts if you are to survive the nightmare.GTFO’s Expedition Director throw players into new challenging situations in every play session.\r\n]*]The Expedition Director controls every single parameter of the experience, derived from a hand tailored data set.\r\nCome prepared! Search the  complex for better gear to take on new, harder challenges.\r\nNightmarish atmosphere accompanied by music from acclaimed composer Simon Viklund.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"10 Chambers Collective","platforms":[{"id":0,"name":"PC"}]},{"id":4199,"name":"LittleBigPlanet Karting","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/749/7494d29011ddec57b1aa5896dd4bf266.jpg","description":"LittleBigPlanet Karting is an arcade racing game developed by United Front Games in collaboration with the creators of the original LittleBigPlanet, MediaMolecule.\n\n###Gameplay\nIn LittleBigPlanet Karting, the players compete with each other on several thematic tracks. The objective of each race is to get to the finish first. During the race, the players can pick up such weapons as thermal-guided missiles, EMPs, grenades, and so on. These weapons can be used both for offense or defense. For example, the player can shoot the rocket coming onto them with his own rocket and evade the attack. There are also boosters on the track, such as Nitro or Autopilot. The game features a grappling hook from LittleBigPlanet 2, which is used to pass obstacles during the race. It is also possible to hit a rival with it if they are close enough.\n\nUnlike most racing games, LittleBigPlanet Karting puts a heavy emphasis on the number of game modes: Battle Mode, Waypoint Races, Treasure Hunts, Score Attacks and much more modes are available to the players.\n\nLike in the other LittleBigPlanet games, the community-made content plays a vital role in the game's philosophy, which is described as “Play, create, share.” The players can customize their characters, edit the tracks or create their own maps from the ground up. It is possible to set up your own rules in the track creator. The game features asynchronous multiplayer and tracks made by the community which were included in the main map pool.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":2634,"name":"Bully","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/682/682973f711e9ea6fcf11f71cbb39cdd5.jpeg","description":"Bully® takes the Rockstar tradition of groundbreaking and original gameplay and humorous tongue-in-cheek storytelling to an entirely new setting the schoolyard.\nAs a mischievous schoolboy, you’ll stand up to the bullies, get picked on by teachers, play pranks, win or lose the girl, and ultimately learn to navigate the obstacles of the worst school around, Bullworth Academy.\nExperience Bully® for PS2™ with full 1080p up-rendering and enhanced features such as Trophies, Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with 'PS Vita' or PS App.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n1 player\n3GB minimum save size\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2003-2006 Rockstar Games, Inc. Rockstar Games, the Rockstar Games, Bully®, Take-Two Interactive and their respective logos are trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. All Rights Reserved.\nUse of this software subject to license in game manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee, internet connection, and/or online account registration (13+). Special features may not be available to all users and may on 30 days notice be terminated, modified, or offered under different terms.\nThis videogame is fictional doesn’t depict any actual event/person/entity & any similarities are coincidental. Take-Two doesn’t endorse or encourage engaging in any conduct depicted in game. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Rockstar Vancouver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":42138,"name":"Duke Nukem 3D: Megaton Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f84/f8429c1344182a420c96761c65f6a094.jpg","description":"Duke Nukem 3D: Megaton Edition brings together Duke Nukem 3D with its expansions and additional content. Included within are:\n\n-Duke Nukem 3D: Atomic Edition\n-Duke Caribbean: Life's a Beach\n-Duke it out in D.C.\n-Duke: Nuclear Winter\n\nAlong with the content comes a new game engine allowing for enhanced OpenGL.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":23613,"name":"They Are Billions","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81b/81bc858dec170dcc94379c674cdb640c.jpg","description":"They Are Billions is a strategy game in a distant future about building and managing human colonies after a zombie apocalypse destroyed almost all of human kind. Now there are only a few thousand humans left alive that must struggle to survive under the threat of the infection. Billions of infected roam around the world in massive swarms seeking the last living human colonies.Game ModesCampaign\nIn the campaign mode, you have to help the surviving humans to reconquer their country. There are dozens of missions with different goals: building colonies, tactical missions, rescue missions... You can decide the path of progress and mission - research new technologies, advances and upgrades to improve your colonies and army.\nSurvival Mode\nIn this mode, a random world is generated with its own events, weather, geography, and infected population. You must build a successful colony that must survive for 100 days against the swarms of infected. It is a fast and ultra addictive game mode. We plan to release a challenge of the week where all players must play the same random map. The best scores will be published in a leaderboard.Real Time with Pause\nThis is a real-time strategy game, but don’t get too nervous. You can pause the action to take the best strategic and tactical decisions.\nIn Pause Mode, you can place structures to build, give orders to your army, or consult all of the game’s information.\nThis game is all about strategy, not player performance or the player’s skill to memorize and quickly execute dozens of key commands. Pause the game and take all the time you need!Build your Colony\nBuild dwellings and acquire food for the colonists. They will come to live and work for the colony.\nCollect resources from the environment using various building structures. Upgrade buildings to make them more efficient.\nExpand the energy distribution of the colony by placing Tesla Towers and build mills and power plants to feed the energy to your buildings.\nBuild walls, gates, towers, and structures to watch the surroundings. Don’t let the infected take over the colony!Build an Army\nWhat kind of people would want to combat the infected?\nOnly the maddest ones. Train and contract mercenaries to protect the colony. They demand their money and food, and you will have to listen to their awful comments, but these tormented heroes will be your best weapon to destroy the infected.\nEvery unit is unique and has their own skills and personality – discover them!Thousands of Units on Screen\nYes! They are billions! The world is full of infected creatures… they roam, smell, and listen. Every one of them has their own AI. Make noise and they will come – kill some of them to access an oil deposit and hundred of them will come to investigate.\nWe have created our custom engine to handle hordes of thousands of the infected, up to 20,000 units in real time.\nDo you think your colony is safe? Wait for the swarms of thousands of infected that are roaming the world. Sometimes your colony is in their path!Prevent the Infection\nIf just one of the infected breaks into a building, all the colonies and workers inside will become infected. The infected workers will then run rabid to infect more buildings. Infections must be eradicated from the beginning, otherwise, it will grow exponentially becoming impossible to contain.Beautiful 4K Graphics!\nPrepare to enjoy these ultra high definition graphics. Our artists have created tons of art pieces: Beautiful buildings with their own animations, thousands of frames of animation to get the smoothest movements and everything with a crazy Steampunk and Victorian style!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BlitWorks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]