[{"id":19309,"name":"Plants vs. Zombies GOTY Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/096/0962642c3f74cd6306ad8bfdfd3d6150.jpg","description":"This is a casual tower defense game from the PopCap Games studio. The main characters are homeowners who, with the help of plants, protect their garden from the invasion of zombies. The game was ported to all kinds of consoles, including mobile platforms.\n\nIn Plants vs. Zombies player places on the playing field of tower-plants, which automatically bombard attacking zombies. The main goal is not to let the undead get to the house. The towers are distinguished by their effectiveness against a certain type of enemies and the attack modes. \n\nThe game has several modes: in addition to the usual singleplayer campaign, Adventure Mode is available where a player can earn currency for in-game upgrades. The battle layout also changes throughout the game: it starts on a simple backyard and advances into more complicated night levels and etc.\n\nThe game has a lot of references to the works of popular culture: for example, inscriptions on tombstones are taken from Monty Python's  \"Dead Parrot sketch\".","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"PopCap Games","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo DSi"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3748,"name":"SteamWorld Dig","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e07/e07737df8469bf32d132ba9eaffc3461.jpg","description":"SteamWorld Dig is an independent platforming action game developed by Image & Form. It is the second installment in the series.\n\nYou play as a steam-powered robot named Rusty. He moves to a town of Tubleton after inheriting his uncle's mine. He starts to mine and explore the underground world unraveling the remains of human civilization on his way.\n\nThe main objective is to investigate the mines. At the beginning of the game the player is only equipped with a pickaxe, but more and more mining equipment is unlocked as the game progresses. The equipment is also upgradable as the game goes on. The mines are procedurally generated on every playthrough and useful items appear in different places. Collected ores and resources can be sold in a shop outside the mine. There are several underground worlds to explore which feature various enemies. \n\nIf the player gets lost in the mine they can either use the ladders that are sold in the store or use the self-destruct button. All collected loot is lost on death but can be picked up again.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Image & Form","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":2913,"name":"The Banner Saga","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa3/fa3dd043cba3a9cbfe3085e75d92bf7e.jpg","description":"The game takes place in a Viking world inhabited by three races (humans, Varls, and Dredges) created by different gods. Once between people and Varls was hostility, but with the emergence of dredges, they were forced to unite forces, for not being killed by them. At the beginning of the game in the world reigns eternal winter; the gods left all races, and the sun stopped, it would seem, forever.\r\n\r\nThe story begins with Ubin, who arrived in the port city Strand for an annual tribute. Upon arrival in the town, he learns that some bandits want to capture the authority. He's moving to the Town Tall to help the Governor deal with them. Soon, a squad of Prince Vognir and Prince Ludin arrive in the Strand. In the next morning, Ubin joins the team of Vognir, and they are all going in Grofheim\r\n\r\nThe player controls a squad of soldiers under the leadership of the hero. In a single-player game, the hero has a story task, which usually requires getting to some point of the game world. On the way to the target, you can occur all sorts of events, and some of them will need the player to make decisions that affect future events.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Versus Evil","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":2845,"name":"Crypt of the NecroDancer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/70a/70a7a7b21d8fdf5f19622e5e14599bcd.jpg","description":"Crypt of the NecroDancer is an indie roguelike game developed by Brace Yourself Games.\n\nYou control Cadence, who looks for her missing father. During the search, she falls into a crypt, where the NecroDancer steals Cadence's heart. Cadence can't do anything without following the music's beat and has to find both her heart and her father.\n\nCrypt of the NecroDancer can be played with a dance pad, a gamepad or a keyboard. Having the Protagonists able to do anything only as the music beats makes the Crypt of the NecroDancer a rhythm roguelike game. Movement, attacking and using your items has to be planned in advance, as the player can't do anything between the beats. If the player misses the beat, no actual harm to the character is done, yet the scoring multiplier resets. The players set out to explore a procedurally generated underground dungeon. \n\nThe players can find new weapons, items, and equipment during the exploration of the dungeon. Your inventory is managed by the game. As in most roguelike games, your inventory is lost on death, yet any diamonds the players find still persists. On death, the players return to a game lobby, where they can buy permanent upgrades.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Brace Yourself Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":323065,"name":"Call of Duty: Modern Warfare (2019)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e43/e43f9f0a1429bd9332020ac5876bc693.jpg","description":"The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocative narrative that brings unrivaled intensity and shines a light on the changing nature of modern war. Developed by the studio that started it all, Infinity Ward delivers an epic reimagining of the iconic Modern Warfare® series from the ground up.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":29173,"name":"Dishonored: Death of the Outsider","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/742/74276457ebb9466e11d75a2be7722265.jpg","description":"Dishonored: Death of the Outsider is an expansion of Dishonored 2 and a spin-off of the main Dishonored series.\n\n###Plot\nThe game is set in the alternate universe that goes through its steampunk phase. It takes place in the fictional Empire inspired by the XIX-century England. The plot picks up where Dishonored 2 left it. The game follows the adventures of the previous games' villains: Billie Lurk, the captain of a sailing ship, and Daud, the assassin and the leader of The Whalers gang. They search for Outsider, an extradimensional creature from the world known as the Void who can give people supernatural abilities, and are going to kill him. Their story is intertwined with the larger events in the Empire, such as the reinstallment of the Empress, the faction rivalry and the Void influence on the world. The plot is non-linear and features multiple endings.\n\n###Gameplay\nThe player controls Billie Lurk from the first person view. Like its predecessors, Death of the Outsider emphasizes stealth and surprise attacks. Billie wields a dagger and eventually receives superhuman powers, such as teleportation and disguise. The expansion allows the unusually free use of these abilities. The player doesn't have to unlock them, they become available early at the game, and the energy they require regenerates automatically over time. Besides the main plot, the player can also accept side quests.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":722,"name":"World of Tanks","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c3b/c3be1d5f55cb9324c97ccb7aaaf42ad4.jpg","description":"Released by Belorussian studio Wargaming World of Tanks began as a niche multiplayer project. However, since its premiere back in 2012, the game has won the hearts of millions and has become one of the most popular e-sports disciplines.\r\n\r\nWorld of Tanks - is a massively multiplayer game that revolves around the mid-20s century war machines. The gameplay is quite simple: the player takes control of one tank and joins others to participate in six basic types of battles. Gamers can choose from military vehicles from 1930-60s, the developers regularly update the fleet of vehicles. All combat units can be customized to your taste.\r\n\r\nThe game is distributed free of charge, so be prepared to shell out real money for a brand new tank or spend a large amount of real time to receive an in-game currency. The game was ported to almost all conceivable platforms and is available on mobile devices by the name World of Tanks Blitz.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Wargaming Group","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":7485,"name":"Elite Dangerous","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b69/b69a67833630dd96d8eee9d2c8c27574.jpg","description":"One of the interesting facts about Elite Dangerous is its realistic scale representation of the Milky Way which is an open-world and the gameplay is itself open-ended. It is the first game in the series to feature MMO-kind of gameplay, where every players' action affects the plot of the games universe. This is the fourth installment in the Elite video games series and it's the sequel to Frontier: First Encounters. This is one of those successful Kickstarter campaigns which launched in 2012. The pre-released version of Elite Dangerous was available since December 2013 and after one long year it was finally released as a full game on Microsoft Windows. In 2015 it was released on OS X and Xbox One and one year later  - on PlayStation 4. The game also supports VR devices including HTC Vive and Oculus Rift.\nElite Dangerous is set in a year 3304. Its premise, as with the other games in the series, is to start as a small ship with a small amount of money and then with measures of trading, mining, bounty-hunting, piracy and assassination to go up your career. \nThere are three different factions in the game including Empire of Achenar, the Galactic Federation, and the Alliance of Independent Systems and four player status levels (combat, CQC Championship, exploration and trading).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":19284,"name":"Fallout Tactics: Brotherhood of Steel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27c/27c86ebfba2281ebe3ea8ca6c9e752f1.jpg","description":"Fallout Tactics: Brotherhood of Steel tells a story about a squad named Brotherhood of Steel which is involved in a war. The game takes place in the well-known Fallout universe yet it does not continue the story of any other Fallout games released previously. For those who pre-ordered this game, a special bonus CD was delivered. It includes bonus mission for the main game and a table top game in the Fallout universe. \nFallout Tactics is a game about tactical combat and strategy and this time players have much more limited interaction with NPC characters yet they can still trade with them. The game centers around bunkers of Brotherhood from where the player has to go to missions after preparing for them by obtaining the services of quartermasters, mechanics, personal yeomen and medics. \nIn Fallout Tactics, missions take place in towns or factories, military camps or a Vault. In missions, the player gets a map with marked objectives and notes. Fallout Tactics offers a deep combat mechanic, which features three different modes of combat: Continuous Turn-Based, Individual Turn-Based and Squad Turn-Based combat types.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Micro Forte","platforms":[{"id":0,"name":"PC"}]},{"id":50677,"name":"Superhot: Mind Control Delete","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b56/b56853f28ecdc04b44f552f7b9c8ea69.jpg","description":"MIND CONTROL DELETE is a standalone expansion set in the SUPERHOT universe. It’s designed as a rogue-like twist on the linear nature of the original SUPERHOT. In it’s well proven genre-defining format, SUPERHOT: MIND CONTROL DELETE distills and expands on the same intoxicating rhythm of slow motion combat.\nThe game will force you through dozens of increasingly difficult time-moves-only-when-you-move gameplay challenges. Each challenge will make you more powerful and bring you closer to deciphering the secrets hidden from you by the system. As you unlock powerful abilities and gain access to new playable characters, so will your enemies grow stronger, smarter and more desperate to stop you.\nCome and join the fray. Play in Early Access. Let the system learn from you.SUPERHOT rogue-like expansion early access hype! What to expect now?\nWe’re still a good 9-12 months away from a full release, so please don’t forget that this is nowhere close to a complete, satisfying experience just yet. The current build of MIND CONTROL DELETE is the first time we’re inviting you to check out a few of the brand new gameplay systems that are going to be central to the game:\nFirst 2 playable MINDS, each with it’s own unique ability and gameplay modifiers\nA kaleidoscope of the first dozen new gameplay levels that mix into the first few dozen combat challenges\nNew animation and AI systems to drive new weapons, abilities, and enemy types\nHitpoint system and power-up store to give you that extra oompf needed to crush your enemies and see them driven before you\nProcedural rogue-like run generation baked into the core gameplay loop, enabling us to tell longer, more complex stories and deliver tons more of satisfying skill-based gameplay\nBeware though - this is an extremely early, bleeding-edge version of most of those systems. The limitations for this early access build are not for the faint of heart:\nNo story whatsoever - we don’t want to spoil too much too quickly so this and the next few updates will be all about gameplay features\nNo advanced power-ups or new enemy types enabled yet - we want to establish and test the balance of vanilla gameplay in this build, waiting to sprinkle in gamebreaking modifiers and new foes to beat up until future updates\nNo replay or point system - easy bragging about your insane skills will need to wait\nAbsolutely no hidden menu minigames yet - we have so many new cool ones coming out super soon tho <3\nIf you’re not looking for an incomplete game that’s in constant flux and relies on your feedback and creativity to expand, or if you’d rather just play a finished experience that’s guaranteed to challenge and satisfy you and your deepest power fantasies, then we totally recommend you should wait until MIND CONTROL DELETE is out of early access.\nHowever, if you’re super brave and want to help guide the development in its earliest stages, then go ahead - join us, and get your name in the credits!Why are you putting MIND CONTROL DELETE in early access in the first place tho?\nWe released the original SUPERHOT in February 2016 after nearly two years of intense creative crunch. The amazing support during the development from our Kickstarter backers and the exhilarating reaction we got from you once the game released was simply mind blowing.\nWith morale at an all-time high, we immediately jumped into a flurry of prototyping and refining gameplay and story concepts that we weren’t able to fit into the original game. We tested and put a bunch of them to work in virtual reality, and after releasing SUPERHOT VR to even more outstanding support from you guys, we finally had a road map for the first non-VR expansion ironed out in December 2016. In our usual no-compromise approach to design, we made that roadmap way more ambitious than originally anticipated and we decided to make the expansion a fully standalone game, allowing us to rewrite and reimagine all of our major gameplay systems.\nThe single most important strength of the original SUPERHOT was the amazing involvement of tens of thousands of creative alpha and beta testers that helped us shape and balance the game and drove us to pursue zero compromises in design. After over a year of work on MIND CONTROL DELETE, we’re now ready to start this adventure together again. We’re inviting you to jump in and co-create the game with us. Talk to us, work with us, and let’s build the build the biggest SUPERHOT yet together.What’s the price tag on this? Is this that free DLC you were talking about?\nYup! Way bigger than the usual free DLC though, so it'll take a bit longer to release. If you own the original SUPERHOT on Steam now or buy it while MIND CONTROL DELETE is still in Early Access, you’ll get the full expansion for free once it’s finished and released.\nHowever if you can’t wait to work with us, and you feel like bravely facing rough edges and helping shape the game as it develops, then we’ll be thrilled to have you sign your name to a piece of SUPERHOT history and join us in Early Access right now.\nOnce MIND CONTROL DELETE releases in earnest, it will be priced same as the other SUPERHOT games for everyone who’s still new to the franchise.FAQ\nShould I buy MIND CONTROL DELETE if I haven’t played the original SUPERHOT?\nNot right now. The game will be a totally standalone experience in a few updates, but the lack of clear structure and story right now would be confusing for newcomers. Definitely get the original SUPERHOT though. It’s lots of fun.\nWhat’s the update roadmap?\nWe’re new to Early Access, but we’re hoping to use your feedback and collaboration to drive and guide the development. We have a bunch of large features already in the pipeline that we’ll be dropping on livestream updates every few weeks, starting with the first major content update dropping in January, and following with balance and feature updates released on a monthly / bi-monthly schedule.\nI really want X in the game, how do I make you want to do X too?\nThe discussions around the game are taking place on Steam Community, Discord and Reddit groups. Join us, make yourself heard, and rally up your fellow players. We’ll tap into your creative hivemind. We’ll put your ideas into life.\nYour mind will make the system stronger. You will be ONE OF US.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SUPERHOT Team","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":18081,"name":"No More Room in Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f34/f34c86335d0c51baa582aa93fa2d3f55.jpg","description":"No More Room in Hell is a co-op first person video game with elements of survival horror. The game is created by only one person - Matt “Max” Kazan. It was made as a modification on Valve Corporation’s Source engine. \nThe game tells a story about zombie apocalypse. The player gets a role of one of eight survivors. The game is said to be inspired by classic George Romero’s Living Dead films series as well as Dawn of the Dead, American Psycho and The Big Lebowski films. \nAt first, the game was released only as a mod for Half-Life 2 but later it was released as standalone title on October 31, 2013. No More Room in Hell was developed since 2004. It has two game modes – Objective and Survival. In Objective mode the player must accomplish given objectives and finally escape the map alive. With every new playthrough objectives on the man changes in a favor of replayability of the game. In Survival mode players have to protect certain areas from waves of zombies, each wave becoming more and more difficult. The player has to protect those areas until the helicopter arrives and takes them back to safety.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"No More Room in Hell Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3268,"name":"The Vanishing of Ethan Carter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90c/90caf1fcb836cad70013452f6f239008.jpg","description":"The Vanishing of Ethan Carter is a horror adventure game, heavily focused on the narrative. You are Paul Prospero, a detective with paranormal abilities. You get a letter from a boy named Ethan Carter, who cries out for help. You have nothing to do but go to his town and find out what happens to Ethan’s family.\nThe game is focused on puzzle solving and exploration, and set in an open world environment. The superpowers you obtain make your investigation easier: you can sense where hidden objects are and restore the circumstances of the crimes you reveal.\nAs a rule, the game shows you the path (literally and figuratively), but any derogations add details to the atmosphere of the game. So you can freely explore locations, read numerous notes and learn more about the inhabitants of the town you came to. On the other hand, you can follow the main line directly, and it won't be spoiled by the lack of details. In the end, the game becomes something between an interactive drama and a detective quest.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"The Astronauts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":22597,"name":"Darksiders III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb7/cb770f3f9871e1130f40812b05e401b2.jpg","description":"Darksiders III is the third installment in its series of dark fantasy action games. Plotwise, it is the series' spin-off rather than the sequel.\n\n###Plot\nThe game is set in the world after the literal Biblical Apocalypse that involved the Four Horsemen and a battle between angels and demons. The story of Darksiders III unfolds at the background of the events of two original games. Darksiders III follows Fury, a Horsewoman of the Apocalypse and the sister to the original protagonist, War the Horseman. She goes on a quest given to her by the Charred Council, an institution that is meant to keep the balance between Heaven, Hell, and Earth. Fury's mission is to find and annihilate the infamous Seven Deadly Sins. The mighty Lord of the Hollows agrees to help her, although he's obviously pursuing his own goals. He gives Fury the power of the flame.\n\n###Gameplay\nThe player controls Fury from the third person view in an open world. She can use a variety of weapons, including a whip, a sword, and a dagger, as well as her magical abilities. She can also shape-shift into several forms based on elements, such as the flame. Fury also has to solve puzzles and jump platforms. The game reintroduces some of the enemies from the previous parts and introduces new monsters. The enemies in Darksiders III are less numerous but stronger and tougher, taking more effort to beat them.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":18886,"name":"Overlord II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfb/bfb2bf7a0413443b1fcf0be7c3244053.jpg","description":"This sequel to the comic dark fantasy Overlord allows the player to have fun being evil. You play as the dark Overlord who leads his armies of minions against the human Glorious Empire (which obviously mimics the real-world Roman Empire). The Glorious Empire is not \"good\" anyway: its leaders are trying to eliminate all magic users, so the \"evil\" motivation is quite justified. However, to accomplish his conquest and become a truly powerful and feared dark lord, you will have to commit some really vile deeds. One of your first missions, for example, involves slaughtering baby seals.\nThe game follows the Overlord from his childhood, as he grows from a nasty kid to a mighty dark knight that looks a lot like Sauron as shown in The Fellowship of the Ring movie. The Overlord begins his conquest with a pack of goblins and a single troll, but over time his minions will develop into more powerful and deadly creatures and attack the enemy in large hordes. The game does not turn into a strategy, however, as you still only directly control the dark lord himself, and the minions are commanded through his orders.  Overlord II is famous for its humor: the game does not take itself too seriously. There are all sorts of puns and parodies on the stereotypical villains and other fantasy tropes, such as elves and fairies. Goblin minions squeak, cringe and fall, while playful Danny-Elfman-esque music is echoing in the background.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Triumph Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"}]},{"id":364806,"name":"Need for Speed Heat","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/370/3703c683968a54f09630dcf03366ea35.jpg","description":"Hustle by day and risk it all by night in Need for Speed™ Heat, a thrilling race experience that pits you against a city’s rogue police force as you battle your way into street racing’s elite.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ghost Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9904,"name":"Age of Empires II HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c07/c07e1c1e6908a2eeebd5dad0708abd01.jpg","description":"Age of Empires II HD is a strategy game, the remastered version of the original game with improved graphics and some new features including the Workshop compatibility. It's followed by three expansions: The Forgotten, The African Kingdoms and The Rise of the Rajas that add new civilizations, campaigns, and modes to the game. \nIn Age of Empires II HD, you develop the selected civilization from the Dark Ages to the modern time. You have multiple units to complete different tasks such as mining resources, explore the world and fight enemies. You can also reveal new technologies and upgrade your units. There are different ways to win: you can either fight the enemy civilization or choose a peaceful way and develop your science and culture instead of war. To develop efficiently, you need to manage resources carefully.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Hidden Path Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":3494,"name":"Thomas Was Alone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c8/6c8cb4780ce30b76b944cf656e8fff49.jpg","description":"The player controls one or, more often, several rectangles or squares of different colours and sizes. Each shape has a name, and individual character traits, including Thomas, mentioned in the title. The relationships between the characters are conveyed to the player by the voice-over.\n\n\"Thomas Was Alone\" action takes place in a specific virtual space, in which some \"Event\" has caused the procedures of artificial intelligence with individuality and the ability to act without a specific control. Each entity is shown as a coloured rectangle. Rectangles can move to the left, right, and also know how to jump. Each of the characters has their unique abilities, in particular, large jumps or the ability to swim in the water (other rectangles die, being in it). When a player can control multiple characters, he can switch between them, controlling one aspect at a time.\n\nThe player's goal is to direct the shapes to the exit points tied explicitly to each shape so that they all occupy that exit at the same time. Most often it requires particular interaction between forms for better manoeuvrability.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Curve Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":1322,"name":"Dead Rising 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e7/7e79e3296a7f64e7535c9e5bb5aa4b53.jpg","description":"Dead Rising 2 is a zombie survival game with strong beat ‘em up elements. The series is known for placing ordinary people without special military skills in the center of the story. This time you take on the role of Chuck Greene, a former motocross rider, who needs to get medication Zombirex for his infected daughter. He takes part in a deadly competition that includes killing zombies for money. But zombies break free and make Greene search for Zombirex around the city full of monsters and help other survivors.\nThe plot consists of several missions you need to complete to finish the game. There are also optional quests you can get; however, the ending depends on the main story decisions only.\nDead Rising 2, while being focused on survival, gives you wide opportunities for crafting weapons by finding and combining special items. There are also boss fights with so-called psychopaths, people who went crazy because of the outbreak.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":22069,"name":"Ultimate Epic Battle Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a2/2a2a162a08f2bba053334ecfda25228d.jpg","description":"The Game:\nHere is a sandbox like no other. Create massive battles with absolutely no limits. Want to see 10,000 chickens fight an army of Romans?? Sure, why not. Want to see a company of WW2 U.S soldiers fight 11,000 Medieval soldiers?? There are simply no limits to the carnage you can achieve in Epic Battle Simulator. Mess around with a massive variety of units. Everything from, Roman Centurions, Medieval soldiers, Knights, Orcs, Trolls, and yes, chickens! The main focus in this game is giving the player no restrictions to what he can do. That is why we decided not to limit the amount of units in battle. Want to see what a battle of 100,000 units looks like? We don't recommend going past 10,000 for most machines but its your CPU, do what you want! On top of that, you can play as any one of the units in the game, getting up close and personal to help change the tides of a massive battle, while rallying teammates and giving them orders!\nThe Technology:\nUnfortunately there really aren't many engines that you can chuck 10,000 characters in and expect good performance. This is why I worked months on end to create the most powerful crowd rendering system ever conceived in Unity engine. The detail of each character has little effect on performance while each individual acts independently, but is working towards a greater good for his team.  Each individual decides his own path and navigates complex environments. But I didn't stop there! With the large open environments, I needed a more dynamic lighting solution than the one built in to Unity engine. So I built my own dynamic global illumination lighting engine. This enables bounce light completely in real time. What does that mean? That means every piece of shiny armor is reflecting it's true surroundings, every bright surfaces illuminates it's surroundings and effects the overall lighting.\nYes I worked hard to bring this game to life, may you all inflict carnage upon it!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Brilliant Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20980,"name":"The Expendabros","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/604/6046ad65ac38adfe0553823489bb7ed4.jpg","description":"The Expendabros is a crossover game based on Broforce gameplay and featuring characters from The Expendables 3 movie. In the basis of both games lays the roast of the 90s movie cliches about unstoppable warriors, such as Arnold Schwarzenegger, Sylvester Stallone, Bruce Willis and the others. The Expendabros features parody characters from The Expendables 3, including Broney Ross, Bronnar Jensen, and the others. \nThe gameplay in The Expendabros provides a crazy mix of a platformer, a shooter and a quest with strong beat ‘em up elements. The action doesn’t stop as everything around you explodes, burns and crashes while you kill bad guys. Each of the seven playable characters has their unique weapons and special attacks.\nThe story itself consists of 10 missions with the goal to capture an arms dealer named Conrad Stonebanks. The game is set in Eastern Europe forests, so you're to fight among lumber mills and harsh landscapes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Free Lives","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2390,"name":"Plague Inc: Evolved","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e31/e315213a5cb21645df8db3e5191e530c.jpg","description":"Plague Inc: Evolved is a biological simulation/strategy game developed by Ndemic Creations.\n\nIn Plague Inc: Evolved the player controls a disease, that infects patient zero in a selected country. The player's goal is to infect and kill all the people perfecting the disease and adapting to different conditions.\n\nInitially, more and more people get infected within a country, the disease goes through the borders, carried by animals, birds, insects, transits through blood or on public transport. Random and controlled infections are present in the game. Laboratory accidents could be categorized as random infections while spore activations, zombie dislocation, and trojan planes are controlled by the player. \n\nFor infecting and killing humans, the player gets DNA points which are spent buying upgrades for the disease. Disease mutation could also occur. Combo system is present in the game. For example, a combination of vomiting and coughing can mutate into gushing forth vomiting which drastically improves contagiousness.\n\nPlayer created diseases have three aspects: infectiousness, severity, and lethality. The time for infecting the population is limited as humans may be able to produce a cure.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ndemic Creations","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":2830,"name":"Unravel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfe/cfe114c081281960bd79ace5209c0a4a.jpg","description":"The player controls Yarni, a man of yarn. Yarni arises in the human house, from the tangle of yarn used for knitting by the inhabitants of this house. Yarni moves around the house, goes into the yard, examines the neighborhood. It is small and therefore a mug, flower bed or children's bicycle are obstacles in its way. But the yarn that Yarni is made of is subject to him, he can catch on to the object, pull himself up and climb up, swing and jump, maybe even pull yarn and walk along it like a tightrope walker. The variety of these techniques is large enough, tips help to use them. You can interact with all objects, sometimes there are creatures that can block the path - for example, insects.\nYarn can not be unrolled indefinitely, it is necessary to monitor its consumption. Sometimes you can return the unwound yarn back to the \"body\", sometimes you can increase the amount of yarn, finding a new piece.\nThe most valuable thing Yarni finds is memories. Memories of a family of people, from which he \"comes\" himself. Memories are painted with different emotions, a sufficient number of collected memories opens the entrance to the following levels. In the game there are two lines of events. Events of the past arise as memories, they are found by Yarni. At the same time, the Yarni journey goes in the present - and also serves as a source of events that make up not the past but the present.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":13498,"name":"EVE Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/82b/82be203e68d737762846203811165933.jpg","description":"Eve Online is a massively multiplayer role-playing game and space simulator. The games initially required the monthly subscription but later got the limited free-to-play version. EVE Online is set in an expansive sci-fi world. The player controls starship and has the freedom to explore the in-game world at his own pace. There are many diffident activities for players ranging from quiet trading, mining, and manufacturing to full-on real-time space battles that can last for many hours and include hundreds of players.  \nOne of the game’s main features is freedom of player interaction. Many aspects of the game such as economics can be described as player-driven. Players can form corporations and alliances that can conquer some of the game’s 7800+ star systems. This leads to a lot of unique and unscripted situations affecting in-game politics and economics. Another notable part of the game is that real-world money can be used to buy different items that sometimes can cost hundreds of dollars.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"CCP","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4340,"name":"Uncharted: Drake's Fortune","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2e/f2e6dcf9c27d99ba2551f1094ad41756.jpg","description":"The game that started the popular Uncharted series. It is all about a treasure hunt in the jungle and ancient ruins and thus somewhat similar in mood and aesthetics to the Tomb Raider series, albeit with a slightly more realistic approach. \n\nThe plot follows the adventurer and treasure seeker Nathan Drake, who believes himself to be a distant offspring of the famous Sir Francis Drake. When exhuming his ancestor's remains, Nathan discovers an artifact that supposedly shows him the way to the legendary El Dorado, the city of gold in the Latin American folklore. Accompanied by journalist Elena Fisher, he sets out on a dangerous journey to a remote island. Throughout the game Nathan, controlled by the player, will have to fight pirates, using both melee weapons and firearms, and explore ancient ruins by jumping the cliffs, climbing the walls and swinging from the ropes.\n\nUncharted: Drake's Fortune includes motion-captured cinematic cutscenes that help develop characters and the plot to the point the game may feel like a blockbuster movie.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":10900,"name":"Project Zomboid","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/243/2436b84b99f1121c302367f0c5901b84.jpg","description":"The game combines the genres of survival horror and role-playing game. The main theme of the game - survival during a zombie apocalypse.\n\nIt has an open and changing world, many opportunities for the manufacture of useful things and cooperation with other characters, to fight hunger, injuries, depression and paranoia.\n\n###Plot\nThe game takes place in Knox County, Kentucky, USA.\n\nAs a result of the epidemic, a huge part of the population of the district became infected with an unknown virus and turned into a zombie. The few survivors will have to fight for survival.\n\nThe player plays as one of the survivors. The game does not have any definite ending, it cannot be won and it will end when the player’s character dies - and it depends only on him how late it will happen.\n\n###Gameplay\nThe game begins with the creation of a character.\n\nThe player can choose the name, gender, race, hairstyle, initial clothing, as well as the presence of a beard and chest hair in a male character.\n\nThen begins the creation of character and part of the background of the character. You can choose the character's profession before the apocalypse. Subsequently, this will affect some of the skills (for example, a former policeman shoots better, a builder builds defenses better, nurses heal wounds more successfully, cooks cook better, etc.).\n\nYou can then choose the positive and negative traits of the character. The negative ones include obesity, laziness, poor eyesight, chronic fatigue, constant thirst, etc. For the chosen negative traits you get points - these points can be spent on the positive traits of this character, such as agility, strength, high disease resistance and even luck.\n\nAfter creating a character, you (or rather, a character) find yourself in a randomly selected house on a game map. The zombie apocalypse has already begun, and your character has to look for a way to survive. In the game, not even very moral ways are allowed to do this: you can loot and rob, you can create a group of honest people and resist both zombies and bandits.\n\nIn addition to winning battles, the hero needs food, water, sleep, rest, and fellowship to survive - constant loneliness can lead to depression.\n\nThe complexity of the game increases constantly and gradually - the activity of zombies increases, electricity and water supply are turned off, and the products deteriorate. However, the player is able to provide a lot for himself - to cook food on a fire, collect rainwater, grow food.\n\nHowever, no action can ensure eternal survival - sooner or later the character dies. The slogan at the beginning of each new game is pessimistic: “This is the story of your death.”","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Indie Stone","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9979,"name":"Dirty Bomb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/616/616437f375a1080756c917b1437404f3.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Splash Damage®","platforms":[{"id":0,"name":"PC"}]},{"id":12018,"name":"Star Wars Jedi Knight II: Jedi Outcast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a5/0a56e2bb9ce95359e69ff9689c553a45.jpg","description":"The Legacy of Star Wars Dark Forces™ and Star Wars® Jedi Knight lives on in the intense first-person action of Jedi Outcast.\nAs Kyle Katarn, agent of the New Republic, use your Lightsaber and the full power of the Force to combat a new evil plaguing the galaxy.\nWield over 8 Force abilities including the Jedi Mind Trick, Force Lightning and Force Grip.\nChoose wisely from an arsenal of 13 weapons including disruptor rifle, thermal detonators, trip mines and Wookiee bowcaster.\nPlay on-line with 2-32 players or against a variety of AI Bots - and gain an additional 7 Force powers.\nTest your skills in 24 single-player missions and in 6 different types of multiplayer games including Jedi Master, Holocron, Capture the Ysalamiri, Duel, Deathmatch and Capture the Flag.\nInteract with legendary Star Wars characters such as Luke Skywalker and Lando Calrissian (featuring the voice of Billy Dee Williams as Lando.)\nDeveloped by critically acclaimed Raven Studios and powered by the Quake III Arena engine.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":11228,"name":"SpeedRunners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e52a797f049e701d4eee84774a99007.jpg","description":"In a city filled with superheroes, getting to crimes becomes a competition on its own. Fortunately there are enough rockets, bombs, grappling hooks, spikes, and other goodies lying around -- to make the competition fun and fast. Welcome to SpeedRunners.\nSpeedRunners is a 4 player competitive platformer with grappling hooks, power-ups, and interactive environments. Run, jump, swing around, fire rockets, grapple onto people to knock them off screen.Key Features4 Player Competitive Platforming!\nKeep up with the fastest player in-game, or fall offscreen and get eliminated!\nUse weapons like missiles, mines and grappling hooks to screw over your friends, and make new enemies!\nLocal and online multiplayer! Can you have 2 players on a couch against 2 other players on the internet? Yes of course!\nBots enabled - play on your own with several AI opponents. Or put them into matches with other people!\nA tutorial teaches you how to play\nController compatible (and recommended!)\nA dozen expertly designed maps\nUnique game modifiers\nA character named Unic!\nFull blown level editor with over 10k user created levels\nAn exciting single player campaign\nCreate your own custom in-game trails (visible when you hit super-speed)What to expect in the final game\nHead onto the forum and help us decide what will be the final game! Expect more maps, characters, items and game modes.Follow the development on twitter!@dd_games\n@tinyBuild","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":4414,"name":"Grand Theft Auto: Episodes from Liberty City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/470/470d21d6971de8f13ec0e1664a120cc0.jpg","description":"Grand Theft Auto: Episodes from Liberty City, as a part of the GTA franchise, offers players an open-world action with countless signs of immorality and violence. Although Episodes from LC is not a direct sequel to the series, it is slightly connected with the original GTA IV. Despite having the same game setting as in the previous GTA chapter (the action takes place in Liberty City approximately at the same time), the city itself faces some cosmetic changes. Several new details (new vehicles, weaponry and mini-games) were also added to the gameplay. The game also has better graphics and optimization. Episodes gives players an opportunity to dive into the atmosphere of crime, which Liberty City is famous for. The game includes two separate storylines: The Lost and Damned, and The Ballad of Gay Tony. In The Lost and Damned players take control of Johnny, a member of brutal biker gang The Lost, who has to fight against rival gangs for control of a city. Ballad of Gay Tony experiences playing for Luis Lopez, who tries to find himself in the world full of violence and obscenity.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rockstar North","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3358,"name":"Tropico 5","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c9/3c994986d767f56e7b72a124a35d4c3c.jpg","description":"Tropico 5 is a government simulator with a strong sandbox aspect. As El Presidente, a dictator of the Tropico island, you need to develop it through four eras from the Colonial Era to the Modern Times. The game features such mechanics as trading, managing resources, research, and diplomacy. The multiplayer mode expands these mechanics, allowing players to share resources, help each other and even declare war. \nUnlike previous installments in the series, Tropico 5 focuses heavily on the citizens. The prosperity of the island depends on their happiness and the balance between ten in-game factions.\nTropico 5 features two modes. The campaign includes 15 missions; the goal is to uncover the antagonist's plans and stop him. In the sandbox mode, you can create your own island and manage it, completing different tasks and developing it through ages.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"}]},{"id":2412,"name":"Dungeons 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/476/4767c380895fd35a4f1b59016dc45967.jpg","description":"Dungeons 2 is a strategy game where you take on the role of an evil lord named the Ultimate Evil that wants to restore his power over the lands he lost. While the Ultimate Evil himself is an embodied spirit, he can control minions that fight and build facilities. The Evil, in his turn, has to keep them happy so the minions could continue their work and stay loyal.\nThe game combines elements of a real-time strategy and dungeon manager. The simulation part of the game is focused on the underworld where you are to build dungeons and summon new monsters that will serve you. As soon as you decide to go up and occupy several castles, Dungeons 2 turns into a tactical game where you need to manage your units effectively.\nDungeons 2, as a follower of Dungeons, keeps its sarcastic spirit and the narration that helps you to understand the tasks and just entertains you. Despite the dark setting of the game, it’s full of pop culture references including Lord of the Rings and Warcraft, and filled with dark humor.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9741,"name":"The Surge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/396/3963e0df75c22d5995368ec43dacc19e.jpg","description":"A catastrophic event has knocked you out during the first day on the job… you wake up equipped with a heavy-grade exoskeleton, in a destroyed section of the complex. Robots gone haywire, insane augmented co-workers and rogue AI - everything wants you dead.\nDefy deadly enemies and huge bosses in tight, visceral melee combat. Target and slice specific limbs off your foes, with a next-gen loot system where you loot what you dismember. Equip, upgrade and craft new weapons and armors sliced from enemies, and make yourself stronger through a fresh take on leveling-up.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":14989,"name":"Alpha Protocol","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b9/8b9e77be7f0f7941b11ae4b21ca2db43.jpg","description":"In the Middle East, a terrorist group shot down a passenger airliner. The attack was made using the latest American-made missiles. The agent Michael Thorton is assigned to investigate the case. He manages to get on the trail of the leader of the group, but suddenly he is removed from the job and betrayed by senior colleagues. Now, when the American government hunted him, Michael uses \"Alpha Protocol\" - a secret program that recruited him and begins to work to detect the conspiracy secretly.\n\nAlpha Protocol gives you the ability to take control of Thorton with a camera from a third-person perspective (you can see all that surrounds you). The CIA trained Thorton, so at his disposal is possession of weapons of ranged and melee, as well as technical devices. The player also earns promotion points, which increase skills in using guns and give additional abilities. \n\nAlpha Protocol provides the ability to interact with numerous characters in the game. Conversations take place in real time, thus giving to the player some time to answer in essential dialogues.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":23702,"name":"Need for Speed Payback","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a57/a57e3c73ca46cbf55b526c828e3545c0.jpg","description":"Need for Speed Payback is an action-driving racing game and the twenty-third part of the NFS franchise. \n\n###Gameplay\nDespite the trend made by NFS' before Payback features an offline mode. The game is set in a fictional city named Fortune Valley. The player can choose between the three individuals to represent. The title features a real car — a total of 74 ones, and crafting system — many car parts can be tuned according to the player's liking. \nThere is a total of five challenges types: Race, Drift, Off-Road, Drag, and Runner. All the modes share the goal — to reach the finish. However, the initial purpose is altered depending on the race — sometimes one has to drift his way to the finish line, somewhere the manual transmission turns one, and the gear switching comes to be mandatory.\n\n###Plot\nPayback is one of few NFS' to feature ongoing narrative — the story of this one emphasizes the revenge theme. Three characters — Tyler, Mac, and Jess — are trying to avenge Lina who betrayed the crew from the very start.  Each member of the gang has its unique abilities — Jess, for instance, is professional intel gatherer, so she plays a role of inside agent all the time. Guys, on the other hand, are more into races, so they do the dirty job in the trio.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ghost Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":10125,"name":"Tom Clancy's Ghost Recon Wildlands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/72e/72e0e063c817e90c696b2da3ea78abaa.jpg","description":"Tom Clancy's Ghost Recon Wildlands - the tenth game in a series of military tactical shooters with an open world, dedicated to the adventures of the special purpose squad \"Ghosts.\"\n\nIn the title of the series is the name of Tom Clancy - the author of super popular thrillers on military topics. Clancy is known for the ability to combine a tense plot with a detailed exposition of the details of military life, high realism of the narrative. In a series of these games, he served as a screenwriter.\n\nPlayers play as members of the Ghosts, an elite group of fighters performing special missions in the army of the United States.\n\nThe game takes place in Bolivia, which is represented by the place where the drug cartel of Santa Blanca has much more power than the government. Thanks to cartel, this country is the largest supplier of drugs in the world. The power of a criminal group adversely affects the entire situation in the region. The US government sends an elite special unit \"Ghosts\" to investigate corruption links and destroy the drug cartel.\n\nThe game uses a third party perspective. A first-person view is also possible - this option is used for aiming.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":3459,"name":"The Order: 1886","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c5b/c5b3b6aa220050f7f504f4477cb51d3b.jpg","description":"The Order: 1886 is an action adventure game developed by Ready At Dawn.\r\n\r\nSet in alternate Victorian England, the story revolves around the Order of the Knights of the Round Table. Hundreds of years ago, the mutants which resemble a human/animal hybrids start to appear. The order uses a substance called the Black Water that allows the knights to live forever without growing older and regenerate their wounds. The conspiracy involving the high ranks of the Order is uncovered. It is your job to investigate.\r\n\r\nThe Order features is a third-person shooter. The game features a cover system where the player locks into cover with the ability to peek out and shoot. The players walk through multiple linear levels fighting humans and mutants. The Protagonist is equipped with different types of weaponry such as automatic rifles, grenades, and pistols. Melee attacks are also useful in the game as they can be used in order to silently kill an enemy. Quick time events are heavily used in the game. There are a lot of collectibles scattered around the levels that provide more lore in the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ready At Dawn","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":9494,"name":"ArmA II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c38/c38595cc04bdddaa84ed8feae5319849.jpg","description":"Arma 2 is an open-world military simulation game developed by Bohemia Interactive.\n\nArma 2's campaign takes place in 2009 in a fictional post-Soviet state of Chernarus. A civil war breaks out in Chernarus. The pro-communist forces overthrow the current government and establish a new socialistic state in Chernarus. NATO forces are deployed in order to re-establish the sovereignty of Cheranrus.\n\nThe game features realistic weaponry, vehicles, weapon ballistics, recoil and so on. Every object that is controlled by the AI is interactive such as birds and animals. All the buildings and static objects such as trees are destructible.\n\nThe game replicates real military experience where engaging in combat is not the only thing. Players have to use military tactics and planning in order to succeed. \n\nA mission editor is also included with the game. Players are free to create their own levels and even campaigns. A scripting language can be used to create more complex missions. The editor gave birth to multiple mods the most famous one being DayZ.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10296,"name":"TERA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d3/6d367773c06886535620f2d7fb1cb866.jpg","description":"TERA or The Exiled Realm of Arborea is a third person Korean MMORPG game which is also a free-to-play title. \nTERA is just a typical Korean MMORPG game, with quest, crafting and PVP modes. Combat of the game happens in real-time, with element of dodging the enemy attacks. There are 13 different classes in TERA since the October 2017 patch. \nThe game has its own currency called Chronoscrolls which lets players to buy various things in the game with real money, but this currency is only available for those who purchased the game either physically or digitally. \nThe plot of TERA is about two titan beings Arun and Shara who met each other in a formless void where they fell asleep and began to dream. The Exiled Realm of Arborea began to manifest itself as they slept. Now both of their bodies form the two continents from witch the Exiled Realms of Arborea is made of. Everything what happens in the world of TERA is a manifestation of Arun and Shara dreams.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bluehole","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":3090,"name":"Need for Speed","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/19a/19a512a8c1293c22894b7364e1405ec1.jpg","description":"Become the ultimate icon of today’s urban car culture in Need for Speed™, featuring Five Ways to Play and a huge open world to race and explore from dusk ‘till dawn.\n\n* FIVE WAYS TO PLAY – Earn reputation and master all Five Ways to Play - Speed, Style, Build, Crew and Outlaw - to win your own way.\n* RICH, AUTHENTIC CUSTOMIZATION – Customize your car and express your style with extensive visual modifications, performance upgrades and handling tuned to your specification.\n* REAL WORLD ICONS - Get inspired by the icons of today's urban car scene - Magnus Walker, Ken Block, Nakai-San, Risky Devil and Morohoshi-San.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ghost Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":7317,"name":"Scribblenauts Unlimited","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/42d/42d770eb49f2ba01cd4045e0d92af7a9.jpg","description":"The fourth game in the Scribblenauts series follows the same basic mechanics as the previous three. You play as Max, who owns a magic notebook. Scribe any word in it, and it becomes real (of course, only if the word you wrote describes a particular object). The game will understand your written words and create interactive in-game objects. They are used to solve puzzles, which earns you Starites, the ultimate goal of the game. The ability to summon any imaginable item gives you an almost unlimited number of ways you can solve any puzzle.\nScribblenauts Unlimited features a way more detailed plot than its predecessors. There's an extensive backstory that explains the protagonist's motivation in gathering Starites. We learn that Max and his sister Lily played pranks on people using their magic notebook until it got them into trouble. One day they unknowingly played a trick against an old wizard. He grew angry and magically turned Lily into stone. Max can only save his sister by gathering enough Starites. Unlike previous parts, this game is set in an open, albeit cartoonish, world, that gradually opens to you as you gather more Starites. The tasks are now assigned by the NPCs, and Starites are given as a reward for help. Thus, they serve as the proof that Max has corrected his behavior.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]}]