[{"id":4036,"name":"God Mode","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3fa/3fa60e9b12af3fa810c905eaa39d306f.jpg","description":"Do you like running?  How about gunning?  What if special abilities are thrown into the mix?  Upgradable weapons?  Let's say there’re dozens of on-screen enemies to unleash this firepower on, and as your reward for dispatching them you get experience and gold to collect that can be used for character customization and new equipment--all the while playing alongside friends in 4-player cooperative play!  If you like the sound of all this, then you'll love God Mode.\nRetro shooter action and RPG elements are combined in this new downloadable third-person shooter. God Mode combines non-linear gameplay, fast and frantic shooting, hordes of on-screen enemies, a fully functional online coop mode, and features visuals and gameplay that rival that of a full-priced boxed title. Matches rarely--if ever--play out the same, as dozens of in-game modifiers can significantly alter the gameplay on the fly. Characters are fully customizable, both in appearance and equipment, which continually evolve. Gold and experience are constantly accrued and used to unlock new and satisfying weaponry and unique powerful abilities, both of which can be further upgraded.Key Features:Cooperative multiplayer for up to 4 players (with special PvP locations)\nCollect gold and experience to unlock upgradable weapons and abilities\nExtensive character customization\nDozens of Tests of Faith (in-game modifiers) dynamically alter gameplay in each level","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":2949,"name":"BlazeRush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a1/9a1af7d015b480c215bfe79a8ffa72ed.jpg","description":"BlazeRush is a dynamic arcade racing survival game with no health, no levelling and no brakes!\nYou can assemble a team of friends to play in local or online multiplayer, choose a car to your taste and chase, blow up and cut off!\nAdapt your style and tactics to new enemies, obstacles and tracks.Welcome to the World Of Racing and Frantic Fun!key Features:Simple multiplayer. Up to 4 players locally and up to 8 players over the Internet;\nCouch vs. couch. Start races with local players;\nConnect to the game at any time;\nDozens of fun tracks on three planets, 16 cars and a variety of cool guns;\nLots of medals for various tricks and antics.\nStay tuned and follow us on Facebook!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Targem Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":782340,"name":"Dome Keeper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb5/cb524d6981f187e3558527a7b7a3f7c2.jpg","description":"Dome Romantik has grown to become Dome Keeper with beautiful updated pixel art, atmospheric music and sound and more of everything. Defend your dome from wave after wave of hostile attacks in this roguelike survival miner. Use the time between each attack to dig beneath the surface in search of valuable resources. Use them carefully on powerful upgrades to help you stay alive and make it to the next world.Dig\nDrill tunnels beneath your dome in search of precious materials. Watch the time, you need to get back to the dome and be ready when the next wave of attack comes. How deep will you get this time? How much can you carry back?Defend\nTake control of the defenses and fend off the alien attacks. Air and ground, slow and fast, the attackers must be prioritized and dealt with before they tear your dome apart.Develop\nUse your mineral harvest to gain powerful upgrades; improve the strength of your weapon, make your drill more powerful, increase the speed of your jetpack and research other improvements. Find artifacts to give an extra boost to your survival odds.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"bippinbits","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":301516,"name":"Last Epoch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd8/dd8f2a04d55c3556dc3cbdc59158df80.jpg","description":"Last Epoch combines time travel, exciting dungeon crawling, engrossing character customization and endless replayability to create an Action RPG for veterans and newcomers alike. Travel through the world of Eterra’s past and face dark empires, wrathful gods and untouched wilds – to find a way to save time itself from The Void.\n\nKey Features\n15 Mastery Classes\nBegin your adventure as a base class which can then specialize into one of three Mastery Classes. When specializing into a certain Mastery you will be able to access new skills and specialize your playstyle!\n100+ Skill Trees\nEvery active skill has its own augment tree that can completely change how the skill functions. Transform your skeletons into archers, your lightning blast into chain lightning, or make your serpent strike summon snakes to fight alongside you!\n\nHunt Rare & Powerful Loot\nFill your arsenal with magic items you craft to perfection, change the rules of your build with powerful unique and set items, and always have that next upgrade just on the horizon with Last Epoch's randomized loot system.\nTime Travel\nThe world of Eterra is home to many factions and secrets. Travel to different points in time to change the world's fate, and fight to set it onto a new path.\nEndless replayability\nWith a wealth of classes and skills to customize, deep game systems, randomized loot, and continuing development, Last Epoch is a game that will keep you coming back.\nEasy to Learn, Hard to Master\nWe're committed to making our gameplay approachable through breaking up the required learning and being transparent. At the same time, overcoming some of the most challenging content will require deep knowledge and pushing your build to its limits.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Eleventh Hour Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22024,"name":"Catan Universe","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d33/d333544e683499e3e8c4a1374e8275d7.jpg","description":"After a long voyage of great deprivation, your ships have finally reached the coast of an uncharted island. However, other explorers have also landed on Catan: The race to settle the island has begun!\nBuild roads and towns, trade skillfully and become ruler over Catan!\nSet out on a journey into the Catan universe, and compete in exciting duels against players from all over the world. The board game classic and the Catan card game, with totally new graphics, bring an authentic card table feel to your screen.\nPlay the basic board game in multiplayer, as well as the introductory game of Catan – The Duel, free of charge. For even more variety activate the complete basic game as well as the add-ons “Cities & Knights” and “Seafarers” as in-app purchases (pricing info below), defend yourself against barbarian invasions, conquer new frontiers, and compete against shrewd computer opponents.Free to Play Content:\nBase Game Free-Matches against 2 other human players\nIntroduction-Match for Catan-Duel\nAccount creation and login bonus of 100 Gold and 2 Scrolls\nScrolls can be used to unlock expansions for a limited time and gaining full access to Auto-Match, Singleplayer and Custom-Matches\nMore Scrolls can be unlocked by levelling up\nFeatures:\nTrade – build –  settle – Become ruler over Catan!\nFaithful to the original version of the board game “Catan”, as well as the card game “Catan – The Duel”\nCreate your own Avatar\nChat with other players\nForm yourselves into guilds\nUse your Catan Universe account to play via client or in the browser (further platforms in production)\nEarn numerous achievements and unlocks\nGet additional add-ons and game modes as in-app purchases\nGet started really easily with the comprehensive tutorial\nBefore long, the Catan universe will be extended even further!\nFeatures in development:\nIn future you will be able to play with just one Catan account on PC, Mac, iOS and Android devices, and compete against the entire worldwide Catan community on all supported platforms.\nCompete in tournaments as guilds or for your own glory.\nProve your skills in numerous additional add-ons.\nPricing information:\nCatan Universe uses an in-game currency called Catan Gold for purchases available in the following configurations:\n100 Catan Gold = 0,99$/€\n400 Catan Gold = 3,99$/€\n900 Catan Gold = 7,99$/€\n1700 Catan Gold = 14,99$/€\n3000 Catan Gold = 24,99$/€\nThe Catan base game, the Seafarers and Cities and Knights expansion are available for 500 Catan Gold each. Various bundles are available for a great value, e.g. the base game and both expansions for 1300 Catan Gold. Items like additional scrolls and XP booster are also available in various quantities starting at 40 Gold. Furthermore numerous customization options for both the game and the player avatar can be purchased for Catan Gold.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"USM","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":19188,"name":"Pool Nation FX Lite","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b0/3b0240fb639701e6008e9c37f2db0a2c.jpg","description":"Snooker Nation Championship Now AvailableOwners of Pool Nation can now pick up the Snooker Nation Championship at a discounted rate remember the discounts stack so you get a total of 30% off! But hurry as this is a limited time offer!\nhttp://store.steampowered.com/app/458830/\nAbout the GamePool Nation FX, is serious fun! A visually stunning pool simulation with the critically acclaimed POOL NATION physics engine. Play 8 Ball, 9 Ball, Snooker, Killer and more, unlimited Career modes with customised difficulty levels, Trickshots, Fast paced Endurance mode, Local and Online Multiplayer, spectate live matches and feel the hustle and bustle of the Online Pool Hall. On one hand Pool Nation FX is a serious Sim which can actually improve your real life game, on the other it can provide a more casual experience; it flawlessly blends reality with the impossible, resulting in the finest example of digital pool you will ever play.Why are there four options to choose from?  Because Pool Nation FX is a HUGE game, we want you to play it your way: by providing you the option to have everything unlocked, play only online or offline, Or earn cash and unlock modes as you compete to win... In Pool Nation FX there are no subscription fees, no barriers to playing online, just pool with friends!\nPool Nation FX Lite - Free to Play version of the Game\nThe Full Game The whole game including both Online and Offline\nThe Unlock Offline DLC pack Unlocks all the Offline features in game\nThe Unlock Online DLC pack Unlocks all the Online features in gameWhat is Pool Nation FX Lite? It is Free to Play, perfect for those who want to work there way up, unlocking modes as you go; with limitless 8 Ball Pool online an offline practice mode, a Daily Bonus Match, Daily Trickshot Challenge and full access to the customisable features including collectable cues, balls, decals and locations. Play with your friends online, and compete to win cash to unlock modes, the more you play the more money you will earn.\nIncluded in the free version:\nThe critically acclaimed Pool Nation Physics\nAll aiming aids unlocked from standard through to extended and even aiming aid off\n8 Ball Pool Online\nPlay for Cash 8 ball pool\nDaily bonus match to earn more cash\nTrickshot Challenge\nPractice Offline 8 ball, 9 ball and snooker\nAll other modes are unlockable by in game currency... Upgrade to Pool Nation FX the Full Game Which includes both the Online and Offline DLC packs, to save time and automatically unlock all the features available to you:\nWant to access all areas Pool Nation FX has to offer...  Have an abundance of game modes available to you? Invite friends? Compete in Leagues? Earn money in-game as you advance through your pool career offline to use to buy cues, balls and decals. Battle it out online with the introduction of all new modes including; Play for Cash, Leagues. Explore the fully customisable Trickshot Editor. Enrol in the Pool Nation Cup and kick start your Snooker Career. Pool Nation FX is much more than just a pool game. It’s the ultimate pool game.The Offline Career Explained: Compete for a season in the Pool Nation FX Tour Career. Start in the Qualifying rounds and work up through the Round 1 through to the Final, comepete across 6 locations and finally the World tour in New York. See tour rankings and player statistics. Try to earn all the tour achievements for each tour game. Each tournament level includes 3 star challenges to compete. Tour games include 9-Ball, 8-Ball and Snooker. Play levels of Easy, Medium and Hard, with a variety of aiming lines to choose from and Good Luck.Sneak Peek at just some of the Full Game Features:\nThe critically acclaimed Pool Nation Physics\n8 Ball UK Reds and Yellows\n8 Ball US, 9 Ball, 3 Ball, Golf, Rotation, Speed, Killer and more...\nCustomise your rules sets to play pool the way YOU want to play pool\nCreate unlimited matches online with all modes and cash prize funds unlocked\nSnooker Online - Offline and a NEW Snooker career\nAll new online system - rewritten from the ground up\nSpectate all available matches LIVE Online\nOnline Leagues - work your way up from League 10 to League 1, but play with skill you don't want to be relegated...\nFull access Online Pool Hall with new Pool Hall venue\nEarn Money as you progress through our all new career mode, with 6 locations, 6 qualifying matches in each stage you will need to play with skill to win\nVarying AI levels of difficulty in offline modes including the Tour, Endurance and Versus\nAll NEW Online mode 'Play for Cash' is a competitive mode which gives players a chance to earn coins, the more games played, the higher your player level, the more money you can potentially unlock\nOnline Friendlies area to easily create matches with friends\nCustomise your tables with of nifty new colour picker\nTrickshots and trickshot challenges, rotate objects on all axis and lift into the air!! Taking trickshots to a new dimension...\nOnline Tournaments and more coming soon!\nNEW locations with a variety of tables to play on within each location\nAll NEW Daily challenges \"Pool Nation FX is the most realistic Pool Simulation ever made.\"\n\"In Pool Nation FX the physics are so realistic it can actually make your real life game better!\"\n**Cash / Money is an in game currency to unlock decals, cues, locations etc. In game currency is only collected in game not bought.\n*Download this game play it without making in-game purchases. Optional in-game purchases are available that may enhance your gameplay experience but are not necessary to complete the game, DLC has been created to save time in downloading all unlockable assets in game for those who wish to do so.\nAnd there is more to come ...share, challenge and create epic trickshots within our exclusive Trickshot Editor, play doubles online, new tournaments and re-discover this much-loved sport.\nPool Nation FX flawlessly blends reality with the impossible, resulting in the finest example of digital pool you will ever play - developed with you for you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cherry Pop Games","platforms":[{"id":0,"name":"PC"}]},{"id":17799,"name":"Aarklash: Legacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4f/e4f2f28c1565e2e4d53ef4623b46570c.jpg","description":"In Aarklash: Legacy take command of a mercenary squad in search of truth and guide it through countless battles.\nWelcome to Aarklash, a land of chaos where incessant battles between the forces of Light, Destiny and Darkness have lasted since the beginning of time. At the heart of this conflict, a group of mercenaries, wrongly accused of crimes against the Lion of Alahan, is being hunted down. Convinced that they are in the right, and intent on fighting their enemies to the bitter end, they will set forth on an epic adventure where they will discover dark secrets. A path strewn with obstacles and many unfriendly characters awaits them. Go into battle and fight for your life! Your actions will determine the destiny of Aarklash…\nInspired by the Confrontation figurines universe, Aarklash: Legacy is a tactical adventure game. The player will find himself at the heart of the intrigue, controlling a group of 4 characters and leading them into battle across the lands of Alahan, Acheron, and the Behemoth. Final victory for the mercenaries is gained by the use of a wide range of powers which are enhanced through looting items and managed via skills trees which can be reset at will. Interaction between the heroes is also important and real bonds will be created between them as the game progress. Both fun and action await you in Aarklash: Legacy!\nKey features:\nTake part in an epic campaign, mixing adventure and tactical combat, following a rich storyline that will transport you into the fantasy world of Aarklash.\nThanks to the active pause system, choose the best tactics to succeed in battle.\nAt any time in the game, dissolve your team and then recombine it by choosing 4 characters from the available 8.\nThrough numerous and intense battles, make your heroes work together using group skills.\nA skill tree will allow you to change the skills of each of your characters. Find the best combinations to take full advantage of the possibilities of your group as a whole.\nTake on enemies and various organized groups, who also have their own skills!\nLoot objects from your enemies and progress your group throughout the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10158,"name":"Brothers in Arms: Road to Hill 30","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fcf/fcfedb36ed89ae69869f9abb9f3e136a.jpg","description":"Based on a true story. Set during the famous airdrop before the invasion at Normandy, where Sgt. Matt Baker and his squad of 101st Airborne Paratroopers were scattered over the French countryside.\nAs the story unfolds, you must choose between the success of your mission and the lives of your men - your brothers in arms.\nBrothers In Arms: Road to Hill 30 will immerse players in the historic, eight-day invasion of Normandy - with unparalleled imagery, authenticity, sound, and gameplay.\nOne of a kind: Brothers In Arms Road to Hill 30 is the only first-person tactical shooter set in WWII.\nReal military tactics: Intuitive and easy-to-use squad controls appeal to both the hardcore and mainstream gaming audience.\nReal soldiers: Featuring a cast of more than 20 characters, each with a unique personality, appearance, and style.\nRevolutionary AI system: Allies and enemies use the standard operating procedures of fire and maneuver to flank and kill their foes.\nUnprecedented authenticity: Historically accurate and detailed battlefields, events, and equipment re-created from Army Signal Corps photos, aerial reconnaissance imagery, and eyewitness accounts.\nInnovative multiplayer: Players command three-man AI teams in a battle of wits and skill to accomplish exciting objectives.\nAward-winning team: Gearbox Software, creators of Half-Life Opposing Force and developers of James Bond: Nightfire, Counter-Strike, and Halo (PC).","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Gearbox Software","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":3565,"name":"Futuridium EP Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b43/b430e673c91054d9e992337b81de2732.jpg","description":"Futuridium EP Deluxe is a psychedelic retro inspired shoot’em up with a modern twist, that blends together frantic action, puzzle elements, a vibrant low poly aesthetic and an heart pumping electronic soundtrack. As a lone starship pilot lost in a dimensional loop just before a big space battle, with a limited and constantly depleting energy tank, your only hope is to fly as fast as possible over enormous space dreadnoughts, destroying their defenses and the cyan power cubes to get some energy back.\nTry to escape the infinite loop of Futuridium: you can count only on your reflexes, your dual lasers, the nimbleness of your starship and... the ability to turn 180° on the spot! Can you beat all the 50 levels, the 5 bosses, unlock all the extra game modes and collect the 150 medals?\nGood luck! You’ll need it...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MixedBag","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":981,"name":"Rise & Shine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35c/35c0b812a300aa114d757e5e279ec884.jpg","description":"Shoot Fast, Think Faster\nRise & Shine is a true \"think and gun\" that combines elements of arcade shooters, bullet hells, and puzzle platformers to create a new blend of strategy and viscera. Switch between Shine's add-ons to solve puzzles that redefine what bullets can do. Guide projectiles through intricate mazes, electrify damaged equipment to discover new pathways, and juggle 8-bit fruit because why not?\nGet Ready to Respawn\nDon't let the cute character models fool you, saving Gamearth won't be easy. Prepare to dash flurries of missiles and avoid unseen traps as you fight to prevent its destruction. It's going to take all you've got to stay alive in the face of lethal robot armadas, enormous bosses, giant death wheels, and (of course) brainthirsty zombies. You're not gettin' through this in one piece, kiddo.\nNext Level Detail\nEnter a world where every level is a single, continuous work of art. Each level is composed of hand drawn illustrations with multiple parallax scroll layers so every forward step is new; no tiling or repeated elements. This meticulous attention to detail allows each frame to flow seamlessly from one to the next, a quality you'll wish you had on your 20th respawn.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Adult Swim","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":447825,"name":"Sherlock Holmes: Chapter One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/60c/60ca6f84551e6f5435d97b603a77d551.jpg","description":"His legend begins with you!\nBefore he was the world’s greatest detective, Sherlock Holmes was a brilliant rebel itching to prove himself. When an old wound compels him back to the Mediterranean shore where his mother died, it seems like the perfect opportunity to do just that—but beneath the vibrant urban veneer of the island, the rhythm of island life strikes a more ominous beat. Crime and corruption, a twisted sense of justice and morality... These are just a few stumbling-blocks in Sherlock’s quest for truth.\nAs Sherlock, your legacy is written by the decisions you make in this open world. Deception, violence, and deduction are just a few resources in your arsenal—your mysterious companion and sounding board, Jon, is another.\n\nWhether you choose brute force to solve problems or stay one step ahead of your enemies by using your wits to spot vulnerabilities, you decide what each situation demands as you hone your investigative skills. It’s time to confront your past so you can become the legend you’re destined to be.\n\nKEY PILLARS:\n\nThe Man Before: As a cavalier young Sherlock on the precipice of adulthood, you’ll earn your reputation in a way no game or story has explored before. We’ve never seen the youthful arrogance and naiveté of the man before the legend—now you’re living it.\nGlobal Investigation: You never know where your next clue will come from. Explore and exploit the entire city in your pursuit of truth, using clues, rumors, disguises, tags, and pinned evidence to build a solid case within your mind palace.\n\nAnd Stay Down: Weapons might help you in a pinch, but there’s something to be said for style—and you have it in spades. Spot enemy vulnerabilities with your brilliant observation skills, or exploit the environment to take someone down while keeping your own hands clean.\nA Different Jon: Before John Watson, there was a different Jon - your best and only friend. But who is he, really?\n\nA Darkening Tide: A vibrant open-world island in the Mediterranean promises anything but paradise. Political corruption and crime run rampant while the islanders cling to tradition and eschew outsiders, making your job even more difficult.\n\nTruth and Lies: There are two sides to every story, and the proud islanders have their own ideas about truth and justice. It’s up to you to decide whether uncovering the truth will do more harm than good—and how that will shape the man you’ll become.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Frogwares","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":51431,"name":"The Room 4: Old Sins","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ac1/ac157870541bc1c4b5a03d5ee528a747.jpg","description":"Enter The Room: Old Sins and be transported to a place where tactile exploration meets challenging puzzles and a captivating story.\nThe sudden disappearance of an ambitious engineer and his high-society wife provokes the hunt for a precious artefact. The trail leads to the attic of their home, and the discovery of an old, peculiar dollhouse…\nExplore unsettling locations, follow obscure clues and manipulate bizarre contraptions as you uncover the mysteries within Waldegrave Manor.\nTHE ULTIMATE PUZZLE BOX\nExplore a deviously complex dollhouse which transforms at your fingertips. Each intricate room is a portal to a new, stunning environment.\n\nPICK-UP-AND-PLAY DESIGN\nEasy to begin yet hard to put down, enjoy a unique mix of intriguing puzzles with a simple user interface.\nINTUITIVE TOUCH CONTROLS\nA tactile experience so natural you can almost feel the surface of each object.\nINTRICATE OBJECTS\nExamine dozens of detailed objects to discover which of them conceal hidden mechanisms.\nATMOSPHERIC AUDIO\nA haunting soundtrack coupled with dynamic sound effects create an unforgettable soundscape.\niCLOUD & GAMECENTER SUPPORTED\nShare your progress between multiple devices and unlock achievements.\nMULTI LANGUAGE SUPPORT\nAvailable in English, French, Italian, German, Spanish, Brazilian Portuguese, Turkish and Russian.\nFireproof Games is an independent studio from Guildford, United Kingdom.\nFind out more at fireproofgames.com\nFollow us @Fireproof_Games\nFind us on Facebook","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Fireproof Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":51176,"name":"Leisure Suit Larry 3 - Passionate Patti in Pursuit of the Pulsating Pectorals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d8/5d89e3ef78840103848e59d631cfc431.jpg","description":"Passionate Patti in Pursuit of the Pulsating Pectorals! is the third game in Al Lowe's Leisure Suit Larry series. Larry Laffer has finally found the woman of his dreams, and can happily live with her together on the beautiful tropical island... until he gets thrown out of the house by his wife. His boss, who happens to be his (now ex-) father-in-law, fires him. Larry is all alone, without a woman, without a job, on an island that has long ceased to be a \"tropical paradise\" and is exploited by entertainers, lawyers, and alike. But never despair! Dressed in his irresistible leisure suit, Larry is about to conquer the world (or at least its female population) anew. Watch out, fairer sex, because Larry is back to his swinging self!\n-   A classique text-based adventure as the previous entry in the series\n-   Play in the second half of the game as the enigmatic and beautiful pianist Patti, helping them to reach an ending that will finally bring happiness into Larry's life.\n-   Play as one of gaming’s longest lasting legends: Leisure Suit Larry!\n-   Al Lowe’s famously risque humor and bodacious babes that are waiting to “work out” with you!","review":"","timePlayed":0.0,"releaseYear":1989,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Commodore / Amiga"}]},{"id":29170,"name":"DOOM VFR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a49/a49380bea72b65b0f8fbd81e4381a62b.jpg","description":"DOOM® VFR brings the fast-paced, brutal gameplay fans of the series love to virtual reality. Immerse yourself in the UAC facility on Mars and the depths of Hell, as your skills are put to the test through intense combat and challenging puzzle-solving. Play as a cybernetic survivor who is activated by the UAC to fight the demon invasion, maintain order, and prevent catastrophic failure at the Mars facility. Lay waste to an army of demonic foes as you explore and interact with the outlandish world of DOOM from an entirely new perspective.\n\nSet shortly after the demonic invasion on the UAC’s Martian research facility, you are the last known human survivor–until your death. Under a top-secret UAC operational contingency protocol, your consciousness is transferred to an artificial brain matrix. Your designated purpose: restore operational stability and use any means necessary to stop the onslaught of demons.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":19742,"name":"Project Druid - 2D Labyrinth Explorer","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4f/b4fcad51f69c38e10a1674f3457cf9cd.jpg","description":"[/img]\nProject Druid is a game from the past. It was made according to the rules of lost and forgotten systems and games. A game without the fancy graphics and system from todays games. A game you can sit down for and just play and enjoy. It can be hard it can be easy , it all depends on yourself.\nA labyrinth game based on the concept of the c64 game Druid. Simple graphics and simple game play which will keep you busy. A small but entertaining game. Find the keys and exit hidden in the labyrinths to proceed and try to stay alive while your playing. Old skool graphics and game play.\n- Total of six levels of big labyrinths\n- Bosses\n- Monsters\nNOTE : THIS IS NOT A TRIPLE A GAME - ITS JUST A SIMPLE CASUAL GAME -\nThe game was build from scratch with Game Maker Sudio over a period of two years. Most of the graphics were completly made from scratch and a few are from other sources.\nControls are WASD with mouse.\nYou will like or hate this game. I rather hope you will like it.\nNOTE : Please comment on the game and game play. If you find bugs please report them through our website.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cemil Tasdemir","platforms":[{"id":0,"name":"PC"}]},{"id":18294,"name":"Bunch of Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/436/436efa56b8da5849614959d61f1659b8.jpg","description":"The Bunch is the most formidable team of elite fighters ever assembled from around the world. What brought them together? Well, obviously the Earth is under attack!  An alien invasion is threatening all humankind, without regards to gender, color or nationality. And these nasty aliens have a powerful Zombie Army™ at their disposal!\nPlay as Agent Liu, Jared Joe, El Camarada or Captain Smith becoming humanity’s last line of defense. Survive by any means necessary wielding a huge arsenal that includes flame throwers, rail guns and gravity bombs. Or charge over-the-top super powers that will annihilate your enemies! Cooperate online with up to 4 players.\n“Bunch of Heroes” features stylized cartoon like artwork, funky rock and roll music, cutting edge technology, great humor and cooperative gameplay to inspire zombie killers and E.T. haters alike all over the globe!\nBecome a Hero; Earth needs a bunch of them at least!\nKey Features:\n\nPlay with your friends in the 4 player cooperative online campaign\nAmazing cartoon style graphics and Funky Rock and roll Music\n4 Playable characters with amazing Ultra attacks\nLush and diverse environments\nMultiple objectives within each level\nDozens of fun and wacky enemies\nA huge arsenal of weaponry to annihilate them with\nPlace and use turrets to gain tactical advantage\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"NGD Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16827,"name":"Tap Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88b/88b47269f6735af4969e0c7497f9b452.jpg","description":"Welcome to the first puppet show RPG!\nBattle tons of foes, buy new upgrades, cast magic and recruit new Heroes.\nOr just sit back as your Heroes do the fighting while you relax or do other things.\nBut just remember that you need to make sure your heroes are strong enough before you leave them to their own, especially if you are about to face a Boss!\nEnjoy the show!\nFeatures\nOver 70 different enemies and bosses\n10 different areas\nA Distinct group of heroes with different abilities\nInteresting powers to unleash on your enemies\nMix of RPG and clicker grind elements with tons of skills to upgrade\nAchievements to unlock\nRidiculous amounts of loot\nPossibly infinite gameplay\nPuppet stage graphics with cute puppet heroes!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"VaragtP","platforms":[{"id":0,"name":"PC"}]},{"id":12748,"name":"Lobotomy Corporation | Monster Management Simulation","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6b/f6b99946d14b6a505c3f4ac9ad0ed553.jpg","description":"Administrator and monsters, you cannot possibly imagine.\nLobotomy Corp is a Monster Management Rogue-Lite Simulation game.\nOur game was inspired by the monsters from game and movies such as SCP series, Cabin in the woods and Warehouse 13. Furthermore, it was developed from the thought of “What if those monsters were real and your job is to manage them”.\nYou will be playing as an administrator of the company which is in management of such creatures. These monsters generates a new energy source, and your job is to collect them through giving out to your subordinates. Through this process, you can open up new departments that facility allows and encounter various monsters. In the game, the player will have to go through the company’s fear and tension filled atmosphere.\n“Our new technology will bring salvation to the human race.”\nLobotomy corporation is a newly established energy company that extracts infinite amount of entropy through the isolation of abnormality with our self developed technology. This is only an impression that the public has regarding our company. You will see its reality after you have joined us.\nOur facility is formed of many departments just like any other companies. You will have access to various departments as you gather more energy. The more you have access to various departments, the more easier the management of abnormality will become.\nFurthermore, an AI named Angela will be by your side to support your needs for the smooth process of work.\nAn existence you constantly have to examine and observe.\nWe have decided to call the monsters in Lobotomy as ‘Abnormality’.\nYou will have to try your best to keep your employees out of danger while keeping the energy extraction level at its maximum.\nAt first, you won’t have any information on Abnormality. You will only have your eyes and the manual to guide you. Speculate which process will be most suitable for each Abnormality. After that, just pick and place your employee who is best suited for the job and wait for results. Also, you will have to gather information through giving out orders to your employees to ‘examine’ the creature. Proceed to the end of the observation to complete the Abnormality’s encyclopedia.\nAbnormality’s energy generation level depends on their conditions\nThis game is NOT a tycoon.\nAs mentioned before, Abnormality is a creature that should be handled with extreme alert. Some of them might doesn’t like the idea of humans keeping them locked up in chambers.  They will try to escape when they have a chance and when they do, they will destroy everything. Be it our employees or the facility.\nFurthermore, certain Abnormality can brainwash and corrupt our employees into their pawn. These ‘pawns’ can have a bad effect on other employees and might randomly attack the people around them. Also, they also bring down the other employees mentality level which might result in disobedience. You could get rid the them of course, but you should consider the fact that all the information and data regarding that employee will be deleted as well.\nOne disaster will cause another, and it will lead everything into chaos.\nIf you do not stop them instantly, the situation will get out of hand and fall int chaos. When this situation does occur, you will have to decide whether you will gather employees to recapture the Abnormality, or destroy some part of the facility with explosives to secure the company’s safety. “Do you have any wishes, administrator?”\nLobotomy corporation is divided into work procedure and the story mode. In work procedure, you will be doing your job as the company’s administrator managing the Abnormality and the energy generation level. A game’s story will follow right afterwards. You will have short conversation with many people such as Angela the AI and other employees. Furthermore, the player will be placed in a situation where they have to answer or ask questions. You can also discover secrets surrounding the company and the player.\nWhat you will discover in the story solely depends on the choices you make throughout the game. (There is also an infinite work procedure mode for the players who wants to concentrate only on the energy production.)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Project Moon","platforms":[{"id":0,"name":"PC"}]},{"id":8764,"name":"KAMI","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a0/9a06a58737f0053f2c591dcadc50d9f0.jpg","description":"KAMI is deceptively simple: fold out coloured paper to fill the screen in as few moves as possible.\nRelaxing and easy to pick up, you'll soon find yourself deep in contemplation to perfect each puzzle.\nCreated by State of Play, famous for their handcrafted aesthetic, KAMI has been created with real paper in an elegant Japanese theme.\nKAMI is tactile, engaging and stunning to look at.\n► 63 unique puzzles!\n► Premium Puzzles and Hints included (A saving of up to $6 USD compared to the mobile version)\n► Beautiful handcrafted Japanese look, created using real paper\n► Calming and elegant soundtrack\n► Created by State of Play, creators of the award-winning papercraft game 'Lume'\nSXSW 2014 Gamer's Voice Award - Nominated\n***Best of 2013*** Mac App Store\n# 1 iOS Puzzle Game in 12 countries\n# 1 Game Mac App Store","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"State of Play Games","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":370129,"name":"NGU IDLE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/985/985d6fd1547f5bcc2061528b4463cfb3.jpg","description":"Everyone likes numbers that go up. Play NGU IDLE and get the exciting rush of so many numbers going up!\nThe #1 rated Idle Game on Kongregate is now headed its way to Steam! Experience the stupidity of NGU IDLE and get:\nRegular updates!\nAn RPG and inventory system!\nLoot drops for days!\nA really weird and funny story if you’re into that.\nA mix of Idle and Active play to satisfy everyone except really grumpy people.\nA Badly drawn Kitty!\nProgress Bars everywhere!\nA snarky, very active dev who is extremely attractive and not biased at all.\nAwful Puns.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"4G","platforms":[{"id":0,"name":"PC"}]},{"id":56123,"name":"Metroid Prime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c86/c86bc047ba949959a90fe24209d59439.jpg","description":"Metroid Prime is a first-person action-adventure video game developed by Retro Studios and Nintendo for the GameCube video game console. It was released in North America on November 17, 2002, and in Japan and Europe the following year. Metroid Prime is the fifth main installment in the Metroid series, and the first Metroid game to use 3D computer graphics. Because exploration takes precedence over combat, Nintendo classifies the game as a first-person adventure rather than a first-person shooter. On the same day as its North American release, Nintendo also released the Game Boy Advance game Metroid Fusion, marking the return of the Metroid series after an eight-year hiatus following Super Metroid (1994).\nMetroid Prime is the first of the three-part Prime storyline, which takes place between the original Metroid and Metroid II: Return of Samus. Like previous games in the series, Metroid Prime has a science fiction setting in which players control the bounty hunter Samus Aran. The story follows Samus as she battles the Space Pirates and their biological experiments on the planet Tallon IV. The game was a collaboration between Retro's staff in Austin, Texas, and Japanese Nintendo employees, including producer Shigeru Miyamoto, who suggested the project after visiting Retro's headquarters in 2000.\nThe game garnered critical praise and commercial success, selling more than a million units in North America alone. It won a number of Game of the Year awards, and it is considered by many critics and gamers to be one of the greatest video games ever made, remaining one of the highest-rated games on Metacritic. In 2009, an enhanced version was released for the Wii as a standalone game in Japan, and as part of the Metroid Prime Trilogy compilation internationally.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Retro Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"}]},{"id":40214,"name":"FIFA 11","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/91b/91bfbb800ff39bf57f3fb7c3f3bf1f6c.jpg","description":"The game (also known in North America as FIFA Soccer 11) is the 18th title in Electronic Arts' FIFA series of football video games.\n\n###Highlited new features of the game\nThe \"Two Button\" control system from the 2010 FIFA World Cup game moved to FIFA 11 now and that is ideal for new players to the series.  Next Gen Gameplay Engine - the PC version of the game now uses the same game engine as the PlayStation 3 and Xbox 360 versions. \n\n###Other important PC improvements\nnext-gen menu presentation,\n«Be a pro» seasons have been completely revamped,\na new practice arena,\na new 5 v 5 online team play,\nPro Club Championship,\nall new Virtual Pro game mode,\n360° dribbling is also featured along with LAN play,\nplayers can create their own tactics.\n\n###Main improvements for PS3 and Xbox 360\nit is possible now to play as a Goalkeeper (it is done also for PS2, PSP). It is combined with a new Goalkeeper Intelligence (for all Platforms) - more urgency, better perception, new animation technology for realistic positioning of the goalkeeper,\na new passing system, the accuracy of each pass is determined now by the gamer's own accuracy with the control pad, as well as by the situation and by the players on the pitch skills,\na new web-based application Creation Centre which allows to create material to download to their console and share with their friends.\n\"Be a Pro Mode\" and \"Manager Mode\" have been merged into the new «Career Mode» (it is done also for PS2, PSP, NDS),\nthe system of transfer of players has changed significantly - now it includes agreement between clubs, managers, coaches, with transparent rules designed to take into account the opinions of all and reach a balanced solution,\nYou can see the comments from the coach on the player growth screen\n\n###Main improvement for Wii\nPlayers can play five vs. five in the «Street football» mode. The traditional version 11 vs. 11 is also presents.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":24761,"name":"Mario Kart Wii","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68a/68a5dfb584c006bb3064b83881669aaf.jpg","description":"Drivers, start your engines!\n\nThe worldwide race is on with a whole new set of tricks, tracks, and\nways to play! Place first in Grand Prix circuits or clear skill-based\nmissions.\n\nWii Wheel: Transform your Wii Remote in to a steering wheel\nthat feels natural in anyone's hands. (Wii Wheel not included)\n\nNew Wheels and Courses: cruise brand-new tracks and arenas, or\nenjoy a blast from the past going fender-to-fender on one of the\nclassics. Tired of riding on four wheels? Bust out one of the all-new\nmotorbikes for special tricks and techniques.\n\nDrawing on circuits and battle arenas from every game in the series—not\nto mention tons of brand-new ones—the true king of the Mushroom Kingdom\nracing circuits will finally be crowned! Time to get turnin' and burnin'!\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"}]},{"id":19658,"name":"Cossacks: Back to War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27a/27a4335cf43724419cdaae9935d2e8ff.jpg","description":"To stand alone in war is extremely unpleasant. Extremely pleasant, on the other hand, is the stand-alone version Cossacks: Back to War. Containing all of the gameplay features of Cossacks: European Wars and Cossacks: The Art of War, this is a complete care package for all current and future Cossacks fans. This add-on contains 100 captivating missions taking place between the 16th and 18th centuries. In addition, two new nations, Switzerland and Hungary, are included. These countries waged war in the late Middle Ages and essentially influenced the development of European military strategies. This addition causes the second add-on of Cossacks to pass the threshold of allowed gaming fun.\nFeatures:\nThrilling real-time strategy game with historical background.\nFascinating 3D landscapes.\nPlay takes place in Europe between the 16th and 18th centuries.\nStand-alone game, other Cossacks games not required to play.\nA total of 20 different European nations to command.\n100 new single missions.\n2 new nations: Switzerland and Hungary with a total of 8 new units.\nSpectacular real-time battles with up to 8,000 units.\n4 different difficulty levels.\n1 new camel riding unit for Algeria and Turkey: Bedouin.\nThis version with low system requirements is adapted for comfortable play on any hardware from low-end computers, laptops and netbooks, to high-end PCs (with Windows Vista/7).\nAd-Hoc multiplayer play (offline mode).\nInfinite AI skirmishes on randomly generated maps.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":6929,"name":"Shadowgate","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e29/e29ab7e5817eb271dd1ca54f31e7d9ec.jpeg","description":"Shadowgate is one of the most well-known and beloved point-and-click adventure titles in gaming history. As one of the original titles in the popular MacVenture series that went on to be celebrated on the NES, GBC, and Nintendo 64, Shadowgate quickly endeared players with its fantastic atmospheric soundtrack, perilous locations to progress through, countless puzzles to solve, and more ways to gruesomely die than gamers previously thought possible. Thrust into the role of \"The Seed of Prophecy,\" players travel deep into the living castle, in hopes of defeating the evil that dwells within – the dreaded Warlock Lord. \n\nNow, nearly 30 years after the original version haunted Mac and NES gamers, the original development team behind that timeless classic is back with a full re-imagining of the original Shadowgate. Much more than a port, the team at Zojoi has painstakingly redesigned the game from the ground up, adding in tons of new mind-bending puzzles, lots of new rooms with stunning hand-painted 2D graphical detail, and more objects to interact with and help you along your quest. \n\nDecide how YOU want to play this new, re-imagined Shadowgate! Want the modern adventure experience? Use the wheel-based icon command system. Want the retro experience? Employ the Classic command system and turn on the retro graphics, soundtrack, text box, and room transitions. Want a more cinematic experience? Switch to Immersive mode by auto-hiding the UI and using customizable hotkeys to explore the castle. Or mix and match the options to satisfy your play style. In Shadowgate, there are plenty of new features and fun throwbacks to the original version to satisfy veteran adventurers and newcomers alike! \n\nKey Features:\n- Customized UI: Play the way you want! Use modern wheel-based icon commands, classic on-screen commands, or jump into Immersive mode to auto-hide the UI elements. Create key binds, lock commands and keys, and more. \n- The Dread Pumpkin Quest: A new mini-quest, find and free the Dread Pumpkin!\n- First Person Adventuring: Utilize your inventory, mapping system, and intuitive UI to complete your quest. \n- Dangerous Dungeons: Tons of beautifully illustrated rooms featuring both new and familiar locations, offering a new gameplay experiences. \n- Mind-bending Puzzles: Lots of new and updated puzzles that seamlessly expand on the original game. \n- Difficulty Levels: Four different difficulty levels (from the novice to expert) that actually change the gameplay experience and puzzle structure. For the ultimate challenge, try Ironman mode that disables saves and requires players to finish the game in one try.\n- Retro Mode: Play the game like it’s 1989! Toggle on pixelated graphics, listen to Hiroyuki Masuno’s original NES chip tunes, move between rooms with NES transitions, and enjoy the text in retro format. \n- Storytelling: Shadowgate features dramatic cut-scenes and all the same great storytelling you expect from the original creators. \n- Cinematic Score: A digitally-orchestrated, dynamic soundtrack that changes with gameplay by composer Rich Douglas. \n- Soundscapes: A complete atmospheric and puzzle-based sound design featuring hundreds of sound effects.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Abstraction Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":428053,"name":"Rain on Your Parade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c25/c250e79b1da4b090da77dc25abb1e38b.jpg","description":"A slapstick comedy game where you play as a mischievous Cloud and rain on everyone's parade. Numerous levels with unique objectives to test your skills and deduction, each getting progressively more ridiculous. Unlock new abilities and discovering new mechanics going far beyond just raining on people! Go back and replay older levels to find new secrets and improve your score.\nRain, Thunder, Tornado, Meteor showers, and more\nRuining weddings\nRaising an army of the undead\nDrawing your own unique face and wearing hats\nCloud invading your favorite games and shows\nOne (1) angry sun\nWait this doesn't look like a cloud game, what is th-\nWHAT ARE YOU DOING TO THOSE POOR DINOSAURS!?\nNo, Cloudy, STAPH!\nThat’s not very nice :(\nIf you're a fan of Untitled Goose Game, Donut County, or Goat Simulator, this will be right up your alley!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Unbound Creations","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":258363,"name":"Blade and Sorcery","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a05/a0563d1dbdb418169244372e858df01f.jpg","description":"The era of the VR weightless, wiggle-sword combat is over. Blade & Sorcery is a medieval fantasy sandbox like no other, focusing on melee, ranged and magic combat that fully utilizes a unique and realistic physics driven interaction and combat system.\nBuilt exclusively for VR, collisions are dictated by fine hitboxes, objects have weight and follow the laws of physics, creatures have full body physics and presence, and blades can be used to penetrate soft materials or deflect magic.\nIn Blade & Sorcery, the combat is limited only by your own creativity. Choose your weapon, choose your stance, choose your fighting style; Be the powerful warrior, ranger or sorcerer you always dreamed of becoming!","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"WarpFrog","platforms":[{"id":0,"name":"PC"}]},{"id":41012,"name":"Hard Reset","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f03/f030ebc8073430ce93a83c2d93ef163d.jpg","description":"Hard Reset is a 3D first-person shooter, featuring a cyberpunk setting inspired by many science fiction works. The game is modeled around the concepts of “old-school” shooters,  namely Quake and Doom series.\nThe game’s protagonist is James Fletcher, a hired gun for a mega-corporation of the future. Following his task to secure the city of Belphegor and its Sanctuary, the hero finds himself battling mechanical enemies. Moreover, discovering the mysteries surrounding the Sanctuary and himself. The hero has access to a limited supply of weapons, but, as always, he will have to do on his own, as different modifications for his arsenal will unlock throughout the game. Hard Reset features some RPG elements, as the player can enhance the protagonist’s skills, health and amount of ammunition.\nThe game’s story is told through comics between the levels, and the central location is the night-shrouded Belphegor. It always rains in a city full of neon lights, piles of mechanical rubbish and dark corners, which altogether adds to the grim dystopic setting of Hard Reset.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"PC"}]},{"id":17744,"name":"Sudeki","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f3/5f3e3b02d402653dd1d54e3871e92c08.jpg","description":"Sudeki, a world torn apart into light, shadow and dark. Rent asunder by deceit and betrayal, the land cries out for a peace that only four united heroes can bring.\nBeyond the protective walls of Illumina Castle lie miles of pastoral, rolling countryside, though once a serene landscape, the Aklorian forces have transformed the countryside into a charred battlefield. Simply passing through the region is unsafe, as travellers must be ever alert for ambushes.\nFour friends have joined together to aid their queen. Though destined to encounter ancient gods, primordial wonders, and marvellous inventions, foes and betrayal haunt their every step. A keen eye could prove vital, exposing essential clues. And as the companions make their way through darkness and light, they’ll discover that those two extremes have more in common than they once imagined...\nReal-time, bone-crunching combat with incredible spells and combos.Control any one of the four champions at any time, and skip between them at will.Customise each character's armour, weapons and spells and evolve new powerful attacks.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Climax Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":15032,"name":"Razortron 2000","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a75/a757bb0da7f530357a3a5678a197afcd.jpg","description":"More Games\nAbout the Game\nRAZORTRON 2000 is a top down endless racer. Turn on your radio, try to beat your score by running as fast as you can on randomly generated tracks before running out of gas, avoiding cars and side barriers.\nPerfect to play when you are in a queue for another game or when you want to get your name on the top of a leaderboards. This is a small, re-playable game, the objectives included are to beat your best score, time or to get on the leaderboards, unlock cars and get achievements.\nEnjoy lots of unlockable cars, each one has it's own color scheme and ａｅｓｔｈｅｔｉｃ.\nBased on oldschool top down racing games such as Road Fighter, Spyhunter and Bump n Jump.\nGet as far as you can avoiding traffic, walls and running out of gas.\nRun on difficult increasing randomly generated tracks.\nYou'll get bigger scores if you dont release the gas or hit the brakes, for every 10 cars you pass on the top speed your combo multiplier will get bigger.\nYour gas are constantly decreasing, so stay sharp for gas stations.\nAddictive coin eater arcade experience.\nGreat to play both with joystick or keyboard.\nRetro futuristic pixel art visuals.\n10 unlockable cars (each one with a different color scheme).\nａｅｓｔｈｅｔｉｃ.\nDifficult increasing randomly generated tracks.\n10 oldschool tracks from multiples artists (free soundtrack).\nSteam Leaderboards, achievements, cloud save and trading cards.\n4 different languages (English, Português, Deutsche and pусский).\nHi, my name is Paulo and I'm the solo indie game dev behind NukGames, focused in bringing small arcade games with good replayabillity, classic mechanics with modern twists and smooth gameplay to Steam.\nThanks for reading, I hope you enjoy Razortron 2000,\nPaulo Brunassi - NukGames","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":13892,"name":"KARAKARA","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ffb/ffb6b27d2b84f40ff86428a6e5d7111d.jpg","description":"Let us live\non this land so arid.\nKARAKARA. It is the sound of aridity. It is the sound of dry asphalt and sandy winds. It is the sound of relentless sunshine, as well as the sound of a withering race.\nThe \"Age of Dusk.\" It is a time of senescence for the human species, during which hybrids known as the \"Others\"—those who are human, yet not—exist in great numbers. On the windswept barrens of a land without moisture, a small gathering of people make their living in a world they no longer know. Down a stretch of highway and far from the heart of the town are two such people who run a small diner. To them, the circumstances that reshaped their world is of far less concern than the number of lunch boxes they can load into their delivery vehicle. After all, leaving customers hungry is not good for business, and business keeps them fed. Day after day, they occupy themselves with the endless work of their store. However, the comfortable monotony of their daily lives is turned on its head when they discover a large suitcase by the roadside on their way home from deliveries. Lying on the suitcase, unmoving, is a young girl with pink hair...\nThough parched, they keep each other company,\nand while hollow, they fill each other's voids.\nSo shall they live\non this land so arid.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"calme","platforms":[{"id":0,"name":"PC"}]},{"id":12240,"name":"The Path","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f85/f85ebdead29da34640cf5db372cf06e6.jpg","description":"There is one rule in the game. And it needs to be broken.\nThere is one goal. And when you attain it, you die.\nSix sisters live in an apartment in the city. One by one their mother sends them on an errand to their grandmother, who is sick and bedridden. The teenagers are instructed to go to grandmother's house deep in the forest and, by all means, to stay on the path! Wolves are hiding in the woods, just waiting for little girls to stray.\nBut young women are not exactly known for their obedience, are they? Will they be able to resist the temptations of the forest? Will they stay clear of danger? Can they prevent the ancient tale from being retold?\nThe Path is a game about growing, about changing, about making choices, about accepting the consequences of these choices. A game about playing, and failing, about embracing life, perhaps by accepting death.\nKey Features:\nThe Path is a short horror game inspired by older versions of Little Red Riding hood, set in modern day. The Path offers an atmospheric experience of exploration, discovery and introspection through a unique form of gameplay, designed to immerse you deeply into its dark themes. Every interaction in the game expresses an aspect of the narrative. The six protagonists each have their own age and personality and allow the player to live through the tale in different ways. Most of the story, however, relies on your active imagination.\nThe Path is designed with accessibility in mind. There are no ticking clocks or monsters to defeat. No hard puzzles will ever halt your progress. Most activities in the game are entirely optional and voluntary. The player has all the freedom in the world to explore and experience.\n\nWhile The Path does not contain any graphic violence or sexuality, it does allude to these themes. The overall melancholy mood of the game and the potentially unsettling course of events, make The Path unsuitable for children. Despite of its origins in fairy tales, The Path is decidedly a game for the mature mind.\nThe game features a complete realtime 3D environment that can be explored through third person navigation. The characters in this virtual world, including the player's avatars, are governed by a form of artificial intelligence that gives them some autonomy. As a result, nobody knows exactly what you will encounter on your journeys.\nNext to the multi-layered stylized graphics, The Path features a continuous soundtrack composed by goth rock diva Jarboe (ex-Swans). In fact, there are hardly any sound effects in the game. Instead the music is continuously changing according to what is happening in the game. Like the behaviours of the characters, the music too is never exactly the same twice.\nFor a satisfying experience, it takes about 6 hours to complete the game.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Tale of Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9820,"name":"20XX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/000/0007accc8ea02abcc8b3d0271da5eb3a.jpg","description":"If you like roguelikes or Mega Man, 20XX is for you!\n20XX is a roguelike action platformer that you can play with a friend. Jump and shoot your way through ever-changing levels, collect awesome new powers, and battle mighty bosses in the name of saving the human race maybe!\n20XX also features full co-op. Play with a friend on the couch or over the interwebs!\n20XX supports 1-2 players locally or online via Steam. (Online play is 90% stable at this time.)\nFeatures:\nCrisp, precise controls - do exactly what you want your character to!\nOver 100 mighty powerups to collect!\nTons of different play modes and optional difficulty modifiers!\nSeeded Daily and Weekly Challenges!\nAll gameplay features available in both single player and co-op! (online or local)\nRoguelike Elements:\nRandom levels: each time you play 20XX, the stages you play through will be brand new!\nPermanent death: each 20XX playthrough is a self-contained life! Death sends you back to HQ, where you can buy powerful upgrades for future runs. (There's also a Reverent Mode where you get three lives to make it through the game instead of one.)\nPersistent Upgrades: as you play 20XX, you'll earn Soul Chips, which unlock powerful Permanent Upgrades and expand the pool of items that can you can find as you play!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fire Hose Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":8595,"name":"The Detail","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05f/05f36019d01b87de426fbd878d7a967e.jpeg","description":"The Detail, a crime noir adventure in a modern American city.\nControlling the actions of a bitter veteran detective investigating a brutal gangland murder and a reformed criminal trying to protect his family, the player is forced to make tough choices and deal with the resulting consequences of those moral dilemmas. The gameplay focuses on branching narrative mixed with interactive comics, and is completed by a professional audio track.\nThe Detail combines the emotional impact of Telltale Games' The Walking Dead with the themes of a realistic crime drama like HBO's The Wire, delivered with our own unique visual style inspired heavily by graphic novels. This is city where cases matter, clearance rates matter, and on a good day even justice matters.\nThe season begins with: Episode 1 – Where the Dead LieFeatures\nCharacter-driven experience with multiple playable characters\nBranching storyline influenced by the player's choices\nMature themes for mature players\nEthical and moral challenges\nPoint n' click gameplay, with a modern mix of adventure game & interactive comic\nNow including The Detail Episode 1: Artbook and Official Soundtrack.\nThey are placed in your THE DETAIL folder in the Steam Directory: ...Steam\\steamapps\\common\\The Detail\\","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rival Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4026,"name":"Soul Sacrifice","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b4/1b40874f5836d5aa578dbbdbae052b7b.jpg","description":"What would you sacrifice for ultimate power?\nPrepare yourself for a brutal combat experience where every decision made will have consequential results. Take on the role of a slave who is about to be sacrificed stumbles upon a forbidden book that allows its readers to relive battles between sorcerers and monsters of the past. In order to use the magic during fierce battles, the player must be willing to make a sacrifice – ranging from personal belongings, a limb, or even a life.\n- Reality blended experience where players must sacrifice parts of themselves to obtain great power\n- Freeform character development as a player’s decision would affect the characters abilities and visual form\n- The first action co-op RPG experience that takes full advantage of PS Vita technical capabilities\n1 player(s)\n100KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n©2013 Sony Computer Entertainment Inc. Soul Sacrifice is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":51174,"name":"Leisure Suit Larry 2 Looking For Love (In Several Wrong Places)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ee/6ee4e4960e9b612a0d39c8fcf10c249a.jpg","description":"Leisure Suit Larry Goes Looking for Love (In Several Wrong Places) is the second game in Al Lowe's Leisure Suit Larry series. Continuing the plot of the previous game, the swinging single Larry Laffer has finally found his true love and is happily living with her. Right? Wrong!.. Because Larry is mercilessly thrown out by his great love and is left all alone, penniless, and womanless, in Los Angeles. Accidentally, Larry comes into contact with KGB agents who will pursue him all over the globe from now on. And there is also the evil doctor Noontonyt plotting evil schemes on a remote tropical island... Looks like Larry will have to forget about his women-related problems for now... or is it so?\n-    The second game in the series introduces an improved engine (allowing for full-screen graphics and mouse control for movement).\n-    The number of ways to die has increased, danger awaiting Larry in most places he visits.\n-    Play as one of gaming’s longest lasting legends: Leisure Suit Larry!\n-    Al Lowe’s famously risque humor and bodacious babes that are waiting to “work out” with you!","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Commodore / Amiga"}]},{"id":15728,"name":"Allods Online RU","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7d/d7d7e575c23721be8e5225703f4612e3.jpg","description":"Start your Astral journey and fight at the arena along with more than 10 million players from all over the world! Gather your best friends or join one of the top guilds to meet faithful companions, who will stand by you through thick and thin! Whether you are an experienced player or a beginner adventurer, in the world of Sarnaut you will find yourself a great company!\nGame features:\nFascinating atmosphere of the world of two rivaling factions: industrial Empire and fantasy League\nShip battles and unique Astral adventures\nPersonal achievements and guild ratings\nExciting raids and challenging bosses\nVarious PvP activities, including from 2 to 48 participants\nAutomatic group assembling in PvP and PvE activities\nRandom quest generation system","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mail.ru Games","platforms":[{"id":0,"name":"PC"}]},{"id":461649,"name":"Hyper Scape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47c/47c4398d9f910210ecb2114f1f82a2bf.jpg","description":"Hyper Scape is an urban futuristic free-to-play Battle Royale where 100 Contenders engage in FPS close-quarters and fast-paced matches to become the next global superstar.\n\nURBAN BATTLE ROYALE\n\nFight your way through the 7 unique districts of Neo Arcadia, a virtual city featuring imposing landmarks that bring verticality to the next level. From sky-scraping towers to open plazas, from streets to rooftops, Neo Arcadia will push you to constantly adapt to your surroundings.\n\nCLOSE-QUARTERS CITY COMBAT\n\nHyper Scape is a brand new and intense First-Person multiplayer game that lets you define your playstyle to dominate the battleground. Dive into tense and vertical matches, where you (double) jump from streets to rooftops using unique weapons and unleashing powerful Hacks that bend the rules to your advantage.\n\nA FRESH TAKE ON BATTLE ROYALE\n\nLearn to avoid the Blight that progressively dissolves Neo Arcadia’s districts in varied patterns throughout each match. Maximize the Effects Cards played by the AI Game Master during the match, changing the game on the fly for all contenders. If you are skilled enough to make it to the final remaining players, you will enter the Showdown where you can choose your path to victory: will you eliminate all opposition or choose a more tactical approach and go for the Crown? Intense, surprising and spectacular, Hyper Scape brings Battle Royale to new heights.\n\nA FOREVER EVOLVING GAME\n\nMap changes, a steady flow of new customization options, thrilling gameplay opportunities… Be ready for an ever-evolving experience following your favorite 2054 Contenders in their quest to unveil the mysteries and secrets of the Hyper Scape.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":21876,"name":"Planescape: Torment","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c7/1c761e6bb9f9d47e48cec4484c7186bb.jpg","description":"Reviewers say:\n\"Planescape: Torment is a wonderful game, and its Enhanced Edition is a splendid, unobtrusive, beautifying update.\"\n-Geek & Sundry\n\"Planescape: Torment still stands tall as a landmark masterpiece that can continue to age gracefully, now on your phone or tablet\"\n-Touch Arcade\n\"Planescape: Torment is a timeless classic, the Enhanced Edition just makes it better\"\n-Bleeding Cool\nUncover secrets of past lives in this story-rich, tactical roleplaying game set in Sigil, a dark fantasy city at the heart of the Dungeons & Dragons multiverse. Explore the planes, survive combat alongside a party of bizarre companions, and solve puzzles unlike any ever seen in the genre.\nThe original Planescape: Torment was released in 1999 to widespread critical acclaim. It won RPG of the Year from multiple outlets for its unconventional story, characters, and amazing soundtrack. Since then, millions of Planescape: Torment fans have enjoyed exploring the strange and dangerous city of Sigil and surrounding planes.\nDiscover an incredibly rich story and a unique setting unlike anything else in fantasy. Defeat strange and alien creatures, engage in rich dialogue, and explore the dark and dangerous Planescape setting in this 50+ hour RPG classic.\nThis is Planescape: Torment like you’ve never seen before.\nStory:\n\"What can change the nature of a man?\"\nYou are The Nameless One, a hulking figure covered in scars and tattoos collected over the course of countless lives—none of which you can remember, but are now coming back to haunt you. You are prodded awake by Morte, a floating skull and keeper of secrets, to embark on an adventure taking the Nameless One from the dirty streets of Sigil into the mysterious Outer Planes and even into the depths of Hell itself.\nIn your search for answers, you'll find companions matching the bizarre nature of the planes: a chaste succubus who can kill with a kiss, a confused crossbow-wielding cube, a suit of armor animated by a spirit demanding JUSTICE, and more. With these companions and others at The Nameless One’s side, you will explore worlds in search of answers, all to discover that some destinies cannot be escaped and some memories cost more than an immortal should be willing to pay.\nBeamdog’s Enhanced Edition titles are designed for 7 inch and larger tablets. We recommend this title to iPhone players using the iPhone 7 or iPhone 7 Plus.\nFeatures\n-Enhanced Planescape: Chris Avellone, Lead Designer on Planescape Torment, has partnered with Beamdog to curate gameplay updates, bug fixes, and enhancements to best capture his original vision for the game.\n-The Planes Await: Planescape is a setting you've never experienced before, filled with strange magics, bizarre adversaries, and Dungeons & Dragons locations from across the multiverse.\n-Conversations to Remember: Encounter personable items, philosophic undead, and rat hiveminds while walking the planes with the strangest collection of allies ever seen in an RPG.\n-Pick Your Path: Character creation is just the beginning. The Nameless One can change his class, alignment, and even gain new abilities based on your choices.\n-Remastered Music: The full Planescape: Torment soundtrack has been remastered in-game to add more depth to Sigil and the multiverse.\n-New Tablet Interface, Same Planescape Feel: Planescape: Torment: Enhanced Edition has been designed with tablets in mind. Open and close side menus with a touch, select dialog options with handy conversation buttons, and make tactical decisions with a brand-new action indicator.\n-A Planescape For Today: Modern features such as tab highlighting, area zooming, combat log, quickloot, and more!\n-Play It Your Way: Enable Enhanced Edition features as you desire or turn them off to experience Planescape: Torment in its original glory.\n- Planescape: Torment: Enhanced Edition is available in English, French, Polish, German, and Korean. Note: Korean translations are text only. Voice-overs are played in English.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20321,"name":"PulseCharge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe1/fe13ab450daa5e0e6579bf545cf77d0c.jpg","description":"PulseCharge is a 2D platforming game with an emphasis on speed and exploration.\nAbsorb enemy attacks to charge up your own attacks! You must absorb, dodge and weave your way through intense gauntlets and defeat your evil self.\nDo you have the heart for such a challenge?\nWhat's in store: Intense levels that will test your platforming and speedrunning prowess.\nSoothing Soundtrack.\nGamepad support, rebindable keys and resolution options.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frozenmark Games","platforms":[{"id":0,"name":"PC"}]}]