[{"id":11097,"name":"Peregrin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/518/5185c2c64521edd426568632f05c7099.jpg","description":"Peregrin is a story puzzle game, combining myth, fantasy and sci-fi.\nPeregrin’s story is a moving take on the struggle to overcome both personal and collective loss – beautifully realised in an epic mythical style.\nTake control of Abi as she leaves her scavenger tribe to embark upon an epic journey into the wastelands of the divide. Mysterious monoliths and strange artefacts await her there, revealing the secrets of these fallen lands.\nPeregrin's absorbing gameplay revolves around the use of Abi's arcane powers. Use them to take temporary control of the creatures you encounter - from simple animals to The Divide's hostile guardians. Turn the unique abilities of each creature to your advantage in solving puzzles and surviving battles.\nA rich and immersive narrative, fully voiced in English.\n5 chapters comprising over 60 visually stunning scenes.\nIntuitive and rewarding gameplay featuring the unique creature possession mechanic.\nBespoke art style inspired by canonical sci-fi artists such as John Harris and Moebius.\nCustom composed musical score for a fully cinematic experience.\nFull controller support.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Domino Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10694,"name":"Grass Cutter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df7/df70b93b9602c205a5d939900c931ec2.jpg","description":"GAME OVERVIEW:\nGrass Cutter is a game with rare and unique mechanics that requires logical thinking and quick reaction speeds. You have to mow the lawns at all the sites. At first it seems quite simple ... Right? But it's not! The game contains a real challenge that not every player can manage.\nAlmost every level is a small puzzle. Solve it and you will be able to find the right solution! And this is the easiest part of the game.\nEach lawn mower in the game has an energy reserve that is constantly running out. If you forget about the energy, then boom, you've lost! If you turn in the wrong direction when you are near dangerous obstacles, then boom, you've lost a part of the valuable energy reserve or you lose! If you come into contact with dangerous enemies or come under their influence, then boom again, you lose!\nIn addition to the challenges in the game, there are many rewards and bonuses that will keep you interested and make the gameplay even more fun!\nAnd this is just the tip of the iceberg, the most interesting things are in the game itself.\nWARNING: The game requires nerves of steel, quick reactions and concentration!\nTHE GAME'S PLOT:\nThe well-known, innovative company Grass Xtract, which specializes in plant breeding, has been developing new, beautiful and thick grass for lawns under the leadership of its CEO Michael Green.\nUnder pressure from management, the scientists developing grass seed did not have time to conduct all the laboratory testing before the company decided to release their product. To simplify the grass breeding and speed up the process, a drug was invented called leavenatine. Without enough time to calculate the optimum amount needed for the process to continue stably, the scientists made a mistake and added too much of the drug.\nAll this adversely affected the DNA of the grass. It began to mutate, leading to the birth of real, live monsters -- straight out of the lawn. The monsters are threatening the rule of law and the life of humanity!\nThey can not be set on fire or poisoned with acid because the components released into the environment can infect other plants nearby.\nThere is only one solution. All the lawns of Grass Xtract clients must be mowed.\nAre you ready to face danger and become the hero who will save the world?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nikolai Usachev","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3665,"name":"Ratchet & Clank Future: Tools of Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfc/bfcaa686be864a4e8b62043c9ebe71bc.jpg","description":"IS THIS THE END FOR RATCHET?\nPossibly not… but when evil Emperor Tachyon rocks up with a plan to wipe out every Lombax in the galaxy, things sure start to look ugly for our large-eared hero. Hunted by a swarming robot army, Ratchet and Clank must race across the universe to dig up some answers or face extinction. Permanently.\n• Swat killer robots on the go with your very own sharp-shooting starship.\n• Lob disco balls at your foes – they just can’t resist getting down to those funky rhythms.\n• Zap enemies with a Transmorpher to turn them into happy little penguins.\n• Explore wild and mysterious planets from the far reaches of the galaxy.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\nThis item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account.  Please see software description for device compatibility.\n©2007 Sony Computer Entertainment America LLC. Ratchet and Clank and Ratchet and Clank Future: Tools of Destruction are trademarks of Sony Computer Entertainment America LLC.  Developed by Insomniac Games.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3006,"name":"Urban Rivals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08b/08b3515778926fa37f85bdec3ff1a91e.jpeg","description":"Join Urban Rivals, the famous card game with more than 35 million players\nRoll up your sleeves and lay down your cards! Urban Rival is a truly original, free, collectible card game. It is a game of skill and strategy that allows you to create your own gang and challenge other players in fast and furious fighting. The games are simple but intense and in just a few minutes you can control the whole of Clint City by putting your Pillz, Fury and bluffing skills to good use!\nBUILD THE ULTIMATE DECK\n- 1,500 collectible cards to be won or purchased, divided into 27 colorful clans with many more to come.\n- Hundreds of combinations of abilities and powers to ensure each deck is truly unique!\n- Trade with other fighters from all over the world and create your dream team.\nPLAY WHEN YOU WANT, WHERE YOU WANT\n- Your entire collection is connected to your Urban Rivals account, so you can seamlessly switch between your computer, phone and tablet.\n- Fight in duels lasting less than four minutes to really get your adrenaline pumping!\n- Every day brings new and exciting challenges and bonuses so you’ll never get bored!\nFIGHT AND EVOLVE\n- Evolve your characters to unlock their next level and more deadly powers.\n- Release the power of various spells, Pillz, and Fury, and make good use of the different clan synergies to overcome your enemies.\nPVP GAME MODES FOR EVERYONE\n- Join our competitive Coliseum, Tournament and EFC modes and test your skills against the world’s best players.\n- Rise through the ranks, take part in events and PVP tournaments and enjoy a sense of excitement and honor.\n- Play casually with friends and follow those competing in the Training and Free Fight modes!\nWE ARE CELEBRATING 10 YEARS OF SUCCESS AND PROGRESS\n- Dive into a fun and complete world that is already a decade old!\n- Immerse yourself in nerve-racking battles and revel in the awe inspiring, hand-drawn illustrations.\n- Be blown away by our amazing graphics and special effects.\n- What’s your strategy going to be? Whether this is your first card game or whether you’re an old-hand at TCGs, the thrill of Urban Rivals is sure to suck you in. Challenge your enemies and show them just what you can do!\nJOIN THE URBAN RIVALS COMMUNITY","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Acute Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":427621,"name":"Talvisota - Winter War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bd7/bd7d62d01cad5c037c599ae88f285c21.jpg","description":"NOTICE: This Mod requires a valid installation of Rising Storm 2: Vietnam.\nTalvisota: Winter War is a community created full conversion mod, utilizing the majority of core gameplay mechanics from Rising Storm 2: Vietnam to explore an entirely different theater of war not often seen in video games.\nTo create a battlefield that feels different from the base game a lot of work has gone into both brand-new content and features, as well as aspects that veterans of the series will immediately recognize:FEATURES - WEAPONS\nTalvisota features a widespread arsenal of period-accurate Soviet and Finnish weaponry of all types, for example:\nBRAND-NEW WEAPONS\nSuomi KP/-31 SMG\nL1935 Lahti Pistol\nLahti-Saloranta M/26 LMG\n\"Kasapanos\" Satchel Charge\nPanssarimiina M/39 Anti-Tank Mine\nDyakonov Rifle Grenade\nREMASTERED CLASSICS\nSVT Semi-Auto Rifle\nNagant M1895 Revolver\nF1 Grenade\nMaxim HMGFEATURES - VEHICLES\nWhen the Soviets crossed the border, they brought with them an armada of different armored vehicles, from light transport tractors to gargantuan heavy tanks. This mod features the following:\nT-20 \"Komsomolets\" Armored Tractor\nT-26 Light Tank\nHT-130 Flamethrower Tank\nT-28 Medium Tank\nDrastically different from the helicopters of Rising Storm 2, these behemoths require players to work together to properly and effectively utilize. Single crewmen cannot drive and operate the turret at the same time!\nMeanwhile Finnish players have a variety of handheld anti-tank weapons and traps, including the renowned Molotov Cocktail. To keep up with the mechanized Soviet transports, Finnish soldiers are issued Skis that can be used to quickly cross open terrain.FEATURES - MAPS\nThe mod launches with 11 unique brand-new maps by community authors:\nAittojoki\nBoreal\nKollaa River\nKuhmo Outskirts\nMannerheim Line\nMantsinsaari Island\nRaate Road\nSalla\nSumma\nSuomussalmi\nTolvajarviAND MORE!\nFull voice acting for both teams\nAll-new ambient music\nHistorically accurate character customization options\nNew commander abilities & fire support","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Talvisota Team","platforms":[{"id":0,"name":"PC"}]},{"id":378578,"name":"Grand Theft Auto IV: Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e59/e59cc96f38cc93af5a396173878018d7.jpg","description":"<strong>PLEASE NOTE:  Microsoft no longer supports creating Games for Windows-LIVE accounts within Grand Theft Auto IV. You can create an account through account.xbox.com and then log into your account in game. </strong><br/><br/>This standalone retail title spans three distinct stories, interwoven to create one of the most unique and engaging single-player experiences of this generation.<br/><br/>\t\t\t\t\t\t\t\t\t\t\t\tThis definitive Grand Theft Auto bundle boasts hundreds of hours of single-player gameplay; a full suite of open-world multiplayer game types limited only by players’ creativity; dozens of eclectic radio stations with hours of music and original dialogue","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rockstar Toronto","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":304186,"name":"Marvel's Iron Man VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca6/ca6783ed6fb7e42e4e9c164bd5813e78.jpg","description":"Don the PlayStation VR headset* to suit up as the Armored Avenger in an original Iron Man adventure! Using two PlayStation®Move motion controllers** fire up Iron Man’s Repulsor Jets and blast into the skies with an arsenal of iconic Iron Man weapons at your fingertips. Face off against Iron Man’s greatest foes in high stakes, action-packed battles. Upgrade tech in Tony Stark’s garage to customize Iron Man’s sleek suit and awesome abilities.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Camouflaj","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":251569,"name":"Nonogram - Master's Legacy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b3/4b35670e1bffef6e10308fbe7ca4fd5e.jpg","description":"**Master's Legacy - discover all beauty of Nonogram puzzles (multiple game modes, level sizes), master painting skills in Editor and share works with friends in Workshop. Become The Greatest.**\n\n_Nonograms, also known as Picross or Griddlers, are picture logic puzzles in which cells in a grid must be colored or left blank according to numbers at the side of the grid to reveal a hidden picture._ © Wiki\n\n# Master's Legacy\n\nExcellent attempt in a world of Nonogram/Picross puzzles. Galore of levels, multiple game modes along with level editor & workshop would never disappoint any puzzle fan.\n\n# Features\n\n- Totally free - Starter Pack, Community Levels & Level Editor are available for everybody.\n- Gorgeous Starter Pack - perfect 15 Nonogram levels to get you started and tease your brain for more adventure.\n- Multiple DLC's with different game modes and level styles.\n- Completed all levels? Don't worry! We have an endless list of user-made paintings, you'll never feel lonely.\n- You should love to paint, do you? Go on and try our awesome level editor (up to 100x100 size), show those impostors who is the Greatest One here!\n- Art design - clean and beautiful.\n- Relaxing ambient soundtracks will keep your mind sharp and focused.\n\n_Disclaimer - Master's Legacy is free version of The Greatest Painter. Master's Legacy's DLCs contains all puzzles from Nonogram - The Greatest Painter._","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Konstructors","platforms":[{"id":0,"name":"PC"}]},{"id":61600,"name":"Wild West Saga: Idle Tycoon","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/367/3672ba0fe3f7cf0fe4a02fd768fad3ef.jpg","description":"What else is there in the great ol’ West than dusty tumbleweeds, ya say? Big money, we say!\nThis is your chance to become the billion-dollar pioneer you’ve always dreamed of, and master the economy of the wondrous Wild West!\nEvery Area has its own lucrative upgradeable businesses, reaching up to 20 different ones. Open a Saloon, go Bounty Hunting, or become a Banker; there’s room for everyone in the Wild West!\n\nHire notorious outlaws to work for you, while you go on about your business (pun intended). Outlaws are not simple to manage though! So you gotta be careful who you trust with your businesses.\nCollect powerful Patent Cards to boost your businesses’ productivity! There are Patents categories: Plain, which is the most common one, Special, Unique, and Master, which is the rarest one.\nClick on Lulu Adloader, catch the Loot Bag, and play the Piano to instantly double your profits! Boosting time varies so strategize well each time you want to make them sway!\nExplore new Areas and Frontier Towns as you Go West! You can use our Map to navigate through more than 100 Towns, and complete the All Businesses Bonus Objectives for each one of them!\nStart your own Family & climb the Leaderboards! Give your friends your unique Family ID to help you grow and profit! Remember! Every time a child Goes West, you gain 20 Gold Coins!\nComplete Steam Achievements & Win more than 70 Trophies!\nYou ask and we deliver! Carry your progress with you at all times and play from anywhere, anytime. Supports: iOS, Android, Kongregate and Steam! Sweet, isn’t it?So, what you are you waitin’ for?!Giddy up, climb the ranks and become the wealthiest Pioneer in Wild West Saga, the idle game that will satisfy your rush for colossal profits!\n","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Tamasenco","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":54541,"name":"Toy Story 2: Buzz Lightyear to the Rescue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02e/02edfdc1fc9d89675952fb70b2113650.jpg","description":"Toy Story 2: Buzz Lightyear to the Rescue (also known as Disney Pixar's Action Game: Toy Story 2) is a platform game based on Pixar's computer animated movie Toy Story 2 and is the sequel to the first Toy Story video game. It was released for the Nintendo 64, PlayStation, Dreamcast, and Microsoft Windows in 1999 and 2000. A different version of the game, titled Toy Story 2, was released for the Game Boy Color on November 22, 1999. A sequel to the game was released 11 years later based on Toy Story 3. It would be re-released as PSOne Classic for PlayStation 3, PlayStation Vita and PlayStation Portable.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Game Boy Advance"}]},{"id":46657,"name":"OPUS: Rocket of Whispers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/371/37159b8281642af6611f30e1cee59c44.jpg","description":"STORYIn a post-apocalyptic world, The journey of John, the son of a rocket engineer, and Fei, a witch who awoke from twenty years of cryogenic sleep, is about to begin. Together, they must gather any materials they can find to build a rocket, and launch a space burial to return the lost souls the final resting place.GAMEPLAYA single-player third-person adventure. Players will explore and scavenge the snowy wasteland, and must overcome the treacherous weather and terrain. As players explore the world, the story behind the demise of their world will slowly unfold through the ruins and artifacts they find.FEATURES\nA WHOLE WORLD TO DISCOVER\nTravel through a post-apocalyptic winter filled with ruins and remnants. Slowly uncover the world, from a once thriving small town to the ruins of an exploded industrial area and much more.\nBUILD TO SURVIVE\nCraft tools that will help you reach greater distances, gather the materials you need and build a rocket by yourself.\nENJOY A HEARTWARMING STORY\nA game that focuses on story and emotion. The characters are lonely but filled with enthusiasm, and their interactions resulted in an unexpected turn of events. You’ll also meet lost souls who will tell you their unfulfilled wishes, and it is all up to you to help them or not.\nCOLLECT ITEMS FULL OF STORIES\nExplore the unknown for over 100 antiques and artifacts that are beautifully drawn with stories to match, and find out about their past.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SIGONO","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":45664,"name":"The Bard's Tale: Remastered and Resnarkled","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e5/6e5e2c6149ab6345a3a1cf4b6c732fbc.jpg","description":"You are the Bard, a selfish rogue weary of pointless sub-quests and rat-infested cellars. Through magical song you summon characters to join your quest for coin and cleavage!\r\nPrepare to immerse yourself in over 20-30 hours of adventure, featuring:\r\n• 50 enemy types (not counting bosses!)\r\n• A vast world to explore with towns, wild forests, rivers, castles, towers, secret dungeons, snowy mountains, caverns, haunted tombs and more\r\n• A full cast of bizarre NPC’s\r\n• Over a dozen special boss enemies to defeat\r\n• 16 magical characters to discover and then summon at will to aid you\r\n• Over 150 unique items of weaponry, armor, instruments, tokens, artifacts and loot!\r\n• More Song & Dance numbers than any other game, including a zombie dance-off!\r\n• Over 14 hours of outstanding voice-acting from top Hollywood talent, including Cary Elwes (The Princess Bride) as the Bard, and the inimitable Tony Jay as the Narrator\r\n1 player(s)\r\nAd Hoc Mode 2 Players\r\n10240KB Minimum\r\nTouchscreen\r\nRear Touch Pad\r\nDual Analog Sticks\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\r\nThe Bard's Tale © 2004-2017 inXile entertainment. All rights reserved.\r\nThe Bard's Tale is a trademark or registered trademark of inXile\r\nentertainment in certain countries and is a trademark or registered\r\ntrademark of Electronic Arts Inc. in certain other countries where\r\nit is used under license. inXile entertainment and the\r\ninXile logo are trademarks of inXile entertainment.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":43803,"name":"Bomb Defense","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29c/29caef8ad9b4c74ae35dfbd3fbbc4921.jpg","description":"You get a limited amount of money to buy traps, bombs, turrets and walls and place them in optimal positions to defend against enemies trying to harm your curious little kitten Mimi who, for some reason, keeps wandering into an array of sinister dungeons and graveyards.\nAny less than optimal defensive plan, or any small mistake in executing it will lead to the death of your kitten. Given your budget for a level, you need to carefully think what objects to buy and carefully plan the exact spots where you place each object.\nWhile on first glance it appears similar to tower defense games, this game requires a lot more thinking and certain puzzle-solving skills to keep your pesky little cat alive. A true test of your IQ if played with a normal or high difficulty setting. Or a strategy game that leaves a little bit of room for error with lower difficulty settings.\nOur other strategy game: Battles of Norghan","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mitorah Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":38948,"name":"Spore: Creepy & Cute Parts Pack","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/410/410dea8b86529e55ea99f8fbe6aefec0.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Maxis","platforms":[{"id":0,"name":"PC"}]},{"id":35354,"name":"The Movies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a3/1a3bb2272059258e3056bfe71cba73ec.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"PC"}]},{"id":25512,"name":"Guitar Hero: Aerosmith","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8df/8df8e346932cb391d8e6ebef533b7be7.jpg","description":"Fire up the fret board, crank the amp to 11 and get ready to rock this\nway with Activision's Guitar Hero: Aerosmith.\n\nGuitar Hero: Aerosmith is the first game built around the legendary\nmusic of America's greatest rock n' roll band: Steven Tyler, Joe Perry,\nBrad Whitford, Tom Hamilton and Joey Kramer. Fans will experience\nAerosmith's GRAMMY award winning career, from their first gig to\nbecoming rock royalty, in a way that no other entertainment vehicle\noffers.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Neversoft Entertainment","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"}]},{"id":25021,"name":"Pokémon Mystery Dungeon: Blue Rescue Team","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f6/3f6d7313dd1913a17e7ca50ea7528a2c.jpg","description":"What if you woke up one day, and you were a Pokémon? What if all of the\nsudden you find yourself in a NEW world, where you can speak and\ninteract with other Pokémon? The adventure begins when you and your\npartner Pokémon set out on rescue missions in a world ravaged by natural\ndisasters. But what is your true purpose and destiny in this Pokémon\nworld? That's the REAL mystery …\n\nFeatures\n\nAn exciting and dramatic story pulls you into an involving world of\nPokémon never seen before\n\nUse various moves and items to complete your rescue missions and\nincrease your rescue team's reputation\n\nMeet more than 380 Pokémon on your journey. Become friends with them\nand call upon them for help whenever you need to\n\nStrategic battles enhance the adventure as you explore deep dungeons\nand towering mountains\n\nThe contents of Pokémon Mystery Dungeon Blue Rescue Team and Red Rescue\nTeam are about the same, but there are a few differences. There are\nseveral DS-specific features of Pokémon Mystery Dungeon that you'll be\nable to enjoy only when playing Blue Rescue Team, such as a dual-screen\nview, touch-screen control and wireless connectivity. So, if you've been\nwaiting to pick up a Nintendo DS, there's no better time than right now.\n\nYou come to the rescue!\nMany Pokémon are in danger as natural\ndisasters are devastating the land, and it's up to you, in your new\nPokémon body, to form a rescue team. To find the truth behind all these\ndisasters, you will need to explore one dank dungeon after the next.\n\nSince there are no trainers around, you will need to lead your team in\nbattles, but your team members aren't as apt to follow your orders as\nthey would a trainers. No trainers means no Pokéballs. So, to get other\nPokémon to join your rescue team, you'll need to find ways to coerce\nPokémon to join your side. The more rescues you make, the better your\nRescue Team ranking. Your ranking can influence whether Pokémon agree to\njoin your group or not.\n\nJourney in the dungeon\nDungeons are unique. Every time you\nenter a dungeon, it will have a new, randomly generated map. Item\nlocations, stairs and enemies will change their location each time you\nexplore. Don't bother going back and sketching where you found a rare\nPokémon: It won't be there the next time you explore.\n\nIf you fail in a dungeon, there are serious consequences. You'll lose\nall your money, many of your items and experience you've gained during\nyour expedition. But don't worry -- just as other Pokémon have called\nfor your help, you can call for help from other Pokémon Mystery Dungeon\nplayers. They can then go into the dungeon where you met your match to\nrescue your party, allowing you to salvage the money, items and\nexperience you would have lost.\n\nThe game system you're using determines your options for how to connect\nthe game versions. DS gamers can use the wireless mode; GBA users must\nuse the GBA Game Link Cable. You can always write down and exchange\nWonder Mail using a password system as well.\n\nThis is a new kind of Pokémon game, but many things remain the same as\nin previous Pokémon RPGs, including the turn-based battles, diversity of\nPokémon and the moves they learn. The game provides all sorts of new\nways to confront your enemies. Your Pokémon still have their traditional\nmoves, but those moves have new traits that let you customize complex\nstrategies. You can link together moves and have them all execute in the\nsame turn! Although these moves cost more points, the turn-saving\ncombinations radically change how you view combat.\n\nVisit Pokémon Square\nAfter you rescue Pokémon, head to\nthe Pokémon Square, which serves as a base for your operations. The\nPokémon-shaped buildings house all sorts of shops and services. Once you\nestablish a base, Pelipper will deliver missions for you to undertake.\nYou can buy items at the Kecleon Store, and Kangaskhan Storage is a\nplace that will hold on to your items while you're in a dungeon. If\nyou're looking to hone your fighting skills, go to Makuhita Dojo to get\nin some practice.\n\nMore than 380 kinds of Pokémon are available to travel with you, but\nfirst you need to make sure they have a place to stay. For this, you\nneed to unlock a Friends Areas. You can go to the Wigglytuff Club to buy\nentry to a Friends Area. Sometimes you'll earn entry to an area as a\nreward or you can meet special Pokémon to unlock their Friends Area.\nOnce you've earned entry to a Friends Area, you can visit it and talk to\nthe Pokémon who have joined your party.\n\nFeatures unique to Nintendo DS\nAlthough there are two similar\nversions of Pokémon Mystery Dungeon for both Game Boy Advance and\nNintendo DS, the features of Blue Rescue Team for DS further enhance the\ngame's experience.\n\nYou can control your team and access menus via the touch screen, view\nyour map in real-time on the top screen and connect wirelessly with\nother players who have a copy of Pokémon Mystery Dungeon: Blue Rescue\nTeam. Another advantage to having a Nintendo DS is that you can trade\nback and forth between Blue Rescue Team and Red Rescue Team by inserting\nthe two games into the Nintendo DS's two game slots.\n\nStay tuned for more information on Pokémon Mystery Dungeon as release\ndate approaches.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Chunsoft","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":24107,"name":"Super Mario Bros.: The Lost Levels","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/521/521e0d24d09c535b2e1c8dd11c59b6d9.jpg","description":"Originally released in Japan as Super Mario Bros.® 2, this game has previously made only brief cameo appearances in the Western Hemisphere. Mario fans will appreciate the familiar look and feel of the game, while finding that its updated game play creates an entirely new challenge. In addition to the classic enemies already known to fans worldwide, there are also Poison Mushrooms, backward Warp Zones, and the occasional wind gust (which can help or hinder your progress). If that’s somehow not enough, expert players can go looking for the game’s secret worlds. So get ready to put your Mario skills to the ultimate test, and save the Princess again. Just don’t be surprised if she’s in another castle! This game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance.","review":"","timePlayed":0.0,"releaseYear":1986,"developer":"Nintendo","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii"}]},{"id":23468,"name":"Shotgun Legend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48e/48e64530d0144a6dc89ae5be60164a4f.jpg","description":"A tribute to the Legend of Zelda, with a shotgun!\nEugene stumbles through a portal along with a truck rim. He finds himself in a strange land taken over by an alien race. Armed with his shotgun and an arsenal of alien technology, he must find the rim, as it seems to be his ticket home.\n10 dungeons to explore\n8 active items and 8 passive items to collect.  16 in total.\nA unique take on multiplayer in which the first player uses an item to summon a doppelganger that shares it's health to assist him.  Potentially increasing damage dealt, but damage taken as well.\nEventually dual wield shotguns!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jonathan Tindell","platforms":[{"id":0,"name":"PC"}]},{"id":22405,"name":"Stay Alight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bc/0bc3bbaba1747d0b7e925ffa21853d67.jpg","description":"Become a world savior in the new arcade game — Stay Alight®!\nMeet the adventurous Mr. Bulb, who will free the planet from the cartoonish microbes with your help. The green meanies have conquered the planet completely and utterly, so it’s up to Mr. Bulb to find all their secret hideouts and destroy them using his tactical skills and projectile weaponry. The game mechanics is based on real physics, so you should very carefully aim and calculate shot power — in the process of completing 80 unique levels!\nWonderful graphics, amazing music, interactive objects, various enemies and troves of hidden surprises are waiting for you on this microbe-infested planet!\nKey features:\nRealistic physics\nGraphics!\nMusic and sounds!\nUnique setting (wow)!\n80 levels!\nBad guys!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wyse Games","platforms":[{"id":0,"name":"PC"}]},{"id":20898,"name":"Lilly and Sasha: Nexus of Souls","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/068/068e8885a7825570a88d57d502304bf9.jpg","description":"Part 2 in the Lilly and Sasha series.\nZahhak has Sasha's body and is going to use it to claim the powers of the Immortals. Lilly has vowed to stop Zahhak at whatever cost, even if she has to kill her own sister to do it.\nContinue your journey from Curse of the Immortals with new puzzles, new skills, runes and trinkets, new characters and 10 new pets, two of which can join you in battle at the same time.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"John Wizard","platforms":[{"id":0,"name":"PC"}]},{"id":19654,"name":"Samurai Gunn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/021/0218f6261a1991ac18cd3075d86d537f.jpg","description":"Samurai Gunn is a lightning-fast Bushido brawler for two to four players. Each samurai is armed with a sword and gun, with only 3 bullets to a life. Discipline and quick reflexes are the key to deflecting bullets and sending your opponents’ heads rolling.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Teknopants","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19362,"name":"Bad Bots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39b/39b3ab29952521a7c9974b0d50fd15d9.jpg","description":"As Sam McRae, last surviving member of the “Titan Hauler” crew, you must hack and blast your way through an onslaught of truly bad 'bots to find a way to prevent a potential planet-destroying catastrophe. The mystery of what happened to everyone while you were in cryostasis unfolds around you as you wade through the bodies of your fallen shipmates, unloading round after round into your relentless automaton attackers.\nExplore 170 danger-filled rooms throughout the ship including the Evacuation Bay, Mechanical Shafts and Robot Workshops while the rich sci-fi story unfolds in the Campaign Mode.\nEngage in combat against more than 2000 deranged robots comprised of several unique types, all programmed to kill you.\nFace off against 7 deadly bosses, each with distinctive attacks including the fire spewing Flamebot, electrified Orbs, the lethal grip of the Spider and Jack Hammer’s brutal pistons\nDefend yourself with 8 robot bustin' weapons including your trusty Axe, Rifle, Shotgun, explosive Grenade Launcher, Pulsar Gun and more.\nTry to survive 60 seconds against an endless onslaught of especially persistent and cranky gun-toting, knife wielding robots in 3 unique rooms in Challenge Mode.\nEarn 14 challenging Achievements including “Run Amok,” “Top Dog” and “Reaper’s Friend.”\nEnjoy full Controller and Steam Big Picture support so you can partake in all the ‘bot slayin’ goodness from the comforts of your couch.Award-winning indie developer Vanni del Moral (Point Five Projects) has crafted an intense experience that pays homage to his gaming roots. Bad Bots is filled with 2D run-and-gun excitement coated in a bold visual style set in a large open space craft.  Put your mettle to the metal in Bad Bots for both PC and Mac!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Point Five Projects","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18902,"name":"The Maker's Eden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/190/190397f5d65be01ca5e62925a7636ea2.jpg","description":"The Maker's Eden is a first-person hypertext adventure game presented in the style of a motion comic. You play a character trying to discover what their predefined purpose is, in a science fiction/noir inspired world filled with androids, flying cars and an early 20th century vibe.\nIMPORTANT:\nThis is a 3-act episodic game. The purchase is for all 3 acts, of which acts 1 and 2 are ready to be played right now, with 3 in development.\nHas trading cards!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Screwy Lightbulb","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17377,"name":"East India Company","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/296/296d25ee0c67d030769ca1380701fb28.jpg","description":"In East India Company, players will enjoy building the World's most powerful trading empire & engaging in vigorous battles in both single player & multiplayer modes, all within a breathtaking cinematic game environment.\nPlayers will fight, manage, and rule nations from Europe to the Far East with eight nationalities to chose from: British, Dutch, French, Danish, Portuguese, Swedish, Spanish, and the Holy Roman Empire.  Starting modestly, you will build your fleet, establish connections to far away countries, and keep the rivaling nations at bay.  Choose from a wide array of ship classes, including a variety of transport and military vessels.  Create diverse fleets and assign each of them specific trading routes.  Control and upgrade well situated ports as you form your strategy for domination.\nConflicts and wars are inevitable.  When hostile fleets engage each other, the spectacular naval battles are fought from a real-time tactical level.  Devastating broadsides are fired with a deafening roar and cannon balls tear through enemy ships and their crew.  For greater tactical depth, command your ship and give independent orders to each of your fleets.  Fight against the other European powers to create a trading empire that will rule above all others in this groundbreaking strategy war game!\nFeatures:\nSpectacular cinematic & epic naval battles\n2 Command Modes: Give orders to all your ships in RTS or take the helm of a single ship in Direct Command-mode.\nUnique combination of war & trading\nState of the art diplomacy AI\n8 playable nations:  England, France, Holland, Portugal, Denmark, Sweden, Spain & the Holy Roman Empire\nOver 10 realistic ship types; from small sloops and cutters to East Indiaman and warships\nRealistic yet fast-paced naval combat\nHire fleet commanders who will gain new skills & increase the abilities of your fleets\nTake over ports & protect your shipping routes to create largest trading empire\nMultiplayer (Internet or LAN):\nUp to 8 simultaneous players\nPlayer statistics tracked on the EIC game server\nSeveral game modes with single & team approach\nRaise your ranking by thwarting your opponents\nHead-to-Head missions are a true test of strategic skill\nFIGHT!\nUse Military might to build your trading empire\nCommand ships & fleets independently\nWage war on the vast open sea\nSink your rivals' ship or board them to take control\nMANAGE!\nHire fleet commanders to boost your fleet's abilities\nUser commander skills to give you an edge in battles\nUpgrade your ports with new buildings\nBuy & Sell goods\nEstablish profitable trading routes\nOpen diplomatic relations or declare War\nNegotiate tense political situation\nRULE!\nLead the most powerful company in history\nTake over colonies & expand your empire\nUse well modeled diplomacy to exert your power\nConquer strategic ports\nAccomplish missions ordered by your company or the Crown\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nitro Games","platforms":[{"id":0,"name":"PC"}]},{"id":17058,"name":"Gratuitous Tank Battles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/974/974ccc171cebac1d4f2239267248d4f3.jpg","description":"Gratuitous Tank Battles (GTB) is a unique hybrid of tower-defense, strategy, simulation and RTS. Set in an alternate history timeline where World War I never ends, you are the commander of allied forces fighting right up to the year 2114, where Mechs and lasers are used alongside tanks and rifles. The war continues across Europe, with the allied commanders still locked into the optimistic patriotism of the 1900s.\nA tower-defense game where you can play as the attacker has been done before, but GTB lets you play the same maps as attacker OR defender, and even lets you save out your attack as a recording to defend against. An online-challenge system lets you upload your custom maps and custom units and attacks for other players to fight against. Speaking of custom units, GTB doesn't have simple pre-built units, but allows you to build them from individual components, and even design the appearance and colors of every single unit. An unlocks system gradually reveals more modules, abilities and unit 'hulls' to experiment with.\nGTB also features an integrated map editor that lets you trivially change and tweak existing maps, or create entirely new ones, and the process of sharing these custom maps with friends is built right into the game. Combine it with Steam achievements, community, cloud support and more, and you should be kept busy fighting over Europe for another two hundred years./>Key Features Alternate History Tower Defense: Fight a 200 year war to save Europe\nPlay as attacker or defender on any map, even custom ones\nFight with Infantry, Tanks, Turrets and Mechs\nOptional Adaptive AI adjusts to your play style and tactics for endless variety\nCustomizable units allow you to design your own personal army\nBuilt-in level editor makes creating a new map a breeze\nSave out your attack and play against it as the defender\nOnline map and challenge-sharing system allows you to fight your friends armies","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Positech Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16844,"name":"rFactor","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/730/730156327066ba1f7daefd0f29f31b15.jpg","description":"Summary\nrFactor is a realistic easily extendable racing simulation from Image Space Incorporated. It offers the latest in vehicle and race customization, great graphics, outstanding multiplayer, and the height of racing realism.  rFactor features mixed class road racing with ultra realistic dynamics, an immersive sound environment and stunning graphics.\nYou can race against a field of AI cars, or in multi-player mode against others. The simulation supports a full day-night cycle. In multi-player mode, driver swaps are also supported, allowing you to run even full 24 hour endurance events. Everything can be customized by the community, including adding new tracks and cars, and a wealth of add-ons are available on-line.Features\nPhysics\nUpdated 15 degrees of freedom physics engine\nAdvanced tire modeling\nSupport for 4-link rear suspension\nEngine boost modeling\nComplex aerodynamics\nHead physics, cockpit vibrations, detailed bump modeling\nAll-new track-specific terrain data file system\nGraphics/Sound\nDX9 advanced graphics engine\nReal-time day/night transitions\nProjected headlights for nighttime driving\nAdjust player and opponent volume ratio\nSee the apex with the Look Ahead slider\nAdjust your seat and mirror while in the driver’s seat\nUpdating real-time scoring towers\nExpanded and enhanced gauge and LCD features for vehicle cockpits\nImproved loading times\nUpdated sound engine\nChanging engine sounds based on upgraded vehicle performance\nGameplay\nCareer mode with upgrades that affect the vehicle’s appearance, performance, and sound\nDefine AI opponent types, strength and aggression\nRaces can be lap based, time based or both\nVehicle upgrade system\nVehicle economy including mileage\nAmbient and track temperature changes throughout the race\nMore configurable keys than you can shake a stick at\nMultiple Racing Series with vehicle and circuit filters\nGrid editing\nCamera/Replays\nFull screen monitor and ability to rewind\nFreely move camera from any position including the ever famous exclusive ISI Swingman\nSpectator mode\nGreatly enhanced replay system including clip splicing\nMove, duplicate or delete replay clips while assigning camera movements to each\nExport replays to AVI files defining compression and size options\nMultiplayer\nCompletely new multiplayer engine\nBuilt in race statistics reporting to web based RaceCast system\nBuilt in friends list\nServer bookmarks\nDedicated server, including single click option\nNative voting system\nAdd AI to multiplayer games\nBuilt in IRC chat\nBoot and ban player lists that can be passed around\nSecurity checks to combat potential cheating\nOpen Architecture\nExtensive support for modders\nEasy to use customizable multi-language support\nDefine a league schedule\nRules to simulate different types of racing\nCompletely customize your controller\nDrop in new vehicle liveries\nVehicles\n2006 Formula IS – High Performance Open Wheel (Video)\n2005 Hammer – Full Bodied GT\n2005 Howston – Full Bodied GT\nNational Stock Car – Stock Car\nPanoz – Full Bodied GT\n2005 Rayzor – Rally Turbo\n2006 rF3 – Quick and Nimble Open Wheel\n2005 Rhez – Small FWD Sport Compact\n2006 Rhez – Small FWD Sport Compact\n2005 rTrainer – Low Speed Open Wheel\n2005 Venom – Rally\n2005 ZR – Affordable High Performance Sedan\nCircuits\nBarcelona – Permanent Road Course\nBrianza – Permanent Road Course\nEssington Park – Permanent Road Course\nJacksonville Speedway – High Banked Superspeedway\nJiading – Permanent Road Course\nJoesville Speedway – Paved Short Track\nLienz Festival – Country Roads (Video)\nMills Metropark – Permanent Road Course with two layouts\nMontreal – Permanent Road Course\nNorthamptonshire – Permanent Road Course\nNuerburg – Permanent Road Course\nOrchard Lake – Banked Tri-Oval with Infield Road Course\nSardian Heights – Street Circuit with two layouts\nToban Raceway Park – Permanent Road Course with four layouts","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Image Space","platforms":[{"id":0,"name":"PC"}]},{"id":15123,"name":"Tomb Joe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ec/0eccdd980cdef675602c2f470bb35dab.jpg","description":"The Sceptre of Gods - a primeval symbol of power wielded only by the greatest leaders of the most dominant ancient civilizations in Central America. Legends state that whoever possessed the artifact would be granted divine wisdom and eternal life. Scolars even claim that without it, the Aztec Empire would have never came to flourish.\nWhile most academics considered it to be a myth, a world famous archeologist Tomb Jack recognized there could be some authenticity to the story. After years of research, shrouded in secrecy, he led an expedition to prove the artifact's existance and bring it back to the civilized world. He was able to discover an ancient crypt which led him and his companions to a place none of them could have imagined, even in their wildest dreams. Unfortunately, after many months, none of them returned and soon, all were proclaimed dead.\nYears later, Tomb Joe, renowned archelogist and a fearless adventurer recieved a mysterious letter adressed to his long lost father. It only contained two things - an ancient map and a golden medallion engraved with the symbol of the Sceptre. While the medallion piqued his interest, it was the map that made him act. For the first time, he learned the destination of his father's expedition. There was no time to waste. Not an hour later, Joe was already on his way to Central America...\nEmbark on a journey to unravel the mystery of the Sceptre of Gods and Tomb Joe's father's disappearance. Armed only with his sharp wit and his trusty whip, Joe will have to face deadly traps, dangerous wildlife, and the best soldiers of the Reich to reach his goal and bring fame to his father's name once again. If he allows the Sceptre to fall into the wrong hands, whole humanity could be doomed. Travel through exotic environments, explore long forgotten tombs, fight or sneak your way past vicious enemies, solve puzzles and try to discover the secret behind the mysterious artifact in this thrilling action-adventure parody platformer.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":12031,"name":"Tactical Genius Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb9/bb9de6636d97f62cfdbfa3b67275efce.jpg","description":"1. What is “Tactical Genius Online”?\nTactical Genius is a turn-based strategy game with the focus on multiplayer and a system of simultaneous orders with an emphasis on the tactical component. There is also an integrated with multiplayer ability to play against the computer opponent.\n2. What is a “System of simultaneous orders”?\nPlayers simultaneously give orders to their units, capitals and forts. When all the players finish giving orders, units start to move by turns: by way of initiative, which depends on the unit type and its health. All players know at the stage of giving orders which unit will move first in this turn and take this into account in their plans. The greater initiative allows moving first.\n\n3. How does it make the game special?\nIt doesn’t matter who clicks the fastest, the movement begins only when everyone has finished giving orders. We don’t spoil turn-based strategy by comparing the speed of mouse clicking!\nDon’t assume anything as an accomplished fact, but anticipate the moves of your enemies and mislead them. This interesting feature of the game will make you take a fresh look at the gameplay.\nHere you can play a dynamic game, in which you don't have to wait for your turn alternately with your opponent (we all know those  types of games and they can be tiresome).\n4. What is the aim of the game?\nFight for the key points on a randomly generated map in mods 1x1, 2x2, FFA4 and \"Player vs AI\".\nMore key points = more units.\nDon’t surrender your capital and try to capture the enemy’s capital.\nEvery unit has 3 simple skills and a fourth special skill, which is given only on level 5. You can get and improve skills as you gain experience in battles.\nThis gives you the opportunity to experiment with a variety of strategies, combinations of units, and their skills.\nChoose what kind of units you will assemble and in which order. The current version of the game features six unit types: Warrior, Archer, Pyromancer, Vampire, Necromancer and Assassin. You will have to make a decision as to which unit will start the game, which will come next, and come up with your favorite combinations. For instance: a Warrior, three Vampire, and a Pyromancer. Or do you want to try to create the army consisting of invisible assassins? Or maybe you want to suppress enemies by using their own fallen warriors, focusing on necromancers hiding behind the archers?\nYou can play the game for free, earning gold to buy new units. Three basic units will be available at the beginning of the game, the other ones need to be bought for gold. Gold can be bought for real money, if desired.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pixeltales.ru","platforms":[{"id":0,"name":"PC"}]},{"id":11158,"name":"Ultimate Fishing","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d4/4d44a26386019aaed6e05d7da5a27650.jpg","description":"Ultimate Fishing is an unusual fishing simulator, featuring realistic graphics, physics and gameplay. Cross the boundless seas and oceans, discover the deepest recesses of rivers and lakes!\nShow patience and care when hunting BIG fish! Do not think it will be easy.\nBelieve me ... You have not seen anything like this yet!Ultimate Fishing Will Include 7 realistic fisheries from all over the world (Canada, Arizona, Panama, Louisiana, Russia, etc.)\nDozen of fish species (pike, trout, etc.),\nHuge selection of equipment (rods, reels, baits, decoys, hooks, ...)\nDynamic weather,\nMultiplayer mode with chat and tournaments,And ULTRA REALISTIC WATER!\nCAMERA FROM THE BAIT VIEW!\nFULL DAILY CYCLE (DAY / NIGHT)!\nSEA FISHING!\nICE FISHING!\nBOATS!\nAdditionally you will receive:\nADVANCED LEVEL EDITOR (yes, you can create your own fishery from your greatest dreams)\nPOSSIBILITY OF ITEM CRAFTING!Interested? Me too!Add NOW Ultimate Fishing to Your Steam Wishlist!http://store.steampowered.com/app/468920/","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PlayWay","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":10420,"name":"PRO EVOLUTION SOCCER 2017 TRIAL EDITION","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab7/ab72bac94a51a4a763e77231f4235b49.jpg","description":"myClub mode has been added to this title from Feb 2017!\nThe much-awaited Free-to-Play version of [Pro Evolution Soccer 2017] is now available!\nPlay the brand-new online mode [PES LEAGUE] and compete to be crowned league champions and for a chance at cup glory in limited-time-only competitions, as well as [EXHIBITION MATCH] and [TRAINING] modes.\n*Other modes such as [Master League] are only playable in the full version of [Pro Evolution Soccer 2017].\n*Playable teams may be limited in some modes.\n*In PES LEAGUE mode, the number of matches you can play is limited.\n*You can be paired with other opponents playing PES LEAGUE mode in the full version of [Pro Evolution Soccer 2017].\n*Save data cannot be carried over from the other titles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":4800,"name":"The UnderGarden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fda/fda1eb45b6f2ab9085ef76244ec4d213.jpg","description":"The UnderGarden is a casual Zen game that challenges players to explore beautiful underground caverns filled with strange life forms, sound, music and plenty of hidden secrets.  Casual gamers with an affinity towards puzzle games will enjoy The UnderGarden’s modern exploration quest filled with brain teasing games that combine state of the art 3D rendering and physics based puzzles. Players traverse large underground worlds in search of members of their musical band. The goal is to bring them together and lead them to the surface.  Along the way, players will encounter puzzles that must be solved and strange life forms that must be befriended or avoided.  Provides a truly visceral and relaxing gameplay experience that gamers will enjoy as a contrast to the frenzied action of most popular core titles.\nKey features:The Pick up and Play mechanics utilizes straightforward, accessible controls.\nPuzzles are physics based, solved by placing grown “fruit” that weighs down levers, or lifts up platforms to allow access to new areas.\nEnvironmental puzzles solved by growing exotic plants around the player.  The world springs to life with vibrant color and music as the player drifts past dormant seeds.\nSerene music and audio is threaded within the game to enhance user experience.\nProgress is driven by player’s own pace, desire to see their effect on the world, and exploration of new environments.\nFirst game of its type to offer 2 player co-op play.\nCasual Zen game design offers 20 different levels, each with a unique look.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"UFO Interactive Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":4564,"name":"DAYTONA USA","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/862/862f0a3da04a5e2d5146b35e75e0d85b.jpg","description":"It’s time to get revved up with DAYTONA® USA! Based on the classic arcade title, DAYTONA® USA features enhanced graphics, tracks for all skill levels, and the original hit soundtrack!\nSave your quarters - we’re bringing the arcade straight to your living room with steering wheel and multiplayer support. Challenge your friends in up to eight player online races or the whole world via online leaderboards!\nNew Coat of Paint:\nNow with enhanced graphics, DAYTONA® USA gives you a classically updated, retro look in 16:9 widescreen.\nClassic Arcade Experience:\nRace your AI opponents in classic Arcade Mode, beat the clock in Survival and Time Trial modes or sing along to your favorite DAYTONA® songs in Karaoke mode!\n©SEGA. All Rights Reserved. SEGA is registered in the U.S. Patent and Trademark Office. SEGA and the SEGA logo are either registered trademarks or trademarks of SEGA Corporation.  Daytona International Speedway® is a registered trademark of International Speedway, Inc. and licensed to International Speedway Corporation. DAYTONA® is a registered trademark of International Speedway, Inc. and licensed to International Speedway Corporation.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":2581,"name":"Skullgirls 2nd Encore","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/436/436649e2ed892ba234fca14baf856890.jpg","description":"Purchasing this content entitles you to both the PS4™ system and “PS Vita” system versions!\nSkullgirls 2nd Encore is a beautiful, fast-paced 2D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Each of the 14 wildly original characters features unique gameplay mechanics and plenty of personality.\nSkullgirls 2nd Encore is the perfect fighting game for casual and competitive fighting game fans alike. Casual players will enjoy the fully voiced story mode, gorgeous animation and soundtrack by Michiru Yamane, while hardcore players will appreciate its balance, cross-platform multiplayer, and support for PlayStation®3 system fight sticks.\nAdditional hardware required for Interconnectivity.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-2\n2GB minimum save size\nDUALSHOCK®4\nInterconnectivity PS4™ • PS Vita\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nTM & © AUTUMN GAMES LLC. ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Autumn Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":1064,"name":"Hatsune Miku: VR Future Live","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"VR games may cause some players to experience motion sickness.\nExperience the Hatsune Miku concert of the future! Enter a virtual stadium, immerse yourself in the audience, and get lost in the music. And if the crowd goes really wild, you'll even get the chance to watch a special, one-on-one performance. So raise your glow sticks, cheer Miku on, and enjoy the show like never before!\nPlease note that you must purchase the free 'VR Future Live' game and a Stage DLC to enjoy this content.\nPlayStation®Camera required\n1 PS®Move controller required\n1 player\n715MB minimum save size\nDUALSHOCK®4\nPlayStation®VR Required\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© SEGA. SEGA, the SEGA logo, Project DIVA, and VR Future Live are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates.\n© Crypton Future Media, INC. www.piapro.netPlayStation®Camera Required\n1 PS®Move controller compatible","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":667,"name":"10000000","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/755/7554e9204709d2e09c71abfd36cf5b2b.jpeg","description":"10000000 is a Dungeon Crawling RPG Matching Game. Run the dungeon and match to handle the things you encounter\n“This game is so good it makes me want to cry” - Eli Hodapp – Editor In Chief – TouchArcade\n“This is one of my favorite iOS games in a long time. Buy it. Love it. Pass it on.” - Ben Kuchera – Penny Arcade Report\n“Freedom costs 10 million. I’m half-hoping I never make it” - Mike Fahey – Kotaku\n“Mashes together two of the most interesting genres of the last years: the puzzle RPG and infinite runner. And it’s damned good.” - Owen Faraday – Pocket Tactics\nUpgrade your castle, improve your gear, train skills and brew potions\nCan you score 10000000 and earn your freedom?\n• Kill monsters and find loot\n•Improve your gear and train skills\n• Find wood and stone to improve your castle\nTest your skill\n• More than 60 objectives to complete\n• Over 20 different monster types to fight\n• Find items and use them effectively\n• Fast paced action gameplay\n\nClassic Gaming\n\n• Retro graphics\n• Old school music\n\n\n\"I played this for like 8 hours, it's a fantastic little game.\"\n\"I got sucked into this more than I expected\"\n\"Adds so much to the genre, What a great game!\"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"EightyEight Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":732437,"name":"Potion Permit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/496/49664cc0aca1a464a778f0c7d2600c2b.jpg","description":"The town of Moonbury has always been wary of the advances of the outside world, preferring to rely on their traditional methods of healing. Until one day, when the mayor's daughter falls ill, and the local witch doctor can do nothing to help her, they are forced to look outside their small community for help.\n\nThe Medical Association decides to send their most accomplished chemist - you - to help cure the mayor's daughter and convince the residents of Moonbury of the wonders of modern alchemy. Gain their trust and tend to each person when they fall ill in this open-ended sim RPG.\n\nFeatures\n\n    Take care of residents. Moonbury has around 30 unique inhabitants who will occasionally fall ill and call for your aid. Sick residents will have their schedules interrupted while they recuperate in bed.\n\n\n\n    Diagnose symptoms and find a cure! Hmm... a low heart rate and a bloated liver. Shoulder cramps, perhaps? No, these are sure signs of burning lungs. This patient has been consuming too much gelatin! Easily remedied; you'll just need to craft some Minty Goblet.\n\n    Gather ingredients out in the world. Once you've decided on a potion, ointment, or salve, gather ingredients from the surrounding environment using your tools. Upgrade your hammer, axe, and sickle for new swings and attacks to help with your day-to-day tasks. Watch out for changing weather conditions! You may find yourself caught out in the rain, a freezing blizzard, or even the baking heat of a desert.\n\n\n\n    Confront nasty monsters for their materials. Sometimes you won't be able to gather the materials you need as easily as harvesting a berry bush, and you'll need to turn your trusty tools into weapons to collect materials from the monsters prowling the nearby wilderness. Combat is in real-time and, since you're a chemist, you'll be able to brew various concoctions to buff yourself or inflict status ailments on your adversaries, as well as various tools to aid you.\n\n\n\n    Brew remedies in your cauldron. The ingredients you gather can be mixed in your cauldron to brew medicine, vitamins, and more. As you become more experienced, higher-level recipes will become available, requiring more ingredients but bestowing stronger effects. Enhance your cauldron to concoct more ingredients into your recipes for these more advanced remedies.\n\n\n\n    Build relationships with the townsfolk. It'll take a little while, but your patients' health will be much better thanks to your efforts. Your reputation with them will increase, and they'll open up to you a little more. You may even find yourself growing particularly close to certain bachelors or bachelorettes.\n\n    Upgrade the town and surrounding areas. Building relationships with townsfolk increases your approval rating allowing you to improve the area by improving public buildings and expanding the explorable areas around the town. You can also craft and buy new furniture to give your home a personal touch!\n\n    Enjoy the peace and quiet of the countryside. In the downtime between treating the community's ailments, you'll be able to freely explore in and around Moonbury. Get to know the inhabitants a little better, take a rest in the tavern, or go fishing to catch something for dinner. Moonbury is a delightfully charming location where time seems a little slower and life is just a little more relaxed than the big city. While the lighting will change throughout the day, with the bright sun streaking across the meadows in the morning and street lamps illuminating the town in the early evening, there are no time limits for game objectives. You are free to go at your own pace and take it easy.\n\n    Spend time with a faithful companion. You didn't relocate to Moonbury alone! With you every step of the way is your loyal dog companion. Your pet can help you locate hidden items and point you in the direction of residents as they go about their day.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"MassHive Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":708998,"name":"Grand Theft Auto III: The Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9db/9db7575938031b505ed7cdc2067168ce.jpg","description":"It all starts in Liberty City. With revolutionary freedom to go anywhere and jack anyone, Grand Theft Auto III puts the center of the criminal underworld at your fingertips, if you have enough guts to take it.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rockstar Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":704748,"name":"KartRider: Drift Closed Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bb/2bb18b349314c1ba2c99275392644e9e.jpg","description":"Welcome to the newest free-to-play title in the popular multiplayer racing franchise with over 300 million players! KartRider: Drift is the only free-to-play, cross-platform kart racer where arcade thrills, the fastest drift fueled skilled competition, & deep kart + character customization in stunning Unreal® Engine 4 graphics awaits you on the track.\nChallenge your friends across platforms with no barriers, no Pay Walls, & no Pay To Win elements preventing you from having a great time while topping the leaderboards. Created from the ground up for dynamic, online gameplay there’s new content being added regularly and huge content updates every Season. No Limits.\nExperience the newest free-to-play title in the popular franchise with over 300 million players! Discover the cross-platform multiplayer kart racer featuring high definition Unreal® Engine 4 graphics that is the most expansive, accessible, & competitive kart racing title ever!\nRace Together Anytime & Anywhere! KartRider: Drift is easy to pick up + play across PC & PlayStation 4 & Xbox with No Pay Walls. With free online play, there’s always a way for you to play completely free with friends across the globe.\nTake control in the only kart racing game with high definition Unreal® Engine 4 graphics & full freedom to personalize your ride. Endlessly customize your character to fit your own unique personality & craft the perfect kart to cross the finish line & top the leaderboards in style.\nElevate your game through the fastest & most competitive multiplayer sprints in kart racing  - KartRider: Drift’s exclusive Speed Mode. Push yourself to the limit with Speed Mode’s precise controls, advanced drifting system, & highly skilled gameplay. With no items & no RNG, success on the track is determined by skill & mere seconds.\nMore than any other kart racing title, KartRider: Drift is a living, online multiplayer game that is always adding new karts, characters, skins, tracks, & customization options at regular intervals plus huge Seasonal content drops. Keep your garage stocked & your skills sharp as the game grows over time!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"NEXON KOREA","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":635275,"name":"Company of Heroes 3 - Pre-Alpha Preview","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e9/4e9c5be6843f756bb8dbfa5b626eb385.jpg","description":"Pre-Alpha Preview\nSign up to CoH-Development by clicking the the image above.\n\nCreate a Relic Account, or sign in if you already have one to access our CoH-Development site.\n\nYou can redeem the Pre-Alpha Preview on this site by linking your Steam account.\n\nPlay the Pre-Alpha Preview and give us your feedback\nAbout the GameWe intend to gather as much community feedback as we can to create the best Company of Heroes game ever. That’s why we are announcing Company of Heroes 3 more than a year out from launch, providing our fans with a free pre-alpha preview covering a portion of the massive single player campaign.\nAs commander of the Allied forces, your objective is to lead your forces and capture critical locations in preparation for an assault on the winter line. How you achieve this goal is entirely up to you!\nThis experience provides a glimpse at our single player campaign, providing access to a few key missions in the latter stages of the Italian theatre. Please note that this Pre-Alpha Preview does not commence at the start of the full game campaign, hence it’s tutorial and first-time user experience is limited.\nThis Pre-Alpha Preview is not intended as a marketing demo or promotional ‘Beta’. This is your chance to join forces with our development efforts early, and provide targeted feedback to help steer the shape of the final game.\nJoin up to our CoH-Development program today by visiting our website and become part of our development process. We can’t wait to hear your feedback and to connect you with the Company of Heroes community.Introducing COMPANY OF HEROES 3 – Pre-Alpha Preview\nThis Pre-Alpha Preview focuses exclusively on single player campaign gameplay. Starting in the Italian coastal city of Naples, you will be able to go hands-on with some of our exciting new innovations across core tactical gameplay and our all-new Dynamic Campaign Map.\nThis Pre-Alpha Preview will be available from July 13th 11:00am PDT / 13:00 EST / 19:00 CEST to August 3rd  19:00 PDT / 22:00 EST, August 4th 04:00 CEST.\nWe will be sharing our plans for multiplayer-centric gameplay in the near future, so remember to register for CoH-Development to avoid missing out.QUESTIONS\nWhat is included in the Company of Heroes 3 Pre-Alpha Preview?\nNew Dynamic Campaign Map\n\nThe new Dynamic Campaign Map delivers full ‘sandbox-style’ gameplay, allowing players to command the overall war effort and experience an unprecedented level of strategic choice. Establish vital supply lines before deploying rear guard defenses to secure your advance. Launch air and naval strikes to weaken and scatter enemy forces or liberate a nearby town to develop a Partisan spy network.\nPlayable US and British Forces\nFor the first time ever, command both the British and American forces in one campaign. Take control of iconic new units such as Ghurkas Special Service Forces, Chaffee Tanks and many more, as you prepare to liberate Italy from the grip of Axis occupation.\nFull Tactical Pause – Battle like never before!\nTest out our new and completely optional ‘Full Tactical Pause’ feature, delivering total control over the pacing of your single-player battles. Queue up everything whilst paused – from build orders to movements or unit abilities – then unleash lethal precision plays to gain the edge in battle.\nSkirmish Encounters\nExperience incredible action across a variety of intense missions, including dynamic new ‘skirmish’ mission types in this Pre-Alpha Preview experience. This is your chance to provide feedback on what you like and what you’d like to see sharpened in the final single player campaign.\nA Stunning Theatre Of War\nWelcome to the Mediterranean - a breathtaking new theatre filled with untold stories of war. Engage ferocious enemy forces across Italian mountain passes and breathtaking coastal vistas. Stunning visuals deliver authentic and highly diverse environments designed to keep you on your toes. Note -  North Africa not included in this preview.\nHow can I join?\nHere’s how to access the Company of Heroes 3 ‘Pre-Alpha Preview’.\n1.\tVisit the Company of Heroes website and click ‘Play Now’.\n2.\tFollow the prompts to create a Relic Link account, or simply log in with your existing Relic Link user name + password.\n3.\tWith your account created, check your designated email inbox for a confirmation notice.\n4.\tClick the confirmation link in the email and complete your full profile signup to become a registered member of our CoH-Development program.\n5.\tFollow the onscreen prompts and log in using your newly created credentials on our community portal\n6.\tOnce logged in, link your Steam profile to your CoH-Development account by visiting the Rewards page and following the prompts to claim the Pre-Alpha Preview.\n7.\tGo back to your Steam library and Company of Heroes 3 – Pre-Alpha Preview should appear there automatically.In what regions and languages will this Pre-Alpha Preview be available?\nCoH-Development registration is open to everyone. Claim your free Pre-Alpha Preview and provide feedback via our player survey to help us create the best Company of Heroes game yet.\nThe Pre-Alpha Preview will be available only in ENGLISH. Rest assured that Company of Heroes 3 will be localized into a wide range of languages at launch.What is the min spec for the full game at launch?\nPlease note that the minimum and recommended PC specifications for the full launch version of Company of Heroes 3 will be different than this Pre-Alpha Preview. Due to the nature of early pre-alpha game development, our intent is to continue optimizing the game’s performance to ensure the best performance on a wide variety of PC hardware.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]}]