[{"id":283965,"name":"Sonic The Hedgehog (2006)","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b91/b913b71d625c823c1b7f62d27565d5c0.jpg","description":"Race at lightning speeds across seven classic zones as sonic the hedgehog. Run and spin through loop-de-loops as you collect rings and defeat enemies on your mission to save the world from the evil dr. Eggman.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":62381,"name":"Star Renegades","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b9/8b9c58c31af7700e474bab5de33b0b82.jpg","description":"A tactical squad-based rogue-lite RPG set in an endless interplanetary rebellion against an evil authoritarian empire.\nFusing a reactive, tactical turn-based battle system that emphasizes interrupts and counters, with a procedurally generated and emergent mission-based campaign and an intelligent Adversary system with enemy officers that evolve and move up in the ranks, every playthrough is unique, challenging, and never the same.Features Outwit your foes with interrupts, counters, and combos in our fast-paced Reactive Time Battle System\nSurvive the relentless onslaught of an Intelligent Adversary system that generates unique enemies and bosses that evolve as you play\nUnlock dozens of alternate characters as your surviving squad members form bonds and create progeny\nBattle your way into the heart of the Empire as our Rebellion Engine creates a unique experience with each playthrough via emergent gameplay and events, procedurally generated missions, shifting priorities, evolving enemies, and tons of equipment/upgrades for your squad","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Massive Damage","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":60249,"name":"Hentai Girl","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d32/d320b5090ec28cda6457e315dc25df0d.jpg","description":"Artist: Loki\nHentai Girl is a puzzle game, in which all you need is to swop bricks, in order to make the pictures restored.\nBut please remember, this game is aiming to make you relax and enjoy life.\nSo if you cannot get relaxed, you may try “Administrator Mode”.Administrator ModeKeyboard F: Complete Level\nKeyboard R: Disrupt the Order RandomlyGame Featuresartworks3000 achievements Relaxing music Trading card and background\nLink_background1\nLink_background2\nLink_background3","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"GrilGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19385,"name":"Mata Hari","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5f/e5fee5351fd8e29714b2065b64bd56ed.jpg","description":"TRUST NO ONE BUT YOURSELF as you adventure into the dark world of espionage amidst the volatile atmosphere of impending war.\nAs a double agent, you must find clever ways to pit enemy factions against each other while eluding pursuers in each of your increasingly dangerous missions. As a femme fatale, your notorious charm can entice any man. Yet, will the one man who holds the key to your heart ever be yours?\n\nFeatures\nBased on the true events leading to World War I\nBreak code, tap phones, use your ingenuity and the era's latest gadgets!\nRisk it all as you take on dangerous missions\n8 challenging mini-games in 4 thrilling chapters\nA variety of endings based on the choices you make in the game","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"4Head Studios","platforms":[{"id":0,"name":"PC"}]},{"id":12738,"name":"Bear With Me","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc8/fc80b9de449267da53eaff8b2ff33b08.jpg","description":"Bear With Me is an episodic noir adventure game. Amber is trying to find her missing brother while being aided by her trusty teddy, Ted E. Bear.\nBeing haunted by nightmares, Amber wakes up in the middle of the night only to find out that her brother Flint is missing. She seeks help from her trusted teddy, Ted E. Bear, a retired grumpy old detective.\nThe dynamic duo sets out to hunt for clues and interrogate all the witnesses and suspects unaware of the dangers that recently started happening to residents of Paper City.\nThe plot thickens as a mysterious \"red man\" has been seen starting fires around Paper City and looking for little miss Amber.\nFeatures\nStory driven \"horror\" noir adventure game.\nUniquely drawn 2D Art-Style and 2D animation.\nDialogues and interrogations full of puns. Sarcastic, dark and funny from start to finish.\nVariety of clues and puzzles to uncover the mystery.\nInteractive and occasionally playable detective sidekick, Ted E. Bear.\nSimple hint system to avoid pixel hunting.\nOriginal Soundtrack.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Exordium Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12052,"name":"Face It - A game to fight inner demons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/952/952f2ba2f3aad29e3030886f49ab1860.jpg","description":"Carefuly crafted puzzles in a challenging 3D platformer experience take the player on a surrealistc journey through a maze of feelings. In Face It, abstract concepts are shaped into gameplay. Darker emotions like fear and depression are monsters and traps, while brighter concepts like HOPE, VISION and LOVE are the powers you need to beat the levels.\nGo on a metaphorical journey of self-discovery.\nDefeat Ghosts with the power of your inner light.\nAvoid  dangerous traps.\nFind your way through mazes and puzzles.\nDiscover Some of the many true meanings of magic.\nThe levels represents dark aspects of human consciousness, like Fear or Attachment. By beating a level, you shall find brighter states of mind, like Love or Truth.\n\nAs you might pass through the levels, you may unlock the magical sigils and symbols that represent those new brighter states of mind.\nThe sigils are symbolic representations of the magician's desired outcome. They are symbols created to cut through the walls of the conscious thought and affect directly the unconscious mind. It's at some extent, similar to subliminal messages.\nOne of the techniques we use to create sigils is a Sigilization method created by Austin Osman Spare, who was a magician, as well as a painter and graphical artist. The technique consists in writing spells with your intents, and agglutinate the letters to reduce the written statements in abstract symbols. The conscious mind may not remember the meaning of the symbols, but the subconscious keeps the memories about the symbol being made. This way, the symbols and their intents charge each other, exponentially increasing their influence on the mind.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"4EversGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11146,"name":"TeraBlaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d28/d289f310244f3400540a1f9bf7c04b9e.jpg","description":"Take control of a rogue ship and and wage war against endless waves of foes in TeraBlaster! Featuring classic top-down shooter mechanics and smooth addictive gameplay, TeraBlaster will put your reflexes to the test while you hurl gamma-grenades against your foes.\nExplore procedurally generated environments\nRuthlessly destroy hordes of enemy spacecraft\nExperience endless compelling gameplay\nEngage with the philosophical and quirky backstory\nTreat your ears to the gloriously retro OST\nTeraBlaster inspired fast-paced action roguelikes including Overture (available for purchase here!)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Black Shell Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9865,"name":"ONRAID","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db7/db7473e7f29ff99e55f6e3a95a04c6ca.jpg","description":"Onraid is a challenging 2D shooter game, where you are free to develop your own play style and tactics to destroy your enemies.\nOnraid offers intense battle modes, a varied set of character classes and cosmic visuals. Team up with friends or strangers to strengthen your chances as you battle unknown enemies, strange bots and mighty bosses. Use the items collected on raids to craft powerful weapons, gadgets and skins and customize your quirky character. Time to Raid!\n9 character classes, each of which has its own strengths and weaknesses, weapons and gadgets. Tweak your character for your preferred game style.\n4 unique battle modes, each with different settings and goals. Players form teams by inviting their friends or being randomly paired, and you can fight against each other or against game bosses.\nCraftable equipment. Collect items from raid boxes to craft different weapons, gadgets and skins, each of which has their own strengths and weaknesses. Build over 45 weapons, 80+ gadgets, and  60+ skins. Customize your character in ways that can directly affect your tactics, and develop your own play style.\nPVP leagues. Get to the top of the rankings as an individual or as a team!\nMuch more yet to come in regular updates!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pragmatix","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":892962,"name":"STALCRAFT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f66/f6664932f7431e199930f418f51df696.jpg","description":"STALCRAFT is a game in the MMOFPS genre with Survival Horror elements. It combines an open world, RPG and a dynamic shooter component.GameplayMost of the time the player spends in the open world of the Chernobyl Exclusion Zone. Locations are filled with all kinds of PvP and PvE-activities, beloved by fans of Stalker: search for artifacts, mutant hunting, exploration of uncharted locations, doing quests and laboratories, participation in faction wars. For those who have little time to play, there are various session modes.\nPlot and questsThe main storyline introduces the player to the Zone and allows you to enjoy an intriguing story, complete with cut-scenes and fully voiced dialogues. The world is also filled with many side quests steeped in stalker spirit.\nFirst-person shooterWeapon balance is not typical of open-world MMOs and is more reminiscent of session shooters like Call of Duty. We characterize our game as a fast-paced, reaction based and skill-driven shooter.\nEngine and settingOriginally, STALCRAFT was only conceived as a Minecraft fan modification that brings the world of S.T.A.L.K.E.R. into multiplayer mode. Over the past seven years, the project has changed significantly, and is now based on its own game engine. We position the game as an independent product inspired by the developments of GSC Game World, but not copying them.PVP in an open worldOne of the key features of the project is a complete freedom of PvP - players join one of the warring factions and can kill outsiders anywhere, except for small safe zones and quest dungeons. What is a stalker without looting and ambushes!Distribution modelThe game is distributed on a free-to-play model on a PC. Progression in the game is not pay to win - everything can be obtained in-game or purchased from other players at an auction.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"EXBO","platforms":[{"id":0,"name":"PC"}]},{"id":619744,"name":"Wartales","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a9/4a95e157712aa4b779c43bb4eae79b73.jpg","description":"It has been a hundred years since the world saw the fall of the once great Edoran Empire at the hands of an unprecedented plague that swept the nation. In the turmoil and uncertainty that has followed, mercenary work, banditry and thievery across the land is abundant, as honor has long since become an almost entirely forgotten virtue.\n\nNow, prepare to lead a group of unscrupulous characters who revel in such activity in a massive open world where combat, death and a thirst for riches will shape and define your day to day life. You are not special, the chosen one or a once in a millennia hero ushering in a new era of peace. Your goal is solely to survive and thrive in this harsh and hostile world.\n\nOnly the bravest and most ambitious can hope to see their story written in the Wartales!\n\nJourney through the gigantic world of Wartales and explore each of its corners in your quest for notoriety, wealth and recognition.\n\nExplore lively and vibrant villages, vestiges of a forgotten time, abandoned mines, deserted camps and more that litter this vast continent as you unravel the history of the world.\n\nFight your way out of perilous situations with a new twist on tactical turn based combat, as you are confronted by wild animals, fearless bandits and more...\n\nRecruit new companions with numerous unique specializations, skill sets, weapon preferences resulting in a plethora of possible builds.\n\nAccept contracts that will see you defend, liberate and save the many inhabitants of the land, be they good natured people just trying to make their way or those with less honorable motives...\n\nCollect bounties! From the most insignificant petty thieves to the lands most notorious figures, there’s no such thing as a profit too small to take.\n\nEnhance you and your companions capabilities with a deep and intuitive RPG progression and crafting system.\n\nImprove your group’s equipment by gathering materials and crafting powerful new weapons and tools.\n\nDevelop your camp, adding new amenities, tools & equipment to increase your group’s morale and efficiency.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Shiro Games","platforms":[{"id":0,"name":"PC"}]},{"id":56083,"name":"Judge Dredd: Dredd vs. Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd3/dd33e83d152a7abfc1eec6e3cfc3c60b.jpg","description":"Welcome to Mega-City One, a city of over 400 million people - every one of them a potential criminal. It is the third decade of the 22nd Century, unemployment is widespread, boredom is universal and only the Judges can prevent total anarchy. Empowered to dispense instant justice, they are Judge, Jury and Executioner all in one. The most feared and respected of all the Judges is you, Judge Dredd.\r\nPatrol the streets and mete out instant justice wherever it is needed. The Psi-Judges are predicting a terrible plague  is this the sudden outbreak of Vampires on the city, and are they the work of the malevolent Dark Judges?\r\n\r\n    JUDGE, JURY and EXECUTIONER it's your choice to shoot to kill, or disarm and arrest\r\n    Two-player co-operative LAN play throughout the entirety of the immersive storyline\r\n    Intense LAN action for up to 32 players\r\n    Customizable multiplayer games with enemy bots\r\n    Choose from over 60 characters for insane mayhem!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Rebellion","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":22980,"name":"Sam & Max Hit the Road","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/605/605712ec4c38eec249bd17114da57369.jpg","description":"Grab your nightstick, squeal like a siren, and Hit the Road with Sam & Max, Freelance Police, as they attempt to crack their toughest case. Sam (a canine shamus) and Max (a hyperkinetic rabbity thing) are hot on the trail of a runaway carnival bigfoot across America’s quirky underbelly in this deranged animated adventure!\nSolving this case is up to you! You direct the actions of Sam & Max, tearing down the road with mayhem on their minds and Corn Duds™ on their breath, on a peril-fraught mission to make the world safe for Sasquatches and sentient mammals everywhere!\nBased on Steve Purcell's unconventional cult comic books, Sam & Max will take you on an irreverent road trip adventure that will put hair on your back. Collide with tacky tourist traps and intimidate their bizarre denizens.\nHelp our frightening, furry flatfoots find the fugitive freak! Do it now!\n• Enjoy edgy animation and twisted humor!\n• Endless hours of fun playing mini-games like Wak-A-Rat and CarBomb!\n• Indulge in gratuitous antisocial behavior!\n• Roadside attractions your parents refused to stop at!\n• This game is powered by ScummVM.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Lucasfilm","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":3926,"name":"Air Conflicts: Pacific Carriers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/285/2857e769882eace7a84c164eaea70595.jpg","description":"True heroes know no bounds!\nExperience top combat action in this brand new arcade flight sim and become immersed in the exploits of famous aircraft carriers. Choose the side you want to play on: the US Navy or the Imperial Japanese Navy. Climb into the cockpit and re-live the most famous battles of the War in the Pacific. Equip your aircraft with realistic weapons, and take to the air with your squadron.\nGet ready for breathtaking air battles over the Pacific!Key FeaturesExperience the history of an aircraft carrier first hand! Master thrilling missions that focus on gigantic warships and their captains.\nTake command of entire squadrons! Instead of controlling just one airplane, you can control all of the planes in your squadron.\nExperience the most famous battles of the War in the Pacific! Place yourself in the middle of major battles such as Midway, Pearl Harbor, and Wake Island.\nGaming enjoyment without end! Master the campaigns alone or prove your pilot skills in 4 different multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Games Farm","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":704788,"name":"Dune: Spice Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09e/09e67b14d5282b2d3307a6e72dd876f8.jpg","description":"A real-time strategy game with 4X elements, from the developers of the critically acclaimed Northgard. Set in Frank Herbert’s groundbreaking Dune universe, you must lead your faction and battle for control and dominance over the harsh desert planet of Arrakis.\r\n\r\nSpice is the most valuable resource in the universe. The spice extends life, it expands consciousness and makes interstellar travel possible. Create your own story and play as one of several factions, including House Atreides and House Harkonnen, and compete for power over Dune and the spice.\r\n\r\nScan the landscape for wormsign or risk losing your troops and spice harvesters to titanic sandworms who will burst through the sand dunes to swallow and devour them whole. Best your opponents through political intrigue, crush them in combat, and undermine them with your network of illusive spies.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Shiro Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"}]},{"id":484971,"name":"Chained Echoes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/54a/54a8908159b95eda884e91463529192b.jpg","description":"Take up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantastic landscapes and vicious foes. Can you bring peace to a continent where war has been waged for generations and betrayal lurks around every corner?\nChained Echoes is a story-driven game where a group of heroes travel around the vast continent of Valandis to bring an end to the war between its three kingdoms. In the course of their journey, they will travel through a wide array of diverse landscapes spanning from wind-tanned plateaus and exotic archipelagos to sunken cities and forgotten dungeons.\nKey Features:\n20-25 hours of play time\nFast paced turn-based battles\nNo random encounters; enemies can be seen running around\nTons of items to be looted, stolen or crafted\nComplex skill and equipment system\nCustomize your own airship\nTravel and fight by foot or in your Mech\n16-bit SNES style graphics\nMusic inspired by PSX RPGs","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Matthias Linda","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":51432,"name":"The Wolf Among Us 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/845/84539f8f33fea2c753cca0ce3a6d168f.jpg","description":"Play as Bigby, “The Big Bad Wolf” and Sheriff of Fabletown, as you return to a gritty detective noir world where there are no fairy tale endings.\r\n\r\nThe Wolf Among Us 2 picks up six months after the events of season one. It’s winter in New York City and a new case threatens to cross the line between Fabletown and the NYPD. How you choose to approach it could determine the future of the Fable community.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":40471,"name":"Cargo! The Quest for Gravity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/756/756eef7a07205ea9af2e6c74f8be140f.jpg","description":"The Gods haven’t looked too kindly on humanity and Earth, as we know it, has been reduced to a group of island archipelagos, populated by “BUDDIES” – pint-sized creatures, unbound by gravity’s forces and free to float and frolic at their own whim and leisure.\nThe Gods have given the BUDDIES free reign over these colorful islands for their own willy-nilly, topsy turvy pleasure. But, there is a way to stop them ….FUN is the secret ingredient that will ground the BUDDIES and return gravity to Earth.\nAs one of Earth’s last human survivors, it’s up to you to dish out a healthy dose of amusement to restore order on Earth.\nDo you have what it takes to outwit the BUDDIES and win back the favor of the Gods?\nKey Features:\t\t\t\t\t\tPacked with unique and innovative physics-driven gameplay that offers multiple solutions to each mission; not to mention an unlimited sandbox mode!\nExplore a wide variety landscapes and locations including flying islands, large underwater environments, and numerous interiors. Changing seasons offer a dynamic effect on gameplay.\nLoads of different parts & components that can be assembled to create crazy yet functional vehicles\nUse your own music to create a personalized game soundtrack\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ice-Pick Lodge","platforms":[{"id":0,"name":"PC"}]},{"id":9939,"name":"The Long Journey Home","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d38ce6127ca2424184011e4d83dbd4.jpg","description":"There are a million worlds in the galaxy. Only one of them is Home.\nIt was supposed to be a short test run - a quick flight to Alpha Centauri and back. But when mankind’s first experimental jump drive goes wrong, a misfit crew finds itself trapped on the wrong side of the universe - alone, injured, falling apart. The only way back… is through.\nExplore an endlessly shifting universe. Form alliances with strange aliens, from the noble Wolphax Knights to cruel-minded Ilitza slaver empire. Harness your crew’s skills in everything from research to archeology to diplomacy. Learn the laws of an often hostile universe, and make tough decisions that may change it forever. Do whatever it takes to get back to Earth.\nThe Long Journey Home combines the endless freedom of space with a new open questing system that always leaves you in command. Deliver the stranded Glukkt to his homeworld as he asks, or to your new slaver friends? Attempt to make allies with everyone, or pin your hopes on the tougher races, and hope they never turn on you? Jump by jump, make hard decisions and live with the consequences, in a universe that is never the same twice.\n\nOne mission. Endless adventures.\nWhere will your Journey take you?Features\nEndless Space\nExplore a living, procedurally generated universe inspired by both classic and modern Science Fiction. Meet different aliens. Find different stories. Take different risks. Learn the secrets of the universe and with them, new possibilities.\nHidden stories\nRaid alien tombs full of traps and treasure. Compete in the galaxy’s greatest combat tournament. Find and research strange artifacts, and use your crew’s skills to find out whether that old skull is just a piece of bone, or the Holy Grail of an aggressive new species.\nA crew worth leading\nChoose four out of ten experts, all with personality as well as specialties. Far from just stats, you’ll come to know them as they share their feelings, their fears, their excitement and their concerns on the trip and your decisions. Learn how best to use their skills to help the others… and who might be willing to sacrifice themselves to get the others back Home.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2241,"name":"Double Dragon Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7e/f7e1be31deeab8d69cb6ba45fb15ff7f.jpeg","description":"A groundbreaking, uber-popular game upon its arcade debut in 1987, Double Dragon is the undisputed godfather of co-op beat ‘em all!\nEnter Double Dragon Trilogy, a compilation including all three installments of the beloved arcade series: Double Dragon, Double Dragon 2: The Revenge, and Double Dragon 3: The Rosetta Stone. The first one begins with Billy and his brother Jimmy, two martial arts experts, in a mission to rescue Billy's girlfriend, Marian, who’s been kidnapped by the Black Shadows Gang. All your favorite moves are here: punches, kicks, elbows, knees, head-butts and an assortment of not-exactly-street-legal weapons.\nBattle your way through all 3 titles and bask in the greatness of one of the ‘80s most popular arcade games!\nFEATURES:\n• Two game modes: “Arcade” (play the game from beginning to end and go for the high score) and “Story” (unlock new stages and achievements while playing through the game)\n• Customizable controls (keyboard & controller)\n• Three difficulty levels: “easy” (easier than the original),  “original” (similar to the arcade version) and “expert” (a real challenge!)\n• Choose between the original 8-bit soundtrack and a brand-new remastered one!\n• Choose between the original graphics or video filter","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"DotEmu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1442,"name":"Armikrog","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d06/d06001ce323845065e5a4e0429e0cf7b.jpg","description":"Armikrog is a unique stop motion clay animated point and click adventure game from the creators of Earthworm Jim and the Neverhood. Follow the adventures of space explorer Tommynaut and his blind alien talking dog Beak-Beak, as they unravel the mysteries of the fortress that holds them captive through exploration and puzzle solving!\n• Follow the adventures of space explorer Tommynaut and his blind alien talking dog Beak-Beak, as they unravel the mysteries of the fortress that holds them captive through exploration and puzzle solving!\n• Loveable characters designed by Doug TenNapel creator of the Earthworm Jim and developed by creators of The Neverhood, Ed Schofield and Mike Dietz.\n• Rich cast of voiceover talent brings Armikrog’s characters to life, including well-known actors Jon Heder (Napoleon Dynamite), Rob Paulsen (Pinky and the Brain) and Michael J. Nelson (Mystery Science Theater 3000).\n• Original soundtrack created and recorded by American songwriter and record producer Terry Scott Taylor.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Versus Evil","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":215,"name":"METAL SLUG DEFENSE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34b/34bdaf7136fe093f15296304cb5a2a9c.jpeg","description":"■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n20 Million Download World Record!\nThe real action game the world is crazy about!\n■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\nHere are some of the reasons of METAL SLUG DEFENSE's success:\n▼ Intuitive controls & intense action !\n\"METAL SLUG DEFENSE\" has become a worldwide success thanks to its very simple controls and its addictive gameplay!\n▼ 4 players can battle each other via the Multiplayer mode!\nUp to 4 players can confront each other in 1-on-1 or 2-on2 epic battles in multiplayer!\n▼ Intricate 2D dot pixels!\nThe characters of the \"METAL SLUG\" universe,  who were created by the best dot-pixel artists, return to fight each other in \"METAL SLUG DEFENSE\"\n▼ Epic battles between human beings, aliens and gigantic robots!\nMore than 200 different characters divided into 5 armies (Regular Army, Morden Army, Marians, etc.) join the battle in \"METAL SLUG DEFENSE\"!\n▼ Characters from \"KOF join the universe of \"METAL SLUG\"!\nThe most popular characters from the 2D VS Fighting game series \"KOF\" are ready to battle with their trademark moves in \"METAL SLUG DEFENSE\"!\nOfficial Facebook fan page:\nhttps://www.facebook.com/METALSLUGWORLD","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SNK","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":28451,"name":"Feeding Frenzy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4ad/4ad2befeb01eb322d4594e5268a16067.jpg","description":"Single Player, HD (High Definition) Take the plunge! You already know how much fun the Frenzy Coast can be, so go ahead and buy the FULL version now. Come on in… the water’s fine! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Oberon Media","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":22444,"name":"Avernum 6","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/652/65252a8e498742e92f823abedcb68997.jpeg","description":"Avernum is one of the great tales of indie gaming, an epic series of fantasy role-playing adventurers set in an enormous, subterranean nation. Avernum is a land underground, a subterranean nation full of rogues, misfits, and brigands, struggling for survival and wealth in the monster-infested darkness. Avernum 6 is the final chapter in the Great Trials Trilogy, three games that tell the tale of your weary land’s final destiny.\nAvernum 6 is the final game in the long-running, award-winning Avernum series. Explore a gigantic world, with a fascinating storyline, hundreds of quests, multitudes of side dungeons, and many hours of adventure. The game features clever enemies and dozens of interesting scripted encounters. Learn over 50 spells and battle disciplines. Hunt for hundreds of magical items or craft your own powerful artifacts.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21314,"name":"Power-Up","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/065/065b3bc22574dce294bda1bb203a9662.jpg","description":"POWER-UP is the modern-retro styled Shoot-Em-Up from one-man game studio, Psychotic Psoftware.\nSpanning vibrant locations to a monster soundtrack, Power-Up thrusts you into battle with a diverse range of fighters, freighters and titanic level guardians. If you loved retro SHMUP classics like R-Type, Hellfire or Project-X, you'll get a kick out of Power-Up's slick, detailed visuals, challenging gameplay and impressive arsenal of weapons.\nSYNOPSIS: The Earth is doomed! As you pilot the prototype fighter, Weapon-F through the debris of your vanquished escape shuttle you come to realise that you are the last human alive. You alone must take on the army of reptilian monsters responsible for the destruction of humankind. You alone must carry out your final mission... Revenge!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Psychotic Psoftware","platforms":[{"id":0,"name":"PC"}]},{"id":20988,"name":"The Cat and the Coup","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ba/9ba7427294439dc4440075c79ee6dffe.jpg","description":"The Cat and the Coup is a documentary game in which you play the cat of Dr. Mohammed Mossadegh, the first democratically elected Prime Minister of Iran. During the summer of 1953, the CIA engineered a coup to bring about his downfall. As a player, you coax Mossadegh back through significant events of his life by knocking objects off of shelves, scattering his papers, jumping on his lap and scratching him.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"University of Southern California","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20416,"name":"Copa Petrobras de Marcas","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/33b/33b9b2675df618e4a6b3b0d2170439b5.jpg","description":"COPA PETROBRAS DE MARCAS is the new release from Brazilian developer Reiza Studios, simulating one of the main series of Brazilian motor racing.\nPetrobras, as the title sponsor of the competition and strong supporter of the sport offers the Game as a free download for all gamers and racing fans alike!\nThis official game reproduces the thrill of competing wheel-to-wheel with 300 HP, FWD touring car models from various automakers in some of the main Brazilian race tracks such as Interlagos, Curitiba and the newly reformed Goiânia.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Reiza Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16929,"name":"Unity of Command: Stalingrad Campaign","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/956/95695a93d21a28e88acb866d5b99cfdb.jpg","description":"Unity of Command is an innovative and refreshing operational-level wargame that covers the entire 1942/43 Stalingrad Campaign on the Eastern Front. Playable from both the Axis and Soviet perspective, it strives to recreate the strategy, the forces involved and the general tension of that crucial period in World War II.\nExperience the highly fluid, enormously large battles of maneuver in a turn-based strategy setting. Take command in this mobile, back-and-forth sort of war where logistics and poor weather are often the decider, and defeat and victory are sometimes just a mile, or a day, apart.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"2x2 Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10887,"name":"Thea: The Awakening","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/20d/20d8b5bc7ff4b018625da46bf101c33f.jpg","description":"Thea: The Awakening is a turn-based strategic survival game steeped in Slavic myth and monstrosity set after an apocalyptic force known only as The Darkness has engulfed the world. There are Strigas and Baba Yagas aplenty, but there are no heroes, no monster slayers, and no great armies capable of banishing them. You have only a few hopeless and starving survivors who are desperately trying to stay alive. You are their last and only true hope!\nThe game combines turn-based strategic gameplay with the tension and grit of a rogue-like, a captivating story you can uncover through a series of in-game events, and a unique combat system based on a complex card battle game.\nThe wide range of gameplay features allows you to proceed through the world of Thea the way you prefer. You can choose to stay in your village and build up defenses, or you can go out and explore the world. Conflicts can be resolved through assassination, stealth, diplomacy, hunting, and various other ways depending on the skills your people possess. Fighting is not your only solution to conflict!\nChoose your game style and save your people from the Darkness!\nKey Features:\nSurvival game in a dark fantasy setting with hexagonal turn-based strategic gameplay!Huge procedural world to explore – each play-through is a new adventure!Village management with a variety of structures to build, upgrades and technologies to discover, and items to craft!Over 4400 items that you can craft in your village or gather in the game’s world!Expeditions in which each member carries his or her gear and gains experience in battle, improving abilities like collecting resources, diplomacy, healing, black magic, and dozens more!Over 200 non-linear story events that can grant you riches or deprive you of all your goods including life!Exciting card battle game system that can be resolved by combat, diplomacy, curses, and more!Over 100 types of deadly creatures, many inspired by Slavic Mythology!Procedural creature instances – Each creature, even in a swarm of spiders, has its own skills and stats!Day & night cycle influence gameplay – Villagers can better recognize threats from afar during the day, and creatures become more aggressive at night!Multiple game endings depending on your choices with rewards and unlocks carrying over to your next play-through!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MuHa Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":10315,"name":"Ghost 1.0","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/60f/60f1937f5c0e5fe51673db67e2724e7c.jpg","description":"\"Ghost\" is a metroidvania where two super hackers hire a mysterious agent in order to infiltrate the Nakamura Space Station and steal the greatest electronic secret ever. Of course, the space station will defend itself, which is where the fun begins: the station's defences, with their never-ending arsenal of weapons and artifacts, will have to be destroyed. But the story gets more complicated when the hackers find out about their agent's hidden ties...\nWEAPONS: Weapons reload on the go and they never run out of bullets. No need to hoard ammo for the boss battle! The various weapons can be found or purchased (depending on the game mode) and each one has its strengths and weaknesses.\nGHOST: The protagonist is not the android you see, but the being that remotely controls it: a mysterious digital ghost that can leave its robot chassis, pass through doors and walls, control enemy androids, and use their own tools against them. What happens if the robot you control gets destroyed, you ask? Then your ghost will be free to control something else, or return to your main body.\nUPGRADES: You can have as many as you can collect. The upgrades are passive, so they work without needing any special controls, and they don't run out or deactivate. They come in a large assortment, from aggressive drones to bullet improvements. Remember that the more you get, the more OP you are.\nITEMS: Devices you can use at any time. High-tech equivalents to potions and scrolls.\nGEEKIES: Spread throughout the game are hidden \"geekies\". If you find one and activate it, something related to that geekie will change in the game (not affecting gameplay)... and the challenge is to find out what changes. I know, it sounds silly, but some of them are funny.\nSECRETS: 200 rooms have secrets in them that can be revealed by performing a specific action. If you find a secret, you're rewarded with a small permanent powerup that will make your character more powerful. In addition, finding all of the secrets in each level will reward you with something very special.\nMAP: The whole map has around 300 rooms, divided into zones. Each zone has its own enemies, its own ambience, its own soundtrack, and, of course, its own boss.\nSTORY: The story is not to save the world, but rather to go on an intruiging journey wrought with humor. Not to mention all the dialogues and cinematics, all voiced in English.\nGAME MODES: Ghost has 2 game modes: \"classic\" and \"survival\". Classic is similar to a metroidvania, where the more you advance through the game, the more stuff you obtain and the harder the enemies become. Survival is crazier, as you get stuff much faster and you'll soon turn into a killing machine, but you lose everything when you die.\nSKILL TREE: The RPG component of the game is found in the skill tree, where you can spend skill points to level up characters, obtaining special skills for each one. Depending on what skills you select, your gameplay will change in an interesting way.\nAnd the rest is a mystery, one that I shouldn't spoil... you'll just have to discover the rest on your own.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"@unepic_fran","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9941,"name":"Peace, Death!","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d52/d526dc4de37213ea9ade97aa24207325.jpg","description":"Peace, Death! is an arcade simulator with difficulties. In this game, you play as the Reaper working for your boss, Death, in Apocalypse, Inc. You face a challenge: go through a trial period of seven weeks to get a permanent job and advance the interests of your employer.\nFeatures. You need to examine each client's feature to determine his, her, or its fate. There are more features every day and the game becomes more difficult. Your client holds a pistol? Send him to Hell unless he changes his mind and drops weapons. Is your client a hat-lover? Should you send him to Heaven? No, it's not that easy! First, take the hat off, and you might see the horns. Being a demon, killer, or an angel are features, too.\nCatastrophes. These are unique events, they're unexpected and rapid, so Reaper is pressed by time. But you must allocate clients correctly to complete a catastrophe, unlock new clients and increase Death's influence! Unlucky pirates, bear influenza epidemic in Siberia, fighting for a free soup ó these are only some of the catastrophes.\nEvents. Each week you will face a new event. The more days you worked, the more events you have. Trainees' phone calls, safes with smuggled goods, undercover agents of Paradox, kidnappersÖ They all pose some difficulties but help you to become the best in the biz. Why, you can even cook a soup!\nTheme Days. Each seventh day is a theme day. You'll choose clients' fate for a unique soundtrack corresponding to the spirit of the chosen theme. Egypt? Certainly! Mother Russia? Nostrovia! Pirate day? Yo-ho-ho!\nWhat else? Horsemen tasks, funny clients' phrases, lots of references and easter eggs, bonuses, penalties, very special clients ó all this will define your future as the Reaper determine the game ending!\nGood luck, Reaper!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"AZAMATIKA","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":962495,"name":"Super Mario Bros. Wonder","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1fd/1fd3f030bee73452d46a0678084a7ed9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":650621,"name":"Blasphemous II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73b/73bcfec00beec38a3d3527db4f9b8c53.jpg","description":"The Penitent One awakens as Blasphemous 2 joins him once again in an endless struggle against The Miracle. Dive into a perilous new world filled with mysteries and secrets to discover, and tear your way through monstrous foes that stand between you and your quest to end the cycle once and for all.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"The Game Kitchen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":45230,"name":"Comedy Night","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e3/5e3b2c7d1eba4617a0c03240a77a7227.jpg","description":"Do you have the talent to face off against other comedians in a live comedy show contest. See how your material holds up in the face of brutal audience members who can vote you off or the relentless smack talk from other performers.PerformPerform in-front of a live audience as a individual or go head to head with another performer. If you are an aspiring comedian this is a great sandbox to try out new material and perfect your show. If you can sing, see how a live audience responds in the open mic singing rooms or take other payers down in rap battle sessions.WatchBe be part of the audience and decide which performers stay or go by voting them off the stage. Heckle players or encourage them as they do there best to entertain you.CreatePlayers have full control over custom avatars as they use different styles and animations to enhance the performance.\n*Game Controllers are fully supported aside from the launcher.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Lighthouse Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16212,"name":"Wanderlust: Rebirth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/947/947f9432437d1bd2c8b431c5eb312f7c.jpg","description":"Wanderlust: Rebirth is an online four player co-op arcade-action RPG set in the fantasy world, Valandria. The heroes are summoned to Westhaven Arena to prove their worth as heroes of old legend. However, things are not as transparent as they first appear, when our heroes are unknowingly set upon a trek to save mankind from an ominous end. Band together with your fellow brethren to conquer and change the course of destiny.\nTake control of one of four character classes, each with a distinctive play style, and use your abilities with finesse along side the other heroes to gain high-scores and legendary items. Band together and plan your assault, for the minions of the underworld fear no blade, and only in Epic mode will the true heroines rise victorious.\nUnlock The Crawl survival game-mode to earn Tokens like a boss, and try your odds with the Luck Box, as you spin the slots for glorious loot or daring challenges.Key Features:Story and survival modes for both Single and Co-operative play\nCompetitive game modes featuring 8 players (4 vs 4)\nOver 65 awards and 30 Steam achievements to earn\n4 uniquely crafted character classes to advance through teamwork and efficiency\nUnique Inventory/Crafting system\nIn-depth Artificial Intelligence\n3 difficulty modes and 3 different endings\n44 different enemies and 15 intense boss battles\n...and over 5 years in the making, so you know it is DAMN good!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Yeti Trunk","platforms":[{"id":0,"name":"PC"}]},{"id":14999,"name":"Scrap Garden - The Day Before","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be0/be0c87bf1a3b0992a2937cfbcace1df0.jpg","description":"Special Offer\nAbout the Game\nA new chapter of charming 3D platformer about the little rusty robot C4N who unwittingly finds himself in the midst of momentous events in Robo Land. In order to solve the new riddle, Canny will once again need to run and jump a lot, solve puzzles, and fight against enemies who are much bigger and stronger than he is.\nTravel in time! Take part in the significant events unfolding the day before the main game. Find out new facts about familiar characters.\nUncover the secret of the engineer's disappearance in the catacombs under the city.\nTest your abilities in mini-games and puzzles.\nEnjoy the game ambience with a new score by the same composers who gave you the original game's soundtrack.\nReceive the new Scrap Garden chapter completely free of charge (the prequel is not DLC and does not require you to have the main game).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alexey Davydov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14491,"name":"Downfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fb/0fb8aaeb5845bfe156a9c5e564e959e2.jpg","description":"\"Everything was perfect... until then.\"\nFaust, the protagonist, had a successful life due to his dealings with the devil, but now he suffers from terrible dreams each night. To find what lies at the end of those dreams—to end it all—he decides to plunge into those nightmares and face the monsters that lie within...\nDownfall is a roguelike hack-and-slash game where you develop your character by stylishly defeating the endless waves of enemies within your nightmare.\nCollect various relics and skills to create your build, strengthen the items you've acquired, or create new items to upgrade and empower your character!\n《Electrifying roguelike shooting action!》\nWipe out waves of oncoming enemies with rifles, machine guns, shotguns, rocket launchers and more, all with their own unique styles! Improve your abilities with the various active and passive skills you acquire in combat to slip through the enemies and survive!\n\n《Throw away nothing as you collect and develop》\nEquipment can be disassembled or synthesized to upgrade its rank, relics can be displayed in your exhibition hall regardless of rank, all providing ultimate, permanent stat boosts! Boost your relic and equipment collection to take on higher levels of challenge!\n《Ample content to enjoy and hundreds of stages!》\nLast as long as possible against attacking hordes in Survival mode, face increasingly powerful enemies and bosses in Hunt mode, and acquire relics necessary for improving your stats in Excavation mode. Repel each enemy and boss that wishes to stop our protagonist in turn!\n[Controls]\n- Controller (Xbox Wireless Controller)\nMove: L Stick or D-pad\nAttack: A or Y\nSkill: X\nReload: RB or RT\nDodge: B\nPause: ☰\nConfirm: A\n- Keyboard\nMove: WASD or Arrow Keys\nAttack: ENTER or E\nSkill: Q\nReload: R\nDodge: SPACE\nPause: ESC or TAB\nConfirm: ENTER※ Regarding gameplay upload and streamingAny individual or company may stream or upload videos of this game as long as the copyright information and store URLs are included within the video description or the video itself. We would appreciate creators leaving out spoilers of the ending whenever possible.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Harvester Games","platforms":[{"id":0,"name":"PC"}]},{"id":2471,"name":"Coffin Dodgers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a58/a58c0967d2f52b57b7919081306f2e81.jpg","description":"Coffin Dodgers sees you take on the role of saving one of seven quirky retirement village residents, each racing for their soul in \"pimped up\" mobility scooters against none other than the Grim Reaper himself. Our old heroes are armed with a variety of homemade weapons and gadgets to take on anything the Grim Reaper and his Zombie army may throw at them. Can you survive the retirement village?\nPlayers must battle it out against The Grim Reaper and other competitors over a 13 race Championship, where only the most skilled racer will survive. There are 4 distinct areas within the Sunny Pines Retirement Community, each featuring it's own mini tournament in which your rank against other competitors will ensure you progress to the next stage; however finish bottom of the pile and the Reaper gets to take your soul. The final race takes place over each of the 4 areas in a straight shoot out between you and the Grim Reaper.\nAs the game progresses the game environment becomes more and more apocalyptic as Grim's shadow slowly engulfs Sunny Pines. Look out for Grim's retinue of fiendish friends as they try and halt your progress.\nKey Features:\n• Race & Battle the Grim Reaper and his army of zombies.\n• Save one of the 7 quirky retirement village residents\n• Customise and modify your mobility scooter\n• Player to player combat & rag doll physics\n• 3D open world game environment\n• 13 unique race tracks\n• Single player Story and Time Trail modes\n• Online Multiplayer race mode\n• 3D Open world single & online multiplayer game modes\n• Local multiplayer versus race mode (2-4 players)\n• Full controller & keyboard support\n• Steam Trading Cards and Achievements\nWelcome to a suburban retirement village where all is not as it seems…\nAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil.\nHowever, a creepy new resident, Mr Grim Reaper, looks set to turn retirement on its head. After years trawling the earth for souls to harvest, Mr Grim Reaper concludes Sunny Pines is where he’ll lay his hat, where he can harvest souls from the comfort of his rocking chair. However, seven of the sprightliest senior citizens have other ideas and set out to prove that life for Grim in Sunny Pines definitely won't be like shooting fish in a barrel.\nThe stately seven decide to strike a deal with the Grim Reaper; a mobility scooter racing championship to the death. If they can prove themselves to be fast and full of life, surviving and ultimately winning the championship, then he will allow them to live. However, too slow and they will be condemned to the retirement village in the sky.\nWhat the Reaper doesn’t tell the folk of Sunny Pines is that once he takes your soul he can bring you back as one of his army of the living dead; mobility scooter racing zombies that are hell bent on making sure that nobody wins, by any means possible.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wales Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":722618,"name":"INSURGENCY: Modern Infantry Combat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/522/522bb831f5867177cb576805a98f2b17.jpg","description":"Grab your rifle, join your team mates, and enter the fight. Take to the modern battlefield and engage in intense, realistic battles. Choose your side between a highly organized conventional army or the partisan insurgents. Teamwork, tactics, bravery and discipline are the keys to your success in a deadly and treacherous modern war environment.\nINSURGENCY: Modern Infantry Combat represents the modern battlefield on the individual and tactical levels. Only the best players will become commanders and get the chance to lead its entire team towards victory. This is a game where real-world squad and guerrilla tactics are necessary to stay alive and repel the enemy, and is geared towards clans and organized teams of players.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"New World Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":366883,"name":"Everspace 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a2/8a211877151a55a09e87061118012281.jpg","description":"EVERSPACE™ 2 is a fast-paced single-player space shooter with deep exploration, tons of loot and classic RPG elements. Experience a thrilling story set in a vivid, handcrafted open-world full of secrets and perils on your journey to become human after all.\n\nIn the campaign, you will make some friends with their own story to tell. They will join you on side missions and provide certain benefits in the endgame, where vicious encounters and brutal challenges will stand between you and that next epic loot drop.\n\nEmbark on an exciting journey\n\nDiscover alien species, unveil mysteries, find hidden treasures and defend your valuables against outlaw clans. But don’t get cocky: there will be some high-risk/high-reward areas waiting for you where grabbing that ultra-special gear and getting out alive will require some serious piloting skills and all your talent for improvisation.\n\nLet the lasers do the talking\n\nAnnihilate your foes the EVERSPACE™ way: Dodge, dash, roll and boost guns blazing into frantic dogfights, leaving only a trail of space scrap behind. Use a wide range of weaponry and abilities to defeat a large variety of opponents like drones, fighters, heavy bombers and powerful gunships all the way to massive capital vessels. Always look around and use your environment to your advantage, and gain the upper hand even if you are outnumbered.\n\nHave it your own way\n\nExpand your private ship collection from a virtually endless supply of ships, composed of various unique ship classes and optimize your build to perfection. Cleverly combine modules, weapons, devices, and perks to fit your individual playstyle and the current objective.\n\nEpic loot awaits\n\nHunt for the next better gear and be ready to constantly re-evaluate your current setup. Look for loot that fits your playstyle but be willing to leave your comfort zone and try something new. Be ready to find and exploit synergistic effects between equipment, perks, devices, and ships to fully maximize their potential.\n\nFrom rags to riches\n\nRoam the world looking for the best deals on certain commodities, becoming the part-time trader you always wanted to be. However, prices will vary based on supply and demand, so you better check about the latest offerings before you set course to the next trading station. Always be on the look-out against ambushes during interstellar travel.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"ROCKFISH Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":53251,"name":"Donkey Kong Country 2: Diddy's Kong Quest","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b2/1b2b82bd26350d64c3d057c0206010ae.jpg","description":"Donkey Kong Country 2: Diddy's Kong Quest is an adventure platform video game developed by Rare and published by Nintendo for the Super Nintendo Entertainment System (SNES). It was first released on 20 November 1995 in North America, 21 November 1995 in Japan and on 14 December 1995 in Europe. It is the second installment of the Donkey Kong Country series and serves as a direct sequel to Donkey Kong Country. It was also re-released for the Game Boy Advance in 2004. The game was made available for download on the Wii's Virtual Console in 2007, and for the Wii U's Virtual Console in 2015. It was followed by a sequel, Donkey Kong Country 3: Dixie Kong's Double Trouble! in 1996.\nThe story revolves around Diddy Kong and his girlfriend, Dixie Kong, who try to rescue Donkey Kong after he is abducted by King K. Rool. The game is set on \"Crocodile Isle\", in which there are eight worlds of varying environments, totalling to 52 levels. The game utilises the same Silicon Graphics technology from the original, which features the use of pre-rendered 3D imagery. Diddy's Kong Quest received critical acclaim, being widely regarded as one of the greatest 2D platformers ever made. Praise was directed at its graphics, gameplay, and soundtrack. It was the second best selling game of 1995 and the sixth best-selling game on the SNES.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"},{"id":0,"name":"SNES"},{"id":0,"name":"Wii"}]}]