[{"id":13742,"name":"Fausts Alptraum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b8/9b828fcc60b3c519025d7edebdd4cd83.jpg","description":"Elisabeth Faust was attending her father's funeral.\nFather had left her sorrow, depression, and an antiquated house.\nShe walked into the building and followed a black cat down to the basement.\nDarkness suddenly claimed her sight.\nA purple demon materialized out of nowhere, smiling like they were old friends.\nThe person she’d come to find was nowhere to be found.\nThere was a sweet fragrance in the house.\n\"I’ll show you the way out if you really want to leave.\"\nThus the crayon illustrated story began,\nbut she couldn’t tell if this was memory or imaginary.\n“But if at any moment, you wax nostalgic about your time here,\nor wish to preserve any instant for eternity, you lose. ”\nCandlestick in hand, she now has to seize the faintest trail to escape from this nightmare.\n****\nEnglish Translator: etvolare\nhttp://volarenovels.com/\nJapanese Translator: 張毅、悲傷的小魚\nMusic Credit:\nAlessio Nanni,\nhttps://twitter.com/alessionanni\nBrian Hanke\nhttp://brianhanke.com/\nIrene Kim\nhttp://www.irenekimpianist.com/","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"LaboRatStudio","platforms":[{"id":0,"name":"PC"}]},{"id":12203,"name":"Pocket Kingdom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70d/70d787b34e4592c26ac16f8a9c6772df.jpg","description":"Certain rumors persist among air travelers. Rumors about mysterious islands that sometimes appear up there in the clouds out of the blue. According to the legend, the Old Gods withdraw to those islands, casting spells of oblivion and serenity on them.\nThe chief editor of a well-known newspaper made me an unusual offer. He promised to reward me for bringing photographs of one of those peculiar islands and the God resting there.\nA strange offer, to say the least. One I could not refuse however: at that time, creditors were incessantly banging at my door. When they threatened to seize my beloved airship to pay off the debts, I didn’t think twice and immediately left on my quest.\n\nPocket Kingdom is an authentic throwback to Amiga era. Signature steampunk pixel art, winsome chiptune soundtrack and retro-inspired gameplay with modern twists make Pocket Kingdom an unparalleled journey.\nWander around the island's enchanted districts. Unlock access to new areas by collecting objects scattered here and there. Trick gravity, discover helpful devices and listen to the weird stories told by the locals. Getting out of the Pocket Kingdom depends on it. So does unveiling the place's mysteries.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"08 Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11374,"name":"Syrian Warfare","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7bf/7bfd47b888a37112c37f42b4f2b178fd.jpg","description":"This war has been going on for a long time, and it's hard to say when it will be over. We got so used to it that news from Syria has become trivial. We've even already forgotten how it all started, and where the roots of the terrible terror lie – the terror that swept across Europe in recent years.\nSyria is all over the news, and it's become a subject of many documentaries. We, however, want to show the story through the lens of the game and don't let the word \"game\" mislead you. This game does not claim to be a history lesson, but it shows the course of the war in all its seriousness through the major milestones, from the first days till the latest important victories over terror.What kind of a game is it?Syrian Warfare is a real time strategy with a high degree of realism. This game is not about a base construction or units production. The player will have to determine their forces characteristics before they go into action. And during the mission, they would be able to select reinforcements in order to support the troopers.\nThe troops and machinery crews move from mission to mission and gain experience, which helps them increase their effectiveness.\nTrophies captured by the player on the battlefield can be used throughout the whole campaign.\nImportantly enough, there are no «life bars» for vehicles in the game. Damages are calculated by taking into account the protection module and the power of adverse factors. Inflicted damages affect the functioning of the module.\nIn the battlefield, it is impossible to repair the armor, but one can repair the modules by using a limited stock of spare parts. Ammunition and fuel are also limited.\nA system of high-quality physical demolition of buildings and other objects is used in the game (it does not only look spectacular, but it has a serious influence on the tactics during the missions, especially in urban areas).\nThe game has a wide set of tactical possibilities: The storming of buildings, usage of smokescreens, infantry lift by helicopters and APC/IFV, air strike calls, capturing of trophy weapons and equipment, usage of heat flares and active defense complexes.\nAnd of course the story itself. We will try to show the conflict, not from a point of view of a general, located somewhere at the ‘top’. No, it will be a story of a man, who lived in the country that descended into hell. A story of struggle, loss and regained hope.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cats Who Play","platforms":[{"id":0,"name":"PC"}]},{"id":9583,"name":"8Bit Fiesta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cd/4cd9e2a1c0a4f55424b3d9567fcfae14.jpg","description":"Need to get a party started? All righty then!\n8Bit Fiesta brings everything you need to the table with its action packed local multiplayer mayhem including a built in drinking game! Choose between a ton of characters and challenge your friends and prove yourself worthy the title \"King of the Fiesta\".","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Linus Fredriksson","platforms":[{"id":0,"name":"PC"}]},{"id":6938,"name":"Tiltagon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/757/757e7ad6d8e7f3a5db0523b345a579c6.jpeg","description":"Tiny arcade game with plenty of challenge. Master all levels and battle on the Steam leaderboards against other players. Test your skills and see how long you can survive in the Endless mode. Unlock crazy balls like Skull, Strawberry, Football Helmet, Baseball and more!\nFeatures:\nLevel mode with 10 challenging levels\nEndless mode with two difficulty levels\n36 unlockable balls\nMinimalistic visuals and energetic EDM soundtrack\nPlay with either controller, keyboard or mouse\nSupports Steam Cloud, Achievements, Leaderboards and Trading Cards\nTiltagon is made by Kiemura, a game company from Finland. Music by Pointless Payback, Tatu Toukola, Rascal Kidd, Jay Mata and S4mthing.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":4410,"name":"Disgaea 3: Absence of Detention","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Take a field trip any time you want with Mao, Raspberyl, Almaz, and the rest of the Evil Academy gang when Disgaea® 3 returns on the PlayStation®Vita system! Feel the cool breeze blow through your hair as you Magichange while sitting at the top of a hill, looking down on the beautiful city below. Featuring 5 new chapters, there’s even more school life fun to be had!\n1 player(s)\n9600KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© 2012 Nippon Ichi Software, Inc.\n© 2012 NIS America, Inc. All rights reserved.\nDisgaea is a registered trademark of Nippon Ichi Software, Inc.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"NIS America","platforms":[{"id":0,"name":"PS Vita"}]},{"id":2513,"name":"The Sun and Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/827/827359772c54be643cfbc3d29b4e7f4c.jpg","description":"The Sun and Moon, the winner of Ludum Dare 29, is a platformer with a unique mechanic: you can dive into the ground. Momentum is conserved but gravity is reversed, letting you fling yourself high into the air or deep beneath the surface. The goal is always straightforward - collect the three orbs in the level and jump into the wormhole - but spikes, endless drops and impossible heights make this more and more difficult.Key Features\nDive into the ground - This unique mechanic preserves your momentum, letting you use the level itself to overcome a huge range of challenges.\nConquer over 150 levels - Run, jump and dive your way through levels spanning from easy to brutally difficult. You'll need to both master the controls as well as think outside the box.\nNon-linear level unlock system - Explore the game in whatever order best suits you.\nAchieve Time Goals - Three tiers of medals provide an additional challenge for even the easiest levels.\nMinimalistic graphics - Straight-to-the-point graphics help you focus on the gameplay.\nMusic by Dubmood - A killer track that grows as you progress.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":978303,"name":"Dragon's Dogma 2 Character Creator & Storage","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6a/a6a999f008d34cdafab896530adebad1.jpg","description":"Prepare for your grand adventure, Arisen!\nIn this app, you can create your characters for Dragon's Dogma 2. Customize the looks of your main character, the Arisen, and the looks and inclination of your companion, your Main Pawn. You can store up to 5 characters of each, the Arisen and your Main Pawn respectively.\nThe character data created in this app can be transferred to the base game of Dragon's Dogma 2, available separately.\nIn the main game there will be additional graphic options available.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Capcom","platforms":[{"id":0,"name":"PC"}]},{"id":460527,"name":"Fantasy General II: Prologue","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3b/f3ba717ca93d09d6d7fc865c3ef10f5d.jpg","description":"The fantasy wargaming classic is back! Lead powerful heroes and mighty armies into battle in this free-to-play turn-based strategy game. Level up and train your units and guide them through the Curse story campaign.The Curse Campaign\nThe Curse is a free procedurally generated campaign for Fantasy General II.\nEveryone can play the Curse by downloading and installing Fantasy General II: Prologue, completely for free. You don't need to buy and own Fantasy General II in order to play it. The Curse is a free campaign giving you a taste of what Fantasy General II has to offer.\nSelect one of three Heroes and embark on a quest that will unveil a dark secret.Level up your Hero and customize your Army\nBattle after battle, your Heroes and units will gain experience and gain upgrades or powerful new skills... provided they survive.Mighty artefacts and powerful spells\nDominate the battlefield by employing powerful artefacts, ancient weapons, magical medallions; turn the tides of war with devastating arcane spells.Undead, dragons, lizardmen, harpies...\nKeldonia is a land of variety. Recruit (and fight against!) all kinds of mysterious and arcane creatures, from Werebears to Trolls.A taste of a richer world...\nIf you liked the Curse campaign and you would like to play the full version of Fantasy General II, with more heroes, more units, a longer story campaign, skirmish mode and multiplayer, look no further.\nhttps://store.steampowered.com/app/1025440/Fantasy_General_II/","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Owned by Gravity","platforms":[{"id":0,"name":"PC"}]},{"id":428128,"name":"Idle Big Devil","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/580/5805311188ee6beba5be43fad2fde559.jpg","description":"Thank you for comingOur testing is over and a new version is being prepared, please contact us through facebook/discord/QQ groupfacebook:Hero IdleDiscord links in the community\nAbout the Game\nHumans, Demons, Elves and Undead coexist peacefully on the same continent until the balance was broken: A fallen prince of the human kingdom accepted the contract with Undead, and evil spirits arose from the hell to cloud the minds of most creatures.\nIn such a critical situation, you are appointed by the King as a new lord with the duty to gather new heroes to fight against the darkness.\nOne of the elders secretly tell you a secret that the energy of heroes can be combined.\nAnd the High Priest creates a device to duplicate heroes. All duplicates have no feelings or minds.\nWith all these, you are going to prepare yourself for monsters, fallen heroes, and other competitive lords.\nAn idle PRG gameA game combining SLG and idle mechanismA casual game where you can just idle and progressDozens of unique heroes with amazing skillsEnhance them regularly to win more battlesFour fractions that can be strategically combinedA big complicated world map full of challenges\nChoose from the four roles available and interact with other players around the worldBuild your own best formation! Have you seen the formation with 5 identical heroes?Remember to upgrade buildings regularly that produce tons of free resources every dayExperience various gameplays including world exploration, random events and treasure maps\nWe are intended to create an interesting idle 3D RPG game for our fans. Every hero is designed to be unique.We hope you can enjoy fun while playing the game in your spare time, so it won’t be a hardcore nor a P2W game.PVP elements are cut down to the extent that cooperation is more important than competition among different players.Of course, there is a more aggressive game mode available for PVP lovers.For now, we have opened 2 servers: \"NA SERVER\" and \"国内\", but you can freely transfer your account from one to another.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"HONG KONG SPARK SOFTWARE TECHNOLOGY CO","platforms":[{"id":0,"name":"PC"}]},{"id":353492,"name":"Hello Neighbor Alpha 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a6/0a68dfba34efbd35d74a763a92dc0cc0.jpg","description":"Hello Neighbor is a stealth horror game about sneaking into your neighbor's house to figure out what horrible secrets he's hiding in the basement. You play against an advanced AI that learns from your every move. Really enjoying climbing through that backyard window? Expect a bear trap there. Sneaking through the front door? There'll be cameras there soon. Trying to escape? The Neighbor will find a shortcut and catch you.\nSuspenseful horror gameplay that focuses on sneaking around your neighbor's house\nConstantly evolving experience where the Neighbor's AI counters your moves, and learns from what you do\nSandbox-style gameplay with plenty of environmental interaction and physics","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Dynamic Pixels","platforms":[{"id":0,"name":"PC"}]},{"id":274759,"name":"Marvel Ultimate Alliance 3: The Black Order","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e80/e802f7a84a3ab4767b09521315de8dda.jpg","description":"Assemble your ultimate team of Marvel Super Heroes from a huge cast including the Avengers, the Guardians of the Galaxy, the X-Men, and more! Team up with friends to prevent galactic devastation at the hands of the mad cosmic tyrant Thanos and his ruthless warmasters, The Black Order.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":63680,"name":"150,000 B.C.","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/865/8652a8cd84ad620a93cd2749a6a1deaa.jpg","description":"Take your primitive weapon and run! 150,000 B.C. Shows you a new wonderful world - with a lot of dangers and surprises. Is there enough courage in you to make this journey?Features:Prehistoric setting\nMany obstacles\nNice design\nPleasant music\n150,000 years BC. You are an unshaven native with a club. A small piece of cloth serves you as clothing. There is still an unknown world around you and no modern technologies. That means that if you are in danger, you can not make a call to a friend - You always have to rely on your own strength. Your task is simple: survive at any cost.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Online Vision","platforms":[{"id":0,"name":"PC"}]},{"id":61823,"name":"CONFLICT OF NATIONS: WORLD WAR 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d66/d6679c679080d97bd4c35b52a53a7714.jpg","description":"In the 21st century, mankind once again stands on the brink of all-out war. A new arms race has begun, and tensions are rising. The world’s future lies in the hands of a few military masterminds.\nIn these trying times, our nation looks to you for guidance. Will you favor diplomacy over deadly force? Will you forge strong alliances for a shared, prosperous future? Or can peace only be achieved through global domination?\nWe are awaiting your orders, commander.FEATURESComplex Real-Time Strategy\nProve your worth in multiplayer matches that can last anywhere from days to weeks. Plan multi-layered attacks, lead joint strike forces, and set up cooperative defenses, while the battlefield evolves day by day. From infiltration missions deep behind enemy lines, to the mobilization of entire fleets, you control every aspect of the battlefield.\nPersistent Multiplayer Games\nFace up to 64 players on our largest map, and form coalitions with other players for joint victory. Make friends and enter into enduring alliances with your most trusted brothers in arms. Join any number of player vs. player games, and experience scenarios ranging from the cold war all the way to modern global conflicts including terrorist insurgencies.\nModern Weapon Systems\nField hundreds of unique weapon systems and units. Research and mobilize American, Russian and European signature military technology, such as the Nimitz-Class Aircraft Carrier, MiG-29 Fulcrum Air Superiority Fighter or the Leopard 2 Main Battle Tank. Compose your nation’s armed forces in the air, on land, or at sea.\nWeapons of Mass Destruction\nDeter your enemies and unleash untold destruction. Your arsenal includes a range of some of the most devastating weapons known to man, ranging from chemical cruise missiles, to nuclear ICBMs. But be warned, these weapons come at a cost: Contamination, crimes against humanity, and declining national morale are factors you need to carefully consider.\nThree Military Doctrines\nContinuously advance your economy, military, and weapons research. Unlock your forces’ true potential through your nation’s doctrine, featuring its own technology tree and iconic units. Carefully balance your resource requirements, mobilisation costs, and military improvements to win the industrial war.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Dorado Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":60493,"name":"Ready Player One: OASIS beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db4/db496ba57ed2714fff93b67a49aea654.jpg","description":"Enjoy Ready Player One: OASIS beta on Vive and Vive Pro! (Click here to see more!)\nThe OASIS beta is inspired by the immersive virtual universe the OASIS from the film Ready Player One, which is set in the year 2045. In the Oasis beta’s ever-expanding universe, players are able to explore, compete in, and launch multiple VR experiences using their own custom avatars. Global leaderboards track the performance of all players as they earn points (coins) throughout the following experiences: Rise of the Gunters, Battle for the OASIS, Gauntlet and Smash.\nGauntlet - Navigate through a seemingly endless dungeon while the undead seek to destroy you. Collecting gold will improve your score and eating food will restore your health, but only your bow skills will ensure that you make it our alive.  (Developed by Directive Games)\nBattle for the OASIS - Help to save the OASIS by defeating waves of IOI Sixers. Advance through the trenches of Planet Doom towards the snowy planes that surround Anorak’s Castle. With an arsenal of potent firepower, you must stop the Sixers from controlling the fate of the OASIS. (Developed by Steel Wool Studios)\nRise of the Gunters - Fight against a nearly invincible army of highly trained IOI Sixers alone OR with up to two of your friends! Proceed with caution as you defeat Sixers, collect their coins, find power ups and survive a merciless onslaught of hyper-explosive kinetic action for as long as you can survive. The OASIS is yours. Take it back from IOI by yourself or with up to two fellow Gunters! (Developed by Drifter Entertainment Inc.)\nSmash - Enhance your hand and eye coordination in this nod to James Halliday’s favorite 80's arcade games.\nFracture - Heighten your spatial awareness and reflexes in this throwback to 80's brick smasher games re-imagined in VR.\nExplore the OASIS today and find something bigger than yourself.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Directive Games","platforms":[{"id":0,"name":"PC"}]},{"id":59121,"name":"Grand Theft Auto: London 1961","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d45/d45603b311b34e5351a809ed210c336f.jpg","description":"Freeware mission pack for Grand Theft Auto: London 1969","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Rockstar Canada","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":56174,"name":"Pokémon Colosseum","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f7/8f738dce65f8bd826fc7e1b756376f29.jpg","description":"Pokémon Colosseum (ポケモンコロシアム, Pokemon Koroshiamu) is a role-playing video game developed by Genius Sonority, published by The Pokémon Company and distributed by Nintendo as part of the Pokémon series.\nPokémon fans can now battle their favorite Pokémon on the grand stage. Starring a brand new leading character, Pokémon, Colosseum offers a story mode that pits you against tough trainers who routinely catch damaged Pokémon. In Battle mode, you can use the Game Boy Advance cable to send your team from your Pokémon Ruby or Pokémon Sapphire Game Pak to your Gamecube, then witness the true potential of your team. Rescue Pokemon and watch them come to life in spectacular Colosseum battles.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Genius Sonority","platforms":[{"id":0,"name":"GameCube"}]},{"id":52831,"name":"Crash Bash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/87d/87da91638f2b6f4754e4cb316e798687.jpg","description":"Crash Bash is a party video game developed by Eurocom and published by Sony Computer Entertainment for the PlayStation.\nCrash Bash is the fifth installment in the Crash Bandicoot series. It is the first Crash Bandicoot game not to be developed by Naughty Dog (who had left the series to develop the Jak and Daxter series), the last game released for the PlayStation console, and the first in the party genre (the second being Crash Boom Bang! six years later). The game's story centers on a contest of minigames held by Aku Aku and Uka Uka to decide whether good or evil is the strongest.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Eurocom","platforms":[{"id":0,"name":"PlayStation"}]},{"id":51534,"name":"Fantasynth: Chez Nous","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1d/d1d399434f38832c1b3767f6b1a74c17.jpg","description":"Fantasynth: Chez Nous is an audio-reactive experience designed for Virtual Reality.\nGlide through a procedurally populated environment that comes alight with the music.\nOfficial Selection SIGGRAPH Animation Festival 2017.\nFeaturing the song Chez Nous by N'to, published by Hungry Music.\nDuration: 7 minutes.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"HelloEnjoy","platforms":[{"id":0,"name":"PC"}]},{"id":46792,"name":"Left Alive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/248/24837fdd30aed87ba739dd0b9d46448b.jpg","description":"Left Alive is a spin-off installment of Front Mission franchise. Its events are set between Front Mission 5 and Front Mission Evolved. \n\n###Plot\nThe game is set in the year 2127 on Christmas Eve in a fictional East European country called Ruthenia. The plot concerns an invasion of the city of Novo Slava by the Garmonia Republic army (all of them are also fictional), an event that is known as “One Day Incident”. The plot is non-linear and is divided into stages corresponding to the stories of certain characters.\n\n###Characters\nThe game follows three playable characters of Slavic origin, who are left isolated in Novo Slava: Mikhail Alexandrovich Shuvalov, Olga Sergeyevna Kalinina, and Leonid Fedorovich Osterman. They have separate plotlines and methods of progression, but all of them share one goal: to survive in the fierce street battles. The game switches the player between protagonists throughout the story.\n\n###Gameplay\nThe game combines survival action with mecha simulation. Left Alive features wanzers, the Front Mission's trademark walking battle robots. They are delivered to battle using helicopters. The player does not only fight against the wanzers, but the game also allows him or her to steal and pilot one. Left Alive also includes weapon customization and crafting options.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":42045,"name":"Mass Effect 3: Citadel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b13/b133d2b51b2eb5e3da7ca2aef14bae92.jpg","description":"When a sinister conspiracy targets Commander Shepard, you and your team must uncover the truth, through battles and intrigue that range from the glamour of the Citadel's Wards to the top-secret Council Archives.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BioWare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":36789,"name":"The Precursors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd9/fd921868209f395d84f5612d5b530036.jpg","description":"Precursors, predecessors, the legend of galaxy… Who are carrying the forebear’s genes among existing races, we can suppose only…\nWorlds of galaxy are everlasting, beautiful, unique and dangerous. Some of them are inhabited, some ruined and deserted, other - just a smugglers trans-shipment stations.\nSome worlds are only at the beginning of evolution, other are falling into decay. Only when you’ll pass through all these worlds, sense a heat of blazing lava-seas and chilling cold of abysses, see the stark heavens, you will realize the real power of nature. Only when you’ll meet corrupt judges, mendacious politicians, unselfish protectors and cruel tyrants you’ll understand passions of society. When you’ll reach an unexplored sectors of galaxy and come across a mysterious natural phenomenon, fly through the tail of the comet or dive into the casual portal, only then you’ll perceive the infinite depth and diversity of the universe.\nBut this is just a prospection and nobody knows what exactly this journey will be, we can only assure you that it will be unforgettable…\nGame Features\nUnique gameplay: mix of RPG/FPS/Space simulator.\nVery different planets to walk around absolutely free.\nMore than 250 diversified quests.\nPartly organic weapons with ammunition that must be bred.\nControllable spaceships, robots and other vehicles.\nStunning space battles with boarding included.\nBig number of unusual enemies (Plants, Insects, Birdmen, etc).\nTrading possibilities with complex circulation of goods.\nInteraction with hundreds of NPC of different Alien races.\nReal-time weather effects, day/night and atmosphere changes","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Deep Shadows","platforms":[{"id":0,"name":"PC"}]},{"id":28503,"name":"TotemBall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/884/884505c10d9d1a4b503e547608a2ceb1.jpg","description":"Single Player, Local Multiplayer 1-2, HD (High Definition), Xbox Live Vision Camera Required. The Ptolmec tribe needs your help! Guide Pterry the Pturtle through his jungle home. Use your Xbox Live™ Vision camera to navigate across islands, over bridges, and through ancient ruins. Your goal: collect the missing musical totems and bring the music back to the Ptolmec Pinball Party! Try TotemBall today. Download the full game now for FREE! This title requires Xbox Live Vision Camera. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Freeverse","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24768,"name":"Obscure: The Aftermath","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b81/b81b77fb81e7fc304c7bdbb4ae99e35a.jpg","description":"Two years ago at Leafmore High, a group of young teenagers were trapped\ninside their school and hunted by monsters that had been released by the\nmaniac principal. Some of them survived that terrible night, while most\nothers perished. The survivors have since picked up their lives and\njoined college.\n\nBut something strange is now happening at Fallcreek University...\n\nBlack flowers have suddenly sprung up everywhere on campus. While\nexperimenting with these flowers in class, students discovered a\ndangerous substance that induces strange but vivid dreams. A handful of\nstudents soon find out that there is more to the\n\nflowers than anyone could have ever expected. When the seeds finally\n\ngerminate, a bad trip suddenly turns into a horrible reality...","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Hydravision Entertainment","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"}]},{"id":22077,"name":"Spiritual Warfare & Wisdom Tree Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/726/7263c3dcec82d4c9ce8924f061da740a.jpg","description":"Spiritual Warfare is a Zelda-like overhead action game You're a soldier in the army of the Lord. Explore the regions of a modern city as you attempt to collect the full armor of God. Along the way, you'll encounter villainous characters and numerous obstacles designed to test your faith. Correctly answering Bible questions will help restore your health and strengthen your spirit.\nBible Adventures:\nBe a part of Bible stories as exciting characters come to life. Help Noah fill the ark before the big storm; pretend you are David battling the giant Goliath; and help save baby Moses from the Pharaoh's overwhelming forces. Assisted by direct quotes from the Bible, your adventure will be fun and educational.\nRecommended for Ages 4 and up!\nExodus:\nHelp Moses solve the puzzle with 100 fascinating levels featuring mazes and other obstacles to faith. With your staff and the spoken Word of God, you will defend against enemies including magicians, taskmasters, Pharaoh's soldiers, weaknesses of man, hardened hearts, and other devices that challenge the character of God. Along the way, Moses can gather Holy oil, the armor of God, greater faith, and much more.\nIllustrated with 50 colorful reward screens, this learning tool also includes 250 questions spanning the entire book of Exodus.\nJoshua and the Battle of Jericho:\nYou, as Joshua, must lead God's people into the land of promise. But watch out! There are falling rocks, soldiers, battering rams and elite forces that will try to block your every move. Sound challenging? You bet! But God has given you the power. Weapons like the horn of Jericho, God Speed, power-ups, secret exits and other armor will help you in your quest. Conquer the Canaanites, Amorites and Hittites as you collect silver and gold, race through deadly mazes, and defeat the enemies of God!\n100 levels & 20 bonus levels\nDigitized speech and sound\n250 questions\nTwo player option","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Wisdom Tree","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":22022,"name":"OVIVO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94c/94c464617fa15daffecd95cc221a816b.jpg","description":"OVIVO is a metaphoric game filled with illusions and hidden messages. In the world of OVIVO Black and White exist in harmony. Constantly intertwining and replacing each other they maintain balance. The main character named OVO created from these two halves of the world and it has the ability to switch between them. OVO travels through the metaphoric world, overcomes various dangers and collects mysterious symbols. These symbols help you to unravel the story of this world but how you interpret it is completely up to you.\nFeatures:\nFlow mechanics. In white, the gravity force is directed downwards, in black - upward. Preservation of momentum while transitioning from one color to another allows OVO to float along their border as if it is carried by the flow.\nFascinating art. The metaphorical world of OVIVO is full of hidden images and optical illusions.\nDesign without words. There is no text in the game and the story is narrated through gameplay and visuals.\nSymbolism and puzzles. The game is filled with allusions and hidden messages.\nMeditative ambient soundtrack by Brokenkites.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sometimes You","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":21812,"name":"Air Guardians","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e66/e66ebef0b61c2317b858d2bc91cd124f.jpg","description":"Air Guardians is a flight combat game set in the distant future. A world government is attempting to seal their grip on power, and an air force of advanced fighter craft is called upon to fight them. Fight through grand spaceship battles, night time base raids, orbital shipyard assaults, and more! Enjoy Cut scenes between missions and in game narration that adds story and intensity to the battles. Along with Realistic ground environment and detailed spaceship models. The simple controls and gameplay lets you get into the game without hours of learning.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lazy Bum Games","platforms":[{"id":0,"name":"PC"}]},{"id":21574,"name":"Contradiction - Spot The Liar!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98a/98ac17bb47565b06a207151cd6f67a8a.jpg","description":"Contradiction is a unique adventure / murder mystery game that uses live-action video for the entirety of the game play.  All you have to do is interview characters, spot their lies and catch them out!\nContradiction is a brand new take on the concept of an interactive movie and brings the genre to a whole new level of playability.  It plays as smoothly as a 3D graphic game. You can wander freely around the game environment, collecting evidence and witnessing constantly changing events.\nBut the game is all about interviewing the characters you meet, questioning them about all the evidence you’ve collected and things you’ve seen, then spotting contradictions in their answers.  Pair two contradictions together and watch them try to worm out of it!\nWorks best plugged into a TV preferably with a bunch of people to help spot the lies - but can be played alone on your laptop or PC just fine!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Baggy Cat","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19361,"name":"Dangerous Waters","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38c/38cff5743d6b3b200a9e3ea835fcc57f.jpg","description":"S.C.S. - Dangerous Waters allows you total control over multiple air, surface, and submarine platforms in a modern-day naval environment. Take direct control of individual crew stations and also plan and execute combined arms naval strategies from a top-down 'Commanders Eye' perspective.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Sonalysts","platforms":[{"id":0,"name":"PC"}]},{"id":19158,"name":"Clickteam Fusion 2.5 Free Edition","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a15/a15d1408f5cd688123c7b8bd528f0130.jpg","description":"Clickteam Fusion 2.5 is the latest in the famous range of game creation software from Clickteam and now comes in a completely free edition! Containing all of the editors, interfaces and clever ideas that have made our previous titles so successful, now anyone on any budget can start developing powerful games and apps for free!\nDiscover the simplicity of designing games and apps with just your mouse. From character and level design to programming, everything is done visually. If you can read, you can program with Fusion 2.5!\nCountless games made with Clickteam Fusion 2.5 and its predecessors!. Versatile, simple, powerful, fast. Download your free copy today… discover it for yourself and give it a try!Amazing Features from the Original Drag and Drop Programming Tool-Make your first game in under an hour!\n-No need for previous programming knowledge\n-Easy to use and intuitive physics engine\n-The original and world famous Event Editor makes programming a breeze\n-Used by professionals and students alike\n-Shader effects available\n-Inserting assets is as easy as drag and drop\n-Complete creative flexibility\n-Hardware accelerated games and apps\n-Outstanding, friendly community supportUpgrade to standard and enjoy these additional features and more!http://store.steampowered.com/app/248170/\n-Adds Windows executable build type\n-Access to additional exporters like Android and iOS (available DLC)\n-Add more functionality to your project with 3rd party objects\n-No limits on frames or event lines\n-Includes the Event List Editor for easier debugging\n-Use alpha channels, embed binary files, and moreSteam Games #MadeWithFusion","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Clickteam","platforms":[{"id":0,"name":"PC"}]},{"id":17479,"name":"Adventures of Bertram Fiddle: Episode 1: A Dreadly Business","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39b/39b02d73be26175914861888e859c414.jpg","description":"The Adventures of Bertram Fiddle is a traditional 2D point and click adventure game that mixes the classic formula up with riveting action elements all weaved together lovingly by Rumpus Animation.\n\"It is quite possibly one of the finest point-and-click comedy murder mystery adventure games set in Victorian London you will play today\" - Bertram Fiddle\nExplore a quirky Victorian London inhabited by strange characters, with even stranger noses, as self proclaimed leading explorator, Bertram Fiddle, finds himself in a bit of pickle. You must help him follow the clues and track down the elusive serial killer known only as Geoff the Murderer before he strikes again. Wander the murky and mysterious streets and alleyways of Old London Town... but be careful whom you bump in to...\nWatch in stunned disbelief as the story, and your mind, unravels before your very eyes in this animated interactive adventure!\nFeaturing\n- An intriguing, dark humoured murder mystery filled with intrigue, dark humour, murder and mystery\n- Beautifully animated interactions\n- Over 30 locations to explore\n- An original soundtrack composed by Cam Reynolds inspired by 1970s B movies\n- Unique Voice Acting\n- Riveting action sequences\n- Terrible puns!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Chorus Worldwide Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16940,"name":"Rooks Keep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/534d246bec00e5b22041ed21c060eff9.jpg","description":"Deathmatch. AI & Multiplayer. Chess. Decapitation.\nDescend into a brutal tournament where factions of sinister knights and grotesque beasts battle for domination in bloody arena matches and furious melee brawls. Crush opponents with hammers and shields, rend flesh with razor sharp claws and slice off heads with swords and axes.\nIn Rooks Keep, players will maim their competitors in both a selection of deathmatch-arena game-modes such as 'Deathmatch', 'Team-Deathmatch', 'Conversion', 'Chess', 'Last-Man-Standing' and 'Combat Chess'. Play solo, jump into multiplayer matches, or add AI opponents to squash under-foot in both single and multiplayer. We even support 3rd party Chess engines.\nThe game is set in a uniquely styled fantasy world, where factions battle ceaselessly for your entertainment.Key FeaturesArena gameplay\nPlayers will enter into a variety of game-modes, such as Deathmatch, Last-Man-Standing and Conversion(kill enemies to convert them to your team), and battle across a variety of maps with many available options and mutators.\nMelee combat\nThe focus of Rooks Keep is on the fantasy melee combat system, featuring quick and heavy attacks, parrying, blocking, dodging and special abilities and skills.\nChess\nPlayers can play in both Classic Chess and the unusual Combat Chess mode, where players have the opportunity to fight to retain their place on the board if attacked.\nAI/LAN/Online\nRooks Keep presents players with single-player solely against AI bots, LAN and online. Also supported are 3rd party Chess engines. Even hot-seat Chess is available.\nUnreal & mod support\nBuilt on the Unreal® Development Kit™, Rooks Keep offers extensive mod support. Players will be able to use the included UnrealEd tool to build their own maps and mods.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"RuneStorm","platforms":[{"id":0,"name":"PC"}]},{"id":15909,"name":"ENYO Arcade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/110/11037140b1b8791af8c759e302da047d.jpg","description":"ENYO Arcade resembles a modern twin-stick action platformer. The game is notable for its unique gameplay, depth in atmosphere and merciless fast action. Fight or avoid various enemy types and find your way to the exit. Extra mileage of the game can be found in aiming to get from one point to another in the fastest and most efficient way possible.\nFeatures:\nUnique platform agility and speed\n40 locations spread over 4 stages\n3 difficulty achievements\n16+ unique enemy types\nHigh quality sub-pixel art at 60 frames per second with attention to details\nTight and responsive controls - always stay in direct control of the action\nNo 'holding hands and leading the way'\nMovement focused on 'game feel' including: wall jumping, ball jumping, rocket jumping AND regular jumping!!\nAtmospheric audio visual experience\nSteam achievements and leader boards\nKeyboard controls can be remapped!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"James Mearman","platforms":[{"id":0,"name":"PC"}]},{"id":15677,"name":"True Fear: Forsaken Souls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73b/73b5f15eec4c7a2d46a3607d9a609c11.jpg","description":"You are walking down a street you don't recognize, the fog slowing your pace to a crawl as darkness blinds you. You pause and look up to see a house; candles flicker in every window, like a beacon. Climbing the few steps to the front door, you realize many years have passed since it was last opened – it has been sealed with rust and purpose. Inexplicably, just as you know the candles are for you, you know someone waits inside. Someone who has remained in that house since before the iron began to rust. They have been patient. Waiting for over two decades. Waiting for you.\nTrue Fear: Forsaken Souls takes the best of the psychological thriller, blending in fun and intuitive gameplay mechanics. The cinematics, puzzles and hidden object phases have been carefully developed and are steeped in a unique and oppressive atmosphere. Episode 1, the first in a trilogy, will long be remembered.Main Features\nAn intense adventure brimming with psychological suspense in a story filled with diabolical twists and turns.\nA compelling storyline with action-packed gameplay! Follow the clues, find evidence and solve the mysteries to uncover more about your sister's past… and your own!\nChoose your adventure! Play with or without the hidden object scenes: it's up to you!\nUnique cinematography! Astonishing cinematic sequences lead you ever deeper into the oppressive atmosphere.\nIncludes the bonuses from the Collector's version of True Fear: Forsaken Soul: an additional level, the strategy guide, wallpapers and extra cut-scenes.\nFull gamepad support","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"4EversGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14904,"name":"J.U.L.I.A.: Among the Stars","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0d/c0d8b141ce1e51541cfb114c4a72356d.jpg","description":"J.U.L.I.A.: Among the Stars is an innovative narrative driven adventure game which is being developed due to  overwhelming support from a successful crowdfunding campaign.\nThe story centers on Rachel Manners, a 35 year old astrobiologist. She is a member of an elite group of scientists, chosen to embark on one of the most critical missions ever conceived on Earth. Now Rachel is alone, orbiting an unknown planet. Her only companions are J.U.L.I.A., the space probe’s artificial intelligence and Mobot, a huge reconnaissance robot. Together, this unlikely trio will explore the mysteries of this solar system. But are they prepared for what they will find?story\nAfter countless years of careful space observation, the enormous telescope Chandra 17 suddenly locates a solar system quite similar to our own. As all earthly observatories turned their attention towards this new discovery, a signal of artificial origin is detected from deep within the system.\nReaction was immediate and a mission plan was conceived. No expense was spared in the construction of a massive space probe. It was designed and equipped to be ideally suited for the ultimate challenge: to meet and study extraterrestrial sentient life-forms. Equal care was taken with the crew. Only the most prominent scientists were selected and trained to ideally represent planet Earth. Everything was perfectly planned and success was certain. Yet somehow, everything has gone terribly wrong…\nNow, imagine being jolted awake by an emergency alarm. As your surroundings come into focus, you realize you were deep in cryogenic sleep on a vast space probe. But why you are there is an elusive memory. Disoriented, you rush to the control room searching for answers. Once there you learn from the ship’s AI that not only have you been asleep for decades, but you are also the last surviving member of the probe’s crew.\nTo make matters worse, the probe is severely damaged by a disastrous impact with a passing meteoroid swarm. First, you must make repairs. Not only is your own survival at stake, but you need to find out what happened to the crew and why you alone survived.Are You Prepared to\nstep into the spacesuit of Rachel Manners and find out why she was the sole survivor of this ill-fated expedition?\nutilize an ingenious MOBOT – a mobile robot designed for planetary exploration to investigate this solar system and all its wonders?\nsolve the mystery of the mission’s failure and locate the missing crew?\ntravel to six unique planets and uncover their secrets?\nsolve puzzles, gather clues and communicate with the most temperamental artificial intelligence ever designed?\nAre you prepared for… J.U.L.I.A.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"CBE Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14647,"name":"Electric Highways","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f6/4f62f75550c18f82dd69dcf0722eb25a.jpg","description":"Disclaimer: Only play the game if you're fine with the visuals presented in trailer and screenshots. May not be suitable for people with epilepsy.\nThe color puzzle at the end is a side quest and is not required to finish the game. There's also no timer in the game.\nElectric Highways is a game that's all about experience and exploration.The setting takes place in a surreal, virtual world, made out of abstract 3D graphics, where the player must explore ten levels, each with an individual theme. Some levels contain simple puzzles, but for the most part the main focus is exploration. In some ways, the game is like an interactive conceptual music album, where each level is like a short song.\nThe year is 2072. Virtual reality has become a worldwide phenomenon, allowing people to sink into the virtual web, while experiencing isolation in real life. A VR engineer has finished his virtual reality project, but before uploading it on the web, he decides to visit it for the last time, plunging deeper into his own surreal world.\nThe atmosphere of the game has been inspired by early 80's electronic music (Gary Numan, Kraftwerk), visual style of games like LSD: Dream Emulator and the 1984 version of the film Metropolis. The project uses 3D engine from 90's.\nControls:\nWASD - Move\nMouse - Look\nE - Use\nSpace - Jump\nEsc - Menu\nCredits:\nZykov Eddy - Lead Developer ( http://eddyprojects.blogspot.ru )\nXitilon - Composer ( http://r0.kolenka.su )\nSpecial thanks to: Nerdybat, Ivan Azarov, Micky C, Artem Nevinchanyi, Esdeer, James Stanfield (for water texture), Lezing, dv49, all 80's new wave artists\nLogo design - dv49\nThe game is based on EDuke 32 engine ( http://eduke32.com )","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Xitilon","platforms":[{"id":0,"name":"PC"}]},{"id":12113,"name":"The Low Road","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9c/f9cfed1110703266bcbeb1ff4ffa6a9a.jpg","description":"Theme & Narrative:1976.\nNoomi Kovacs—an overeager graduate of the LeCarre Institute for Exceptional Spies (L.I.E.S)—has just landed her first job at Penderbrook Motors’ Division of Outside Intelligence.  Confined to an office and underestimated by her gruff supervisor—a disgraced former government agent named Turn—Noomi will have to exploit her colleagues and surroundings to help further her dream of becoming a globetrotting secret agent. Once in the field, Noomi and Turn begin to realize that their company’s dogged pursuit of their rivals extend to something far more sinister than “healthy competition” and the two will be forced to reconsider the paths they’ve chosen. Lying, blackmail, and emotional manipulation will become Noomi and Turn’s greatest assets as they make their way through…The Low Road.Description:Set in the world of the 1970s automobile industry, The Low Road is a point-and-click graphic adventure game which follows a team of corporate spies dedicated to the protection (and appropriation) of game-changing industry secrets. Sporting a unique visual style inspired by gouache paintings and a pulsating rock and roll score, \"The Low Road\" will captivate players through intricate puzzles, branching moral dilemmas, and a quirky cast of memorable characters.\nGame Developer Conference 2016 “Best In Play” – Winner\nPlaycrafting ’16 Bit Awards “Best Style” – Nominee\nFull Indie Vancouver \"2017 Demo Night” – Winner\nIndie Prize Showcase USA 2017 – Nominee\nGame Design Awards 2017 \"Best Character Design\" —NomineeKey Features:A unique digitally hand painted 2D illustration style with 1970s television influences.\nA fully-voiced cast of characters\nPlay from the perspective of two corporate espionage agents\nOver 32000 words of dark comedic dialogue written by award-winning playwright Leif Oleson-Cormack\nA mergence of traditional storytelling and engaging game play\nAn original score of swirling psychedelia and dusty Americana by Eric Cheng, featuring songs performed by Win Well.\nNostalgic point-and-click style gameplay influenced by LucasArts and Sierra classics\nBranching conversation puzzles that will challenge your deductive and intuitive abilities\nOver 15+ first person puzzle sequences\nAbout XGen Studios:XGen Studios is an independently owned and operated game developer of several award-winning titles on consoles, mobile platforms and the web. Established in 2001 and located in Edmonton Canada, we're a team of passionate creative people, united by a desire to create the type of games we wish existed. We're excited by emerging technologies and the new experiences these make possible.\nSince 2001, XGen Studios has released 10 internally-developed, including the #1-selling hit Defend Your Castle for Nintendo’s WiiWare™ Service and Day-1 PS4™ title Super Motherload.\nDuring the production of The Low Road, XGen’s Founder and CEO, Skye Boyes, passed away. The Low Road is dedicated to Skye for the inspiration, leadership and friendship he brought to the XGen team.\n\nThe Low Road is XGen Studios’ first point-and-click adventure game and has financial funding support from the Canada Media Fund 2014-2015 Experimental Stream.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"XGen Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":11756,"name":"Chainsaw Warrior: Lords of the Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a5/0a5b0a7dc09516234d3cb0c19624036c.jpg","description":"Chainsaw Warrior: Lords of the Night is a new chapter for Games Workshop's cult classic! Based on the original Chainsaw Warrior board game, this sequel adds new layers of intensity to the game's unique formula.\nChainsaw Warrior: Lords of the Night sees the player fighting against hordes of Aztec Zombies, and the clock, to save reality from Darkness. Lords of the Night introduces an upgraded combat system, new weapons, powers, equipment and unique mini bosses that require careful tactics to defeat. It adds three new zones to fight through, an even tougher confrontation with the enigmatic Darkness and plenty of new opportunities to die!\nIt's the year 2035 and the crazed followers of a near-forgotten God have opened a hole into a nightmare dimension. Through this portal bizarre and dangerous creatures are flooding into our world, intent on total destruction! There remains just single hope: a shadowy ex-special forces soldier, enhanced for combat and known only as 'Chainsaw Warrior'. He saved New York in 2032 – can he now save the world? Equipped with new high-tech armaments, he must battle his way through the jungle to find and defeat Darkness. Not only are there swarms of Aztec zombies, mutants, traps, Moon Cult Agents and other twisted fiends between him and Darkness, time is the enemy too! Only 60 minutes remain to save us all before we are torn from our reality forever.\nChainsaw Warrior was first published as a solo board game in 1987, is expanded in this new adventure. An epic battle that offers new gameplay, weapons, equipment, enemies and much more. Can you prevail where all others have failed? You only have 60 minutes to save the world!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Auroch Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":11275,"name":"OH! RPG!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de6/de6fda0a03b67acd60f58e052dc3d8bf.jpg","description":"Presentation\nDeep enough for the veteran roleplayer... Humorous enough for the casual gamer!\nOH! RPG! is a quirky, innovative and colorful adventure by RosePortal Games (of Epic Quest and Whisper of a Rose fame) and released on Steam by RPG veteran Aldorlea Games.\n\nThe game consists of 8 chapters, each with a different atmosphere, gameplay and protagonist, all contributing to an exciting and fresh experience.\nMixing elements of parody and great use of interaction with an enthralling storyline, this game is a quality blend of pure RPG goodness - but with an unique twist!\nPlot\nHeroes always win. But what happens to those who don't?\nThe world is coming to an end and the heroes return home after their ludicrous failure, to be with loved ones for whatever's left.\nExcept this time you're not going to play them. Who wants to play failures anyway?\nIn OH! RPG!, traditional roles are reversed. You play the NPCs and help the heroes along the way.\nSee the story from another perspective and embark with a new protagonist in each of the 8 chapters\nTravel from front to back, from awe-inspiring castles to your remote peasant village, from enemies super strong and big, to end up proudly defeating... pathetic slimes?\nEnjoy a collection of unique protagonists such as an upbeat Jester, a quickwitted Goblin or even the Hero's own family, as you interact with them in an innovative way\nVisit 8 chapters, all with a different style and optional content to discover!Features\nUnique battles using the special skill \"Hero Calls\": Harold, Therese, Marsha and Lucius are never in battle, but you can call them and wait until they arrive, and they will perform one powerful move - this is different for each battle depending on where they are in the story\nEnd-level ratings based on performance\nStage selection to replay levels and improve your ratings in each\nGlobal User Rank based on overall end-level results - unlock goodies with higher scores!\nCollect material to upgrade the power/efficiency of your weapons, armor and potions\nUnlock skills of RPG Maker History like Call Ralph!, Mapping Tool or Summon Don Miguel\nFREE license original resources for everyone who purchases the game to use - includes 4 side-view monsters, some side-view battlers, tileset, charsets, and even the airship above!*\nSteam Achievements & Steam Trading Cards!\nMouse, keyboard and gamepad/controller fully supported, with non-invasive full screen or windowed mode and higher resolution graphics\n*Find your free resource pack here:\nC:\\Program Files (x86)\\Steam\\SteamApps\\common\\OH! RPG!\\Resources\nMeet our Heroes!\nHarold\nA simple farm boy with big dreams of seeing the world. Always level headed and one to help another in need. Tries to be friends with everyone he comes in contact with. Expert cow milker!\nTherese\nA tough princess who trained herself as a knight so she could one day leave the castle walls. She's never afraid to use her title to get her way. Often impatient and comes off as cold when talking to others. Expert at judging people.\nMarsha\nA mysterious girl with an even more mysterious past. Her lighthearted and mischievous behavior has landed her into hot water countless times. Always looking for a way to be important to the people around her. Expert at playing tricks on others.\nLucius\nOften described as stiff as a book's spine yet somewhat sarcastic. Even though he is a priest, he questions everything within the teachings. Always willing to help those in need but is never looking for thanks. Expert at disapproving books.\nTIP: When playing on Windows XP and experiencing issues, please launch the game manually at:\nC:\\Program Files (x86)\\Steam\\SteamApps\\common\\OH! RPG!\\Game.exe","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"RosePortal Games","platforms":[{"id":0,"name":"PC"}]},{"id":10189,"name":"Oik 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f21/f21ebb115d3fa420574f15b594ccd910.jpg","description":"Casual physics puzzle. The player's goal to keep the blue block on the platform for 3 seconds in order to pass the level.\n- 60 levels\n- 365 Achievements\n- Relax music\nOik 2 - Puzzle in the style of Zup!Credits\"Oik 2\" powered by Clickteam Fusion 2.5\nMusic: Delone","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dr_Crewcut","platforms":[{"id":0,"name":"PC"}]}]