[{"id":58803,"name":"Trials Rising","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a65/a65df920043993647557df61ff02f6df.jpg","description":"GOLD EDITION\nThe Gold Edition includes the Standard Edition of the game and the Expansion Pass with access to additional content, extras and more !\nAbout the GamePre-order now to get two customization packs:\n- Jungle Rider Pack\n- Wild West Rider Pack\nEach pack includes 5 items for your rider and 1 item for your bike.\nExplore over-the-top action and physics-bending motorcycle racing in the latest opus of the Trials franchise.  All new features, more competitions and more tracks means new challenges.\nRide challenging tracks around the world – from the Great Wall of China and New York City to the Eiffel Tower and everywhere in between.\nWith the new hilarious Tandem Bike, get your friends and try to control one bike with two riders.\nFrom your local backyard to worldwide stadiums, defeat all your opponents online and rise to glory.\nCreate and share unique levels in Track Central using over 10 000 items available. Possibilities are endless - and so is the fun.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":58632,"name":"Prey (2006)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/750/75052ecc07d6e957018cc9569819204e.jpg","description":"Aliens turned Tommy's world upside-down. Now he's about to return the favor.\nIn Prey, players enter a living spaceship which enslaves alien races and devours humans for lunch. Prey turns the first person shooter genre upside-down with awesome new gameplay features like wall-walking and gravity flipping, making for intense single-player and multi-player experiences. Prey is built on a heavily modded version of the Doom 3 engine and is developed by critically acclaimed developer Human Head Studios under the direction of 3D Realms.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Human Head Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Classic Macintosh"}]},{"id":20581,"name":"Bloop Reloaded","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80f/80fae9e97cd97b9c1062088d89c21d18.jpg","description":"Bloop is back and it’s bigger and better than ever!\nYour favourite chemistry potions puzzler is back in Bloop Reloaded and ready to test the brain cells like never before.  Make sure you save as much of the potions as possible.  How you do it is up to you!\nFeatures\n27 Levels\nBuild Paths and guide your potions to safety.\nUse environmental physics to your advantage.\nThere is no one correct solution, just the limits of your creative mind!\nSee what happens when you mix potions.\nCreate your own levels","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2SD","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20292,"name":"Max Gentlemen","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa5149fedbe6362b75d64eccc4d698b5.jpg","description":"Max Gentlemen is an arcade-style extreme manners simulator about stacking hats, inspired by a spam email for male enhancement.\nHat stacking old timey arcade action\nOver 39 hats to collect\nCross-platform local multiplayer\nExtra characters, levels and modes\nOnline leaderboards\nChallenge your friends. Prove once and for all who is the most gentlemanly. Seriously though, 2 player is super fun.\nMax Gentlemen is a FREE game but if you want to support us, there are a variety of extra characters, hats and levels to buy. More updates to come!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"The Men Who Wear Many Hats","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":19058,"name":"Harvester","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64b/64bfb73d3577c85f462d6f589a43c39a.jpg","description":"The most violent adventure game of all time comes to Steam!\nYou wake up one morning to a town full of strangers and inexplicable sights. You share your home with your not so perfect family and your supposed fiancee lives next door. Then you are plunged into a nightmare! Your fiancee is missing and you find a hideous bloody skull and spinal chord draped across her bed! Is it hers? What is going on? The only clue left behind is an engraved invitation for you to enter...\nTHE ORDER OF THE HARVEST MOON\n...a mysterious organisation that controls the town in way you don't (or can't) understand.\nIs the order behind this gruesome execution? What are their motives?\nOne thing is certain, you're going to get to the bottom of this killing, or die trying.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"DigiFX Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15856,"name":"STAR WARS - X-Wing Special Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3fa/3fa178b060f618576f7d59849a086880.jpg","description":"The Old Republic is gone. The Senate has been abolished. The Jedi Knights have been exterminated. Now the Emperor seeks to crush the last remaining opposition. Against the overwhelming might of the Empire stands a small but growing Rebel Alliance.\nScattered resistance groups are uniting and what is needed most now are Starfighter pilots. Will you join their struggle to end this tyranny and become a hero of the Rebellion?\nKey features:\nIncludes STAR WARS™: X-Wing and all Tour of Duty expansions: Imperial Pursuit and B-Wing in both - 1993 (DOS) and 1998 (Windows) versions!\nFly over 120 deep space and Death Star surface missions against the Empire!\nCombat training simulates historical encounters with Imperial forces.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lucasfim","platforms":[{"id":0,"name":"PC"}]},{"id":14398,"name":"Dark Matter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dda/ddab6ff33425f1315052b52334933b9e.jpg","description":"The Space Pirates are planning on destroying the Earth. They have stolen many space cargo vessels in order to gain the supplies to blow it up. You play as Dark Matter, a hired bounty hunter who works with the Space Federation in order to stop the pirates. You must stop the pirates, save the space cargo vessels, and save the Earth. You are the last chance for the Earth. You must save it.\nFeatures:\n-Good story FPS game based in Space\n-Fun Shooting Gameplay\n-Low poly atheistic","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Meridian4","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9875,"name":"Hot Lava","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fde/fde071a634b0fd481644e52bf36bb34d.jpg","description":"The floor is lava!\r\nHot Lava transports you back to your childhood imagination. Relive those moments of excitement, joy and chaos. Traverse distinct worlds, from school hallways to the memories of your darkest fears. This is a game of dexterity and ingenuity, you will have to use all your skills to complete the treacherous obstacles that await.\r\nBut whatever you do…Don’t Touch The Floor!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":319239,"name":"Warhammer 40,000: Inquisitor - Prophecy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa6/aa64658186c0d0fec38f835d08a23242.jpg","description":"IMPORTANT: You don’t have to own Warhammer 40,000: Inquisitor - Martyr to play this game.\nIMPORTANT: for Warhammer 40,000: Inquisitor - Martyr players: Existing characters, their items and their progress are carried over to the expansion, adjusted to the new 2.0 rules and mechanics. Owners of both Warhammer 40,000: Inquisitor - Martyr and Warhammer 40,000: Inquisitor - Prophecy won't require separate clients to run the game and the expansion.WARHAMMER 40,000: INQUISITOR - PROPHECYDeep within the darkest reaches of the remote Caligari Sector, beyond  barriers formed by churning Warp-surges, lies a vast area tainted by the Chaos Gods and threatened by the rise of the foul Xenos. On the barren Death Worlds the hideous Tyranids are slowly coming back from their hibernation, long decades after the defeat of their colossal Hive Fleet, while the Imperium of Mankind faces a new wave of unexplained attacks by Aeldari warriors fleeing their dying Craftworld. And if that wasn’t enough to alarm the Holy Inquisition, a mysterious presence with potentially devastating powers has returned from the Warp on the long-lost “Martyr”, destined to fulfil a prophecy that could change the fate of the entire Sector.A STAND-ALONE EXPANSIONWarhammer 40,000: Inquisitor - Prophecy is a stand-alone expansion for the grim action-RPG Warhammer 40,000: Inquisitor - Martyr, set in the violent 41st millennium, when the galaxy is at constant war. Purge the unclean with the most powerful agents of the Imperium!\nNow you can also carry out the Emperor’s will as a Tech-Adept Inquisitor, a former acolyte of the Adeptus Mechanicus who decided to join the Holy Ordos to become one of the mightiest agents of the Imperium; combining the sacred technological mysteries with the relentless dogma of the Inquisition, he has become an unstoppable force. Or continue the unfolding saga of the Alpha Pariah with one of the original three classes introduced in Warhammer 40,000: Inquisitor - Martyr in a Caligari Sector slowly succumbing to madness and war.KEY FEATURESNew class\nPlay as a Tech-Adept Inquisitor and summon and enhance units in battles to help you defeat enemies and complete investigations. This new summoner class comes with new unique abilities and mechanics and offers a unique skill-tree and various new melee and ranged builds.\n\nNew and Revamped Gameplay Elements\nInquisitor – Prophecy offers several features of Inquisitor – Martyr. These include 2-4 player co-op missions, destructible environments, all previous enemy races and units, and the unique gore of the Warhammer 40,000 universe. Moreover, Inquisitor – Prophecy is based on the 2.0 update for Inquisitor - Martyr, bringing the base game’s new level cap, redesigned loot system and levelling, the new end-game, the co-op campaign mode, new items and a much faster, ARPG-focused gameplay to the stand-alone expansion too.\n\nNew Campaign\nThe story that began in Inquisitor – Martyr continues in three new and stand-alone chapters, with one chapter solely focusing on the Tech-Adept Inquisitor investigating a great mystery which slowly ties into the unfolding plot.\n\nNew Settings\nDiscover sacred monasteries, perilous research sanctums, unforgiving deserts and ruthless worlds churning with molten lava.\n\nNew Enemy Races\nInquisitor – Prophecy introduces the Eldar, including Howling Banshees, Fire Prisms, Warp Spiders and Swooping Hawks; and the Tyranids, including Carnifexes, Zoanthropes, Hormagaunts, Raveners – and many others.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NeoCoreGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":52342,"name":"The Raven Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc0/fc0a87174583ce388973f957864a9e8e.jpg","description":"Digital Deluxe EditionThe Digital Deluxe Edition includes:\nSoundtrack (in .wav and .mp3 format)\nStory book with detailed background info about the characters of the game\n“Making of” booklet of the original game\nPapercraft mask of The Raven (printable)\nFour digital posters (printable)\nAbout the Game\nThe Raven Remastered is a full graphical remaster of the classic whodunit adventure that lets you explore a thrilling crime story through the eyes of multiple characters.\nLondon, 1964. An ancient ruby is stolen from the British Museum. At the crime scene: a raven feather. Is somebody trying to follow in the footsteps of The Raven, the legendary master thief who disappeared years before?\nConstable Anton Jakob Zellner finds himself in the middle of the kind of murder mystery he so far only knew from reading his favourite crime novels. Nothing is what it seems. Everyone has something to hide. And the Raven is always one step ahead...\nKEY FEATURES\nA classic whodunit adventure from KING Art, the creators of the Book of Unwritten Tales-series\nExperience a thrilling crime story through the eyes of multiple characters\nClassic murder mystery locations, from a train in the Swiss alps, to a majestic cruise ship and the Cairo Museum\nHigh quality voice acting from a compelling cast of quirky characters\nFully remastered animations, lighting and hair in full HD resolution","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":31014,"name":"The Neverhood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bf5/bf5ec0fcefd3895f2591122012463565.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"DreamWorks Interactive","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":19293,"name":"Cossacks: European Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/740/7407bc76fbc68626b1fd6dce3d800305.jpg","description":"Cossacks: European Wars is a historical real-time strategy based on events of the 16th through the 18th centuries in Europe, when nations and states were created and demolished, and wars shed seas of blood. There are 16 nations or regions in Cossacks: Algeria, Austria, England, France, the Netherlands, Piemonte, Poland, Portugal, Prussia, Russia, Saxony, Spain, Sweden, Turkey, Ukraine, and Venice. Each has its own original graphics, economic and technical development peculiarities, military advantages and drawbacks, and unique units and technologies, providing vast choices of tactics and strategy in war against any enemy. Thus, England is the mightiest sea power, Austria has powerful light and heavy cavalry, and Cossacks are the pride of the Ukrainian army.\n\nBattles of up to 8,000 units may be conducted on single or network game maps. One can carry out lingering city sieges, wage guerilla wars, capture commanding heights and arrange ambushes, deploy landing forces on enemy shores, and conduct sea battles. The game system is arranged to reduce per-unit control and resource micromanagement, and to turn to global goals of powerful economy formation, science development, the capturing of new lands, and defending borders.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"GSC Game World","platforms":[{"id":0,"name":"PC"}]},{"id":9580,"name":"Hired Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b1/0b11c690545dcc0a61e7cb95d62f78b0.jpg","description":"Hired Ops is a session-based online shooter dedicated to fierce conflicts between rival mercenary groups battling on a global scale from Russian developer AbsolutSoft. Using the latest weapons and special equipment, players take part in armed encounters, unite into private military companies, carry out contracts, build bases and aggressively compete with each other - all for the sake of domination in the world mercenary market. Players are free to choose from any of the five different fighter classes, each featuring an elaborately crafted skill system and an arsenal rich in weapon variety and weapon modifications. Hired Ops includes a diverse mix of game modes, including the \"Enhanced Realism\" mode.\nSpecial attention is given to the opposing clans and their strife. This opens an opportunity for players to establish a name for themselves and their forces in order to achieve supreme success in the marketplace of private military corporations.Game features:\nDangerous flashpoint missions - Engage in lightning-fast assaults of fortified areas, search and destroy missions against VIP operators, stealthy night ops using night vision devices and thermal imaging sights, and the total neutralization of the enemy forces in \"Elimination\" mode\nAcquire unique skills - A multipath skill tree allows players to fine-tune their character to suit their play-style, turning operators either into a noiseless reconnaissance agent, a ruthless combatant or something in-between\nCharacter customization system - Change your character's appearance, from general physical features to camo sets. Camouflage is not just decorative, but can be an important factor in mission success.Players are also free to add other visually distinguishing features to help their characters visually stand out among other mercs.\nAn extensive and customizable arsenal - Over a hundred designs based on modern small arms and more than 80 different modifications for them are available to players\nThe true spirit of the merc - Every player picks their contracts, carries out the hardest tasks and increases their reputation in the market of PMCs! It is entirely up to the player on how much they will earn, what their future contracts will be and where will they rank among their friends and foes.\nA global-scale battle - Battle through a Russian emergency satellite facility, an Arctic research station, an abandoned desert village, an office complex, a railway station and many other locations on a worldwide battlefield\nAdvanced tactical capabilities - Realistic combat tactics, including recoil control, peeking out,combined scopes, laser designators and flashlights, calls for support, use of specialized ammunition and devices are all going to contribute to your success or failure as a PMC operator.\nCompetitive Hardcore mode - It doesn't get any more realistic than this ...combatants suffer persistent wounds, contusions and other injuries that affect gameplay and combat capability\nPersonalized PMC (private military company) - Players will be able to build bases for upgrading special clan skills and extra clan-based contracts. PMC's will also have access to unique weapons, modules and camouflages as rewards.\nAbout AbsolutSoft\nAbsolutSoft is a privately-owned Russian game development studio, established in St. Petersburg, Russia in 2010. The company has previously released the browser-based online FPS Contract Wars, which won the attention of 48 million players worldwide. In 2016, AbsolutSoft moved its headquarters to Moscow and focused on the development of Hired Ops.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Absolut Soft","platforms":[{"id":0,"name":"PC"}]},{"id":2386,"name":"The Book of Unwritten Tales 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d75/d75b2ca9d5776c7df104ae27093f2917.jpg","description":"Every world needs its heroes. However unlikely they may seem. Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventásia. Help them fulfill their destiny. A destiny as yet unwritten.The Tale\nA few years have passed since our heroes heroically defeated the arch-witch Mortroga. And their lives, like the lives of most people in Aventásia, are still in turmoil. The War of the Two Towers is over, but the wounds it left upon the land are still bleeding.\nThe gnome Wilbur Weathervane is struggling with his new job as a teacher at the reopened School for Wizardry and Witchcraft. His magic wand is having a mind of its own and an assassination plot against the arch-mage overshadows the first democratic elections in Seastone.\nFaced with political intrigues that threaten the delicate balance of peace, Wilbur is in dire need of his old friends. But the elf princess Ivo and the adventurer Nate have, after a brief romantic interlude, gone their separate ways.\nIvo has returned to her gilded cage in the elf kingdom, overprotected by her controlling mother.\nNate along with his trusty companion Critter has been taken prisoner on the flying island of his arch-enemy the Red Pirate.\nBut fate does not rest. A darkness has fallen upon the land, or rather, a pinkness. A magic force is turning mighty beasts into fluffy plush puppies and towering castles into oversized dollhouses. Can Aventásia be saved?Key FeaturesA new adventure from KING Art, the creators of The Book of Unwritten Tales, The Critter Chronicles and The Raven – Legacy of a Master Thief\nA fantasy story with over 20 hours of pointing and clicking\nThe trademark BoUT-humor, lovingly spoofing LotR, Game of Thrones, Harry Potter, Discworld, The Hobbit, WoW and more\nHundreds of weird, yet oddly logical puzzles\nThe well-proven \"Multi-Character-Gameplay\"\nThe established four playable characters Wilbur, Nate, Ivo and Critter\nAn ensemble of quirky characters, both well-established and brand-new\nProjection Mapping technology unites the merits of 2D and 3D styles and technique\nAn epic soundtrack with all the classics and many new compositionsKickstarter-powered Extra Features\nThanks to the support of our fans on Kickstarter, The Book of Unwritten Tales 2 features:\nOptional Side-Quests: Similar to RPGs the game features optional puzzle chains aside the main puzzles, that you can choose to solve, but don´t have to\nExtra Outfits: For solving side-quests you not only receive achievements, but also unique outfits that the playable characters can equip\nOrchestra recordings: For the first time most of Benny Oschmann´s much-loved score for the game was recorded with a live orchestra","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"KING Art","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":428121,"name":"Hellpoint: The Thespian Feast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/622/622622533570491b04fc3fbb4a37ba02.jpg","description":"Wishlist Full version of the Gamehttps://store.steampowered.com/app/628670/\nAbout the GameThe Thespian Feast is a free sequel-like chapter of Hellpoint, a dark and challenging action RPG where the line between science and occultism is unclear.\nMany decades after the incident, someone finally manages to reach the forsaken space colony of Irid Novo. What the investigator finds, defies any form of reason, but a morbid obsession pushes him forward. If death doesn't come first, insanity will surely have the better of him.\nWords from the Disciple of the Prying EyeCongratulations! Only the most inquisitive minds end up here before their time comes. What is your purpose, Spawn? Have you ever asked the question? The ethers of truth are just out of reach, irrelevantly close. But proof is needless, judgement is within. The wicked, darkened, smothering demons that claw at the mind shall soon manifest in flesh and blood, for a feast of legends. Here's a clue: those who never find superior revelations are never looking low enough.\nhttps://store.steampowered.com/app/628670/Hellpoint/","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Cradle Games","platforms":[{"id":0,"name":"PC"}]},{"id":227846,"name":"Torque Drift","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/327/327a516cea0814bf7c42f2c8bf88ca99.jpg","description":"Build your car, customize your paint job, earn sponsors, and compete on the world stage in realistic ONLINE TANDEM BATTLES to become a DRIFT KING!\n- Online multiplayer tandem drifting\n- Real professional drifting teams\n- Real branded sponsors\n- Real aftermarket parts\n- Stunning Graphics\n- Realistic smoke effects\n- In depth car tuning\n- Custom livery painting\n- Car panel damage\n- Instant replay mode","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Grease Monkey Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":62534,"name":"KovaaK's FPS Aim Trainer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/872/872345c6a7e43391e789d7c2555402bb.jpg","description":"The goal of KovaaK's FPS Aim Trainer is to enable players to create their own training with realistic dodging targets. Every mechanic within the game is driven by user-defined profiles - Weapons, characters, abilities, bots, how bots dodge, how bots aim, challenges, and more are all configurable by hundreds of variables. All of these profiles can be saved and distributed in a single scenario file. Hone your muscle memory in the trainer, apply it in game.\nGame features:\nPlay scenarios directly from the Steam workshop (30+ before release) to jump right in and practice your FPS skills\nHighly responsive input from a tweaked Unreal Engine 4 that has the approval of many top Quake players and Overwatch grand masters who have tested and provided feedback over the last year\nAll the configuration options you'd expect of a competitive FPS (FOV, separate horizontal/vertical mouse sensitivity, unlocked frame rate, per-weapon config settings, custom crosshairs, and much more)\nCreate your own weapons\nCreate your own characters\nCreate bots\nTell the bots how to dodge\nTell the bots how to aim\nMake challenges to practice specific scenarios similar to your favorite FPS\nAll profiles can be edited in-game or with text editors.\nUpload your own creations to the Steam workshop for others to practice.\nCompete on the Leaderboards for any and every scenario on the Steam workshop. (global or friends only)\nCustom maps (note FPSAimTrainer does not include a map editor, but rather reads Reflex's map format thanks to the wonderful developers at TurboPixelStudio. Reflex is available on Steam now and includes a fully featured map editor as well as awesome Arena FPS gameplay)\nCustom crosshairs (JPG, PNG, BMP, etc.)\nVisual customizations (Floors/wall textures from a large list; bodies and heads of characters can be set to RGB values, differentiated by team; attacks can be set to the colors of characters)\nMouse sensitivity scaled to popular games including Quake/Source, Overwatch, Paladins, Rainbow Six Siege, Battalion 1944, and Reflex.\nSingleplayer only. Sorry, multiplayer is too much for this solo developer.\nMore profile related features and abilities are planned to allow players to emulate features from even more FPS games, but the existing options are extremely flexible as is. As the developer, I consider FPS Aim Trainer a tool that I will be using well into the future. My goal is to keep it relevant to gamers as long as I can. Among my top priorities: advanced movement mechanics such as bunnyhopping and strafe jumping, graph/histogram to look at your scores and accuracies over time, bot types of player-recorded paths, and simulated network lag.\nRunning Unreal Engine 4, all graphical options that affect framerate or input lag have been disabled by default. Literally every console command was investigated to see whether any more performance could be eeked out of the engine, because you can never have enough frames per second when you are training for competitive FPSs. As such, the graphics of the game at release will not improve, although things like more options for weapon models and floor/wall textures are planned down the line.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"KvK Games","platforms":[{"id":0,"name":"PC"}]},{"id":57519,"name":"Super Mario World 2: Yoshi's Island","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98d/98d8fbc56c9a322a84ee38128e487bc8.jpg","description":"Play as Yoshi to ground pound and flutter jump your way out of trouble!\r\n\r\nYoshi™ is back, baby! And he’s ready to romp through a crayon-colored world where enemies are everywhere. Prepare to flutter jump and toss eggs to protect young Mario™ from the evil Magikoopa, Kamek. To save the day, Yoshi and his pals will have to morph into vehicles and even EAT their enemies to turn them into eggs! Umm… yum?\r\n\r\nPlay as Yoshi, carrying a young Mario through enormous, colorful worlds back to his parents in the Mushroom Kingdom. Kamek’s goons are constantly in pursuit, so stay alert and watch out for the Magikoopa’s devious traps. Throw eggs, gobble enemies, solve puzzles and even transform into wild vehicles like a helicopter, a submarine, and a mole tank. Is Yoshi up to the momentous task at hand? The fates of Yoshi, Mario, and the future of the Mushroom Kingdom are in your hands. Ground-Pound, flutter jump, and morph your way to victory!","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Nintendo","platforms":[{"id":0,"name":"SNES"}]},{"id":29030,"name":"PGR 4","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb0/bb0d4cdd201f2bc5ef45ea7897613b68.jpg","description":"Global competition with Kudos, iconic cars, and blazing bikes","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Bizarre Creations","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":23246,"name":"Immortal Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/183/1832350f284f99f92087db6c017717fa.jpg","description":"On the icy surface of a forgotten planet stand ruined tombs where immortals sleep. While sleepless warriors roam the halls with their minds eroded by eternity, a lone Awakewalker emerges from cryosleep. With no memory of their past, it’s up to them to forge their future, discover the planet’s mysteries, and find a way out of this icy hell.\nFight against challenging enemies with complex behaviours while exploring levels built around single checkpoints. Gather Experiences from fallen enemies to upgrade your character. Fight and die repeatedly, but never lose progress by recovering Experiences lost upon death. Explore the world to discover the story and find many items, spells and weapons that will give you an edge against demanding boss enemies.\nSouls-like Progression: Recover Experiences lost upon death and use them to upgrade your character. Customize your playstyle with dozens of items and spells.\nMethodical Combat: Patience and focus are much more important than reflexes. Block, dodge and tackle enemies while managing your stamina. You can see enemy stamina and exploit it to stun them when they are exhausted.\nTight Level Design: Levels are designed around single checkpoints from which you explore the area around it. Levels feature many unlockable shortcuts so you are always progressing no matter what.\nIntense Bossfights: Every level features a powerful boss enemy. Fights with these enemies are multi-stage struggles that are a real test of skill and determination.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"teedoubleuGAMES","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":15905,"name":"AR-K","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ea/7ea9d55659463e217a5d005ce37d9694.jpg","description":"AR-K is a classical point and click adventure with an updated twist.\nIMPORTANT:This pack includes episodes 1 and 2 of AR-K\nAR-K: Gone With The SphereAR-K: The Girl Who Wasn't There\nEpisode 3 is now available on Steam!\nAR-K: The Great Escape\nAlicia Van Volish is a former cop and current journalism student who wakes up after a one-night stand with a terrible hangover and a lot of questions: How much did she drink? Did she really take that guy home with her? What was his name? And what, exactly, is the Golden Sphere, the mysterious object that seems the source of all Alicia’s woes?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gato Salvaje","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14200,"name":"Sally Face","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d73/d73ce3cdc34c76e2456929103fc239d5.jpg","description":"Story Overview\nJoin the boy with blue pigtails, a prosthetic face and a mysterious past. Guide him on weird adventures through high school and beyond; dealing with the many oddities and hardships in his life.\nIn the first episode, Strange Neighbors, Sally Face and his father move into a new apartment filled with odd tenants and an unfortunate crime scene. This episode will set the stage for an even greater mystery.\nGameplay\nIn this story-driven adventure game, players will interact with Sal's world and his nightmares. The main path typically requires casual effort. However, there are hidden surprises to be found and bonus mysteries that may invoke a bit of head-scratching for those players up to the challenge.\nThe game is broken up into Episodes. Each episode is fairly short (typically under an hour) to essentially parallel a dark cartoon series that would air on TV.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Portable Moose","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":13683,"name":"Sorcery! Parts 1 and 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fc/2fc1ea3555209421e8ec7e3fa2df965e.jpg","description":"An epic adventure in a land of monsters, traps and magic. Journey across the deadly Shamutanti Hills and through the Cityport of Kharé, home to thieves, corrupt nobles and deadly mutants, as you attempt to recover the Crown of Kings. Armed with your sword, and over fifty spells with weird and wonderful effects, embark on a journey of a thousand choices where every one is remembered and will change your story. This is Parts 1 and 2 of a four-part series.\nAs played by the Yogscast, Sorcery! is a narrative adventure like no other, that creates your own unique fantasy adventure as you play.\n* Explore a 3d hand-drawn map, and venture inside the buildings of the city of Kharé\n* Unique bluff-and-strike based combat system which procedurally narrates your battles\n* Over fifty weird and wonderful spells, whose effects alter the narrative in wild and unpredictable ways\n* Over half a million words of story content that adapts around your choices - created using the same inklewriter technology as the multi-award-winning 80 DAYS\n* Hundreds of characters, hundreds of stories to uncover\n* Over forty unique monsters to fight, all with their own strategies and combat styles\n* Play Swindlestones, a game of cunning and deceit, against the citizens of Kharé, for profit - and for information\n* Freedom to explore - rewind whatever choices you want\n* Based on the million-selling series by Steve Jackson\n* All of your choices are remembered, shaping your adventure now - and in the future\nSorcery! Parts 1 and 2 are the first half of an epic quadrilogy. Sorcery! 3 takes the adventure to the wilds of the Baklands and creates a fully open-world experience, and will be out shortly on Steam. Sorcery! 4 is due later this year, to finish the adventure. Each part can be played on its own, or you can load your character from one part to the next, carrying over equipment, stats, and narrative choices.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"inkle","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11323,"name":"Universe Sandbox ²","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/552/552a90a0e1f1c75f99b67b3f5b300ee0.jpg","description":"Universe Sandbox ² is a physics-based space simulator that allows you to create, destroy, and interact on an unimaginable scale.\nIt merges real-time gravity, climate, collision, and material interactions to reveal the beauty of our universe and the fragility of our planet. Universe Sandbox ² is the long-awaited sequel to the original Universe Sandbox.\nUniverse Sandbox ² includes the desktop version and a VR mode with support for the HTC Vive & Oculus Rift+Touch. This is a free, automatic update.Simulate GravityN-body simulation at almost any speed using Newtonian mechanics. Real science, real physics, no supercomputer required.\nCollide Planets & StarsEpic, mind blowing collisions of massive planetary bodies.\nModel Earth's ClimateWatch sea ice grow and recede with the seasons because of the tilt of the Earth: change the tilt and change the seasons. Or move the Earth farther from the Sun and freeze the entire planet.\nLearn more...\nTerraform PlanetsAdd carbon dioxide to a planet's atmosphere to heat it up. Then add water...\nDeform SurfacesImpact planets with asteroids and comets and leave behind massive, molten craters.\nSupernova a StarMake a star evolve by cranking up its age or mass, then watch a supernova unfold.\nAnd more...Material System - build planets out of Hydrogen, Iron, Rock, & Water\nSolar flares & volatile trails\nProcedurally generated stars & planets\nPulsars\nLight-warping black holes\nDark matter","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Giant Army","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1516,"name":"Ms. Splosion Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e7/1e7a812e4b47c5299ce854dc57d03030.jpg","description":"You got a problem? Yo, she’ll splode it.  At the Big Science after-party celebrating the capture of Splosion Man, a spill of champagne shorts out the safety protocols on the splosionatrix and from it emerges Ms. Splosion Man.  The latest creation from Twisted Pixel Games, the creators of Splosion Man, The Maw, and Comic Jumper, Ms. Splosion man comes packed with fifty levels of single player and a separate fifty level co-op multiplayer campaign.  Expanded map features, tons of unlockables, ghost replays, and countless other improvements make this the definitive edition for any splosion connoisseur.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Microsoft","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":37,"name":"Star Trek: Bridge Crew","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1cb/1cb96e6a87291248ab22193e40ab3071.jpg","description":"Star Trek™: Bridge Crew will immerse you in the Star trek universe thanks to VR. The game puts you and your friends in the heart of the U.S.S. Aegis.\nYour mission: explore a largely uncharted sector of space known as The Trench, in hopes of locating a suitable new home world for the decimated Vulcan populace. The Klingon Empire is also active in the region, and their purpose is a threat to the Federation’s plans.\nMake strategic decisions and coordinate actions with your crew to complete the mission.\nIn co-op, you can form a crew of four players to serve in the roles of Captain, Helm, Tactical and Engineer. In addition to a dynamic storyline, the game features an “Ongoing Missions” mode, procedurally generating missions for countless hours of Solo and Co-op adventure.\nIn Star Trek™: Bridge Crew, you’ll need more than just individual skill to overcome the challenges; communication, trust, and close crew coordination are the keys to victory.\nUplay account and Uplay PC application required for game activation and installation.\nA permanent internet connection is required in order to play the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":29277,"name":"JYDGE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69e/69e48c5571c954c9206897ab4e2ae31d.jpg","description":"Build your JYDGE. Enter Edenbyrg. Get out alive.\nJYDGE is a lawful but awful roguehate top-down shooter where you get to build your own cybernetic JYDGE and eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying your Gavel rifle, and choosing fearless companions to suit the tasks at hand. Go solo or team up with Co-JYDGE in shared screen local co-op.\nWill you be stealthy and lurk in shadows? Or will you assault the evildoers head on? Maybe you'll brutally rocket them to bits from a distance? Or perhaps bring your own squad of reckless companions to solve the scenarios?\nBILLIONS of different game altering combinations enable you to find tools to fit your playstyle.\nUse STEALTH augmentations to sneak silently in shadows. Make yourself GIANT and hurl perps around. Make yourself tiny and fit through smaller cracks. Or combine augmentations: make yourself a tiny giant. Up to you.\nDeal sweet ruthless Jystice with your ultra-versatile and moddable weapon of the law.\n§ Fire lead, lasers, and electricity modified with dozens of game changing effects.\n§ Persuade the perps to join your side with \"Persuade or Die\" mod.\n§ Fire rockets in the general direction of the enemy and hear that kneecap split from a distance.\n§ Use Dynamite Gavel mod to powerslam through walls and explode-gib the foes with a swift blow to the brain stem. Observe the wrongdoer's eye pop out of its socket.\n§ Smell the burning criminal flesh using the Flaming Plasma mod or just gently knock them unconscious with the Sandman mod.\nYour Gavel, your Law.\nThe filthy stench of crime has taken over Edenbyrg. But do not fall into despair, the lawful but awful JYDGEs are designed to swiftly correct all lawless behavior.\nBank robbers have fortified themselves into the MegaBank. There are four ways into the bank, but only one way out of the vault. How will you proceed?\nSeveral Cobra Gang members have taken the Flanders family hostage. They need to be rescued. Preferably alive. Your move.\nThe darkest rain-beaten alleys of Edenbyrg also tell a rumor that someone is building a death machine. Something big and especially designed for taking out JYDGEs. Arm yourself!\nHow to complete the scenario without firing a single shot? Under 15 seconds? Without being seen? With EVERYONE dead? With EVERYONE alive?\nYour heroism and extraordinary feats will be rewarded with shiny Medals. Medals unlock delicious new cyberware, weapon mods, fire modes, special weapons, and more.\nWhat is the best combination of cyberware and weapon mods to achieve the medals in different scenarios?\nWho be the JYDGE?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"10tons","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":21089,"name":"Geneforge 1","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/baa/baae7304d44a1c9960b639d390131362.jpg","description":"Geneforge is an Indie fantasy role-playing game, the first game in the five-part Geneforge Saga. It features an enormous world, the ability to create your own army of lethal, totally obedient creatures, and a cunning enemy AI with foes who can go on patrols, stalk you, and run for help.\nGeneforge has a huge and open storyline. You have the freedom to choose your own path and decide how the story will turn out. You can fight the evil overlord or you can join him. You can help the peasants or you can torment them. You can be the bold hero or you can just try to get away. No matter what you choose, Geneforge offers an enormous adventure with plenty of replay value.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"PC"}]},{"id":20919,"name":"The Old Tree","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/530/5301e6a83a519281a1392a04bb7f1305.jpg","description":"Thank You!Thank you for voting for The Old Tree in Steam Greenlight and supporting our work!\nIf you're interested in seeing more of what we do, be sure to check out our new game in Steam Greenlight: Tales of Cosmos!\nAbout the GameThe Old Tree is a puzzle game. Your objective is to escort a microscopic alien being on its way and clear any obstacle that might be hindering its progress. You'll visit fantastic locations and meet curious creatures on the way towards a mysterious destination.\nThe game uses no words to relay its story, and requires no specific language skills to play.\nCompared to the original release, version 2.0 includes the following enhancements:\nCompatibility with any full screen resolution up to 1920×1080 (on higher resolutions the game will be centered on screen)\nAdded a full screen toggle HUD element\nGreatly optimized rendering performance\nAdded a new puzzle in the air ducts level\nMade some interactive objects easier to see\nSlightly increased maximum frame rate\nMinor graphical improvements","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Red Dwarf Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18544,"name":"RIOT - Civil Unrest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa1/fa18ee68509b515539fee6e521b36bf1.jpg","description":"As the world’s economical crisis deepens and inequality tears the very fabric of society the discontentment of the masses manifests itself in violent public disturbances and civil disorder.\nRIOT – Civil Unrest is the highly anticipated real-time strategy game that places the player right in the heart of some of the world’s most fractious riots -Indignados (Spain), Arab Spring (Egypt), Keratea (Greece) and NoTAV (Italy). Already heavily backed on Steam Greenlight, RIOT – Civil Unrest is coming to Steam this summer.\nRIOT – Civil Unrest’s creator, Leonard Menchiari, experienced rioting first-hand at the NoTAV protests in Italy. He created the game to tell the stories and express the feelings experienced during these clashes. What triggers the crowd to behave with such anger and aggression? Often outnumbered, what does a police officer feel like during the conflict? RIOT – Civil Unrest presents the player with the opportunity to experience both sides of the fight - a fight in which there really are no winners. Who is right and who is wrong? Experience RIOT – Civil Unrest and draw your own conclusions.\nPlay as the Police\nEmploy numerous crowd-control tactics, both passive and aggressive.\nCommand Assault, Tactical, Ballistic, Arrest and Plain Clothes squads.\nCall in police trucks, water cannon, snatch squads and others.\nChoose whether to use smoke grenades, rubber and plastic bullets, tasers or even live ammunition.\nPlay as the Rioters\nInstruct Leaders, Agitators, Rioters (armed and passive) and Journalists.\nIncite rage and cause the masses to act aggressively or try to calm the situation with tactical crowd reformation and retreats.\nAttack authority with Molotov cocktails, fireworks, paper-bombs, rocks, street furniture and the power of the media.\nMultiple Modes\nTwenty levels split over four campaigns Keratea (Greece), NoTAV (Italy), Indignados (Spain) and Arab Spring (Egypt).\nSee the story unfold from both sides - play all twenty levels as the Rioters or the Police.\nSingle player mode - play against the computer AI.\nSkirmish mode - play against a friend on the same computer.\nMultiplayer mode: play against a friend online.\nCreate your own Riots with the level editor\nAlter the look of the confrontation by importing your own background graphics.\nPosition elements, vehicles and obstacles where you want them.\nSet the time of day and the weather.\nChoose and position rioters and police starting points as well as their orders and level of aggression.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Merge Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15490,"name":"Western Press","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9a/c9aabb4ee4d92a2f01660bb4bcf2c571.jpg","description":"Custom Content in Steam WorkshopHead over to the Steam Workshop for Western Press to add community-created content such as characters, environments, sounds and taunts. Quick link: http://steamcommunity.com/app/377360/workshop/\nTo kick things off, the super cool folks at DrinkBox Studios gave us permission to create Juan Aguate, the star of Guacamelee! Subscribe to Juan to add him to your character roster in the game.\nWe're really excited to see what content the community will come up with. For a step by step guide to creating and adding content to Western Press, we made a video tutorial that you can watch and enjoy...\nhttps://www.youtube.com/watch?v=qhmBq9WP7xM\nAbout the GameBased on a true story, Western Press is the most historically accurate frontier dueling game available for PC and Mac. Probably. Competing in tournaments of up to 16 players (or bots), duelists both online and off will face each other in rapid fire, 1v1 sprints to finally settle who can press a random string of ten buttons the fastest.Features\nNo Time to Explain\nLearning to play is incredibly simple: Buttons go top to bottom, do them fast. A duel takes seconds, and a 16 player tournament takes minutes. So just how good is your guest list’s controller knowledge, and just how fast are their reactions? Submit your answer in ten buttons or less. (Not less, you'll lose. Do ten.)\nAs Easy as A, B, Square, Triangle\nCustom settings allow you to control which buttons are used, so combos are as complicated as you’d like them to be, from directions only to the full gamut. Western Press features prompts for Xbox controllers, PlayStation controllers, dance mats, and supports a large range of third party controllers. Of course, who could forget our friends on keyboards...\nNot My Type\nKeyboarding cow-folk can expertly type their opponent to death. With a choice between ten letter words, random gibberish, or our not-trademarked \"Controller, Replicated\" layouts, discover which best suits your style, select it, and [W] [ I ] [N]! (They're letters. From the keyboard.)\nOnline and Local Tournaments for Humans and Machines Alike\nHold custom tournaments for from two to 16 competitors with any mix of local players, online players and bots. The tournament system works out all the match-ups for you, so you get to just sit back and relax. Until it’s your turn. Then stop relaxing because it’s time for extreme and relentless stress.\nA Test of Character\nCreate a profile and play through the Skill Tester to earn your rank, while simultaneously unlocking some of Western Press’ wild bunch. You start with four playable characters, but you’ll have to earn the other 12 by playing the game. Is there anyone fast enough to unlock Wyatt Hurt?\nStroll Down Memory Lane\nFancy yourself more intellect than athlete? Try Memory Mode, where players must memorise and repeat an ever increasing string of buttons. But make more mistakes than your opponent, and you eat lead.\nSteam Workshop Support\nCreate custom characters and environments with your own animations, sounds and taunts. Then share them with the community via Steam Workshop, where they’ll be downloaded dynamically at the beginning of an online tournament! Create yourself, your friends, your favourite characters, celebrities, politicians, inanimate objects with faces, whatever!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bandit-1","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14886,"name":"Survive in Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29c/29c0128ad4993f1c0dffd0e92a81f610.jpg","description":"“We thought they were our friends and benefactors, but instead they are our masters. The Chronicles didn’t liberate us from our primitive ways – they conquered and destroyed us. The others don’t know, their heads are still full of the melodious voices of our alien masters. But that will change. I will change it!” – Sasaki\nSurvive in Space is a skill-based space shooter with a hardcore focus on gameplay mechanics. You take on the role of Sasaki, a young soldier who discovers the horrible truth of humanity’s enslavement at the hands of the alien Chronicles during a routine mission. His deep anguish leads him to spiral into depression, and in the darkest depths he finds The Shadow, a primal being full of hate that grants him the power to confront the Chronicles.\nFEATURES\nOver 50 different levels\n5 powerful bosses that you will encounter at the end of each sector – every nine levels. Each boss is a skill puzzle of his own, with shifting mechanics and environments that will keep you on your toes.\nOver 20 types of enemies split into three different categories: defensive, offensive and supportive.\n4 different difficulty levels\nGame modes: Additional enemies, Planet fortresses and Asteroids. Active them to make game more interesting.\n5 differenet player ships – each with its own strengths and weaknesses. Find the one that best suits your play style.\nDual Mode. Dual Mode allows Sasaki to toggle his ships into Offensive and Defensive configurations, sacrificing firepower for durability and vice versa.\nNo player level limit cap.\n9 different abilities upgrades\nFull controller and mouse support, customizable keyboard keybindings\nMusic player with over 90 songs. You can add your own music too.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9971,"name":"Spellweaver","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e2/1e2772d646a8600d0af912edc8b8e101.jpg","description":"Spellweaver is a fast-paced and strategically deep digital card game, featuring several mechanics unique to the genre. Created by an indie team of seasoned game developers, and designed by a Magic: the Gathering National Champion, it is easy to learn, yet challenging for veteran card game players.\nOne of Spellweaver's core gameplay features is hero development. During a game, your hero levels up, gains resources, and can develop additional hero skills, letting you craft the perfect hero to complement your deck's strategy.\nSpellweaver's combat system features an innovative creature speed mechanic. Fast creatures allow you to dictate how combat goes, but they have generally weaker stats. Slower creatures are bigger and stronger, but they are also easy to outmaneuver.\nSpellweaver's design allows for quick games, yet offers a huge number of combinations and paths to victory to explore. Join in and have endless hours of fun with this strategic card game created with a lot of passion!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dream Reactor","platforms":[{"id":0,"name":"PC"}]},{"id":4649,"name":"Section 8: Prejudice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d82/d82dbcf92ded452bf8c6fb1bbdd62e52.jpg","description":"On the battlefield, prejudice takes many forms, knows no boundaries, and drives all conflict. In the distant future, humanity will call on its most fearless defenders to confront an emerging threat determined to eradicate all human life as we know it. Section 8®: Prejudice™ is a sci-fi first-person shooter with dynamic combat, where every decision – from customizing equipment to activating team based objectives – drastically impacts the battlefield.Key features:\nPlay as Alex Corde and discover the sinister series of betrayals that now threaten humanity's survival in the single player campaign.\nStrategically spawn anywhere on the battlefield to assist allies or ambush enemies.\nCustomize loadout weapons, ammo, and equipment to suit your playstyle.\nCall in deployables and vehicles when and where you need them to gain tactical advantages.\nMaster true mobility with dropping, overdrive, and jetpacks to outmaneuver opponents.\nComplete a variety of Dynamic Combat Missions - from launching aerial strikes against fortified positions to securing crucial intel.\nAdvance in rank and skill to access a devastating arsenal of over 60 weapons, equipment, and upgrade variants.\nNote: Multiplayer is no longer supported for this title due to August 22, 2013 shutdown of the Games for Windows Live Program from Microsoft. Please see http://support.xbox.com/en-US/xbox-on-other-devices/windows/pc-marketplace-closing for more information. Singleplayer, however, continues to work normally.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"TimeGate Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":58876,"name":"Adventure Time: Pirates of the Enchiridion","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/63b/63b82317c6eedcbf182206c9a5bafe81.jpg","description":"Summary\nAhoy! The Land of Ooo is underwater and it’s up to Finn and Jake to find out why.  Join our heroes as they explore the high seas, search for hidden clues, interrogate shady suspects and fight pirates to solve the mystery and save their waterlogged world!Key Features:\n•\tExplore the Land of Ooo freely, discover secrets and collect loot with playable fan-favourite characters, Finn, Jake, BMO and Marceline.\n•\tSet sail across the high seas between kingdoms and venture into uncharted territories to figure out what’s going on.\n•\tUpgrade your heroes, use items, spells, potions and unique ultimate hero abilities to battle bad guys in fast-paced tactical combat.\n•\tAn all new Adventure Time story, voiced by the series cast.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":28464,"name":"Splosion Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a5/0a58ff5d68d53cf6819ebdb4df7317d8.jpg","description":"(Online Interactions Not Rated by the ESRB) Unlock Splosion Man, one of the most awesome games of all time. The full version of Splosion Man includes an unlockable premium dashboard theme, free gamerpics, and even avatar accessories! You’ve sploded the rest, now splode the best. Splosion Man has a fifty level single-player campaign and a separate fifty level multiplayer cooperative campaign. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Twisted Pixel Games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":20394,"name":"1953 - KGB Unleashed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a8/3a86eff12368077db160143d2cfee74e.jpg","description":"Steam Greenlight\nAbout the GameDeveloped by Phantomery Interactive, 1953 – KGB Unleashed is a tense and atmospheric First Person Adventure set deep within the bowels of a Soviet bunker during the Cold War. Players must uncover the dark and horrifc secrets buried within, fighting their own paranoia along the way as well as the possibility of all-too-real terrors within the bunker. Are the voices emanating from all around you real, or just an hallucination resulting from your isolation? Will you manage to escape into the warm embrace of daylight, or will you be trapped within the foreboding menace of the bunker?\nOnly in 1953 – KGB Unleashed can the answers be found!\n“1953 – KGB  Unleashed” is based on real projects conducted by the Ministry of State Security of the USSR (the former KGB). During that time they pushed the limits of human endurance, testing for the possibility of telepathy, as well as researching the psychological impact of fear on the human brain. The photo-realistic visual style of “1953 – KGB Unleashed” recreates the USSR of the fifties: the underground shelter’s interior is constructed using real Soviet military plans, and the materials found there are based on historically valid documents.\nExplore a hidden laboratory where such experiments were conducted in order to learn the truth behind the terrifying events that led to the closure of the project and the liquidation of its staff. An atmosphere of isolation and suspense pervades throughout, bringing you face to face with your own fears, while the voice of invisible “observer” broadcasts over the internal communications system. Is this observer a friend, or an enemy? Your exploration of this perfectly-preserved complex may uncover what these experiments unlocked deep within the human psyche — but will you survive these revelations intact?FeaturesSecret underground areas with special KGB objects\nStaggering puzzles and many challenging mind game\nRealistically created 1950’s atmosphere","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":14954,"name":"THE KING OF FIGHTERS 2002 UNLIMITED MATCH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82a/82a10cd9723ebc119694b30abe7715c7.jpg","description":"KOF 2002 UM,\nfully upgraded version of KOF 2002 & 2nd title in the UM series,\njoins the battle on STEAM!ABOUT THE GAMEThe second title in the UM series is a fully upgraded version of KOF 2002, a masterpiece of the KOF series deserving of a place honor along with KOF ’98. Based on THE NESTS CHRONICLES, this title includes the most characters of any title in KOF history. All graphics and background music have been completely redone and the game balance has also been extensively redesigned. New moves have been added and others have been brought back, meaning that players can enjoy battling it out for longer than ever.\n\n・66 characters in all – the most playable characters ever in the KOF series:\nWith DNA from Kyo and K’, this title’s original character Nameless is ready for action!\nIn addition to characters that appeared in the original KOF 2002, formidable fighters from THE NESTS CHRONICLES as well as additional characters and hidden characters keep popping up to fight!\n・Don’t miss the updated graphics and production:\n・Updated game sounds:\nThe demo screens, cut-scenes, and winning screens are worth a look:[/b]\nWhat’s more, all background music has been updated for more intense matches!\nTons of new moves and old moves that have been brought back are found in this title only!\nFeel the heat of the upgraded MAX2!!\n・Fully upgraded and redesigned system and game balance for all characters:\nEach character’s special and extra-special moves are former moves and power-changing moves from past series as well as many new moves created for this title only.\nThe MAX2 move for all characters is even more impressive than ever. Now easier to use in real matches for a show of supreme power!!\n・Includes many game modes:\nNot only can 50 different moves be practiced in both “normal” and “expert” difficulties in Challenge Mode, players can also create original combos in “Practice Mode”. There is also “Endless Mode”, where players can battle against the CPU for as long as their endurance will allow.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SNK","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":13632,"name":"Rituals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39f/39f58ba7c0f35cad8d736ab05d94703b.jpg","description":"At its core Rituals is an adventure game with mechanics inspired by classic point and click games. Every environment and puzzle is designed to tell its own part of the story. What is the real purpose of the office building? Why are you walking through the woods at night? Whose voice are you supposed to hear? Immerse yourself in Rituals’ eerie world and see how it relates to the real one.Features:\nFeel the eerie and mysterious ambience reinforced by Ritual’s minimalistic low polygon look.\nFind yourself in many places you didn’t expect. Some real, like a lush jungle, some unreal, like an ancient forest temple, all unsettling. Explore them carefully and find your way out.\nSolve puzzles and ponder on their meaning. There’s a message for you to uncover.\nBe curious. You will find many clues which will help you answer your questions.\nPlay Rituals like you would play a classic adventure game - you’ll only need your mouse and your head.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tymon Zgainski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":24478,"name":"Super Mario Kart","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4da/4da63441cb94d7adb4d954871b65db30.jpg","description":"Select one of eight characters from the Mario™ series—offering a variety\nof driving styles—and take on three championship cups in three different\nkart classes. Win enough, and you'll unlock a fourth circuit: the\nultra-tough Special Cup. Crossing the finish line in first place isn't\nan easy task, though, as each track has unique obstacles to conquer and\nracers can obtain special power-ups that boost them to victory. With\nmore than 15 tracks to master and nearly endless replay value, Super\nMario Kart is classic gaming…with some banana peels thrown in for good\nmeasure!\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"SNES"}]}]