[{"id":371831,"name":"Xenoblade Chronicles: Definitive Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/773/7739920af75d01f6a3b7e76a21d1633a.jpg","description":"MONOLITHSOFT’s epic Xenoblade Chronicles, which originally launched in 2011 on Wii, is destined to be reborn on Nintendo Switch as Xenoblade Chronicles: Definitive Edition.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":327238,"name":"Empire of Sin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a5/7a578aecba92b011053b66ac79e73703.jpg","description":"Empire of Sin, the strategy game from Romero Games and Paradox Interactive, puts you at the heart of the ruthless criminal underworld of 1920s Prohibition-era Chicago. It’s up to you to hustle, charm and intimidate your way to the top of the pile and do whatever it takes to stay there. This character-driven, noir-inspired game puts players smack dab in the glitz and glamor of the roaring 20s, all while working behind the scenes in the gritty underbelly of organized crime.\r\n\r\nBuild A Crime Empire: Raise your criminal empire from the ground up by selecting your racket of choice (be it speakeasies, union protection, or casinos) and building a team of loyal mobsters to make your mark on the streets. Once you make a name for yourself, expand your influence by taking over rival territory and add more endeavors to your repertoire.\r\n\r\nDefend and Expand Territory: If it comes to blows, hypothetically of course, and your posse needs to send a message, face off in brutal turn-based combat. Strategically recruit your goons and build a strong chemistry within your crew to maximize combat damage and help secure your hold on the city. \r\n\r\nLiving, Breathing World: Explore the streets of vibrant 1920s Chicago and interact with a full cast of living, breathing characters each with lives of their own that inform how they react to what you do (or don’t do). Schmooze, coerce, seduce, threaten, or kill them to get your way.\r\n\r\nWield Your Influence: Make and break alliances, bribe cops, and trade on the black market to raise your faction rating and expand your crime family. But always keep your enemies close and ensure you have a mole on the inside and eyes everywhere.\r\n\r\nMultiple Victory Strategies: Whether you make it to the top with violence, social influence, or city-wide notoriety, there are a number of ways to become King or Queen of Chicago. With various starting conditions and constantly changing crew dynamics, no two playthroughs will ever be the same.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Romero Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17567,"name":"Realms of Arkania: Blade of Destiny","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a99/a99214c37a81760c93f0a394567c9a90.jpg","description":"A legend reborn as Realms of Arkania: Blade of Destiny returns!\nDeveloped by Austrian developer Crafty Studios, Realms of Arkania – Blade of Destiny is a faithful remake of the 1992 original, adored by a generation of Role Players and one of the most successful RPG’s of the 1990’s.\nGet ready to return to Thorwal, one of the oldest cities of Aventuria. Make sure your wits are sharpened before walking down the small alleys of Thorwal and Prem, and prepare to stop the Orcisch threat while creating a mighty alliance between nations. Featuring a complete visual reimagining along with a comprehensive overhaul of every aspect of the gameplay, Realms of Arkania – Blade of Destiny is set to captivate a 21st century audience of new and old fans alike.\nOld school RPG at its best – for the Fans of REAL RPG games.Features:Remake of the first part of Realms of Arkania\nRoleplaygame with turn based tactical fights\nCities and dungeons in current real-time-3D\nDozens of talents, fighting skills and magical skills\nAuthentic realization of the TDE basic rules\nDepending on your gaming style – 20 to 80 hours game timeRevised EditionUser-Contributed Content\nModding ability\nAdditional encounters, making Aventuria even more alive\nEnhanced Battles\nCompletely redone graphics\nCompletely revised and improved User Interface\nExtended music selection\nEnhanced sound\nSteam Achievements, Stats and Cloud\nLinux build","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14069,"name":"Disciples III - Resurrection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6b7/6b75643f272367750ded6e04aad7fa19.jpg","description":"Disciples III: Resurrection – a grand sequel of the series!\nThis is a new landmark in the history of Nevendaar, when a new race ascends to power – the ruthless and merciless Undead Hordes. It is the story of selfless love and unfading glory. Heroes of the past, who had lost their lives, but not their sentience, are exacting their revenge in the name of Mortis, the Goddess of Death.\nThis Disciples 3 game is dedicated to a new race – the Undead Hordes. It was the mostly anticipated race among the gamers and fans of the Disciples series, and now their dreams have come true.\nKey features:\nThe most expected race – The Undead Hordes!\nOver 70 hours of gameplay. This is even more than in the previous game in the series – Disciples III: Renaissance!\nTwo storyline characters, four leaders of the Undead Hordes, two bosses and over 50 new units.\nRevised gameplay balance.\nFamous distinct gothic atmosphere. Unique style and design. Detailed and realistic world.\nDramatic and intriguing plot with countless different exciting quests.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Akella","platforms":[{"id":0,"name":"PC"}]},{"id":10094,"name":"Pit People","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/54a/54ae4bf441af8310e69c0702c277be39.jpg","description":"Master Your Destiny in this Strategic Game of Positioning\nA full cast of tragically unique heroes will rise together from the Pit. Master your destiny as you plot their course of action across an apocalyptic wonderland!\nIn our fast-paced, turn-based, co-op adventure you'll quest and explore, find awesome loot, customize your fighters, and recruit strange species. Rally your troops and steel your wits if you hope to survive a hostile world filled with sinister robots, deadly vampires and brutally adorable cupcake people!Highlights: Single Player Mode\n2 Player Co-op (local & online)\nLocal 2v2 Arena\n4 Players For 2v2 In the Pit (online)\n“Guidance” from a mysterious and power-hungry narrator (voiced by Will Stamper, \"BattleBlock Theater\")\nSignature Behemoth art style & humor","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Behemoth","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9613,"name":"Tilt Brush","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d94/d9406aae0480e81aa35ff991c5c09f0f.jpg","description":"Tilt Brush lets you paint in 3D space with virtual reality. Unleash your creativity with three-dimensional brush strokes, stars, light, and even fire. Your room is your canvas. Your palette is your imagination. The possibilities are endless.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Google","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":6058,"name":"Ichi","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c16/c1681d229d4f1408f6aef81168b56e8b.jpeg","description":"Ichi is an easy to play but challenging one button puzzle game. Don't be deceived by the game simplistic look, it’s a braintwister for sure! Collect golden rings by rotating objects, using teleporters, breaking blocks and more. If that isn’t enough, the game includes a level editor that allows you to create your own levels and share them with anyone around the globe!\nFun and original one button gameplay\nBuilt-in level editor!\nOver 19.000 levels!\nCreate and share your levels online.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stolen Couch Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":5593,"name":"nail'd","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20f/20fc64c5e2cbc11708d09efc7b02cd44.jpg","description":"Constant sensation of ultimate speed is the players companion throughout the game. Lightning-fast reflexes and tactical skills are what stands between victory and defeat.\nBreakneck rides on near vertical mountainsides with up to 70-degree slopes - feel your heart pumping!\nExtreme track design with breathtaking vistas - learning the inside-outs of their topography will be an advantage in the race for #1.\nSteer your vehicle mid air allowing for full control over your ride. Shortening or lengthening your jumps, changing angles can make or break your lap time.\n\nAssemble your own vehicles from a wide selection of parts and components. Adjust their parameters to best suit your playing style and personalize the looks, making it unique and truly your own.\nFeatures\t\t\t\t\t\tDifferent classes compete simultaneously on the same track\nUnique original soundtrack that brings across the vibe of the game, from members renowned bands such as Deftones, Fear Factory, Hatebreed or Static X, created specifically for nail'd\n14 unforgettable tracks in 4 exciting locations\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":579,"name":"Pokémon GO","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/97a/97ab26a9d092783e68190dc686916b0b.jpg","description":"Join Trainers across the globe who are discovering Pokémon as they explore the world around them. The newest update to Pokémon GO, the global gaming sensation that has been downloaded 650 million times and named “Best Mobile Game” by The Game Developers Choice Awards and “Best App of the Year” by TechCrunch, introduced the addition of over 80 beloved Pokémon among several other new features.\nVenusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered!\nNow’s your chance to discover and capture the Pokémon all around you—so get your shoes on, step outside, and explore the world. You’ll join one of three teams and battle for the prestige and ownership of Gyms with your Pokémon at your side.\n\nPokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!\n\nSearch far and wide for Pokémon and items\nCertain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops, found at interesting places like museums, art installations, historical markers, and monuments, to stock up on Poké Balls and helpful items.\n\nCatching, hatching, evolving, and more\nAs you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind. Choose a Buddy Pokémon to walk with and earn Candy that will help you make your Pokémon stronger.\n\nTake on Gym battles and defend your Gym\nAs your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers.\n\nIt’s time to get moving—your real-life adventures await!\nNote:\n- This app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.\n- It is recommended to play while connected to a network in order to obtain accurate location information.\n- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks\n- Compatibility information may be changed at any time.\n- Information current as of December 21, 2016\n- Compatible with iPhone® 5/5c/5s/SE/6/6s/6 Plus/6s Plus devices with iOS Version 8 - 9 installed\n- Not compatible with 5th generation iPod Touch devices or iPhone 4S or earlier iPhone devices.\n- Please visit www.PokemonGO.com for additional compatibility information.\n- Compatibility with tablet devices is not guaranteed.\n- Compatibility is not guaranteed for all devices.\n- Continued use of GPS running in the background can dramatically reduce battery life.\n- If you use Pokémon GO with your Apple Watch, with your consent we use the Apple HealthKit APIs to read and/or write certain data (such as Step Count, Calories Burned, and Distance Walked) to the Health App Database on your device (the “Health App Data”).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nintendo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":428012,"name":"There Is No Game: Jam Edition 2015","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8b3/8b3f2ce5e2cb579c61061fdc24c26f92.jpg","description":"I told you there is no game!\nIt's not like it’s a Point&Click that won the 2015 Construct Deception Jam, or that millions of people have tried it.\nOf course not!\nAnd if you’ve never heard of it, now’s the perfect time to go for a walk, read a book... or something…WEAK POINTS:It's free, which is a problem when you go to ask for a refund.\nThe voice-over acting is pathetic.\nThere are only two different endings, which you’ll never even get to because you’re not going to install it.HIGHLIGHTSSince there's no game, you'll be saving a lot of time. Isn't that great?\nIt contains a keyboard shortcut that simplifies your progress: ALT+F4\nIf, despite all these warnings, you “had fun,” we strongly advise you not to click on the following image to discover \"THERE IS NO GAME:\nWrong dimension\".\nNo, really... don't do it.\nhttps://store.steampowered.com/app/1240210","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Draw Me A Pixel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":255879,"name":"Drunken Wrestlers 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39e/39e0246159646325f2cc07d9349f38f6.jpg","description":"Drunken Wrestlers 2 is a funny multiplayer fighting game based on active ragdoll technology.Features:Physics based fighting mechanics\nAdvanced physically simulated biped behaviour\nFluid simulation for blood\nMultiple gamemodes with different gameplay\nMultiplayer for up to 8 players\nCharacter customizationPlanned features:Ingame map/gamemode editor with runtime scripting support\nAbility to create your own set of fighting moves\nReplay saving\nMore gamemodes and maps\nItem trading","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Oleg Skutte","platforms":[{"id":0,"name":"PC"}]},{"id":27953,"name":"Animal Crossing: New Leaf","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/178/178b72170c6d66f06cc4b33e79e00899.jpg","description":"Animal Crossing: New Leaf is a life simulation video game released in 2012 for the Nintendo 3DS. The player takes on the role of mayor of a new town, and with the help of the townsfolk and Isabelle, an eager secretary, it will be their job to make the town a better place to live.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":22740,"name":"Capitalism 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e62/e62df63d222c0122301220f724cf108c.jpg","description":"Capitalism 2 lets you build the empire of your dreams!\nYou become a corporate CEO and face real-world challenges as you build a business empire! It's a comprehensive business simulation that gives you the power to win the competition in the free market, with complex business strategies that might make you millions! Choose from over 60 product types to manufacture and market, as you hire and fire upper management positions! It's time to try your hand in the corporate world with Capitalism 2!\nThis is the most comprehensive business simulation available!Key Features:Make critical business decisions in all areas including retail, manufacturing, marketing, research, agriculture, mining, real estate development and more\nChoose from over 60 product types to manufacture and market\nHire and fire upper management positions such as Chief Operating Officer, Chief Marketing Officer, and Chief Technical Officer\nDevelop your own technology or acquire it from another company\nExpand your corporation into a true conglomerate; get ink on your fingers and take to the airwaves with your newspaper publishers, TV, and radio stations\nA realistic stock market that allows you to trade stock for quick profits or make long-term investments for ultimate rewards. On a corporate level, you may take the path of merger and acquisition to expand your business empire rapidly\n* Multiplayer mode is functional, but not supported. We recommend using GameRanger for multiplayer matchmaking.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Enlight Software","platforms":[{"id":0,"name":"PC"}]},{"id":10514,"name":"Master of Orion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c3/5c3e369a282912e96076f818e7d1a22b.jpg","description":"Master Of Orion – Conquer the Stars\nThe ascendant spacefaring 4X strategy game returns! A new chapter in the epic Master of Orion saga is poised to once again capture the imaginations of millions of gamers.\nDiehard fans of the first games will be ecstatic to know that this revival is being built under the watchful eyes of members from the original development team, in conjunction with NGD Studios in Buenos Aires!\nDiscover Master of Orion as it was always meant to be: A fully orchestrated score, interstellar warfare and exploration against the backdrop of beautifully animated far flung galaxies. Confront hostile civilizations, negotiate with mysterious aliens, share knowledge with allies and uncover this newly imagined universe.\nJust a sampling of the features you will find:\nAll 10 original Master of Orion races, brought to life through compelling AI and award-winning voice acting talent\nOver 75 researchable technological advancements\nVast galaxies featuring up to a 100 different solar systems, each composed of myriad planets and stars\nCustomizable ships with diverse styles for each race\nMultiple ways to win – including conquest, technological, diplomatic, and more\nEnthralling gameplay that will have you saying “just one more turn” again and againAnd in the Collector’s Edition:\tThe exclusive Terran race of militant humans to play in the game\nSpecial pixelated ship models available in the game for a more retro feel\nAll three legendary original games – Master of Orion 1, 2, and 3\nA nearly 300-page Art Book (in digital format) showing the progress of the game’s art along with the original concept art and line drawings\nMusic files from the game and printable music scores","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NGD Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":705258,"name":"Have a Nice Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/648/6485d70bb1166ba94353182d61fcd157.jpg","description":"Discover and explore the darkly-charming, procedurally-generated departments of Death Inc., where you’ll meet a diverse cast of memorable characters—like your affable pumpkin-headed assistant, Pump Quinn—who are always willing to share the latest office gossip\n\n\n\nSharpen your skills (and scythe) through fast-paced hack n’ slash combat, utilizing over 30 unique weapons and spells you can find and upgrade to create devastating combinations\n\n\n\nSince Death can’t die, use what you’ve learned and earned to overcome the numerous minions and bosses in each department of Death Incorporated... over and over. A performance review after every run guarantees that you’ll unlock interesting items and upgrades that will help you progress on your journey\n\n\n\nTaking more power for yourself is a controversial move in Death Incorporated’s company culture. For instance, adopting a Curse upgrade for yourself might result in the Labor Inspector granting your subordinates enhanced powers, or worse, raising the cost of koffee and other items that are vital to your work output","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Magic Design Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":372678,"name":"Pawnbarian","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edd/edd31d4a79e7a25c1a58cb2700c40ba0.jpg","description":"Pawnbarian is a quick playing rogue like puzzler that embodies the \"easy to pick up, hard to master\" mantra.\nYou'll maneuver through hordes of enemies using chess moves, hacking and slashing your way to victory.\nCareful strategy, playing around all sorts of statuses and traits, and some light deck building will help you along the way through this unforgiving dungeon crawl. For treasure and glory! Mostly glory.\nPawnbarian is an expanded reimagining of a critically-acclaimed 7 Day Roguelike game jam entry.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"j4nw","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":26472,"name":"Spider-Man: Shattered Dimensions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bef/bef40c8ee09ad001c0f0b2cf0d07f20e.jpg","description":"Spider-Man: Shattered Dimensions is a groundbreaking, action-packed\nadventure encompassing four dramatically different parallel universes,\neach with its own Spider-Man armed with unique strengths. Each stunning\nuniverse has its own detailed art design and thrilling gameplay with\nchallenging skill sets to master in order to unlock powerful new moves.\nExplore dramatic, stunning environments, wield explosive new powers, and\nface epic boss battles against extraordinary foes. Experience the\nlegendary Super Hero like never before: Four unique worlds. Four\ndistinct Spider-Men. One unparalleled experience!\n\nThe Tablet of Order and Chaos has shattered - hurtling fragments across\ntime and space. As Spider-Man, you must overcome a collision course of\nextraordinary challenges jam-packed with enemies, new and old, across\nfour distinct parallel universes. Ground breaking gameplay lets you deal\ndamage in a variety of ways with four unique Spider-Man Characters:\n\nAmazing Spider-Man — This most recognizable, acrobatic Spider-Man\ndelivers innovative web combat and dynamic visuals in a world that pays\ntribute to the classic era of our legendary Super Hero.\nSpider-Man\nNoir — The cunning and clandestine Spider-Man utilizes the shadows\nto perform stealth takedowns in this 1930’s-influenced black-and-white\ncinematic environment.\nSpider-Man 2099 — Free-fall and glide\nacross vertical buildings as Spider-Man 2099 in a futuristic, next-gen\nlandscape of giant skyscrapers and fast-moving hover cars.\nUltimate\nSpider-Man — Play as the Black-suit Spider-Man in the Ultimate\nuniverse where powerful tendril attacks become a strategic advantage in\nthis contemporary world of vivid colors and electrifying environments.\n\nFeatures\n\n• Explore four distinct, dramatic settings. From the\npen-and-ink-styled Amazing Spider-Man to the moody, 1930s Noir to the\nthe futuristic 2099 to the vivid Ultimate, each dimension has its own\nvisual art design that brings Spider-Man to life\n• Experience\nSpider-Man x4, with unique strengths for each world. Discover\nunexpected and truly exciting gameplay mechanics that highlight the\ndistinguishing characteristics of Spide-Man in each world, from the\nshadowed stealth attacks of Spider-Man Noir to the free-falling of\nSpider-Man 2099 and more.\n• Go beyond the traditional New York\nCity with a myriad of locations and styles. Venture through jungles,\ntrain yards, military bases and more. Even New York City provides\nsurprises and variety as it's updated to reflect the unique time period\nof each of the four dimensions.\n• Immerse yourself in truly epic\nboss battles. Boss-themed levels bring the environments, music and\npacing in tune with some of the most thrilling, iconic villains from\nSpider-Man lore, including the lethal Carnage and the never-before-seen\nHammerhead Noir. Deliver damage up close and personal with a\nfirst-person perspective during key moments of battle where strategy is\nkey to success.\n• Variety, variety, variety. With four\nvastly different worlds to explore, new abilities to uncover, plus\nmultiple costumes and bonues to unlock, you'll discover new surprises\naround every corner.\n• NDS Exclusives. Experience\nhigh-octane action and master strategic puzzles in this non-linear 3D\nside-scrolling handheld version of the game with exclusive villains such\nas Sivermane 2099 and Calypso Noir","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Beenox Studios","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":60847,"name":"Verlet Swing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cd/2cd897e4fbe42c02dd097060e06b54ff.jpg","description":"Swing your way through a fever dream. Master the momentum and become the best swinger in history!Features First-person fast-paced swinging.\nInsta-death on collision.\nExploding heads.\nIn-game timer.\nA E S T H E T I C.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":38860,"name":"Adventures of Sherlock Holmes: The Mystery of the Persian Carpet","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/221/22185bf17739ead5523d291873231437.jpg","description":"Hunker down at your London flat at 221b Baker St. The year is 1896, and Scotland Yard has called Sherlock Holmes with an urgent request for help. A young painter has been found murdered and rolled up in a remarkable Persian carpet. Along with Watson, you must investigate the peculiar crime, exploring crime scene locations in search of missing clues.\nInteract with suspects, and analyze police reports and witness statements to solve the crime and unravel the mystery of the Persian carpet!\nSearch for crime scene for hidden objects\nAnalyse clues and Police findings\nInvestigate numerous suspects\nReview your progress by studying the Holmes' Deduction Board\nInteractive gameplay\nDetailed, atmospheric 3D scenes\nPeriod background music\nBonus mini-puzzle games!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frogwares","platforms":[{"id":0,"name":"PC"}]},{"id":38808,"name":"Penny Arcade Adventures: On the Rain-Slick Precipice of Darkness, Episode Two","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db6/db6b2b662ea93f3093acc3b8f9fff748.jpg","description":"On the Rain-Slick Precipice of Darkness is an RPG-Adventure game set in the comic-book-meets-pulp-horror-meets-H.P. Lovecraft deranged 1920s universe of New Arcadia, delivering mature and compelling entertainment to gamers via accessible episodic delivery. The creative collaboration between Penny Arcade creators Mike ‘Gabe’ Krahulik and Jerry ‘Tycho’ Holkins, legendary game designer Ron Gilbert and veteran producers Hothead Games results in a 100% authentic Penny Arcade experience that pushes bizarre characters, outrageous combat and adult humor to the precipices of darkness.\nIn Episode Two, players are once again joined by Gabe and Tycho, the crime-solving team of the Startling Developments Detective Agency. Explore the depths of the Cloying Odor Sanitarium, wield all new ferocious weapons and fight giant spiders, all while hot on the trail of a giant and menacing, fruit-fornicating robot. Return to New Arcadia and enjoy more puzzles, new areas to explore, newly implemented difficulty settings and even more levels to gain.\nOn the Rain-Slick Precipice of Darkness © 2008 Hothead Games, Inc. Penny Arcade, the Penny Arcade logo, and the Penny Arcade Adventures logo are trademarks of Penny Arcade, Inc. in the U.S. and/or other countries. Hothead, the Hothead Games logo, and the On the Rain-Slick Precipice of Darkness logo are trademarks of Hothead Games, Inc. in the U.S. and/or other countries. All Rights Reserved. All other trademarks and logos are the property of their respective owners.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Hothead Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":35573,"name":"Harry Potter and the Prisoner of Azkaban","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a92/a92fed7dd3f4d70b59896169da5b3660.jpg","description":"The Dementors are coming, and this time Harry needs his friends. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, Harry Potter and the Prisoner of Azkaban immerses you in the world of Harry Potter. As Harry, Ron, and Hermione, you'll face the dreaded Azkaban guards, fly the Hippogriff around towers, and explore Hogwarts with the Marauder's Map. Learn spells that allow you to freeze creatures, control dragons, and conjure a Patronus. New two-player minigames include Flying Seahorse Fishing and Dueling Club minigames.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"KnowWonder","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":26293,"name":"Sonic & Knuckles","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f61/f61cc8e0bce08615d90918e428aa5dc9.jpg","description":"Sonic, the world's fastest hedgehog, continues his adventures in this\nfourth installment of the Sonic The Hedgehog series! This time, he\nbuddies up with his former enemy, Knuckles the Echidna in order to\ndefeat the evil Dr. Eggman (AKA Dr. Robotnik). At the end of Sonic The\nHedgehog 3, Dr. Eggman’s ultimate orbital weapon for global domination,\nthe Death Egg, was badly damaged in an epic battle with Sonic. The Death\nEgg, losing power rapidly, hurtled back down to the planet below and\ncrash-landed on the mysterious Angel Island again. Now Sonic and\nKnuckles must put a stop to Dr. Eggman once and for all, before Eggman\nand his no-good-niks get the chance to find the secret to Angel Island’s\nfloating power, the Master Emerald.\n\nThis game features Lock-On Technology, which allows you to play other\nSonic titles as Knuckles. To play as Knuckles in Sonic The Hedgehog 2\nand 3, simply make sure you have copies of Sonic and Knuckles and Sonic\nThe Hedgehog 2 and 3 in your Virtual Console library.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Wii.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"SEGA","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Wii"},{"id":0,"name":"Genesis"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox 360"}]},{"id":19468,"name":"Critical Mass","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68b/68bc18e4555c7b5edfd7293d7b29e2b5.jpg","description":"Critical Mass is an action puzzle game that takes traditional match 3 and brings it into the world of 3D. We combine fast addictive game play with strategy to create a new and innovative experience.Key features:Fast Addictive Gameplay\n4 Unique Game Modes\nOnline Leaderboards & Ranking Systems\nAchievements & Skillpoint Rewards\nAccessible to Everyone\nExciting Colorful Art Style\nGreat Music & Sound Effects.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Manic Game Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2202,"name":"Total War Battles: KINGDOM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/551/55153ac85cec4a13b0749221142e3877.jpeg","description":"Shape the land, build sprawling towns and recruit and train a powerful army. Conquer new territories to expand your realm and defeat rival lords and other players in epic real-time battles.\n\n## FEATURES\n\n* Build and expand your Kingdom, with farms, quarries, blacksmiths and more.\n* Alter the land by creating rivers, lakes and mountains.\n* Command your army in large-scale battles.\n* Battle other players in real-time.\n* Cross-Platform - Play on Phones, Tablet and PC, whenever you want, wherever you want. Actions in your Kingdom will carry over onto any device you play on.\n* From the creators of the award-winning Total War™ games.\n\n## PLEASE NOTE\n\n* Total War Battles: KINGDOM is free to download and play.\n* Additional Gold can be purchased using real money.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SEGA","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":349677,"name":"Aperture Hand Lab","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b31/b3148a269a65f8adb546bd39c4d26dd4.jpg","description":"These Aren't Your Daddy's Hands.These aren't even your hands. These are precision-tuned sensor-rich re-imaginings of your hands, presented in high-fidelity simulated reality.Main Features:Grabbing\nShaking\nWaving\nIf you've always longed to try these exciting edge-of-your-wrist hand maneuvers, but wanted the chance to practice first in the safety of a non-judgmental virtual world, Aperture Hand Lab is easily in the top three options currently available to you in VR.Presented in the World of Aperture.You didn’t read that wrong! This game is present in the bowl of ape nature! Hold on, we did read that wrong! But you didn’t, Reading Champ! This game takes place in Aperture Science, home to the modestly popular Portal games your daddy used to play! But this isn’t your daddy’s game! (Return to top.)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cloudhead Games","platforms":[{"id":0,"name":"PC"}]},{"id":304188,"name":"Moons of Madness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/043/043740eb0ebe0c634963ae51ab3b1643.jpg","description":"The cosmic horror game, set on Mars in a not-so-distant future and which mixes the scientific exploration of the red planet with the supernatural dread of Lovecraftian horror, will be released during the Halloween 2019 season for PC, Xbox One, and PlayStation 4.\n\nA mysterious signal has been recorded coming from the red planet.\n\nThe message confounded Orochi scientists. Their analysts broke it down and determined it was of intelligent origin. Orochi management immediately concluded that the discovery was too sensitive for public knowledge and moved to keep it hidden. In secret, the corporation began construction of Trailblazer Alpha, a state-of-the-art Mars research outpost designed to identify the true nature of the message.\n\nYou are Shane Newehart, an engineer stationed at Trailblazer Alpha and your security clearance means you are completely unaware of the existence of the mysterious signal. Your job is simply to keep the lights on until the transport ship Cyrano arrives bringing with it a new team to take over your duties.\n\nSoon you discover strange and unusual setbacks. Crucial systems are malfunctioning, the greenhouse is filled with a strange mist and the rest of your team has yet to return from their EVA mission. \n\nThings are starting to fall apart.\n\nYou begin seeing and hearing things that aren’t there. Visions, hallucinations – or is that even what it is? Is this real… or are you slowly descending into madness?\n\nExperience true cosmic horror\nWith your only hope of rescue hundreds of thousands of miles away, you will be forced to explore the real-world fears of isolation and paranoia, enhanced with supernatural elements and cosmic horror. Terrifying visions and monstrous apparitions will make you question what is real and what is not as the very fabric of reality threatens to tear at the seams.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Rock Pocket Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19623,"name":"CrimeCraft: GangWars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/684/684007e42cb00d7815005bbaf66da542.jpg","description":"GangWars is a massive expansion for the Free-to-Play Online Shooter CrimeCraft. GangWars revamps the experience for new users while also adding exciting end game content for veteran players.\nGangWars is set in the bloody aftermath of the Bleedout Campaign and the destruction of the Scorpion Chamber, the governing body of Sunrise City. Gangs now fight for control of the city. Build a gang and establish \"street cred\" for your crew based on individual and team achievements. Go to war against your opponents using a diverse arsenal of weapons, abilities and boosts. Capture all 20 unique combat zones and own it all, generating cash, bonuses and loot for your gang's dominance.\nKey Features:\t\t\t\tTerritory Wars: Join a gang and fight for control of 20 combat zones, 3 social districts, and ultimately Sunrise City itself! Rule the streets with your gang’s logo displayed throughout and receive valuable spoils.\nQuickplay: Access CrimeCraft's combat, character customization, equipment shops and social features in an easy to use interface that lets you shortcut the time consuming in-depth RPG gameplay. Players can switch between the streamlined Quickplay experience and the fully featured Sunrise City with the click of a button.\nClass Profiles: Experience immediate and intense combat action using over 20 distinct profiles, each providing all necessary equipment including weapons, clothing, ammo, boosts, abilities and AUGs.\nUnique Game Mode: Core Annihilation is an epic game mode that blends PvP and PvE combat. Players cooperate with AI controlled soldiers to destroy an opponent's core while protecting their own.\nNew Turf: La'Famiglia Compound, a 6-16 player combat zone, is the epitome of lavish luxury and criminal greed... a mansion every gang dreams of controlling.\nAbout CrimeCraft:\t\t\t\tOnline Shooter:   CrimeCraft takes the best persistent world RPG features (thousands of players, guilds, PvE and PvP Combat, missions, loot, crafting, trading) and combines them with the action and skill based gameplay of a shooter.\nFrequent Updates: Huge content updates have previously added: gripping storyline, animated cut scenes by comic book all stars, episodic PvE campaign, player controlled nightclubs, tournaments (daily, weekly and monthly) as well as additional maps, gamemodes, weapons, and skills. New items are added bi-weekly.\nFree to Play: Play as long as you want for free.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Vogster Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":17833,"name":"Might & Magic X - Legacy","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa5/fa5a83902e207dd8c83b9785029deb8f.jpg","description":"After a decade, a Might & Magic® RPG is back with both the unique core formula and a new set of improved and fine-tuned features. The best RPG of its class!\nIn the wake of the spectacular events in Might & Magic® Heroes® VI, you will play in a party of four adventurers entangled in intrigue and political machinations unfolding in and around Karthal. The city, on the verge of secession, is prey to competing factions vying for its control. Your actions will determine the fate of the city.\nMight & Magic® X Legacy is an authentic solo experience in the classic first-person RPG genre. Create and lead your group into an exciting open world and battle mythical powerful creatures while collecting ancient magical treasures!Reviews\"Might & Magic X – Legacy has everything it needs to be the next great title in the series\"\nRPG Codex\n“Schedule some vacation for early 2014”\nRPG Watch\n“A high-pressure blast of nostalgia”\n82.5% - Game InformerDeluxe Digital EditionFREE COPY OF MIGHT & MAGIC® VI\nThe Deluxe Edition includes a free copy of Might & Magic VI, one of the most praised episodes in the Might & Magic franchise.\nEXCLUSIVE DUNGEON WHEN IT RELEASES: THE DREAM SHARD\nExplore the Dream Shard dungeon and pursue your quests in the Agyn Peninsula!\nFIRST DLC FOR FREE WHEN IT RELEASES: THE FALCON AND THE UNICORN\nDeluxe Edition owners will get to enjoy the game’s very first DLC called the Falcon and the Unicorn for free when it releases.\nDIGITAL SOUNDTRACK\nGet the Might & Magic X – Legacy official soundtrack on audio CD and listen to thirteen unique compositions from the acclaimed duo of composers, Roc Chen and Jason Graves.Standard Digital EditionFULL GAME\nRediscover the mythic Might & Magic role-playing series, updated for a new generation in Might & Magic X - Legacy. Experience a gripping four-act story that will test your tactics and judgement.\n12 playable classes\nCustomise your team of adventurers with choices from 12 different classes, 4 races, and over 20 skills. Evolve your party members and develop unique strategies using freshly acquired spells.\n3 towns and 1 city\nBegin your great journey at Sorpigal-by-the-Sea, travel to the other settlements, visit monuments, recruit hirelings, and trade with shopkeepers.\nOpen world\nTravel through stunning environments, choose which region you want to explore first but be careful, danger is never far off.\nVarious quests\nDiscover the sinister plot happening in the Agyn Peninsula, shape its inhabitants' stories, and evolve your party thanks to fun and original quests full of Easter Eggs!\n20+ dungeons\nExperience fear and claustrophobia in the dark heart of classic dungeons, and feel vulnerable to attack from all sides while crossing open landscapes.\nMore than 60 creatures and 6 unique bosses\nFace cunning foes in turn-based combat and adapt your fighting skills to the mightiest creatures.\nMODDING KIT\nCreate your own map and mods to express yourself, design the game you want to play and share your creative vision with the Might & Magic X – Legacy community!Caractéristiques PrincipalesDive into vintage Might & Magic®\nDiscover an authentic franchise that defined early PC RPG gaming in the 80s! This classic and timeless RPG has returned after eleven years of waiting and has been adapted to today’s standards while respecting yesterday’s expectations. Old school, new rules!\nCreate your party\nTake control of a team of four adventurers chosen among four different races. Twelve classes are available, each one having their own skill system. Thousands of combinations are possible!\nForge your own tactics\nThrough a turn-based gameplay system, defeat creatures and unique bosses and accomplish unique quests, level up your group and gain new powerful artifacts.\nDiscover a new part of Ashan\nExplore the Agyn Peninsula – a totally new, unexplored environment in the Might & Magic universe. Get familiar with its epic wilderness and meet the locals who pack quite a few surprises…\nExplore twisted dungeons\nMake your way through dangerous dungeons, cities, and labyrinths full of traps, and solve puzzles and riddles to rack your brain! Beware: You never know what’s hiding around the corner!\nExplore twisted dungeons\nBuild your own adventure and quests and share them with the community. The legacy is yours!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14836,"name":"Clones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f61/f618a50e4af36d9d20614087f98bee60.jpg","description":"Clones includes robust internet-multiplayer with team play, different game modes, powerups, leaderboards, and a built-in level editor that was used to create the singleplayer campaign of over 150 clontastic puzzles spanning 11 CloneMaster bosses over 5 regions of the Clones Planet.\nThe Intergalactic CloneMaster Organization welcomes you! Take the scenic route and solve the fun and challenging problems crafted by the most cunning creatures in the universe.  Then try the competitive route and test out your strategies head-to-head, in real-time, against other players from around the galaxy!\n\nGuide your clones as you explore over 150 perplexing puzzles on your pilgrimage across the Clones Planet to learn from the clever and quirky CloneMasters.  Truly a thing of wonder, the clone’s body has the remarkable ability of morphing into many different shapes to perform various actions. As a CloneMaster you must instruct each Clone when to perform a morph to overcome any obstacles.  By defeating the Elder CloneMasters in one-on-one matches you will piece together the ancient CloneMaster Medallion and reveal a most formidable opponent.\n\nEnjoy the thrill as you outwit your opponents during online play and witness the glory as you sneak out a clone on a successful sabotage mission, or admit defeat as your squad of clones is secretly stolen due to marvelous misdirection!  Team up with friends and play co-op in any of the over 50 multiplayer levels, or create your own using the built-in level editor.  Custom levels are automatically shared when a new player joins your server.Key features:Puzzles Galore: With over 150 unique singleplayer puzzles presented by 11 zany CloneMasters spread across 5 environmental themes, Clones will provide you with many hours of mind bending fun!  Pack a lunch.\nMultiplayer Mania: Support for up to 16 players in 8 colorful groups.  Experience intense real-time strategy at its best by using the built-in server browser to find a LAN or internet match.  In-game chats help you co-ordinate with your team and confuse your opponent!  Spectators can watch matches without participating to study your mad skills.\nCustomization: Use your creativity and the avatar creator to generate your own personal clone avatar by arranging the hair, antlers, eyes, body, and mouth any way you want!  Easily tweak multiplayer level settings on the fly to adjust morph counts and play with dozens or thousands of clones, if you can handle it.\nPlayer Friendly: Per-puzzle checkpoints can be set at any time, preventing the frustration of having to start all over again on the tricky levels we’ve carefully prepared. Mini-map lets you quickly navigate, and warnings sound when your clones are in trouble.\nNo Fillers: We know your time is important.  Each and every level in Clones is different and presents a unique puzzle concept.  We’ve worked hard to make the Clones experience as smooth as possible in every way.\nBonus Items: Unlock stamps, decorations, and hidden levels as you progress. Use decorations to customize your clones in action, and use stamps to tag the terrain and taunt your opponents in multiplayer!\nWYSIWYG Level Editor: Easily create and publish your own puzzles using the fully featured built-in level editor.  Freely browse and download levels shared by others directly from ClonesGame.com\nCloneStats Ranking: Prove you have the quickest mind on the block with CloneStats world ranking system which includes detailed per-puzzle leaderboards and a chess-inspired multiplayer ranking system.\nMatch Playbacks: Each game session is automatically recorded so you can share your solutions with others, or record a video of your epic multiplayer victory for all to see!\nDiverse Gameplay: Dozens of awesome contraptions to interact with: some will help your clones, others will obliterate them!  Your clones can fly, walk on the ceiling, grow and shrink, predict the future and more!  Multiple FPS-style game modes such as Capture The Clone, Quantum Quarrel (aka Last Clone Standing), and Multiverse Match (aka Head-to-Head) provide variety and replayability.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Tomkorp Computer Solutions","platforms":[{"id":0,"name":"PC"}]},{"id":14255,"name":"Stronghold 3 Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/418/418074f8736d420b99bfd6ba83755331.jpg","description":"Stronghold 3: Gold is the long-awaited third installment in the award winning castle-building series.  Set 10 years after the original, the Wolf it seems, has cheated death and during his painful recovery he’s become even more bitter and twisted. Now he seeks revenge.  Raiding villages and towns during the dead of night, the Wolf has created a tide of panic and you and your allies are the only force that stand against him.  In this stunning new update to the world’s favorite Castle Sim - will you triumph by day or die by night?Key features:Build and manage mighty castles with an improved building system allowing unprecedented levels of realism and intricacy\nRealistic physics and cutting-edge graphics make siege warfare more brutal than ever.\nWatch your village spring to life in an amazing depiction of medieval village life\nStory-driven gameplay engages players across two campaigns: combat or economic\nDramatic night time sieges add a new dimension to the Stronghold franchise\nBesiege other players’ castles or defend your own in a range of action-packed online multiplayer modes\nAttack or defend accurately re-created castles from the pages of history. Will you succeed where others failed?","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"FireFly Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2473,"name":"Corridor Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/148/14873b41806ec9eeb73af76bbb94375a.jpg","description":"Ordinary high school, zombie outbreak and the bunch of survivors in a run for life.\nThis time you don't 'face' the obstacles, but the actual pursuit. Don't let the zombies catch you up, throw them the obstacles and aim for the head before they take the first bite. In the meantime find the lost recordings of the audio log and reveal where did the infection come from in your small town.\nFEATURES\n* Experience the most genre refreshing runner in years\n* Get thrilled with the unique and intense gameplay\n* Help the pom-pom girl, the jock and the jarhead to survive\n* Discover the infection's mystery with voice-overed story\n* Stock the awesome upgradeable arsenal: pistols, SMGs, shotguns and more\n* Immerse yourself in multiple objectives designed for each of the characters\n* ...and shoot down tons of running horror!\nBe quick or be undead!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mass Creation","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":46034,"name":"Don't Escape: 4 Days in a Wasteland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dcc/dcccef2e17f3b2f1eec0a19cb9b98a94.jpg","description":"Following a bizarre cataclysmic event that cracked the moon in half, the Earth is struggling with the environmental fallout. Everything is already dead or dying... except you. Or so you think. Don't Escape: 4 Days in a Wasteland is a post-apocalyptic indie adventure from the creator of the wildly popular Flash series. Different obstacles have a chance to be shown in every chapter, allowing for extra replay value, and your choices and actions determine whether you survive to see the next stage of the game.\nAfter scraping out a bleak existence in the wastelands, you thought you were prepared for anything. But one night a terrifying nightmare makes you bolt up from sleep. And when you realise it might not be just a bad dream, you also realise there’s no way to run. The choices you make determine how everything plays out. In each chapter, you’ll need to choose what to do to manage your time most effectively before sundown. Repair a bridge? Look for supplies? Travel to a distant location? Each will cost you some time, and when that runs out, it’s time to face the music and see if you planned appropriately, or if there’s going to be another body in the wasteland.\nTime mechanics; some actions will advance the clock!\nOld school point-and-click gameplay with logical puzzles.\nChoices and decisions that actively impact the outcome.\nVariable problems for each chapter to enhance replay.\nAn engaging story with a creepy, desolate atmosphere.\nClassic pixel-art presentation of a post-apocalyptic tale.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"scriptwelder","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":40129,"name":"Breach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/781/78147bbd2444a3c6e2525c72edd7118f.jpg","description":"Seventy thousand years ago, humanity was on the verge of extinction until a group of Immortals created the Veil, splitting Earth into two realities: one that has the Earth we know, and an alternate Earth where all that we have come to know as mythology thrives.  Now the Veil has been shattered and the two worlds are collapsing into each other with catastrophic consequences.  You and your friends are among the rare few who can wield magic and defend humanity against this cataclysm.\nBreach is a fast-paced third person co-op action RPG.  Create your own character, customize your appearance, and choose from dozens of classes with gameplay inspired by multiple genres.  Launch your enemies in the air and juggle them with rapid attacks.  Play as a classic support healer.  Sit on the edge of the action and snipe your enemies from a distance.  Endlessly customize your character and class to find your own unique playstyle.\nTake your unique character onto Missions across the globe in Solo or Co-op modes with any number of players up to 4.  Fight your way through mythological monsters toward a final area where you will face a giant boss monster.  Along the way you will be challenged by an all new kind of enemy, the Veil Demon.  This smoke-like spirit can possess and empower any monster you encounter and create breaches, pulling in environmental hazards from the parallel, Mythological Earth.\nIn addition to playing as a Hero, you can also play as the Veil Demon in Solo or Versus modes!  Breach also has a Custom mode where you can play with any number of friends (up to 5), playing as either a Hero or Veil Demon.","review":"","timePlayed":0.0,"releaseYear":1986,"developer":"Atomic Games","platforms":[{"id":0,"name":"PC"}]},{"id":23409,"name":"Cyberhunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1aa/1aabe397bcafac89f80fb9585d703377.jpg","description":"Cyberhunt is an infinite twin-stick shooter game set on a cyberpunk world. Destroy asteroids, cops and more on this new take on a classic genre.\nPerfect to play when you want a chill experience, or are in a queue for another game this is a small and replayable game, with lots of missions, achievements and steam leaderboards.\nPlay trough 500 missions, destroy hundreads of enemies and asteroids counting with a number of different weapons and power ups.\nGameplay inspired by oldschool arcade games like Asteroids, Galaxian, Space invaders.\nSurvive as long as possible, destroying various enemies and complete missions counting with multiple different weapons and power ups.\nEnemies are randomly spawned but with incremental dificulty.\nUnlock new missions by completing the previous ones. The mission list can be seen on the pause menu.\nGet bigger scores by destroying enemies before the combobar ends, the multiplier increases for every 10 destroys.\nImproved classic mechanics, and cyberpunk-ish pixel art graphics.\nPlays greath both with Keyboard or Joystick.\n500 missions each one with a achievement (only 9 missions unlocked at the same time avoiding massive achievement spam).\n8 types of enemies, 5 types of weapons, and 4 power ups creates a good variation on the gameplay.\n6 awesome original tracks.\nSteam Leaderboards, Achievements, trading cards and cloud support.\nNukGames is a solo indie developer from Brazil working hard to bring fun small arcade games to Steam.\nThanks for taking time to read this, I hope you'll enjoy Cyberhunt\nPaulo - NukGames","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":15126,"name":"Ace Of Words","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/564/564d8e89380e1209c795be704d8c1574.jpg","description":"Become a spelling ace or just beat the highest score in this arcade spelling contest. The game will challenge you with maximum of 100 words from its dictionary and your goal is to figure them all within 120 seconds. Once you beat the round you will earn the time bonus and get a new challenge. How far can you go?\nYou can compete with other players via Steam Leaderboards system.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ocean Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5682,"name":"The Godfather II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0c/b0c8c0f53be36b49140e66371daba4a7.jpg","description":"The Godfather II game goes beyond the film's story by setting players in the world of organized crime in 1960’s Florida, Cuba and New York.\n\nAfter being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help players manage their empire, The Godfather II introduces \"The Don's View\" -- an innovative strategy meta-game that allows players to oversee the entire world as they grow the family business. Using the Don's View, players will be able to build, defend and expand their crime rings, while keeping an eye on the movements and plans of the rival families. Players will also learn to master the business of organized crime by building a family of Made Men, hiring crew, handing out orders, and promoting their best men up the ranks.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":20,"name":"WET","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b55/b55dc9ad1401dae88843e102936df120.jpg","description":"A highly-stylized third person shooter than seamlessly blends gun play, swords skills and over-the-top acrobatics to create the ultimate interactive action experience. The game allows you to shoot anywhere. Anytime. You have the freedom to shoot while running, sliding down ladders, sliding across the floor, or performing any number of acrobatic moves. Featuring an ironic mix of humor, violence, and unique retro visual treatment.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":580974,"name":"Entropy: Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10e/10ef069ec875ebab7e859560ff55f5e8.jpg","description":"Be the bad guy in this modification for Half-Life 2 : Episode 2 and step into the boots of a stranded Metrocop, left for dead in the abandoned City 10.\n\nExperience a time before the fall of City 17 - 11 months before the deployment of Gordon Freeman. Bring the brutality and chaos of the Combine regime to the hidden rebel sanctuary of City 10. Endure the bitter cold as you fight your way through rebel shanties, infested tunnels and subway systems. Survive the Combine plague, and reclaim the Combine stronghold known as ‘Pillar 10’.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":440082,"name":"Second Extinction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/17b/17bcf0d95af7f341adbfa5eaab2841a5.jpg","description":"Second Extinction is an intense 3 player co-op shooter, where your goal is to wipeout the mutated dinosaurs that have taken over the planet. Teamwork is vital as you adopt the role of one of the survivors, using a combination of weapons, abilities and skills to take on the vast number of enemies.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Systemic Reaction","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":216357,"name":"Othercide","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fa/2fae0a98d0ced8f15ccdd6c02f253fd8.jpg","description":"Lead an army of gifted female warriors against nightmarish creatures, as they sacrifice everything to push the darkness back. Experience the ultimate tactical challenge in a shattered world behind the mirror of our reality.\nKey Features\nBreaking the turn-based standard: Introducing the Initiative Sequence(™) system, players will experience a new way to predict enemies' moves and put the perfect plan in place in response. Using interrupts or delayed actions and reactions, players will have to wisely manipulate the sequence order, deciding when to change from defensive play to offensive to overcome their adversaries.\nPunitive gameplay: With no cover, no healing and permadeath, players always have tough choices to make and each decision comes with a sacrifice, of resources, or in blood!\nStriking art style: Using only black, white and some touches of vivid red, Othercide invites players to dive into an ethereal horror dimension between conscious and unconscious.\nReplayability: Survive, protect your ground and defend reality, your task won't be easy, as players' will face ruthless creatures that constantly try to push through breaches into our reality.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Lightbulb Crew","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]}]