[{"id":28307,"name":"Virtua Fighter 5","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b60/b602391ecffdebcbbfe5802da025b2ae.jpg","description":"The Games on Demand version supports English, French, Italian, German, and Spanish  Experience the ultimate 3D fighting game, renowned for its cutting-edge graphics and unparalleled character balance! Customize your characters with hundreds of items and join the fray online!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":27828,"name":"Pikmin","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d1/8d1c16a20bf0cd1e8d5e625b0b55ec09.jpg","description":"Captain Olimar has crash-landed on a strange world, and his only hope\nfor survival lies with odd creatures called Pikmin. Set out and explore\nthe strange, lush planet before Olimar's life support runs out! Command\nup to 100 Pikmin, swarm predators, and haul critical parts back to your\nship—all by using the Wii Remote™.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"GameCube"}]},{"id":21638,"name":"Beast Boxing Turbo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c5/0c5425b9edf4762b35face403c32d96f.jpg","description":"An artfully designed first-person boxing game with freestyle arcade action in which you punch a turkey in the face.\nBeast Boxing Turbo is a challenging first-person boxing game with fast-paced freestyle boxing action. You play a secret human boxer in a beastly world. She's outmuscled, undersized, and in way over her head. Can she master the skills needed to get to the top of the legendary boxing leagues of Beasthalla?\n\nDevelop a fighting rhythm between attack and defense, and don't give up hope if you can't beat these monsters on your first try. There's a host of skills to train, and new gear to acquire that can give you an edge in the ring. Build up your boxing skills to match your personal style, and beat the grand champion of the Ultra League to unlock NewGame Plus mode and reach a new level of challenge.\nPRESS AND REVIEWS:\n\"True PC Gaming, Best of 2012\" - Adam Ames,  True PC Gaming\n\"the game plays like a modern-day Super Punch Out\" - Aaron Righter, Indie-Love\n\"Beast Boxing Turbo believes in the old-school joys of quick reflexes and combo mastery.\" - Becky Chambers, The Mary Sue\n\"a lovely hand-drawn art style\" - Jim Rossignol, Rock Paper Shotgun\nKEY FEATURES:\nFast-paced arcade gameplay and controls: Controls optimized for gamepad and keyboard that will let you deliver combos with quick straight punches, high-powered hooks and uppercuts.\nPowerful Opponents: From Steve the Fitness Skeleton to Kamander the Snake Cyclops Sensei, these monsters are going to eat you for breakfast... until you can interrupt their devastating attacks to take their league titles!\nIn-Depth Training: There's a lot to learn in Beast Boxing - a lead-hand jab is way more likely to hit than an right uppercut... unless your opponent's guard meter is low in the middle of a sweet combo. Never fear, though, there are plenty of training sessions that Coach Piglas will put you through!\nCustomizable Gear System: What would a fantasy game be without armor? As you build up your fight winnings, spend it on useful character gear. Equip the right stuff for an opponent, and you can come out ahead in a tough matchup.\nAwesome Monsters: With 12 fantasy opponents designed by Khang Le of Adhesive Games, art director of Hawken, you'll be up against some of the weirdest creatures to ever grace your computer screen... and then they'll give you the first-person boxing fight of your life!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21540,"name":"Adventures of Robinson Crusoe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34c/34cc28cdd3cdd9efdf71c90fc0f97d8b.jpg","description":"Inspired by Daniel Defoe’s classic masterpiece, Robinson Crusoe is a story of a man who survives a terrible shipwreck and finds himself cast away on an island in the Caribbean. In this incredible hidden object adventure that spans over 28 years, help Robinson explore the island, fight with cannibals, visit a lost village and construct a boat to sail back home!\n- Two game play modes – Relaxed and Survivor\n- 31 unique levels\n- 36 unique locations to explore, from a wrecked ship to desolated well.\n- Fun adventure spirit!\n- Based on the classic novel by Daniel Defoe","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MagicIndie","platforms":[{"id":0,"name":"PC"}]},{"id":21211,"name":"Trash TV","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/288/288b801628560fa9f6a06888a0affe38.jpg","description":"Welcome to the world of Trash TV. Cast away into a recycling center, you play an outdated tube television animated to life with a singular goal – find your remote control and become fully functional again. Navigate through the perilous pathways of the recycling factory, avoid machines set out to flatten and pulverize you into scrap parts, and pick up various weapons of wicked destruction to solve puzzles through explosive solutions and to use against haywire machines.\nA finalist of Intel’s Level Up 2011 game development contest, Trash TV’s addicting action and clever puzzle design is coupled with a haunting background brilliantly set by the chilling ambient tunes. Thematic visuals with a “fuzzy” screen style and static transitions completes the retro video charm. Each of the six different locations will have different puzzles to decipher and obstacles to maneuver through, with the solutions usually involving one of eight lethal weapons.  From double uzis that blast through crates, C4 explosives to trigger floor panels, to the rocket launcher that can blast your TV character across the screen through “rocket jumping” techniques, the tricky puzzles in Trash TV will often require a careful yet explosive solution.\nKey Features\nWeapon Solutions: Take control of eight powerful weapons ranging from pistols, paired Uzi machineguns, shotguns, and rocket launchers to solve clever puzzles. Oh, and of course – blow $#!% up.\nSix Locations to Explore: Traverse six different areas, each with their own devious traps, obstacles and enemies.\nExplosive Puzzle Solving: Use your arsenal of weaponry in a myriad of ways to get through tough obstacles, devious traps, and malfunctioning machines.\nThematic Visuals: Stylized visuals to match the tube television main character, bars n' tone screens, and static noise transitions.\nAmbient Soundtrack: A chilling ambient soundscape adds to the \"machine graveyard\" background of the recycling factory levels.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lawrence Russell","platforms":[{"id":0,"name":"PC"}]},{"id":20735,"name":"The Gate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb0/fb034cc058bafc433e93fc4fef7ed5ee.jpg","description":"A meteor crashes to earth revealing a map to the stars. Project Icarus is formed to send a team of astronauts back to the source of the message. Join the crew of the Icarus as they land on a mysterious desert planet. What are the strange plants that grow in the caves? Who built the massive long abandoned pyramid? The Gate is an interactive science fiction graphic novel. At various points in the story, you will be asked to make a choice, these choices will take you down different paths in the story. Your objective as you guide the story is to return back to earth. The game features 3 possible story endings.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spicy Horse","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":20015,"name":"Z Steel Soldiers","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f1/2f19f19f70744edf0c137dde0962a9ed.jpg","description":"“Lead your Z: Steel Soldiers into the next century rebooted for the rocket fuelled fans of the classic hard-core strategy game.\nIn the bloody aftermath of ‘Z’ comes Z: Steel Soldiers. All your favourite strategies and gameplay from the classic version, with graphics that have powered into the 21st century, vivid 3D landscapes, and a state of the art engine that brings your game to life.  Meet the new breed of robots, with a taste for war and a warped sense of humour.  Z: Steel Soldiers – you’ve never had it so good!”\nWhen you take control of your Steel Soldiers unit, you’d better hit the ground running, as you take some superb war machinery straight into the heat of battle. You can start to build up your forces when this firefight is over. Right now you’d better just dig in!\nEvery theatre of the war is intertwined with the non-linear plot, revealing more twists and turns than a roller coaster, this is no ordinary battle, and these are no ordinary troops. They are fearless troops who drink rocket fuel and pick fights with saber-tooth snow slugs just for fun. You’ve never met robots quite this screwed-up before...\nFeatures\n* 30 Distinct, lush levels spread across 6 unique worlds.\n* Air, ground and sea units ranging from WW2 based vehicles through to modern jet fighters.\n* Significantly enhanced 3D Graphics packed full of scalable features such as reflections and particle systems providing intense and rich landscapes.\n* Real-time environment forces, both local and world forces affect the environment to such detail that even plumes of smoke are split as helicopters come soaring through.\n* 9 different robots each with unique abilities.\n* Revolutionary fast-resource style gameplay; The more territories you take, the larger the resource ‘flag’ in that territory and the faster and more you can build; leaving you to deal with the real objective – all-out warfare!\n* Our most advanced AI yet, that will stop at nothing to rid the universe of Zod and his band of space renegades...\nGET READY TO KISS YOUR SHINY METAL BUTT GOODBYE","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kavcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":19123,"name":"Eradicator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/457/457c182d72009fac094b78ebafb30848.jpg","description":"Explode into action!\nDisable an automated fortress that has been mysteriously reactivated. It's up to you to eradicate the hordes of destructive, cunning enemies.\nA massive citadel sprawls upon an alien planet, the wealth of the galaxy field hostage beneath it's guns. You alone must enter the fortress and eliminate the hordes of destructive enemies and safeguard the future of mankind.\nTake on the role of three different characters armed to the teeth with over 20 weapons and blast your way through the 25 puzzle filled levels. Also includes 8 player network feature.\nChoose 1st- or 3rd-person player perspective allows you to view enemies that sneak up from behind and lets you better control your character's movement.\n3 distinct characters let you triple the hours of gameplay and make net-play more challenging.\nTWIC£ as many weapons as other games, including deadly ones like the agile spider bomb.\nEnhance gameplay with unique picture-in-picture views that let you switch your views, control your weapons and enemies, and see two areas at once.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Accolade","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18935,"name":"Gal-X-E","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f58/f583474d54038efed3a5306ac74eafaa.jpg","description":"//[{Brief Overview}]\\\\\nGal-X-E aims to revive the old-school shoot em up genre, and adds modern elements to it! Fight your way through endless waves of randomly generated madness! Collect spaceships and show the enemy who's boss!\n//[{GamePlay}]\\\\\nGal-X-E offers unique and interesting gameplay. Unlike traditional modern games where players can upgrade themselves until their power level reaches \"Over 9000!\", Gal-X-E relies on the actual skill of the player. Even though Gal-X-E offers new spaceships to be built, they only provide minimal improvement. All classes are completely unique in the way that they play, so try to find the one that suits you the most! Players are thrown into an arena where they fight of hordes of never-ending enemies. Kill enemies and collect score multipliers to gain incredible amounts of points!\n//[{Spaceships}]\\\\\nGal-X-E presents the player with 24 different spaceships, divided into 6 unique classes as follows:\nLight: High agility, as well as a rapid fire-rate with low accuracy.\nMedium: Normal firing rate, higher damage, and slower speeds.\nHeavy: Low fire rate, high damage, and good accuracy. It's almost a portable cannon.\nShotgun: Capable of dealing devastating damage, though you'll have to get uncomfortably close to maximize the effect.\nSniper: These bad boys are 100% accurate, and deal one shot one kill hits. You'll have no excuse for missing this time!\nChaingun: The most inaccurate, yet highest damage class! It's basically spray and pray for noobs.\n//[{Enemies}]\\\\\nEvery enemy in Gal-X-E provides an unique challenge to overcome, but we won't go about spoiling your fun by telling you what to expect.\n//{[Languages]}\\\\\nCurrently only English is supported, but the interface is self explanatory so that anyone from any language can enjoy it!\n//{[Features]}\\\\\nThe main game consists of randomly generated waves of enemies, meaning that not one play through will be the same! The longer you survive, the more intense the waves become!\nThe Hangar is where you can open loot boxes in the hopes of finding a brand new, shiny spaceship!\nThe Badges screen is where you can view your current badges and your progress on those you still need to earn. Badges are basically achievements but with CRAZY challenges!\nThe Stats screen allow you to be disappointed in your life when you see how much of your life you've wasted on this game.\n//{[Conclusion]}\\\\\nIf you're into old-school arcade fun, as well as games that rely mainly on the improving of the player's skill, Gal-X-E is for you!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NodziGames","platforms":[{"id":0,"name":"PC"}]},{"id":17148,"name":"Imperia Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa7/fa78d54ebd6e24cb66e4e0d630a81777.jpg","description":"Take on the role of a medieval ruler, destined to turn his small village into a mighty Empire. Enter a world that never sleeps. A world where you will face thousands of players. Some of them bound to be your enemies. Others will become your friends and trusted allies. Imperia Online is known for its deep gameplay, a near perfect blend of strategy and simulation. Build your capital, claim new territories by establishing provinces, trading posts and military encampments. Train your army to spy on the enemy and defend your Empire from all who dare to reach for its riches. Each decision you make as a ruler has an impact on your Empire and echoes throughout the entire Realm.\nWith its MMO and pvp focus you can expect to become a part of an alliance and wage war against enemy players in competition for the title \"Lord of the Realm\"! Special weekly events, realms and tournaments are all present to ensure you will never have a dull moment .","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Imperia Online","platforms":[{"id":0,"name":"PC"}]},{"id":15848,"name":"Cities XXL","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/687/68712229cd3a06f9af9996e65e3832a7.jpg","description":"Steam WorkshopWith Steam Workshop support, you’re free to create and share a plethora of new content for Cities XXL, from buildings and landscapes, to roads, highways, scenery, and many more.\nAbout the GameThe supersized city-builder\nDesign, build, and manage the world’s largest and most diverse cities in Cities XXL. Bigger and better than ever before with a more powerful game engine and new interface, become the mayor of your very own sprawling metropolis. With town-planning including home locations, retail plots, offices, industry and infrastructure across 47 architectural styles and 1000+ buildings, manage the happiness of your city’s denizens, with leisure activities, landmarks, and ecology and pollution management. With new structures, but also all-new ecological buildings and upgrades, such as the park-and-ride, electric car dealership, and bike hire, Cities XXL offers a greener approach!\nManage the economy by sharing resources between all of your cities across over 65 maps (including new landscapes and environments) throughout the ‘Cities Planet’: trade anything from waste management to oil, fuel, and water – even holidaymakers and workers. Finally, create, share and download user crafted content via the Steam Workshop – an endless supply of user-curated content. From scenic villages to economic powerhouses, build, manage, and grow the city of your dreams in Cities XXL.\n1000+ unique-looking buildings to bring your city to life\n47 Architectural styles from many different cultures around the world\nNEW: Over 65 varied landscapes including 5 new environments to develop on, from snowy alps to green meadows and seaside resorts\nNEW: A powerful and improved game engine for an experience that stretches your city to the limits\nFine management of road traffic and public transportation networks (buses, railways)\nNEW: New ‘green’ options such as industrial building upgrades, and all-new ecological structures like the park & ride bus company and bicycle rental services\nNEW: Localized pollution levels to target and manage, including noise and smoke\nNEW: New skies and moods to set the perfect backdrop to your cityscape\nNEW: Create, share and download more easily an endless new supply of user-created content, thanks to the integration of Steam Workshop","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":14120,"name":"MSI Electric City","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa570a5eb2ffcfe66044c6b7efb99026.jpg","description":"MSI Electric City is a virtual reality sci-fi seated experience where you are transported to a futuristic city never seen before. Discover magnificent scenery and soar through wondrous architectures. Featuring an original soundtrack and with captivating visual & sound effects powered by Unreal Engine 4.\nMore info, please visit its landing page: http://vr.msi.com/event/2016/electric_city/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Metanaut","platforms":[{"id":0,"name":"PC"}]},{"id":11086,"name":"Dinosaur Forest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/010/0100dfedcf74a095c0c2829d56968bf8.jpg","description":"WHAT IS DINOSAUR FOREST\nDinosaur Forest is a fast paced chaotic first person wave-based shooter that pits players equipped with some basic weapons against species currently inhabiting the Unknown Planet.\nTHE SETTING\nThe world of dinosaurs is violent and grim.THE PLOT\nThe game follows prince Kronoss on his journey to reconnect with reality.\nFEATURES\n340 Achievements\nGood Luck!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Racing Bros","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":7728,"name":"The Westport Independent","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a81/a819055aa21c7680b7eb9baf5e62ae39.jpeg","description":"A game about Censorship, Corruption and Newspapers\nThe Westport Independent is a censorship simulator taking place in a post-war country, governed by the recently elected Loyalist Party. As the editor of one of the last independent newspapers in the country, your job is to remove and edit the content of your paper, affecting the people’s opinion of both the rebels and the Loyalist government. With an increase of rebel activity and an ever watching government breathing down your neck, whose truth will you print?FeaturesChange the content and meaning of your articles by censoring them to your liking. While you can’t lie, you don’t have to tell the whole truth either.\nEmployees with fleshed out character, who will not only react to your actions, but also discuss them with other colleagues.\nReceive letters and messages from public figures, rebel leaders, employees and other characters affected by your actions.\nAdaptive stories where your actions affect the opinions of the people, which affects what happens in the city, which in turn affects the stories you receive.Awards and recognition- Biggest surprise at The MIX GDC 2015, IGN\n- Part of \"Three Cool Surprises From PAX 2015\", from Kotaku\n- Part of \"The Very Best Indie Games of GDC 2015\", from Gameinformer\n- The Best of GDC 2015, 148 apps","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Coffee Stain Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":3703,"name":"Shin Megami Tensei III: Nocturne","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f84/f84344325c668c21460bddc45b9a1566.jpg","description":"As the world comes to an end through the acts of a cult's sacrifice, a teenage boy is transformed into the Demi-Fiend, neither fully human nor demon. With opposing forces fighting to shape a new world, he has the power to guide the path of its creation.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":3685,"name":"Monster Monpiece","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/386/3864ea6c364b1536a1d17b3fb42b32c1.jpg","description":"Train as May Esperio in a world where humans and \"monster girls\" live an uneasy coexistence, and become a monster girl master in strategic, card-based battle with light RPG elements! Throw down with the enemy using your cards’ Skills and Potentials, and give their stats an extra boost with special bonuses. If you play your cards right you’ll collect over 100 monster girls and get to level those ladies up with the First Crush ❤ Rub mode, which gives you a hands-on role in warming them up for battle!\nKey Features\n• Play fast-paced card battles in 1080p where more than 100 monster girl cards can be summoned, each class coming to life as a 3D chibi model on a battle grid!\n• Each card you play can mean victory or defeat – with Skills, Potentials, Fusions, and Aura Bonuses, you have layers of strategy to use in each battle.\n• Level up your cards with the frenetic First ❤ Crush Rub system, rubbing your magical prowess into the monster girls to increase their strength and obtain new artwork for each!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Idea Factory","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":715706,"name":"Multiply or Release 3D","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78c/78cda9566a67924bd658e61256d7a037.jpg","description":"I was watching the multiply or release videos and ran out of ones to watch, I don't intend to update this further but if for some unimaginable reason this becomes popular ill attempt to make it better.\nCurrently only ever tested on my computer and the resolution is based upon mine so it might not fit yours if you don't use 1920 * 1080, idk","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Huhwei","platforms":[{"id":0,"name":"PC"}]},{"id":412478,"name":"State of Decay 2: Juggernaut Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/848/848729603d56b11ef02ff2fcf2f242e5.jpg","description":"The dead rose, and civilization fell. Now your small group of survivors must scavenge an open world for resources and build a home base that can withstand hordes of zombies in this action-strategy-simulation hybrid. Supports up to four networked players.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Undead Labs","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":403796,"name":"Anno 1404: Venice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/afc/afc45aba52b34b8e39d13cbb5bd2d7b1.jpg","description":"Experience the award-winning combination of city building, commerce, discovery, diplomacy and combat. Create your own nation with a unique blend of simulation and real-time strategy. Journey across the globe to explore, trade and learn technologies to expand your empire and to make your own history. With its extensive and immersive campaign, Anno 1404 guarantees never-ending gaming fun for novices and experts alike. Click here to find all the Anno games\n\nAnno 1404:™ Venice is the add-on for Anno 1404, the acclaimed real-time strategy and simulation game released earlier this year. Anno 1404: Venice will combine the signature gameplay mechanics of Anno 1404 and the richness of the Venetian culture. In addition, gamers will now be able to play Anno 1404 with their friends thanks to the new online multiplayer mode.\nNew Venetian Setting: The rich Anno 1404 environment is complemented with a new Venetian setting offering new possibilities of interaction. Build two new Venetian ship types: the small and big tradesman cog. Develop secret cabinets, infiltrate your enemies and sabotage their expansion. Take control over enemy cities thanks to your influence in the cities council board.\nMultiplayer: Multiplayer-Mode for up to 4 players or Coop-Mode for up to 8 players.\nNew Challenges and Quests: Up to 60 new items and 300 new quests with two new mission types: trading race and ship boarding. Discover and exploit a new type of island, the Volcano island. New scenarios to face new challenges with new achievements, medals and quests.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"}]},{"id":378582,"name":"Disgaea 4 Complete+","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/914/91474c861aaddf64d8f77433faa55555.jpg","description":"A Bloodless Coup: Lead the incomparable Valvatorez, a vampire bound by promises, and the ramshackle cast of werewolves, angels, failed Final Bosses and more in a story of love, loss and...Presidential politics!?\nDisgaea now, Disgaea FOREVER: - Level to 9,999? Make it happen. Custom maps? Build your own! Barge into other players games on a flying pirate ship*? WHY NOT!?\n*Some network features will not be available upon launch, but will be implemented later as an update.\nAnd That's Not All (!?): Everything to ever grace Disgaea 4 is here! With over 30 unlockable characters, extra story campaigns, and modern flourishes to the Disgaea formula, Disgaea 4 Complete+ offers as deep and smooth of an SRPG experience as there has ever been.\nStoryWhen the Corrupternment threatens to disrupt the way of life in Hades, Valvatorez finds himself at the helm of a fiery revolution. The former tyrant will need to call upon new allies, recruit a formidable army, and learn a thing or two about political unrest if he hopes to take down the corrupt regime and bring salvation to all Prinny-kind!\nDive into a tale of revolution and redemption, woven throughout a dark and hilarious realm of vampires, werewolves, and other devilish denizens. Engage in immersive and in-depth tactics-based gameplay brimming with over-the-top destructive action, and unload a horde of special features to take your Netherworldly adventures to another level. Brace your belt pouches and grab your sardines; the ultimate HD Disgaea game has arrived, dood!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nippon Ichi Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":376908,"name":"Disney Classic Games: Aladdin and the Lion King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c3/4c3c901068151d0aeff2a342cd0b80f9.jpg","description":"Two of the most beloved Disney games of all time make their long-awaited return to PC in Disney Classic Games: Aladdin and The Lion King! This unforgettable package of Disney classics is filled with tons of new features, enhancements, game modes, and display options, plus multiple versions of the games! Join Aladdin and his sidekick, Abu, as they race through the marketplace toward their date with destiny. Relive Aladdin’s classic adventure as you travel through Agrabah, the Cave of Wonders and more to defeat Jafar and rescue Jasmine. Jump, fight, dodge and carpet-ride your way through this adventure, collecting gems along the way. The Lion King brings to life the majesty and mystery of Africa through the tale of Simba, a lion cub faced with the challenging transition to maturity. Now, you too can be part of the adventure! Driven into the wilderness by his evil uncle Scar, Simba finds salvation and Hakuna Matata with Pumbaa the warthog and Timon the meerkat. Tackle heinous hyenas in the elephant’s graveyard, avoid the trampling hooves of stampeding wildebeest as you battle through 10 levels to ensure Simba claims his rightful place as The Lion King.\n\nFeatures\n• Multiple Game Versions: Play through several different versions of the beloved Aladdin and The Lion King games that have been created over the years, including both console and handheld versions. An all-new “Final Cut” version of Aladdin, developed exclusively for this collection, is also included and features difficulty adjustments, camera refinements, bug fixes, as well as a few additional surprises for fans.\n• Display Options and Updated Visuals:\n1080P graphics and enhancements for modern HD TVs\nAdjustable screen aspect ratios and borders\nCustom filter options designed to replicate classic CRT TVs and other popular screen types\n• In-Game Rewind: Instantly rewind any of the games in real-time in order to retry difficult areas\n• Interactive Game Viewer: View full game playthroughs, with the ability to skip forward, jump in, and start playing at any point\n• Save Feature: Quickly save your progress in each of the games and continue your adventure wherever and whenever you want\n• Museum Features: Take a journey behind-the-scenes and learn more about the creation of these incredible games. Watch video interviews with the original development teams or explore numerous galleries containing hundreds of previously unreleased HD concept images and marketing assets.\n• Soundtrack: Listen to the entire soundtracks for both games in the included music players. The ability to repeat and shuffle the songs is also supported.\n\nUsers who have previously purchased Disney’s Aladdin or Disney’s The Lion King on Steam will receive credit from that purchase toward Disney Classic Games: Aladdin and The Lion King.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Digital Eclipse","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":290009,"name":"Naruto Shippuden Ultimate Ninja Storm Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/790/79020a2a01040c93f07591052f90ddbf.jpg","description":"NARUTO SHIPPUDEN: ULTIMATE NINJA STORM TRILOGY collects 3 STORM games in one breathtaking collection. This series has established itself among the pinnacle of anime & manga adaptations to video games! This collection includes: HD Remasters of NARUTO: ULTIMATE NINJA STORM, NARUTO SHIPPUDEN: ULTIMATE NINJA STORM 2, and NARUTO SHIPPUDEN: ULTIMATE NINJA STORM 3 FULL BURST.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":269343,"name":"Prime World: Defenders 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66a/66a9c81f9e6bfa8dd160b201c7aad5c7.jpg","description":"Defenders 2, - an exciting hybrid of Tower Defense and CCG, - is now available on Steam!\nNumerous challenging battles with different types of monsters and other players are waiting for you in a carefully crafted 3D fantasy world. Protect your belongings and fight for new lands by unleashing your strategic mastermind potential!\nA war is raging between heroes and Touched - monsters, which resemble goblins, zombies and even aliens in some particular cases. Citizens of your Kingdom believe that only you are able to save them from all the misfortunes occurring close to the Castle. Battle cries are heard from every corner,  and the hostile creeps are continuing to occupy your lands. Don’t let your Castle walls fall - use all towers, spells and tricks you have to protect your people. Rush to the battlefields and put up an epic TD fight!\nWhat is more, other heroes are also eager to challenge your defense building skills. Think of a strategy that will help you win! Build the defense no foe can pass, and become the best at our TD game.\nPlay one of the most entertaining tower defense games and show what you are worth!\nMake use of every unique tower you own to stop the creeps and become the best defender Praya has ever seen!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nival Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":258386,"name":"Red Matter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df3/df38657e34f79723cef58c6863339895.jpg","description":"Red Matter is a story-driven VR puzzle adventure game set during a dystopian Sci-Fi Cold War. Take on the role of Agent Epsilon, an astronaut of the Atlantic Union dispatched to an abandoned Volgravian base on Rhea, one of Saturn’s moons. Your mission: to investigate a shady top secret research project.\nSolve puzzles in a beautiful, high-detail brutalist environment which only becomes more and more surreal as the story progresses. Use an array of hi-tech tools to decipher hidden messages and mechanisms and uncover ever deeper and darker secrets of the facility. But beware of what you may find... Once you discover the truth, will you be able to stomach it?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Vertical Robot","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":238785,"name":"Ministry of Broadcast","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/758/75838a7e8a0c8d803d4b0bd4bfbf0ff1.jpg","description":"Play the game @Tokyo Game Show 2018We've got invited to Japan to showcase the game at TGS 2018. Looking forward to meeting our fans, we have prepared exclusive merchandise for you!\nAbout the Game\nMinistry of Broadcast is a narrative driven 2D cinematic platformer with the story set in in a country which has been divided by THE WALL. The only way how to cross the borders to the other side is to win in a TV reality show organised by the regime.\nGameplay mechanics address the themes like groupthink, obedience to authority, fake news or immigration. They are based on the interactions between the elements and characters in the game and the main character is the driving force behind these interactions.\nSarcasm, inappropriate jokes and absurdity of the system game is set in plays a strong role during the game story development. We are playing with some alternative reality through recognisable elements of todays political and social scene. We are becoming global by building walls in between ourselves. Story makes fun even of the player playing the game by addressing the “rage&quit” behaviour of new generation of gamers.\nIn order to underline “Big Brother” feel, we made a slight distance in between player and the character. Gameplay is hard but fun, challenging and unique.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hitcents.com","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":64551,"name":"Mundaun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84f/84f317d1609bb27d85e595eac20f0199.jpg","description":"After learning of his grandfathers mysterious death in a fire, the protagonist travels to Mundaun for the first time since childhood. He will soon discover that something old and diabolical is haunting the remaining inhabitants. The quest to find out the meaning behind these sinister events takes the player on an odyssey up Mundaun mountain: From steep meadows across stony fields and to the snow-covered peak.\nMundaun is a lovingly hand-pencilled horror tale set in a dark, secluded valley of the alps. Explore various areas full of secrets to discover, survive hostile encounters, drive vehicles, fill your inventory and solve a variety of hand-crafted puzzles.Key Features\nImmerse yourself in a unique setting: An alpine world where reality and myth intertwine\nExperience a unique greyscale aesthetic thanks to hand-pencilled textures\nExplore varied and open levels from green meadows to snowy peaks\nBeware of the creatures roaming the landscape\nSolve Puzzles that are integrated into the game world as you make your way up the mountain\nInteract with its eccentric inhabitants who even have their own obscure spoken language\nControl vehicles such as sleighs and hay loaders\nFind out the dark secret behind grandfathers death","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Hidden Fields","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":20240,"name":"Planet Stronghold","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/769/7693ec3403c04cf79271d77d3cb6def4.jpg","description":"Planet Stronghold is a sci-fi role-playing game with a turn-based combat system.\nYou take the role of a young, new recruit that somehow gets assigned to the most well-known, and well-defended, human outpost in the whole galaxy: Planet Stronghold.\nAs the story goes on, you'll have to choose a side in a a war that will change the destiny of the planet, and of humankind, forever.\nFeaturing old-school turn based tactical battles, a dynamic plot that changes based on your choices, several possible solutions to each situation using various non-combat skills, Planet Stronghold delivers a very high replayability!\nGame Features\n- Play as male or female, six characters to date including homosexual romance\n- Four classes, many quests, dynamic plot for high replayability\n- Old school RPG turn-based gameplay with many stats and items\n- Over 40 unique enemies to fight including some \"boss fights\"\n- Use non-combat skills like Explosives, Science, Sneak\n- Craft over 80 extra weapons and armors\n- Downloadable Soundtrack and Official Strategy GuideOther games by Winter WolvesAlso available from Winter Wolves, Loren The Amazon Princess, a turn based fantasy RPG!Useful linksWinter Wolves Official Site (find all the games made by us, also available for mobile platforms)\nWinter Wolves Facebook page (become a fan to be informed on the latest news)\nWinter Wolves Forums (join it to receive help and info about the games)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Winter Wolves","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19869,"name":"Bombshell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef8/ef8523868578776348297f2e776f3149.jpg","description":"Digital Deluxe Edition\nAbout the Game\nFrom the creators of Rise of the Triad and legendary game maker 3D Realms comes Bombshell, an action shooter game. Bomb disposal technician turned mercenary for hire, Shelly \"Bombshell\" Harrison must strong-arm her way across 4 planets in an Unreal Engine-powered galactic adventure to rescue the president from an apocalyptic alien threat. With out-of-this-world enemies, a never-before-seen arsenal of devastating weaponry and a host of genre-crossing mechanics, Bombshell is set to blow you away.Features\nHistory in the Breaking\nBe part of Bombshell's debut as she fights to save the president and her people from a maniac's mechanical monstrosity.\nBrave New Worlds\nTraverse the dying world of Kyrron as it's consumed by its neighboring sun, discover the secrets of a civilization frozen in time on the distant world of Zeroth and travel to the epitome of technology -- a villain's vision which threatens to consume all that exists.\nRobot-Armed and Dangerous\nShell, shock and shatter your way through vicious, bloodthirsty predators, an augmented alien species, and the remnants of an ancient race re-animated, with more than 10 weaponized arm modifications.\nHeavy Handed\nFierce finishing moves and interactive environments make Bombshell as dynamic as she is deadly.\nIsometric Ingenuity\nBrilliantly brutal isometric shooting layered with some classic role-playing mechanics, including experience points, upgrades, side quests, and non-linear levels. All with a twist of first-person shooter mechanics.\nWhat Are You Lookin' At?\nYeah, she has a robot arm. Deal with it.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Interceptor Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16176,"name":"LocoSoccer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/602/602eaf471455e97b328561b8102a3017.jpg","description":"Welcome to the ultimate physics-based football game!\nUp to 10 players in the same match\nSelect multiple players in the pitch or only select your own\nCustomize your player/s\nPlay with friends or against friends\nPlay on a LAN match like the old days!\nInvite your friends over Steam or join any Steam match available on the world\nMaster the Locoso's Spinning to become better at shooting and goalkeeping","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Startreming","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13067,"name":"Eternal Winter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/901/901db8881105a605079b154bc9d58102.jpg","description":"The main objective in Eternal Winter is to lead an expedition and collect data about this inhospitable island and its ecosystem.\n​you will need to face all kind of challenges imposed by Mother Nature, including storms and hungry predators. You are in charge, place data collection systems such as camera traps and weather monitors, set up your main base, take care of your dogs and ensure the success of the expedition\nsome features:\n-Base building customization and management :use the expedition members to build and gather resources.\n-Dog sled: 4 loyals dogs that will provide swift transportation, you just have to take care of their basic needs.\n-Kayak!\n-Storms: Storms that get more demanding as days go by, they will test your strategic skills as the leader of your village.\n-Working 2 player online co-op","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Claudio Norori","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9893,"name":"Life is Hard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7a/e7a5922c56bb4b8b7e87ed95f0c05f13.jpg","description":"Help us to translate the game!\nAbout the Game\"Life is hard\" is a strategy/village management game. Your aim here is to control a tribe. Defend your village, harvest resources, expand your town, colonize the islands, upgrade your tools and weapons and contact with other civilizations. There is no specific aim in our game. You can do whatever you want.\nExpand your village: build farms and houses, upgrade tools in blacksmith, trade with your neighbors. It’s your destiny to create the most powerful town in this amazing world!\nConquer the world by fire & sword or with power of diplomacy. What would you choose – to help your neighbors to deal with the Vikings for iron ore or to rob them to get more? To pay the Normans tribute or to refuse, condemning your nation to war? To trade with the caravan or to loot it? Make your choice, but remember: every medal has its reverse...\nProve that your civilization is the most cultured by building the Wonder of the World! You have to put many resources in that project. But it’s worth it, isn’t it?\nWhatever you choose, your path won’t be easy. Your plans can be ruined by one of many random events. But it’s no need to get upset! In the moments of crisis there come those, who are the only support of justice. Those, who are ready to lead people into the thick of battle. Heroes – braves, who are lead by you and ready to support people in need. They are ready to die for their ideas. Every one of them has unique talents that can help you in different situations.\nThe belief of your people is strong not only in heroes, but in the God. Choose your patron, but be careful: that choice will affect the whole game. Pray your god and he’ll give you talent of a trader. Or, maybe, the forest itself will raise against your enemies? Will he reveal the secrets of construction and craft to you? It’s your choice. Choose wise, because life of the whole nation is on you!\nRemember that life is hard. Whatever you choose, remember, you path will be thorny.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pirozhok Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5791,"name":"Rocket Riot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a15/a157fa29f73d796181dd45512aa59953.jpg","description":"Second sectionA Title----\nSome text here\nAbout the GameGet ready for Rocket Riot™, an action-packed, side-scrolling, 8-bit shooter where the rockets and the fun never stops! With over 200 levels and over 300 characters, blowing things up has just reached a new level of awesome!\nRocket Riot packs hundreds of zany characters, aggressive mini-bosses, tons of tough bosses and crazy visual effects into one rocket package! In this awesomely 8-bit styled game, blast your way through the environment or hide behind it, battling the strangest enemies you will ever encounter.\nUncover wacky power-ups, navigate through completely destructible environments, or burrow into different areas of the map for surprise attacks. Destroyed objects regenerate, keeping the action fast-paced. But time doesn’t heal all wounds!features:Engage in over 200 single player missions, set in distinctly stylized worlds!\nUnlock over 300 characters! Zombies vs. robots! Rocket-propelled bananas! Pirates vs. meese…uh…multiple moose!\nTest your strength and accuracy against tons of bosses… and mini bosses too.\nClassic Rocket Riot™ levels with awesome new stories, characters and visual effects.\n20 crazy power-ups: some helpful, some funny… all explosive.\nColorful 8-bit style visuals with a splash of modern artistic flair, now in stereoscopic 3D.\nMaps constantly change by regenerating after they’re destroyed. But time doesn’t heal all wounds!\nUse mouse/keyboard controls, or Controller.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Codeglue","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":879558,"name":"Venba","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f7/1f7b6fd6bc2c69b9f3737222bbf0522b.jpg","description":"Venba is a narrative cooking game where you play as an Indian mom who immigrates to Canada with her family in the 1980s. Players will cook various dishes and restore lost recipes, hold branching conversations and explore in this story about family, love, loss and more.\n\nCook Mouth Watering Dishes\nVenba's recipe book gets damaged when she moves to Canada. Restore the lost recipes to cook delicious, mouth-watering dishes that serve as a connection to the home left behind.\n\nExplore, Converse, Experience\nGet to know the family well, hold branching conversations, and explore as you face the challenges that arise from day to day life.\n\nFeatures:\n- Cook authentic and delicious recipes handpicked from regional South-Indian cuisine\n- Hold branching conversations and explore different narrative beats\n- Beautiful visuals and animations\nUnique soundtrack inspired by Indian musicals","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Visai Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":563269,"name":"Kitaria Fables","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/884/884df114cf75effe52f869acef359239.jpg","description":"Kitaria Fables is a delightfully cute action adventure RPG with farming and crafting! Enter the cute world of Kitaria and take on the quests of your animal neighbours as they face a rising tide of darkness. Real time combat, exploration and dungeoneering sit alongside farming for provisions and the crafting of weapons and armour, and forging new spells to increase your power.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Twin Hearts","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":428874,"name":"Diplomacy is Not an Option","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/202/20257dfb2e1442a5646a8eb5f38df283.jpg","description":"In the RTS-game “Diplomacy is Not an Option”, you will become a medieval feudal lord in a midlife crisis. Due to your position, you must constantly make hundreds of decisions a day related with city- management and economic development. You are tired of this monotonous and, so it seems, meaningless existence. But things are about to change: hordes of bloodlusted enemies, zounds of scary monsters and crowds of rebellious peasants at any second can bring some life to your working schedule.War-time lawsThe country is going through difficult times. King’s greed and wastefulness led to the economic crisis and widespread peasant riots.\nYou are a feudal lord. It happened so that, being fed up of routine and everyday problems, you've lost a taste for life. When an angry mob besieges your castle, you perceive this news with an extraordinary enthusiasm, personally lead the defense and win a glorious victory.\nYour role in the riots suppression is matched at the court. The crown sends you on a responsible mission. Rumors are, there are deposits of gold and other precious materials on a poorly explored continent. The task is to take control under foreign land, obtain its treasures in order to replenish the king's coffer. Though they forgot to warn that the natives won't be glad to see you. In addition, there are monsters on the continent, and local mages are actively practicing necromancy.\nWhat sacrifices will you make for the sake of survival and victory? Or maybe you should stop this suicidal campaign and overthrow the king? Don't you deserve to rule the world?Physical lawsThe laws of physics are thoroughly reproduced in Diplomacy is Not an Option to maximize player immersion in a medieval war action. Tens of thousands of units can fight on the screen at the same time.\nHere are several helpful tips:\nEvery gun has its certain range, and medieval shells fly by an arc trajectory.Arrows do not pierce stone walls. On contrary, arrows bounce off the walls.Archers on the towers have blind spots. Closed gates can become an obstacle not only for the enemy, but also for your retreating units.You may discover other interesting facts about the nature of things that may become useful for combat operations.Social lawsSurviving hostile environments is an important part of the gameplay. Even the most loyal of your citizens tend to die from time to time. From various causes, such as illness, old age, depression, or being seriously hurt on the battlefield. When this happens, it is strongly recommended to bury the dead in order to avoid epidemics and the moral decay of society.Economical lawsEconomic processes in \"Diplomacy is Not an Option\" are visible. You will see how walls are being built stone by stone. Or how a fallen tree is cut into boards, from which the city will then be raised. The feudal lord does not need to take part in the affairs of his subjects. However, such visibility will help you to manage human resources with more efficiency. As a ruler, you will lead people, give them specialization and, so to say, the meaning of life. Every member of the society is important, from a lumberjack or a carpenter to an undertaker or a swordsman. Once set up, with a proper support the economic process will become a key to survival and also will let you to focus on mission objectives.Magical lawsWhat do we say to the gods of death, whether they are on an uncharted continent or in our own reach? “Bury the bodies immediately!” – we answer to these gods. Otherwise every fallen warrior and every lumberjack died from overvoltage has risk to join the enemy forces. Also the dead are a very wayward. If you demolish a cemetery and disturb their sleep, they shall rise and begin to wreak havoc, reducing the population of the living.Life lawsWe sought to create a game without unnatural limitations. From the very first task, you will be given the entire available arsenal, and all the in-game mechanics will be unlocked. It depends on you which strategy to choose for your city to survive and prosper. Knowledge of the all listed laws will help you to complete different missions with various ultimate goals and types of enemies. During your campaign you will face moral dilemmas. You will see human stupidity and shortsightedness, leading to fatal consequences. Just like in real life. The only difference is that conflicts cannot be avoided.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Moonlight Mouse","platforms":[{"id":0,"name":"PC"}]},{"id":288865,"name":"ANOTHER EDEN","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed8/ed85a588f3ea1edb4254e4a195d01157_v8LTBu6.jpg","description":"Embark on a journey beyond time and space.\nTo save our lost future.\nBefore the darkness of time falls upon us all...\nScenario: Masato Kato\nMain Theme: Yasunori Mitsuda\nAcclaimed creators from a number of well-known and popular series have come together to bring an exciting and epic RPG to the smartphone.\nGame Overview\n・An unprecedented amount of content in the smartphone game world.\n・Single Player Large Scale RPG.\n・From master story writer Masato Kato, an epic story crossing the Antiquity, Present, and Future.\n・Includes over 60 songs composed with orchestras and folk music, with the main theme written by Mitsuda Yasunori.\n◆Staff\n＜Scenario＞\nMasato Kato（Chrono Trigger）\n＜Musical composition＞\nYasunori Mitsuda（Chrono Trigger）\nShunsuke Tsuchiya（Luminous Arc 2）\nMariam Abounnasr\n＜Art Director＞\nTakahito Exa（BINCHOTAN）\n＜Producer＞\nRyo Miyase\n◆Cast\nKoki Uchiyama／Ai Kayano／Rina Sato／Shigeru Chiba／Rie Kugimiya\nRie Tanaka／Wataru Hatano／Kosuke Toriumi／Ayane Sakura／Maaya Uchida\nSaori Hayami／Tatsuhisa Suzuki／Hikaru Midorikawa／Miyuki Sawashiro／Ami Koshimizu\nHanae Natsuki／Takahiro Sakurai／Ayaka Imamura／Harumi Sakurai／Hiroki Yasumoto\nYuichi Nakamura／Toshiyuki Toyonaga／Sumire Uesaka／Takehito Koyasu／Yoshimasa Hosoya\nHisako Kanemoto／Natsumi Hioka／Tasuku Hatanaka／Ayako Kawasumi／Mie Sonozaki\nKaoru Sakura／Ayaka Saito／Yoko Honna／Nami Mizuno／Akira Miki\nShiho Kikuchi／Mayumi Kurokawa／Makoto Ishii／Yuki Ishikari／Ryuta Anzai\nJared Zeus／Julie Rogers／Janine Harouni／Tim Watson／Rebecca Kiser／Rebecca Boey\nShai Matheson／Skye Bennett／Kerry Gooderson／Taylor Clarke-Hill／Jessica McDonald\nNick Boulton／Rina Takasaki／Nell Mooney／Samantha Dakin／Rory Fleck Byrne／Laura Aikman\nTuyen Do／Naomi McDonald／Ina-Marie Smith／Jackson Milner／Gunnar Cauthery／Joe Corrigall\nKatie Lyons／Liz Kingsman／Jaimi Barbakoff\n【Minimum Requirements】\niOS Version 8.0 or higher/Minimum 2GB (RAM) memory required.\n*Devices that do not meet these requirements will not be supported.\n*Devices meeting the minimum requirements may experience issues in environments with poor connectivity or outlying device issues.\nThis application uses CRIWARE (TM) provided by © CRI Middleware.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"WFS","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":61257,"name":"The Slater","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/641/641602614dcae7ae8413c2b7f3687f51.jpg","description":"Get ready to kill drug dealers, crime bosses and anyone who stands in your way as you seek revenge for your father’s murder.\r\nThe Slater is a story-driven first-person stealth-action game that puts you in the shoes of a former cop Mark Slater, whose father gets murdered while investigating a new designer drug D-Pain. Now is your chance to eliminate everyone involved with his murder, and everyone who had anything to do with the new designer drug. Be prepared to assassinate your targets one by one.\r\nExplore your environment, gather information, find your own way to get past guards or become one yourself, blend in, play smart and eliminate your targets.\r\nMultiple ways to approach most of your targets. Seek for an opportunity and finish the job using your bare hands or a silenced handgun.\r\n6 unique levels with dark atmosphere, non-linear gameplay and multiple objectives. Complete the objectives in any order you like.\r\nStory-driven: Who is producing the new designer drug and who murdered your father?\r\nStunning cinematic and atmospheric cutscenes.\r\nWear enemy clothes, carry dead bodies, hide bodies, create distractions, poison drinks, pick up key cards, climb ladders, crawl through ventilation shafts and more.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Laina Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":61197,"name":"太吾绘卷","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1f/e1f41c496217d28abeabcb5debc41cd6.jpg","description":"OverviewIn the \"Taiwu\" Universe, besides playing as a \"successor of Taiwu\", you will live your life in many different ways: being kind, evil, or somewhere between. You can visit the sects and gangs around the world and learn the various martial art styles; you can choose to make sworn brothers or blood feud; you can establish a village of your own and run various businesses; or you can settle down with your love and enter parenthood. Eventually, you will face the greatest enemy of the \"Taiwu\" family and determine the fate of the entire world.The Unknown World (Jianghu)Each \"Taiwu\" world you create will be unique with the randomly generated maps, NPCs, and enemies. Every time you start the game, it will be a brand new adventure.You can learn thousands of martial art techniques from 15 different sects and gangs; you can also learn hundreds of traditional Chinese skills from the countless NPCs.The Combination of Diverse Game MechanicsBesides classic RPG, *The Scroll of Taiwu* has combined the elements of many different genres, such as the randomness from Roguelike games;\nYou can also find elements of business simulation games: constructing, resource gathering, expanding, managing, crafting, maintaining, etc.\nCatch the most combative \"Grand General\" and have a battle of insects with the abbot of the Shaolin Temple!\"Lifelike\" NPCsThere are thousands of NPCs who have their own relationships and experiences; you can form any kind of relationships with them and even decide whether they live or die.\nYou will have children with your spouse.Coach your successor and teach him/her all your skills.Find your love from a past life.Detailed CraftingWith resource gathering, crafting, maintaining and Chinese alchemy, you can totally make any kind of weapons, armors, and elixirs with your own hands.Pick up an envenomed weapon, put up an envenomed cloth, and eat the envenomed antidote. Realistic BattlesThe original battle system will show you the design of \"counter striking\", \"even a stick can be a sword\", and \"long weapons bring power; short weapons bring danger\".Each time you attack, the damage will be applied to a different part of your opponent's body.With your martial art techniques, run your internal force  and practice your skills and strategies.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"ConchShip Games","platforms":[{"id":0,"name":"PC"}]},{"id":46491,"name":"King Exit","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ab/5abd2d666d0c29a9209c965d4d7481f4.jpg","description":"Because of the Great hero Galoluise, demons are all destroyed.For a rookie teenage girl to become the Savior, everyone loved her.Life seemed happy, and the world was as peace as it could ever get.But 3 years later,Hero Galoluise not only have lost her house, her friends and family members were","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"深爪貴族","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":28764,"name":"Enchanted Arms","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/925/9258d9cde5c28700d2e537e9366fb159.jpg","description":"A new generation of RPG has begun  The world at your fingertips! Introducing the first RPG for the Xbox 360! A brand new adventure is beginning here and now.  The story revolves around a young man named Atsuma, and the secrets contained in his right arm...  Meet incredibly expressive characters and collect over 100 Golems that you can raise any way you want!  With amazing details and articulate lighting, all made possible thanks to the power of a new level of hardware, it's like the world is right there with you! A new RPG for a new generation!","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"FromSoftware","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]}]