[{"id":28279,"name":"Joust","genre":"Action","price":0.0,"description":"Description\nSolo development and the first game of the studio “Game Life” - “Joust” is an arcade simulator of knightly tournaments. Competition among players for the maximum passage of levels. PVP and PVE  tournaments for the title of \"Best Fighter.\"\nSpecifications:\n• Choose your character type\n• Character development\n• Receiving Various Weapons\n• Various bosses\n• Restriction on revival\n• Unlimited levels\n\nEach level gives you a chance to get a new weapon or revival point.\nGame development plans:\n1. Alfa - PVE arena battles, boss fights.\n2. Beta - Open world (partially), PVE and the start of testing the PVP game mode.\n3. Release - Fully open world, PVE and PVP game modes.","imageUrl":"https://media.rawg.io/media/screenshots/565/56504b28b184dbc630a7de118e39d822.jpg","releaseYear":1982,"developer":"Digital Eclipse","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Atari 5200"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Apple II"},{"id":0,"name":"NES"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Atari 2600"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Atari 7800"}]},{"id":27945,"name":"Fire Emblem Warriors","genre":"RPG","price":0.0,"description":"Clash with legions of enemies as Marth, Xander, Corrin, Chrom, and other\nFire Emblem warriors by unleashing over-the-top-powerful Dynasty\nWarriors-style moves. Take control of characters with distinct attacks,\nissue strategic commands, pair up warriors for stunning moves, and more\nin an epic tactical action game from the Hyrule Warriors team.\n\nIn the Kingdom of Aytolis, new heroes mystically collide with warriors\nfrom across the history of Fire Emblem™, who must band together to face\ncountless enemies and restore the mysterious Shield of Flames to stop\nthe Chaos Dragon. Advance the story to unlock additional playable\ncharacters, each with different attacks, weapons, combos, and voiced\ndialogue. A combination of intense combat and strategic Fire Emblem\ngameplay offers a take on battling that's new to the series. Change\nbetween heroes anywhere on the battlefield and command them to victory.\nThe materials and gold you earn in battle can be used to upgrade heroes,\nweapons, and more.","imageUrl":"https://media.rawg.io/media/games/e30/e3038affa5065a6bc827849b969b48a0.jpg","releaseYear":2017,"developer":"Koei Tecmo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"}]},{"id":23006,"name":"Outlaws + A Handful of Missions","genre":"Action","price":0.0,"description":"Welcome home, pardner! We've been waiting for you here in the town of Sanctuary. Take your boots off and sit a spell. Ex-Marshal James Anderson lived a quiet life with his wife and daughter. One black day that life was shattered by a fancy-dressed, greed driven land baron intent on plowing down his farm to make way for the railroad. Now Anderson's driven by revenge, which he'll exact in a spray of gunfire.\nGet ready for the good, the bad, and the even worse. As Marshall James Anderson, you'll face a horde of ornery, gun-slinging outlaws. You'll shoot your way through a twisted plot of greed and revenge. You'll arm yourself with firearms, as well as your wits. So go ahead, and make your day.\n• Highly stylized characters with distinct personalities and weapons.\n• Gameplay involving puzzle solving to tease the mind as well as the trigger finger.\n• Combines first-person Gun Slinging Action and Wild West Adventure in one game.","imageUrl":"https://media.rawg.io/media/screenshots/5ac/5acab6ba9f9a484542531ce36892774c.jpg","releaseYear":1997,"developer":"LucasArts Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22143,"name":"Battle Bruise","genre":"Action","price":0.0,"description":"Stay atop a mountain of corpses!\nFight numerous swarms of enemies, while dealing with the changing terrain. Explosions will create holes, while pile of corpses will form little mountains.\nThis game isn't messy. It's MESS ITSELF!\nThe game features:\nThe main \"Arcade mode\", and,\nThe optional \"Car Defense\" mode, where you defend your parked vehicle with turrets\nAround 5 classes of weapons\n5 different enemies with distinct behaviors, and a final boss\nSoundtrack by Txai, inspired on Pothead Zombies series","imageUrl":"https://media.rawg.io/media/screenshots/0a7/0a7fd125482b3a0f3f2547d63a33f5ed.jpg","releaseYear":2017,"developer":"Zanardi and Liza","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22105,"name":"The Fall Part 2: Unbound","genre":"Action","price":0.0,"description":"Sequel to the 2014 Game of the Year award winning \"The Fall\".\nA lone AI has experienced a system collapse after encountering the limits of her narrow set of rules. Now, deconstructed and injected with a dark, invasive process, she must take to the global network in a desperate search for help.\nIn her quest, Arid (Armoured Robotics Interface Device) invades the bodies of three strange robots and attempts to enlist their aid. Arid may be unbound, but she's going to find that not everyone is as flexible as she is... or thinks she is. A truly bizarre story awaits you in The Fall Part 2: Unbound.","imageUrl":"https://media.rawg.io/media/screenshots/c7d/c7d3c3582e2136427294b1e38ac49499.jpg","releaseYear":2018,"developer":"Over The Moon","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":20859,"name":"Secret Files: Sam Peters","genre":"Adventure","price":0.0,"description":"Bigfoot, the Abominable Snowman, the Loch Ness Monster - cryptozoologists are trying to track these creatures down and research them. One also appears in the legends of the Ashanti people in Ghana. These tell of human-like creatures that lurk in the trees at night and take their victims off to their caves to suck their blood: the Asanbosam. Right after journalist Sam Peters has escaped from a volcanic eruption on an Indonesian island caused by terrorists, her boss sends her to Africa. Soon enough, strange things start happening at Bosumtwi, a mysterious crater lake. Could the Asanbosam really exist? Sam Peters is searching for the answers in this thrilling tale of the Secret Files series.","imageUrl":"https://media.rawg.io/media/games/d32/d32aede4fc2277b5a11b2d7c49353f81.jpg","releaseYear":2013,"developer":"Animation Arts","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":20733,"name":"Cube & Star: An Arbitrary Love","genre":"Adventure","price":0.0,"description":"Cube & Star: Warped Perspectives\"This is like the ultimate mind-f**k experience\" - Robin E: The Gaming Ground.\nTaking our cue from Robin E's vivid description, Cube & Star: An Arbitrary Love is now warped (hyperbolically) beyond reason and logic.\nSelect the lens through which you view this bizarre, colorful little world: Opt for the world-stretching Spindle view, the comforting and classic Perspective view, or the sociopath's delight: Data view.\nBecause truth isn't tied to reality, it is tied to the perspective through which we view it.\nAbout the Game\"Spread color. Spread joy. Thrill to the emergence of strange new creatures. And burn them all to ashes.\"\nCube & Star: An Arbitrary Love is a surreal open-world exploration game about the creation of life, joy and the pointlessness of existence.\nEat fruit, nudge trees, stain the ground and thrill to the emergence of strange and vapid creatures in your fool's errand to reunite the Ancient Cube and Star.\nDay breaks, grass grows, night falls, stars fall from the sky, trees shed their fruit...\nAnd across the world other cubes like yourself are bounding around, each with their own tiny opinions to impart to you... if you have the patience to listen.\nAs the grey world comes to life - secrets emerge from the ground: discover ancient relics, bizarre monetary tokens and personal journal entries left by cubes long gone.\nFill your void with knowledge, flood the world with color, burn the world to ashes - and watch as an ancient entity is reborn.\nAnd relax....\nDRM-free!\nExplore an ever-changing, ever-bizarre world.\nNight falls, day rises, grass grows, and the world becomes slick with rain.\nSeek out the lost voices of the Tiny Things, unearth relics, pointlessly accumulate currency.\nDecrypt the bizarre language of the Tiny Things.\nResurrect long-dead creatures.\nFlood the world with color.... and drown the world in fire.\nRaise strange new structures and bear witness as their occupants continue their grim calling","imageUrl":"https://media.rawg.io/media/screenshots/f5e/f5e9b6057e1b5802c3b617d04686fc38.jpg","releaseYear":2014,"developer":"Doppler Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20462,"name":"Toy Soldiers: Complete","genre":"Action","price":0.0,"description":"The award-winning smash hit returns with Toy Soldiers: Complete !\nBring your toys back to life with the original Toy Soldiers and Toy Soldiers: Cold War, now bundled together with all DLC packs: Kaiser's Battle, Invasion! , Napalm and Evil Empire. That's both Toy Soldiers games and all DLC in one $45-value bundle!Key FeaturesGreat Value: Enjoy over 60 original missions from Toy Soldiers, Toy Soldiers: Cold War, with accompanying DLC packs in Toy Soldiers: Complete. Multiplayer:Lead your toy soldiers to victory against friends! Engage in head-to-head battles across both games in Toy Soldiers: Complete. That’s right: you can now pit Commando against Kaiser in “historic” multiplayer action.An Arsenal of Weapons: Take direct control of over 50 units including machine guns, howitzers, tanks, fighter planes and bombers to defeat over 57 different enemy units. DLC is free!: Enjoy the content of the original Toy Soldiers, Toy Soldiers: Cold War, The Kaiser’s Battle, Invasion! , Evil Empire and Napalm DLC packs, absolutely free.Endless Action: Over 60 hours of intense combat combined with addictive, action strategy gameplay.Toy SoldiersOne of the top 10 best-selling Xbox LIVE® Arcade games of all time, Toy Soldiers is a unique, action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal that includes tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas.\nPosition your defenses and take direct control of your artillery to bomb the enemy positions, pilot your bi-plane against the enemy trench, or maneuver your tanks across No-Man’s Land and lead your Toy Soldiers to victory!Kaiser's Battle DLCEnjoy all new French inspired content with THE KAISER'S BATTLE! Enter the fray as the French Army and battle into the midnight hours in new multiplayer and Survival Mode maps. Take on the new experimental boss, the fearsome K-Wagen!Invasion! DLCThe British are bringing brand new secret weapons of tiny toy mayhem in 'Invasion!,' the second add-on to Toy Soldiers from Signal Studios!\nPut on your Kaiser’s helmet and command the German Army against a mad menagerie of new antagonistic toys, including flying saucers, chivalrous knights, and the “Rolls Royce of the Sky,” the WWII Mustang.\nDefend Germany in a new Mini-campaign topped by the most calculating, head-strong boss of all (batteries not included)! Raise your saber, soldier, and lead the charge against… is that a spaceman? The Invasion has begun!Toy Soldiers: Cold WarThe Cold War ignites when '80s era action toys come alive and wage war! Toy Soldiers: Cold War delivers hours of intense combat combined with addictive action strategy gameplay.\nSuperpowers collide in this playful homage to '80s action toys and films. Command the powerful Cold War arsenals of the USA or USSR armies! Control base turrets, modern combat vehicles, fighter jets, attack helicopters, and commando action figures. Whether lighting up the Toy Box alone or jumping into the fray with your friends, battle in campaign, co-op, or competitive modes.\nFight for the high score in the addictive mini-games, and while you're at it, don't forget to BLOW EVERYTHING UP!Evil Empire DLCIt’s time to step into the boots of our Russian comrades and fight back as the Evil Empire! Deploy turrets, modern combat vehicles, attack helicopters and a slew of new tricks to destroy your capitalist foes—all while enjoying expanded single player, online co-op, and online competitive modes.Napalm DLCEager to return to your freedom-fighting American army? Turn up the heat and invade a harsh new world in the jungle-themed Napalm; the final expansion for Toy Soldiers: Cold War.\nWith challenges focused on torching your enemies, additional weapons at your disposal, a brand-new vehicle, and expanded single-player, online co-op, and online competitive modes, Napalm is sure to set a new standard for startling authenticity and intense action.","imageUrl":"https://media.rawg.io/media/screenshots/428/428cb285517e0ff80ac5c513d41df194.jpg","releaseYear":2016,"developer":"Krome Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19811,"name":"Sketchfab VR","genre":"Adventure","price":0.0,"description":"Teleport yourself to Rome, hold a beating heart, or walk among dinosaurs. Open Sketchfab VR to discover a showcase of explorations through remote places, fantastic creatures, game worlds, cultural heritage, science and other wonders.\nSketchfab is the platform to publish and explore a million things in 3D and VR. With a community of over half a million creators, it is the largest library of user generated VR content in the world. We selected some of the best experiences for you - discover them now! You can also browse the full gallery on http://sketchfab.com with our WebVR support, using Chrome beta (get it on http://webvr.info).\nhttps://sketchfab.com/models/311d052a9f034ba8bce55a1a8296b6f9","imageUrl":"https://media.rawg.io/media/screenshots/087/0878559d6730531c15075d6bf3dbf9f5.jpg","releaseYear":2016,"developer":"Sketchfab","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19533,"name":"Iron Warriors: T - 72 Tank Command","genre":"Strategy","price":0.0,"description":"The most devastating mechanized armor to ever roll onto a battlefield is brought to life in Iron Warriors: T72-Tank Command. This epic combat simulator allows the player to command an entire platoon of tanks and ALL associated support units, or assume the role of ANY member in a complete tank crew!\nThe realism of both the physics and 3D engine creates game environments where real life armored tactic become the only way to survive on the today's modern battlefield!\n\nThree of Russia's most devastating and powerful tanks ever produced are  yours to control; the T - 34-85, T-55A and T-72B!\nRoll these mechanized monsters through 18 campaigns, 2 training missions, 5 single player missions and 3 multiplayer (LAN) missions.\nMaster your tank and crew and you will soon take command of other units that round out your mechanized platoon.\nCooperative multi-player support allows gamers to team up as a tank crew and play different positions within the same tank!\nRoll into battle on some of the most realistic terrain maps ever modeled; real weather, destructible terrain and detailed models.\nBallistics models take into effect: wind, shell, aerodynamic flight characteristics, barrel wear and droop!\nPowerful mission editor, map editor, and structure editor included; modify existing content or create your own.","imageUrl":"https://media.rawg.io/media/screenshots/f2b/f2b61e3d06f95c58157bf233cf7b9178.jpg","releaseYear":2006,"developer":"Strategy First","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18538,"name":"Paper Dungeons","genre":"Adventure","price":0.0,"description":"Paper Dungeons is a fantasy board-game boosted by online content. With the ability to create and share online your own levels, you are up for an infinite replay value! The game is visualized as a classic tabletop board-game with dice and tokens. You can destroy walls and auto-heal as you uncover new dungeon tiles, which widens your choice of moves.Game Modes\nPaper Dungeons features 4 SINGLE PLAYER MODES, each with a different gameplay:\nBoardgame mode:\nBegin every dungeon as a new board from a long adventure set: each new dungeon, your character resets to level 1 fortunately you keep your inventory. Unexplored parts of the dungeons are hidden by a fog of war. Monsters and items are placed at random, combats based on your statistics and dice rolls. Mitigate the combat’s result with a 2d6 (one for damages and the other for effects). Favor one attribute when you level up. Unlock and collect sets of dice (common/uncommon/rare/epic), but Beware! Monsters use their own too. An awareness system makes the monsters move towards you if you are in their line of sight. Dig up the walls to flee, at the cost of some precious health...\nCampaign mode:\nThis new mode allows you to play a fully-fledged adventure with up to 10 dungeons linked together by an introduction, dialogs between dungeons and a conclusion. Your character doesn't reset and keeps his inventory between dungeons.\nRogue mode:\nYour character doesn't reset at each new dungeon and keeps leveling up until you meet your demise. What will remain is your name in the Hall of Fame and more powerful sets of dice that you can use in your next Rogue run.\nPuzzle mode:\nHard-core campaign levels with no place for luck. No fog of war: the dungeon's layout (mobs and items) is shown. Monsters are static and won't move towards you. Strategize all your moves to ensure victory.Also availables:A MAP EDITOR, to create your own dungeons and publish them online.\nA CAMPAIGN EDITOR, to tell your own story and post it online.\nONLINE LEVELS feature, to play user's created content in Adventure or Puzzle modes.\nA CODEX listing all elements of the game.\nAn hardcore difficulty THE VOID with alternate color for the monsters.FeaturesSupports high resolution with native 1080p graphics.\nBig adventure of 125 Boardgame levels and 31 Puzzle levels.\n5 character classes (warrior/archer/priest/mage/thief), male and female, each with a unique gameplay.\n2 Official campaigns.\nDozens of different dice sets to improve your character.\n80+ monster types.\nMore than 50 unique pieces of equipement, 30 scrolls and 8 potions.\n4 different starting zones, each with specific monsters and bosses, 3 sizes of dungeon and special boss stages.\n5 zoom levels.","imageUrl":"https://media.rawg.io/media/screenshots/cb0/cb01fe8e9b61c9476affeac63cc52d96.jpg","releaseYear":2015,"developer":"Leslie Valverde","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":17726,"name":"Airline Tycoon Deluxe","genre":"Strategy","price":0.0,"description":"Airline Tycoon Deluxe is a funny economy simulation proceeding in realtime and assigning you the complete responsibility for an airline.\nHowever, don’t be fooled by the funny comic style or the included jokes: A variety of tasks are requested and your competitors never miss a chance to set a trap for you in order to put a spoke in your wheel.\nYour abilities are put to the test continuously playing Airline Tycoon Deluxe: Will you be able to use your aeroplanes to capacity and land some profitable charter flights? Can you establish routes for lucrative scheduled flights? Aeroplanes cost millions; will you be capable of increasing the share price and obtaining enough funds by the issuing of securities?\nCan you stand up for the construction of new aeroplanes in your role as an engineer? Are you able to avoid your competitors’ deceitful attacks? Accept this unusual challenge and win virtual laurels with Airline Tycoon. The deluxe version contains 20 new airports as well as new opportunities. It is as interesting for professional tycoons as for beginners.\nFunny economy simulation in comic style\nComplete freedom of action and freedom to move within the airport facilities and more than 30 places to be visited\nControl of all parts of management: purchase of aeroplanes and their fittings, financing as well as stock market listing, planning of routes and filling order books, personnel, marketing and maintenance as well as many other details\nEasily operated construction of own aeroplanes and the opportunity to exchange these on the Internet\nUse additional security precautions against competitors’ attacks or sabotage competitors yourself\nCompatible for local networks of up to 4 players","imageUrl":"https://media.rawg.io/media/screenshots/807/8077bb6b57c7e653b7ef3c53726bd328.jpg","releaseYear":1998,"developer":"Spellbound Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14561,"name":"Trapped Dead: Lockdown","genre":"Action","price":0.0,"description":"A small American town is overrun by the living dead! You manage to enter the town just before the military locks it down and now you must slice and shoot your way through thousands of zombies in order complete your mission in this action-packed Hack & Slash RPG.\nIn Trapped Dead: Lockdown, you fight your way through an interactive horror story as one of five different characters: The marine, the butcher, the assassin, the marshal and the exorcist. Every class comes with their own custom storyline, as well as individual strengths and abilities – the assassin is an expert in firearms, the butcher slaughters his enemies in melee combat and the exorcist fries zombies with his spiritual abilities. Each of the characters features his own individual skill tree, where you can unlock new defensive abilities and attacking moves to aid you in combat.\nIn Trapped Dead: Lockdown, you’ll have to choose between wielding two weapons at the same time or equipping one powerful two-handed one. The huge number of weapons keeps the gameplay interesting by letting you experiment with new combinations all the time: Would you like to send a concussion shot with the pistol first, then grab your hammer for a double blow, or rely on the mystical powers of the magic cross to set the zombies on fire? Clubs, axes, knives, revolvers, tasers, rifles, shotguns, bows, grenades, spell books, etc. There are hundreds of different weapons with which to kill the living dead - you can even use vehicles to run them over!\nWhile discovering the huge game world, you’ll encounter many different types of rotting enemies and menacing boss monsters whose different strategies and abilities will require you to think fast and hit hard if you want to live. The monsters thirst for blood and move in quickly from all sides, so make sure not to be surrounded! Friendly NPCs may ask you for help or fight alongside you, but in the end, there’s only one rule in this world: kill or be killed!\nFeatures:\nZombie-Action in a rich horror atmosphere\nFive different classes with individual storylines\nComplex Skill tree to level up your abilities and attributes makes for an individual RPG experience\nHundreds of weapons and items\nDiverse enemies and boss monsters\nDialogue spoken by professional voice actors and fully subtitled","imageUrl":"https://media.rawg.io/media/screenshots/186/18673682022e5c97327efbf21d9334f6.jpg","releaseYear":2015,"developer":"Bigmoon Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13180,"name":"Linked","genre":"Casual","price":0.0,"description":"Linked is a short puzzle platformer experience made in a 72 hour gamejam with a cozy soundtrack, and short, yet sweet story! Explore space, the deep ocean, and past ages in short, yet sweet levels spanning across all three. As you progress, you'll discover new and interesting ways to beat levels.The average playtime is no longer than 15 minutes.DEV NOTEIt is our first game that we decide to publish, so we really hope you all enjoy, and are excited to see what we bring in the future!","imageUrl":"https://media.rawg.io/media/screenshots/8ae/8ae9c7bae8021f256d22a26c977bf36a.jpg","releaseYear":2017,"developer":"ThinkOfGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12465,"name":"Blade & Bones","genre":"Action","price":0.0,"description":"Discover a tale long lost in our past. Seven swords need to be found in this Metroidvania adventure where you will discover ancient secrets and fight with an intense combat system that rewards players for their skills and knowledge.\nLore – First, Niro cried and it created this world. Then he cried again and created the Orins. They defy him once and, with furious anger, he then took their voices away.This was the great sin and now the first seven swords are forever lost in this world. It’s necessary to find them in order to defy him again. Such a task can only be completed by the last seven Orins though, who still search for them.\nDynamic Combat – Using light and heavy attacks with great precision and six different styles, the combat system heavily relies on timing and patience. This intensive skill based system is supported by the procedural generation of swords and by a diverse range of enemies and bosses. Attacks can be combined with roll movements and the use of ancient relics, as well as dynamic body transformations called Kuros, allow even more diverse gameplay.\nExploration Elements – Ancient relics allow the player to uncover secret weapons and life fragments to better support player combat capabilities. Many relics, secrets and locations are totally optional and can only be found by extensive search into the game lore. After a brief introduction, the player is free to approach any of the seven legendary swords through the way that seems to fit best. The entire map is open for him to unravel. The map is created with many hidden shortcuts and secret passages to forbidden lands that can only be used in a right time of the day or with the correct Kuro.","imageUrl":"https://media.rawg.io/media/screenshots/d5d/d5d48d9814538f06de44362c81e02e28.jpg","releaseYear":2016,"developer":"Coffee Addict Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":12310,"name":"Odd||Even","genre":"Strategy","price":0.0,"description":"Odd||Even is a math and logic based, integer placement puzzle game created by irritatingFLY studio.Oddeven-game Features\npowerful puzzle generator with natural interface\nfeature rich mathematical-software\nfull control given to users\nsharp graphics\n90 logical selected puzzles\nfull rights (once purchased you can use generated puzzles as you like, even for commercial use)","imageUrl":"https://media.rawg.io/media/screenshots/472/472b78acbd2a0554a1bd1cf83906e8f4.jpg","releaseYear":2016,"developer":"irritatingFLY studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11618,"name":"Alien Attack: In Space","genre":"Action","price":0.0,"description":"You are abandoned in a galaxy far far away. After regular cleaning from aliens in enemy territory, your team thought that all aliens are dead now and flew to Earth base. Now every one of aliens from nearest regions will hunt you down till death.\nYour intergalactic compas is broken, you can't find path to home by yourself. But your ship served it's best in every time and will serve you it's best.\nFight them as long as you can. It will be the hardest battle in your life.\nYour squad will help you to fight and will send you some help. You have an arsenal of three weapons, which can be loot from bosses. You can defeat them!","imageUrl":"https://media.rawg.io/media/screenshots/9d6/9d61e08cff64fa85fdc2ab7c17bd97e3.jpg","releaseYear":2016,"developer":"Nova Dimension","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10804,"name":"The Fishing Club 3D","genre":"Sports","price":0.0,"description":"Go fishing and relax!\nBait your hooks and catch lifelike fish in beautiful 3D locations all over the world - from tiny roaches to mighty sharks!\nHighlights:\n- Catch over 50 different fish species - from the smallest roach to the mighty sharks. New fish species are added on a regular basis.\n- Create your own fishing club and go fishing with friends.\n- Chat with your club mates and other players from all over the world.\n- Take part in Speed Fishing competitions on your own or win weekly competitions with your club.\n- Complete quests and catch legendary fish like the mysterious Tiger Trout and many others.\n- Go on an epic treasure hunt and catch the infamous shark Gorgemaw.\n- Find the best combination of rod, line, bait and hook to catch giant fish.\n- Take part in the very popular King-of-the-Spot competitions in which clubs fight for the highest catch weight at a fishing spot.\n- Chat with fellow anglers in the global chat room or just with your club mates in your club’s private chat.\n- Don’t worry about “energy” or spamming your friends to keep fishing: In The Fishing Club 3D, you can play as long as you want.\nPlay now!","imageUrl":"https://media.rawg.io/media/screenshots/ac6/ac637eb12fd9420cf46379eed9ffb3dd.jpg","releaseYear":2017,"developer":"Robot Riot UG","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9901,"name":"Dig or Die","genre":"Action","price":0.0,"description":"Explore, fight, craft and build your defenses! Enjoy a unique and innovative game:\n• Strategy: survive massive attacks each night by building strong walls and placing turrets wisely.\n• Physics: build wisely or your structures will collapse! And you will need them to defend your base, or build bridges and high towers to access remote locations\n• Water cycle: rain, infiltration, underground rivers and lakes... be careful during the heavy rains, or you could be surprised by a sudden water level rise!\nYou are a representative of the CRAFT & Co company. You are selling automated fabrication tools across the galaxy when your spacecraft crashes into a hostile planet. Use the tools you sell and the local resources to build up all of what you'll need to survive and eventually be able to escape the planet.\nGameplay:• Fun from the start: no awfully slow digging, so you can concentrate on the exploration, fights and strategy.\n• Game's final objective: you must build a rocket ship to escape the planet.\n• Strategy survival: the game is a survival game in a strategic meaning. No hunger needs, the whole point of the game is to survive to the massive attacks each night. And to do that, you will have to explore the world to gather resources and craft your defenses.Fights:• No swords, magic or flying clown monsters here! It's a consistent science-fiction world, with fast and fun laser guns fights!\n• Intelligent monsters: they will find the best path to attack your defenses. And be careful: even if they can't move through walls, they can still destroy them!\n• Difficulty progression: only the species of monsters you have already killed before attack during the night (they must have taken ill!). So you can progress at your own pace and choose when you are ready to move forward and fight stronger monsters.\n• AI. companion: your crashed ship contains an AI that survived and will give you useful advices (or not!). Build him a drone so he can follow you and even help you fight the monsters!World Simulation:• Huge world with global real-time simulation of the environment, physics, water cycle and ligthing.\n• Electricity: build solar panels or functional hydroelectric generators to power your base’s most advanced items!\n• Plants simulation: plants naturally grow and spread if their life-conditions are met. Create some farms with artificial sun lamps and irrigation.\n• Procedurally generated world: Major areas locations are specific to benefit from a logical game progression, but detailed layout of surface, caverns, ores, etc. are unique at each playthrough.Crafting and Building:• Crafting: You dig minerals, harvest plants and kill some monsters and bosses in order to craft better items and defenses. But the digging is really fast, your inventory space is infinite and all crafting recipes are displayed, so you don’t waste all your time on grinding or wikis and can concentrate on setting up better defenses.\n• Base construction: You build a fortress, not a holiday house. So you won't find hundreds of flowerpots or tapestries, but rather turrets, strong walls and useful machines. Remember the Starship Troopers or Aliens movies atmosphere!","imageUrl":"https://media.rawg.io/media/screenshots/f82/f82639a05281389d331318aa0605297c.jpg","releaseYear":2015,"developer":"Gaddy Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5993,"name":"Dungeon Warfare","genre":"Action","price":0.0,"description":"Dungeon Warfare is a challenging tower defense game where you become a dungeon lord to defend your dungeon against greedy adventurers.\nAs you successfully purify your dungeons throughout the world from the pesky invaders, you will gain access to more powerful traps and devious utilities.\nGain experience from killing the invaders to permanently upgrade your traps.Game Features 26 unique traps with 3 upgradeable tiers each\nPassive upgrades for the traps\n40+ handcrafted levels\n22 types of enemies\nMix your own difficulty by combining 12 difficulty mode runes for more challenge\nEndless mode (unlocked after obtaining the Infinity rune)\nLaunch a huge rolling boulder to crush everything on its path.\nReroute enemy path towards a busy minecart track to smash the invaders away.\nPlace traps that mercilessly throw mighty warriors into the pitch black abyss\nGather a force of your own by using summoning portals to instigate a chaotic brawl.\n30+ achievements\nJuicy pixel art\nJuicy sound effects\nJuicy adventurers!","imageUrl":"https://media.rawg.io/media/screenshots/4c1/4c12785e56304dd9edaa4cf78e932fe7.jpeg","releaseYear":2015,"developer":"Jin Man Kim","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":4277,"name":"METAL GEAR SOLID HD EDITION","genre":"Action","price":0.0,"description":"From the critically acclaimed director, Hideo Kojima, Metal Gear Solid HD Collection offers a handful of the most popular Metal Gear Solid titles from the past in true HD for the first time ever. Featuring three complete games, Metal Gear Solid 2: Sons of Liberty, Metal Gear Solid: Snake Eater and Metal Gear Solid: Peace Walker, the HD Collection offers old and new fans a chance to experience the epic game play, design and storytelling of the MGS franchise.\nKEY GAME FEATURES:\n• Full HD with revamped graphics, menu systems and much more.\n• Experience some of the greatest gaming design, storytelling and presentation in videogames\n• Endless hours of gameplay\n• Online multiplayer modes featured in MGS Peace Walker\n• Enjoy smooth, precise controls with right analog stick formatting and Force Feedback\n• See the game like never before in 60 fps at 720p\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n©2012 Konami Digital Entertainment Cooperation: Fontworks Japan, Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","imageUrl":"https://media.rawg.io/media/games/bce/bce6bf5c0ac923b23cce1748c1606e99.jpg","releaseYear":2011,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3670,"name":"Soul Sacrifice Delta","genre":"Action","price":0.0,"description":"Soul Sacrifice™ Delta is the ultimate edition of Soul Sacrifice with a lot of new content and improvements. Grim, the faction who believes in neutrality in all things, joins the blood thirsty Avalon and the merciful Sanctuary, and adds a third angle to bring the Delta in Soul Sacrifice. Grim’s beliefs, rooted in the prophecy they will seek to realize, will bring about irrevocable changes to the world as we know it. The concept of faction is now at the heart of the game with players able to join the side of their choice, each with their own strengths and play styles. Players from each faction can now register their overall progress.\nBut there isn’t just more of everything; new Archfiends inspired by dark retellings of classic fairy tales, new sorcerers, arenas, spells and even more quests.\nMany improvements to the game design and systems have been made as well: the graphics engine has been optimized, some arenas are now dynamic with weather effects and structural changes during battle, the spells system has been refined and allows for more collaborative and deeper gameplay. The AI of the Archfiends has been improved, who are now more vicious than ever. Finally, character customization has been taken to a new level, with the ability to mix costume parts and accessories.\nSave data from Soul Sacrifice™ including story progression, costumes, offerings, sigils, black rites, life/soul essence and lacrima (up to 10,000) will carry over to Soul Sacrifice Delta. Transfer your save data from Soul Sacrifice, and carry on with your adventure in Soul Sacrifice Delta.\nDISCLOSURE REGARDING USE OF LOCATION: This game interacts with other applications that use location data (such as “near”). To turn off location data, go to [Settings] > [Location Data].\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\n©2014 Sony Computer Entertainment Inc. Soul Sacrifice is a trademark of Sony Computer Entertainment America LLC.","imageUrl":"https://media.rawg.io/media/games/6b8/6b878f5f71215ddb0b6cf51c831f107d.jpg","releaseYear":2014,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":102,"name":"Subway Surfers","genre":"Action","price":0.0,"description":"Presented by Kiloo Games and Sybo Games.\nDASH as fast as you can!\nDODGE the oncoming trains!\nHelp Jake, Tricky & Fresh escape from the grumpy Inspector and his dog.\n- Grind trains with your cool crew!\n- Colorful and vivid HD graphics!\n- Hoverboard Surfing!\n- Paint powered jetpack!\n- Lightning fast swipe acrobatics!\n- Challenge and help your friends!\nJoin the App Store's most daring chase!\nA Universal App with HD optimized graphics for retina resolution.\nSubway Surfers is compatible with iPhone 4, iPod 5, iPad 2 or newer.\niOS 7 or later OS version is required.","imageUrl":"https://media.rawg.io/media/screenshots/fb5/fb554f480b9896b031d68ef5ef9937fa.jpeg","releaseYear":2012,"developer":"Kiloo","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":961206,"name":"Neva","genre":"Adventure","price":0.0,"description":"Experience the moving tale of a young woman and her lifelong bond with a magnificent wolf as they embark on a thrilling adventure through a rapidly dying world.","imageUrl":"https://media.rawg.io/media/games/5eb/5eb783656623aa13d6fc65e470dd5dba.jpg","releaseYear":2024,"developer":"Nomada Studio","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":797883,"name":"Season: A Letter to the Future","genre":"Adventure","price":0.0,"description":"Close your eyes, take a deep breath and let yourself be carried away by the great journey of Season, a third-person atmospheric adventure bicycle road trip game. Through the eyes of a young woman leaving a secluded community, you explore the wider world for the first time. Collect memories before a mysterious cataclysm washes everything away...\n\n\n\nDocument, photograph, and record life. Through a solitary bicycle journey, form your own memories, your own vision of the world around you. Your goal? Protect these treasures from being forgotten. Your quest will lead you to discover a new world; unknown, yet familiar. You will be immersed in different societies that will make you discover the mysteries of the world of Season; a surreal version of the mid-twentieth century, where thousands of years have passed without any progress. Find out what caused the last collapse and what might cause the next one...\n\n\nThrough your journey\nMeet a diverse cast of characters on your way, who will change the course of your story\nExplore a beautiful and poetic fantasy world\nCollect memories, make recordings, and discover the secrets of the world of Season\nWind your way through stunning landscapes on your bicycle\nExperience a touching story as you witness the last breath of different cultures","imageUrl":"https://media.rawg.io/media/games/8f0/8f067578df893bcdd24177ac65998729.jpg","releaseYear":2023,"developer":"Scavengers Studio","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":685021,"name":"FATAL FRAME: Maiden of Black Water Digital Deluxe Edition","genre":"Action","price":0.0,"description":"Early Purchase Bonus- Yuri Exclusive Costume: Ryza Outfit, Ryza Hat\nNote: This content is included for free with purchases made before November 11th, 2021.\nIt is possible it will be sold separately at a later date.\nFATAL FRAME / PROJECT ZERO: Maiden of Black Water Digital Deluxe Edition● 20th Anniversary Digital Artbook\nThe special anniversary digital artbook features artwork and BGM tracks from past titles of the FATAL FRAME / PROJECT ZERO series and can be accessed from the game menu.\n● Past Protagonists Costume Set\nOutfits of various past protagonists of the FATAL FRAME / PROJECT ZERO titles will be available in the game:\n- Mio Amakura Outfit (from “FATAL FRAME / PROJECT ZERO Ⅱ Crimson Butterfly”)\n- Rei Kurosawa Outfit (from “FATAL FRAME / PROJECT ZERO Ⅲ The Tormented”)\n- Miku Hinasaki Outfit 1 (from “FATAL FRAME / PROJECT ZERO”)\n- Miku Hinasaki Outfit 2 (from “FATAL FRAME / PROJECT ZERO”)\n- Mayu Amakura Outfit (from “FATAL FRAME / PROJECT ZERO Ⅱ Crimson Butterfly”)\n- Kei Amakura Outfit (from “FATAL FRAME / PROJECT ZERO Ⅲ The Tormented”)\nNote: “FATAL FRAME / PROJECT ZERO: Maiden of Black Water” is also available for purchase on its own. Please be careful to avoid making a redundant purchase.\nNote: The Digital Deluxe Edition set includes the contents of the FATAL FRAME / PROJECT ZERO 20th Anniversary Celebration DLC. Please be careful to avoid making a redundant purchase.\nAbout the Game“FATAL FRAME / PROJECT ZERO: Maiden of Black Water” comes to Steam for the first time to celebrate the 20th anniversary of the horror-adventure series FATAL FRAME / PROJECT ZERO.\n[The Story]\nMt. Hikami was once revered as a spiritual place.\nIt housed a unique religion based on beliefs and customs of worshipping water as a deity and is said to have been a site of many gruesome incidents and mysterious phenomena.\nThis mysterious and intertwined story follows three protagonists—Yuri Kozukata, Miu Hinasaki, and Ren Hojo—as each of them explores the ominous Mt. Hikami, a place where many came to die, and the secrets it hides.\n[Gameplay]\nPlayers use Camera Obscura, a special camera capable of repelling vengeful ghosts and sealing away their powers, to explore Mt. Hikami and the numerous incidents that took place there in the past.\nThe story is divided into separate missions, and each mission is led by a new protagonist. The protagonists have a power called Shadow Reading, which allows them to sense the remnants of memories of people who have disappeared on the mountain.\nThese memories lead the players deeper on secret mountain paths, but what awaits there are malicious spirits that want you to join them in the world of the dead. The only way to fight the spirits off is to capture them with the Camera Obscura. After a spirit is defeated, you can also use the Glance ability to see the final moments of their life.\nIn addition to sealing the evil spirits that attack you, Camera Obscura can be used to reveal other things that can't be seen with the human eye and will help in the recovery of lost items.\nBy using the camera and the various abilities, you will be able to unravel the mysteries of the sacred mountain.\n[New Elements]\n- Improved screen resolution\n- New outfits and accessories\n- New Snap Mode where you can freely place characters and spirits for creative shots\n- Updated Ghost List\n- Updated controls\nand more.\nNote: “FATAL FRAME / PROJECT ZERO: Maiden of Black Water Digital Deluxe Edition” that includes the main game and bonus content is also available for purchase. Please be careful to avoid making a redundant purchase.","imageUrl":"https://media.rawg.io/media/games/803/803c5c67c4c7b1cf4309b0e36681f285.jpg","releaseYear":2021,"developer":"KOEI TECMO GAMES CO","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":471021,"name":"Balan Wonderworld","genre":"Action","price":0.0,"description":"The curtains have been lifted unveiling the all-new 3D action platformer created by the legendary creators Yuji Naka and Naoto Ohshima. \n\nTwelve different tales await players in the bizarre and imaginary land of Wonderworld. As the star of the show you can use powers from 80 different costumes while exploring labyrinth stages, filled with a myriad of tricks and traps to get to the heart of each story.\n\nAs you journey through this land between fantasy and reality, you must find a way to bring balance to others and yourself.","imageUrl":"https://media.rawg.io/media/games/f17/f17cb19c5e9b30e378e5f9ba1cc74df3.jpg","releaseYear":2021,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":385444,"name":"Boomerang X","genre":"Action","price":0.0,"description":"Whispers bubble from fresh cracks in the ground, echoing through the abandoned depths and primordial woods. A black flow cuts through stone and threatens to spill once more across the world. The ancient tetraform calls, and with it come unearthly powers.\nCatapult yourself through the air, use the power drawn from fallen creatures to slow time, and cut through the swarms of dark beings with a razor-edge boomerang. Travel through once bustling locales, sacrificed to hide a myth, and descend the Godpath into the lost realms below. Cleanse these halls and ensure that whatever lies beneath doesn’t come back.","imageUrl":"https://media.rawg.io/media/games/cfa/cfa29784df7f1ebcfe534dfc76b8dc36.jpg","releaseYear":2021,"developer":"DANG!","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":334412,"name":"Kingdom Hearts 3D: Dream Drop Distance HD","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/14d/14d5d443b1482c1d5b48e3cb482b3909.jpg","releaseYear":2017,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":326271,"name":"LEMNIS GATE","genre":"Action","price":0.0,"description":"game of LEMNIS GATE takes place within a 25 second repeating time loop. Players take turns to add new characters into the loop. Each hero is forever stuck, replaying their actions over and over.\nSuperior aim and faster reflexes are not the only contributors towards victory or defeat. Players have to think creatively, using causality and their team to surprise and outsmart their opponents inside the time loop.\nRELIVE THE PAST TO CHANGE THE FUTURE!LEMNIS GATE is about skill, strategy, and time-traveling. It incorporates the traits already known by First-Person Shooter veterans with a quirky twist. While preserving the familiar feel of the genre, the time loop mechanic aims to add creative thinking into the mix, laying the foundation for highly competitive matches.SEVEN HEROES, INFINITE POSSIBILITIESWith a roster of seven unique characters, players have to strategize their way to victory. Every hero possesses a distinctive loadout and special ability that will prove decisive in the battlefield. In this ground-breaking new FPS, characters from the past, present and future play together as a team in order to defeat their opponents.\nPLAY A TEAM GAME BY YOURSELFLEMNIS GATE is a turn-based FPS where each character on your team is controlled by you. Experience deep, tactical teamplay like never before. No need for AI or other players, you can cooperate with yourself! We call this AUTO-COOP.","imageUrl":"https://media.rawg.io/media/screenshots/bb5/bb5584f15785547db2252b7e655cfe8b.jpg","releaseYear":2021,"developer":"Ratloop Games Canada","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":51107,"name":"Chamber of the Sci-Mutant Priestess","genre":"Action","price":0.0,"description":"Set in a post-apocalyptic world, Chamber of The Sci-Mutant Priestess casts you as Raven, a young \"Tuner\" (psionic mutant), working for the Tuner Netwerk. One day, while out on assignment with his friend Sci Fi, he witnesses the massacre of a \"Normal\" village, by a group of Protozorqs (physical mutants). Raven and Sci Fi disobey their instructions from the Netwerk, and fight back against the Protozorqs. In the ensuing struggle, Sci Fi is captured and taken back to the Protozorqs' mountain temple. Raven vows to save her, and so gets himself captured, too. As the game starts, Raven is a prisoner in the crazy Protozorq temple, where something sinister and utterly insane seems about to happen. Apparently, Raven has to go through five ordeals, to become a \"Divo\" (a Messenger Of The New Solution). For each ordeal he completes, he receives a Vort skull. Can you complete the five ordeals, save Sci Fi and destroy the fiendish Protozorq plot, in time?\nChamber of the Sci-Mutant Priestess (originally entitled Kult: The Temple of Flying Saucers) is a puzzle-solving adventure game. To solve the puzzles, Raven will sometimes need to collect and trade items; but more often, usage of the eight \"psi-powers\" is required. These powers range from a simple light spell (\"Solar Eyes\") to instant-kill (\"EV\" - extreme violence) and complex psychological effects (\"Brainwarp\"). The five ordeals can be completed in any order, or even skipped altogether to reach a different ending. A time limit is imposed on the ordeals, and is calculated by turns. A \"wait\" command, which skips a turn, is also available.","imageUrl":"https://media.rawg.io/media/screenshots/ae8/ae817a7b6a0bfebbff883959e7838a56.jpg","releaseYear":2017,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51102,"name":"Astrologaster","genre":"Adventure","price":0.0,"description":"London, 1592. A great plague sweeps through the capital. When doctors flee the city in fear, a hero rises.  His name is Simon Forman, “Doctor” of Astrology, Astronomy and Physick. Not only does he have the power to cure the sick, he can find their lost pets and predict their futures! All by reading the movements of the stars.\nBut when the plague ends, Forman’s problems begin. The real doctors return to London and they will stop at nothing to bring him down...\n\nAstrologaster is an astrological comedy game based on the casebooks of real-world historical figure Simon Forman:\nGuide Forman in casting and interpreting real astrological charts.\nHelp solve patients’ problems that range from Elizabethan terror plots and foul diseases, to romantic entanglements and missing spoons.\nExpand Forman’s clientele and gain him enough influence and legitimacy to prove the London medical establishment wrong.\nSimon Forman was considered a sage by some and a charlatan by others. What will your legacy be? Will you put your faith in the stars?","imageUrl":"https://media.rawg.io/media/screenshots/c8e/c8e365af6cd09e756d21cb813d485755.jpg","releaseYear":2019,"developer":"Nyamyam","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":50908,"name":"Realm Revolutions","genre":"Desconocido","price":0.0,"description":"Idle game inspired by Swarm Simulator and Realm Grinder. Buy buildings and hire more and more citizens from them. A large number of citizens leads to their discontent. And they may revolt! After the revolution discontent people become happy and give bonus to production.ProductionAt the beginning of the game you will have 2 resources: gold and food. Gold is necessary for buying new buildings and for hiring citizens. Food is necessary for the hiring of citizens, while, unlike gold, for each citizen, only one food unit is needed. You need to decide when you are ready to start hiring more expensive citizens, because they require as much food as cheap ones.Discontent and happinesWhen there are too many citizens, they become discontent. Discontent citizens can arrange a revolution. After the revolution, discontent citizens will become happy and they will receive a bonus to gold production. The revolutions of citizens are independent, if the revolution was arranged by the peasants, only the peasants will be happy after it. Decide who should start the revolution, because after the revolution the game starts anew!Further progressWith the construction of new buildings you will discover animals, magic, army and battles with monsters, assimilation of other races and much more.","imageUrl":"https://media.rawg.io/media/screenshots/d50/d50304ad009c961948a8b61a4441c243.jpg","releaseYear":2018,"developer":"Aleksandr Golovkin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":49707,"name":"My Free Zoo","genre":"Simulation","price":0.0,"description":"Get the Most Dangerous Predators for your Zoo\nExperience the extraordinary tycoon My Free Zoo. Save a failing petting zoo and turn it into a flourishing visitor magnet. Earn or purchase unique animals – from fearsome lions to awe-inspiring grizzlies. At higher levels, you'll even be able to breed prehistoric dinosaurs. Discover the captivating zoo simulation today!\nA Sensational Attraction is Born\nWelcome to your new job! In this tycoon game, you fill the vacant position of zoo director. Your first task is to save the small, failing zoo from bankruptcy. Create pathways, build a wide variety of habitats, and provide food, water and play equipment for your animals. Improve your zoo's infrastructure by opening a nursery for offspring, which is sure to delight your visitors. The more men, women and children visit your zoo, the more Zoo Dollars you'll rake in. This extraordinary tycoon game is chock-full of captivating features. These include:\nSeasonal events\nRegular updates and patches\nVirtual friendships with your fellow players\nChallenging quests with rich rewards\nOpportunities to breed animals\nSpectacular guild features\nA compelling blend of tycoon and zoo simulation\nLong-lasting fun\nLet the Registers Ring!\nProve your economic skills, expand your zoo, increase your profits and invest your virtual money into the continuing design and expansion of your zoo. Merchandising opportunities, snack booths, exotic animals and eye-catching decorations will attract hordes of visitors and make your registers ring non-stop!\nGiants of the Animal World\nThe further your progress through the levels, the more animals you'll be able to keep in your zoo. The selection ranges from tiny critters such as meerkats and rabbits to true giants such as elephants, whales and towering dinosaurs.\nDiscover the tycoon simulation! Play now!\nNote: My Free Zoo can only be played online. Existing browser game accounts cannot be linked to Steam.","imageUrl":"https://media.rawg.io/media/screenshots/02d/02dd67f74384152da2a3a97977dabcdf.jpg","releaseYear":2017,"developer":"KING Art","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46355,"name":"Taphouse VR","genre":"Simulation","price":0.0,"description":"Coming soon to Taphouse VRTaphouse VR will have many content updates after launch! Be sure to Follow us on Steam to get the latest updates.\nAbout the GameReady. Set. Serve!In Taphouse VR, you are the bartender! Pour glasses, mugs and shots of all kinds of beverages to thirsty dwarves. Mix and match recipes to make drinks that dazzle  your patrons. Be careful with your customers - some will get angry if served the wrong thing or if you take your time. Get ready to break up some fights as well! With an exciting cast of drunk dwarves and a lovely drinking hole to work in you'll get to experience what it truly feels like to be a tavernkeep. And when your mind starts to wander, play the slot machine or throw out some troublemakers!FeaturesUse your Vive motion controllers to pour drinks to glasses, operate the taps and to send away customers too drunk to stand!\nAll kinds of drinks like tap beer, rum, long drink, cola, milk, energy drinks, vodka and more to pour for your thirsty customers!\nMake recipe drinks to earn more tips - Cuba Libre, Gin & Tonic, White Russian...we've got quite the collection!\nMess around the counter with plenty of stuff to fiddle with, including your paying patrons!\nEarn gold by being fast, efficient and careful when serving - spend your hard earned extra coins on the slot machine and win big!\nIntelligent drunkard AI knows to start fights, argue over the slot machines and drink until they pass out!\nTwo game modes: do a real shift in Bartender Mode or go with Sandbox Mode if you feel like playing around (or showing off)!","imageUrl":"https://media.rawg.io/media/screenshots/32e/32e81f5d9a0d1d7a232ac61c4b522801.jpg","releaseYear":-1,"developer":"Catland","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31321,"name":"Road Rash (1996)","genre":"Racing","price":0.0,"description":"Kick some Asphalt!\nKick, punch, and club your opponents . . . then get really nasty.\nCruising at 150 mph you dodge oncoming cars, trucks, oil spills and even cows.\n5 levels with 5 courses, the higher the level, the meaner the opponents.\nEight bikes are yours, if you can come up with the cash.","imageUrl":"https://media.rawg.io/media/games/8b1/8b17097694791b1d38162d32921d6ad4.jpg","releaseYear":1996,"developer":"Papyrus Racing Games","libraryGames":null,"platforms":[{"id":0,"name":"3DO"},{"id":0,"name":"PC"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"}]},{"id":28778,"name":"NHL 11","genre":"Sports","price":0.0,"description":"NHL 11 - Powered by an all-new Real-Time Physics Engine and featuring the all-new Hockey Ultimate Team mode, experience hockey at its best.","imageUrl":"https://media.rawg.io/media/games/5c1/5c165232db5af63ab2dcc29820046456.jpg","releaseYear":2010,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":23721,"name":"SQUIDS FROM SPACE","genre":"Action","price":0.0,"description":"SQUIDS FROM SPACE is a team-based tactical PvP top-down shooter where the Earth is under attack from a race of sinister aliens -- The Squids! Taking place in a retro 1950's setting, the people of Earth must unite and fight back, pitting human weapons of war against the Squids' bizarre technology in a battle for the future of the planet!Join Our Community!We have a Discord Community that anyone is welcome to join! Get instant interaction with the creators of SQUIDS FROM SPACE. Ask questions, voice concerns, share your ideas, and share your creative content (videos, streams, art, etc) with others.\nhttp://discord.gg/ZkhScjJFEATURES\nPlay as a human and defend Earth, or play as a Squid and conquer it!\nEngage in chaotic fire-fights in a light-hearted and colorful universe.\nBattles last 10~15 minutes, making it easy to play as much or as little as you want.\nAs a human, blast your foes with shotguns, rocket launchers, grenades or bundles of dynamite!\nAs a Squid, disintegrate your enemies with deadly rays, or pilot a massive Crawler Tank!\nOut-strategize your opponents by collecting resources and unlocking better weapons for your team.\nBlow up cars, gas stations, oil barrels, and plenty of other things as you wage war across the map.\nAI bots with different personalities automatically fill empty team slots.\nPlenty of support-style weapons to choose from, for those who are teamwork-inclined!","imageUrl":"https://media.rawg.io/media/screenshots/910/9100e45783fc454b5074078ec2b6d3dc.jpg","releaseYear":2017,"developer":"Fun Bits","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19773,"name":"Eclipse --- Defending the motherland","genre":"Adventure","price":0.0,"description":"This is a really hard FPS Sci-Fi game. You can challenge yourself.\nThousands of Monsters run to you, can you really get through it?\nEndless level, Endless monsters, just have a try!","imageUrl":"https://media.rawg.io/media/screenshots/65f/65ffb0951a3ac42e72e33c1aa1bc8818.jpg","releaseYear":2016,"developer":"Hangzhou NezhaGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18606,"name":"Mystical","genre":"Action","price":0.0,"description":"You are a novice magician at the end of his studies. During a course on the opening of doors at the temple of the Great Wizard, you have clumsily cause the disappearance of all the phials and scrolls that he had so carefully classified over many years.\nNeedless to say, the rage of the Very Great Wizard is as big as your chances of failing the final exam. Therefore, if you want to obtain your magician's diploma someday, you will have to recover the majority of the scattered phials and scrolls...\nThis will not be easy because they have been thrown into parallel worlds dominated by unscrupulous gods, jealous of the magician's power.\nDespite his intense anger,  the Immense Wizard will allow you to use the potions contained in the phials or the magic words inscribed  on the scrolls to defend yourself. Then, he will follow you throughout your whole adventure thanks to his crystal ball, and he will use his limitless power to transport you from one world to another and to give you life again should the circumstances prove to be fatal.\nNevertheless, his patience is so much limited than his powers. That is why he will only give you life twice after which you will be open to his most dreadful punishment.","imageUrl":"https://media.rawg.io/media/screenshots/1a3/1a3a8cd440f311c522c1585df3db8275.jpg","releaseYear":2015,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]