[{"id":19189,"name":"Interplanetary","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d54/d5443b120ca55bf576651a6455a38218.jpg","description":"http://store.steampowered.com/app/650220/\nInterplanetary is a turn-based strategy artillery game based on a hard scifi setting. It offers players an interplanetary battlefield where they can develop their home planets and use massive artilleries to wage war.\nIt's an arms race of interplanetary scale, with each planet developing increasingly powerful weapons. Massive railgun batteries are the backbone of any interplanetary arsenal, but the cunning use of missiles and precision lasers may hold the key to victory. Strategic building patterns, upgrades and defense structures might keep your vital installations standing long enough to give you an edge, but it's only a matter of time until all but one must fall.\nSometimes, your greatest foe is the planetary system itself! Don't let the unpredictable gravitational changes get the better of you - observe your surroundings, use them to your advantage, and blast your enemies back to the stone age!Key FeaturesChallenge your friends in hotseat or online matches or fight skirmishes against the AI.\nBuild and manage your planet's infrastructure.\nGather resources and decide the most efficient use for them.\nResearch and develop increasingly futuristic technologies.\nSpy on your enemies to reveal their planets' weak points.\nUse your artillery constructions to aim across the planetary system, avoiding other celestial bodies and their gravity.\nFire your railguns, missiles and beam weapons to annihilate the enemy and claim the planetary system for your civilization!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team Jolly Roger","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12143,"name":"Burly Men at Sea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf3/bf37a864502fb7cf395748420a48c650.jpg","description":"One of TIME’s top ten games of 2016, Burly Men at Sea is a folktale about a trio of large, bearded fishermen who step away from the ordinary to seek adventure.\nSet in the waters of early 20th-century Scandinavia, the game's story branches through a series of encounters with creatures from folklore. You play as storyteller and wayfinder, shaping the narrative around three ungainly heroes. Play through once for a single tale, then set sail again to uncover paths to new adventures.FEATURES\nBranching Story: Play through multiple choice-driven adventures, each designed to be completed in a single sitting.\nInnovative Controls: Shape the narrative through a unique, draggable viewport and your interactions within it.\nPlayful Aesthetic: Colorful art style with handcrafted animation, set to a whimsical original soundtrack inspired by the game’s Scandinavian setting.ABOUT THE DEVELOPER\nBurly Men at Sea is the second game from husband-and-wife team Brain&Brain, developed during their own adventures as nomads and erstwhile farmhands.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Seaven Studio","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":412477,"name":"Skul: The Hero Slayer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4f0/4f0a1619ca566080c9f3bb1e813bd6f6.jpg","description":"Guide 'Skul' on his quest to single-handedly take on the Imperial Army and rescue his King from captivity, in an action-packed rogue-lite 2D platformer for the ages.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"SouthPAW Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":44741,"name":"Warhammer 40,000: Inquisitor - Martyr","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ac/2ac6a47029ea0e215ece015db1ff7722.jpg","description":"╔════════════════════════════════════════════════════════════╗\nBefore buying, please keep this in mind: Steam Early Access is for people who are willing to try an incomplete and unpolished game to help developers with feedback. If you're looking for a complete experience, please wait until the full release. You won't gain any advantage by buying early - Early Access doesn't provide an advantage in character progression, nor is it cheaper than the full game. All characters start with a clean slate with the full release, and there will be plenty of sales after release if you'd like a discount.\n╚════════════════════════════════════════════════════════════╝\nEnter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man.\nWarhammer 40,000: Inquisitor – Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the will of the Emperor even in the darkest reaches of the Imperium!THE NEXT MILESTONE IN THE EVOLUTION OF ARPGS\nThe first Action-RPG set in the grim future of the 41st Millennium takes the genre to its next level: an open-world sandbox game with a persistent universe with a huge variety of missions, tactical, brutal combat encounters in destructible environments and a storyline influenced by the community of players. Use the cover system for tactical advantage, shoot off limbs and perform executions in epic boss battles and become a Protector of any solar systems with your glorious actions!INQUISITORS: SECRET AGENTS AND SPECIALISTS\nForge your own playstyle with different character classes and specializations: hold your ground with the Crusader Inquisitor while enemies close in on you, bring in your finesse and cunning with the Death Cult Assassin background, or use the unspeakable powers of the Warp with the Primaris Psyker background. Choose from three specializations for each classes that fit your playstyle.TRAVERSE A WHOLE GALACTIC SECTOR\nExplore the Star Map of the vast Caligari Sector, travel in different subsectors and explore an immense amount of solar systems, visit a growing number of unique points of interests: investigate on different planets with distinctive terrain conditions, fight your way through corridors of infested Void Stations, abandoned Star Forts and other diverse environments!FIGHT THE CORRUPTION TOGETHER\nYou can go solo as a lonely Inquisitor, but you can also assemble a team of your friends! Play missions in co-operative mode with up to 4 team members, blast away your foes together claiming great rewards, and form Cabals to gather your close allies! Inquisitorial Cabals are groups of Inquisitors working together. Cabals can progress just like characters do, and being a member can often grant special missions. The Inquisition has a lot of different factions with different agendas, and Cabals sometimes clash with each other in the shadows.IMPROVE YOUR WEAPONS, CRAFT MISSIONS AND TWEAK YOUR SKILLS\nLooking for a specific loot or reward? Use Uther’s Tarot to set the conditions of your next mission, collect Blueprints and use Crafting to improve your equipment, and use the Inoculator to fine-tune your different skills. Choose your loadout to your advantage for each mission!A LIVING, EXPANDING WORLD\nWarhammer 40,000: Inquisitor – Martyr is an ever-growing, long-lasting experience. Expansions and regular free updates will introduce new enemy factions, new terrain settings, new missions and mission types, new story-driven investigations and new gameplay features.\nSeasons are big, free updates that will introduce longer story arcs in which players can shape the persistent world of the Caligari sector with their actions. Daily Quests, Tiers and Power Levels ensure new challenges – there’s always something new to explore or to collect!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NeoCoreGames","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9754,"name":"Unfortunate Spacemen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/737/737df20717c559152ce159d809c1e5fd.jpg","description":"Unfortunate Spacemen is a multiplayer game about space-based murder in space! Spacemen work diligently to be rescued from their failing outpost, but not everyone is who they claim to be...\nForm alliances with other Spacemen and complete objectives, or, if you're not so human -- blend in, disguise yourself, and sabotage plans, betraying your friends and allies in the most gruesome ways imaginable. Death is part of life in space, and you're no exception to the rule. Paranoia runs rampant.\nAre you the victim, or the cause?\nCheck out our Development Starmap to see our full plans!\nCurrent Features: Survive, hunt, or escape on desolate settlements, arctic outposts, derelict space stations, warp-speed hypertrains, or ancient digsites on alien worlds. 14 maps are available right now, with more currently in development, and even more planned after that! (New maps are always FREE!)\nAs a Spaceman, complete objectives to call down the Rescue Shuttle, or hunt the Monster in packs!\nProximity Chat: All in-game communication fades with distance from the speaker, so you can roam, sneak, hide, and eavesdrop as you hunt or run from other players!\nMimic and devour your 'fellow' Spacemen as the Monster from the blackest reaches of the galaxy! Lay eggs, disguise as other players, transform into your hideous Monster Form, and more!\nProtect or betray your allies with at least a dozen unique tools, weapons, and items!\nRank up through The Company to unlock new customization and perks to customize your playstyle!\nSecurity Guards (Bots) roam the facility with diverse personalities. Use them to help learn the ropes and practice, or just add more chaos to a multiplayer game!\nSupports up to 32 players in a single game!\nRandomized objectives every time you play. No two rounds play exactly the same!\nCustomize your Spaceman (or Spacewoman) to stand out, or blend in!\nAdditional Co-op Survival Mode: Survive with your friends against progressively more difficult waves of enemies!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sandswept","platforms":[{"id":0,"name":"PC"}]},{"id":58869,"name":"Overload - Playable Teaser","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d78/d780252de14a2d9d7a53284bd32d6b94.jpg","description":"Overload is a new six-degree-of-freedom shooter from the creators of Descent. This Playable Teaser gives a taste of game including one single-player-style level and two Challenge Mode levels. Earlier versions of this demo were released in March 2016 and March 2017. Features included in the version are essentially the same as they will be in the full version.\nOverload is an intense combat game that takes place in a full-3D world. The full game will feature:\n- Single-player story campaign with 15+ FULL-SIZE atmospheric levels\n- Upgradeable player ship and 12+ weapons with multiple upgrade options\n- More than a dozen unique robots with multiple variants, and 3 massive bosses\n- Story by the writer of FREESPACE 2, plus pulse-pounding soundtrack\n- Multiplayer, including free-for-all and team modes\n- Expanded Challenge Mode with Countdown variant, lots of levels, and online leaderboards\n- Easy-to-use custom Level Editor (post-release) so you can build and share levels\nThis demo contains a training level, a sample single-player \"destroy the reactor\" level, and two Challenge Mode levels that let you test your skills against a horde of enemies.\nIf you like the demo, check out the full version!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Revival Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":28454,"name":"The Witcher 2: Assassins of Kings","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bba/bba9dff323894856be2b2638f2b8aed0.jpg","description":"The Games on Demand version supports English.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  The Witcher 2: Assassins of Kings features a thoroughly engrossing, mature storyline that defines a new standard for realistic,non-linear game narration. In addition to an epic story, the game features a complex combat system that uniquely combines deep tactical elements with dynamic action.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":15850,"name":"STAR WARS Galactic Battlegrounds Saga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de3/de3dba52972b129f3f01365fbab5feb5_FuRTucc.jpg","description":"The destiny of a galaxy hangs in the balance, and you are in command!\nLead the great armies of the Star Wars™ Episode II: Attack of the Clones saga in intense real-time strategy clashes. Enter the fray as the Galactic Empire, Rebel Alliance, Wookies, Trade Federation, Gungans or Royal Naboo to determine the course of the Galactic Civil War.\nExpand the battlefield with the Clone Campaigns addon. Choose to play as the breakaway Confederacy of Independent Systems or the Galactic Republic in 14 missions based on characters, vehicles and locations from Star Wars Episode II: Attack of the Clones.\nExecute campaigns over land, sea, and air in single-player campaigns, skirmishes, and multiplayer battles.\nCombat arenas extend from interstellar asteroids to epic ground battles to aquatic realms.\nDeploy vast armies up to 200 units per side - that can include Bounty Hunters, Jedi, Droids™, Wookiee Kat tanks and much more.\nManage resources and upgradable technology into your strategy, such as Wookie ingenuity, advanced Gungan biotechnology and Jedi stamina.\nCreate custom single or multiplayer campaigns featuring virtually any Star Wars units and settings with the Scenario Editor.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Lucasfilm","platforms":[{"id":0,"name":"PC"}]},{"id":2350,"name":"Guilty Gear Xrd -REVELATOR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8c/d8cd8eba6f989fa822ea05fbde564d35.jpg","description":"Digital Deluxe EditionThe Deluxe Edition comes with the following DLC contents already in-game for you!\n- Additional Playable Characters \"Kum Haehyun\", \"Dizzy\" and \"Raven\"\n- System Voice Pack (All characters)\n- Character Colors Pack (All characters, 6 additional colors each)\n- Arrange Costume Set for Elphelt\nAbout the GameRevolutionary 3D cell-animation graphics further refined, and more game contents added! The next-generation fighting game \"GUILTY GEAR Xrd -REVELATOR-\" is now out on Steam!\nCarrying on the legacy from 1998, comes the next addition to the \"Guilty Gear\" series! All visuals have been tweaked to the finest detail and hand-polished by the animation masters to produce the top quality hand-drawn anime effect! Game contents revamped to provide for gamers of all skill levels, you cannot miss out on this one!\nTotally unique cast of 23 characters!In \"REVELATOR\" we have 6 new characters from the previous of the series, namely \"Johnny\", \"Jack-O'\", \"Kuradoberi Jam\", \"Kum Haehyun\", \"Raven\" and \"Dizzy\", coming to a total number of 23 playable characters!\n*\"Kum Haehyun\", \"Raven\" and \"Dizzy\" can be unlocked by purchasing their respective DLCs. \"Raven\" can also be unlocked using in-game currency.\nExtensive Game ModesBeginners can feel at ease with our step-by-step training program, from Tutorial Mode being remodified into an action game to learn the ropes, to the introduction of Stylish Mode that allows easy inputs for Special Attacks, and many more! You can also visit the in-game FAQ to find out answers to popular questions on how to get strong!\nFor players who already somewhat know their bearings in Fighting Games, we have the COMBO mode to teach all characters' worth of their combo potentials, and the MISSION mode to teach about the characters' general tactics and techniques. There's also the staple \"TRAINING\" mode, equipped with tons of features that allow you to recreate the situation of your choice, so as to allow you to train and research!\nThe well-received STORY mode is now back with more punch! Fully cinematic with the 3D graphics engine, explore the lore and find out.. the REVELATIONS of \"Guilty Gear\". There's also a short introduction to the past series at the start of the story mode, so players new to the series need not fret!\nONLINE ModePlace your personal ranking score on the stake and battle with other players in \"Rank Match\", or simply enjoy the new \"Player Match\" mode without any frets!\nIn \"Player Match\" mode, you can walk around with your own customizable avatars and communicate with other players in the 3D room environment.\nYou can also place an entry in the \"Rank Match\" and proceed to play other offline game modes such as TRAINING mode, while waiting for your entry to be paired up.\nThe replays stored from your matches do not only show the match as-is, but you can also view both you and your opponent's key inputs, and you can change the camera angle to view the battle from a different perspective!\n*Cross-platform to PS3/4 is not supported.\nDon't know where to put in your effort? We'll show you the way! Be a formidable player in no time with our content-packed support features, in \"GUILTY GEAR Xrd -REVELATOR-\"!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Arc System Works","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":63845,"name":"Tails Noir","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/639/63907c46573df93d2d2f65e9fff4f284.jpg","description":"Backbone is a pixel art cinematic adventure with stealth and action elements. As private investigator Howard Lotor, you are set to solve detective cases, interrogate witnesses, explore the intriguing and dangerous world around you, and sneak your way to safety using smell-based stealth mechanics.\nBackbone combines the visual and social contrasts of film noir with anthropomorphic animals, retrofuturistic technologies, and dystopian fiction. Crawl through the dark alleys of pixelated Vancouver, and experience the impactful storyline focused on themes of power and prejudice.\nTHE GAME\nA rich, living and breathing world waiting to be explored. Backbone takes place in dystopian Vancouver, BC, featuring real locations and breathtaking pixel landscapes.\nA stylistic and thematic fusion of film noir, anthropomorphic animals, retrofuturism and dystopian classics. The world of Backbone is something you’ve never seen before but always wished you had.\nChallenging, thought-provoking storyline featuring themes of power, corruption, social decay and systemic discrimination. Backbone tells a tale about how our environment shapes us, and how we influence it in return.\nGAMEPLAY\nDetective work. Collect evidence, interrogate witnesses, connect the dots and follow leads on your own. No hand-holding - move forward through the game by your own rules. Every case has numerous trails, and it’s up to you to decide which one to follow.\nStealth & Action. In the animal world, smell is the most powerful sense. Hide in multi-level environments, mask your scent in garbage bins, follow suspects and escape the chase.\nSpecial abilities. The Artifact is a unique ancient technology with unknown origins and purpose. If you learn how to use it, it might change the regular order or destroy it.\nTHE STORY\nThe planet is sprawling with anthropomorphic animal species. The streets of Vancouver are overgrown with ivy and humongous trees, branches and vines piercing through the concrete, and huge flowers nesting on top of the roofs.\nThe Great Apes call themselves the founding fathers of this world, and they are the moral, ethical and political compass of society. Citizens are divided into informal classes according to their species. The political and underground power is corrupted, and the glass ceiling seems impossible to break.\nVancouver is surrounded by high walls from every side to make sure that no one from across it intrudes. It is strictly forbidden to cross the wall, and the only thing waiting outside is savage hostile creatures.\nHoward Lotor is a raccoon and a private investigator who doesn't feel like he belongs. His mundane life is interrupted with the appearance of a powerful technology that can blur the lines of conventional order and change society forever.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"EggNut","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":15396,"name":"Influent","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/083/0830a4bb6fb67ce5acc2db44098186d3.jpg","description":"“By immersing the player in the target language, Influent closely models the way we naturally learn our native language. I suggest giving Influent a try.”\n-Steve Hammond, Somnambulant-Gamer\nInspired by Dreamcast titles of old (namely Shenmue and Toy Commander) Influent immerses players in a fully interactive 3D environment where the names for absolutely every object in the game can be gleaned with a single click! In fact, even more information can be learned with a double-click! Every door, drawer, and cabinet can be opened with a right-click here and a right-click there, revealing more and more things to be learned! Packed to the brim with hundreds of native audio pronunciations (painstakingly recorded specifically for this game), Influent offers players a unique opportunity to enjoy learning both vocabulary and pronunciation in the language of their choice.\nWith 10 languages currently available for download, Influent combines the joys of playing a video game with the language learning process, resulting in real-life rewards and achievements that will remain with players for the rest of their lives.\nInfluent: Language Learning Redefined.\nAudio from native speakers\nSynonym swap functionality\nLearn at your own pace!\nFully interactive modern apartment\nOver 420 words to collect and master\nIncludes Nouns, Adjectives, and Verbs\n15+ Languages to choose from (more coming soon!)\nHow exactly should I purchase the game?If you're confused about how to purchase the game, please read the following example about Mark and Patricia.\nIf Mark wants to learn Latin, he should purchase the \"Influent - Latina [Learn Latin]\" store item. If his wife Patricia then wants to learn Swedish, Mark should then purchase the DLC store item entitled \"Influent DLC - Svenska [Learn Swedish].\" This can also be done from Patricia's perspective and will have the exact same result with Patricia purchasing the Swedish base game and then also buying the Latin DLC for Mark, herself, or even anyone else, to use on the same computer.\nDo you have plans to release more languages? When???New Language Packs will be released as they are completed. A full list of languages that are coming soon can be found on the Official Website.\nCheck out the Community Hub for Frequently Asked Questions and other cool stuff!A BRIEF BACKGROUND\nInfluent is a Language Learning Game focusing primarily on vocabulary acquisition and pronunciation. It was initially developed in Japan at the University of Tsukuba's Entertainment Computing Laboratory under the Monbukagakusho Government Research Scholarship.\nAfter research funding ran out, further funding from a wildly successful Kickstarter Campaign allowed for the completion of the game. A research paper on the ideas surrounding the game and its applications was published by the Information Processing Society of Japan (IPSJ), which can be viewed in its entirety here.\nAndrew Cross is infuriated!\nFor three long years, he sat confined to his work, developing a device that he firmly believed to be a technological breakthrough in the way people would interact with the world around them. A device that could scan any object in the real world and then provide its name in any language! Duly dubbing his fancy new invention the \"SanjigenJiten,\" Andrew arranged an appointment to demonstrate the device's amazing capabilities at the world's largest technology corporation, Technoglobe International.\nBut while on his visit, he fell for a girl he met in the lab, and while she stole his heart, someone else silently stepped in and stole his device! Now, Technoglobe has gone and swiftly marketed the SanjigenJiten as their own, even laying claim to the very name he had so cleverly concocted!\nBut Andrew Cross has a plan. He's made an even better version of his SanjigenJiten and launched an online campaign, swearing to learn 300 words in a foreign language to raise awareness of Technoglobe's blatant theft and prove his device really works! But does the SanjigenJiten really work? Can Andrew actually pull it off?!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rob Howland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":5717,"name":"Max: The Curse of Brotherhood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53a/53a98929b8c944db6522487896fd9264.jpg","description":"Max: The Curse of Brotherhood of an action-adventure platformer game developed by Press Play. It is a sequel to Max & the Magic Marker released in 2010.\n\n###Plot\nOne day, Max comes back from school and finds out that his younger brother Felix broke some of his favorite toys. Annoyed with his brother, Max looks for a way to get rid of him on the internet and stumbles upon a spell that is promised to make Max's brother disappear upon casting. When Max cast the spell, a giant claw comes through a portal and takes Felix. Max changes his mind and goes on to save his brother.\n\n###Gameplay\nThe core mechanics of Max: The Curse of Brotherhood revolves around solving puzzles that are solved using physics in a 2.5-dimensional world with a free player-controlled camera. There are 20 levels in the game which are divided into seven chapters. All the levels are tied together in a way they feel like one whole journey. \n\nThe main feature of the game's gameplay is a magic marker that adds a creative and open-ended approach to the game's puzzles. This marker is used to create material objects in specific places to use them to solve a puzzle. For example, the objects created by the marker can be used as a boosting platform to reach a previously unreachable spot and take a necessary item.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Stage Clear Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":59288,"name":"The Bard's Tale Trilogy","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/65a/65ae7b73e58678f76555090e478dd167.jpg","description":"Experience the events that led to The Bard’s Tale IV: Barrows Deep and The Mage’s Tale! The Bard's Tale Trilogy is a remastering of the classic 1980’s series, one of the godfathers of the RPG genre. Create an adventuring party in the first volume and play it across all three, creating a heroic story all your own!\nThe Bard’s Tale Trilogy launches with the first volume in the series. In the fall, The Bard’s Tale II: The Destiny Knight will be added. Finally, late in the year, The Bard’s Tale III: Thief of Fate. Each volume will be added into the collection free of charge!\nRescue a city trapped by a wizard, reforge the legendary Destiny Wand, and travel across time and space to confront a Mad God!\nEnjoy a uniform playing experience across all three titles without the need for emulation or compatibility concerns.\nFor the first time, play as male or female across all three games! Also includes other quality of life changes such as automapping for all three games, spell access, and updated equipment/inventory management.\nThe final game content released will be the Legacy Mode, a suite of features which will allow veteran players to experience the games similar to how they first played them, and will be released free of charge for owners when complete.\nThe Bard's Tale Trilogy is a chance for old fans to be young once again and for a new generation of roleplaying and dungeon crawler fans to discover why these games matter so much all these years later. Pick up the game and start your epic adventure today!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Krome Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":53473,"name":"Pokémon FireRed, LeafGreen","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf7/bf76ba791262ca3a3580fc776bdecb87.jpg","description":"Pokémon FireRed Version and LeafGreen Version are enhanced remakes of the original Pokémon Red and Blue video games, which were released in 1996. The new titles were developed by Game Freak, published by The Pokémon Company and distributed by Nintendo for the Game Boy Advance and have compatibility with the Game Boy Advance Wireless Adapter, which originally came bundled with the games. FireRed and LeafGreen were first released in Japan in January 2004 and released in North America and Europe in September and October respectively. Nearly two years after their original release, Nintendo re-marketed them as Player's Choice titles. The two games hold the distinction of being the first enhanced remakes of previous games within the franchise.\nFireRed and LeafGreen are members of the Pokémon series of role-playing video games. As in previous games, the player controls the player character from an overhead perspective and participates in turn-based combat encounters. However, new features such as a contextual help menu and a new region the player may access have also been added. Throughout the games, the player captures and raises Pokémon for use in battle.\nThe games received mostly positive reviews, obtaining an aggregate score of 81 percent on Metacritic. Most critics praised the fact that the games introduced new features while still maintaining the traditional gameplay of the series. Reception of the graphics and audio was more mixed, with some reviewers complaining that they were too simplistic and lacked improvement compared to the previous games, Pokémon Ruby and Sapphire. FireRed and LeafGreen were commercial successes, selling a total of around 12 million copies worldwide.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Game Freak","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":22572,"name":"Aven Colony","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ed/9ed4595b0d769ff3085329f58b919902.jpg","description":"Build a new home for humanity with Aven Colony.\nDiscover Aven Prime - an alien planet of deserts, tundras, and jungles light years from earth. Aven Colony puts you in charge of humanity's first extrasolar settlement, where you build and expand your small colonies into massive, sprawling cities while dealing with the challenges faced when settling on a new world.\nBuild your colony's infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity against the backdrop of the harsh and often dangerous realities of the exotic world of Aven Prime.KEY FEATURES:COLONIZE AN ALIEN WORLD: Build a new home for humanity on a world with a low-oxygen atmosphere, extreme electrical storms, shard storms, dust devils, deadly toxic gas eruptions from geothermal vents, and days so long they have their own seasons. Explore a variety of biomes, from the lush wetlands environment to the much less habitable desert and arctic.\nMEET THE LOCALS: Encounter a variety of alien life forms, including giant sandworms, deadly plague spores, and a vicious fungal infection known as “The Creep.”\nSUPERVISE YOUR COLONISTS: Settling a new world can be stressful. As a new Colony Governor, you’ll need to work overtime to help your colonists deal with their new environment. Using the 12 distinct \"overlay\" modes, you can mange your colony's Crops, Citizens, Happiness, Crime, Air, Electricity, Employment, Resources, Commute, Structures, Drones, and Water. Earn the respect of your colonists, and rise in rank from Colony Governor to Expedition President!\nDISCOVER THE PAST: The world of Aven Prime holds many secrets. Play through a full single-player campaign and participate in a story that reveals some of the many secrets of this brave new world.\nBUILD THE FUTURE: Use construction drones to build dozens of types of structures to house your colonists, establish trading routes, welcome immigrants and much more! Enhance your existing buildings through several upgrade tiers to push your colony to new heights!\nEXPEDITION SYSTEM: Deploy your crack team of pioneers to explore alien ruins, recover artifacts, repair crashed vessels and rescue lost explorers. Get ready to take on plague and creep spore nests whilst fending off splinter groups, rebels and Aven Prime's remaining robot guardians which threaten your new civilisation.\nPREPARE FOR WINTER: A fully functional day/night and seasonal cycle. During the winter Aven Prime freezes over - farms will not grow food and solar panels will generate far less electricity. Take measures to survive this harsh climate!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":388,"name":"Vertical Drop Heroes HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c9/6c9bbcb6b828190345935ebcf82866ec.jpg","description":"Vertical Drop Heroes HD is a rogue-like RPG with a procedurally generated environment. This is the remake of a web-platformer in HD quality.\n\n###Gameplay\nThe player takes a role of the famous dungeon explorer set to go as far as he can in his explorations. The protagonist — his name always varies depending on the skills and background chosen — examines the 2D levels consisting of destructible and indestructible blocks filled with enemies.\nThere is a variety of spells, weaponry, and foes usual to RPGs. Every once in a while a player encounters a boss. All the progress except for the skill points is lost after death. Between the respawns the protagonist can upgrade the level of his successors using the goods he found on his previous dungeon run.\nThe title feature split-screen cooperative and online multiplayer for a maximum of 4 characters. The game is highly replayable due to the procedurally generated of the environment. The game suggests only going down into the dungeon thus the name. The skills may bring variety into descending every time.\n\n###Plot\nContrary to the most rogue-likes where the successors of the protagonist are presented as his offsprings, here we have the prophecy of a great hero and some kamikazes who suddenly thought it is a tale about them — so the succession does not last long hence the immersive mechanics work on the better level.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":244784,"name":"Felix The Reaper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e2/9e267ccfe4e20b95815791ab391252b2.jpg","description":"Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die and taught himself to dance to impress Betty.\nSince Felix only moves in the shadows, he needs to manipulate those shadows to move around. Luckily reapers like Felix are able to turn the sun and move shadowing objects, which enables him to create the necessary shadow paths to get around. He does so to solve the adventure plots, that makes people die according to the ministerial plans.\nEach level unlocks a hardcore version of itself for the striving ministerial achiever. You can also collect skull achievements, that further unlock bonus time trials for the extremely resourceful ministerial employee.\n•\tChallenge yourself to original puzzle game mechanics\n•\tExperience a gruesomely sweet and beautiful story world\n•\tChoose your own tune from a selection of 10+ indie music artists on Felix‘ Walkman\n•\tCollect skull achievements that further unlock bonus time trials\n•\tWatch Felix‘ dance moves develop as created by professional dancers\nFelix The Reaper has sprung from a fascination with the sprawling, humorous and grotesque art history of Death. The history contains both The Dance of Death or Danse Macabre and Death And The Maiden as two central themes going through it. We sort of mashed those two together in Felix The Reaper.\nFor the character himself and the world around him the inspiration was more diverse: in that aspect, the game contains inspiration from the ancient tv-show The Twilight Zone, medieval painters like Bruegel and Bosch and the cartoon characters of Adventure Time and Hayao Miyazaki.\nAnother important inspiration for Felix The Reaper were the amazing artistic collaborators in the production. We've worked with dancers, a long list of music artists and historian scholars.The DanceSeveral dancers have been around throughout the production, and eventually Gunilla Lind and Raphaël Ferdinand Eder-Kastling improvised the final moves, that ended up in the game.\nHere's Gunilla doing a dance move for Felix:\nAnd here's Raphael doing another:\nThe MusicOf course a game with a dancing protagonist needs great music - why else would he be dancing? We designed the game in a way that lets the music artists be themselves. We wanted them to add to the game through their personal artistic expression, rather than ask them to be what we want them to be. That makes for a varied and strange combination of music. But since the gameplay is a non-stressful puzzler, you actually have time to appreciate and enjoy the weirdness while playing.The Art HistoryThe idea for the game itself stems from art history. We actually started with The Danse Macabre and Death and The Maiden as a basis and then asked ourselves: how can we make a game about this? Eventually and through several different prototypes, we ended up here.\nParallel to the production a historical scholar has dived into the art history of Death across more than 10 centuries for a book manuscript he is working on, and every time he hit upon something interesting he told us, and we tried to put it in the game, if it fit. There's five different articles by this historian Søren Hein Rasmussen within the game, that you can unlock as you progress.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":236851,"name":"Relicta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa0/fa03eca9d35297cab6768669bdaaa45c.jpg","description":"Relicta is a first-person physics-based puzzle game where you need to creatively combine magnetism and gravity in order to unravel the secrets of Chandra Base. Alone in the treacherous depths of the Moon, your scientific mind is the only thing that can keep your daughter alive…\nPlay as a top physicist stranded on an eerie, derelict Moon base. Find your way around the enigmatic, terraformed craters by bending gravity and magnetism to your will in order to solve physical puzzles. Will you rush straight ahead and try to reach safety - or will you take your time to gather clues and unravel the intrigues of 22nd century orbital politics? Buried in the eternal darkness of the lunar craters lies a secret that might claim your daughter’s life - or change the fate of humanity forever. Are you ready to face the ultimate consequences of your research?Features:\nMind-bending mechanics - alter gravity and magnetism at will.\nComplex physical puzzles - combine your abilities in innovative ways to solve these physical riddles.\nLovingly detailed environments - each corner tells a story, each new step is a challenge.\nDeep and enigmatic background story - Find clues and piece together the details about the investigation of the Relicta's anomaly.\nImmersive original soundtrack - slip into the soundscapes of an sci-fi psychological thriller.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mighty Polygon","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":51877,"name":"Heaven's Vault","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df6/df60abe956af265beb549507464df2f7.jpg","description":"Aliya Elasra is an archaeologist, exploring a strange region of space called the Nebula with her robot sidekick Six, hoping to uncover the secrets of the long-forgotten past. When a roboticist from the University of Iox goes missing, Aliya begins a trail of discoveries that will lead to the very edge of her world - and the ancient secret of Heaven's Vault.\r\nSail an open-world of fast flowing space-rivers, discover lost ruins, explore ancient sites, find artefacts and translate their strange hieroglyphics. Piece together the history of the world and an entire alien language.\r\nFrom the creators of massively-branching interactive adventure 80 Days, Heaven's Vault is not your usual linear adventure game. Progress through the game in any order you choose - the game's fully adaptive narrative remembers every choice you make, every discovery and every action you take, influencing what happens next. Meet a diverse cast of characters who remember everything you say, and who's attitude to you will change with how you act. Some are friendly, some are cautious, and some are out to trick you.\r\nWho will you trust? What will you find? What will you learn? What will you risk? What will you lose?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"inkle","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15314,"name":"Train Valley","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a86/a8614f4b380f92de8d77145f1e91ca98.jpg","description":"Train Valley 2http://store.steampowered.com/app/602320/\nNew DLC Available\nAbout the Game\nBuild railroads in order to connect cities, tunnels and bridges. New railways are cheap when laid across bare fields, but can be expensive when demolishing forests, villages and other existing structures.\nManage increasing traffic by constructing, switches, sidings and spurs so that multiple trains can run without delays, at the same time.\nStay accident-free by precisely controlling trains during crucial moments, using pause for planning (you can build railways and schedule trains while on pause).\nPlay through 4 seasons: Europe (1830–1980), America (1840–1960), USSR (1880–1980) and Japan (1900–2020).\nComplete the story mode featuring such real-life events as the Gold Rush of 1849, the construction of the Florida Overseas Railroad, World War II, the Cold War, the launch of the first manned space flight Vostok 1 and more.\nExplore the game in different game modes: in story mode (5-10 minutes), in random mode (15-20 minutes – the level looks and develops differently every time you launch) or in sandbox-like regime (can be turned on for both story and random modes. It allows to play without time and money limits).\nDiscover 15 types of trains – from early steam-powered locomotives to modern high-speed trains, driving 18 types of cars – from old-time passenger cars to hoppers and cisterns and to military-use tank and gun platforms.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alexey Davydov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":563419,"name":"The Life and Suffering of Sir Brante","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4e/b4ebda18f8336b70c308594d2b695415.jpg","description":"The Life and Suffering of Sir Brante is a narrative-driven RPG that comes to life on the pages of the protagonist's journal. Set in a ruthless world where any form of dissent is mercilessly crushed, the story follows a man who has dared to challenge the existing order. Set out on a lifelong journey and become an individual able to carve out their own destiny... But remember that freedom never comes cheap.\r\nLife in the Great Arknian Empire is harsh and its hardest Lot is yours by the circumstance of birth. You are a commoner, holding no rights and no title. To seize your fate and become the rightful heir to the legacy of the Brante family you will have to come to grips with ossified tradition and prejudice. Embarking on a life-long journey from one's birth until true death, you will have to endure great upheavals, face adversity, and make many difficult choices. Every decision will affect not only the protagonist, his family, and loved ones, but may even topple the foundation of the Empire itself.\r\nKey features\r\nAt the turn of time\r\nEvery imperial citizen's life is predetermined by their estate. The deities known as the Twin Gods have bestowed this truth to the world, dividing mortals into Lots. The nobles lead and rule over others, while the clergy guides people on the one true path, and the lowborn suffer, toiling away for the glory of the Empire. You may accept your fate without question, but it is also in your power to change the cosmic order that governs all.\r\nYour choice is not an illusion\r\nDivided into chapters, the game keeps track of the player's deeds, the skills they acquired, as well as other overlapping circumstances that shape a unique plotline for each playthrough. Every decision has its consequences and you will be held accountable throughout the entire journey. To protect your family and loved ones, to impose the rule of the Emperor and make a fortune, or to try and change the world as you see fit... Make your choice, but beware of the follies of pride and ambition.\r\nFind your own path\r\nThe first complete walkthrough can take you upwards of 15 hours! The unpredictable conclusion to the game's story hinges solely on your actions: the fates of your character and members of his family, their friends and rivals, as well as the outcome of the monumental events that shall determine the future of the Empire – you can decide it all!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sever","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":349439,"name":"The Henry Stickmin Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/783/78307bba97b1abbe9ade8f72228bcc7c.jpg","description":"The Henry Stickmin Collection is a Newgrounds choose-your-own-path classic, reborn and revitalized. This 6-game epic culminates in multiple entirely canon, extremely different endings. Each step of the journey has you choose from options such as a Teleporter or calling in your buddy Charles to help you out. Correct choices will move the story forward, but incorrect choices lead to a fail. If you get to the end on your first try, you’re doing it wrong. Failing is half the fun.An Old Series, RemasteredThe Henry Stickmin games have seen some good times on the internet, but age has not been kind. Breaking the Bank has been completely reanimated from scratch. Escaping the Prison, Stealing the Diamond, Infiltrating the Airship and Fleeing the Complex have all had their backgrounds and sound effects redone!\nA Grand FinaleA final game, Completing the Mission, is is featured in this collection. It's brand new, never before seen online! Cap off the series with a game 3x bigger than any of the previous games in the series.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"PuffballsUnited","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":61152,"name":"Green Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afa/afafe78f1c6356cc423b1ec9a68f9c7d.jpg","description":"GREEN HELL is an Open World Survival Simulator set in the uncharted unique setting of the Amazonian rainforest.\n\nYou are left alone in the jungle without any food or equipment, trying to survive and find your way out. Clinging to life, the player is set on a journey of durability as the effects of solitude wear heavy not only on the body but also the mind. How long can you survive against the dangers of the unknown?\n\nOn this journey, you won’t get any help from the outside world. Equipped only with your bare hands you’ll have to learn actual survival techniques to build shelters, make tools, and craft weapons in order to hunt and defend yourself. Constantly threatened by the jungle you’ll fight with both wild animals and tropical sicknesses. Players will also have to face the traps set by your own mind and fears that crawl in the darkness of the endless jungle.\n\nSTORY\n\nYou are thrown deep into the emerald and impenetrable Amazonian rain forest. The green hell. Your goal is to survive in the depths of a nightmarish environment using truly intuitive means to escape. Having only a radio at your disposal you will follow the familiar voice of a loved one through this endless and inhospitable jungle, unveiling bit by bit how you got there in the first place. What you discover will be worse than what you fought so hard against to survive.\n\nTHE QUESTION\n\nWhere can the human mind wander?\n\nGAME PILLARS\n\nREALISTIC SURVIVAL SIM\n\n• Use of true survival techniques (including starting fires, camp building, animal traps construction)\n• Sourcing and composing objects allowing survival (including weapons and tools)\n• Food sourcing (hunting, cropping)\n• Wound, disease and other injuries treatment, depending on the situation\n\nPSYCHOLOGICAL THRILLER\n\nGreen Hell's story emphasizes psychological aspects of survival in extreme conditions. The player faces a ruthless situation, isolated, and fighting to survive another day. The players battle will not only be against the environment as you fight to keep your sanity. Will you succeed or fall into the depths of your mind? To unveil the truth the player will have to fight the hardest battle they will ever fight - the fight against themselves, their weaknesses and fears.\n\nAMAZONIAN RAINFOREST SETTING\n\nAmazonian rainforest is the richest natural environment in the world. Exotically breathtaking, spectacular, multicolored, full of tones and sounds but mortal, deadly, uncompromising for the ignorant.\n\n• Part of the Amazonian rainforest as a map of the world for the setting\n• The richness of plants and multitude of animal species (mammals, reptiles, birds, and insects)\n• Simulation of animals natural occurrence and behavior\n• Dynamically changing environment due to the weather\n\nUNIQUE MECHANICS\n\nSurvival in such extreme conditions requires willpower - without it we are sentenced only to madness and death. In green Hell, your wellbeing, both physical and psychological, are strictly related. Body inspection mode allows the player to diagnose themselves and heal their body. In this mode, we can also remove all kinds of parasites that decided to make a home out of your body.\n\nPsychophysical parameters of the player include:\n\n• psychological condition\n• physical condition\n\nUNIQUE FEATURES\n\n• Setting: deadly yet beautiful Amazonian rainforest\n• Body inspection mode\n• A multitude of fauna and flora and the dangers awaiting the player\n• Environment and situation impact on the player’s psychology\n• Impact of environment changes to the ecosystem\n• An addictive story\n• Dynamically changing environment","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Creepy Jar","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":45239,"name":"Interplanetary: Enhanced Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/331/33157c45aaa7caceaac95af348a06b96.jpg","description":"Interplanetary is a turn-based strategic artillery game on a cosmic scale. Develop your home planet and use massive barrages to wage war on a galactic battlefield.\nIt's an arms race with each planet developing increasingly powerful weapons. Gigantic railgun batteries are the backbone of any interplanetary arsenal, but the cunning use of missiles and precision lasers may just hold the key to victory. Strategic build patterns, upgrades and defense structures might keep your vital installations standing long enough to give you an edge, but it's only a matter of time until all but one will fall.\nSometimes, your greatest foe is the planetary system itself! Don't let the unpredictable gravitational changes get the better of you—observe your surroundings, use them to your advantage, and blast your enemies back to the Stone Age!Key Features\n●\tChallenge your friends in hotseat or online matches, or fight skirmishes against the AI.\n●\tBuild and manage your planet's infrastructure.\n●\tGather resources and decide the most efficient use for them.\n●\tResearch and develop increasingly futuristic technologies.\n●\tSpy on your enemies to reveal the weak points of their infrastructure.\n●\tUse your artillery constructions to aim across the planetary system, avoiding other celestial bodies and their gravity.\n●\tFire your railguns, missiles and beam weapons to annihilate the enemy and claim the planetary system for your civilization!\nInterplanetary: Enhanced Edition, is a revised version of the original Interplanetary.\nThe no longer supported original is included in the Enhanced Edition for free, for the purposes of historical preservation and (hopefully) flattering comparison.\nThe Enhanced Edition features include: Online AI Bots, Elliptic Orbits, Quick Targeting Mode, New Buildings, rebalancing and general fixes and improvements across the board.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team Jolly Roger","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":566454,"name":"Aliens: Fireteam Elite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bb8/bb8a1de04cf151b55bcb9b5a38ba9a0b.jpg","description":"A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival.\r\n\r\nSet in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival shooter that drops your fireteam of hardened marines into a desperate fight to contain the Xenomorph threat.\r\n\r\nFace off against waves of terrifying Xenomorph and Weyland-Yutani Synthetic foes alongside two players or AI teammates, as you and your fireteam desperately fight your way through four unique campaigns that introduce new storylines to the Alien universe. Create and customize your own Colonial Marine, choosing from an extensive variety of classes, weapons, gear and perks, battling overwhelming odds in this heart-pounding survival shooter experience.\r\n\r\nTHE ULTIMATE HUNT\r\nPlay a pivotal role in the epic events that occur 23 years after the original Alien trilogy as a Colonial Marine stationed aboard the USS Endeavor, battling terrifying Xenomorph threats. Stunning visuals, iconic enemies, realistic environments, powerful weapons, futuristic equipment, and an eerie soundscape fill out new storylines in a series of replayable campaigns that evoke and expand upon the blockbuster films.\r\n\r\nSURVIVE THE HIVE\r\nFace overwhelming odds against over 20 enemy types, including 11 different Xenomorphs along the evolutionary scale from Facehuggers to Praetorians, each designed with their own intelligence to ambush, outsmart and eviscerate vulnerable marines. Utilize cover and master team strategy to survive extraterrestrial threats as they overrun your fireteam from every angle, swarm through doors and vents, scramble across walls and ceilings, and strike from darkness with uncanny ferocity.\r\n\r\nCUSTOMIZE YOUR FIRETEAM\r\nChoose from five unique classes - Gunner, Demolisher, Technician, Doc and Recon - each with their own special abilities and character perks. Utilize an extensive arsenal of 30+ weapons and 70+ mods/attachments in your effort to eradicate the Alien threat. An innovative Perk Board modifies and improves your abilities, while a unique Challenge Card system alters the approach to each Campaign mission, offering a new experience with every playthrough.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Cold Iron Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":16259,"name":"Journey of a Roach","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ffb/ffb203aefc6db84559c1eba386b3a99e.jpg","description":"Nuclear war, post apocalypse, barren and lifeless wastelands.\nLifeless? Not so much!\nMutated insects have made their home in a bomb shelter and they're set on exploring the world.\nLet this point&click adventure welcome you to a hilariously bizarre end time world and join the roaches Jim and Bud on their journey to the surface.\nJourney of a Roach tells the story of two roach-buddies, who want nothing but see the surface world.\nOn their way up, they meet all kinds of bizarre and ludicrous insects inhabiting the post-apocalyptic earth. In atmospheric 3D point&click adventure style you'll take control of Jim the roach through the bomb shelter, effortlessly crawling your way along walls and ceilings. This innovative and dynamic game mechanic creates opportunities for a wholly new puzzle design. Fondly designed speechballoons offer an unconventional new dialogue experience and the soundtrack delivers and atmospheric, post-apocalyptic mood.Key Features\nPoint&click Adventure in a unique environment\nCrawl along walls and ceilings, exploring secret underground\nInnovative controls create dynamic game mechanics\nAtmospheric 3D comic style world\nTwo charming, memorable protagonists with humorous, nonverbal means of communication","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3518,"name":"Toybox Turbos","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/647/6475e0d23febb7d932037f1c10671969.jpg","description":"Fire up the fun as Codemasters reboots the classic table top racing experience in Toybox Turbos – now updated to support the Oculus Rift Development Kit 2 (DK2) virtual reality headset for incredible immersion!\nCollect and customize 35 vehicles in this pick-up-and-play arcade racer. Take on 18 obstacle and short-cut filled circuits built for chaotic, combative competition – speed past spilt sticky jam on the kitchen table, dodge flaming Bunsen burners as you take your opponents back to school and dodge the runaway train as you race around a railway set!\nStay on track by using a range of awesome and ridiculous power-ups to send your rivals into a spin, including mines, machine guns and, of course, giant car-mounted hammers.\nMaster six game modes in the single-player game, then turn friends into foes in manic four player multiplayer - local, online or with a mix -  perfect for those one-more-go gaming session that race into the night!\nToybox Turbos – the top-down racing game bursting with miniaturized mayhem, featuring dinosaurs, combine harvesters, golf-buggies and so MUCH more!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":17097,"name":"Goetia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ae/6ae179d89d253b92542849ad73c72569.jpg","description":"The ruins of any village are the silent testament to its final moments. The ruins of Oakmarsh are no different. Their telling silence, the dust blanketing what was once a quiet village near Coventry.\nThe name of a manor and the family that lived within. A perverted and mad lineage, a clan whose final members devoted their life to mysticism and fanatical experiments. I am Abigail. Abigail Blackwood. Recently risen from the grave, I know nothing about the last 40 years of my family’s history... But obviously somebody is keen on seeing me lift the veil on what happened in Oakmarsh - to what led to the downfall of Blackwood Manor. And it seems like I have no choice in the matter…\nKey Features\nA 2D world of Victorian mystery.\nOver 90 rooms to explore.\nFive vast and diverse areas to discover - Blackwood Manor is surrounded by ruins, woods, caves and an abandoned village.\nA progressive-rock and ambient-inspired soundtrack.\nUse your ability to walk through walls in order to reach secret rooms and areas.\nPossess objects like a poltergeist to lift them, use them, combine them, make them float in the air, pile them up… well, you’re a ghost after all, behave like one!\nSolve puzzles in more than one way by discovering hidden rooms and special features, such as new ghostly powers.\nDelve into Blackwood’s story: 40 years have passed, and many things have changed since Abigail’s death.\nFeel free to explore! You can travel through the world of Goetia however you like - and if you get stuck, simply backtrack and explore another area.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":10993,"name":"Redout: Lightspeed Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df5/df546b4a1ff10907d653933fd172bf7d.jpg","description":"It Is a 3D flight shooter with third person front view. provides comfortable play with easy\noperation. the operating device can be played with the game pad or the keyboard.\n\nthe game system is arcade style, and each stage progresses nonstop. shoot down enemy\nplanes using vulcan and multi lock on missiles. there are 10 or more stages. .","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"34BigThings","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":9805,"name":"Tower Unite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7a/f7a6e262d7ede199f8a0b68d8cc9f43e.jpg","description":"Tower Unite is a living, evolving world, fueled by the community. Play online games with your friends or make new friends from around the world!\nTower Unite is a large online multiplayer game that spans genres.\nPlay minigames such as Minigolf, Ball Race, Virus, and more!\nEarn items\nHang with your friends in your own personalized house\nConnect with others through a massive Plaza with various attractions and games\nParty with friends!\nWatch synchronized media such as YouTube or Soundcloud\nSuggest new features - we listen!\nNo microtransactions or subscription fees\nTower Unite has many games to play, with more to come, such as...\nSupports up to 16 players online\n8 courses with 18 holes (144 holes total) and more in the works!\nBased on the original 2009 minigolf hit from GMod Tower that inspired other minigolf games\nUnique controls (100% skill, no timers)\nHole-in-one fireworks\nWear tiny hats on your golf ball\nPutt in snow, gardens, mines, sky, and even in space!\nSimultaneous putting (everyone putts at once!)\nPlayer hosted servers\nSupports up to 8 players online\n4 unique levels and more in the works!\nThrilling 1 vs All gameplay\nPlay as the Dragon and devour the knights\nTurn off the rampaging Dragon as the knights\nPlayer hosted servers\nSupports up to 16 players online\n8 unique worlds and more in the works!\nRoll around in a giant ball\nSpeed past tricky obstacles\nPlayer hosted servers\nSupports up to 12 players online\nSurvive in 5 unique levels and more in the works!\nFast paced old school first person shooting action\nBlast infected away with 12 sci-fi weapons\nTeam tag elimination, with weapons\nPlayer hosted servers\nSupports up to 8 players online\nBattle in teams as cat or dog in a struggle for the planet's resources\nFrantic gameplay with lots of sci-fi shooting\nPlayer hosted servers\nOnce you've played some of the games, head on over to your personal space...\nIn Tower Unite, everyone has their own personal space, called a Condo.\nPlace tons of different furniture and items\nWatch synchronized media such as YouTube\nPlace images from the internet directly into the game synced with online players\nListen to synchronized music with Soundcloud\nCustomize wallpapers, lights, and time of day\nInvite friends to party, chat, voice chat, drink, and eat virtual pizza!\nPlay instruments like a piano or drums\nInteract with various weird and cool items\nBuild unique creations\nGet a pet cat or dog\nCOMING SOON: Cook/craft food and new items\nFrom the Condo, you can exit through your front door into a bigger online experience called the Plaza. The Plaza acts as a gathering point, like a shopping mall.\nGamble at the Casino\nWalk along the Boardwalk and enjoy:\nLaser Tag\nBowling\nTrivia\nTyping Derby, a keyboard racing game\nFerris Wheel\nMonorail\nCOMING SOON: Bumper Cars\nCOMING SOON: Rollercoaster\nCOMING SOON: FishingWatch synchronized YouTube videos in the Theater\nUnlock new items at 15 different in-game stores\nConnect to the bigger Game Worlds\nCOMING SOON: Explore the ocean with your friends\nCOMING SOON: Play games at the Arcade\nVoice chat and text chat\nPlayer hosted serversDO MORE THAN OTHER VIRTUAL WORLD GAMESTower Unite isn't just a walk-around-and-chat simulator. You can run, jump, crouch, use jetpacks, get drunk, dance, sit, throw-up, lounge in pool tubes, and much much more.\nPlay multiplayer games of various genres online with friends.\nPlay online Minigolf with up to 16 players.\nCustomize yourself with accessories.\nFurnish and design the layout of your personal space (the Condo) with furniture and interactive toys.\nInvite other players over to your Condo for parties and mini-games.\nWatch synchronized YouTube videos in a virtual theater or your Condo.\nFly around in jetpacks.\nImbibe alcohol to an irresponsible extent.\nJoin official servers or host your own server.\nHang out with your friends or find new friends!\nEnjoy free DLC, no microtransactions, and developer support.\nCollect tons of unique items with Steam Inventory support.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"PixelTail Games","platforms":[{"id":0,"name":"PC"}]},{"id":7619,"name":"Turmoil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/544/544fbb0b70cff90a73b01d72bbd7185a.jpeg","description":"A 3D isometric top-down dieselpunk-inspired, roguelike game. The world of Turmoil is set in an alternate history where humans developed machines that run on oil to automate society. Eventually, machines began making more machines to boost productivity while safety was disregarded. As the last human left in the esteemed factory of Geargrave Automations, Harry suffers a life-threatening injury to the only thing keeping him a valuable asset to the company. Now, with an injured mechanical arm leaking oil, sitting in the trash, Harry realizes he won't survive unless he fights. He must rise from the ashes, learning how to survive with nothing but his leaking arm and a general knowledge of mechanics. His goal is to avenge the humans who were disposed of in the past by defeating the boss, Kornelius Rayburn Geargrave, and shutting down the factory. Geargrave only values efficiency, output, and profit, so when hearing of Harry's retaliation, all robots are set to go hostile when in the presence of deviant employees.\nNavigate through three different procedurally generated levels of the factory, fighting hostile robots for survival, collecting their oil to continue forward as there is no choice but to persist. Collect blueprints and scrap around the factory to upgrade Harry's mechanical arm. Collect oil canisters to keep him alive and utilize the hazardous environment to defeat attacking robots. Rise from the ashes! Show the boss that a worker is more than their mechanical parts.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Gamious","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":481,"name":"Subterrain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8c/a8c140c8f801c03d12c9f9bb6209627d.jpg","description":"Localization mod supportPlease note that the localization is done by our passionate community. So some language translation can lag behind the English version as we develop the game. Join our community and help us to localize the game to your language!\nAll the localization files are editable. Contact us if you would like a language set to be officially included in the game.\nAbout the GameIn Subterrain, you fill the shoes of Dr. West, the apparent lone survivor of MPO, an underground city on Mars. Do what you must to survive: battle enemies, fight hunger and thirst, mend your wounds, and gather resources in a constant struggle to survive the catastrophe that’s beset Mars!\nYou may end up being your own worst enemy if you’re careless!\nEvery decision you make is critical as the world does not wait for you.\nSURVIVAL\nStruggle against your own bodily urges, such as thirst, hunger, exhaustion, and more!\nBeware of injuries, including bone fractures and blood loss!\nScavenge or perform research to obtain medical supplies!\nManage your oxygen and thermal levels while exploring!COMBAT\nFight the horrors of Mars with melee and ranged weapons!\nCustomize your ranged weapons using modular parts!\nStruggle against the persistence of time! Race against the spread of the infection!\nEnemies will evolve over time from cocoons to monstrosities!\nDefend your generator against invasions!CRAFT\nCollect and scavenge junk and creature parts to break down into components!\nProduce armor, guns, grenades and upgrades using 3D printers!\nCraft performance enhancers, survival gear, and more with the Bio Combiner!\nHarvest plants and ores using the biosphere and mine. Refine them to create materials!\nResearch items to create more powerful versions! Create your own lightsaber or power armor!EXPLORE\nExplore randomly generated sub-levels and hand-crafted locations!\nExperience non-linear storytelling through logs and story sequences!\nWander freely through Mars colony! Explore districts as you wish!\nRestore the colony’s habitat by repairing temperature and oxygen generators!\nFind clues to the infection! Escape the nightmare!\nThere is free demo version of Subterrain! If you would like to see how the game plays, please try it!\nSetting:\nBy 2050, humanity has finally colonized Mars thanks to the efforts of one man, Jeff Murray. To avoid Mars’ high radiation levels and inhospitable temperature changes, he built a city underground. This city was named Mars MPO. Free of the constraints that often plagued businesses and researchers on Earth, scientists and entrepreneurs flocked to MPO.\nRecently, Dr. Albert West has migrated to MPO at the personal invitation of Mr. Murray. West has been working on a cure for Alzheimer's disease in a race to save his wife, Jennifer, from dementia. His efforts are cut short; a lab accident leads to an accusation of murder and a prompt prison sentence.\nWe join Dr. West a little over a year into his prison sentence. It’s been a week since the guards mysteriously vanished. Dr. West is about to find out why.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pixellore","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":174,"name":"Death Squared","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d1/4d17635ba9841dffabd88c7200cf4d96.jpg","description":"Does anyone actually read these descriptions? They do? And there's someone reading right now? Well, in that case: Death Squared is a cooperative puzzle game for 1, 2 or 4 players, best enjoyed with loved ones who don't mind a little arguing for the greater good.\nProve your teamwork skills in Death Squared as you solve puzzles together or die trying! Each player needs to guide a robot to a colour-coded goal, but the path is beset with deadly traps and hazards. Teams of players will need close observation and communication to keep each other alive and discover a solution together.\nComplete the main campaign with one or two players, then take a group into four-player Party Mode for the ultimate teamwork trial! For those that can't get enough, head to the 'Vault' to find extra experiments recommended only for the brave.\nFeatures:\na micro-journey of: surprise > discovery > mastery > successFull voice acting by Rice Pirate80x puzzling levels in the Story levels40x 4 Player Party levels30x Vault Levels (too hard for the main game)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SMG Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":101,"name":"Vikings - Wolves of Midgard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d96/d968719f37eaba04920ba2cfe2b7813a.jpg","description":"Fear the wolves. They are cold, they are hungry - and they will stop at nothing to survive…\nRagnarok. Legend has it that when the coldest winter descends, the Jotan will return to take their vengeance against the Gods of Asgard. The world is on the road to perdition and the fate of Midgard hangs in the balance. But when the Fire and Frost Giants begin to merge their armies, they encounter the clan of the Ulfung – the Wolves of Midgard. Bloody, but unbowed following the destruction of their village, this notorious band of ostracized Viking warriors are determined to seize their destiny and save the world. As clan chief, you must save Midgard from complete annihilation, and spearhead the charge to vanquish the fiendish creatures of the Fimbulwinter.\nFantasy Meets Norse MythologyTravel the realms of earthly Midgard, freezing Niflheim and boiling Balheim, either as a fierce Viking warrior or merciless shieldmaiden.\nThe Deadly FimbulwinterWithstand the deathly colds and protect yourself from exposure to nature’s wrath in order to survive.\nTribute To The GodsCollect blood from fallen enemies and sacrifice it at the altar to gain gifts from the Gods to enhance your powers.\nBerserker RageLet your anger take hold by activating Rage Mode to overwhelm your enemies in bloodthirsty combat.\nThe Art Of CombatPerfect your skills with each weapon to unlock their true potential, including swords, bows and spell-powered canes.\nThe Power Of The GodsMake the abilities of the Gods your own by equipping power-infused amulets, like the Talismans of Thor or Loki. Put your new skills to the test by competing in the Trials of the Gods to earn further rewards.\nTeamworkTeam up with a friend and journey to the Shores of Midgard together in an epic two player online co-op mode. Choose between four difficulty levels to suit your skills and talents. Do you dare attempt the unrelenting hardcore mode?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kalypso Media","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20348,"name":"Space Farmers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a9/7a9184f0cf93c11550803a5d7d26030d.jpg","description":"Space Farmers is a cooperative multiplayer action game developed by BumpkinBrothers.\n\n###Plot\nYou and your friend are trapped on an alien space station. The aliens want you to reveal secrets on how to make the perfect British tea. Lucky for you, a bunch of the station's robots goes crazy, and your captors escape in fear. Get off the station and do not tell anyone about making the British teamaking!\n\n###Gameplay\nSpace Farmers is a cooperative multiplayer game only. The main objective of the game is to escape from the alien space station. A wide variety of sci-fi weaponry is available to the players. The developers insist on using the Energy Shotgun as your main weapon as it is selected as a default one, has a decent spray pattern, and generates the most fun.\n\nThe game features some roguelike elements, as the player's death results in loss of all items and weapons found on the level. The killed player can be revived by their teammate, but for a limited amount of time. The game's levels a procedurally generated, which results in a high degree of replayability. No playthrough of the game will be the same experience.\n\nThe game features both online and split-screen multiplayer for you and your friend. The developers state that it is the only way the game should be played. No paid updates of DLC for the game will be ever released.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BumpkinBrothers","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19300,"name":"Heroes of Might & Magic V: Tribes of the East","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4c/f4ca39902153aa0d77ef7a40758835c1.jpg","description":"For the first time, play as the Orc faction and recruit heroes, build armies and manage cities as you explore and conquer legendary lands. Use tactics, skills and magic to outsmart fantasy armies while developing your heroes and unveiling the dark plot that threatens to tear the world of Ashan apart.\nFeatures:\nEvery creature in the Heroes V universe will get an alternative upgrade, increasing the total number of creatures in the Heroes of Might and Magic V line to over 170!\nExpand your arsenal and gameplay with new spells, new artifacts, new buildings and innovative new features such as the combo-based Artifact Power Link and Battle Rage, the unique racial ability of the Orcs.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":7039,"name":"ReCore","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5c/d5c284383e620e7d33c1fcaefbb03670.jpg","description":"Supports Xbox Play Anywhere: Yours to play on both Xbox One and Windows 10 PC at no additional cost!\nFrom the legendary creator Keiji Inafune and the makers of Metroid Prime comes \"ReCore\", an action-adventure masterfully crafted for a new generation.\nAs one of the last remaining humans on a planet controlled by robotic foes bent on your destruction, you must forge friendships with a courageous group of robot companions, each with unique abilities and powers. Lead this band of unlikely heroes on an epic adventure through a mysterious, dynamic world.\nYou can’t save mankind alone.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Armature Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19548,"name":"UFO: Afterlight","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c9/6c9ae36854d03b8bae5069d44c95a3c5.jpg","description":"UFO: Afterlight is a strategy action game developed by ALTAR Interactive. It is the third game in the UFO game series.\n\n###Plot\nThe game is set after the events of UFO: Aftermath. After a devastating alien attack, the remaining humans have to move off-world to the established orbital colonies or to Mars. While Mars is undergoing terraforming, ten thousand colonists remain in cryo-sleep. However, 30 people suddenly awake from their sleep. Contact with Earth was cut off so the colonists decide to accelerate the terraforming of Mars. However, a brief archeological discovery awakens something alien yet again.\n\n###Gameplay\nAfterlight's gameplay is divided into two parts, a strategy game one, and a tactical squad-based simulation.\n\nAt the first part of the game, the players have to manage their resources, train the colony's personnel, trade with other parties, claim territories, and build up completely new structures. Upon capturing a new territory, the players can begin terraforming it and mining new resources out of it. This resources can be both traded with others or used to create new buildings and units. \n\nIn a tactical side of gameplay, the players send seven-man squads of soldiers. Before sending a squad to its mission, the players have to correctly equip them and decide on its strategy. These squads can be sent to eliminate humans as well as aliens. The squads have to be formed up of several specialists, such as the technicians, scientists, commandos, and so on.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Altar Games","platforms":[{"id":0,"name":"PC"}]},{"id":60755,"name":"Fluffy Horde","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d1/6d16de4214440603b5385800a3c82645.jpg","description":"Fluffy Horde is a 2D side-scrolling hybrid between real-time strategy and tower defense. The game revolves around a magical hyper-breeding bunny horde created by a misunderstood Shaman wanderer. After having a dwelling denied in all three kingdoms, the Shaman is willing to take over all of them by force. Can you stop the Fluffy Horde?\nFEATURES\nA unique strategy experience. Age of Empires and Warcraft got nothing on us. Starcraft 2 is slightly better...\nMesmerizing Pixel art that will cure your eyes of myopia.\nOver 100 cities to free and 300 badges to conquer.\nMultiplayer mode so you can outsmart your friends and strangers over the internet. Or be outsmarted by them, maybe you are not that bright.\n4 bosses to fight and hours of addicting gameplay.\nArrogant elves that “are much better than humans”, according to them. Underground people are cool, though.\nAwesome voice-over that will make you pee on your pants. Wear double underwear for a better experience.\nBunnies. We got 2.0309.894.859.483.495.8Y9.348.530.834 of them and counting...\nMusic made by God. We’ve got God on our team, that’s right! Who have you got?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Turtle Juice","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20233,"name":"Super Killer Hornet: Resurrection","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aed/aed34def55dd23472b62b8e984c3775d.jpg","description":"Super Killer Hornet: Resurrection is a top-down bullet hell shoot-em-up game developed by Flump Studio.\n\n###Gameplay\nTwo game modes are featured in the game: Arcade and Time Attack. Both modes have the same core gameplay mechanics.\n\nThe players are to shoot everything they spot on the screen. The more enemies you kill, the more points you get. A point multiplier system is present in the game. To activate the score multiplier, the players have to pick up two numbers that randomly spawn on the battlefield. After doing that their sum appears at the top of the screen and the player is prompted to choose one of three answers. If the player answers correctly, the multiplier is increased and is decreased otherwise. To achieve the highest score, it is essential to get the highest point multiplier.\n\nArcade mode is a default game mode. The players are given three lives and have to get as far as possible before they spend all their lives. After killing the Twin Hornets, the players are given one additional life.\n\nIn Time Attack, the players have to deal the most damage possible before the time runs out. The players are awarded more time by solving a simple math problem.\n\nThere are six levels in the game. A boss is present at the end of each level, and several mini-bosses can be met during the gameplay.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Flump Studios","platforms":[{"id":0,"name":"PC"}]}]