[{"id":59266,"name":"Bright Memory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3a/a3a5c03d2ddc9debb91a1e44ade9b6bf.jpg","description":"Bright Memory is a lightning-fast fusion of the FPS and action genres, created by one-man development studio FYQD using Unreal Engine. Combine a wide variety of skills and abilities to unleash dazzling combo attacks. SRO (Supernatural Science Research Organization) agent Shelia's adventure is about to begin.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"FYQD-Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":13949,"name":"AirMech","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/71368ff253871f4453a8aa90f86ed262.jpg","description":"AirMech® Strike is a fast paced Action-RTS game that can be played online competitively or cooperatively. Earn Kudos and Experience in battle and unlock a wide collection of AirMechs and Units while you practice the perfect strategy to emerge victorious!\nAirMech has recently undergone a huge overhaul to prepare the game to leave Early Access. This includes a new 3D lobby, new Matchmaking and Ranking system, and a return of Custom games and a Lobby browser. This version is actively replacing many of the old systems of the game, so we appreciate your patience while we finish this significant improvement. We believe that upgrading AirMech to Strike is a better approach than making AirMech 2, since it keeps all your current progress.\nSome of the systems we have experimented with during Early Access which do not fit Strike's PvP focus are coming to AirMech Wastelands, a companion game which does not contain any PvP. Look for that coming soon!Key Features:Action-RTS Transformed: DotA-style gameplay with transforming robots each with their own unique stats and abilities. Fast paced action and shorter game lengths keep the battle intense!\nCustomize Your Army: Choose your AirMech and your Units to take into battle and help your team claim victory. Also unlock custom Variant AirMechs (skins) to have a unique look ingame.\nControl Options: Supports both mouse/keyboard and Xbox 360 gamepad. Controls can also be completely customized for personal preference.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Carbon","platforms":[{"id":0,"name":"PC"}]},{"id":30261,"name":"Aliens Versus Predator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba9/ba9380623e707feb960cdeaa42d204b9.jpg","description":"Aliens Versus Predator Classic 2000 features the Colonial Marine, Alien and Predator Campaigns and the frenetic single-player Skirmish mode from the original title: Alien Versus Predator Gold Edition, which was released to massive acclaim in 2000.\r\nAlien Versus Predator Classic 2000 has been updated to run on modern PCs and laptops using DirectX 9.0c and includes support for Xbox 360 Controller for Windows.\r\nThe three most ferocious species in the universe in a bloodthirsty battle for the ultimate prize: survival. Take your pick: be a Colonial Marine, a Predator or an Alien. Fight through suspense-filled environments: from starships and space stations to colonial bases and eerie planetscapes. One wrong move turns you from hunter to prey.\r\nThree campaigns: Colonial Marine, Alien and Predator","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Rebellion","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":18340,"name":"Hacker Evolution Duality","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb8/cb85f1e95c52b28bc9dfcc09eac9a310.jpg","description":"Hacker Evolution Duality is the hacking simulator game, the third installment in ExoSyphen Studio’s Hacker Evolution series. \n\n### Plot  \nThe game follows an unnamed hacker who confronts malevolent AI that tries to control all the servers in the world. \n\n### Gameplay \nThe game shares many similarities with other hacker simulators. The whole gameplay takes place on the main hero’s computer desktop. You hack servers, take money from the banks, upgrade your hardware and software.\nIn contrast to the previous Hacker Evolution games, Duality is a much more accessible entry, even though it is still a niche game with a steep learning curve. Servers in the game have two primary stats: firewall and integrity. Lowering first one lets you access files or take the money from it. If the server’s integrity drops, it gets destroyed. To do so, you can use several hackers “weapons,” such as a DOS attack or EMP attack. Besides the usual servers, there are some AI controlled, that can attack you back. \nThe game is very fast-paced. Every minute of the game costs you some amount of money. Such mechanic makes time-management and quick decision-making an integral part of improving in the game. \nHacker Evolution Duality also offers a multiplayer with different modes where compete against both other players and hostile AI servers.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"exosyphen studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17778,"name":"Worms Clan Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b2/4b23b6af1a20c2fe6f4a353fe4f4fcc0.jpg","description":"Now with Steam Workshop\nAbout the GameWorms™ Clan Wars brings friends and families together in the noble pursuit of self‐improvement, world domination and exploding sheep.\nWorms™ Clan Wars is the biggest and best Worms™ game to date - more worms, larger landscapes, more dynamic water, more weapons and more customisation items than ever before.  Worms™ Clan Wars is designed to take full advantage of next gen PC hardware. It features beautiful high definition 3D visuals (but still retains the classic 2D gameplay) with new lighting effects, new features to help users interact socially, exciting additions to improve the single player experience, and more of everything a Worms fan could want.\nForm Clans, Take On The World\nJoin together with friends and other Worms™ Clan Wars players to form a fearsome team; name your clan, design your own emblem, promote other players to act as leaders and officers. Enter your clan into the league and fight together to make your mark on the leaderboards. Nobody wants an empty trophy cabinet!\nKeep in touch with friends and foes alike using WormNET, the game’s own lobby and chat system. Each clan has its own chat channel, and a number of other channels cater for a variety of hardcore gaming tastes! Jump online to hang out, chat, recruit new members or find games.\nStay connected with the game when on the road with a mobile companion application (web, iOS and Android). This is the best online multiplayer Worms™ ever!\nSlick Single Player Gameplay Too\nStory Mode’ adds a ton of variety by introducing physics based contraptions for the first time ever. A plethora of interesting machinery spices up the gameplay, and makes solo Worms™ much more fun! The single‐player game isn’t only about dealing death and destruction, it’s also about negotiating tricky swinging rope bridges and rescuing friendlies from death defying traps! The player spends much more time playing, and much less time waiting for their A.I. opponent to take a shot.\nGet Busy With Steam Workshop\nFancy yourself as the artistic type? Steam Workshop integration allows you to get creative! Now you can make your worms wear exactly the outfits that you want them to. Import your own 3D objects and textures into the game using a separate tool. You can model hats, glasses, moustaches, trinkets and gravestones for your worms. You can also design your own landscapes! Proud of your creations? You can share them online, thanks to Steam Workshop!\nWorms™ Clan Wars is the most fully featured version of Worms™ yet!\nThe game hardcore fans have been craving!\nNew: Clan Support\nNew: Multiplayer Clan Leagues\nNew: Clan Emblem Editor\nNew: Companion App for iOS/Android/Web\nNew: Steam Workshop Support. Create your own customisation items, design your own landscapes and then share them with Steam Workshop.\nNew: Day to Night Lighting Transitions\nNew: Physics Based ‘Contraptions’\nLandscape Editor\nOver 200 individual customisation items for the worms\n65 Weapons and Utilities including 10 outrageous new items: Mega Mortar, Gravedigger, Winged Monkey, Oxygen, Worm Charm, Bovine Blitz, Whoopsie Cushion, Teleport Raygun, Aqua Pack and The Equiliser\n4 Improved Worm Classes including new special abilities\n5 Environments: Inca, Viking, Feudal Japan, Industrial Revolution and Prehistoric\nMultiplayer Deathmatch and Fort modes\n25 Single Player story missions\n10 ‘Worm‐Ops’ time attack missions\n30% Larger Landscapes (Biggest Ever!)","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Team17 Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13372,"name":"The Way of Life Free Edition","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f49/f49ac6e2fdba7c3b04628ee259853ac7.jpg","description":"The Way of Life makes the player relive the same life's experiences from the point of view of three characters of different ages: an adult, an old man and a child.\nThe experiences we want to tell about are very different, they go from a quarrel to a dream, and further to more serious topics like death and love. The main point about the game is that every experience will be told through different gameplay mechanics​.​\nAlso, every playable character has his own specific mechanics and a way to see the world.\nThe player throughout the game can explore and live different stories and feel a variety of emotions in an amusing and captivating experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4560,"name":"Hydrophobia: Prophecy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/386/3869a2540b5fd39776fd640686610d05.jpg","description":"Hydrophobia Prophecy is an improved version of the game Hydrophobia, designed for the PlayStation 3 and Steam. Hydrophobia Prophecy includes both new levels (updated approximately 70% of the content) and levels already exist, but have undergone significant processing.\n\nBoth the original and the reworked version of the game are created as part of the action-adventure genre with elements of survival horror in the cyberpunk style.\n\n###Place and time of action\nThe game takes place in the middle of the XXI century. By this time, the world is plunged into chaos caused by great overpopulation. Lands suitable for food production are destroyed by rising ocean levels and the spread of deserts. Hunger and misery reign in the world. The most precious resource of humanity in these conditions is simple drinking water.\n\nThe game takes place on board a giant cruise liner comparable in size to the city. The liner is called Queen of the World, it was built by a group of giant corporations to create comfortable conditions for the elected representatives from among the managers of these corporations.\n\n###History\nAt the very beginning of the game, a group of terrorists is attacking and seizing a ship. The terrorists call themselves \"Neo Malthusians\" (after the economist Thomas Malthus, who predicted the death of humanity from overpopulation). They plan to kill many people so that the world will return to a state fit for a full life. Attacking the liner, the terrorists painted the walls with their slogans, the same slogans are broadcast on screens all over the ship. One of the slogans: “Save the World - Kill Yourself!”.\n\nThe terrorists are attacking a diner to get a tool for global genocide, killing about 10 billion people - such tools are in the secret laboratories of one of the Five Corporations located on the liner - “NanoCell Corporation”.\n\nThe protagonist, system engineer of the ship Kate Wilson, was responsible for the safety of the liner - when as a result of an attack by terrorists the ship begins to sink, Kate seeks to survive and tries to prevent the terrorists. What she needs for this, too, is in these secret laboratories.\n\n###Gameplay\nOne of the creators of the game described the gameplay as a “player against the environment”, meaning, first of all, water - water constantly interacts with everything it comes in contact with, and it gives an incredible variety of situations, sets of options for changing circumstances.\n\nWater floods the liner, constantly changing the configuration of spaces suitable for action and movement. The player must constantly adapt to this and respond quickly.\n\nOther characters can also affect the situation, and this effect also leads to a redistribution and movement of water. Water may involve other objects and substances in its actions — for example, a gasoline stain that has spread through water may ignite and burn, while water carries these fiery stains throughout the ship.\n\nThe action can occur both on the surface of the water and in its thickness.\n\nHydroEngine, an engine capable of solving this problem with unprecedented realism, was created to simulate flowing water in all its variety for the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cherry Pop Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":432527,"name":"Peaky Blinders: Mastermind","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59d/59d539fc7d8086ed9ea4f077c0196367.jpg","description":"Peaky Blinders: Mastermind is a puzzle-adventure game, based on the multi-award-winning TV show developed by game studio FuturLab, the creators of beloved game series, Velocity. Become the Mastermind as you control key characters and pull off perfectly synchronized plans.\n\nWelcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, proving himself worthy of being the true mastermind of the Peaky Blinders.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"FuturLab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":47490,"name":"SIMULACRA","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/301/301d149f1869431d04dc4f91a235eff2.jpg","description":"From the creators of Sara is Missing, Simulacra is a spiritual sequel to the highly acclaimed mobile horror game.\nBecome a voyeur once again.\nYou found the lost phone of a woman named Anna. In it, you see a desperate cry for help in the form of a video message. The phone behaves strangely as you dive deeper into it. You talk to her friends and they have no idea where she is. Her texts, emails and photo gallery provides fragments of information. It's up to you to piece it together.\nRecover lost files, piece back corrupted data, and retrace her final steps. Find her before it's too late.Features\nFully realised simulated apps which includes a dating app, a web browser, a social media app and a video vlog.\nAn expansive narrative with hours of gameplay that leads to 5 possible endings.\nFilmed with live actors and an extensive VO cast.\nSolve the recurring image and text decryption puzzles to learn more about Anna’s story.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kaigan Games OÜ","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":21521,"name":"Carmageddon TDR 2000","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29c/29c59b270312fed1db084d776b2b35d9.jpg","description":"HEADS UP!\nThis game contains humour, strong language and violence that some may find offensive. You may find it offensive in other ways, too. We do.\nDisclaimer\nStainless Games had no involvement in the development of Carmageddon: TDR 2000. So, you have been warned.\nFINAL WARNING\nSo, hopefully that's clear now. Carry on!\nTHE COMIC!!\nCheck out the official Carmageddon comic series! Click on the image!\nAbout the Game\nYes, it's the game literally... SOME of you asked for! And so, in the spirit of \"well, alright then, if you insist...\" we present the third game in the Carmageddon series, in the knowledge that some of you Carma fans out there would like to have a complete Carmageddon collection in your Steam library. Nothing wrong with that.\nAnyway, here's what the blurb on the back of the DVD case had to say about Carmageddon: TDR 2000:\nThe world's most controversial racing game returns with incredible graphics, fantastic game play and even more outrageous fun!\nMax Damage, imprisoned for life, plots his escape. However, there's the small matter of an army of police, hordes of gangsters and thousands of enraged inhabitants - all with homicide on their minds. To succeed, it will take a four wheeling genius with no morals, a killer instinct and a burning passion to escape.\nNo such person existed... until now!\nDrive 50 totally destructible vehicles.\nOver 48 missions and races to complete.\n9 completely 3D single player environments to explore and destroy.\n7 multi-player game types in 9 custom maps.\nKnown IssueSymptoms: When you start a mission, the game crashes to the desktop with an error about Directx, address 0x80070057.\nSolutions: There's an easy fix, disable the MIP Filter. You can do this by running TDR 2000 Setup and opening the \"Advanced Settings\" dialog, and setting MIP Filter to \"none\". Another solution is to disable the Fog.Command Line InterfaceCommand line options for the game are:\n-profile(w) Reprofile system\n-setup(s) Access setup dialog\n-fulltextures(f) Use fullsize textures\n-join(j) \"IP address\" Join TCP/IP game at specified IP address\n-create(cr) Create a TCP/IP server\n-clientserver(cs) Specifies client/server mode\n-dedicated(d) Specifies dedicated server mode\n-console(co) Specifies console output mode\n-gamescript(g) \"FileName.txt\" Specifies gamescript to use\n-maxDataRate(mdr) [value] Specifies data rate settings\n-dataRateFalloff(drfp) [value]\n-debugFile(df) \"FileName.txt\" Specifies alternate name for dbg.txt\n-optionsFile(of) \"FileName.txt\" Specifies alternate name for options.txt file\n-serverName(sn) \"ServerName\" Specifies server name[/b]MultiplayerHow do I set up dedicated server games?\nTo set up a dedicated server, create a shortcut to Carmageddon: TDR2000, and add -cr -d -co -cs to your command line. This will use the options you have already in your Multiplayer settings.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Torus Games","platforms":[{"id":0,"name":"PC"}]},{"id":12264,"name":"Town of Salem","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ad/7ad89835bf24aa24ce2b1dcad2a3833b.jpg","description":"Purchase comes with the exclusive SteamBot3000 Character Skin with unique death animation, 2,000 Town Points ($8 Value) and you will earn double Merit Points forever!\nTown of Salem is a fresh innovation on the classic party games Mafia and Werewolf. It is a game of murder, accusations, deceit and mob hysteria.\nHow To Play\nThe game ranges from 7 to 15 players. These players are randomly divided into alignments - Town, Mafia, Serial Killers, Arsonists and Neutrals. If you are a Town member (the good guys) you must track down the Mafia and other villains before they kill you. The catch? You don't know who is a Town member and who is a villain.\nIf you are an evil role, such as a Serial Killer, you secretly murder town members in the veil of night and try to avoid getting caught.\nRoles\nTown of Salem has 33 unique roles ensuring a different experience each time you play.\nBefore a game starts, players are put into a lobby where the host can select what roles will be in the game. Players are then assigned roles at random from the list of chosen roles. Players have an in-game role card that explains their role's abilities and alignments. For an in-depth look at the abilities of each role please visit: www.blankmediagames.com/roles\nGame Phases\nNight\nThe night phase is when most roles use their abilities. For example, Serial Killers stealthily murder people, Doctors heal people who are attacked, and Sheriffs interrogate people for suspicious activity.\nDay\nThe day phase allows the Town members to discuss who they suspect of being an evil role. Once the voting phase starts a majority vote from the town will put someone on trial.\nDefense\nThe defense phase is when you plead your innocence to the town. Have a convincing story or find yourself facing the gallows!\nJudgement\nDuring this phase the town will vote on the fate of the defendant. Players can vote guilty, innocent or abstain. If there are more guilty votes than innocent votes the defendant is sentenced to death by hanging!\nCustomization\nPlayers are able to choose their own map (town setting), character, pet, lobby icon, death animation, house and a custom name. The other players in the game will see your selections. There are currently 10 maps, 29 characters, 20 pets, 5 death animations and 20 houses to choose from.\nAchievements\nThere are currently over 220 unique achievements in the game. Earning achievements will grant various in-game items (however the items for donation rewards are exclusive to Kickstarter).","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BlankMediaGames","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17373,"name":"Strike Suit Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc7/bc7213e54142ad1b902978395182de02.jpg","description":"Strike Suit Zero is a space flight combat game. The game was funded via Kickstarter and advertised itself as an attempt to revive space flight combat genre. \n\n### Plot and setting \nThe game takes place in the distant future. The main protagonist is a pilot for United Nations of Earth and must help his home planet in a war against united forces of space colonies. \n\n### Gameplay  \nThe game consists of several missions. In each one of them, you participate in a massive space battle. The missions’ design intends to simulate full-fledged warfare that does not revolve just around the player. The player has to perform a specific task in every mission such as protecting an important ally or destroying the certain enemy object. \nThe player can choose between four types of spaceships: interceptor, fighter, bomber and the Strike Suit. Using the last one, the player can switch their spacecraft between fighter-mode and strike mode. In the strike-mode, the Strike Suit transforms into a more agile human-like mech. \nThroughout the game, the player unlocks different types of weaponry, including machine-guns, missiles, lasers, plasma cannons, and rockets.\n\n### Additional features  \nThe game supports joysticks","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Born Ready Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"}]},{"id":14667,"name":"Blade Symphony","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e5/4e5e71d53468bcf5d6686c46fec95d78.jpg","description":"Prove you are the world's greatest swordsman in Blade Symphony: a slash-em-up featuring a highly detailed and in-depth sword fighting system. Face down other players in tactical swordplay, 2 versus 2 team duels, sandbox FFA, or the Control Points game mode!Choose your fighting styleEach of the four characters have a unique fighting style suited to how you want to play.\nPhalanx, a fencer gladiator hybrid, attacks with long range stabs and a versatile array of side attacks\nJudgement, a knight crossed with a samurai, uses hard hitting forward attacks and wide strafing attacks\nRyoku, a vagrant street ninja, attacks with break dance moves and a signature reverse blade style\nPure, an acrobatic wushu style assassin that attacks with flips, cartwheels, extremely mobile\nVanguard, a quick-footed champion that uses leaning plunges to push opponents into her blade\nEach character has four combat stances and over forty different attacks.Choose Your SwordPair your character up with a sword type to completely change your way of approaching combat.\nKatana, cause massive damage when parrying your opponents\nLongsword, a well-balanced, hard hitting and adaptable sword\nRapier, a piercing, high damage forward thrusting weapon great for parrying\nScimitar, a weapon based on turning and performing as many cuts as possible\nJian, an agile, responsive weapon great for combosTactical Sword Fighting\nThere are no unlockable advantages in Blade Symphony. All unlockables are cosmetic. You care about proving your skill and so should your game.\nEvery attack has openings that are determined in real-time and efficacy is entirely up to you. Did you start an attack too early? Turn away and end the attack in a safe location. Did your opponent stupidly use a lighter stance? Go in and punish him! By switching stances mid-combo you can chain attacks into your own flurry of death.\nThe fighting system is open for your exploration, you can dash, jump, do an air attack, land, swing sideways with a heavy stance, parry with a light stance, and then roll away.\nEvery attack flows from your blade in true three dimensional space. As does your opponents! Swords collide in mid-air and you will need good timing and aim to defeat your opponent.Advanced Character CustomizationCustomize your character with skins, masks, swords, and multiple attachments streamed directly from Steam Workshop.\nFight as a TeamPlay in the new Control Points game mode and participate in team-based sword fighting.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Puny Human","platforms":[{"id":0,"name":"PC"}]},{"id":10227,"name":"Last Man Standing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba4/ba447d6bf41e1a638f850f2149eaaa6c.jpg","description":"This is a small game.\nAfter the eighteenth World War.\nHuman destruction, except you.\nIronically, you're the one who started this war.\nNow you have the whole earth, but no one can communicate with you.\nYou gradually become lonely and indifferent. You can't find people when you wander around the city center, buildings, markets, supermarkets and restaurants.\nThe world is yours now, but if you don't have friends, relatives and lovers, will you regret your decision?\nMay the world never have war and peace.\nIn this game, the only thing players can do is manipulate the characters, browse the scenery, and then experience a lonely life.\nYes, except in a daze, you have nothing to do!\nOperation mode\nRight click the target\nWASD motion control\nMouse control direction","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Free Reign Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":2709,"name":"Alien Shooter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78b/78b8ac91dc915973611ef64e91efc4e0.jpg","description":"The endless darkness and the somber, long passages of a military complex have become the abode of evil, as thousands of blood-thirsty creatures fill its offices, storehouses and mysterious laboratories.\nYour mission is simple: clear the base at all costs. You will be provided with explosives to help you gain access to the teleports from where thousands of pitiless creatures pour. A stationary gun will aid in the defense of the area. You have been granted access to the most advanced weapons technology money can buy. As you earn your pay, you can equip yourself with additional weapons in the arming area and biomechanical implants that will make your fighting abilities super human.\nThe alien invasion has begun, we have one chance, and that is to stop them cold in their staging area. Do not allow them escape this facility, you are our last hope. The fate of humanity now depends on you!\nAbout 1,000 monsters on each map, showing up to 100 monsters simultaneously on one playing screen\nMany hours of game play with 10 missions and a survival mode\nFull-on-action male or female character\nCharacter upgrade facility\n9 weapons of mass destruction\nRed or Green blood selection\nHighly imaginative selection of enemies\nReactive music which helps to drive the action\nUseful gadgets - flash lights, medkits, battle drones","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"8Floor","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":17878,"name":"The 39 Steps","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ef/6ef29fa65f8e13a67cc3f2c78215a068.jpg","description":"The 39 Steps is a game, but at the same time a book. The basis of this synthetic work is the Scot John Buchan bestseller of the same name. This book has been screened many times. One of the adaptations was directed by Alfred Hitchcock.\n\n###Genre and story\nThe game follows exactly the text of the book. The book is a thriller, in the subgenre \"a man on the run.\" Events take place in London in the early twentieth century. The main character is accused of murder, which he did not commit, and he has very little time to prove his innocence and find a real killer. He escapes from the city, hides from the police and investigates this case.\n\n###Gameplay\nThe main guide in the game is text. Much is reported in the voiced dialogues, scraps of phonograms, letters, newspaper articles and even fragments of the chronicle. There are several mini-games, tasks, performed by mouse movements. In total there are 8 different storytelling mechanics in the game, 25 collectible items and 16 awards to be unlocked.\n\n###Music, sound, atmosphere\nThe game contains more than two hundred hand-drawn frames. A lot of carefully selected details are immersed in the atmosphere of time and books. Old newspapers, photos, things, masterfully selected sounds - about the sound in the game is to be said separately, this is a huge and important part of the atmosphere of the game. It is considered, it seems, all - the sounds of passing mashtins, nature, the rustle of pages and creaking of the drawers. The game has its own soundtrack, the music follows all events, creating the right depth and maintaining a sense of total immersion. Dialogues are voiced by professional actors.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Story Mechanics","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19620,"name":"Red Orchestra: Ostfront 41-45","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b9/6b999cc618df4cf5924537e95ea30090.jpg","description":"From the bayonet to the artillery battery, from hand-to-hand combat to combat along the whole front - all this can be experienced in the game on the real events of the World War II. The Eastern Front is the site of the most brutal battles.\n\n###Realism\nThe circumstances of the battles and the characteristics of weapons are reproduced with great accuracy, including exact dates of battles and pictures of the terrain from cities to natural landscapes. Equally realistic are the characteristics of the flight of bullets and shells, fired from various weapons. The creators of the game paid attention to the authenticity of sounds, the game involved Authentic Immersive Sound FX and 3d Positional Sound System.\n\n###Weapons and more\nAt your disposal are infantry formations and tank divisions, many equipment and battalions of soldiers. In total, the game has sixteen completely reliable models of vehicles - their interior is also modeled. Thirty models of infantry weapons. You can fight by combining infantry and motorized weapons.\n\n###Modes and more\nModes of multiplayer and online-game allow simultaneous participation of more than fifty players. To coordinate activities in this mode, there is a technology called Voice Over IP.\n\n###Updates\nExisting updates to the game include new types of weapons, equipment, new maps: Krivoi Rog, Smolensk Stalemate, Leningrad, Berezina, Black Day July.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16969,"name":"Offspring Fling!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd5/dd5264ce0b5c7dc464f923b2f85c9091.jpg","description":"###The side project turned game\nA puzzle game from independent developer Kyle Pulver created on the FlashPunk engine. The game was released on Microsoft Window, Mac OS and Linux in the spring of 2012. The project began as a side-project for a developer from Arizona, which in the development process has become a full-fledged game. 100 puzzles are available for completion within the story campaign, and an additional 20 bonus levels that open after meeting all the conditions To do so the game requires the player a clear platforming skill from the player. The project is played with a sense of nostalgia: the gameplay and control are very similar to those used in the classic platformers from the 90's.\n\n###The Russian way\nThe protagonist is an unfortunate forest creature who accidentally lost all of his children and is now trying to get them all back. The game motivates players to replay it - after completing the level, the game creates a ghost version of the player. Critics noted the amount of work that Kyle Pulver did, noting that 15-20 years before the release of the game, would require a huge studio, and the game itself would appear on several covers of gaming media. But times have changed, and in 2012 the developer laid out the game on the Internet without much fuzz. The game, however, does not involve liberty in completion - for each puzzle, there is only one correct option.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kyle Pulver","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13759,"name":"X3: Terran Conflict","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fd/7fd4b29fa06a34e2ebda37283265faeb.jpg","description":"A game from the X series of games.\n\nThe whole series consists of four main games - X: Beyond the Frontier, X2: The Threat, X3: Reunion and X Rebirth - and the sequels to them.\n\nSequels, which include X3: Terran Conflict, can be considered as stand-alone games, their difference from the \"main\" games is that the sequels develop the ideas that first appear in the \"main\" games.\n\n###Genre of the X Series\nAll games in the series can be classified as “space trading and combat game”.\n\nThe general formula for the genre is very stable for years: the player begins with small spaceship with little money or status and works hard gaining status and power through trading, exploration, combat or a mix of various methods.\n\nThe plot in such games usually does not limit the player. The X series of games, for instance, allows the player to act, figuratively speaking, “in sandbox mode” - to perform all actions without restricting themselves to the plot.\n\n###X3: Terran Conflict\nThis is a stand-alone game based on X3: Reunion. It develops new plot lines and features.\n\nThe game has only single-player mode, but the player can play the role of many characters.\n\nThe player’s ship crosses areas of the universe inhabited and controlled by different races. All these spaces are interconnected due to the presence of special devices, Jumpgates, allowing for a large-scale travel in the game universe.\n\nIn the game world there are many stations and ships with which you can interact, in accordance with the genre of the entire series of games.\n\n###Updates\nSeveral updates were released for the game, and this should be taken into account, for these updates corrected significant errors that were found after the official release of the game.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Egosoft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11831,"name":"Marvel vs. Capcom: Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/725/725131e129692ec32ed62e9e405f5f4c.jpg","description":"Pre-Purchase OfferPre-purchase the Standard Edition today for bonuses including Warrior Thor and Evil Ryu costumes.\nPre-purchase the Deluxe Edition today for bonuses including Warrior Thor, Evil Ryu, Gladiator Hulk and Mega Man Command Mission X.The Deluxe Edition includes the main game and a 2017 Character Pass, which contains access to six all-new additional post-launch characters including Sigma, the main antagonist from the Mega Man X series.\nAbout the GameGAMEPLAY OVERVIEWThe epic clash between two storied universes returns with Marvel vs. Capcom: Infinite, the next era of the highly revered action-fighting game series. Marvel and Capcom universes collide like never before as iconic characters team up for action-packed player-versus-player combat.\nImagined and created through a shared vision between the two companies, Marvel vs. Capcom: Infinite will feature a variety of exciting and accessible single player modes and rich multi-player content for new players and longtime fans alike. In addition to single player Arcade, Training and Mission modes, a visually stunning and immersive cinematic Story Mode will put players at the center of both universes as they battle for survival against a sinister new threat, Ultron Sigma. Marvel vs. Capcom: Infinite is being built to highlight a combination of iconic locations and fan favorite characters from both universes, including Captain Marvel and Iron Man from the Marvel side, and Ryu and Mega Man X from Capcom.GAMEPLAY FEATURESReborn Rivalries: Universes collide once again in this all-new crossover clash for the ages, where players select their favorite Marvel and Capcom characters and engage in accessible and free-form 2v2 team battles, which allow for new gameplay dynamics never-before-seen in the franchise.\nInfinite Power: Choose one of the six powerful Infinity Stones from the Marvel Universe to influence the outcome of battle. Each Infinity Stone will customize characters with unique abilities and powerful game-changing effects that can quickly turn the tide of battle.\nIconic Heroes: More characters join the announce roster (Captain Marvel, Iron Man, Captain America, Ryu, Mega Man X and Morrigan) in the battle for survival, including Hulk, Thor, Hawkeye, Rocket Raccoon, Chun-Li, Strider Hiryu, Chris Redfield and Ultron, bringing the current roster up to 14 characters with more to be revealed in the future.\nCinematic Story: The Marvel and Capcom universes collide as heroes and villains battle together to save their merged worlds from a sinister new threat, Ultron Sigma. A combination of the robotic foes known as Ultron from the Marvel Universe and Sigma from the Capcom Universe, this psychotic villain is obsessed with infecting all organic life with a cybernetic virus. History’s greatest gathering of warriors must now unite to fight back against Ultron Sigma and save their newly formed world.\nAccessible Single Player Content: In addition to the cinematic story experience, players can hone their skills in a variety of accessible single player modes, including Training, Mission, and Arcade modes.\nVast Multiplayer Features: Robust online modes and content including ranked and casual matches, global leaderboards, and online lobbies with spectator mode deepen the overall experience.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11564,"name":"SPORE Creepy & Cute Parts Pack","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca7/ca7fd185a38cf0247e28c94b1f94fb61.jpg","description":"Add horror and humor to your universe. Make grotesque beasts or cuddly critters, then watch them do the robot, zombie walk, break dance and more! Includes over 100 new items.\n60 New parts\n48 New paint options\n24 New animations","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Maxis","platforms":[{"id":0,"name":"PC"}]},{"id":254562,"name":"The Haunted Island, a Frog Detective Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3c/d3c1a4036f6d1dc8e5208fb046a9ac5a.jpg","description":"Play as The Detective in this thrilling mystery of THE HAUNTED ISLAND! Meet a kooky cast of characters, with clues and quests to help you on your way.\nA small sloth has been haunted for weeks by a mysterious ghost that nobody can seem to track down. There's a mystery afoot, and the only one who can solve it is the renowned investigator known simply as The Detective. Finding clues and questioning suspects is just part of the job for such an experienced frog, but this case is a tough fly to catch.\nThis is a 3D mystery exploration game!cool features a frog\nlots of new friends to meet\namazing and nice original soundtrack\na great time to be had","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Thomas Bowker","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13405,"name":"The First Tree","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b02/b02c8f7cc53dfa98a35552916c02fe6e.jpg","description":"From the creator of Home is Where One Starts… comes The First Tree, a third-person exploration game centered around two parallel stories: a fox trying to find her missing family, and a son reconnecting with his father in Alaska. Players take control of the fox on a poignant and beautiful journey that crescendos at the source of life, and perhaps result in an understanding of death. Along the way, players can uncover artifacts and stories from the son's life as he becomes intertwined in the fox’s journey towards The First Tree.Key Features:For fans of Journey, Firewatch, and Shelter.\nAn emotional, intimate story by a one-man team with an ending you won't soon forget.\nFeaturing a gorgeous soundtrack by acclaimed artists like Message to Bears, Lowercase Noises, and Josh Kramer.\nA short game (about an hour and a half) focused on story with some light puzzle solving and platforming.\nIncludes English subtitles along with an easy-to-use fan translation system.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"David Wehle","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":11313,"name":"GRAV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74c/74cee7e8901db389e699454964207719.jpg","description":"GRAV is an indie action sandbox exploration title developed by BitMonster, Inc.\n\n###Gameplay\nThe game does not feature any plot whatsoever. The players start the game by creating their own character, after which they are put onto a procedurally generated planet. The in-game worlds are highly dependent on environmental events.\n\nThe game does not have any objectives, as the developers focused on creating a true sandbox experience. The players are given the opportunities to do whatever they like. Using these opportunities, the players can create their own stories and even characters to role play.\n\nThe game features a sophisticated crafting system. Anything the player finds or kills can be used as a crafting material. There is no need to know the recipe, as they are suggested to the players by the game itself. Anything can be crafted, from armor and weapons to vehicles and buildings. GRAV features an advanced building system, which allows the players to use a basic base they are spawned next to as a starting point to expand on and build massive cities.\n\nThe players can come into the game's dungeons, which are also procedurally generated, where they can find new crafting materials, weapons, or even vehicles. \n\n###Multiplayer\nThe game supports up to 64 players per server. The players can create alliances between themselves or engage in an all-out war. The game is highly moddable, and a number of community created mods are up and running on several game servers.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BitMonster","platforms":[{"id":0,"name":"PC"}]},{"id":27015,"name":"The Legend of Zelda: Twilight Princess","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd1/dd167cf8753db3748a975d61cc926e54.jpg","description":"When an evil darkness enshrouds the land of Hyrule, a young farm boy\nnamed Link must awaken the hero – and the animal – within. When Link\ntravels to the Twilight Realm, he transforms into a wolf and must scour\nthe land with the help of a mysterious girl named Midna. Besides his\ntrusty sword and shield, Link will use his bow and arrows by aiming with\nthe Wii Remote controller, fight while on horseback and use a wealth of\nother items, both new and old.\n\nThe Legend of Zelda: Twilight Princess is part of the Nintendo\nSelects family of games—great titles enjoyed by millions, now a great\nvalue at just $19.99 MSRP* each.\n\nFeatures\n\nArm Link: The Wii Remote and Nunchuk controllers are used for a\nvariety of game activities from fishing to projectile-weapon aiming.\nThe game features incredibly precise aiming control using the Wii\nRemote controller. Use the controllers for sword swings, spin attacks\nand shield shoves.\n\nThrilling Adventure: Players ride into battle against troops of\nfoul creatures and wield a sword and shield with the Wii Remote and\nNunchuk controllers, then take on massive bosses that must be seen to\nbe believed.\n\nMind & Muscle: Many puzzles stand between Link and the\nfulfillment of his quest, so players must sharpen their wits as they\nhunt for weapons and items.\n\n*MSRP: Manufacturer's Suggested Retail Price. Actual price may vary. See\nretailer for details.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Nintendo","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"}]},{"id":16698,"name":"Homeworld: Deserts of Kharak","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e1/4e12434f082fc8f2b965a4c950b8836e.jpg","description":"HOMEWORLD: DESERTS OF KHARAK\nA ground-based RTS prequel to the classic Homeworld games. Assemble your fleet and lead them to victory on the shifting sands of Kharak in this compelling strategy game. Crafted by Blackbird Interactive, a studio founded by veterans of Homeworld and Company of Heroes, Homeworld: Deserts of Kharak takes players to the deserts of Kharak where danger lurks over every dune.\nEXPERIENCE AN ORIGIN STORY\nIn Deserts of Kharak’s campaign, an anomaly is discovered deep in the southern desert. An expedition is sent, but the story is not that simple. Discover the story of Rachel S'jet as she leads her people on a quest to find their destiny in an exciting campaign.\nHEAVY DUTY HARDWARE\nTake control of fleets of land and air vehicles – from nimble light attack vehicles to massive heavyweight cruisers – built to conquer the desert.\nMASSIVE ENVIRONMENTS\nFight your way across massive dune seas, deep craters, and hostile canyons in sprawling maps – all in unprecedented fidelity and scale.\nTACTICAL COMBAT\nPosition your fleet to take advantage of the high ground or create ambushes across dune lines in terrestrial combat. Attack your enemies’ resource operations, or assault their military head-on.\nSTRATEGIC DECISIONS\nMeaningful choices in resource management, fleet composition, and technology research directly impact your chances of survival.\nONLINE MULTIPLAYER\nCompete online solo or with friends in a variety of game modes, including ranked play, to rise through the ranks and become the most powerful Fleet Captain on Kharak.\nBefore you can find your Homeworld, you must first unlock the secrets of the desert.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Gearbox Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":300682,"name":"Ready or Not","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/807/80722b59580f564352362b78cd53755b.jpg","description":"Ready or Not is an intense, tactical, first-person shooter that depicts a modern-day world in which SWAT police units are called to defuse hostile and confronting situations.\n\nPlease remember that the Beta build is still an incomplete version of the game. It will still have bugs and quirks, and will require lots of additional content before it is ready for full release. Because of our Supporters and with your help, we will continue to push Ready or Not, adding more content (new maps, missions, characters, weapons, etc.), and further refining it to get the game up to the standard that you deserve. We ultimately want you to be able to turn the lights out, crank up the volume, and be immersed in the action – bringing order to chaos.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"VOID Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":251594,"name":"The Textorcist: The Story of Ray Bibbia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/262/2623a3e832b3cb31186f3d59ea59983f.jpg","description":"Get ready for an electrifying mix between a bullet game and a typing hell! Dodge bullets while typing exorcisms at the very same time: turn on both sides of your brain and jump into the adventure of Ray Bibbia, a private exorcist who's going to face the threats of a demonic outbreak and deal with his dark and sinful past at the same time! A city in decay, streets filled with thugs, crime and censorship and only one man to stop it all. Groundbreaking gameplay, exorcists, demons, metal singers, pimps, the Pope, drama, bad jokes and tons of hardcore action-filled boss battles for the first type ‘em up game ever realized.\nA TYPING EXPERIENCE: In order to defeat the forces of evil, learn how to type your exorcisms with your keyboard or with your joypad WHILE dodging tons of bullets, dealing with puddles of barf, defusing bombs, singing at the mic of a metal show and more during intense Boss Battles: easier said than done. Hold your Bible tight, both hands needed!\nTHE CITY: Rome is the theatre of our adventure, discover new locations and fight in one of the biggest metropolis in history, home of some of the craziest characters and enemies! Behind a demonic outbreak, unearthly forces are scheming to seize power and subvert the order of the the biggest religious organization in Rome: The Holy Church has reached unlimited powers over the streets of the city, but how can our protagonist be sure of their good deeds? Unravel the demonic plot aimed to overturn the order in the city and put together the pieces of the dark past behind Ray Bibbia!\nTHE CAST: From Goth maids to gun-crazed gangsters and the Pope himself, Ray will get his hands dirty by exploring a great variety of  locations to solve a mystery that’s going to grow heavier as it takes shape. Who’s gonna turn out to be a friend and who’s gonna stab Ray behind his back?\nAre you a fast typer? Can you read and spell latin while you dodge bullets? THIS is the game you're looking for! Real exorcisms, english, latin and more! Avoid making mistakes and reach the highest combo! Compete with your friends by spelling the “perfect exorcism”  and compare with their scores on online leaderboards!\nFeatures:\n- An intense storytelling\n- Tons of bullets\n- Lots of typing\n- 10 Boss fights\n- A trinket for every boss\n- Challenging twisted typing mechanics for every boss\n- Type even to open a door\n- Type on a Holyvetti computer\n- Show it off with online leaderboards\n- Play with the keyboard for a typing experience or with a gamepad for a rhythm experience\n- Original Soundtrack composed by GosT\n- Some more Bullets\nAll these features and even more, if you're a fan of shooters, a masochist, a wannabe exorcist, or you just need some black comedy in your life, don't miss The Texorcist!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Morbidware","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18135,"name":"Ionball 2: Ionstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da6/da6383e05fff7ee4ca44caf173a21201.jpg","description":"The game develops the classic legacy of video games such as Breakout and Arkanoid. But Ionball 2: Ionstorm brings a lot of new things to this genre.\n\n###Innovations in the classic genre\nFirst of all, these are 3D environments. In a three-dimensional environment, the obligatory attributes of the genre are perceived in a new way: explosions, shooting, and other visual effects.\n\nThere are 60 levels in all. Three of them are required to defeat the boss at the end. You fight with bosses and hordes of other enemies, using 7 uniquely destructive weapons.\n\n###Story and gameplay\nRobots took the place of bricks in the game, and the whole situation of the game was made in the sci-fi style of space travel and space battles. Classic gameplay remains the same.\n\n###Soundtrack\nThe dup-step style soundtrack helps to keep the rhythm and react to events in the game with sufficient speed.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ironsun Studios","platforms":[{"id":0,"name":"PC"}]},{"id":32716,"name":"StarCraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68a/68a77a21ec04083f3e6af62cdbed9c0a.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Mass Media","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4385,"name":"Need for Speed: The Run","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/824/8244583f6d39dda76b0fce7a516d1425.jpg","description":"• From the Golden Gate to the Empire State — Compete in The Run, an illicit race across the most iconic and treacherous roads from San Francisco to New York.\n• You are Jack's Competitive Edge —  Keep Jack one step ahead of the dangers from his dark past, both inside and outside the car. It's up to you to get Jack to New York in one piece and ahead of the competition.\n• Compete in High Octane Multi-Player Racing — Pick a playlist and compete for supremacy across the United States.  Join up with your friends online to earn exclusive in-game rewards.\n1 player\nSIXAXIS Motion Sensitive\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-8\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© 2011 Electronic Arts Inc.  EA, the EA logo, Need for Speed, the Need for Speed logo, the stylized ‘N’ icon, NEED FOR SPEED THE RUN, and the NEED FOR SPEED THE RUN logo are trademarks of Electronic Arts Inc. The names, designs, and logos of all products are the property of their respective owners and used by permission.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts Black Box","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"}]},{"id":398401,"name":"Senua's Saga: Hellblade II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5c/b5ced2e44396160e62ff8d70e3adda71.jpg","description":"The sequel to the award winning Hellblade: Senua’s Sacrifice, Senua returns in a brutal journey of survival through the myth and torment of Viking Iceland. Intent on saving those who have fallen victim to the horrors of tyranny, Senua faces a battle of overcoming the darkness within and without.\n\nSink deep into the next chapter of Senua’s story, a crafted experience told through cinematic immersion, beautifully realised visuals and encapsulating sound.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Ninja Theory","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":19601,"name":"Snapshot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/750/75092895cb37edc24b83bebf1ebbf4e7.jpg","description":"###The loneliness\nAn experimental platforming game about a lonely robot that found itself on an abandoned planet, with only a camera in its disposal. The game was developed and released by the independent studio Retro Affect in 2012.\n\n###The story\nThe player controls a robot named Pic with simple movements: right, left, jump and duck. The gameplay is about solving puzzles of increasing difficulty. They must be solved using the camera. The player is also controlling the viewfinder with a mouse to take a picture of the in-game items. After the photo is taken, the item disappears from the virtual world and is placed in the camera's memory. Further with it, it is possible to make various manipulations like paste it to another part of the game world to overcome obstacles. In addition to moving, photographed objects can be rotated as the player like.\n\n###Key features\nThe player can photograph absolutely any object, both living and non-living. For one hundred percent completion of the level, you can get an additional reward. There is no plot as such in the game; only a single campaign is available for completion. It consists of more than 100 unique levels, which are divided into four different biomes. Each level can be additionally completed once again just for the sake of searching for hidden collectibles and secrets.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kyle Pulver","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":7613,"name":"Rare Replay","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/369/3696ff49a604521d3c0ba70c832ee42b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":69,"name":"KINGDOM HEARTS HD 1.5 +2.5 ReMIX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c97/c970331a996c14ff50077bd00f9fd3b1.jpg","description":"KINGDOM HEARTS HD 1.5 + 2.5 ReMIX is an HD remastered collection of 6 unforgettable KINGDOM HEARTS experiences available for the first time on the PlayStation® 4. The HD collection features:\n• KINGDOM HEARTS FINAL MIX\n• KINGDOM HEARTS Re:Chain of Memories\n• KINGDOM HEARTS 358/2 Days (HD Remastered cinematics)\n• KINGDOM HEARTS II FINAL MIX\n• KINGDOM HEARTS Birth by Sleep Final MIX\n• KINGDOM HEARTS Re:coded (HD Remastered cinematics)\nKey Features\n• Celebrate 15 years of KINGDOM HEARTS with this essential collection - Remember and relive 6 adventures from KINGDOM HEARTS Dark Seeker Saga before the release of highly anticipated KINGDOM HEARTS III.\n• Experience the magic of KINGDOM HEARTS - If you are new to the franchise, KINGDOM HEARTS HD 1.5 + 2.5 ReMIX is the perfect opportunity to start wielding your Keyblade to save the Disney worlds from darkness.\n1 player\n50GB minimum save size\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© Disney.     Developed by SQUARE ENIX.\nSQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. The ratings icon is a registered trademark of the Entertainment Software Association. The “PlayStation”, the “PS” Family logo and “PS4” are registered trademarks and the PlayStation Network logo is a trademark of Sony Interactive Entertainment Inc. All other trademarks are properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":61206,"name":"Yuppie Psycho","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd1/cd184ffdfb0c9700c371bea069c52b8e.jpg","description":"First day at a new job? What a nightmare!\nJoin Brian Pasternack, a young man with no future in a dystopian 90s society, on his first day at one of the world’s largest companies, Sintracorp. Uncertain, unprepared, and massively unqualified, will Pasternack have what it takes to shine in Sintracorp’s hierarchy? It all depends on how he performs on his first assignment… and whether he survives it.\nDuring his unconventional employee orientation, Pasternack discovers what his new job really entails: hunting a “witch” whose powers made the success of the corporation possible in the first place, but who now seems to have returned to torment its employees. Brian will meet all kinds of odd characters, escape from terrible creatures, and unravel the hidden secrets of Sintracorp’s dark past.\nDuring Brian's Time at Sintracorp, you will:\nFamiliarize Yourself with Your Workspace: Use the elevator to discover who’s working and what’s lurking on every floor of Sintracorp.\nLearn Office Protocol: Learn when to chat, when to work, and when to cower in terror from otherworldly beings.\nEngage in Watercooler Conversation: Investigate your co-workers and discover their sordid, blood-soaked secrets.\nConsider your five-year goal: Only you can choose how this story will end, so make your decisions carefully!\nAssess health and safety: Use different light methods to light your path and reveal what is breathing in the dark.\nConduct a Rigorous Personal Assessment: Find clues, solve riddles, discover new paths - all without letting the Witch catch you!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Baroque Decay","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"}]},{"id":28478,"name":"Saints Row","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/624/6241f3e7fefc1948c4b5cf038f0ecf6c.jpg","description":"Welcome to Stilwater, a city where the streets are everything but tranquil. Divided by rivaling gangs, you’ll need to adopt savvy street smarts to build respect, make money and gain notoriety, let alone stay alive. As a member of the 3rd St. Saint’s, you need to push back against a city looking to wipe you out, in order to rise up the ranks and eventually control the streets. If it takes theft, extortion or tried and true brute force, then that’s what ya gotta do. Only then will you rule the streets. BUT watch your back – on your purpose to rise as the city’s controlling syndicate, reputable and powerful gangs, including politicians have you in their crosshairs.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Volition","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":19509,"name":"Men of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89d/89dbfc6a4391eb4ea1861e309ed529c4.jpg","description":"Men of War is a great real-time strategy game set in the midst of World War II. Intense battles taking place in Europe and North Africa, in which the player can fight as Soviet, Allied or German forces. In both multiplayer and single-player modes, you'll see authentic period-era vehicles and weapons and brutal combat that puts players right in the heart of the battle.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Best Way","platforms":[{"id":0,"name":"PC"}]},{"id":16215,"name":"Murder Miners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/519/519a463edcb8e6594c7f4d1c4f5d6d59.jpg","description":"Murder Miners is an indie multiplayer first-person shooter developed by JForce Games. \n\n###Gameplay\nBeing a multiplayer shooter, the game features no plot whatsoever. Murder Miners is heavily inspired by both Minecraft and Halo series of games. The game inherited the art style from Minecraft, while the core gameplay mechanics were taken from Halo.\n\nMurder Miners offers the players to engage in a selection of competitive game modes set in a completely destructible and interactive environment.\n\nThe developers focused on the competitive side of things, hence why the game features wall-jumping, unlimited sprint, alt-fire modes and so on. This results in fast-paced, Quake-like movement and Halo-like gunplay. At the beginning of the match, the players can choose any weapon present in the game starting with a 3-hit-kill pistol, an energy sword, and ending with a deadly sniper rifle. \n\nPlenty of game modes are present in the game. The regular competitive modes, such as Deathmatch, Team Deathmatch, Capture The Point, and Capture The Flag are featured alongside with a completely unique Infection mode, where the players try to avoid becoming a zombie from a bite by another player, and a cooperative mode.\n\nThe game comes bundled with an in-game editor, which allows for the creation of custom maps. It is easy to upload the map for the other members of the community, hence why the game has one of the widest map variety in the genre.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"JForce Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":427733,"name":"Kill It With Fire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a96/a96ccd1d451aef96be6ca1f1fe12134c.jpg","description":"The spider - mankind’s most ancient and deadly nemesis.  As a licensed Kill It With Fire exterminator, it’s time to fight back!  Gather your arsenal and pursue the eight-legged menace on a journey across time, space, and suburbia - although not necessarily in that order.\nTo defeat spiders you must exploit their one weakness: FIRE. Or bullets. Or explosions, throwing stars, gettin’ smushed by stuff...pretty much anything, really.  But that doesn’t mean it’ll be easy - first you’ve gotta find the spiders.  Use state-of-the-art arachnid tracking technology to pinpoint your quarry’s location among hundreds of potential hiding spots - then, torch everything and smash the spider with a frying pan after it runs out.  It’s the only way to be sure.FeaturesDozens of weapons.\nCreepy crawlies.\n“Realistic” fire simulation system.\nGratuitous chaos and destruction.\nFinally learn the truth about spiders.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"}]}]