[{"id":4,"name":"Penarium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68b/68b6ea983d6145fad13c5300c2dd8a9e.jpeg","description":"Penarium is set in a sinister circus arena, where contestants, much like Gladiators of old, are forced to entertain a sadistic crowd. In this frantic 2D arena arcade game, you take on the role of our quirky antihero; Willy who, to survive, is forced to run, jump and avoid an array of killer death-traps. Succeed and Willy will become the Champion of Penarium. Fail and he will die in a most horrendous way, much to the delight of the baying crowd.\nGuide poor Willy through this evil madness in single player and 2 player local COOP and Competitive modes. Every kid wants to go to circus but no kid wants to die in one.Feature List\n3 Arenas\n4 Game Modes\nCampaign mode featuring 30 challenges\nArcade mode featuring over a dozen of unlockable power-ups\nCOOP and VS local multiplayer\nOnline leaderboards\nDark comical dialogue and cutscenes","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":881537,"name":"Once Human","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/334/334131e9a9ea97c7e10f92a92798f36f.jpg","description":"The apocalypse changed everything. Human, animal, plant… all are infested by an alien creature – Stardust. As a Meta-Human, you can survive the contamination and use the power of Stardust. Play alone or join others to fight, build and explore. When the world is in chaos, you are our last hope.\nSurvive in the wilderness\nYou wake up in the middle of nowhere. You'll have to brace yourself for the cruelty of nature (from monsters to lack of food); however, Stardust's influence does not restrict to living things, it also affects the soil and water. Eating polluted food and drinking dirty water will reduce your Sanity. When your Sanity drops, your max HP would drop accordingly. To eat or not to eat, it's a question.\n\n\nFight against monsters\nBattle numerous enemies that are once human, and challenge bosses from another dimension to gain powerful items and ease Stardust pollution. You are not only fighting for yourself, but also fighting for the survivors.\n\n\nCustomize weapons\nWith about 100 gun blueprints divided into seven categories for you to collect and craft, every loot grants you something new. Did I mention accessories and gun perks? Right, they are the heroes here. If our current weapon cannot satisfy your need, you can add different parts and perks, upgrade your firearm to your heart's content.\n\n\nBuild territory\nUse Territory Core to build a house of your own. You can keep a practical style, jamming everything needed in a small room; or you can design a townhouse with a patio, kitchen, garage… The best part is, you can relocate your territory any time you want!\n\n\nFind out the truth\nDelve into the truth of Stardust, find out where it came from, and what it wants. In the journey of seeking truth, you may feel alone, but you are never alone. There are several factions in the world, some can be violent and hostile, others might be friendly and helpful. Explore human settlements to learn their stories or exterminate bosses without leaving a name for survivors to praise, the choices are yours.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Starry Studio","platforms":[{"id":0,"name":"PC"}]},{"id":58826,"name":"Super Mario Party","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8b/d8bfed2209bf96866506cca8022db5b7.jpg","description":"Super Mario Party is the eleventh game in its series of party games and the first to be released for Nintendo Switch.\n\n###Plot\nThe characters from the Mario universe decide to start a party with a lot of competitive games to determine who of them is going to be the Super Star. \n\n###Gameplay\nThe player controls his or her character from the third person view and navigates it in the Mario world to collect stars and participate in mini-games. \n\n###Characters\nThe game features all the main playable characters from the previous Mario Party games, such as Mario, Princess Peach, Luigi, and Bowser. There's a roster of 20 characters, four of which need to be unlocked. Toad is not playable and serves as the party's host and judge instead. Super Mario Party introduces several characters that are new to the series, such as Monty Mole, Goomba, and Pom Pom, as well as reintroduces characters that only featured in the handheld spin-off installments, namely Diddy Kong and Bowser Jr.\n \n###Multiplayer\nThe game allows a variety of multiplayer options. Up to four players can compete the main Party mode, taking turns. In the Partner Party mode, the players compete in teams in the vein of Mario Party: Star Rush. Super Mario Party allows two players to use a single Switch, with each player taking one of Joy-Cons. The players can also synchronize their Switch consoles locally.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NDCube","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":54435,"name":"Mario Kart 64 (1996)","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b19/b196fdca25e4df755f6fafd02df158d9.jpg","description":"Mario Kart 64 (マリオカート64, Mario Kāto Rokujūyon) is a kart racing video game developed and published by Nintendo for the Nintendo 64 video game console. It was the successor to Super Mario Kart for the Super Nintendo Entertainment System, and is the second game in the Mario Kart series. It was released first in Japan on December 14, 1996, and in North America and Europe in 1997. It was later released as a Virtual Console game for the Wii and Wii U in 2007 and 2016, respectively.\nChanges from the original include the move to polygon-based true 3D computer graphics for track design, and the inclusion of four-player support. Players take control of characters from the Mario franchise, who race around a variety of tracks with items that can either harm opponents or aid the user. The move to three-dimensional graphics allowed for track features not possible with the original game's Mode 7 graphics, such as changes in elevation, bridges, walls, and pits. However, the characters and items remained 2D pre-rendered sprites.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 64"}]},{"id":20132,"name":"Circuits","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbd/cbd71e384b42654cea7a27e37183460f_Esfu98S.jpg","description":"Coming Soon, \"Circuits Composer\", Free for our Circuits players.\"Circuits Composer\" Coming soon as a free update for all of our users.\nWith the circuits editor you can create your own songs, save it and share through steam workshop, also load other people musics or share your own loop packages so people can use it for making new songs. You can have an sneak peek here : http://youtu.be/AZlifcx-MK4\nAfter the update the game price will raise a little.\nthank you,\nDigital Tentacle.\nAbout the GameSimple in concept, but very challenging and rewarding, Circuits  is a  musical puzzle game that requires careful listening to complete each level.The goal of Circuits\npiece together the different parts of a song. Sounds easy, but maybe not.\nAs we love music, we wanted to make a game that gives the player an insight into how music is created and makes listening the core part of the experience. Packed with beautifullly designed minimal graphics, to not disturb the focus of the game, and right now 25 different songs for the player to reconstruct.\nSo if you like music, you will like Circuits .Features\nEngaging gameplay that gives an insight into music creation for players\nA soundtrack mix of electronic ambient,dubstep, and epic orchestra composed by David García ( Deadlight, Rime...)\nBeautiful minimal design\nAnd a Turbo.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rendercode Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10444,"name":"Digimon Masters Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/247/2471113e353da52a5a033a6a8cf16a8f.jpg","description":"Digimon Masters Online is the latest MMO featuring the ever-popular Digimon franchise. This long awaited game will feature a deeper RPG experience, enhanced graphics and adrenaline-pumping real-time combat. Both new and long-time Digimon fans can now immerse themselves into this new epic adventure with their very own Digimons.What's a Digimon?\nDigimon, short for Digital Monsters, is a globally popular Japanese media franchise featured in countless TV series/animes, mangas, video games, films, toys, collectible card games, etc. Digimons are creatures inhabiting in the Digital World, a virtual space created by humanity's various communication networks and their developers.\nDigimons are raised by humans referred to as 'Tamers' and they go on thrilling adventures to defeat evil Digimons and human villains who strive to destroy the peace of the Digital World and the real world.\nThis world is located within the main host computer, Yggdrasil, and is controlled/managed by artificial intelligence.\nAll Digimons each possess unique artificial intelligence which allows them to think, judge and communicate.\nAs Digimons each grow from their youths to adult forms, they go through several steps of Digivolution (Digi-Egg - Rookie - Champion - Ultimate - Mega), to become more powerful and to survive.Game Features\nMMO-based real-time combat with enemies100+ Mercenary Digimons Digimon Riding ModesRaid bosses, dungeons (Party Mode available)Digimon/accessories reinforcement systemUp to 50 Maps and worlds (much more to come!)Guild system along with ranks and titlesFriend systemTrading systemAchievement & titlesQuestsParty systemCostumes & avatars","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Move Games Co","platforms":[{"id":0,"name":"PC"}]},{"id":3389,"name":"Sparkle 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7be/7be7f1d2f9e67fd57c84d769b751a307.jpeg","description":"A long time ago five enchanted keys were created. The keys were scattered around the lands, and they still remain undiscovered. Many have come to find them, and so far all have failed. Will you find the keys and unlock the secrets, or will you join the endless ranks of souls forever trapped within these lands?\nSparkle 2 is the long-awaited sequel to the award-winning hit game Sparkle enjoyed by millions of players since 2007. Sparkle 2 is an independent sequel and a spiritual successor to the first installment suitable for both new and existing fans of the series.Features\nExperience premium action puzzle gaming\nAdmire state of the art special effects\nExplore four game modes: Story, Survival, Challenge, and Cataclysm\nDiscover over 90 unique levels throughout the story\nSupercharge your Slinger with over 200 combinations of 16 different Enchantments\nFind exciting locations and delve deep into the mystery\nImmerse yourself in a story narrated with professional voice overs\nEnjoy the soundtrack by the award-winning composer Jonathan Geer","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"10tons","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":384521,"name":"Timberborn","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/016/016d750bcda6c71250c47f90b3debd03.jpg","description":"Lead a society of lumberpunk beavers. Humans have long gone extinct, will your civilization do any better?\r\nPlay as one of three distinct races\r\nUse ingenious timber-tech for the good of your society\r\nDid we mention beavers?\r\nTimberborn is currently in an open alpha. The game is developed by a small independent studio.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mechanistry","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15090,"name":"Spin Rush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c67/c673110ead3f0bdc6208b15e58aebad6.jpg","description":"About This GameAs you play the game, you level up and unlock different fun modes that can be played and explored.\nThere are many modes available to unlock and they are all different and challenging in their own way.ModesThere are up to 6 modes that can be unlocked and played. All of the modes are combined when playing in normal mode.\nFast mode: Dots fall faster as time progresses, so it’s more challenging to progress far.\nHexagon mode: Play with a hexagon cube and with two additional colors.\nWords mode: Words of various colors fall, while the dot is in another color to mix things up.\nTime mode: Don't stop the spinning cube or you’ll lose.\nTrippy mode: Colors change over time, so you have to keep eye on right colors to mix.\nFlipped mode: Camera rotates and controls are reversed every time a dot falls.Levels As you play, you will level up over time and as you progress, you will unlock new surprises and modes. Over time, levelling up will become harder, but also more rewarding as more interested modes become unlocked at higher levels.\nThe game responds to game music. Beats cause the screen to shake and the amazing sound effects give a better feeling to game. There are many soundtracks available for the\ndifferent game modes in addition to soundtracks with voice overs.\nAs well, there is an endless level, where all modes are combined together into one. That's\nmore interesting and advanced, but also harder to keep on track since the game is randomly\ngenerated.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crohack","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12417,"name":"Life is Feudal: Your Own","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0eb/0eb1a3cf878781e37495a0a6cee320ad.jpg","description":"Life is Feudal: Your Own is a truly hardcore sandbox RPG with captivating survival aspects. Described as a real life Medieval simulator, which caters for up to 64 players on a 3km x 3km gameworld, any and all paths are an option.\nIncluded in your purchase, all Life is Feudal:YO owners will receive one character to gain full access to Life is Feudal:MMO open beta tests and release.\nLiF:YO places you in a realistic feudal setting with the ability to host your own private world and set your own rules to suit your playstyle. There’s an in depth crafting system, a range of building features, and free terraforming across the map - meaning you can build your own house anywhere in the world. Team up with your friends and build a village or city and repel attacks by other players who want to ransack your lands!\nThe unique combat system is non-target and physics-based; the direction of your attack depends on mouse movement. Basic movements and directional attacks can be combined to create deadly combos with special harmful effects. Battle formations are also a new way to collaborate and control the situation on the battlefield with your fighting team. Co-operation and a good strategy within a formation will help you prevail against the enemy.\nEverything is tweakable and unique to you, including how your character progresses. The skill and stat cap system allows you to design a character molded to fit your style perfectly, for example. Even alchemy is unique; all recipes are randomized for each character thus the only way to learn is by experimentation.FeaturesUnique Features:\nFree Terraforming & Tunnel Building. 100% free terraforming and tunnel building means you can dig tunnels, mines and moats and expand them in all dimensions barely without limit! You can raise and lower ground levels with a landfall effect. Substances include soil, rock, granite, ore veins, clay, sand, and much more\nBattle Formation System. Strategize for massive battles and provide your units with certain bonuses with the formation system. Keep organised and inside the formation shape to continue to reap the benefits\nUnique Alchemy Combinations. There are over 40,000,000 alchemy combinations unique to each player! You need to learn, experiment and create your very own unique combinations. Complementing the hardcore feel of the game, alchemy is not simply a matter of character skill as it strongly emphasises spending time and resources on creating good recipes and combinations\nFull Seasonal Weather System. Much like in real life, LiF features seasonal weather that directly affects your life in this feudal world\nComplex Food & Cooking System. Cooking is no longer a secondary or non-existent skill. Being a good cook who knows many complex and tasty recipes means that you and your friends will be better fed and will receive skill bonuses\nRealistic Player Damage System. Based on human anatomy, with fractures and bleeding wounds, you can create unique and deadly combat tactics\nDouble Health & Stamina Bars. Double health and stamina bars represent better information about the status of your body. Players can be knocked unconscious or killed. They can also be temporarily out of breath or totally exhaustedThese are only a handful of the many features that make Life is Feudal:Your Own unique and true to life in a Medieval world.  With hundreds of personal choices and customizations on offer to create endless combinations, your imagination will be your only limitation.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bitbox","platforms":[{"id":0,"name":"PC"}]},{"id":2527,"name":"ARCADE GAME SERIES: GALAGA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/046/046b0a325b1f0acab900648e32528824.jpg","description":"First appearing in arcades in 1981, the masterpiece GALAGA finally comes to Steam!\nMove the fighter left and right, and destroy the waves of incoming aliens in this space-age shooter.\nDestroy all the enemies to advance to the next stage!\nRetrieve a captured fighter and combine into a Dual Fighter!\nTry your hand at Challenging Stages that appear after every few levels, and aim for a perfect score!\nWith multiple enemy formations, the high-risk, high-reward of the Dual Fighter, and the Challenging Stages, there's plenty here for even the most hardcore players!\nThis latest port comes with scanline and sound settings, and the option to switch between the old and new versions - perfect for true fans of the game.\nExperience the shining star of 80's arcades for yourself!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":812,"name":"Godus","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c58/c58d42e9022d3789d4b33ab3fe7eeb81.jpeg","description":"Have you ever wanted to play god? In GODUS, you can sculpt every inch of a beautiful world that you look down upon, where your population of Followers will settle and multiply. As you rule over your living, breathing society, a civilization will blossom across your land and offer you their belief. The more Followers that believe in you, the more powerful you will become. It is as simple to play as it is spectacular to behold. Come and lead an incredible journey - this delightful, charming world is waiting for you to make it your own.\nGODUS is currently in active cross-platform development for Windows PC, Mac OS and mobile devices where the gameplay experience will evolve and expand over time as we periodically deliver updates for the game.\nGODUS is brought to you by legendary designer and inventor of the god game genre, Peter Molyneux.Key Beta FeaturesYou can sculpt the entire world and make it truly unique to youSculpt every inch of an entirely moldable world in the most delightful way. Uncover a wealth of mysteries and surprises waiting to be unearthed beneath the landscape, and find others atop it.\nBe adored and worshipped by tiny, devoted Followers. Watch them live, learn and love in a fully simulated worldYour ever-gracious population of reactive, living Followers will need you and worship you unconditionally. You’re the god and they’re your playthings.\nCreate villages and towns, grow their population and sculpt the very lands on which they liveGroup your Followers together to create charming villages or thriving towns - specialize these into Building, Farming or Mining communities.\nLead Followers from your Homeworld and set sail on Voyages of Discovery to uncharted landsGuide your Followers as they embark on regular Voyages to new and undiscovered lands that hold great rewards.\nNurture the growth of a civilization as it rises from the dawn of the primitive age and advances throughout the ages of humanityChoose various types of stickers to unlock cards that level-up your population's society, technologies and faith. Cards go into your Timeline, which allows you to make advancements within an era and unlock new abilities.\nMeet the Astari - a fun loving, party going little tribe who worship the pursuit of happinessYour world is not empty. It’s also inhabited by the mischievous Astari, who will do everything they can to persuade your Followers to come and join them. As a god, you must use your powers to deal with these pesky people.\nCast miracles of both beauty and destruction - choose how to show your divine power, whether that be by growing forests or launching meteorsAs development continues you will see more God Powers being added that will enhance gameplay, adding depth and variety to the whole GODUS experience.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"22cans","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":452633,"name":"Gran Turismo 7","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f6/3f6a04b856f23310d3c2f5be8c5963f7.jpg","description":"Gran Turismo™ 7 builds on 22 years of experience to bring you the best features from the history of the franchise\n\nWhether you’re a competitive racer, collector, fine-tuning builder, livery designer, photographer or arcade fan – ignite your personal passion for cars with features inspired by the past, present and future of Gran Turismo™.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Polyphony Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":254656,"name":"Agony UNRATED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20e/20e679442c52d7d787429ca6dd65afae.jpg","description":"Please bear in mind that Agony is quite an \"old school\" game; non-linear, with a semi-open world, a lot of different paths, endings, exploration possibilities as well as secrets to uncover. Playing Agony is notably different than what you can get from modern, mostly linear and corridor-style horrors.STORY MODE\nYou will begin your journey as a tormented soul within the depths of hell, without any memories about your past.\nThe special ability to control people on your path, and even possess simply minded demons, gives you the necessary measures to survive in the extreme conditions you are in.\nBy exploring the hostile environment and interacting with other weary souls of the hellscape, the hero will soon understand that there is only one way to escape from Hell, and it will require meeting the mystical Red Goddess.AGONY MODE\nAgony features a full-fledged story mode as well as an open challenge system that\nrandomly generates levels for players to explore and survive to gain new Highscores.\nChallenge other players on the most brutal and malevolent environments.\nComplete the challenges of Agony Mode, and fight the Bosses, in several completely different environments, full of threats and traps!\nAgony throws you in the midst of hell where you strive to stay alive\nand solve the riddle behind the mysterious Red Goddess; architect of this place of sorrow\nand pain, and the sole entity with knowledge of how escape… but there is more to the\nstory than it seems. Haunted by nightmare creatures, You will gain the ability to possess\ndemons and other souls to find a way out of hell.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Tomasz Dutkiewicz","platforms":[{"id":0,"name":"PC"}]},{"id":21533,"name":"Zero Gear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b42/b42f7c3ec04f310dfbb11b11a1fefa62.jpg","description":"Zero Gear is physically-fueled, online multiplayer kart combat madness.\nDeck out your kart and character before jumping into one of many different game modes. Outrageous kinematic gameplay and weapons make every round a blast. The potential for tiny vehicular mayhem has never been so humongous! Boost, flip, spin, and slide your way to victory!\nUp to 8 players.\nCustomizable karts and characters.\nMultiple game modes to compete in, including Race, Tag, Goal, and Target modes.\nOver 15 maps to compete in.\nNon-stop physics driven action.\nRidiculous weapons and power-ups, including tornadoes, repulsor shields, and love-seeking L.U.V. bots.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Brian Cronin","platforms":[{"id":0,"name":"PC"}]},{"id":21400,"name":"Earthworm Jim 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2a/d2a67fc84413d5341408da527e7dde60.jpg","description":"From Evil the Cat’s’Circus of the Scars’ to the planet of Meat, join Jim on a madcap chase across the galaxy. Saving cows, thwarting lawyers and outsmarting Psy-Crow are all in a day’s work for Jim. Are you up to the challenge? Can you handle the awesome new weapons? Excellent! Then stop reading this. Try it now! Trust no one, play it yourself.. or EAT DIRT!\nOver 5 new weapons to choose from! Guns, guns, guns, guns!\nUntraditional level designs that only Shiny Entertainment was capable of creating!\nReturning favorite characters: Princess What’s-Her-Name, Psy-Crow, Peter Puppy, Bob the Goldfish, and several new villains as well!\nSee Jim disguise as a blind cave salamander (no, really… we’re not kidding on this one!)\nWhip, run, jump, fly, and Snott swing your way to victory!","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Shiny Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SNES"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Genesis"}]},{"id":15306,"name":"Interstellar Marines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d44/d442600a08c72c1f98e759aaf5852e09.jpg","description":"Interstellar Marines is an immersive tactical sci-fi First Person Simulator in the making, offering a unique blend of tactical gameplay, dynamic environments and non-scriptet AI. Play Singleplayer or Co-op/PvP on servers around the world.\nInterstellar Marines is inspired by movies such as Aliens, Starship Troopers and Saving Private Ryan; and games such as Half-Life, Deus Ex, System Shock 2, and Rainbow Six 3: Raven Shield.\nInterstellar Marines is all about evolving the FPS recipe with the inspirations we've assimilated since the birth of the genre. Our goal is an evolutionary leap forward driven by our compulsive interest in science fiction, role-playing, military realism, and respect for first person immersion.Interstellar Warfare InitiativeIt is the dawn of the 22nd century, a time of great hopes and expectations. The discovery of a new and inexhaustible well of power known as Zero Point Energy has revolutionized space travel. Man has escaped the confines of Mother Earth, and gone on to colonize the solar system.\nBut far away from public awareness an ambitious military project has already taken Man beyond the final frontier, and into the regions of the stars. The powerful Interplanetary Treaty Organization, ITO, is secretly constructing the first human settlement in another star system.\nYou are a special forces soldier training to join the Interstellar Marines, a  part of the secret Interstellar Warfare Initiative being established to protect humanity against potential threats from the confines of the unknown universe.\nIt's time to evaluate the Interstellar Warfare Initiative and program evaluations are taking place at The Vault, ITO’s most advanced military facility on Earth enclosed deep beneath Groom Lake, Nevada. Supervised by SARA, ITO’s central neural network AI, SARA will program artificial weather and advanced combat training robots to test each warfare initiative to the limits.\nThis is where the game begins ...7 Singleplayer/Co-op MissionsPlay 5 co-op and single-player missions against unscripted AI with dynamic environment effects or two pivotal missions inside the Interstellar Marines universe, The NeuroGen Incident and Assault on Starcrown Aerospace. Play singleplayer or co-op with up to three friends in intense action with more co-op and singleplayer missions to come!Wargames (Sandbox Combat Arena)Unique sandbox combat arena in the making. Wargames is played across 9 distinct interconnected environment zones allowing 64 players to join in the scavenge for combat points, playing alone or in co-op. We have a special Wargames Steam Leaderboard which tracks Combat Points globally, monthly, and survivors of Wargames.\n9 Unique Multiplayer Maps Across 3 Game ModesTake your friends out in Deadlock, Deathmatch, and Team Deathmatch on maps featuring dynamic environment effects such as time of day, rain, thunder and lightning, emergency lighting, fire alarms, moving platforms etc.Realistic SimulationWith a physics-based dynamic character controller there are no floating hands, and you can even see your feet! The physically present combat helmet has a HUD projected onto the visor and is affected by dust, rain, fogging, and damage. Aim down the sight for the long shots and use the tactical laser to assist aim when hip firing, as there are no artificial crosshairs to break immersion. Use the intuitive crouch and cover system; spacebar (default) peeks over cover, and looking down leans you forward to see over ledges. You can also shoot out the lights and prowl in darkness, or use the tactical flashlight if you’re afraid of the dark.\nWe hope you enjoy the game, and look forward to developing it with you as we progress through Early Access!\nFOR THE LOVE OF THE GAME,\nYour team at Zero Point Software","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zero Point Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10103,"name":"Rise to Ruins","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abb/abbe5ac504f7bbebedde1707215627aa.jpg","description":"Follow Development\nAbout the Game\nRise to Ruins is at heart a godlike village simulator, but it also throws in plenty of familiar game play mechanics from classic 90s era real-time strategy games like Warcraft, along with some tower defense and survival elements in an attempt to create a new kind of village simulator. The goal is to try to bridge the gap between the depth and complexity of traditional village simulators, the fun of godlikes and the simplicity of real-time strategy.\nBuild a village, and die trying!A major part of the game is village management, and trying to discover new and creative ways to use the tools at your disposal to keep yourself alive as long as possible. In this game, you will lose frequently, but with every failure you learn a little bit more about how to survive and apply that knowledge to your next attempt.\nSeveral Game ModesCurrently, the game offers three game modes. Survival, Sandbox and Peaceful.\nSurvival is the game the way it was meant to be played, as a brutal survival style village sim, you will probably die often trying to figure out the best way to survive, but that's half the fun right?!\nPeaceful is very similar to Survival, but it's balanced much like a traditional village simulator with some godlike and RTS elements sprinkled on top. The monster spawn rates are much lower, and the main focus is keeping your village happy and fed. It's a very easy mode, designed for casual players, or players just wanting to experiment.\nSandbox, like the name implies, is a mode where you can play around with the game mechanics. Change the time of day, weather, spawn monsters or villagers, or even edit the map while you're playing on it. This is the ultimate \"Screw around\" mode for players wanting to play with the game mechanics.\nGodlike ElementsNot only can you manage your village, but you also have many godlike abilities at your disposal. You can alter the terrain, blast enemies from afar, pick up objects or creatures, heal your villagers, speed up resource growth and all sorts of other fun godly stuff.\nTons of map set themes!Every set of maps will follow a certain theme (Forest, Desert, Underground, etc). Most of the current screenshots only feature a few of these map sets. But many more are planned.\nThe Soundtrack!A full original soundtrack, made by Bibiki Garcia that blends orchestral instruments in a way fans of old 1990s era PC gaming will love and remember!\nSixtyGig Games is a DRM free independent game developer! Rise to Ruins will not now or ever in the future have any sort of DRM! Piracy protection only hurts you guys, the loyal paying players. So you rest assured knowing that once you buy yourself a copy of Rise to Ruins you'll never again have to concern yourself with nagging questions about if you can continue playing the game down the road due to something like always-online logins, lost registration codes or because you bought a new computer and you're only licensed to put the game on one. All I ask from you is to be reasonable and responsible, you can buy the game and play it as much as you like, wherever you like. Just tell your friends to support my DRM-Free philosophy and buy their own copy! Free Content Patches, no paid-DLC\nI don't believe in paying for Downloaded Content. If you buy Rise to Ruins you will have access to the entire game and all the content I'll ever create for this it, forever! I believe DLC is greedy, and you deserve to have the full gaming experience from day 1, right out of the (figurative) box!\nYour feedback is extremely important. You can reply here or head on over to the Official Website and help shape the direction of development! :)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Raymond Doerr","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9558,"name":"NVIDIA VR Funhouse","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ea/1ea60c9e706655205296e8bd7e6d00cf.jpg","description":"Note: This game requires a high end GeForce GTX GPU and CPU – please ensure you meet the system requirements below before downloading\nStep right up to VR Funhouse, and enter a virtual carnival full of fun and games.  Set targets ablaze with flaming arrows.  Test your skill shooting skeet.  See how many moles you can whack, and much more.  VR Funhouse combines virtual reality, cutting-edge NVIDIA VRWorks graphics, and advanced NVIDIA GameWorks effects to deliver a new level of interactive gameplay and immersion.Key Features\nVR Funhouse features seven mini-games set in a virtual carnival environment!\nTest your skill shooting targets with a pair of pistols at the Shooting Gallery or take aim at moving targets shot from a skeet cannon.\nSplatter clowns with squirt guns and green goo, or break out a bow and fiery arrows to shoot targets up in flames.\nMole Boxing and Whack-A-Mole features zany, smiley moles.  You can’t wait to knock’em silly.\nVR Funhouse takes advantage of advanced NVIDIA VRWorks graphics features to improve performance and maximize image quality:\nVR SLI enables two GPUs to work in parallel to render graphics, with one GPU rendering the right eye and one GPU rendering the left eye.  Combined with a 3rd GPU for PhysX, VR Funhouse brings both amazing graphics and physics fun.\nVRWorks Multi-res Shading speeds up performance in VR Funhouse by intelligently rendering full detail only where your eyes can see it.\nNVIDIA GameWorks adds immersive and interactive effects never before seen in VR:\nPhysX Destruction generates pervasive destruction that lets you see your impact on the environment.\nNVIDIA FleX Fluids demonstrate realistic liquid when players blast a clown with goo.  Flow enables realistic, volumetric fire simulation when you light your arrow on fire and shoot it from your bow.\nNVIDIA Flow enables realistic, volumetric fire simulation when you light your arrow on fire and shoot it from your bow.\nNVIDIA HairWorks simulates and renders realistic hair and fur.\nVR Funhouse Mods\nPlay new mods for VR Funhouse including Big Top, Great Moles of Fire, Super Whack-A-Mole, Tommy Gun and Zero Gravity Goo\nVR Funhouse Mod Kit & Source Code\nDownload and use the VR Funhouse Mod Kit to create your own mods and share them with the community.\nUpload your mods to Steam Workshop for the community to enjoy.\nThe VR Funhouse Mod Kit comes complete with artwork, assets and blueprintsCompatible HardwareVR Funhouse is compatible only with select GeForce GTX Graphics cards and HTC Vive headsets. Please see below for recommended configurations per quality setting:\nWe recommend installing GeForce Game Ready Driver version 372.70 for the best experience.\nLow Graphics Setting\nGeForce GTX 1070\nGeForce GTX 1060\nGeForce GTX 980TiMedium Graphics Setting\nGeForce GTX 1080High Graphics Setting\nGeForce GTX 1080 or greater*\nGeForce GTX 980Ti in SLI or greater**Dedicated PhysX card: GTX 980Ti or greater\nCompatible VR HMD: HTC Vive","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lightspeed Studios™","platforms":[{"id":0,"name":"PC"}]},{"id":2064,"name":"Grow Up","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/693/693e3c00e2e57b3a32aac1eb9d5979f4.jpg","description":"While out exploring the galaxy with MOM, BUD’s parental spaceship, she goes to pieces. Like, literally – MOM’s all over the place. The positioning of that moon was terribly inconsiderate. Now her ship parts are scattered far and wide across an entire alien planet so rich in flora and fauna it would make even the most jaded galactic gardener’s head spin. It’s up to BUD to collect all her parts and get them back to the moon.\nJoin this adorable wobbly robot on his fantastical acroBUDic adventure to the moon.\nCollect MOM’s ship parts with the help of your new friend POD. She likes planets. A lot.\nExplore an entire alien planet filled with excitement and wonder. And a Flungus.\nWalking’s overrated. Tuck BUD into Ball mode to boost, bounce and roll around the planet.\nTake to the air and soar between floating islands like a big metal bird with the Power Glider.\nExercise those green fingers and overcome obstacles by spawning any plant you’ve found with the Floradex 3000.\nRide giant Starplants into the sky (yes, we know what they look like…)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":426094,"name":"Biped","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5de/5de60285605b1dc73274a8963be1245a.jpg","description":"Biped is a co-op action game with a strong emphasis on physics. The players control cute\nrobots Aku and Sila on a fun and bonding adventure, overcoming unique puzzles and\nchallenges to save the Earth from going dark. Biped supports both couch co-op and online\nmultiplayer and can be played solo, too.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"NEXT Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":61735,"name":"RUSH: A Disney • PIXAR Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e61/e615aa48aa8f3614be184eabe41fdafe.jpg","description":"Rush: A Disney•Pixar Adventure invites families and fans of all ages to experience the worlds of six beloved Disney•Pixar films like never before. Team up with characters from The Incredibles, Ratatouille, Up, Cars, Toy Story, and Finding Dory to solve puzzles and uncover hidden secrets.\nYou and your favorite Pixar character can interact on screen and play cooperatively to solve challenges. Move from fast-paced puzzle-solving to moments of pulse-pounding agility and speed.\nFeatures:\n•\tSave the day in your own fast-paced adventure. Invite your whole family to join Woody, Lightning McQueen and others in this one-of-a-kind Pixar experience\n•\tJoin forces with Pixar characters to help you through each challenge or play on the same screen through split-screen couch co-op at home with a friend.\n•\tExplore and discover the sights and sounds of each Pixar world as you solve puzzles and search hidden secrets","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Asobo Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":58334,"name":"Smoke And Sacrifice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9be/9be7e3451f2ced9cb4c927707f3633f4.jpg","description":"Smoke and Sacrifice is an open-world, narrative-driven RPG, where exploiting living ecosystems is the key to your survival. Craft, fight, survive and explore the huge open world in this beautifully hand-painted, gothic adventure where every character has their tale to tell.\nSachi’s home is the one tiny patch of fertile land which remains in an icy wasteland of a world. Her farming community thrives thanks to their devotion to the blazing Sun Tree, which replaces the lost light of the failed sun. After sacrificing her firstborn child to the Sun Tree, Sachi discovers a darker secret beneath the aura of priestly benevolence. Will she discover the truth hidden in the secret underworld, or perish in its swirling, deadly smoke?\nWith the odds stacked against her, strange creatures challenging her every step, and the ever-looming smoke waiting to steal life and memory, will Sachi ever discover the truth of what happened to her son?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":24981,"name":"Peter Jackson's King Kong: The Official Game of the Movie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28c/28c16149aa0e4e3633a792e2c18a9888.jpg","description":"Embark on an epic adventure created in collaboration with Academy\nAward-winning director Peter Jackson and based on the Universal\nPictures' film. Survive as Jack in a world crawling with predators and\nlive the legends as Kong.\n\nFeatures\n\n• Use weapons, traps, and your team wisely to survive in first-person as\nJack.\n• Break jaws, slam enemies, and throw massive objects in Kong's\nthird-person battles.\n• Experience the movie adventure, from mythical\nSkull Island to the skyscrapers of New York.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"}]},{"id":22817,"name":"Dungeon Keeper 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/790/790a36a71c4fabcbe099b440c54b35f8.jpg","description":"It feels good to be bad, but it feels even better to be the embodiment of evil! Discover your evil side as you build your own underground kingdom. Carve out a living, breathing world and attract a host of devilish creatures to swell the ranks of your dark hoards. Form an alliance with the Horned Reaper and expand your empire in your quest to reach the daylight and invade the realms above.\nDungeon Keeper 2 is everything its predecessor was, only better and badder! It is probably one of the most addictive and fun games ever created; with tons of dark humor, smooth gameplay, and high replayability value. In addition to that there is a well designed multiplayer mode and a pet-dungeon module that tests your ability to build the ultimate underground labyrinth filled with traps, monsters, and other hellish devices. If you liked Dungeon Keeper you will love this ultimate installment of the Bullfrog series.Sequel to a timeless classic that takes all what is good from its predecessor and further improves it with new, brilliant, ideas\nHighly addictive gameplay includes: managing on micro and macro level, personally possessing your creatures, and slapping chickens\nStill unmatched masterpiece, a true multi-genre cross-over done right","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"PC"}]},{"id":18395,"name":"Alchemy Mysteries: Prague Legends","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bef/befa6618cd9953d25d09ddfce7e8fbf7.jpg","description":"Our new games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other adventures:http://store.steampowered.com/app/431260/\nhttp://store.steampowered.com/app/497400/\nTry other adventures:http://store.steampowered.com/app/347430\nhttp://store.steampowered.com/app/396790\nhttp://store.steampowered.com/app/326180\nAbout the GameFollow orphan Eva on a trip to mystical Prague in Alchemy Mysteries: Prague Legends. After a relative's mysterious death, Eva inherits an ancient house in Prague. Knowing nothing about her past, she goes looking for answers. There she uncovers secrets about the house, her family and an insidious plan of the black alchemist. A wonderful and dangerous adventure is about to begin. Are you ready?\n- Mysterious atmosphere in old Prague\n- Alchemy items and secrets to find\n- Fantastic puzzles to solve","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17863,"name":"Men of War: Vietnam","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/496/496ef6816b44b0f5067a26a3f0235aef.jpg","description":"Men of War: Vietnam is a new game for the critically acclaimed series. The new, story-driven campaign lets you taste the explosive mix of the jungle, Hueys and rock-n-roll in 1968. The US campaign focuses on a team of elite special ops soldiers, and each one of them has a personality.\nThe unit includes Sergeant John Merrill, machine-gunner Jim Walsh, sniper Sonny Armstrong, grenade launcher operator Carl Dillan and combat engineer Bill Kirby. In some missions they can count only on themselves, while in the others they act together with regular US and South-Vietnamese troops. The North Vietnam campaign tells the story of two Soviet military consultants and two soldiers of the North Vietnam Army who are the only survivors of an ambush prepared by the US troops. The task of getting back to the North Vietnam territory is a difficult one – they have no means of radio communication, no wheeled vehicles, and it’s too far to make it there on foot. On their way these survivors get involved in a chain of bloodbath engagements and find themselves in the dead center of the well-known Tet offensive.\nMissions range from special operations (rescuing a shot-down pilot, escorting a reporter, etc.) to full scale battles.\nKey Features\t\t\t\t\tThere are two sides in every story, so two new story-driven campaigns attempt to show the war from both sides.\nBreathtaking missions including an ambush on the Ho Chi Minh trail, a game of cat and mouse in the Mekong Delta, raids into Cambodia and Laos, bridge defense during the Tet offensive and more.\nNew weapons and units: M-16, T-54, M-113, Patton III, M-60, AK-47, M-14, RPG-2, M-72 LAW, RPK and many more.\nMultiplayer mode – co-op for up to 4 players.\n\nMen of War is affected by the GameSpy shutdown on the 31st of May. You can continue to play the game through LAN, DirectIP and GameRanger.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":17658,"name":"Resonance","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fcc/fccf1a1d0c1615d4132bc779b4de7bb6.jpg","description":"The storyIn Resonance you experience the story of the space pilot Robert Wallace and the neuroscientist Catriona Bruce. Through a chain of circumstances, these divorced spouses are chosen to explore the space station DIOMHAIR 16 in the year 2301, to which all radio contact has been lost. However, their landing is anything but smooth and so the two are confronted with bigger problems than their unprocessed separation. Terrible things have happened on board and soon it is not only survivors but also a way off the station to find. In the process, the characters not only learn the dark secrets that led to the disaster on the DIOMHAIR 16, but also get caught up in supernatural events, the resonances. In the process, they delve into their own pasts and relive formative moments of their lives together. The fate of the two and that of the entire space station is in your hands. Will you manage to repair what has been destroyed?FeaturesExplore a science fiction drama on three timelines\nLearn from records what led to the sinking of the DIOMHAIR 16. Live through the resonances and decide for yourself how Robert and Catriona behaved at crucial moments in their relationship, creating your very own reality. Get to know the couple's relationship from both sides and form your own judgment. Their decisions and actions also affect the present, in which the mismatched couple make their way through the dead space station in search of an escape route.\nIn space, only your partner can hear you scream\nHost your own game and invite a friend. Decide in advance which of you will take on the roles of Robert and Catriona, so two of you can experience their emotional adventure. Only by playing cooperatively will you be able to move forward and overcome the tricky challenges and tough decisions that await you at DIOMHAIR 16.\nThe right tools for the job\nFind and learn how to use advanced portable tools, which you will find aboard the DIOMHAIR and integrate into your spacesuit. Move objects with the telekinetic powers of the forcetool or fight blazing flames with the fire extinguisher. Only by skillful use of the tools is there any progress. And thanks to their digital journal, you'll document every record you find and can look at it over and over again. Do you have what it takes to traverse a damaged space station?\nTo the stars and beyond\nIn 2301, the Interstellar Life and Military Cooperation, as a joint project of wealthy industrialists is the dominant space agency. Explore DIOMHAIR 16, which the Cooperation operated as a research station, and be prepared to discover the ethically and morally questionable experiments conducted here in the service of science. But be sure that it will not be a pretty sight. On the hands of the Cooperation and on the corridors of the station, there is the blood of those who went too far.The origins of ResonanceMittweida University of Applied Sciences has been offering the Media Informatics and Interactive Entertainment degree program since 2011 and has since been training creative students in a variety of disciplines. The goals and content of this bachelor's degree program are shaped by the current professional image of modern media informatics in the Web 2.0 environment. The course of studies offers students the opportunity to educate themselves in the field of designing creative content or creating informatic applications as they wish. In the fifth semester, all media informatics students of the class of 2016 developed Resonance in a development team of 40 students over a period of almost 4 months. This final project was presented to the public at beta, the university's in-house games conference.\nWe would like to thank our hardworking team leaders, our great project teams, our helpers, friends, family and everyone else who gave us patience, strength and trust along the way. We are proud of Resonance and hope you have fun playing it.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"XII Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":2366,"name":"Shiftlings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8cf/8cf38f3e2c9ad254019ddbc6a1a29b3f.jpg","description":"Purchase Shiftlings and get access to the Shiftlings Screen Saver! Enjoy our tenacious technicians bouncing around your screen all day long!\nThe galaxy's biggest no-brainer!\nControl two adorably dim-witted alien space janitors on their quirky quest to repair the galaxy!Strategic Single Player & Co-op Missions:Play on your own, challenge a friend locally or across the galaxy (online).50 Dynamic Interplanetary Puzzles:5 themed planets with 10 levels each which increases in difficulty as players advance.Cosmic Challenges of Size & Space:Shift weight between the custodian cosmonauts quickly to avoid traps.High Re-playability:Blast back to the beginning to discover new hidden collectibles to unlock more secrets to the universe.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":2157,"name":"SolForge","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7a/e7ad0bc3b056a54f2a6451b58950769d.jpeg","description":"Designed by the creators of Magic: The Gathering and the Ascension Deckbuilding Game, SolForge is a free-to-play digital collectible game in which players construct their own decks to challenge their friends or battle against the computer.  There are multiple modes of play, including tournaments, drafts, ranked play, campaign mode, and a variety of new events every week!  Players can customize their decks with cards from their collection that they can earn through gameplay or purchase from the store. Try it now for free!\nThe core mechanic in SolForge is leveling. Whenever you play a card, that card levels up into a new, more powerful version. As the game progresses, you level up, and gain access to your more powerful higher level cards. Some cards start off weak and level up into powerhouses, while others start off strong and don't improve much as they level, presenting strategic and tactical choices that will challenge even the most seasoned gaming veterans.\nWith hundreds of cards that each transform as you play, SolForge is a game unlike any other.  Try it free today!Key Features  Challenge your friends or play against AI opponents with multiple levels of difficulty\nSimple to learn, difficult to master.\nTutorial to get you playing right away\nUnique leveling mechanic transforms your cards as you play\nOnline Play\nDeck Customization\nTournaments and Draft Mode\nCard Forging System\nCampaign Mode\nAnd more!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Stone Blade Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":602328,"name":"Soulworker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de8/de8e5a1fbe2b2bdac5c460a32e50e9cf.jpg","description":"ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ“The world will be reborn under fear and despair”\nㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ-Unknown, Rosca Year 9999 –\n\nChosen by the ancient god Rosca, SoulWorkers came down to save the world from darkness.\nSoulWorkers use extreme emotions such as revenge, madness, and sorrow to power their individualized abilities to protect the world.\nJoin now and save the world in the name of a SoulWorker.Main CharactersBOSS Unique fighting styles allowing you to play with your personalized skill combinations.\nScenic background animations help your SoulWorker come to life\nFascinating storylines in a dark post-apocalyptic scene\nLarge PvE contents with more than 100+ dungeons","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Lion Games Co","platforms":[{"id":0,"name":"PC"}]},{"id":257202,"name":"Creaks","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b11/b111432ecdacb92555992890fc9b9951.jpg","description":"Meet your new neighbours.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Amanita Design","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":27978,"name":"Donkey Kong Country: Tropical Freeze","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c31/c31655ab2640da333f5ca3f223d33a12.jpg","description":"Traverse islands packed with platforming perfection and nonstop action as the classic Kongs in the original game, or mix things up by playing the story as Funky Kong in new Funky Mode!\r\n\r\nArctic invaders have turned Donkey Kong Island into their personal frozen fortress, and it's up to you to save the day. Play as Donkey Kong in Original Mode and team up with Diddy Kong, Dixie Kong, and Cranky Kong—each with unique abilities—to overcome platforming challenges and frosty foes.\r\n\r\nFor a more accessible experience, start a game in Funky Mode to enjoy a range of gameplay updates and a new main-character option, spectacular surfing simian Funky Kong! His extra hearts and unique abilities make for a more relaxed gaming experience. And no matter which mode you choose, a wealth of collectibles and two-player co-op round out the fun!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Retro Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"}]},{"id":17122,"name":"Crazy Machines 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c41/c4152cd77390d5850cd998e39c640ec7.jpg","description":"Complete Pack & Everything Pack\nAbout the GameCrazy Machines 2 is packed with all new features to help you create your wackiest \"Rube Goldberg-style\" contraptions yet! All new elements, plus an amazing 3D physics engine lets you craft even more complex gadgets and effects.\nGo on tour with the crazy professor and put your skills to the test with challenges from around the globe. Travel, from the bazaars of Egypt to the white sands of the Caribbean, then blast off into space for an out of this world gaming experience. Check out the crazy machines community online! Post machines you've created and download those made by others. Compete for tropies and high ratings.\nKey Features\t\t\t\t\tAll new \"Rube Goldberg-style\" puzzles\nOver 150 elements to create and destroy through 200 levels!\nWorld tour, online, and free-style game modes\nAll new parts: amazing lightning machines and laser beams!\nHall of Fame: Win a trophy for your contraption\nFun for the whole family\nOnline community!\nIncredible 3D graphics with brand new effects!\nAgeia PhysX hardware support","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Fakt Software","platforms":[{"id":0,"name":"PC"}]},{"id":13104,"name":"Forbidden planet","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d86/d8662e76197435e36ae1232d6e8aaf65.jpg","description":"“Of course there are worlds. Millions of them! Every star you see has worlds, and most of those you don't see.”\n― Isaac Asimov, Pebble in the Sky\n\"Forbidden Planet\" is a Space Strategy and Tower Defence like Game.\nYou control a small spaceship and your main goal is to protect your own home planet.\nExplore the universe for resources.\nColonize other planets.\nDefend from the asteroids.\n----------------------------------------------\nForbidden Planet features:\n• Combination of 2D and 3D graphics\n• Deep Strategic gameplay\n• Planets, Spaceships, Asteroids and the deep Universe.\nmusic by Projecteur.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Faton","platforms":[{"id":0,"name":"PC"}]},{"id":7594,"name":"Concrete Jungle","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca9/ca90343a22a7b7c25d801a506f881347.jpeg","description":"A city planning deck-building game!\nConcrete Jungle is a new take on the city building genre that swaps micro-management for a more strategic and puzzle-orientated style of city planning.\nYou have a deck of selected cards which you can use to place buildings. Each building will affect it's surroundings in different ways. The aim of the game is to clear city blocks by gathering the required number of points from your residents, giving more room to build. As the city grows, bigger and better new buildings can be added to your deck!\nAs you get opportunities to hone and refine your deck, residents will demand more from you. You'll find yourself inadvertently creating zoning puzzles- playing against your own past planning decisions.\nAlternatively engage in competitive city planning against challenging AI or local players. Take it in turns to place buildings in the same city and battle over the affection of your citizens!Features\nOver 230 cards available (no micro-transactions)\n8 Playable characters each with their own skill trees, unique cards and play style.\nHilarious fully voice-acted story mode!\nCompetitive city planning featuring challenging AI in 'Versus' mode.\nLocal competitive/co-op multiplayer for up to 4 players or AI.\nGorgeous vibrant, detailed isometric graphics, day/night and weather effects.\nRich and atmospheric soundtrack featuring Xerxes, Saad Ali, D.P. Kaufman & Mokhov.\nSteam achievements, stats, trading cards & leaderboards.\nSupport for any resolution, border-less window full-screen and controller support.\nFeaturing voice talent from Angela Mayans, Ben Britton, Ruth Rosen, Ed Bretten, Kyle Chapple, John Mondelli and Barbara Hawkins.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"ColePowered Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":22445,"name":"RIP - Trilogy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2f/c2f4aa10225d6571d019d5741e2037c1.jpg","description":"With the completion of the third title in the RIP series, the RIP games have become an instant classic in the arcade-shooter genre. RIP  Trilogy brings all three RIP titles into one exciting and heart-pounding pack.\nRIP\nNot afraid of Death? What if he is accompanied by Halloween and Rock-N-Roll? Play the part of these antiheroes and go to war in this all-out action experience! Each character has their own strengths and skills, but this is not a game for the faint of heart. With over 40 levels to RIP through, the results are murderous!\n40 levels of murder and mayhem\nA variety of guns and battle magic\nThree chilling characters\nA toned-down, less violent kid's modeRIP2  Strike Back\nYour favorite antiheroes are here to strike back with another score to settle. Death, Halloween and Rock-N-Roll...each character has his own strengths and skills, so pick one and start shooting. In Story Mode, you'll fight through 60 furious levels using an arsenal of upgradeable weapons, tanks, helicopters and turrets or for a quick adrenaline fix, play Rush Mode and see how long you can last.\nChoose from a large arsenal of weapons\nAssorted vehicles including gun turrets, tanks and helicopters\nVariety of abilities and power-ups\n60 levels of unlimited gameplay\nHuge boss levels for more challenge\nTwo modes of play; Rush Mode or Story ModeRIP3  The Last Hero\nRIP3  The Last Hero combines the dynamics of a hardcore shooter while preserving the elusive classic arcade appeal and never lets up on the intense action. Every level presents a new challenge, requiring you to not only prove your sharp-shooting, but to think and act tactically.\nThe terrain and environments must be employed to survive waves of adversaries, but since all in-game objects are destructible, you must think fast. Your hero will travel all over the world from the African jungle to the Arctic snow, through secret labs and bunkers, in the streets and skyscrapers of Metropolis city and also go into deep space using a hijacked spaceship.\n100 levels of arcade shooting action\n6 unique playable characters with varied and powerful skills to develop\nA huge arsenal of destructive weaponry, each with 2 shooting modes\nCapture and control military vehicles, including Tanks, Helicopters and Battle Turrets\nFully destructible battlefield - all the objects can be damaged and destroyed\nIncludes a space adventure minigame, where you pilot the Vostok-23 starship\n12 Huge, challenging bosses evoke classic arcade gameplay\n3 difficulty level settings to increase the intensity\nSpecial bonuses and secrets are scattered throughout the game\nCooperative multiplayer for two players to battle against the enemy hordes\nMultiplayer death-match for up to 6 players over LAN","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Elephant Games","platforms":[{"id":0,"name":"PC"}]},{"id":20756,"name":"Disciples III: Reincarnation","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/982/982407b1e94c83d19fcfb38f428cd1f5.jpg","description":"A true reincarnation of the legendary series!\nThe Almighty has turned away from Nevendaar and its denizens. He is busy thinking about the fate of the world. Above Nevendaar, rent by perpetual wars, a new star flashed out. What will it bring with it? Who will claim its great power? Immerse in the struggle of four powerful races!\n\"Disciples III: Reincarnation\" offers a revamped and enhanced version of \"Disciples III: Renaissance\" plus the addon \"Resurrection\" with all new features, a revised battle engine and all new graphics.\nFeatures:\nUnique visual style and magnificent gothic atmosphere with new graphics, new features and an enhanced battle system\nDramatic and intriguing plot, written by Ekaterina Stadnikova, the author of the most successful Disciples-themed novel “Precious Blood”\nNew combat and magic system. Dozens of new global spells\nTotems and flags in the inventory will change the balance on the battlefield\nAquatic spaces with majestic ships and terrifying bosses\nOver 180 hours of gameplay. Four different factions, 27 large detailed missions, over 70 new side quests, significantly extending the main storyline\nOver 200 new objects on land and sea plus 13 new neutral units.\nMultiplayer in hot-seat mode and over the net. Engage neutral units and get them to fight on your side.\nGaming editor to create your own campaigns.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Akella","platforms":[{"id":0,"name":"PC"}]},{"id":17517,"name":"Convoy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49a/49a3868cd3d21f99943fd08fa68db4c7.jpg","description":"Convoy is a tactical roguelike-like inspired by Mad Max and FTL in which you cross a wasteland in search of parts for your broken ship.\nPresented in pixel art and set in a future post-apocalyptic setting, Convoy is a squad based tactical roguelike-like in its core. You travel with your combat vehicles and convoy across a wasteland to find parts needed to repair your broken spaceship. During your journey you will encounter strangers in randomized scenarios by picking up radio signals.\nDepending on the choices you make, signals can either lead to tactical combat, text based dialogue or chance based role-play. Whatever choice you make, you need to keep your convoy and its cargo safe from raiders, privateers and other enemies. Keep upgrading your vehicles, as death is permanent in Convoy.\nFeatures\nA new take on tactical combat: Combat plays out in real time as a high-speed car chase where you need to position your units and use abilities to maximise their effectiveness.\nExploration pays: You will encounter many different radio signals, each with a text based event. What doesn’t kill you may reward you with loot.\nFully customizable units: Each unit can be upgraded and outfitted with different weapons and abilities, allowing you to customize them to your needs.\nA randomized planet: Each play-through features different main and side objectives, events, choices, and different consequences to your actions.\nA cold war turning hot: Three factions vie for control over the planet, your actions tip the scales of balance making you an enemy to everyone. As each faction grows in strength, you need to keep up.\nPermadeath at the core: Knowing one wrong move could lead to certain death puts you constantly on edge.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Convoy Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":619533,"name":"Tinykin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a3/2a35da986abc10082c27c3d230ccf1e1.jpg","description":"Milo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!\nTeam up with the mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!\n\nExplore cities of ants, beetles and other insects built inside of a giant house\nMeet characters everywhere you go and learn their stories and history\nCatch over a hundred tinykin in each city, and use their special abilities to climb higher, break down doors and solve the city's problems!\nSkateboard around on Milo's tiny soap-board! Jump, grind and hover around the house\nCollect upgrades to improve Milo's bubble-pack, build out the Ardwin Museum and complete Ridmi's mysterious machine!\"\n\nFind a way home through a sprawling ant-sized metropolis, and unravel Earth's biggest mystery!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Splashteam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]}]