[{"id":382761,"name":"Eternal Hope","genre":"Adventure","price":0.0,"description":"Eternal Hope is a puzzle-adventure game about a boy who must travel between two worlds in search of his beloved one's soul, trying to find a way to bring her back to life. Embark on a journey of love and hope and figure out clever ways to overcome obstacles in your path. Use your newly acquired ability to enter the Shadow World - a mirrored dimension inhabited by corrupted creatures. Explore the beautiful world of Eternal Hope, making friends and enemies along the way and unraveling ancient secrets.Features Solve puzzles using your ability to change dimensions\nUse creatures from the Shadow World to help you solve puzzles and overcome obstacles in your path\nUnravel the story and secrets about the places you visit on your journey\nFind out about your past\nFace enemies and figure out a way to avoid them\nSearch for your beloved one's soul and try to find a way to bring her back","imageUrl":"https://media.rawg.io/media/screenshots/f7b/f7b3624ffb84dff41d7b7cea1342af8f.jpg","releaseYear":2020,"developer":"Double Hit Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":364911,"name":"Crowd Control","genre":"Strategy","price":0.0,"description":"Crowd control is a game about risk & play style exploration.\nUp to four players spend a minute and a half converting as many crowd members to their colour. this is done by moving their wave with 4 directional keys.SummaryThe Mexican wave:\nan effect resembling a moving wave produced by successive sections of the crowd in a stadium standing up, raising their arms, lowering them, and sitting down again.\nFour players each control an area where crowd members feel the need to party! These people somehow change the colour of their shirts, jump up, and cheer loud noises. Each time someone jumps while wearing your coloured shirt your score increases by one. The team with the highest  score wins.\nYou cannot  convert crowd members that have recently jumped (indicated by the colour fading over time). If you get cut off by other player's recent jumpers you have to navigate back to the last place you colour jumped and continue the wave another direction.\nThroughout the duration of the game players can find party people that are indicated by the small light green arrow above their heads. Party people send a shock wave of jumpers out in every direction but watch out as occasionally it might not be your colour of wave.\nTo change the AI to player ratio you can left click on a player while the game is paused to toggle the AI.ControlsPress Space, Escape or Enter to start & pause game.\nPress F1 to restart game. F2 Brings up the webpage\n\nRed:   W, A, S, D\nYellow:\tT, F, G, H\nBlue:\tI, J, K, L\nGreen:\tArrow Keys","imageUrl":"https://media.rawg.io/media/screenshots/824/824b5eced203ed2a1cbfb6f5395c6cd8.jpg","releaseYear":2019,"developer":"Sugoi Yellow","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":65018,"name":"Sleepwalker (2018)","genre":"Adventure","price":0.0,"description":"Sleepwalker is an isometric puzzle where a sleepwalking man in his pajamas needs to be guided to safety. The character walks automatically and cannot be controlled directly. Instead the player needs to put up signs and objects in the environment to help him around and to avoid contact with monsters. Signs are collected in a vertical bar on the right side of the screen. Farther levels include new types of items. The game contains about 100 levels.","imageUrl":"https://media.rawg.io/media/screenshots/b5b/b5b81cb1cde4a51f788c4ae61e250e6f.jpg","releaseYear":2018,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":65017,"name":"Central Intelligence","genre":"Action","price":0.0,"description":"Central Intelligence is the ultimate test of your strategic skills. In this CIA style mission you can operate in three areas, Propaganda, Military, and Political, to achieve your objectives.\nChoose your moves carefully - you could set up a chain reaction of events that may backfire. The theater of operation is immense.\nA strategic game of espionage and undercover operations with a lot of political undertones. You play a CIA chief sent to the island of Sao Madrigal, which is currently under a dictatorship. This dictatorship is supported by the Chinese government and it seriously jeopardizes the U.S.A.'s interests in the region, thus it is your mission to organize the return of democracy, by any means necessary.\nYou have at your disposal a series of CIA agents divided in three branches: Political, Propaganda and Military. But the object of the game is not to organize a military uprising, but instead to support and organize the island's many opposing factions (like angry students, guerrillas, political parties,etc.) against the dictatorship (with or without their knowledge of your interventions) via propaganda, bribes, subterfuge, assassinations, blackmail, etc.","imageUrl":"https://media.rawg.io/media/screenshots/9b2/9b282d0447dbda9c6014270174c71543.jpg","releaseYear":2018,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62990,"name":"Viking's drakkars","genre":"Adventure","price":0.0,"description":"Once upon a time in the North lived bold people - the Vikings.\nThey built strong boats, the Drakkars, and sailed on them very far from their native coasts, opening up new lands.\nIn breaks between campaigns Vikings arranged races on their drkkarahs on rough rivers, collecting chests with awards and bypassing logs-obstacles.\nFeel yourself a Viking, play alone, developing attention, or with a friend on one computer.\nControl:\n1st player AD\n2nd player arrows\nor gamepad.","imageUrl":"https://media.rawg.io/media/screenshots/b76/b769ad42111466f2d7203a8aaf562a68.jpg","releaseYear":2018,"developer":"azimut team","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":56129,"name":"Mortal Kombat: Deception","genre":"Fighting","price":0.0,"description":"Mortal Kombat: Deception is a fighting video game developed and published by Midway as the sixth installment of the Mortal Kombat (MK) video game franchise. It was released for the PlayStation 2 and Xbox in October 2004, and for the Nintendo GameCube in March 2005. Mortal Kombat: Deception follows the storyline from the fifth installment, Deadly Alliance. Its story centers on the revival of the Dragon King Onaga, who attempts to conquer the realms featured in the series after defeating the sorcerers Quan Chi and Shang Tsung, the main antagonists in the previous game, and the Thunder God Raiden, defender of Earthrealm. The surviving warriors from the previous titles join forces to confront Onaga.\nTwenty-six characters are available to play in the game, with nine making their first appearance in the series. Deception contains several new features in the series, such as chess and puzzle games with the MK characters and an online mode. The Konquest Mode returns from Deadly Alliance, but follows the life of Shujinko, a warrior who is deceived by Onaga to search for artifacts to give Onaga more powers. In November 2006, Midway released Mortal Kombat: Unchained, a port for the PlayStation Portable, which adds characters to the game from the previous title.\nSeries co-creator Ed Boon designed Deception to be an unpredictable fighting game, and included new features such as the minigames as surprises. Several parts from Deadly Alliance such as combos and arenas were redesigned to be more realistic as well as more interactive. Deception has been well received by video game reviewers, who praised the fights and the new features. The Konquest Mode, however, received criticism for poor voice acting. Several publications have called Deception the best fighting game of 2004.","imageUrl":"https://media.rawg.io/media/games/7d1/7d18f1eed0d259ca23d263380549a7ce.jpg","releaseYear":2004,"developer":"Midway Games","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":50954,"name":"FIGHTING EX LAYER","genre":"Action","price":0.0,"description":"・\"That\" EX Series Is Back! After a long while, the EX Series loved by Fighting Game fans around the world has finally returned!\n・The Characters Are Reborn With Beautiful New GraphicsKairi, Skullomania, Blaire, Pullum and the rest; in total 15 classic characters have been recreated with beautiful new models. Watch as the EX series is reborn and the battle unfolds with the latest graphics!\n・The New \"Gougi System\" Plays A Huge Role In BattleBy fulfilling certain requirement mid-battle, your character is given amazing new abilities- that's \"Gougi\"!\n5 Gougi make up 1 Set which is called a \"Gougi Deck\". There are 15 different Gougi Decks ready for you to try.\nExperiment with the different characters and Gougi Decks, and find the combination that matches your own style!\n・Two Unique Input StylesThe game features two different input styles; \"Progressive\" which is a simple style that doesn't require any complicated command inputs, and \"Classic\" which keeps the inputs that same as classic Fighting Games.\n・Various Modes to EnjoyOf course there is Online and Offline Versus modes, but there are also Arcade Mode and Training Mode for you to enjoy single player content.\nAnd then the legendary Expert Mode from the EX Series makes its return; try to clear it with every character!\n\n\nRegarding the In-Game Descriptions\nIn Ver1.1.1, the set Menus and Options (i.e ONLINE VS, RANKED MATCH), Information, and some other sections are displayed in the English Alphabet, but now the description sentences will support 12 different languages.\nSupported Languages: Japanese, English, French, Italian, German, Spanish, Arabian, Brazilian Portuguese, Russian, Korean, Simplified Chinese, Traditional Chinese","imageUrl":"https://media.rawg.io/media/screenshots/c92/c929b3fe50a2ecc2730d98837c7ca6d3.jpg","releaseYear":2017,"developer":"Arika","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":49586,"name":"Crystal Reign","genre":"Action","price":0.0,"description":"Experience a siege game like never before.  Dive into the Fantasy universe in VR where you are the hero...or villain.\nKey Features\nStrategically place weapon towers along the enemy path to destroy your enemies before they reach your base!\nEnter your towers to enhance, aim, and fire at enemies yourself!\nUnleash your ultimate attack of magic upon your enemies as the skies darken and your power overwhelms!\nExplore the map for hidden treasure to collect gold and ultimate crystals with VR dash-teleport!\nDiscover enemy strengths and weaknesses to different towers!\nGet attacked by enemies who steal your gold and steal your gold back!\nConquer the bosses of the woodlands and claim it as your own!\nNavigate through the first-time tutorial and learn to play the game!\nBeat your high score in the never-ending forever-changing Infinite Mode!\nTowers\n- Arrow Towers\n- Cannon Towers\n- Ice Towers\n- Support Towers\n- Anti-Air Towers\nEnemies\n- Dwarves\n- Rabbit Warriors\n- Golems\n- Ravens\n- Ogres\nLandscape\n- Caves\n- Mountains\n- Dirt Paths\n- Rivers\n- Lake","imageUrl":"https://media.rawg.io/media/screenshots/60c/60caa8d5f3cd1492f8b01b81f8568297.jpg","releaseYear":2017,"developer":"Virtual World Arcade","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46942,"name":"Time Gap Mystery","genre":"Adventure","price":0.0,"description":"Plunge deep in a whirlwind adventure with Time Gap hidden object mystery game. Unravel wonderful facts about Alexander the Great, Cleopatra, Napoleon, Lincoln and Einstein as you try to save the day. Travel around the world with the help of an interactive map, complete multiple tasks, assemble diverse collections and engage in numerous minigames. It's time to challenge the destiny!\nIt's more than the original storyline and unexpected ending that makes this finding game so addicting. Featuring elements of various game genres,like hidden objects, adventure, Match-3, Bubble Shooter, Snooker, it provides incredibly rich playing experience of this.\nFeatures of Time Gap Hidden Object Mystery:\n- Complete countless tasks and play for months!\n- Enjoy exciting Bubble Shooter mini-game. Chase the fire storm!\n- 100+ levels in Match 3, Bubble Shooter and Snooker mini-games\n- Snooker mini-game is available! Play it by tapping the Storm on the world map\n- You also can enjoy the enhanced Match 3 mini-game\n- Attention! UFO has arrived to Earth! You can find it on the map!\n- Experience diverse hidden object gameplay\n- Discover interesting facts about the outstanding personalities\n- Watch for updates to access new content of this adventure quest\nThe age of wonders\nFollowing the storyline you will travel across the globe and explore various hidden object locations. Thus you raise your skill level and gain experience to unlock more spots on the interactive map. Various anomalies and natural disasters diversify the gameplay of adventure, so sometimes you will have to complete the hidden object scenes in pitch darkness, or face the item list with mixed letters. Don't give way to despair – all kinds of power-ups will let you cope with any trouble your encounter!\nScouring hidden object locations you will also come across numerous collectibles and special items. These are needed to comply with the requests of the wraiths who will guide you through this exciting adventure game. Your diary will keep track of all the given tasks, because there may be a few of them at a time. Check it regularly, and learn interesting facts about your haunted companions and key information on the game story to finally return the Earth to the humanity.\nEnjoying Time Gap Hidden Object Mystery? Learn more about the game!","imageUrl":"https://media.rawg.io/media/screenshots/4a0/4a01c58fbceda48c1a20b4ff054bc5ad.jpg","releaseYear":2017,"developer":"Absolutist","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46868,"name":"Ghost Recon Wildlands Ghost War Open Beta","genre":"Action","price":0.0,"description":"Join the beta now!\nWe are glad to have you try our Ghost War Mode in this time-limited public test. Play Tom Clancy’s Ghost Recon Wildlands PvP in a thrilling 4v4 team deathmatch mode that will put your tactical skills to the test.\nFight on five large maps throughout the Wildlands and adapt to terrain and changing weather conditions. Choose between six classes, each of them having a different playstyle and loadout, and assemble a team ready to handle any situation.","imageUrl":"https://media.rawg.io/media/screenshots/82a/82a48dd31edb46b59866c0f9feda6d8b.jpg","releaseYear":2017,"developer":"Ubisoft Montpellier","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46746,"name":"Metropolis: Lux Obscura","genre":"Adventure","price":0.0,"description":"Metropolis Lux Obscura is a unique game with a film noir atmosphere, seductive wanton women, and dirty dangerous secrets. Gameplay is based on a motion comic with a non-linear plot mixed with MATCH3 puzzle fights.\nThis city is rotten to the core. You can’t even tell night from day in this hell where big money runs everything. And the best way to prove you’re right is with brute force.\nJon Lockhart walked through the prison gates a free man, after spending years imprisoned as the supposed murderer of an old friend. He returned once more to the city where it all started intent on figuring out who it was that framed him for the murder and make them pay in blood for the crime. It'd take some work with the key witness dead, but that just meant he'd have to flush out every rat from hiding.\nOld friends and new enemies. Search for the truth, for loyalty and sanity - but all you can find here is redemption, betrayal and death.\nWelcome to Metropolis.\nBeautiful comic art\nGorgeous, sexy girls\n12 mental disorders and bad habits to unlock\nAmazing soundtrack and audio effects\nRich and dramatic story, professionally voice acted\nAn addicting match-3 puzzle battle system with upgradable traits\nObscenity and sexism\n4 different endings","imageUrl":"https://media.rawg.io/media/screenshots/1c7/1c7be9597ec7c054cd973adbfaaea90a.jpg","releaseYear":2017,"developer":"Sometimes You","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Web"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":45936,"name":"Industries of Titan","genre":"Strategy","price":0.0,"description":"Industries of Titan is an industrial city building sim/strategy game, set on Saturn's moon Titan.  Create a sprawling industrial city, design powerful factories, and compete with other Great Houses to stake your claim to the Industries of Titan!\r\nKey features:Design your city and grow it from just a few small buildings into a massive metropolis!\r\nSet up production lines inside your factories to turn raw resources into ever more powerful devices and buildings\r\nBalance the needs of your workers, your factories, and your buildings to produce a powerful, efficient economy\r\nDesign the interiors of your battleships by strategically placing weapons, shields, thrusters, and more, to reduce weak points and maximize fighting capability\r\nOvercome your enemies via tactical battleship combat, technological superiority, political influence, or the sheer productive power of your factories\r\nGameplay is \"real-time with pause\" -- play at your preferred pace!\r\nCreated by the team that brought you Crypt of the NecroDancer, with art by Sir Carma and Nick Gunn, music by Danny Baranowsky, and audio by Power Up Audio.\r\nAdd Industries of Titan to your wishlist to be notified when it launches!","imageUrl":"https://media.rawg.io/media/games/6b3/6b36685a7e1d3f50494be33e4831a32f.jpg","releaseYear":2023,"developer":"Brace Yourself Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44831,"name":"Earthworms","genre":"Adventure","price":0.0,"description":"The Earthworms is independent, artistic, point & click game placed in surrealist world of science-fiction. All the locations in game were painted manually and shown from a unique perspective.Plot:You play as private detective named Daniel White, who is endowed with parapsychic abilities. Visions that he gets, help him to solve investigations. At first glance, the case that you are part of is about missing teenage girl who's from small fishing village. With every next location, you will experience more and more weird situations and discover that everything is leading to big global conspiracy. If you think that is only summer walk through fishing village, you are wrong. This is an epic adventure which will blow your mind.\n\nThe motto of our game:\n“There are more things in Heaven and Earth, than are dreamt of in your philosophy” - William Shakespeare\n\nKey Features:\nexploring and interacting with unique painted locations inspired by Edward Hopper’s work\nadventure in mysterious world which is a mix of pulp theme, surrealism and high-end science\na game with beautiful and epic soundtrack\nlot of challenging logical puzzles as addition to classic inventory interactions\n\nThe Earthworms is a game which provides a thrill of horror mixtured with dose of humor, beauty, ugliness and most often weirdness. All because of that we do not like boring stories","imageUrl":"https://media.rawg.io/media/screenshots/c40/c408f0e9df04bb0fd60e95073e1c2da5.jpg","releaseYear":2018,"developer":"All Those Moments","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":40876,"name":"Fallout: New Vegas - Old World Blues","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/771/7711bf96b2a5128b70c6f83125c5093a.jpg","releaseYear":2011,"developer":"Obsidian Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":36581,"name":"Area 51 (2005)","genre":"Action","price":0.0,"description":"The U.S. Army has received a distress signal from Area 51 where a viral outbreak has just shut down the research facility and the automated quarantine procedures have locked all scientific and military personnel inside. A small Special Forces unit led by Specialist Ethan Cole of the HAZMAT (hazardous materials) Division is sent to investigate. As Cole, players will delve into five massive levels within the confines of Area 51, discovering a deadly mutagenic side effect of the virus that controls the minds of those infected, as well as an ancient alien colony buried beneath the facility. With a multitude of human and alien weapons, players must explore chilling conspiracies such as the extraterrestrial crash at Roswell and the faked lunar landing, in order to solve the enigma of Area 51 before the viral mutagen is released and irrevocably mutates all life on Earth.","imageUrl":"https://media.rawg.io/media/screenshots/edd/edd19bd0346f55a4ec2c758685a9be7d.jpeg","releaseYear":2005,"developer":"Mock Science","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":28402,"name":"South Park","genre":"Strategy","price":0.0,"description":"(Online Interactions Not Rated by the ESRB) Play as Stan, Kyle, Kenny, Cartman or any number of your favorite South Park characters in SOUTH PARK LET'S GO TOWER DEFENSE PLAY! It’s the fast-paced action/strategy game, where you play to save the town of South Park.  The game combines snowball-throwing action with tower defense strategy, and is designed for players of all skill levels. Unlock special content and new characters throughout the game for your in-game scrapbook.  Play locally with up to four players or team up on Xbox LIVE in the story-based campaign or the extra-demanding Challenge levels.Unlock the full game of SOUTH PARK to access all the great gameplay features, including challenge levels and all 15 un-lockable playable characters. The full game features fast-paced and intense action/strategy with local and Xbox LIVE multiplay, leaderboards, achievements, and more! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/0e8/0e835d3c4e3be07bb5b52a9eeca94dc6.jpg","releaseYear":2009,"developer":"doublesix","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28050,"name":"Trio","genre":"Casual","price":0.0,"description":"2D plaformer with hardcore levels. Play as one of three heroes with different abilities. Complete levels by helping each other. Enjoy minimalistic graphics and fantastic music. Do you dare to complete all levels?\n35 levels\n678 achievements\n7 fantastic music track\n1-6 level - 6 achievements each\n7-10 level - 12 achievements each\n11-35 level - 24 achievements each\nATTENTION\nAll completed achievements will be added after you close the game.","imageUrl":"https://media.rawg.io/media/screenshots/95a/95a6ac18cca26868b5831ff7a4ea4abf.jpg","releaseYear":2017,"developer":"Paper Plane","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23634,"name":"Relax Walk VR","genre":"Simulation","price":0.0,"description":"Visit 6 Beautiful Places in VR and Relax.\n6 Environments\nMars\nForest\nOcean\nChina Temple\nOasis\nApocalypse\nMusic\n18 Relax Tracks\nYouTube Brrowser for to hear your own music\n2 Locomotion Types\nTeleportation\nDirect Move\nThe game supports both HTC Vive and Oculus Rift.","imageUrl":"https://media.rawg.io/media/screenshots/c6c/c6cb34ab0c651defa20c65d63fcbac6b.jpg","releaseYear":2017,"developer":"Indiecode Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22595,"name":"Runes: The Forgotten Path","genre":"Action","price":0.0,"description":"Runes: The Forgotten Path is an immersive action-fantasy game designed from the ground up for new VR devices such as the HTC Vive and Oculus Rift. Runes is a VR adventure set in a fantasy world in which you play as a renegade wizard. You will master the art of spellcasting by drawing rune shapes in the air with your hands.\nYou will play as Leth, a powerful wizard trying to escape from the Oblivion, a magical sleep prison of the mind. Astray from the path of righteousness and trapped inside yourself by the tyrannical order of the Panopticon, you will have to face a blank beginning. With the use of your powerful spells and wits you will fight enemies, solve puzzles and pursue the recollection of all your lost memories. But are you alone?\nRunes uses a new locomotion system named \"4th Wall\" which combines 1st person immersive gameplay with a 3rd person locomotion system in order to adress the problem of physical discomfort that affects VR players as well as to provide a new narrative to the story. 4th Wall allows close interactions (such as fighting, dealing with puzzles, etc)to happen in 1st person whereas locomotion, or roaming around the world, can be put into a 3rd person perspective with the press of a button.\nFEATURES:\n-100% designed for room scale VR.\n- Cast spells by drawing in the air with motion controllers.\n- Full story driven VR title with different environments and puzzle solving.\n- Photogrammetry for full deep and immersive worlds.\n- New seamless locomotion system.\n- Nodding system: answer to yes or no questions just by moving your head.","imageUrl":"https://media.rawg.io/media/screenshots/20f/20f064565b4e4ce2dcc3be0b6b40eb6c.jpg","releaseYear":-1,"developer":"StormBorn Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21621,"name":"Mining & Tunneling Simulator","genre":"Simulation","price":0.0,"description":"Blast rocks, drill tunnels and force your way through every mountain. At the beginning you have enough time and no major problems. Once the TNT charges are placed you can start the blasting to create the tunnel entrance. The excavated material will be loaded by a shovel dozer on a dump truck and transported to the storage site. As soon as the entrance is cleaned up the huge tunnel drilling machine will march up. But this monster can only start operation if it is supplied with sufficient building material. This has to be delivered by crane and train. You have to steer all vehicles like the maintenance van, crane, tunnel drilling machine or the fire brigade.\nThat’s how you’ll create the building site piece by piece before starting the tunnel itself. You’ll need to pay attention to many factors. The tunnel drilling machine has to be kept supplied with building materials. It’s important that you don’t lose track of your tasks. Frequent visits to your control room will be crucial.FeaturesDetailed scenery in 3D graphics\nIntriguing, ongoing story\nWeather effects, day / night shift\nVarious tasks\nLong lasting fun factor\nFree choice of the level, once you have accomplished all tasks\nIntuitive control via keyboard and mouse","imageUrl":"https://media.rawg.io/media/screenshots/894/894cb9e749227579cd37cac420c1bcca.jpg","releaseYear":2014,"developer":"United Independent Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20630,"name":"Sherlock Holmes Consulting Detective: The Case of the Mystified Murderess","genre":"Adventure","price":0.0,"description":"An unexpected guest interrupted my morning routine, speaking in impassioned tones about an intriguing murder. An unassuming woman has been charged with the death of a scoundrel, a fortune-squandering bounder. True, she was found over the body, pistol in hand but there are other avenues in this case that even the Yard has refused to set foot upon – especially when they wind into darker places of London’s society. I have the feeling that there is more to the case than meets the eye.\nZojoi teamed up with famed board game company Sleuth Times to reproduce the award-winning Sherlock Holmes Consulting Detective video mysteries for Windows and Mac. This original titles was considered the pioneer products for emerging optical technologies and took advantage of the medium with full-motion video (FMV), intriguing storylines and fun game play. The restored retro game feature recaptured video, high-resolution graphics and strong storytelling and design.\nDirect the famous Baker Street detectives through the fog-filled streets of London, and solve mysteries in a faithful adaptation of the board game that features:\n30 minutes or more of original video footage\nSherlock Holmes, his case companion, Dr. Watson, and over 20 additional characters (both trustworthy and unscrupulous!)\nFull English subtitle support\nSearch the London Times for clues, peruse Holmes’ personal files, scour through the London Directory and receive hints from Watson himself\nPresent your findings to the Queen’s magistrate – and learn how you did against the master detective","imageUrl":"https://media.rawg.io/media/screenshots/09f/09fdfa27e33d50f963a4d59e836c720d.jpg","releaseYear":2015,"developer":"Zojoi Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20478,"name":"Soccer Manager","genre":"Strategy","price":0.0,"description":"New in this version...\n- Soccer Manager Worlds\n- New Match Engine\n- Improved look and feel\nWelcome to Soccer Manager - home of the world's best soccer managers.\nFeaturing two different football management games, to test the skills of any manager - Soccer Manager 2016 and Soccer Manager Worlds.\nPlay for Free - Compete for Real\nSoccer Manager 2016\n- Fast-paced, action-packed single-player game.\n- Play anywhere, everywhere with our cloud-based game play.\n- Manage over 750 clubs in over 48 of the world's top leagues.\n- Buy and sell players to improve your club from our cloud-based Wiki of over 70,000 players.\n- Select your team and dictate the tactics off the pitch, then watch how they perform on the pitch with our 2D match engine.\nSoccer Manager Worlds\n- Completely free to play.\n- Unique turn-based game play - manage 2 to 3 games per week against other managers.\n- Every match represents a unique challenge - set your line-up and tactics accordingly.\n- Negotiate player transfers with other managers.\n- Take complete control of your favorite club, or if you want a different challenge enter or build a custom game-world.","imageUrl":"https://media.rawg.io/media/screenshots/6ba/6ba36a2a150df234e9cffbcb9abbd71d.jpg","releaseYear":2016,"developer":"Soccer Manager","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19726,"name":"Cally's Trials","genre":"Action","price":0.0,"description":"It's time for Cally to do what she does best: rescuing her kidnapped parents!\nSet before the events of Cally's Caves 3, Cally's Trials is a roguelike action-platformer with a weapon-levelling system that lets you evolve weapons as you use them.  Cally must save her parents from the maniacal Herbert, who has laid waste to the Caves and built a massive lair deep inside.\nHerbert's experiments have twisted the caves into a living nightmare, and our plucky six-year-old heroine must overcome staggering odds:\n110 levels packed with vile monsters to fight across 6 biomes\n6 insane bosses, including Mama Bear's first appearance, and Carl IV's Dad.\n12 weapon classes to level up, use your weapons and they grow stronger, every once in a while they evolve into a new form with new effects!\nItem/Powerup Store to buy permanent upgrades for Cally\n38 song soundtrack\nroguelike structure means earning money on every run and buying upgrades is crucial to success\nCally's Trials is a mix of roguelike and RPG, with a \"Level Up Everything\" sensibility.  Witness the beginning of Cally's journey from average 6-year-old girl, to fearless warrior and Conqueror of the Caves!","imageUrl":"https://media.rawg.io/media/screenshots/7f6/7f6f84f2faac8fb88cbb8f1a169c7389.jpg","releaseYear":2016,"developer":"VDO Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18961,"name":"Galagan's Island: Reprymian Rising","genre":"Action","price":0.0,"description":"To our new players....\nPlease be so kind as to leave us a review.\nBe Sure To Check Out Our Two Newest Games\nFlobe\nhttp://store.steampowered.com/app/434530\nSpellblast\nhttp://store.steampowered.com/app/436350/\nGalagan's Island is an Arcade style Space Shooter, paying loving homage to classic arcade style and difficulty.\nCurrently featuring 25 LEVELS of handcrafted whimsical charm.\nThe formations are so pretty, you almost don't want to destroy them. LOL!\nGalagan's Island utilizes dynamic scaling of ship abilities. As you progress through the game YOUR ability to perform improves as well.\nOriginal Soundtrack featuring smooth jazz and hip-hop styles, personalized trip-hop TRACKS, 8 bit chip-tunes & 4th wall frenzies....not to mention a slew of rising Indie musicians ...brought to you courtesy of Forever Humble Productions.Optimized For Both Keyboard and Gamepad Controls.\nThis is our first release under Skinny Jean Death Studios....a video game development company founded by teen programmer Jonathan Cunningham.Early AccessSo...25 Levels to start...and 5 Bosses.\nHmmm...Not Enough.So This Is Why We Are Here....Early Access It Is.We wanted to create a community not just behind this game but behind us as a company.\nWith Early Access, we are able to show the players the amount of work that goes into making a game.\nWe greatly benefit from the feedback we get from the players, as it has allowed us the ability to grow this game into something much larger then it began.\nWe hope you join our studio in our game making venture. Galagan's Island ~ Reprymian Rising is just the first of many titles to come.\nhttp://i57.tinypic.com/2q3ql2v.jpg\nWe will be adding a Co-Op Mode.\nMore enemies, more ships, bigger bullets, bosses, bigger bosses, sometimes even mini bosses....and man more powerups!\nThis Is All Very New to Us.\nWe are really excited to start to grow this game further with you the players.\nI hope we did this right. LOL\nIf not...well we will be updating this thing constantly anyway.Pricing\nEarly Access Will Run $4.99 US\nUpon full completion the sale price will be raised.\nIf this game does not yet satisfy you...making it cheaper won't fix that...making the game better will....so we will commit to that.\nI would say that likely someday down the road...we'd do a bundle...I mean...I like Christmas too! So That's It For Now.Let's Go Blow Some Stuff Up.Default Control SettingsKeyboard\nMove: WASD/Arrow Keys\nToggle Autofire: F\nHover: Spacebar\nPause: Esc/P\nXBox Gamepad\nMove: Joystick/D-Pad\nToggle Autofire: A/Y\nHover: B/X\nPause: Start\nPS3 Gamepad\nMove: Joystick/D-Pad\nToggle Autofire: X/Triangle\nHover: Circle/Square\nPause: Start","imageUrl":"https://media.rawg.io/media/screenshots/d1d/d1d0802313ffcf8fd185f1753e1a6b26.jpg","releaseYear":2015,"developer":"Skinny Jean Death Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18299,"name":"Lovely Planet Arcade","genre":"Action","price":0.0,"description":"Relive your journey to Lovely Planet in this brand new adventure packed with impossible tests of skill and patience. Craft intricate combos to unfold the complex puzzle of flying projectiles and moving targets into a graceful sequence of well timed shots and jumps. Enjoy shooting baddies, jumping over obstacles and teleporting around bullets while trading with milliseconds.\nThe original First Person Shooter experience, a game of jumping and shooting\nTest your skills with a hundred plus levels to solve over four unique worlds\nPush yourself further with unlockable modifiers, play any level in Mirror or Fast mode\nCollect evidence and uncover the mysteries of the Arcade\nOriginal soundtrack by Calum Bowen","imageUrl":"https://media.rawg.io/media/screenshots/0e0/0e0340b245dbdc0cf2f38490fd95d78a.jpg","releaseYear":2016,"developer":"QUICKTEQUILA","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17457,"name":"3DRPG","genre":"Adventure","price":0.0,"description":"3DRPG is a voxelized old-school RPG where you explore a Randomly Generated world filled with random dungeons, towns and people! Every character in the game is recruitable. Hunt for prey or go fishing for food. Search for treasure in dungeons and fight monsters on the way!\nYou are a lost soul wandering the Underworld in the army of undead. Somehow you break free from your state and face Burzur, Lord of the Underworld. You make an agreement with Burzur, if you complete his task, you'll be free to live life again. Your task is to hunt down the killer that killed you in the first place. And so your journey begins!\n- Randomly Generated World, Towns, Dungeons\n- Every Character Is Recruitable\n- Old School JRPG Battle System With A Twist\n- Mentor System\n- Crafting Armour, Weapons & Potions\n- Hunting Prey & Fish For Food\n- Clearing Mines & Gather Minerals\n- 15 Professions\n- 5 Weapon Types\n- 350+ Different Equips\n- 50+ Different Enemies","imageUrl":"https://media.rawg.io/media/screenshots/7cf/7cf4c6e9e43c2eaa78ff8b15316cfbf9.jpg","releaseYear":2016,"developer":"Doomster Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16902,"name":"Ankh - Anniversary Edition","genre":"Adventure","price":0.0,"description":"Sneak into the pharaoh's pyramid and meet up with Assil and his crew of crazy friends. Just as the party starts to get hot, a silly accident turns life upside down!\nUnleashing a deadly curse and discovering a precious amulet, as Assil, you will be immersed in Ankh's amazing ancient world. From the narrow streets of Cairo's bazaar to the banks of the Nile. This comic adventure will have you running from a mad Osiris on your mission to meet the Pharaoh.\n- Over 45 comic characters\n- More than 80 awesome puzzles\n- State of the art 3D graphics\n- Breathtaking in-game cinematics\n- Dazzling egyptian landscapes","imageUrl":"https://media.rawg.io/media/screenshots/430/430e646da97f0b51ae2827c6a6baf657.jpg","releaseYear":2015,"developer":"Deck13","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16636,"name":"Swiftly","genre":"Action","price":0.0,"description":"Swiftly is a very challenging platformer game. It has simple graphics and easy to understand rules, but you are going to have a hard time completing the levels.\nBlue platforms are just your average platform with no special traits.\nGreen platforms has a bounciness of 120%\nRed platforms have zero friction.\nThroughout the level, there are gears which come in all sizes, looking to kill the cube.\nThe player's objective is to lead the cube to the winning point. There are also checkpoints scattered throughout the levels.","imageUrl":"https://media.rawg.io/media/screenshots/203/203ff2b449c22ccad5448636e724786e.jpg","releaseYear":2016,"developer":"Cleverweek","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14832,"name":"Intruder Alert: Ixian Operations","genre":"Strategy","price":0.0,"description":"Genre: Real-Time-Strategy\nIn this game you pick one of 6 factions and battle in typical RTS-style your opponents. But Intruder Alert isn't like other strategy games. While in other games you have unit limits, Intruder Alert has no limits except your pc power. Moreover resources are drain realistically and your population grows exponential. Besides all factions differ greatly. For example the Ixir can transform all their buildings into vehicles and backwards and the Mercoss use only drones for all their economic jobs.\nThe story of Intruder Alert is shortly that you are an Ixir from a foreign Galaxy, who is the first of his race leaving their galaxy finding the Milky Way galaxy. There you get to know many different races, which are currently in war with each other. The game plays many years in the future, where the humans are already part of an alliance containing different alien races. In the Milkyway you also have to cope problems of any kind. If you want to know the details, play the game!\nFeatures:\n6 totally different Factions\nabout 10 units and 10 structures per faction.\n30 campaign levels\nmore than 30 challenges\nat least 50h gameplay\nno unit limits\nhigh performance\nnice 2D graphics","imageUrl":"https://media.rawg.io/media/screenshots/695/6953e990a970416f274030a32c749519.jpg","releaseYear":2016,"developer":"Frudelsoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14642,"name":"The Herbalist","genre":"Casual","price":0.0,"description":"\"The Herbalist\" is a calm and meditative logic puzzle game from the creators of \"Everlasting Summer\". Along with Slavya you will need to recreate magical potions recipes. The game features colorful anime style graphics, pleasant soft sounttrack and fruity plot scenes.Plot:One day Slavya came to spend summer at her Grandma's place, but nobody was there to greet her — the hut was empty. Slavya found an old book containing barely readable alchemy recipes. She decided to restore the knowledge lost — maybe she would be able to find out why did her Grandma disappear.Game features:Searching and gathering magical and normal herbs\nScores of unique potions and items\nLots of rich and spicy plot scenes\nGame modding with new recipes, locations, events, etc.","imageUrl":"https://media.rawg.io/media/screenshots/50f/50f3fab498ac96b64b3c58da6df92954.jpg","releaseYear":2016,"developer":"Moonworks","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13620,"name":"The Big Elk","genre":"Action","price":0.0,"description":"The Big Elk is a crazy top-down shooter from Siberia with elements of action RPG and strategy.\nThe Evil came into the Forest... Are you Hero or not? If YES, you must save the Forest!\nBuild structures!\nThink of your strategy!\nSolve the puzzles!\nKill all!\nStay alive!\nBonus. The Original Soundtrack.\nAll tracks available as 320kbp/s MP3 files in the game folder on your PC.\nThe universe is on your side...\nGood luck Hero!","imageUrl":"https://media.rawg.io/media/screenshots/064/06401f35b4ff3ac44d94ed8ddc8b4354.jpg","releaseYear":2016,"developer":"Anatoliy Loginovskikh","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12723,"name":"Dark and Light","genre":"Action","price":0.0,"description":"The shattered remains of the mother planet Gaia float in stark contrast against the sky on nearby satellite planet, Archos, serving as inescapable evidence of the dark forces surrounding the world. As a lone explorer in the wilderness, you must learn to understand the terrain, natural resources, as well as how to domesticate the local creatures and build a home. You will need to harness and control the magical energy that courses through the planet, or you risk being consumed by the looming darkness that permeates throughout the planet.\nEvery aspect of Dark and Light has been re-imagined, re-worked, and upgraded from the 2004 original. Gaia’s very existence is dictated by primal elemental forces, including wind, earth, water, fire, light, and darkness. These elements course through the world, sometimes clashing and causing earth-shattering changes. Gaia houses a number of various biomes, including lush forests, soaring peaks of ice-capped mountains, a towering volcano clouded with sulfur and ash, as well as breezy floating islands, ominous dark forests, wide swamps, and deep caverns. Extreme weather conditions will put you to the test; you'll need to procure food and water, as well as the proper tools required to roam this expansive land and brave the unforgiving elements.\nAges ago, Gaia was attacked by dark forces and collapsed, plunging the world into darkness.  Many sought exodus to Archos, one of Gaia’s satellite planets - unwittingly (or for some, perhaps intentionally) bringing the dark forces along with them. As a result, Archos’s atmosphere has been adversely affected, causing some strange occurrences on the planet during the night. During the day, Archos’s landscape is peaceful, but once the sun sets, the planet immediately plunges into chaos. Occasionally, the remnants of Gaia will block out the sun, causing an eclipse on Archos, resulting in a violent, bloodthirsty frenzy among the planet's native creatures. Eclipses also provide an opportunity to obtain incredibly rare magical resources, so players must learn to survive during eclipses if they want to thrive.\nMagic permeates throughout everything Dark and Light, and the line between physical and magical becomes increasingly blurred as the game progresses. There are dozens of magical skills related to survival, exploration, defense, transformation, control, attack, and more. Players can harness the power of the elements to construct buildings, erect a network of portals to transport you all across the continent, and even control the weather. Possibilities aren't just limited to creation and control, however. Players can master important battlefield skills with a magic staff and over 14 different melee and ranged weapons, including bows, swords, daggers, and more. Players can also use magic to forge weapons and create their own legendary equipment.\nDark and Light features dozens of magical beasts, including dragons, griffins, unicorns, centaurs, goblins, and many, many more. There are also plenty of unique creatures that players have never seen before, and all are native to this planet. All the creatures in the game survived the havoc spread by the destruction of Gaia, and thus are all imbued with incredible magical powers. Players can hunt them for food and clothing, extract their magical essence, or they can choose to tame them and raise them as faithful companions.\nPlayers and NPCs can all progress through their own growth systems, and players can choose which skills they want their characters to master. These include both physical skills such as speed, endurance, and strength, but can also apply to a character's crafting abilities. Whether a character chooses to be an architect, a mage, or a warrior is all up to them, the combinations of skills and stat builds in Dark and Light are virtually limitless. It is possible to become a master of all skills, but doing so will require tremendous time and effort. In order to develop a strong foundation, players are encouraged to specialize and cooperate with one another throughout their time on Archos.\nArchos’s punishing environmental conditions have bested many adventurers who tried to go it alone - players will need to band together to survive. Dark and Light is designed to encourage cooperation at every level; survival, exploration, and combat are all incredibly demanding, and few will be able to fully master their surroundings. This is particularly true in regards to group combat, where supporting and managing a diverse battalion of warriors, mages, trainers, and more will grant you a major advantage in large-scale battles.\nPlayers can choose to start in one of three main cities, each one belonging to one of the three ruling factions on Archos. This community structure is critical in the early stages of the game, when players are relatively weak and need support from others. Your role in the faction becomes increasingly important as you progress through Dark and Light - if you establish your specialty early, it’ll go a long way in helping you contribute to the success of your faction.\nDark and Light's sandbox world affords players the freedom to create and build just about anywhere in the world. Whether you want a secret underground base or a fortress atop a massive floating island, if you can reach it, you can build there. As the forces of darkness simmer on the horizon, defending your homestead will become increasingly important. A combination of physical and magic fortifications, including NPCs and tamed creatures, will be necessary for players to defend their land from being engulfed by darkness.\nArchos is still threatened by the total collapse of Gaia and a massive invasion by the forces of darkness. Even though the portals that link Archos to Gaia have closed, darkness emanates from the mother planet, affecting all the living creatures on Archos. Whether to embrace the darkness or fight it is a choice that remains solely with you, and it is your choice that will represent the future of the world.","imageUrl":"https://media.rawg.io/media/screenshots/ce0/ce00cefaf5a2ecbc49380ced3fb5166d.jpg","releaseYear":2017,"developer":"Snail Games USA","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12063,"name":"Isolation","genre":"Adventure","price":0.0,"description":"The plague destroyed the world you once knew. It destroyed cities, towns and countries. When the plague was first identified by doctors, researchers started working on a cure immediately. The infected people were transported into hospitals to isolate them from other people. But this was not enough to stop it. Researchers failed in finding a cure and there was nothing anyone could do. Slowly the plague started affecting all countries worldwide, and then that's when civilisation collapsed, and that is when the plague infected your country.\nYou remember the plague going through your body, then the next thing you knew, you awoke in a hospital with doctors doing tests on you, they were all wearing masks and protective clothing. You remember the screams going through the hospital as the infected patients started becoming aggressive. Then you went back to sleep and awoke in the hospital, not alone. The plague has also not affected you, you were one of the few that were lucky. But now you will have to escape, but can you do it?\nAs you progress through the game, you will unfold the story and discover what happened to the world. But how far are you willing to go?","imageUrl":"https://media.rawg.io/media/screenshots/c04/c040bc31171bba7bd013401afc4adeaf.jpg","releaseYear":2017,"developer":"Interactive Gaming Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11602,"name":"Nemesis Perspective","genre":"Action","price":0.0,"description":"Challenge your friend in a classic hero versus giant boss monster setting in a local multiplayer VR game. Wielding VR equipment your objective is to prove your superiority by crushing those who disturb your sacred peace (namely your friend who’s playing as your opponent with a console controller).\nThis game is intended for 2 players. Simply put, boss character is controlled by player with HTC VIVE. Hero character is controlled by another player with the console controller and traditional display screen.\nGame Features\n- Play as the boss or play as the hero.\n- Intuitive and easy to start, yet feeling rewarding for skilled players.\n- Innovative asymmetric multiplayer experience over two completely different user interfaces.\n- AI controlled hero for single player.\n- We dare to say that Nemesis Perspective is the most intuitive VR game yet available, thus making it also a very pleasing first VR experience.\n- Not a single recorded case of motion sickness to date.","imageUrl":"https://media.rawg.io/media/screenshots/7cb/7cbfc3ee2aec0747659bd334b285a3a6.jpg","releaseYear":2016,"developer":"Evocat Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11535,"name":"Iron Impact","genre":"Action","price":0.0,"description":"Steam GreenlightThank you!\nAbout the GameIron Impact is a tank TDS similar to many of the NES games we loved so much when we were kids, such as Battle City or Jackal. Use your indestructible tank to solve puzzles, avoid danger (and fireballs!), fight huge enemy land and air units, and of course challenge their fearsome leaders! Can you handle it?","imageUrl":"https://media.rawg.io/media/screenshots/947/94748204bff8283b49ab4d6e824957b1.jpg","releaseYear":2016,"developer":"Vasiliy Kostin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11470,"name":"Arcane Raise","genre":"Adventure","price":0.0,"description":"Arcane Raise FranchiseBuy Arcane (pre)Raise HERE\nBuy Arcane RE-Raise HERE\nFeature List\n100% DRM-Free, it's all yours\nGlorious 60 FPS, smooth as butter\nFree LoreBook DLC explaining the backstory\nWill run on practically any system, anyone can play\nAstonishing level design with brutal enemy placement\nExcruciating difficulty which stems from unique balancing\nDeep lore and engaging backstory, part of a bigger universe\nExtremely demanding but lengthy with a couple of interconnected maps\nMinimalistic storytelling, lore is explored through the environment and dialog\nThe perfect gift for a family or friend's birthday, make your loved ones happy\nA plethora of items and enemies, discover new areas and enemies play your way\nArcane Raise - ITEM SHOPYou can buy Inventory Items from Arcane Raise - Item Store here:\nhttp://store.steampowered.com/itemstore/603750/\nFor more information, READ THIS\nAurora Novus (FREE Demo)http://store.steampowered.com/app/604080\nArcane Raise - Aurora Novus is a prologue chapter for Arcane Raise Franchise; presented as a downloadable demo. This unique short quest is available to be played for FREE and will NOT be included in the final version of the game(s). This demo version tells a parallel story and contains a unique small area along with special playable characters. So don't worry about spoilers and jump right in.\nNOTE: Demos can only be installed on accounts which do NOT own the full game already. If you have already purchased the game and still would like to play the prologue, please download it from here:\nhttp://www.indiedb.com/games/arcane-raise/downloads/arcane-raise-aurora-novus-free-demo\nFeatured DLCDon't forget to claim Arcane Raise - Lorebook for FREE after your purchase here:\nhttp://store.steampowered.com/app/604091/\nAbout the Game\nArcane Raise is a role-playing video game franchise, wherein a group of resurrected hunters known as Shades, fight alongside humans against monsters in a post-apocalyptic world overrun by an infestation. Do you have what it takes to survive and reclaim what was once yours?\nAre you looking for a very special experience; one that you will always remember? Look no further than Arcane Raise series! This is a very special gem, Arcane Raise is a hardcore role-playing video game created through passion, dedication and labor of love! Guaranteed be a game you will always remember for better or worse, it will be ingrained in your memory forever and ever. This game aims to redefine the meaning of the word and take it to a whole grand new level!","imageUrl":"https://media.rawg.io/media/screenshots/b1a/b1a85225a22c20a9f67330d5b74c827a.jpg","releaseYear":2017,"developer":"Arcane Raise","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11131,"name":"8-Bit Armies: Arena (Free)","genre":"Action","price":0.0,"description":"A Blast From the Past!8-Bit Armies is a retro Real-Time Strategy game for the PC. With a colorful, blocky voxel art style, 8-Bit Armies is Petroglyph's most fast-paced, friendly, and accessible RTS game to date. Collect resources, build up and defend your base, amass your army of military units, and ultimately crush your opponents! 8-Bit Armies, 8-Bit Hordes, and 8-Bit Invaders features offline single-player mission campaigns, two-player cooperative campaigns, AI skirmish modes, and Player-vs-Player Multiplayer modes running on dedicated game servers.  If you're interested in many hours of offline/campaign gameplay fun, definitely check out our the full version of our games\nThis Free version of Petroglyph's popular 8-Bit Series of games lets you get online and play one of six different armies across dozens of multiplayer maps versus players around the world.  You get a different faction to play each day from 8-Bit Armies, Hordes, or Invaders including a sample of maps you can launch games with.\nThe free version includes all of the following...\nAccess to all 6 Armies (Renegades, Guardians, Lightbringers, Deathsworn, Colonial Marines, and Cranioids) - one per day.\nFree players can host a game or join any game in progress including those hosted by anyone else.\nThe original game tutorial to get you up and running quickly\nIn-Game Manual to reference on demand\nSelect music tracks from our composer Frank Klepacki across all three original titles\nReplay mode to watch and learn new strategies from the top players\nObserver mode to spectate games in progress and stream online\nCustom Game options to choose your own win conditions, random crates, cash, and other parameters\nAI support in multiplayer so you and a friend can team up with or against the computer\nQuickmatch mode - just one click to get into the action\nDedicated 24/7 monitored servers\nThe full package including all our games includes the above plus...\nAccess to all 6 factions with no restrictions\nOver 70 challenging offline campaign missions\nEndless skirmish battles against up to 7 AI opponents with multiple difficulty options\n30+ Co-op missions to play with your friends against the AI\n30+ multiplayer/skirmish maps that support up to 8 players online\nThe full in-game soundtracks for all three 8-Bit titles\nClassic Base-Building mechanics let you construct the ultimate HQ from which to launch attacks against your foes\nDestructible environments on maps ranging from small to very large\nEasy to understand modern military units and structures lets RTS beginners jump right in\nFrom the same team that brought you RTS classics such as Star Wars: Empire at War, Universe at War, and Grey Goo\nBuy one of the games - or all three at a substantial discount.  8-Bit Armies, Invaders, and Hordes are for anyone that enjoys fast action, strategy games.  With hours of solo and co-op gameplay included, there's something here for everyone!","imageUrl":"https://media.rawg.io/media/screenshots/616/6164776439c836ca2e40247aebd0009b.jpg","releaseYear":2017,"developer":"Petroglyph","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10329,"name":"My Name is You","genre":"Adventure","price":0.0,"description":"This is a novel with multiple plot lines, in which you only get to witness only a couple of days of a character who’s name is You. It may seem that except for his name, his life is nothing exceptional. That is if it wasn’t for a chain of events that fluctuate between his daily routine and an existential terror of reiteration. What is the most important part? It’s you and You facing inevitability.\nThis is you, and this – is You. Both of you have something in common – exceptionality in a monotonous moment of time, when meaningless decisions have to be made. Or meaningful, to such an extent, that there is nothing left once they are made. Who knows what awaits you around the corner – will you go to work in a continuous, 'almost-holiday' fever or wander in a labyrinth of crooked mirrors? Except for his name, it seems our character’s life is nothing more than unexceptional – there’s no room for miracles or cobwebs. The room is filled with office papers, some vaguely familiar family members, an ailing story of sensation, a couple of dropped lines and a sharp drop – a circle, inside and outside of which you and You wander. Open the letter, pick up the phone, speak up or step aside – and this story will gain new fractures and reflections.\nFeatures:\nUnique atmosphere and visual art that fully convey the gloomy mood of the novel\nMore than 10 alternative endings\nSpecial soundtrack for each finale\nOffbeat structure of the plot: the full story can be put together, only if a player lives through every possible situation","imageUrl":"https://media.rawg.io/media/screenshots/dda/dda7d5c39fa3df6e55620166002f0704.jpg","releaseYear":2017,"developer":"Nikita Kaf","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10223,"name":"Winning Putt: Golf Online","genre":"Simulation","price":0.0,"description":"Winning Putt is a free-to-play online multiplayer golf game. Face off against worldwide competition and win tournaments! Perfect your swing and get in a round of golf anywhere, anytime for free.Key Features:Beautiful and Varied Courses - Play on ten different courses from tropical resort Plumeria or alien planet Starglen for a round. Courses all have their own unique challenges from tricky layouts, high winds, or challenging slopes to beat. Play any course at night for an extra challenge!\nHigh Fidelity Gameplay That Only PC Can Achieve - Take advantage of the power of CryEngine for one of the most realistic golf experiences on PC. Everything from club choice to environmental effects such as wind and rain will affect each swing.\nCustomize Every Aspect of Your Game - Choose Accuracy or Power for your class, and customize your game even further as you choose your skills, enchant clubs, and choose apparel for an experience unique to you!\nCompetitive Gameplay - Participate in tournaments and climb the ranks to become the ultimate golfer. Try out more than three different gameplay modes to test yourself and beat the competition!\nESRB Rated T for Teen\n-Suggestive Themes\n-Simulated Gambling\nOnline Interactions Not Rated by the ESRB","imageUrl":"https://media.rawg.io/media/games/77d/77d0603853f187abaa89c5dffc21d146.jpg","releaseYear":2016,"developer":"WEBZENONNET Co","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10129,"name":"Project Nimbus","genre":"Action","price":0.0,"description":"Project Nimbus is a high speed mech action game set in a post apocalyptic world. Players control 'BattleFrames' - humanoid battles suits armed with an arsenal of weapons.\nThis is a mech game that lets you fly freely in the sky, dodge and intercept incoming missiles with machine guns, fight armies of hostiles with every kind of modern weapon you can imagine, Battle against numerous powerful colossal opponents with the power to annihilate armies, engage with many ace BattleFrame pilots, each has unique fighting styles and stories.","imageUrl":"https://media.rawg.io/media/screenshots/635/6352aad51cb242ff0fe77995145d2d3b.jpg","releaseYear":2014,"developer":"GameCrafterTeam","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]}]