[{"id":11541,"name":"hack_me 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fee/feedb0b228842c4d02838b3f2130fdde.jpg","description":"The next part of hack_me is already in Steam.\nhack_me 2 is a story about hacker-beginner, who is going to confront to new World Order, where is no place for personal secrets. In this game you'll see, how real-life hackers work. You'll learn how to use command prompt, SQL-injectors, remote control utilities and brute-force software. An log cleaner, of course.FEATURES*More apps, utilities and commands\n*References to movies, games and real life\n*More realistic hacking\n*Nonlinear plot\n*Web-Browser with in-game Internet\n*Original soundtrack\n*Music player with support of user tracks","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"EasyWays Team","platforms":[{"id":0,"name":"PC"}]},{"id":3447,"name":"Ironclad Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9a/f9af95b25804ca202c887000f286c1de.jpg","description":"Ironclad Tactics is a fast-paced, card-based tactics game set in an alternate history Civil War - with steam-powered military robots!Key Features:Includes the 'Rise of Dmitry' and 'Blood and Ironclads' add-on campaigns!\nNo microtransactions! Unlock cards by playing the game, not by purchasing them separately.\nExperience unique gameplay, with rapid, simultaneous turns that blend the precision of tactics and card games with the spontaneity of fast-paced strategy games.\nFollow the campaign story through a fully-illustrated, character-driven interactive graphic novel.\nCollect cards as you play through the campaign and build your own decks to crush your foes.\nPlay with your friends in the co-op story campaign or against them in skirmish and nemesis modes.\nFace off against online challengers in quick-skirmish mode, and unlock special cards when you win.\nBonus! Includes a high-quality digital artbook, a printable papercraft model of an ironclad, and the Ironclad Tactics OST, with music by Evan Le Ny and Farewell to the Woods.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zachtronics","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":975393,"name":"Indiana Jones and the Great Circle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/824/824c0f8d6a591ef5828d7546664fc87c.jpg","description":"Uncover one of history’s greatest mysteries in a first-person, single-player adventure. The year is 1937, sinister forces are scouring the globe for the secret to an ancient power connected to the Great Circle, and only one person can stop them - Indiana Jones™.\n\nLive the adventure as Indy in a thrilling story full of exploration, immersive action, and intriguing puzzles. As the brilliant archaeologist – famed for his keen intellect, cunning resourcefulness, and trademark humor – you will travel the world in a race against enemy forces to discover the secrets to one of the greatest mysteries of all time.\n\nTravel from the halls of Marshall College to the heart of the Vatican, the pyramids of Egypt, the sunken temples of Sukhothai, and beyond. When a break-in in the dead of night ends in a confrontation with a mysterious colossal man, you must set out to discover the world-shattering secret behind the theft of a seemingly unimportant artifact. Forging new alliances and facing familiar enemies, you’ll engage with intriguing characters, use guile and wits to solve ancient riddles, and survive intense set-pieces.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Machine Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":378575,"name":"Metro Exodus: Sam's Story","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c3f/c3f1dd0908aec58ac0ba5369670db550.jpeg","description":"Sam's Story is an upcoming story DLC for Metro Exodus. It will take place after the events of Metro Exodus and follow the story of Sam as he explores the tsunami-ravaged ruins of Vladivostok in hopes of finding a way to return to the United States and reunite with his family.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"4A Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":21678,"name":"Puzzle Bots","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13f/13f4a08f19ac3864b55e44b73bea9d0a.jpg","description":"There’s a big secret at Dr. Hugo’s Factory for Making Robots. When the inventors aren’t looking, their tiny robots go on big adventures. They never expected to stumble onto a plot so diabolical it threatened their very existence. With lasers.\nIt all starts when Zander - possibly the world’s most absent-minded inventor - trips over a metal box buried outside the factory. When no-one can figure out how to open it, the robots sneak out and try it for themselves. What they discover is the first step to a grand adventure, leading to a mystery as old as the factory itself.\nJoin the robots as they outwit mischievous children, curious animals, and dysfunctional inventors in their quest to find the truth. Will the robots solve the mystery before it’s too late?\nFind out by visiting Dr. Hugo’s factory yourself!\nKey features:Play as 5 different robots, each with their own abilities and quirky personalities\nHelp the bots work together as a team to solve puzzles\nBomb, burn, push and swim your way through 17 intricately designed levels\nExplore the hidden secrets of a crazy robot factory\nUnwittingly meddle in the humans’ lives","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ivy Games","platforms":[{"id":0,"name":"PC"}]},{"id":21280,"name":"REVOLVER360 RE:ACTOR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16f/16ff273516e6162e9438389a7b996850_qsC65Om.jpg","description":"In this long awaited shooter from action masters Cross Eaglet, enemies are not just right in front of you; they're all around you! Using a unique perspective rotation mechanic, players can bring enemies and items into view, putting the odds in their favor in an otherwise impossible situation.\nIn Revolver 360 RE:ACTOR, you don't only have your bullets to save you. You're also armed with a powerful laser that pierces through weaker enemies, and a screen-clearing EMP. It's the exact kind of weaponry you're going to need if you hope to survive this harsh and hostile environment.\nUse your weapons in concert with each other to toy with your enemies and reap higher score rewards. Killing your foes quickly is not always the best course of action.\nRevolver 360 RE:ACTOR comes with a full suite of challenging mini-missions that will not only teach you advanced techniques to improve your scoring and survivability, but also challenge the most hardcore of shmup players with insane scenarios. Not quite sure how to complete a challenge? Challenge mode also has a dynamic hint system to help you learn how to properly surmount a challenge.Control OptionsKeyboard Support (WASD Support, Customizable Layout)\nFull Controller Support (Xbox 360 Controller RecommendedSoundtrackThe Steam version of Revolver360 RE:ACTOR now comes with the entire Original Soundtrack included in your initial purchase. Enjoy the sounds of destruction wherever you go!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cross Eaglet","platforms":[{"id":0,"name":"PC"}]},{"id":18674,"name":"ESEA","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a0/7a09481e64c889b423e13d98db450a0e.jpg","description":"ESEA is a third party matchmaking program that uses the industry leading anti-cheat (ESEA Client) to protect matches. ESEA currently has PUGs, Scrims, Ladders, Events and runs one of the largest open format leagues in the world. Join us today for access to one of the largest gaming communities in the world. A premium subscription not only unlocks the game features, it also allows you to join our active website community and forums. A premium subscription is required to use the ESEA network.\nUsers must have a STEAM Account that does not carry any VAC bans in order to play on ESEA. ESEA Premium is used for CS:GO and TF2 on the ESEA Network.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ESEA","platforms":[{"id":0,"name":"PC"}]},{"id":12200,"name":"Ellipsis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec3/ec3c8999e53faa6f78e6e7edc13def1d.jpg","description":"We’ve crafted a beautiful universe for you to uncover and explore at your own pace. Fly through levels, dodging and evading enemies before they have a chance to react. Or explore leisurely, mastering each world and uncovering all its secrets. Either way, Ellipsis will keep you on your toes with surprises from start to finish.\n“It's like the best parts of Geometry Wars” - Tycho Brahe (Founder of PAX, Penny Arcade)\nEllipsis is designed with a clean minimalist interface and absolutely ZERO text. It lets the player explore at their own pace while gently guiding them, thus producing an incredible pick-up-and-play experience.\nKEY FEATURES\n\n• 150+ unique hand-crafted and increasingly hard levels, set in 8 diverse worlds\n• Level editor with Steam workshop support\n• Pick up and play for all ages\n• Beautiful minimalist graphics\n• Zero text - Accessible to a global audience\n• Mouse, Controller and Touchscreen support, playable on 2-in-1 Touch PCs\n• Windows, Mac & Linux support\nCREDITS\n\n• Designed by Yacine Salmi and Stefan Hell\n• Beautiful soundscape by Filippo Beck Peccoz\n• Community and PR: Christopher Wulf and Felix Kramer\n• Special thanks to Alex Zacherl, Johannes Roth, Max Wandinger\n\nAnd a big THANKS to you, the player.\n\nELLIPSIS (noun): an intentional omission from a text without altering its original meaning.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Salmi Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11355,"name":"Tales of Escape","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/720/72061243c3e4d522a842e75903161878.jpg","description":"Have you ever wanted to play an escape room alone?\nNo?\nWell, neither did we! It's why we created a multiplayer escape room platform, so you can play with up to 6 people.\nTales of Escape is a series of multiplayer, VR (also playable on nonVR computers), escape room adventures. Gather around the campfire with your friends and choose a story to play! This is the base game which includes \"Cold as Ice\", the first of the stories, where you find yourselves trapped in a butcher's shop with no way out. Fight against the clock to solve the puzzles and get out of there before it's too late! Also, what happened to that lovely couple who had the store anyway?Solve Puzzles on: Single Or Multiplayer with Up to Six People!\nPc, Vive, Or Potato! (Warning: Can't actually play on a potato)\nCross platform steak-slapping!\nThis is only the beginning... No, seriously, this is the first room of the series and more rooms are coming soon as downloadable content!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"OnSkull Games","platforms":[{"id":0,"name":"PC"}]},{"id":10640,"name":"Dark Fall: The Journal","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f92/f9239c35537a247f6d072e4d8cac335e.jpg","description":"This Myst-style horror-adventure game will bring fear into your heart. From the very beginning you are exposed to an overwhelming but invisible ghost presence – strange calls, footsteps, voices from nowhere. In order to help your brother and survive you will need to solve the mystery of this abandoned, haunted place. And remember! Do not let it to find you! Do not let it to find you... Do not.. Let... find...\nThe game is best played in a dark room with your speakers turned up. Unless you're scared, of course.The Story - many decades agoThe old, abandoned train station at Dowerton hides a history of disappearances, mystery and hauntings. The nearby Station Hotel was once a busy, bustling place for weary travellers to rest and relax...but something went wrong...on the night of April 29th, 1947, the guests and staff vanished without trace, never to be seen again.The Story - presentYou come back from work hoping to get a good night's sleep but then you notice light blinking on your answering machine. It was your brother – an architect redeveloping an old train station and hotel. He called to ask for your help. Alarmed by his frightened voice, cryptic information about some disappearance and strange whispers in the background you board a train without hesitation. From now on your adventure has just begun and soon you will realize that although no one is there, you are not alone...Key FeaturesExplore the haunted hotel and train station, alone at night.\nUse Ghost-Hunting Gadgets to ‘see’ into the past, and hear the dead.\nAn eerie, World War 2 setting is fully realised in 3D graphics.\nUse detective skills to uncover secret places and learn long lost secrets.\nChallenge the mind by solving many devious puzzles and enigmas.\nCommunicate with ghosts via a Ouijaboard.\nDecypher an ancient, long forgotten, language.\nA non-linear story by Jonathan Boakes, author of The Lost Crown.\nFull cast of actors & sound to bring the haunted location to spooky life!\nUtilise high-tech surveillance equipment, to watch supernatural activity.\nResearch local Ghost Stories to learn more about the Dark Fall.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Darkling Room","platforms":[{"id":0,"name":"PC"}]},{"id":616675,"name":"You Suck at Parking","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccb/ccb8e9ca457b2a41e9f27bcc1f02f5a3.jpg","description":"You Suck at Parking™ is the only racing game where the goal is to stop (probably).","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Happy Volcano","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":44484,"name":"BattleBit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77b/77b8f6c7cf1499a0fc8ada6682af3995.jpg","description":"BattleBit is a Low-Poly Tactical Shooter with Hardcore elements. Gameplay focused fully on team play, your actions with your teammates will change the tides of war.\nKey Features in BattleBit\nMultiplayer - Fight online in a massive multiplayer environment with your friends or other players. Form a Crew and team up against the enemy in our official defensive and offensive game modes. (Players can play on official or unofficial servers to get into the battle.)\nWeapons & Vehicles - Take the battle on foot, to the air or in armored ground vehicles. Rush into battle with unique weapon loadouts that players can customize to their liking by completing objectives to unlock attachments.\nClothing - Customize your soldier's appearance by using our “clothing” options whilst in-game. Each set of upper and lower body cosmetics comes with different protection levels (e.g. “Chest Plate\" provides a player with 50% more armor/protection.)\nStatistics - One of the most important features included in the game which allows players to view their in-game progress (e.g. Kills, Deaths, Assists, Revives etc.)","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"BATTLEKOT","platforms":[{"id":0,"name":"PC"}]},{"id":21272,"name":"Blackbay Asylum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b5/5b510a94f2ddb20bbe7c6929e4734e5f.jpg","description":"You take on the role of a confused psychopath who finds himself able to leave his cell one day. Explore the hospital grounds, solve mind shattering puzzles, survive relentless horrors and follow the story of Doug Dunheiw as he tries to find some clarity in what goes on at Blackbay Asylum.The Story:Doug Dunaheiw, convicted mass murderer and psychopath, sits in his cell writing a farewell letter to his stuffed bear Teddy as he's about to go into \"exploratory surgery\". However, he soon discovers that the cell door is unlocked and the decaying hospital appears to be abandoned. With Teddy strapped to his belt he sets off to find his freedom... But this will be easier said than done!\nAn ancient evil has taken hold of the hospital, bending reality and dreams into one. Unspeakable horrors lurks around the corners and mind-bending puzzles litters the hallways, making escape impossible for all except for the most hardened psychopath!Gameplay:Blackbay Asylum is an Adventure/Puzzle/Horror/Comedy with a H.P. Lovecraft inspired storyline.\nVaried gameplay, shifting between Birds-eye and First person view depending on the situation/level.\nFully interactive environment!  Doug can interact with basically everything in the environment from computers and doors to potted plants and trashcans, and if he can't use it or pick it up, he'll say something about it.\nLots and lots of unique and mind shattering puzzles!\nBattle monsters and traps using your wits. (or die horribly)\nEasy to use inventory with Journal.\nInteractive dialogue with other survivors.\nH.P Lovecraft inspired story told through old journals, notes and dialogue.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"TAD Productions","platforms":[{"id":0,"name":"PC"}]},{"id":21078,"name":"Ignite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91f/91f5a30ac43032bc339b26b7294028b7.jpg","description":"This game was created as part of Byking's newcomer training program\nDepending on your PC environment, the game may not run properly\nAlso, unforeseen problems may occur during the game\nPlease be aware of this\nhigh-level magic command action game!\nMagic will be used to defeat the oncoming enemies in an exhilarating command action!\nMagic attack by command input, requires precise operation and instantaneous power.\nThe \"Score Attack Battle\" is all about eliminating large numbers of enemies and surviving longer.\nHow can you conquer \"Ignite\"?\nA magical experience like no other!\n“Ignite\" is a game in which you play the role of \"Ig,\" a wizard who controls fire.\nThe game is a fusion of magic command action and score attack.\nIt is an exhilarating magical command action that uses three types of unique magic and super magic to wipe out the ghosts of the remains.\nEnjoy the thrill of burning everything with your flashy fire magic!\nAccurate and unmatched command input and instantaneous force are important.\n“Command input\" with 4 different buttons.\nLearn each magic command to destroy the enemy army faster and by more!\nScore attack battle based on “WAVE system”\nBattles progress by “WAVE system”.\nSurvive longer and achieve a High Score!\nHow can you conquer \"Ignite\"?\nExperience magic like never before!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nemesys Games","platforms":[{"id":0,"name":"PC"}]},{"id":20110,"name":"RefleX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f4094908998df2e22bfb152f163c409.jpg","description":"Reflex - A casual sci-fi puzzle game.\nYour homeworld has been attacked devastating all life and it's up to you to fight back. Using the advanced Reflex missile you will infiltrate unknown enemy bases across the galaxy as you track them back to their homeworld.\nIn this casual puzzle game, you add components to unknown enemy bases that will reflect, duplicate and split the Reflex missiles. You will need to destroy the power generators, communication systems and weapon platforms across more than 100 levels. Each new world brings with it new technology to utilise and deal with from laser fences, breakable walls, gas vents, laser turrets, and the dreaded teleporters.\nEasy to learn game mechanics. Click on a base socket and use the radial menu to select the component you wish to build. Be warned though, construction is not instant. Each level gives you access to a set of components and it is up to you to work out the best way of using them.\nThere are more than 30 different components that can make up a level and you will need to devise tactics of what to build, what to deconstruct, and when. It will not be as simple as placing down components and firing the missile. There will be times you will have to remove a component that is in short supply to get the missile to its destination.\nSome of the base structures will force you to react in potentially unexpected ways; such as the rotating reflector and the unstable reflector.\nYou will also need to handle multiple missiles at the same time. Something that will require split-second timing. For example, you may need to destroy a power generator to take down a temporary reflector in the base before a missile can proceed.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Easy game","platforms":[{"id":0,"name":"PC"}]},{"id":16527,"name":"Galactic Arms Race","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c88/c887e10609adeb718f7e3386b0c1a219.jpg","description":"Pilot a gun ship and battle aliens, pirates, and other villainous enemies, to gain levels, skills, and most importantly, discover unique and potentially more powerful weapons. Through the unique cgNEAT content-generation technology, new weapons are constantly created by the game automatically.\nExperiment\nA key objective of this game is to explore the potential for automated content generation technology to intelligently create content for games. In GAR, all player weapons are generated by the cgNEAT algorithm based on weapon usage statistics. However, cgNEAT does not simply respawn weapons that people like. Rather, it creates new weapons that elaborate on those that have been popular in the past.\nGame Mechanics\nGAR combines elements of old-school space shooters like Star Control, action-RPGs like Diablo, and open-world space adventure games like Freelancer. The graphics are fully 3D but in top-down or \"2.5D\" mode. The chase camera and movement interface is similar to many online RPGs such as WoW. Earn ranks and credits by completing missions and destroying enemies. Use the credits earned to upgrade and customize your gun ship.\nGalaxy\nThe game progresses through different and increasingly challenging solar systems. Throughout the galaxy are various factions, both friendly and hostile.\nGame Modes\nGAR game modes include (1) single player campaign mode, (2) instant-action system defense mode, and (3) multiplayer mode for up to 32 players with both coop and PVP. You can run your own Galactic Arms Race galaxy by downloading the standalone server. A simple windows GUI makes it easy to administrate your galaxy.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Evolutionary Games","platforms":[{"id":0,"name":"PC"}]},{"id":13043,"name":"WayOut","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f1/0f1abae2145a8c7d8c6f273aed27656f.jpg","description":"Trading Cards and Achievements Available\nAbout the GameBased on Lights Out gameplay, WayOut goes beyond that and brings great variety of level shapes and mechanics into it. Each level has the same goal - switch off all tiles using the least amount of moves. Test limits of your brain by perfecting each puzzle. Let your mind be your guide in meditative and relaxing, yet challenging, journey.\nAccording to Zen philosophy, game has minimalistic UI - no timers, score or move limit labels. No distraction, just you and puzzle.Features combination of new and classic Lights Out mechanics\n100+ handcrafted levels\n6 chapters, each with its own color theme and gameplay experience\nunique graphic style along with ambient soundtracks grants beautiful relaxing atmosphere","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Konstructors","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":12503,"name":"Sumo Revise","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d48/d483d29e7facc126672696729d23406a.jpg","description":"Is it a bird? Is it a plane? No, it's super fat guys free-styling!!!\nSumo Revise is a local-multiplayer brawler designed to harken back to the zaniness and replayability of couch-crowding games like Super Smash Bros. and GoldenEye 007, with a splash of silliness of games like QWOP and Surgeon Simulator 2013.FEATURES\nINSANE, UNPREDICTABLE GAMEPLAY\nStruggle to force your friends out of the ring in lightning-fast, ever-changing rounds. Grab power-ups to learn the secret abilities of the sumo masters. Don hats and costumes on the fly to confuse your opponents (and yourself)!\nEXOTIC LOCATIONS AND EXTENSIVE CUSTOMIZATION\nBattle in seven different arenas in the far reaches of Sumo Land. Sharpen your skills with 12 different modes and gameplay modifiers, including Free-For-All, Capture the Flag, and Bacon. Create and share your own levels and modes for never-ending insanity!\nTHE PLACE IS CRAWLING WITH SUMOS!\nPlay with up to 8 players simultaneously, or supplement with AI opponents if you're feeling lonely.\nREALISTIC SUMO PHYSICS?\nUnfortunately, since they're so portly the sumos don't exactly maneuver well...Move wisely!\nDISCLAIMERSSumo Revise is designed to be a local multiplayer game, and some of its best qualities are lost during online play. As such, Sumo Revise is at this time offline-only. BE ADVISED. Also, playing with 8 players simultaneously requires four gamepads, two keyboards, and a mouse. The extra keyboard is needed because keyboard hardware can only receive a few inputs at once. BE ADVISED.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"David Szymanski","platforms":[{"id":0,"name":"PC"}]},{"id":9942,"name":"Parkitect","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29c/29cb2854117de92ed92aa3ce7332b068.jpg","description":"WorkshopCurious about what other people are making, looking for inspiration or maybe you just want a nice park for your guests? Share your roller coasters, parks and scenery in the Steam Workshop!\nAbout the GameParkitect is a business simulation game where you must build a successful theme park.\nBuild the theme park of your dreams, and keep it running! Meticulously design that newest roller coaster, place the rides where you want them to be, and construct scenic structures and objects to make the park beautiful. Let your creativity shine, and when you're finished share it with the world!FeaturesTools to build the theme park of your dreams\nA robust, piece-based roller coaster designer to let you build the greatest roller coaster you can think of\nDetailed guest behaviors. Watch them take the train to that new section of the park, or read their map to find a ride\nBuild efficient transport infrastructures to keep your park stocked\nMaintain the illusion by hiding utility structures and the inner workings of the park from guests\nExtensive support for mods and custom content","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Texel Raptor","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":2930,"name":"Bloo Kid 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e9/8e94ae31da08e4340144611129727425.jpg","description":"Bloo Kid 2 is a classic 2D retro-style platformer experience with lovely designed pixel-graphics and a full chiptune soundtrack. Run, jump and swim your way through five huge worlds with twelve levels each. Master brutal bossfights and discover lots of secrets in the world of Bloo Kid 2.\nAfter rescuing his girlfriend from the hands of the evil wizard, Bloo Kid and Pink Girl enjoy life with their newborn \"Pink Kid\". But then, a whole new adventure starts just out of the bloo...\nOriginally released as a mobile game, Bloo Kid 2 now makes it's way to the world of Desktop Gaming. The STEAM version includes 15 challenging bonus levels that can be unlocked ingame when you have collected enough stars.\nBloo Kid 2 features:\nfive worlds with twelve levels each\nhandcrafted, colorful pixel-graphics\na full chiptune soundtrack\nepic boss battles\ntons of secrets","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"winterworks","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":1479,"name":"Letter Quest: Grimm's Journey","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbe/bbe49b581eaebe4c644fd37bcfd32f4b.jpeg","description":"Ever wondered what would happen if you crossed Scrabble with an RPG? Now you don't have to, because Letter Quest is here!\nHelp Grimm and Rose, a couple of adorable grim reapers, defeat monsters, ghosts, evil bunnies and more using the power of words!\nGameplayLetter Quest is a turn-based RPG where players attack monsters by spelling words. But be careful since the monsters know how to fight back - they can create different letter tiles such as poison, plague, stone, whirlwind, duplicator, spike and flipped, steal your health, heal themselves, use critical attacks, and much, much more!\nDon't worry - Grimm and Rose have a lot of tricks up their sleeves too, including crystal tiles that give special bonuses, upgradeable weapons, books that provide unique boosts, special items, upgrades, potions, and more!\nFeatures40 stages, with 4 unique ways to play each one\nFive separate areas, each with unique art and music tracks\nTons of upgrades, books, potions, special items and weapons to help you on your journey\nOver 30 monsters to fight\nBoss monsters with unique abilities\nOver 6 hours of gameplay - much more if you choose to complete everything!\n70 quests to complete\n52 achievements\nA built-in dictionary of over 190,000 English wordsKeyboard Support\nAll of the battles in Letter Quest can be played with keyboard - no more hunting for letters with the mouse if you don't want to! Simply type letters to add them to the current word, hit backspace to remove the last letter typed, and much more!\nLetter Quest also supports setting key bindings for most hot-keys right in the game's options menu.Bonuses!\nEvery copy of Letter Quest comes with the full 8-song chiptune-y soundtrack, 4 high-res wallpapers, and some custom avatars.About Bacon Bandit GamesWe're a two-man Canadian game dev team attempting to make great games. Letter Quest is our first game, and we really hope that you enjoy it!More Infohttp://www.facebook.com/baconbanditgames\nhttp://twitter.com/thebaconbandits","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bacon Bandit Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":708999,"name":"Grand Theft Auto: Vice City – The Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0d/a0d4405596639b3fe4de603f4489755e.jpg","description":"Welcome to the 1980s. From the decade of big hair and pastel suits comes the story of one man's rise to the top of the criminal pile. Grand Theft Auto returns with Tommy Vercetti’s tale of betrayal and revenge in a neon-soaked tropical town full of excess and brimming with possibilities.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rockstar Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":380862,"name":"Murder by Numbers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ded/ded46e6f1ffa61c87408ac1646b60f0c.jpg","description":"Solve Pixel Puzzles to find clues.\nUse those clues to interrogate witnesses.\nWork your way to the truth...\n...and uncover the mystery of Murder by Numbers!\nLos Angeles, 1996. Honor Mizrahi was just an actress on a hit TV detective show. But when her boss ends up dead just minutes after he fires her, she finds herself starring in her own murder mystery. Teaming up with SCOUT, a reconnaissance robot thrown away after a mysterious incident, she sets out to clear her name - and a new detective duo is born!\nInvestigate a range of murders across TV studios, glitzy award shows, drag clubs, and more - all set to an energetic soundtrack from famed composer Masakazu Sugimori (Phoenix Wright: Ace Attorney, Ghost Trick and Viewtiful Joe).\nUncover a dark conspiracy by interrogating a wild range of weird and wonderful characters, designed by the incomparable Hato Moa, creator of Hatoful Boyfriend.\n90s fashions! Upbeat jams! Sass dialled up to 100! Questionable jokes! Drag queens! All that and more awaits... in Murder by Numbers!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mediatonic","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":238390,"name":"New Super Mario Bros. U Deluxe","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61c/61cf09a86fe686a01a0c9863fc4230a7.jpeg","description":"Take on two family-friendly, side-scrolling adventures with up to three \r\n      friends* as you try to save the Mushroom Kingdom. Includes the New Super \r\n      Mario Bros. U and harder, faster New Super Luigi U games—both of which \r\n      include Nabbit and Toadette as playable characters!\r\n    \r\n      Two games in one, for double the fun! Simple, straightforward controls, \r\n      new playable characters optimized for younger and less-experienced \r\n      players, and a wealth of bonus content—like a Hints gallery and helpful \r\n      reference videos**—make this a perfect choice for anyone looking to \r\n      introduce their family to the wonderful world of Mario. All a player \r\n      needs is one Joy-Con™ controller, so two people can team up right out of \r\n      the box! Tackle 164 platforming courses in the two main game modes and \r\n      enjoy extra replayability with three additional game modes in which you \r\n      can also play as a Mii™ character: Challenges, Boost Rush, and Coin \r\n      Battle!\r\n    \n\r\n        A variety of playable characters are available, some with unique \r\n        attributes that affect gameplay and platforming physics.\r\n      \n\r\n        Younger and less-experienced players will love playing as Toadette, \r\n        who is brand new to both games, and Nabbit, who was formerly only \r\n        playable in New Super Luigi U. Both characters offer extra assistance \r\n        during play.\r\n      \n\r\n        Multiplayer sessions are even more fun, frantic, and exciting thanks \r\n        to entertaining character interactions. Need a boost? Try jumping off \r\n        a teammate’s head or getting a teammate to throw you!\r\n      \n\r\n        Features a wealth of help features, like a Hints gallery, reference \r\n        videos**, and a Super Guide in New Super Mario Bros. U that can \r\n        complete levels for you if they’re giving you trouble.\r\n      \n\r\n        Three additional modes—Boost Rush, Challenges, and Coin Battle—mix up \r\n        gameplay and add replayability, while also upping the difficulty for \r\n        players who want to try something harder. Players can use their Mii \r\n        characters in these modes!\r\n      \n\r\n        Share the adventure with a friend! During two-player co-op gameplay, \r\n        each player can use a single Joy-Con controller, so no additional \r\n        accessories are required. And to add two more players to the mix, all \r\n        you need is one extra set of Joy-Con controllers (sold separately).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":53381,"name":"The Lord of the Rings: The Return of the King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f2/3f214611fb5dc9a45f0ac66a5c4c0142.jpg","description":"The Lord of the Rings: The Return of the King is a 2003 action/hack and slash video game developed by EA Redwood Shores for the PlayStation 2 and Windows. It was ported to the GameCube and Xbox by Hypnos Entertainment, to the Game Boy Advance by Griptonite Games, to mobile by JAMDAT, and to OS X by Beenox. The game was published by Electronic Arts. It is a sequel to the 2002 game The Lord of the Rings: The Two Towers.\nThe game is an adaptation of Peter Jackson's 2002 film The Lord of the Rings: The Two Towers and his 2003 film The Lord of the Rings: The Return of the King, which was released shortly after the game. As it is not an adaptation of J. R. R. Tolkien's 1954 novel, The Return of the King, the third volume in his Lord of the Rings trilogy, anything from the novel not specifically mentioned or depicted in the films could not be represented in the game. This is because, at the time, Vivendi Universal Games, in partnership with Tolkien Enterprises, held the rights to the video game adaptations of Tolkien's literary works, whilst Electronic Arts held the rights to the video game adaptations of the New Line Cinema films.\nThe game is similar to its predecessor in basic gameplay, but differs by adding multiple storylines, more playable characters and increased interaction with environments. A two-player co-op mode is also available for some missions. As with The Two Towers, The Return of the King was developed in close collaboration with the filmmakers, using many of the actual reference photos, drawings, models, props and other assets from the film. The game was met with positive critical reception for its graphics, audio, and gameplay, although its camera positioning and short length were criticized.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Visceral Games","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":37059,"name":"The Lost Crown: A Ghosthunting Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8b/a8bd590f842ea90e2fa0cbbba70aa528.jpg","description":"Unravel an ancient mystery and search for an ancient treasure on England's fog-shrouded coastline, famed for its legends of smugglers, pirates and ghosts. Join ghost-hunters Nigel Danvers and Lucy Reubans as they investigate a tale of horror and haunting. Wielding the tools of the modern-day ghost-hunter in a cinematic, richly detailed interactive world of wind-swept coastlines and crumbling crypts, you will be captivated, taunted and teased by mind-bending puzzles and interactions with the town 'locals'. But, be warned, there are those who will stop at nothing to prevent Nigel discovering \"that which should stay hidden\". With nerves of steel and wits to match, in your search for The Lost Crown you will soon discover long lost secrets previously known only to the dead!Key features:Spine-tingling ghost story.\nRealistic ghost-hunting, featuring actual E.V.P. (Electronic Voice Phenomena).\nExplore isolated, creepy locations with a nite-vision camera.\nPhotographs of unexplained entities captured by creator Jonathan Boakes while researching the game.\nA Full cast of actors to bring the world of Saxton to life.\nChilling original soundtrack.\nPoint and click gameplay with both first and third person interaction.\nRealistic and integrated puzzles.\nA stunning 30+ hours of gameplay.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Darkling Room","platforms":[{"id":0,"name":"PC"}]},{"id":29099,"name":"Defense Grid","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21e/21e42d3494bb420b6b1462d087c4dc58.jpg","description":"Defense Grid: The Awakening is the definitive Tower Defense Strategy game that’s easy to pick up, engrossing to play, and hard to set down.  Strategically place your towers on the map to prevent alien enemies from stealing your power cores","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Hidden Path Entertainment","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28274,"name":"Heavy Weapon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f70/f70b50b640d876961a2da13020d4c77d_w2hIBYR.jpg","description":"Single Player, Xbox Live Multiplayer 1-2, 5.1 Surround Sound, HD (High Definition). Sure, you can defend our way of life for free. For a while. But if you're serious about liberty and committed to dealing out gigajoules of destructive power, there's only one way to go. Buy Heavy Weapon now! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"PopCap Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":22441,"name":"Deadly Sin 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17e/17e0cf88ae6e163ab95be6f389eb1d49.jpg","description":"A thousand years of peace are shattered by betrayal, political upheaval, and war. Play as the hero Carrion Iblis, as the story of Siegfried, the Empire's true successor, plunges the world further and further into darkness.\nImmerse yourself in a world of conflict as several opposing factions clash for dominance over the Archaelus Empire and its people. Take up the mighty blade of Carrion Iblis as he and his friends tear through a massive web of manipulation. Theirs is a journey that will crack open the doors of destiny, setting the stage for a truly epic struggle for the fate of the world!\nIn this adventure, Carrion must clash against enemies from within and without. He will face down his own countrymen, repel an invasion of undead foes, conquer his personal demons, find love, and challenge the power of the heavens.\nDeadly Sin 2 is a 20-30 hour fantasy RPG epic. It is not a direct sequel to Deadly Sin 1; much like the games in the Final Fantasy series, Deadly Sin 2 is merely the next in a line of spiritual successors to the original. Deadly Sin 2 boasts a massively improved battle and menu system, as well as all-new features.\n1) A fully scripted, back-view, conditional turn-based battle system by Mithran. This is a sophisticated evolution of the traditional RPG battle formula that includes a winner-take-all threat system, and new stats, including Speed, Build, Shield Block, MP Regen, and Equipment Weight.\n2) An original soundtrack written by the game creator, Harmonic.\n3) A large amount of dynamic, enjoyable, and rewarding side-quests that bring the world to life!\n4) Augment system: customize any weapon, shield, or helm/body/arm armor with augments that you find or purchase around the world. Augments add stats, status effects, elemental changes, and other enhancements that are endlessly fun to play around with.\n5) In-depth skill point system: each PC has a unique skill tree. Invest skill points gained from leveling up or completing quests. If you don't like how your character is developing, you can have your skill points refunded at an inn!\n6) Monster nodes: find these nodes to disable random encounters and obtain skill points. If you want to fight enemies again, the monster nodes can be turned back on at your will!\n7) Mouse interface: you can use the mouse to do almost everything, including movement. You can choose not to use the mouse by simply moving it off screen. Use Alt-Enter to toggle full screen mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dancing Dragon Games","platforms":[{"id":0,"name":"PC"}]},{"id":17811,"name":"Axis Football 2015","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c85/c851fef063a4f93ae7dd6b67c4c3f86c.jpg","description":"Axis Football OverviewAxis Football is a high-quality, 3D American Football Game. Choose from 32 team and play in either season mode or quick match against AI or local multiplayer. A great alternative to Madden, Axis Football features excellent controls and a unique aimed passing system that gives unprecedented accuracy and control of where the ball is thrown.  Unlike the few other football games, Axis Football was specifically designed for play on a computer and takes full advantage of the mouse/keyboard controls as well as controllers.Teams and RostersAll 32 cities from the NFL are represented in Axis Football.  Each team features its own ranking in passing, running, pass defense, run defense, and special teams. Additionally, each player in the game comes complete with their own stats for all of the various football metrics (speed, tackling, blocking, etc.).  The names, numbers, and races of all players are stored in external files allowing for complete customization/modification of rosters.  Complete mod support will be added soon!Axis Football 2015 Features and Updates\nSeason Mode with different schedules each year and season-long stats!\nCoach Mode Call the plays and watch the action! Available in both quick match and season mode!\nController Support. You can now use your XBox 360 controller to play!\n2-Player, Local Multiplayer. Using two controllers\nPlayer Mod Support You have control over the name, number, and race of each player in the game\nUniform Mod Support Have complete control over each team's home and away uniforms\nSteam Achievements.\nSteam Trading Cards.\nI know Axis Football doesn't have everything that you want it to have - yet! It's going to take some time to get all of the features that you have come to expect. I'm asking for your support in helping build a football game franchise that gives players options. I'm in this for the long-haul. If you decide not to purchase the game, I ask that you at least mention it to a friend!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Axis Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17657,"name":"Cherry Tree High Comedy Club","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb2/fb24075bf4d27bc16375dc6502de16ad.jpg","description":"Comedy fanatic and high school student Mairu Hibisu has decided to set up a comedy club in her school, but her nemesis and the head of the student council, Chitose Karasuyama, isn’t about to make things easy… The school rules require a minimum of 5 students to set up a new club and Mairu is 3 people short! Spring break has just started and Mairu has until the end of April to recruit the 3 new members she needs to start the club or Chitose will have the last laugh!\nGuide Mairu through idyllic Cherry Tree Town as she makes new friends and endeavors to persuade them to join her high school comedy club in this anime-style comic adventure game.\nExplore the town and level up Mairu’s repertoire of conversational topics by reading books, watching TV, etc. then apply them to persuade potential recruits to join your new club. Some topics require money to build up, so you will need to find part time work such as cleaning the local temple and making jewelry accessories.\nDeveloper 773’s game features a host of quirky characters, catchy music, and is a must-play for fans of anime and manga. Laugh and the world laughs with you!Key Features:6 characters to recruit and many more NPCs\n12 conversational topics to polish and upgrade, such as video games, romance, news, cooking, sports\nAll original, high quality graphics and catchy music\nFun dialogue and memorable characters\nColorful, warm anime-style tone and accessible game mechanics\nJapanese setting AND westernized localizations available!\n* Trailer and screenshots above are from the westernized version","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"773","platforms":[{"id":0,"name":"PC"}]},{"id":13532,"name":"Sakura Nova","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccd/ccdf2389b6540fc49ffe23e1b15e3bd5.jpg","description":"Once...Twice...Three times the adventure, three times the fun, three times the ladies!\nJoin Mikage, Kaguya, and Arisa as they train together, fight together and come together at a prestigious academy for young sexy aspiring knights. To join the ranks of the warrior elite, the femme fatales must overcome their clashing personalities and learn to work together - no matter what it takes! It’s an adventure of action, magic and humor as Winged Cloud presents their newest titillating adventure, Sakura Nova!\n- All new, playful adventure from Winged Cloud!\n- Twice the size, twice the action, one of Winged Cloud's biggest titles yet!\n- Japanese Voice Acting for main characters!\n- Gorgeous girls and art from the ever popular artist Wanaca!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Winged Cloud","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12254,"name":"Shark Attack Deathmatch 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7d/e7d683949a9f6ba7d881faf514702a2b.jpg","description":"Shark Attack Deathmatch 2 captures the thrill of underwater multi-player mayhem like no other game. The combat is savage, gritty and brutal. Players hunt each other down in various game modes with the constant threat of terrifying sharks joining in on the bloodshed.Tear divers apart as you take on the the role as the ocean's top apex predator, The Great White.\nBrutal Multiplayer Combat\nMulti-player combat in Shark Attack Deathmatch 2 is intense. Up to 8 Online Players battle it out against each other with the added threat of terrifying sharks joining in on the mayhem.\nPredator Mode- Play as the Great White Shark\nPlayers get a chance to take on the role of the oceans top apex predator , the Great White. Tear divers limb from limb from in this visceral experience as the hunter becomes the hunted.\nOnline CO-OP Survival Challenge\nShark Attack Deathmatch 2 features the most intense CO-OP underwater action you will ever experience.\nIt's just you and a friend against a terrifying onslaught of sharks! Will you survive?\nSingle Player Survival Challenge\nSurvival is a single player experience where players take on a constant onslaught of some of the most terrifying beasts in the ocean. Every encounter you survive could have you climbing the global leaderboard for prestige and world domination.\nBreathtaking Seascapes and Levels\nThe game already features 6 amazing maps, each with it's own unique style and location. Whether it be hunting down the Ragged Tooth Sharks in The Boneyard, surviving brutal attacks in the flooded New York City map called Tsunami, fighting among the carnage of Wrecks and Reefs, exploring Atlantis, or battling between the Russian Attack Subs in The Red Tide. New maps will be released constantly during the early access process.\nCharacter Customization\nPlayers have complete control of all their gear. Personalize Wetsuits, flippers, goggles, tanks, snorkels and more. Create your own signature look that other players recognise and will soon grow to fear.\nTerrifying Sharks and Creatures\nJump straight into the action and take on a variety of terrifying sharks. Great Whites, Ragged-Tooth's, Bull Sharks, Black Tip Reef Sharks, Shortfin Mako Sharks and Tiger Sharks, when provoked will hunt you down and become your worst nightmare.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lighthouse Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":9594,"name":"Worlds Adrift Island Creator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5a/d5a3f7544244d8864f621665b48f2efc.jpg","description":"Check Out the Full Game - Worlds AdriftBecome a Founder and get immediate access to the Closed Beta for Worlds Adrift!  Limited quantities available each week.\n*These items will be made available at a future date, once Worlds Adrift has progressed to Open Beta on Steam Early Access.\n**Closed Beta runs on North America, and Europe based servers ONLY.  Worlds Adrift is now available worldwide however please note that the game interface and customer support is in English only.\nAbout the GameCreate the vast floating universe for the upcoming Worlds Adrift!\nWorlds Adrift will feature a sprawling open world of shattered islands.  As part of our open development philosophy we want to engage you, our players, in creating this beautiful universe together with us.\nFor the first time ever in an MMO Worlds Adrift lets you, the players, shape the world that everyone will explore. Every region of the world will feature hand-crafted islands full of unique artistry and creativity.  This will make its universe a richer, more varied place to explore than a procedurally generated approach could achieve.Help Create a Living WorldDesign your very own island for the chance to see it in the final game. Hundreds of islands are already being discovered by real players right now  - when will someone explore yours?Design ModeCreated by the team as an internal tool to craft islands, the Island Creator is robust and allows you to use a diverse set of models and textures to create something unique.Craft GameplayBeyond crafting an island that is visually expressive, you can place loot spawn points and design puzzles for players to solve.  With the Island Creator you are both artist and designer.Play ModeSwitch to play mode and explore your island from a player’s perspective, all within the tool.\nBrowse Steam Workshop to discover islands that have already been submitted by the community, ready for you to test and rate. Design your island and help create the Worlds Adrift universe!\nThink you can do better? Submit yours today!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PC"}]},{"id":1698,"name":"Giana Sisters: Twisted Dreams - Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e17/e173c34e9b169b50f55f19b16347ffed.jpg","description":"Dash through tricky levels and transform the whole world at will in this fast-paced award-winning platformer.\nGiana Sisters: Twisted Dreams – Director’s Cut combines graphics that pack a visual punch and tight controls with the challenge of retro era platforming.\nFluidly morph between two dynamically different dream worlds to solve puzzles and combat grueling enemies and bosses.\nKey Features\n- Blaze through 33 levels including a brand new Rise of the Owlverlord adventure.\n- Each level transforms between two contrasting dreamworlds!\n- Easy and hard difficulty modes for all levels and bosses.\n- Intuitive controls and smooth game flow; master the tight controls and defeat the devious trials ahead.\n- Full HD 1080p with a smooth framerate: Giana’s dreamworlds leap off the screen with gorgeous 3D graphics that morph before your very eyes.\n- Experience a dual crossfading soundtrack by Chris Hülsbeck and Machinae Supremacy.\n- Rich extras: Halloween- and Christmas-themed levels accessible from the start.\nThe downloadable version of this game supports English, French, Italian, German, Spanish, Polish, Russian, Japanese.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Black Forest Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"}]},{"id":20584,"name":"Sepia Tears","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8b/d8bd568db215626c9bb6fade2649f17f.jpg","description":"\"I'm the person you wish you never met.\"\nSepia Tears is a romance visual novel. It's about a memory that a boy named Mark tries very hard to forget, and a girl named Myra who unearths it.\nTogether, they search for a storybook romance and realize that love doesn't always bloom as neatly as it ought to.\nPerfect for fans of anime and VNs who want a classic story with a twist!\nFeatures:\nVocal ending song\n40,000 word story\nCG gallery containing game CGs, chibi CGs, and promo art","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Scarlet String Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20100,"name":"Avalanche 2: Super Avalanche","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/771/771c6c656ffcd243ba7b1df92cfde481.jpg","description":"Climb the falling blocks as you race to avoid the rising lava in this challenging arcade platformer!\nPlay as an exceptionally bouncy marshmallow as you dodge enemies, defeat colorful bosses, and try to avoid getting crushed. Buy power-ups from falling shops, collect missions, bank your coins, and purchase powerful game-changing upgrades.\nAvalanche 2 features a wildly addicting single player and a hilariously fun co-op mode. Avalanche 2 is a fun game with simple controls and a lot of depth. It's a great game for all players ranging from the casual to the hyper competitive.\nInsanely fun CO-OP mode\nMissions and challenges\nMany more badges and costumes\nUnlock all your favorite powerups\nOver 100,000 combinations!\nHigh quality music tracks","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Beast Games","platforms":[{"id":0,"name":"PC"}]},{"id":19858,"name":"FaeVerse Alchemy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e88/e885ec8a0313bcfd74c8fb6bb4f2c28b.jpg","description":"FaeVerse Alchemy is an engaging and challenging puzzle game where you combine three or more of one kind of element to form a single piece of a higher quality element.\nThis game is in Early Access, and is not yet complete. Most of what we have publicly available will still evolve over time.\nFeatures currently available to play:\nChaos Mode - All items can drop, random equipment on start.\nInfinity Mode - It is impossible to ever end.\nPuzzle Mode - Complete unique puzzle layouts.\nPure Mode - No items are able to drop.\nVersus Mode - Play PVP or COOP with a friend locally.\nAbyss Mode - Take on the daily challenge where if two people on different computers make the exact same moves they will get the same exact game.\nExplore Mode - Go to different FaeVerse worlds and their locations, complete goals, and unlock more.\nIf you have any questions feel free to ask in our forum.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Subsoap","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":19277,"name":"F1 2010","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68d/68d193d480b27535e198d93399501e0e.jpg","description":"BE THE DRIVER....LIVE THE LIFE\nExperience the exclusive world of FORMULA ONE™ like never before.\n\nDiscover what it’s like to sit behind the wheel of the world’s greatest cars as you race wheel to wheel on all 19 circuits from the 2010 FIA FORMULA ONE WORLD CHAMPIONSHIP™ calendar, beautifully realised and in full HD.\n\nProve yourself worthy of being the team’s number 1 and gain the ability to direct the development of your car. Work with your Race Engineer to customise a huge range of vehicle variables and eek every last ounce of performance from the car, or leave the detailed decisions to your experienced support team and head straight out onto track.\n\nMaster the iconic twisting streets of Monaco, thrill at the high speed of Monza, and overcome the challenge of a floodlit night-race at Singapore to beat your rivals and take the FORMULA ONE crown in one of the most beautiful and involving racing games to date.\n\nMake your own career choices; starting at the bottom and working your way up the ranks, or stick with your favourite team and lead them to glory. Impress other teams by beating legendary drivers such as Schumacher, Hamilton, Button and Alonso. Interact with the media to raise your profile and press your point home, then negotiate contracts with new teams via your Agent.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":15074,"name":"Pixel Puzzles 2: Birds","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cb/0cb3271f5cd657e3fad74db92e6a3463.jpg","description":"Featuring some truly fowl images indeed. Pixel Puzzles 2: Birds is a traditional style jigsaw puzzle game, with crabs scurrying around so WATCH YOUR FINGERS!!!\nThe Pixel Puzzles series has been treated to a complete rebuild from the ground up, resulting in Pixel Puzzles 2 being a much smoother more refined gaming experience.\nSo, what to do about those pesky crabs?  Rather than giving them a squish, throw them in a cage. Collect and consume your little shelled friends to gain special puzzle solving abilities, with the crab grabbing power up system. Go catch them critters, they’re hiding under the pieces!Features:25 puzzles in a range of sizes from 60 to 350 pieces.\nAuto saving, never lose your progress.\nRelaxing atmosphere.\nTraditional puzzle gameplay.\n33 Steam Achievements.\nPuzzle piece rotation.\nInteractive play environment.\nBeautiful photos of birds, taken in the south atlantic.\nPower ups to help solve puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Decaying Logic","platforms":[{"id":0,"name":"PC"}]}]