[{"id":274827,"name":"Out of Reach: Treasure Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ae/8ae57a59d22ee7d7152f2acd7f6cd004.jpg","description":"Fast-paced pirate battlesGather a crew, create your emblem and start a rebellious career of a pirate who cares only about his treasures and his rum! Sail the seas, look for trouble, be the last pirate standing to retrieve all the treasures the archipelago can give you! Although you may not survive every single raid, your achievements, fame and glory will!Early / mid / late-game in different environmentsOn the sea\nChoose which kind of a ship serves your needs best and take your crew or go alone for a ride across the archipelago. Bomb, ram or board enemy vessels and take control over the islands!\nIn the forests\nFind your favorite rum and necessary equipment inside the shipwrecks, abandoned villages and forsaken ruins to outstrip opponents and increase chances of surviving in the next battles!\nInside the caves\nMoor your ship in a pirate hideout and use maps to collect treasures before others lay their filthy hands on them. Complete objectives, get to the extraction point and protect your precious chests until it's safe to sail away with the bounty!\nFree-roam and Objectives blendAlthough every pirate has his own paths, he is always on the hunt led by his greed. Treasure Royale is no different, you are welcome to use your very own strategy and a winning idea, but also have to be sure that your paths will collide with your enemies as much as possible. The gameplay system is so designed as to give you best of random loot placement and adaptive objectives. Together with a dynamically adjusted map for the given amount of players and weather affected sailing, the raids will always stay challenging, keep you in the eye of the storm and the pace as high as possible.VesselsSet your crew's sails, add equipment, do the paint job but don't forget to choose the proper ship class for your raid plan. Pirates need to take into account several variables before sailing into a battleground such as map size, islands placement, weather, personal crew style. Galleon-size ship that's perfect for a tight crew might not be the best idea for a lonewolf.Weaponry Enjoy variety of firearms to find and upgrades to attach, starting from a flintlock pistols and 4 barrel revolvers all the way up to revolving rifles and hand cannons - everything that properly prepared pirate would need to deal with opponents and still find fun in it. Those who need bigger calibers should invest in cannons and mortars to mount on their ships. Or steal one.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Space Boat Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21596,"name":"Carmageddon Max Pack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e5/8e5c282e63fae6fab80903e15341a6e8.jpg","description":"Carmageddon is the original freeform driving sensation, where pedestrians (and cows!) equal points, and your opponents are a bunch of crazies in a twisted mix of automotive killing machines. The game features anarchic drive-wherever-you-like gameplay and over-the-top surreal comedy violence. It’s the racing game where racing is for wimps.\nNow the same Mac & PC classic that was BANNED AROUND THE WORLD is back!\nCarmageddon features real-world environments that have been turned into killing fields, where the locals stay out on the streets at their peril. As well as using your car as a weapon, every level is sprinkled generously with power-ups that have a vast variety of mad effects, adding a whole extra level of craziness to the proceedings. In every event you have the option to “play it your way”… Waste all your opponents, kill every pedestrian, or (perish the thought) complete all the laps. Oh and watch out – the cops in their super-tough armoured patrol vehicles are lurking, and if they catch you being bad they’ll be down on you like several tons of cold pork.\n\"Ladies and gentlemen, start your engines! Members of the public, you have ONE minute to reach minimum safe distance!\"\nCrazy range of vehicles and drivers, each with their own personality and driving style.\nThe game that pioneered true 3D physics,\nThe game that pioneered dynamic vehicle damage\nThe game that pioneered splattering grannies. And cows.\nIn fact, splatter a wide range of seriously scared pedestrians.\n28 dangerously deranged Opponents\n11 wildly exhilarating Environments\nCareer Mode featuring 36 satisfyingly violent Levels\nRace and Wreck opponents to unlock 30 playable cars!\nOver 40 fun-packed Power Ups and “Power Downs”.\nGreat open world track design allowing complete freedom to explore.\nHidden bonus areas to find.\nLudicrously satisfying, arcade-style gameplay.\nThe aim is for the player to work their way up the ranking system, from 99th place to first. The player vehicle is pitted against a number of computer controlled competitors, in locations such as cities, mines and desert towns. Levels can be beaten in one of three ways:\nCompleting all the laps of the race course, as one would a normal racing game.\n\"Wasting\" (wrecking) all the opponents vehicles.\nKilling all the pedestrians in the area.\nEach level has a time limit, but more time may be gained by passing through checkpoints, collecting powerups, damaging/destroying the competitors' cars, and by running over pedestrians (with bonuses awarded for style).\nThese actions also reward the player with Credits, which can be used to make instant repairs or recover the car (after falling down a chasm, for example). They can also be used to upgrade Armour, Power and Offense stats in the Parts Shop between races. This is also the time to switch which car to drive if others have been obtained.\nAs well as opponents partaking in the 'race', some levels also contain a number of heavily armored Cop Cars, which will activate their sirens and hound the player when provoked. They can be attacked and destroyed, but do not count as opponents. A single \"Super Squad Car\" exists in one level, and it can be claimed if destroyed.\nAn Action Replay with multiple camera viewpoints is available at any point during a race.\nCarmageddon won the “Game of the Year” trophy in the 1997 PC Zone Reader awards.\nCarmageddon 1 & 2 were “Driving Game of the Year” 1997/1998.\nSELECTED REVIEWS OF THE ORIGINAL GAME\nOriginally released for the PC in 1997, Carmageddon was an instant hit and the titles went on to sell over 2 million copies worldwide. Here’s what a sample of the gaming press thought at the time:\n“Carmageddon is visceral, violent, vehicular fun...” - GameSpot 8.8 out of 10\n“Carmageddon, to get straight to the point, is one of the best computer games I've ever played… Carmageddon is God!” - Duncan McDonald 95% Classic Award PC Zone Magazine\n“Carmageddon is one of those games that only come along once in a blue moon. An essential purchase.” - Escape Magazine 6 out of 6\n“The gameplay is spot on and anyone with a dark enough sense of humour should give it a go.” - Computer Gaming World 4 out of 5\n“So next time you gun down coppers on GTA VI, just remember, Carmageddon’s controversy was there first, and you have a lot to thank it for.” - RetroGarden\nCarmageddon is the first of a series of graphically violent driving-oriented video games. It was conceived and developed by Stainless Games, published by SCi and released June 30, 1997 on PC & Mac.\nIt was, and remains, a poster child for video game controversy. The controversy surrounded the game's central premise; that of earning reward for running down innocent pedestrians.\nThe game was notable for its realistic and ground-breaking physics, and for its in-game action replay features. It was also one of the earliest examples of a sandbox 3D driving game, and may have influenced other later games including the Driver and Grand Theft Auto series.\nABOUT STAINLESS GAMES\nStainless was founded in 1994 by Patrick Buckland, a veteran of the games industry going back to the Jurassic period of 1982, and Neil Barnden, who used to have hair like a mammoth. A team of 8 worked on the original Carmageddon at Stainless, and 5 are still with the company today, although a couple of them are now kept manacled in a small padded room in the cellar.\nStainless Games now employs around one hundred mad, dedicated people of assorted gender, height and width. They can all be found dangling precariously from a small chalky rock just off the South Coast of England.\nhttp://www.carmageddon.com/bugger\nhttp://www.carmageddon.com","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Stainless Games","platforms":[{"id":0,"name":"PC"}]},{"id":21488,"name":"Parkan 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e19/e19dd3f66e2adb39f4fb4bf96ead2132.jpg","description":"Parkan II is an original concept game that will allow you to feel as a pilot of a spacecraft lost somewhere in the universe. The players are to explore hundreds of solar systems, take part in a series of fierce battles and meet a new enemy - a mysterious creature calling itself Gegemaunt. Become a pirate or mercenary, get money to buy the most powerful cruiser and show them all who is to be the new master of the galaxy. Unforgettable adventures in the Parkan II universe await you!Key features:Explore the awe-inspiring galaxy which evolves as you progress\nUnique mix of several genres: action, RPG, strategy and space simulator\nHuge game universe: more than 500 solar systems available for exploration\nThe player can choose any type of gameplay strategy, become a colonizer, pirate, trader or mercenary\nMultiple diverse ways to modernize the spacecraft and battle suit\nWide freedom of action: battle in space and board enemy ships, explore planets, capture enemy bases and conquer solar system","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Nikita","platforms":[{"id":0,"name":"PC"}]},{"id":19794,"name":"Coin Crypt","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10a/10a877c9605ab1f21721b8299e3b4b1a.jpg","description":"A roguelite deckbuilding adventure game about magical coins. You play as a lootmancer, who can unlock the hidden power inside of coins and use them in magical duels. The loots you take from chests and enemies also become your next moves, so plan carefully!FeaturesRoguelike structure: randomly generated levels and permanent death!\n19 unlockable character classes with unique gameplay!\nOne of those classes is a monkey! (!!!!!)\nConstant, delicious tension: you always need to spend coins to get more coins\nA grandma that packs a whollop!\nSECRETS! (duh)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dumb and Fat Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18744,"name":"Desperados 2: Cooper's Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fb/0fb39b0e0366910f2e4f2b73be6a9649.jpg","description":"Desperados 2 is the sequel to the successful wild west title Desperados - Wanted Dead or Alive. The gameplay is based on its predecessor but with brand new tactical possibilities in a beautiful 3D environment. Switch from an isometric view to a third person view whenever you want; for example, for duels, brawls and shoot-outs. The great variety of settings includes dusty canyons, ghost towns, American Indian villages and forts, creating a breathtaking atmosphere. Take on the role of up to six heroes, including the famous bounty hunter John Cooper, and experience  a thrilling story with surprising turns.\nReal-time-strategy and tactics in an exciting story and a thrilling Western atmosphere\nVaried settings including towns, American Indian villages, dusty canyons, forts, wagon convoys and ghost towns\nDouble 3D view: pivotable isometric view and 3rd person view for fights and very close action\nSeveral levels of difficulty and a new A.I. with more tactical opponent behaviour and more interaction with allies\nSix individual actions per hero and overall 20 new actions, such as swimming, sedative injection and handcuffs\nA new hero: Hawkeyes, the American Indian\nFive actions per hero planable in advance with headword overview (Quick Actions)\nMore interaction with the environment due to full 3D interior views of buildings and movements like climbing, sneaking, jumping and hiding","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Spellbound Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13248,"name":"Planes, Bullets and Vodka","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/458/4580f717c4d888171124678986a27544.jpg","description":"Planes, Bullets and Vodka, is a retro infinite shmup with randomly generated elements. Grab your manche with your right hand, your vodka with your left hand and kill everything in front of you!FEATURES\nRetro visual\nGreat to play both with controller and keyboard;\nLeaderboards;\n8 Types of enemies;\nPower-Ups;\nRandomly generated paths;\n10 Awesome Tracks\nFree MP3 Soundtrack\nTrading cards\nAchievements","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NukGames","platforms":[{"id":0,"name":"PC"}]},{"id":5654,"name":"Skate 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/798/798d76fbe71fb0a39784a7126de9e00b.jpg","description":"The Skate revolution continues!  Skate 2 ups the ante in delivering all the grit, creativity, and culture of skateboarding - both on and off the board.  Grab your board and get ready to skate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2524,"name":"ARCADE GAME SERIES: DIG DUG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef2/ef244c1bdc250dc5c82c56846675b90b.jpg","description":"First appearing in arcades in 1982, Dig Dug finally comes to Steam!\nDig up, down, left, and right and burrow through the earth.\nInflate and pop enemies with your harpoon to defeat them, or squish them with a rock.\nLure enemies into a tunnel and crush several at once for massive points.\nDefeat all the enemies on the screen to advance to the next stage!\nPerform a range of techniques, including the rock drop and the \"pump and stall,\" using just 4 directions and a single button! The original and best \"underground smash hit!\"\nWith cute pixel-art graphics, vivid colors, rhythmical beats, and distinctive SFX, the beauty really is in the details.\nThis latest port comes with scanline and sound settings, and the option to switch between the old and new versions - perfect for devoted diggers!\nEnjoy the masterpiece that fervent fans have flocked to play!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":304921,"name":"Sniper Elite V2 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f4f/f4f805c0067da96974182f3cf244c818.jpg","description":"You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans’ final stand.\nYour mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.\nStealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.\nAll new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy’s body.\nWith all DLC missions included, take the fate of the war into your own hands, and hunt the Führer himself.\nNew Features included in this Remaster…\nAll DLC Included – Experience the infamous “ASSASSINATE THE FÜHRER” mission. Take the fight to new fronts in three new campaign levels. Hunt your foes with a variety of iconic weapons including the Lee Enfield MK III, M1D Garrand, M1 Carbine and more.\nPhoto Mode  – Pause and step through the action frame-by-frame, position the camera, apply a filter, adjust the lighting and take stunning photos to share with the community. Including your epic X-Ray kill camera shots.\nRemastered Visuals - Modernised renderer and post processing effects, enhanced level geometry, textures and particles, plus a revamped lighting system, and 4K support transports you to the front line.\nNew Playable Characters – For the first time, play the campaign and multiplayer modes as one of 7 new characters from Rebellion’s Zombie Army series.\nMultiplayer & Co-op – Gather your squad and compete in 7 uniquely tense multiplayer modes, now for up to 16 players online*. Including Deathmatch, Distance King, Dogtag Harvest and Capture the Flag.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Rebellion","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":40344,"name":"Alien Shooter 2: Conscription","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/607/60737120938021f3217b4c5508dfa949.jpg","description":"Alien Shooter 2 - Conscription is the continuation of cult Alien Shooter 2, which is a unique blend of two game genres - Action and RPG.\nThe Great War has begun! The world population capable of functioning is mobilized to serve in the army. Hordes of monsters are destroying the cities and capturing new territories. The situation on the battlefront reached the critical emergency point and there's nobody to help. Try to fight with the aliens as a private soldier from the regular army, which happens to be in the center of the action. The outcome depends on you!Key features Huge crowds of enemies, more than 100 aliens on one map at a time.\nAbility to upgrade the main character's parameters.\nMore than 60 weapon types, including sniper rifles.\nLots of auxiliary devices, including radar and battle drones.\nSeveral types of vehicles to drive.\nThree game types: Campaign, Survive, Gun Stand.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":34947,"name":"The Godfather: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/826/82651419404a468b4aade80ba9f73e3b.jpg","description":"The Godfather puts you into the action of the legendary films. After a life of small-time jobs and petty thefts, you are accepted into the Corleone family.\r\n\r\nGAME FEATURES\r\n\r\nControl New York\r\nJoin the Corleone Family in the battle to rule the city and exert power over the other NY families: Stracci, Tattaglia, Cuneo, and Barzini. How you go about gaining power—through negotiation, intimidation, or a strategic mix …\r\n\r\nDo It Your Way\r\n\r\nThe non-linear action adventure gameplay features original missions as well as missions directly from the film. Whether you tackle the main missions, take on side jobs, or explore the open environment, there’s an experience f…\r\nEnter the World of The Godfather\r\nCreate your own mobster and climb your way to power in the Corleone Family. Along the way you will interact with characters and intersect scenes from the classic movie.\r\n\r\nPressure Point Targeting\r\n\r\nA dead man can’t talk. Pressure point targeting lets you get a less-than-lethal lock on parts of an opponent’s body so he’s still around to give you the information you need.\r\nRespect and Consequences\r\nUse your powers of loyalty and fear to earn respect throughout New York City.Respect could be one of the most important weapons in your war for the underworld.\r\n\r\nWield the Power of the BlackHand\r\n\r\nThe power of intimidation is in your hands. Use the BlackHand Control combat system to execute punches, kicks, grabs, and even strangleholds.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Electronic Arts Redwood Shores","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":20133,"name":"Eterium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c5/1c5c9b9f3c1685507e540b55aaa211d2.jpg","description":"Eterium is a space flight sim in the spirit of 90's games like Wing Commander and X-Wing. Developed by a two-man team, Eterium aims to bring the classic style of space combat games into the modern era. You play as a pilot serving aboard United Earth Alliance carrier Canopus during a war against an vicious alien race known as the Revi. Experience story-driven gameplay, advanced artificial intelligence, procedural missions and intense 3D space combat as you battle your way through over 50 missions of action-packed gameplay.\nGameplay Features:\nFully customizable joystick\nXbox 360 Controller and Mouse Support\nOutstanding stereo 3D support (nVidia 3d Vision only)\nAdvanced Artificial Intelligence\nDynamic Difficulty\nAdvanced ship damage system\nFully 3D rendered cockpits\nAsteroid and mine fields","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rogue Earth","platforms":[{"id":0,"name":"PC"}]},{"id":15392,"name":"Big Pharma","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d17/d17f36766169e88907e787e41b7650c4.jpg","description":"What if you had it in your power to rid the world of disease, to improve the lives of millions, to ease suffering and cure the sick… and earn a tidy profit?\nAs the head of your own Pharmaceutical Conglomerate you have this power resting in your hands. Will you use it for good? Being totally altruistic may not be the best business plan. The uncomfortable truth (is there an ointment for that?) is that some remedies are more profitable than others and illness is good for business.\nWelcome to the world of Big Pharma!\nFrom humble beginnings\nwith a few rusty reconditioned machines, you can progress from knocking out cheap generic treatments for minor ailments, to discovering new active ingredients and hi-tech machines to help refine the next generation of world-changing drugs.But watch out,\nyou’re not alone out there. Rival corporations that want to put you out of business have their own set of competing cures and treatments.\nThen there’s the dynamically shifting marketplace which means that your fancy cold and flu medicine from last winter might not sell so well now it’s the height of summer. Where did I put my anti-wrinkle sun cream?Big Pharma\nis part business sim, part logistics puzzle. It’s one thing to work away in the lab perfecting new formulas, but converting the ‘sciency stuff’ into cold hard cash means bringing an engineering and business mind to the problem.\nFactory space is expensive, and those fancy new agglomerators and centrifuges don’t always slot nicely together.Features: 35 business-busting challenges spread out across 7 unique scenarios\nCustom game mode\nFreebuild mode\nModding support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Twice Circled","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":681398,"name":"Farming Simulator 22","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd9/dd90964966f6bf9b0bd635be432fbf8a.jpg","description":"Take on the role of a modern farmer and creatively build your farm in three diverse American and European environments. Farming Simulator 22 offers a huge variety of farming operations focusing on agriculture, animal husbandry and forestry - now with the exciting addition of seasonal cycles!\r\n\r\nMore than 400 machines and tools from over 100 real agricultural brands like John Deere, CLAAS, Case IH, New Holland, Fendt, Massey Ferguson, Valtra and many more are included to sow and harvest crops like wheat, corn, potatoes and cotton. New machine categories and crops will add new gameplay mechanics to the experience.\r\n\r\nEven run your farm cooperatively in multiplayer and extend the game by a multitude of free community-created modifications. Farming Simulator 22 offers more player freedom than ever before and challenges you to become a successful farmer - so start farming and let the good times grow!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Giants Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":576408,"name":"Machinika Museum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff8/ff83d8f6c0224ad080c1c5c77934a43d.jpg","description":"Whishlist now!\nA mysterious puzzle game...Machinika Museum invites you to discover and solve puzzles rich in mystery! An original adventure combining hidden objects and an intriguing story inspired by the excellent old school puzzle game Myst and the more recent The Room and The House of Da Vinci.\nIn a distant future, finding machines from alien civilizations is not unusual, especially in a museum dedicated to them. Your job is to receive these devices and to understand how to repair them.\nBut this time, something is different. You have not been given any information and this seems to be rather urgent... What are these machines? Who sent them? Why won't anyone give you any answers? You will have to find for yourself which secrets and stories are hidden behind these mechanisms.Key features:Mind-bending Puzzles: use your sharp logic skills and your sense of observation\nMysterious sci-fi atmosphere and story: there is so much you don't know yet...\nWonderful visuals, cryptic alien machines have never looked better\nIntuitive and enjoyable controls. Why make it complicated?\n2 to 4 hours of gameplay and mystery","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":241056,"name":"Dark Deception","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e39/e39651e5a9faf0b545b551e19e6d5845.jpg","description":"Dark Deception is a story driven first-person horror action maze game, created from a collaborative indie effort between DD's original creator and the creator of TJOC: Story Mode.\nDark Deception mixes the fast-paced style of classic arcade games with fun horror game design. Trapped in a dark world full of nightmarish mazes and ridiculous monsters, the only way out is to face the darkness and find a way to survive.\nThis is the first chapter in the Dark Deception story. Investigate and survive the first maze. Be careful though. You are not alone. There are monsters in there and they are looking for you. You will face your fears. The question is - what are you afraid of?\nFeatures:\nFast-paced Arcade Horror: No hiding in lockers here. Run for your life and run fast. Enemies can be stunned and avoided, but not killed.\nPower System: Earn XP and unlock powers as you progress that will allow you to even the odds and survive longer against horrendous creatures.\nHigh Quality: AAA-quality graphics and creative designs give players a variety of unique and terrifying worlds and enemies to survive.\nHazardous Environments: Enemies are not the only danger. The mazes themselves are full of traps, hazards, and other dangers to watch out for.\nUnique Enemies: Every nightmare presents a unique creature that has its own distinct AI. Players will have to change up their tactics in order to survive.\nDark Humor: While scary, Dark Deception is not a bloody or gory game and features it's own stylized brand of dark humor. Dark Deception was designed to be enjoyed by everyone.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Glowstick Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":17293,"name":"Scourge: Outbreak","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ba/4ba54a14a9cf2c076a53965a9198eeac.jpg","description":"The year is 2026 and the world is ruled from the shadows by the power-hungry Nogari Corporation, the creators of a powerful new energy source called 'Ambrosia'. Unknown to the world's population, Ambrosia is the product of research conducted on a mysterious meteorite fragment in Nogari's possession; something which they will do anything to protect. Only one organisation dares to defy and challenge Nogari Corporation: The Tarn Initiative - an anonymous group of anti-corporate saboteurs intent on revealing the truth behind Ambrosia and breaking Nogari's iron grip on the world.\n\"Scourge: Outbreak\" puts you in the boots of Echo Squad, an elite group of mercenaries hired by The Tarn Initiative to deal a decisive blow against Nogari. While other Tarn Squads have been tasked with diversionary attacks, Echo's objective is the most important: First, to locate and rescue Dr Reisbeck, Tarn's double-agent inside Nogari; Second, to recover a piece of the meteorite fragment being kept deep within Nogari's laboratories. Utilize a devastating array of weapons and special abilities to crush everything that stands in your way, as you fight to discover the sinister truth behind Nogari's \"Ambrosia\" fuel technology.\nFeatures a Co-op enabled Campaign for up to 4 Players, with full jump-in/jump-out support for easily joining sessions in progress. Experience flashbacks that only YOUR character sees, and figure out how they fit together with what your friends see!\nAll XP and Gameplay Perks earned in the Campaign stay with you in the 8-Player Multiplayer modes, where Scourge: Outbreak's fast-paced style of Deathmatch, Team Deathmatch and Capture-The-Flag rewards quick reflexes, itchy trigger fingers and constant movement! 5 death-filled multiplayer maps await you, offering the chance to continue the carnage between Echo Squad and Nogari Security Forces as they fight for supremacy of Nogari Island!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Tragnarion Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11188,"name":"Tap Adventure: Time Travel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc8/fc82f65f74dfe2513b7992a9d0ce2f2a.jpg","description":"Special Offerhttp://store.steampowered.com/app/620381/Tap_Adventure_Time_Travel__Travelers_Pack/\nBuzzhttp://store.steampowered.com/app/575720\nAbout the GameTap Adventure: Time Travel is an RPG clicker game in authentic Patch World. A team of heroes starts their journey through thick forests, spooky swamps, dense jungle, gold mines, timeless glaciers, and lifeless wasteland.\nThis journey will not be easy because the marshes and swamps are inhabited by evil goblins and ogres; vicious predators and wild brownies hide in the forests, and bloodthirsty tribes of natives and baboons fill the jungle. Local inhabitants don't like intruders: the only way to get past is to fight them!\n7 basic character classes, each with unique skills and choices in leveling\nUnlike other clicker games, you haven't a lot of heroes, you can hire only 7 of them, one for each type: Warrior, Archer, Wise Man, Rogue, Savage, Magician and Engineer. And all of them have their own skill set, that makes them unique. You can develop heroes in the different ways, more suitable for your playstyle.\n30 epic bosses and a myriad of monsters\nHuge epic bosses, overlords of their dominions, will stand against your heroes! They are much tougher than common enemies. But you can get nice reward, if you will be able to beat them: chests, that allow you to upgrade your heroes, runestones to craft mighty artifacts, manacoins to spend them on Mimics...\n9 diverse colorful worlds\nLively jungle, wild forest, spooky swamp, grim graveyard, dark mines, cold ice mountains, majestic city, deadly barrens and mysterious crossroads. Each of these beautiful locations has its own style and charm, their own inhabitants and bosses. Explore the lands of the Patch World!\nValuable rewards for defeating bosses, brilliant graphics and spectacular effects and a lot of gold, heaps of gold!\nAlso, you can make living Chest, meet the gambling machines of the Governor, exchange some goods for the manacoins and explore the magnificent Patch World!\nAlso you can check our other projects. Forge of Gods - highly addictive multiplayer card strategy RPG , chibi-style fancy card collectable RPG Mighty Party and exciting VR-shooter Cargo Cult: Shoot'n'Loot VR.\nPanoramik Inc. has been making games since 2005. We specialize in creating different types of games, ranging from casual ones up to mid core.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kongregate","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":52825,"name":"Crash Team Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8c/f8c6b111e074502aa8da71476885eec8.jpg","description":"It's a multi-player kart racing game starring your favorite bandicoot CRASH and a host of his friends...and foes! The stakes are high and the competition is fierce. Ready...Set...GO!!!","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation"}]},{"id":20972,"name":"Robowars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe9/fe99cd933213331df425f9162fa4f417.jpg","description":"In the near future, mankind has opened the way to the stars – made possible through the use of droids, able to operate in the hostile environment of the deep space. However, both spaceships and droids are dependent on ‘Neonium’ for their power.  However, this new source of energy was only found in the moons of Pluto and deposits are very limited, so the search started for a new supply.\nScouts ships discovered that a distant planet known as Praymos has rich deposits of Neonium.  The only trouble is Praymos is not only inhabited but has a technological civilization similar to that of Earth of the second half of 20th century.  The result was a battle not just for control of the resource, but the entire planet.GameplayRoboWars is easy to play yet difficult to master.  Each level has its own unique set of tactics – master the tactics and push on to victory!  Select your cards wisely – deploy them even more carefully. Build your defenses to prevent the capture of your flags by the enemy. Place your units or set your traps; earn the right special abilities. In between attacks, construct new defenses. Manage your supplies of Neonium well – the more you have, the more special abilities cards will be available.  The cards allow you to build battlefield towers, units and traps or to activate abilities. Build Neonium production plants for even more special ability cards. Destroyed enemy units will sometimes drop money, which can be used to buy units, traps, and attack cards.FeaturesMore than 50 types of units, towers, abilities and powerful bosses!\nStory-based campaign with 55 missions.\nCasual-hardcore game: easy to learn, hard to master.\nOld-school 80’s style sci-fi design\nEach level comes with bonus goals – complete to gain bonuses and improve your ratings.  Improve your ratings and get access to even more special ability cards and missions.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"N-Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":235,"name":"Shift Happens","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c2ca7679b364a63bf690647fcf35481.jpg","description":"The two jello jelly creatures Bismo and Plom got connected in a tragic yet funny accident and thus can exchange their size and abilities at will. Welcome to the world of Shift Happens - the only game out there which doesn't take a closer look at the body mass index and where players are actually forced to work togehter (and occasionally stab each other in the back).\nExperience thrilling adventures in four totally different worlds:\nExplore a freaked out laboratory where Bismo and Plom had their accident!\nUncover the secrets of the overgrown green forests...\n... and survive the dry canyons where a deadly wind awaits you...\n... just to prepare you for the bitingly cold caves!\nThe twist: Shift Happens is pure fun for solo players, yet its full potential can only be experienced together. Play it with your best friend while hanging around on a couch enjoying a pizza. Together you can solve puzzles and fight over precious coins. Coordination and communication are key to a successful journey. We recommend using gamepads for maximum enjoyability™.\nThe game also features a singleplayer mode with different level content. Although the game is primarily meant to be played by two people, you can play the completely different singleplayer levels without another person.\nThe game features all the good things you should expect from a co-op platformer:\nOver 40 levels of handcrafted fun\nLocal and online co-op gameplay\nExtra challenges/rewards in the levels for completionists and explorers\nMore than 30 different levels designed for the singleplayer mode\n8 unlockable bonuslevels (4 single- & 4 multiplayer)\nAchievements\nAnd timechallenges for each level","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":22969,"name":"Z: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/161/16143d340db4909bce42a371bf2b2b25.jpeg","description":"Fans of this classic strategy title are in for a real treat! Everything is in here from the terrific comedy cut scenes to the frantic game play, making this the definitive version of Z.\nUnder the command of General Zod, it is your job to take control of chain smoking, foul-mouthed, abusive, alcoholic robot-grunts, whose\nmain purpose is to battle it out on different planets of the universe. That is, if they're not currently crashing the ship they're on!\nAdvance through the landscape and take over abandoned factories and radar sites which will help you produce more vehicles and weapons to aid your army to victory. This is not a drill, soldier! Every decision counts, and if you screw up, you will be punished for it. General Zod is ready to rumble and makes no bones about it! Z is simply the fastest, funniest, most frantic, feature-packed action-strategy game you'll play this century!The classic Real Time Strategy Game by the Bitmap Brothers remade for PC.\nChallenging, fast, and furious gameplay that will keep you on your toes till the end of each mission!\nCommand six types of Robot soldiers each with their own individual personalities and armed with rifles, machine guns, and antitank missile launchers.\nTwenty challenging levels set on five planets each with a unique terrain ranging from Arctic waste to lands of fire and lava.\nLots of hardware for you and your soldiers to control, ranging from three types of tanks, jeeps, repair vehicles, and armoured personal carriers to field guns and missile launchers.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Kavcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"iOS"}]},{"id":12232,"name":"Barony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfb/cfb0716214f400cecb6dc988e1795ad9.jpg","description":"Barony is a 3D, first-person roguelike with cooperative multiplayer that brings back the cryptic and intricate designs of classic roguelikes such as Nethack and melds them with RPGs like Ultima Underworld, System Shock, and Daggerfall. Challenge is the calling card of this hard-boiled dungeon-crawler.Features\nGameplay inspired by RPG classics like Ultima Underworld, System Shock, & Daggerfall\nRoguelike mechanics such as perma-death, random dungeons, cryptic messages, and more\nMeticulously narrated action that mimics the insane events one could expect to find in games like Nethack\nA complex yet intuitive drag & drop interface to manage items and character stats\nCooperative multiplayer for up to 4 players over internet or LAN (includes Steam and direct-IP connections)\nHundreds of unique collectible items and loot, including several rare and mystical artifacts\nChock-full of secret areas, special levels, developer easter eggs, and more\nBundled level editor, exposed assets, and simple file formats for easy hacking, modding & tinkeringThe Story So Far\nBarony tells the story of an undead lich named Baron Herx, who terrorized the town of Hamlet in a previous life and is now holding out in a vast subterranean complex known as the Devil's Bastion. As a single hero or a group of adventurers, it is your mission to descend the depths of his abode, confront him in his hellish lair, and destroy him forever. Whether you will simply meet your doom in the dungeons as many have before you or rise to victory against the Baron and his hellspawn is ultimately up to you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Turning Wheel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3224,"name":"Kung Fury: Street Rage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/619/6198a76a54aa6d6e9c9a59899f94670e.jpg","description":"THE AWARD WINNING KUNG FU SAGA CONTINUES IN\n***** KUNG FURY: STREET RAGE – THE ARCADE STRIKES BACK *****\nTHE UPGRADED HT-3000 CARTRIDGE CONTAINS:\n*** NEW PLAYABLE CHARACTERS\n*** ULTIMATE BOSS FIGHTS IN AN EPIC STORY\n*** VOICES BY THE ORIGINAL MOVIE ACTORS\n*** AND ALL THE GOOD STUFF YOU LOVED IN THE FIRST GAME\nYEAH, IMMERSE YOURSELF LIKE NEVER BEFORE AS KUNG FURY AND HIS ALLIES ARE THROWN INTO A NEW ADVENTURE PACKED WITH STEREO MUSIC AND STATE OF THE ART TRUE COLOR GRAPHICS.\nCOMBINE THE UNIQUE COMBAT STYLES OF:\n*** BARBARIANNA\n*** HACKERMAN\n*** TRICERACOP\n*** AND OF COURSE KUNG FURY HIMSELF\nJOIN THE CHOSEN ONE AND HIS TEAM THROUGH VOICE-ACTED DIALOGUES IN THE ARCADE BEAT ‘EM UP FIGHT OF THE CENTURY\nBEAT THE NAZIS. BECOME THE ACTION! UPHOLD THE LAW!!!\nDISCLAIMER:\n*** STILL NOT ENOUGH NAZIS HARMED IN THE MAKING OF THIS GAME ***","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hello There","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":921,"name":"Sproggiwood","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c68/c68980e61e8b414a7a67b45ca976a705.jpeg","description":"Bring civilization to Sproggiwood, a story-driven, turn-based roguelike set in a humorous world inspired by Finnish mythology. Grow your civilization and plunder procedural dungeons with six unique classes. Outsmart mischievous monsters who work together in unexpected ways. No two dungeon dives are alike.StoryYou’re a simple farmer from the peaceful island of Clog. One moment, you're tending your grove -- the next, you’re lured through a mysterious portal by a talking sheep. Now you’re the prisoner of Sproggi, a mischievous forest spirit who's built a whole village just for you. You have a simple job: tame the wild creatures that roam the forests of Sproggi's realm...\nWatch Sproggi's plans go awry when you discover a rival civilization on the rise to greatness. Will you choose to befriend these curious Mushroom people and stand together, or will you crush them and claim Sproggiwood for your own? Seize the day and civilize Sproggiwood now!GameplaySproggiwood distills the roguelike genre down to its core fun ingredients: inspired character classes, loads of interesting loot, and procedurally populated dungeons with monsters and traps that combine to produce totally unique tactical challenges. In Sproggiwood, adventure sessions are compact and chock-full of interesting choices for you to make. Each dungeon dive follows the heroic rise of one adventurer from your civilization. Journey through teeming forests, haunted swamps, teetering cliffs, and glacial mazes to uncover your civilization's whole story.FeaturesA wondrous and humorous setting inspired by Finnish mythology\nBrain-churning tactical combat vs. an assortment of creative monsters and traps\nSix fully unique, customizable classes: simple farmer, brave warrior, merry archer, cunning thief, brainy wizard, and creepy vampire\nProcedural dungeons filled to the brim with scrolls, potions, swords, and staves\nTown decoration mode with buildings, trees, roads, and villagers","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Freehold Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":842395,"name":"Disney Dreamlight Valley","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2f7/2f77dc8fa62aa506e7a06887d3756c3f.jpg","description":"Disney Dreamlight Valley is a hybrid between a life-sim and an adventure game rich with quests, exploration, and engaging activities featuring Disney and Pixar friends, both old and new.\n\nOnce an idyllic land, Dreamlight Valley was a place where Disney and Pixar characters lived in harmony—until the Forgetting. Night Thorns grew across the land and severed the wonderful memories tied to this magical place. With nowhere else to go, the hopeless inhabitants of Dreamlight Valley retreated behind locked doors in the Dream Castle.\n\nNow it’s up to you to discover the stories of this world and bring the magic back to Dreamlight Valley!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":452640,"name":"Destruction AllStars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb3/cb3fa58805e186c72d7cde04f58370a6.jpg","description":"Dominate the glittering global phenomenon of Destruction AllStars – the spectacular prime-time sport for dangerous drivers!\n\nMaster the art of intense vehicle-based combat through timing, tactics and skills to cause colossal amounts of damage, destruction and devastation in vibrant arenas across the globe.\n\nPile-on the destruction from behind the wheel or leap into the arena with a breathtaking reel of parkour action by dodging attacks, taking over vehicles or using abilities to disrupt the onslaught of incoming vehicles.\n\nCause enough mayhem to power up your AllStars game-changing hero vehicle fuelled with special abilities.\n\nA roster of 16 blockbuster Destruction AllStars are revved up and ready to compete in the name of entertainment and demolition. So, strap in for intense, explosive and unpredictable levels of free-flowing action and fight to be crowned the Global Destruction Federation Champion.\n\nIt’s time to run, ram and slam. See you in the arena.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Lucid Games","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":52005,"name":"7 Billion Humans","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/60a/60a0b8f88184f25621b498c2ee1ebb05.jpg","description":"Automate swarms of office workers to solve puzzles inside your very own parallel computer made of people. A thrilling followup to the award winning Human Resource Machine. Now with more humans!\nFeaturesMore puzzles, more humans, more rippling brain muscles - over 60+ levels of programming puzzles!\nA whole new programming language to enjoy! Where Human Resource Machine was based on Assembly and executed by a single worker, 7 Billion Humans has an all new language that lots of workers can all execute at the same time.\nYou'll be taught everything you need to know. Even useless skills can be put to work!\nFrom the creators of Human Resource Machine, Little Inferno, and World of Goo.\nIncludes a new soundtrack by Kyle Gabler.\n\n\n7 Billion Humans will release in early 2018. Wishlist or follow to receive updates on its progress!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Tomorrow","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]},{"id":19617,"name":"Two Brothers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/001/0017e6ce83f53ea416f490fce0bb7dd9.jpg","description":"Two Brothers is an Action Adventure game that features a classic Gameboy aesthetic.\nRoy Guarder, inventor, scientist, and philosopher, is on an expedition to discover the origins of life. This quest has brought him to \"The Cursed Lands,\" a stretch of land so dangerous and shrouded in mystery that it hasn't been explored in over 700 years. When Roy finds what he's looking for, he is met with a terrible fate. Roy no longer finds himself a living man. He is greeted with a world of colors he never believed could have existed! One obsession leads to another and Roy begins to walk the line of life and death - sometimes intentionally ending his own life - just so he can see this land of beauty and color again.\nBut something is strange: Why is Roy the only man who can cross so easily between the worlds of the living and the dead? What has given him this unique ability? How will he reconcile the existence of an afterlife he never believed could even exist?\n▪ Explore a vast non-linear world and story with multiple endings, and deep side quests!\n▪ Take the game world from black and white 8bit to full color 16bit!\nWhat makes Two Brothers unique:\nTwo Brothers takes a long hard look at death in video games... when the player is killed in combat or triggers a deadly trap, instead of being greeted a familiar GAMEOVER screen, the player finds himself in what we call the \"Afterlife Hub\".\nThis realm of the dead is a colorful and mysterious place where the player can explore, find clues, and interact with characters who have passed on in the games story... sometimes even bringing some of them back from the dead.\nWhen the player wants to return to gameplay, they can jump from the edge of the heavens and get back in to the action and exploration!\nThis mechanic is vital to the gameplay, as sometimes interacting with the dead is just as important as interacting with the living... this feature often requires the player intentionally ending their session in a game over, just to cross over to the other side.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ackk Studios","platforms":[{"id":0,"name":"PC"}]},{"id":316855,"name":"Half-Life 2: Downfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/164/164d779b57110998e8033be05e86cf49.jpg","description":"<strong>ABOUT</strong><br/><br/>DownFall is a FREE Half-Life 2 single-player mod taking place in the White Forest surroundings.<br/>You're once more putting on the HEV suit as Gordon Freeman. Your mission is to recover a newly developed technology by the resistance, known as the \"citadel buster\", before the Combine manage to destroy it.<br/><br/><br/><strong>WHAT TO EXPECT?</strong><br/><br/>A high-quality Half-Life 2 mod,taking place in new locations while staying true to Valve's design. Chapter 1 is available now, it's short but sweet, with an average playtime of ~35 minutes.<br/><br/><br/><strong>THE FUTURE</strong><br/><br/>While the initial release is short, there's an additional 2 chapters coming in the future at an estimated lengh of 40 minutes each. There is no ETA when the next chapters will release.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desconocido","platforms":[]},{"id":23244,"name":"Neverout","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a0/9a0cf35d519d898fe0ca2619aa4f050b.jpg","description":"Neverout is a unique puzzle game with innovative mechanics and immersive, unsettling atmosphere. The game puts the player in a small, claustrophobic cube, that has only one way out. Will you survive?\nHTC Vive Required\nWith possibility to turn whole level around you have to watch out for obstacles like electric field or spiked pits. Teleports and movable blocks will certainly help you, but still - it all depends on your hard wits and fast decisions.Features:Make your way through dreadful puzzle maze in Virtual Reality!\nEnjoy over 60 challenging levels divided into 4 zones.\nSuited to your VR limits - immersive and comfort mode included\nTurn the world around! Play with fresh mechanics and find yourself standing on the floor, wall or the ceiling.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Gamedust","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9774,"name":"Games of Glory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db0/db0f77f80a0cc03d9a19694945e672ef.jpg","description":"Fight alongside your friends on PC and on PS4 in the epic intergalactic arenas of the Synarchy. Strategy, raw talent, practice, and teamwork will get you to the top - but can you stay there?\nSet in a Sci-fi universe, Games of Glory is a competitive, team-based, Free-to-Play arena game that puts Shooter mechanics into a top-down environment. Immerse yourself in the atmosphere of a true sports arena!\nPlay in fast-paced 4v4 or 3v3 matches with an arsenal of 50 non-character specific weapons including snipers, rifles, pistols, flamethrowers, rocket launchers and more.\nCreate your own Club, or join one that's recruiting. Invite your friends, upload custom logos, and rise through the ranks together as a unit.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lightbulb Crew","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":34791,"name":"Battlefield 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ceb/ceb57403489d1684dbb1d5235bddd7cf.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Digital Illusions","platforms":[{"id":0,"name":"PC"}]},{"id":17034,"name":"YOU DON'T KNOW JACK Vol. 1 XL","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be5/be5f678ba20afa0d2d7f26a85dfdab34.jpg","description":"The original PC sensation that started it all! We've brought it back in all its virginal glory!\nThe world was a much simpler place in 1995. The kids were listening to the grunge, the first test-tube gorilla was born at the Cincinnati Zoo, and a little trivia game called YOU DON’T KNOW JACK took the interactive CD-ROM trivia game show world by storm. Play now and relive that crazy, mixed-up time all over again!","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":11354,"name":"Guardians of Orion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/120/120539996c2cdaef469c594fc96b8e72.jpg","description":"Full Gamepad Support!\nAbout the Game[ GUARDIANS OF ORION EDITIONS ]There are currently three main ways to start playing Guardians of Orion:\n[ THE ULTIMATE SCI-FI RPG ]Guardians of Orion is a Sci-Fi MMORPG Shooter featuring Cooperative, Competitive, Social and Dog-fighting Gameplay!\n[ THE LORE ]Guardians of Orion takes place half a century from now and allows you to explore The New Solar System.  Rich with an unlimited and renewable clean energy source, Ion Crystals generated by the star of Rigel help power your Guardian using the most advanced technology and weaponry ever created.\nhttps://www.youtube.com/watch?v=VFopklaUqvg\n· EXPLORATIONTravel across multiple Planets & Moons with your friends!· SURVIVALFight against devastating enemies including ROBOTS & DINOSAURS in cooperative gameplay!· BATTLE YOUR FRIENDSA variety of competitive PvP modes with Kills granting store credits and experience!· PLAY YOUR WAY!Swap between First-Person, Third-Person and Top-Down perspectives at ANY time during Cooperative gameplay!\n· GATHER WITH YOUR FRIENDSSocialize in beautiful hubs including Space Command Centers, Elemental Moons, Complex Cave Systems and Sprawling Cities!· INVENTORYCollect Loot & Gear along your journeys!· CRAFTINGForge Resources into Gear and other items.\n· COMPLETE MISSIONSA variety of Side Objectives, Weekly Challenges and Daily Challenges to earn store credits, unlock loot crates and earn new gear!· STATISTICSTrack your accomplishments with detailed player statistics and overviews!· LEADERBOARDSCompete with others across a variety of ranks and skills!\n· CUSTOMIZATIONMillions of possibilities, including: Armors, Hats, Helmets, Weapon Skins, Shaders, Tracers, Effects, and more!· GIBS & GOREDecimate your enemies and experience over-the-top violence, gore and gibs! (Can be disabled via gameplay settings).· EXECUTIONS & FATALITIESTake the violence to another level with extreme finishing moves and fatalities!\n· LOCAL CO-OPWe will continue to add additional Local Co-Op experiences as ORION continues to grow and evolve!· PLAY or PAY!The majority of Trek Store items can either be bought outright or played for as a variety of in-game systems grant you store credits, including the resources you collect, all PvP kills and bonus missions, achievements, daily challenges, weekly challenges and more! Our store is cosmetic-focused with no pay-2-win!\n· COMPANIONSPets help assist you in collecting resources, items and gear! Acquire a PET and never be alone again.· WARGAMESBecome the best Pilot and challenge your friends and foes in a free-for-all dog-fighting game mode which rewards store credits and experience for a variety of gameplay and objectives!\n· LOADOUTSCustomize your Weapon Loadout per characters, including Primary Weapons, Secondary Weapons, Item Kit and Grenade Type!DevNoteWe fully fund all of our prototypes and early access versions of our games/products. ORION is scheduled for official release on December 20, 2016.  We use crowdfunding campaigns to grow these projects past our original ambitions and expectations through community feedback and interaction, the same as we did with our first title: 'ORION: Prelude'  We'd love to make our new game \"ORION\" even more massive so please spread the word! The more we receive the more we can support YOU!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Trek Industries","platforms":[{"id":0,"name":"PC"}]},{"id":3956,"name":"Alien Spidy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a5f/a5f4c95285b5304758086c1f931d9556.jpg","description":"Steam Big Picture\nAbout the GameAfter losing contact with his explorer friend Virgi, our fearless alien hero Spidy heads to Earth in his spacecraft to find her. While entering the Earth’s atmosphere, his spacecraft suddenly fails and starts to break up, causing Spidy to crash-land on the strange planet, with his craft scattered across forests, throughout ponds and in dark caves. Spidy finds himself alone on an alien world and faces the epic challenge of tracking down Virgi, battling strange new enemies and finding the missing pieces from his spacecraft in order to repair the damage and make their escape home.\nThe stage is set for the adventure of a lifetime as Spidy embarks on a perilous journey through a visually stunning 2D/3D world, where quick reflexes and fast-paced platform action create a fun and rewarding gameplay experience, which is easy to pick up, but challenging to master.Key features:A unique blend of fast paced physics based platform action and challenging puzzles\nA visually stunning, cartoon-styled animated world\nUse the analogue control to perform intuitive skill-based manouvres as Spidy swings from danger, shoots his web and avoids numerous pitfalls and enemies\nExplore three unique game environments with 69 diverse and challenging levels\nOvercome a huge range of enemies and fight epic boss battles\nAccessible for both casual and core gamers…it’s easy to pick up, but challenging to master\nUnlock over 300 collectibles and achievements\nReplay levels to earn higher scores and improve your leader board rankings","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2744,"name":"The Pirate: Caribbean Hunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fae/faec035e655b2f9edcab638114118066.jpeg","description":"Hail to the Captain!\nSail into the heart of the Caribbean in the Age of Piracy - the time of black flags and white skulls, blue waves and golden opportunities.\nHoist the Jolly Roger and grab the steering wheel to sail through battles and raids, ransoms and treasures, to become the Crimson King of the Antilles!\n- 20 classes of ships\n- unlimited fleet size\n- multiple ships control during the fights\n- ship to fort fights with heavy mortars\n- 5 types of ammo - cannon balls, chain bals, grapeshots bombs, doubles\n- special weapons: explosive barrels, burning oil, battering rams, pre-boarding attacks\n- 30 ship upgrades\n- character development, experience gaining and level ups\n- 20 captain skills - unlocking new game features and possibilities\n- realistic sailing model, distances and time passage\n- hundreds of islands and dozens of ports\n- day/night cycle\n- building construction and upgrades\n- multiple player held bases\n- unlimited number of sea battles of few types (merchants, smugglers, convoys, militatry, treasure galeon, pirate fight, escort)\n- story-driven campaign set in a living world full of people\n- reputation in 5 nations\n- compete with other players in multiplayer PvP and PvE modes","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Home Net Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":823690,"name":"Capcom Arcade 2nd Stadium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f29/f2901b67a4059f67e08c1034478f67df.jpg","description":"Play more of your favorite arcade hits from yesteryear.\nIncludes SONSON for free!\nCapcom is taking you back to the stadium with another collection of your favorite classic hits!\nCome see what's changed, and what's completely new, in Capcom Arcade 2nd Stadium!\nJust Like the Good Old Days\nFrom 3D-rendered arcade cabinets to scanline filters, there's everything you need to recreate that arcade atmosphere. Fully customizable display settings let you craft your own personal experience and truly relive the glory days of arcade gaming.\nBrand New Ways to Play\nWith gameplay rewind, speed adjustment, and the ability to save and load your game at any time, your old favorites will feel new all over again!\nEvery game has online leaderboard rankings, so you can see where you stack up against players all over the world!\nCapcom Arcade 2nd Stadium, where retro appeal meets cutting-edge features for a fresh take on Capcom's classics!\nPlay hard. Dominate the scoreboards.\nTrack your progress across each game, including play count, times cleared, and personal high scores! Beat your bests, or those of your friends--there's always something to shoot/strive for!\nIncluded Title\nSonSon\nPlayers: 1-2 Co-Op\nGenre: Shooting\nVersions: Japanese & English\nNote: Player numbers differ based on the game. Multiplayer gameplay is only available locally.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":51835,"name":"Dissidia: Final Fantasy NT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1c/d1c448d79106dfff5d2d93e689a3a868.jpg","description":"Choose from over 20 legendary FINAL FANTASY characters and battle in a unique 3vs3 arena. Call forth familiar summons like Ifrit, Shiva and Odin to dominate the opposing side or to turn the tide of the battle in each match in DISSIDIA® FINAL FANTASY® NT!\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nNetwork Players 2-6 - Full game requires PlayStation®Plus membership to access online multiplayer\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© KOEI TECMO GAMES/SQUARE ENIX CO., LTD. All Rights Reserved.\nCHARACTER DESIGN: TETSUYA NOMURA\nILLUSTRATION: ©2017 YOSHITAKA AMANO","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team NINJA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22439,"name":"International Snooker","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ee/2eef7f372172d67e8f403a388f1b2c44.jpg","description":"Quite possibly the most realistic Snooker game to come to any gaming platform, working closely with Michaela Tabb the world’s most famous Snooker and Pool referee Big Head Games have the ultimate cue sports simulation, with easy to pickup and play controls and months of gameplay as you fight through a pro player’s career.Features:Career mode, play a full year's calendar of events earning world ranking points. Reach world number one and win all 16 trophies.\nPractice mode, unlimited shots with no opponent.\nQuick Play, choose form any unlocked venue and play VS AI or VS human player in customisable games, no. of reds, no. of frames, shot clock, etc.\nMultiple Venues, 15 tournament venues, a Rileys club venue and the exclusive 147 VIP club (score a 147 break to qualify).\nTrophy cabinet, fill the cabinet with the 15 tournament trophies and the 147 cup.\nEquipment upgrades, earn the right to use better cues, better cues = better control and more power.  Auto Chalking.\nAchievements, earn achievements from simply pot the pink to score a century break.\nMultiplayer, play anyone, anywhere, anytime.\nReal time chat. During multiplayer matches a chat window allows for \"friendly\" banter.\nReplays, replay, pause, rewind, slow-mo any shot.\nAI speed controls, no more waiting, run the AI at up to 4 times normal speed and get back to the table quicker.\nFull Rule set, \"advanced\" rules such as play on and free ball.\nBalanced  AI, produces a smooth difficulty curve based on your skill, world ranking and your current match status.\nCustom built Physics engine, including spin options for swerve and back spin.\nReferee, voice over calling scores, fouls, player intro, etc. voiced by the world famous referee Michaela Tabb.\nRealistic crowd AI and ambience fx, reacting to the gameplay such as long shots and near misses.\nStats, a record of your progress and good and bad percentages, also used for multiplayer skill level balancing.\n8ball UK, 8ball US and 9ball pool modes","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kavcom","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]}]