[{"id":44312,"name":"Prisoner","genre":"Adventure","price":0.0,"description":"As Kurt Davis, a prisoner in a Japanese prisoner of war camp, finding basic means of survival is difficult.  As the days pass you are faced with horrors that many thought to be a myth.  Are they manifestations of your insanity or the supernatural coming after you?\nIn Prisoner the player will struggle to secure the basic means of survival, get to know the struggle of their fellow prisoners, and try to escape monsters that will chill them to the core.Features:\nDynamic Horror: The player will be faced with a new challenge each time the sun rises, and each time the sun sets.  No two days will be alike, and no two scares will be the same.\nDiverse enemies: Enemies and monsters that stem from traditional Japanese horror will challenge the player's skill and nerve throughout the game\nImmersive environment: As the player progresses through the game, the environment will progress with them, offering them new challenges, shelter from their fears, and terrifying new experiences","imageUrl":"https://media.rawg.io/media/screenshots/f2c/f2ca8681d70194f777662acb198f90a9.jpg","releaseYear":2017,"developer":"Polovey Alexander","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":39964,"name":"Ratchet & Clank: Size Matters","genre":"Action","price":0.0,"description":"While on a much needed vacation, Ratchet and Clank's rest and relaxation time is cut short as they're lured into a mysterious quest. Following the trail of a kidnapped girl, Ratchet and Clank rediscover a forgotten race of genius inventors known as the Technomites. They soon uncover a plot more dangerous than they could have imagined. Ratchet and Clank make their PSP debut, in Size Matters! With wireless multiplayer gaming, up to four players can connect for intense combat and head-to-head action","imageUrl":"https://media.rawg.io/media/games/21f/21f4c07ec7af6e54837cb28050af380d.jpg","releaseYear":2007,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"}]},{"id":29100,"name":"Outpost Kaloki X","genre":"Strategy","price":0.0,"description":"Single Player, HD (High Definition) Everyone loves galactic lemonade… which means big space bucks for you! But how are you going to supply power to your lemonade stand? Better build a solar windmill… But how will you pay for the windmill with no space dollars??? Outpost Kaloki X is the light-hearted space-station tycoon game filled with clever characters and wacky storylines, where it’s your job to keep the visiting aliens happy and rake in the cash! Play the Adventure Story, the War Story or any one of 11 different Scenarios. Chat with your patrons to find out what they really want… and to get hot tips on cool expansions. Complete lower-level expansions to unlock more advanced ones. Can you juggle the needs of your station, the desires of your clients and your own hopes for cash and glory? There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/d21/d214a993f579bee9ec80fab3f4fe5160.jpg","releaseYear":2010,"developer":"NinjaBee","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":27958,"name":"Advance Wars","genre":"Strategy","price":0.0,"description":"Orange Star's commanding officer has been accused of attacking other \r\n      countries, causing war to ensue. The battle lines have been drawn, and \r\n      an elite group of sly strategists is massing troops at the borders of \r\n      your homeland. In the face of invasion, you have been entrusted to play \r\n      as tactical adviser for the Orange Star Army. Command 18 different types \r\n      of ground, air and naval units if you hope to survive the coming wars. \r\n      Take caution of the terrain and weather as you lead your forces in 114 \r\n      maps of turn-based warfare.\r\n    This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","imageUrl":"https://media.rawg.io/media/games/bdf/bdfb7a864a840aa5ead6cbd58e786b26.jpg","releaseYear":2001,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Game Boy Advance"}]},{"id":23460,"name":"Sentience: The Android's Tale","genre":"Adventure","price":0.0,"description":"The Android's TaleAkritas. The last world on the ragged frontier.\nTwenty-five years after the People's Revolution, it's not uncommon for the few remaining androids to be consigned to isolated borderworlds such as this, far away from the core systems where anti-A.I. sentiment remains rife.\nLargely despised and mistrusted by the very people they were built to serve, these androids do not have an easy existence – especially not when such a world turns out to be far more dangerous than could ever have been predicted.\nCryptic trails. Mysterious occurrences. Abnormal behaviour from droids and humans alike.\nPerhaps there is more to this place than meets the eye. Perhaps this seemingly desolate planet holds many secrets just waiting to be unearthed …\nAbout the GameSentience: The Android's Tale is a choice-based narrative adventure game from the creator of The Deed series and the Space Pilgrim saga.\nPlay through a complex narrative which is influenced by your decisions. Freedom of choice does not come without consequence, for humans or robots. Will you be an obedient servant or plant the seeds of chaos?\nInteract with the forgotten pioneers, the twenty-four colonists stationed on the borderworld of Akritas. Get to know their various stories and backgrounds, obey their commands and earn their trust (or not, as the case may be).\nSee the world through the eyes of an android and encounter relevant questions about the future of artificial intelligence.\nAt least a dozen possible endings. Every major character may survive or perish during the game as a result of your choices and actions.\nUncover the mysteries of this desert planet on the edge of space and learn the true nature of your mission, all while reliving the days of good old-fashioned point-and-click adventure games.\nFeatures mouse, keyboard and controller support.","imageUrl":"https://media.rawg.io/media/screenshots/573/573f6403cf6de862ca5b886db8cf449a.jpg","releaseYear":2017,"developer":"Pilgrim Adventures","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21420,"name":"Towtruck Simulator 2015","genre":"Simulation","price":0.0,"description":"In this simulation, the player works as the owner a large car park, on which the towed vehicles will be parked. A huge armada of different towing vehicles is ready to go. The trucks are on the road to find illegally parked cars. For each order you earn money, as being towed might be very expensive for the owner. Most of the money could be earned by driving the truck independently and fulfill your hard job carefully.FeaturesHuge city with dozens of parking slots, streets and parks\nHard city traffic with traffic lights and hundreds of cars\nVarious Tow Trucks with crane and ramp\nSimulation of all hydraulic functions\n3 game modes\nRealistic sound effects and atmospheric music\nHigh score list for all game modes","imageUrl":"https://media.rawg.io/media/screenshots/cf5/cf53d43e95ca84b3cc9c1f015550da15.jpg","releaseYear":2014,"developer":"United Independent Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20306,"name":"Gunslingers","genre":"Strategy","price":0.0,"description":"A unique turn-based tactical game in a Space Western setting.\nDirect your mercenary in team PvP battles. Pick one of 5 classes and choose from a large assortment of armor, weapons, and equipment.\nThe more battles you fight, the cooler your mercenaries become, the faster they run, the better they shoot, and (most importantly) the more abilities they learn – abilities that can dramatically change the course of the battle. Use attribute points and carefully choose your equipment to match your mercenary to your unique playing style.\nPlay on your own and join random battles. Or, team up with your friends in a clan and take part in tournaments.key Game Features\nQuick turnbased gameplay. Each team's players take their turns simultaneously, resulting in a fast-paced game with tactical interaction between team members.\n5 player classes. Command up to 5 mercenaries, each with their own skills and abilities – their own strengths and weaknesses.\n2 modes of combat. In Skirmish mode, simply kill your enemies and protect your allies to gain victory. In Capture mode, you also need to capture and defend control points.\nClan tournaments. Every few days, tournaments are held to determine the strongest clan!More Info About A Mercs5 mercenary classes are available in the game: stormtrooper, scout, sniper, medic, and robot. Each merc has his or her own skills, weapon, and playing style.\nJohn the sniper, armed with a sniper rifle, deals immense damage to his target at a large distance. The sniper can also cover an ally who is under threat of being attacked.\nLira the scout, on the other hand, uses subterfuge and cunning. She's a scout and saboteur who can sneak up on the enemy's rear quickly and unnoticed, revealing the enemy's position to her allies and weakening and wounding him before nimbly hiding herself from his retribution. Her weapon is an SMG.\nNext is the robot Bobby, a universal battle machine with a tough metal hull and armed with a machine gun. Bobby has two modes: defensive mode, where he can cover allies with his powerful shield, and attacking mode, where he turns into a weapon of mass destruction.\nThe medic is an essential unit on the battlefield. Her name is Leto, and she's not afraid to take aim at her allies – with a syringe gun full of healing nanobots or a stimulator that can refill action points. An efficient medic can make a good team unstoppable!\nLast of all is the stormtrooper Greg. He is a tough guy armed with an assault rifle. His job is to break through the enemy's ranks, deal them damage, interfere with their activity, and all the while survive enemy attacks.\nYou can pick any merc to bring into battle and develop all of your mercs in parallel.","imageUrl":"https://media.rawg.io/media/screenshots/702/702f7e6ccae267e6063b373178b46121.jpg","releaseYear":2011,"developer":"webgames","libraryGames":null,"platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":19870,"name":"Ghoul Kid","genre":"Strategy","price":0.0,"description":"A mysterious old house lies at the end of the lane. No one knows when or why it was abandoned, only that it's been there since before the suburban housing development 5 years ago. Anyone unfortunate enough to cross its threshold is never seen again, leading to more than a bit of neighborhood gossip. A few brave souls begin to trickle in to uncover the mystery for themselves, oblivious of the fate that awaits them...\nPlay as Ghoul Kid, a mischievous ghost who possesses household objects to scare visitors to death. In this wave based game, Ghoul Kid cannot be seen by humans. Use your wits and abilities to manipulate household objects so you can scare people to death! Happy haunting!","imageUrl":"https://media.rawg.io/media/screenshots/fd6/fd60ac90f1f65c3cc42c01e4d35e1f8f.jpg","releaseYear":2016,"developer":"Specter Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19706,"name":"Z.I.O.N.","genre":"Action","price":0.0,"description":"Z.I.O.N. - First-person shooter in a post-apocalyptic setting, where  robotic creatures take over the planet, and agents Z.I.O.N. groups trying to save the world.\nYou have to fight with robots, both small and huge; hide from powerful energy emissions; kill the zombies in a underground; turn off the generators and save the world.\nAlso in the game, after the passage of the main campaign, available second game mode, which is called \"Derby\", in which you control a huge robot, and your goal - to destroy all the other robots.\nThe world Z.I.O.N. a lot of hiding places in which you can find as in-game items, such as a music player or a box with a thousand rounds of ammunition, and outside the game, such as steam- keys from the other games.\nFeatures:\nSlowing down time\nInvincibility 10 seconds\nExtras. Reality","imageUrl":"https://media.rawg.io/media/screenshots/d0c/d0cdfff34683df08433b2a519536c80e.jpg","releaseYear":2016,"developer":"VGstudio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19092,"name":"Rexodus: A VR Story Experience","genre":"Casual","price":0.0,"description":"Rexodus: A VR Story Experience is based on the Dark Horse Graphic Novel Rexodus. This is a VR narrative experience set in a universe where dinosaurs didn't go extinct, they left Earth. Those dinosaurs, utilizing their own advanced technology, are traversing the galaxy. Encounter new locations, characters, and dangerous enemies in Rexodus: A VR Story Experience!","imageUrl":"https://media.rawg.io/media/screenshots/57e/57e925be09eb2450c5bf77d4059a5341.jpg","releaseYear":2016,"developer":"Steelehouse VR Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19030,"name":"Big Thinkers Kindergarten","genre":"Casual","price":0.0,"description":"Big Thinkers! Kindergarten is the perfect learning supplement to your child's classroom experience. Ben and Becky Brightly's contagious wonder and ability to transform themselves into a variety of shapes and forms engage kids in a fun world of learning and discovery unlike any they have experienced before. Your little learners always feel successful as they collect oodles of SmartStars. All of their efforts and successes are rewarded on their way in the SuperStar of Smarts Challenge. Your children are in control as they laugh along while the Brightly twins bend and stretch to provide activities that help kids learn all the skills necessary for success in kindergarten.\nThe Brightly twins provide 16 fun new activities to help your kindergartner learn:\nFirst Letter Identification\nMeasurement and Estimation\nSequencing and Patterning\nSpelling and Phonics\nTime Telling\nAlphabet Skills\nReading and Sentences\nCounting and Computation\nGeography and Directions\nEnvironmental Science\nThinking Skills\nSpatial Perception\nArt Creativity\nMusic Creativity\nKids can do amazing things when they think big!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/93a/93a0ee0b1c4281af083a9f45ad6a1fe4.jpg","releaseYear":2015,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18580,"name":"The Divergent Series: Allegiant VR","genre":"Adventure","price":0.0,"description":"Venture into the world of The Divergent Series: Allegiant in this 10-minute immersive story that brings film characters to life in VR in an all new way. Join Tris, Four & Caleb (Shailene Woodley, Theo James, & Ansel Elgort), on a mission to prevent catastrophe and discover the true intentions of David and his Bureau of Genetic Welfare…\nThe Allegiant VR Experience was created as an experiment in VR storytelling. Interactivity is present, but limited.\nAs the first VR experience with three photo-real characters, acted and performance captured via participation from their real-life counter-parts, Lionsgate and Summit Entertainment is dedicated to creating novel virtual reality experiences featuring boundary-pushing elements, freely made available for home use.IMPORTANT: The Allegiant VR Experience requires a high-end computer to run. A 980ti graphics card or better is strongly recommended.\nFor more information: http://thedivergentseries.movie/vr\nSee the movie!: http://tickets.thedivergentseries.movie\nFrom Summit Entertainment - A Wevr immersive production TM & © 2016 Summit Entertainment, LLC. All Rights Reserved.\n--\n#Allegiant\nThe third installment of the blockbuster Divergent series franchise, ALLEGIANT takes Tris [Shailene Woodley] and Four [Theo James] into a new world, far more dangerous than ever before. After the earth-shattering revelations of INSURGENT, Tris must escape with Four and go beyond the wall enclosing Chicago. For the first time ever, they will leave the only city and family they have ever known in order to find a peaceful solution for their embroiled city. Once outside, old discoveries are quickly rendered meaningless with the revelation of shocking new truths. Tris and Four must quickly decide who they can trust as a ruthless battle ignites beyond the walls of Chicago which threatens all of humanity. In order to survive, Tris will be forced to make impossible choices about courage, allegiance, sacrifice and love.\n>>>","imageUrl":"https://media.rawg.io/media/screenshots/e74/e74c6ac800e97c70e0d49a9916f3d93f.jpg","releaseYear":2016,"developer":"Wevr","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18178,"name":"EM: Shader Attack","genre":"Indie","price":0.0,"description":"EM: Shader Attack is a hardcore arkanoid with colorful effects and unusual game elements. In this game you will play again and again!\nIn each new game you have to go through 10 different levels. Passage of the one level ordinary takes from 20 to 30 seconds. Passage of all levels takes less than 5 minutes. And most importantly, there is no likelihood that you will get tired of playing! And you know why?\nBecause, we have provided a high replayability due to the fact that every time when you start a new game, the game randomly drawn ten maps from the pool of maps. The game pool has more than 150 manually created maps. Every map has it’s own music theme and graphics!\nThe task is difficult, but doable. To pass each level you need to knock down at least half of all blocks. Some blocks will be open very powerful AOE bonuses. As soon as you catch the first bonus, no one can stop you!\nOne of the tasks in EM: Shader Attack is an accumulation of energy. If you can accumulate enough energy, then you can activate EM Mode. The game world in EM Mode is transformed, it becomes buoyant and frankly confusing. But here is reward. In this shader mode has an important advantage - you get a five-fold multiplication the power of all caught bonuses! Also, on every next level the ball will move a little faster ...and faster.\nDidn’t catch, passed the ball and lost all of you lifes? Don’t worry and begin a new game! EM: Shader Attack offer completely new levels and dizzying experience! Everytime!\nEach level in the game has been maded by hand (there are more than 150 maps);\nEach level has its own graphical and musical theme;\nYou can use boosters and bonuses to earn as many points as possible. Limitations? Only your ability;\nEM Mode will transform your game and will provide a truly huge amount of points. If you can handle it!","imageUrl":"https://media.rawg.io/media/screenshots/c65/c65a5c0091ee2ac4c45ddb40740f90c3.jpg","releaseYear":2016,"developer":"Life Jumb DT","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15210,"name":"Dinocide","genre":"Action","price":0.0,"description":"Dinocide is a classic NES inspired old-school single-player platformer in a prehistoric fantasy world. Dinocide tries to capture the drive and fun of that era and recreate it in a modern way!\nDescriptionThe protagonist has to save his love interest who was kidnapped by an evil and mysterious Dinosaur God. You are accompanied by your own tame Dinosaurs, who act as a mounts, brother in arms and a true friends. With their help, you can jump higher, run faster, swim, fly and do a lot more things that an ordinary primitive man would never be able to do by himself. To reach your goal, you will travel together through the lands inhabited by ancient creatures and unknown dangers.\nFeatures Dinosaur mounts make you faster, stronger and offer a variety of tactical abilities.\nNon-linear progression by different routes leads to varied ways to complete your journey.\nA multitude of different biomes to visit - deserts, jungles, forests, lava caves, oceans, ice plains and more!\nWeird creatures you've never seen before!\nUnique time/life mechanic. One bar shared for both: food meter and life of your character.\nFull controller & Steam Big Picture support.\nClassic action. Don't think. Don't feel. Just go. React. Kill. Jump. Eat. Ride. Like in the good old times! You are not here to watch a movie!\nSeveral game modes: Story Campaign, Speedrun, Boss Rush\nThe unmatched fun and drive of an 8-bit era game!","imageUrl":"https://media.rawg.io/media/screenshots/827/8275ffc19d21791d9ca1a24a0fcf0b79.jpg","releaseYear":2016,"developer":"AtomicTorch Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12380,"name":"Khan: Absolute Power","genre":"Action","price":0.0,"description":"Khan: Absolute Power is a MMORPG based on true 13th century historical events featuring Genghis Khan. One of the most popular features of the game is its unique party system. Unlike other MMORPGs where people can level up by themselves, Khan contains an elaborate partying system, which encourages people to make friends and form alliances within the game universe.\nFeatures\nGuilds and Guild Wars\nHunting Parties\nSiege Wars\nThousands of possible equipment combination\nItem enchantment upgrades\nand many special event opportunities to win valuable awards and items for the player's continued quests\nKhan: Absolute Power contains many exciting game play elements including:\nTPG (Training Point Growth System) Each character collects practice points, which are necessary in developing character growth. Agility, Wisdom, Mental power, Physical Strength, and character Charm can be grown and developed to trade in social and economic systems.\nFame System When battling in higher levels, the player will need to posses higher strengths and better game items in order to survive and win. These attributes can be achieved from the Fame System. Fame system points will be also be awarded to those who lead their parties to victory in Quests and Battles. With each Quest accomplishment, the player's reputation will be recorded in the reputation system as fame points. Fame points can be traded for better items and abilities.\nRTR (Real Time Ranking System) Characters are ranked in real time during game play. The player's character rank will help in determining his place and objective within the mission and quests in progress.\nEmotion Icon Chatting System (Instant Messenger) Khan's IM Chat system uses emotion icon with built in special icon emotion symbols including Hi, Salute, Hurray, ^^, -, -, and many others. The game also supports sentiment icons using expression keys.\nFree Flowing and unstructured PVP (Player vs. Player) System In PVP, players are able to build their levels and to gain experience. Khan's PVP system offers players with freedom to seek their own objectives without limiting players to any specific track.","imageUrl":"https://media.rawg.io/media/screenshots/043/043cc632222439def6a6fc8ed0f1b814.jpg","releaseYear":2016,"developer":"Mirinae","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11111,"name":"I am Weapon: Revival","genre":"Action","price":0.0,"description":"Have you ever faced your worst nightmare?\nWhat if you cannot wake up from it? What if you have no choice but to move on and see what’s behind it? Then you’d better arm yourself with a couple of big guns, stock up on ammo and show them all what a real nightmare is!\nYou along with the main character will delve into a strange and frightening world of horror, explore its distant corners, find out how you ended up here and, most importantly, how to get out of this hell. What can save you from this madness? Only your lost memories which you’ll have to put together piece by piece. Whatever’s living in this world is luring you inside. Those creatures who are meant to bring you joy and happiness will only cause death and suffering! The bloody bastards will do whatever it takes to make you stay... And they are not alone in this: it seems the world itself wants to crush and swallow you, with its traps and pitfalls everywhere... Will you dare to sneak inside? Then welcome... But mind you, whatever path you take, there’ll be no mercy!\nMain features:\n- Mysterious world full of dark secrets\n- Hordes of fiendish enemies\n- Wide range of opponents\n- Intriguing story\n- Big guns... Loads of ‘em!\n- Abilities, turrets, drones, swords and axes\n- Side quests to suit all tastes\n- Exciting battles\n- Full gamepad support","imageUrl":"https://media.rawg.io/media/screenshots/2fd/2fdee9666b0fe831e14adff33a916a63.jpg","releaseYear":2015,"developer":"Krealit","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10550,"name":"PresenZ","genre":"Desconocido","price":0.0,"description":"This is a preview version of the PresenZ Player.\nIt allows to look at still images and movies created in the PresenZ Volumetric Video format.INTRODUCTION:\nWith PresenZ the viewer can enjoy 6 degrees of freedom inside pre-computed images.\nThe viewer can move his head freely and look in any direction as long as he stays inside the \"zone of view\" which is  typically a 1 meter by 1 meter by half a meter cube.\nThe system allows to have multiple zones of view next to each other thus creating a room-scale experience. The Buddha demo Scene in the\" Demo Pack 1\"  illustrates that.INSTRUCTIONS:\nThe Demo Pack 1 and Cars DLC should download by default at installation time.\nMore content is available by downloading additional DLC. Be sure to read the descriptions, as some of them can be several GB.\nAfter the presenZ splash screen, depending on your initial position, you can be inside or outside the zone of view.\nIf you are outside the zone of view, the environment is grey and the zone of view is represented by a portal cube.\nYou can physically move to get your head inside the portal cube.  If it is unreachable or uncomfortable, the controls allows to reset the zone of view height to your current head position.CONTROLS:\nReset Zone of View hieght to your current position  :\nKeyboard: r\nXBox:Y\nVive: The button above the track pad.Switch to the Next Scene\nKeyboard: n\nXBox:A\nVive: Index triggerTrigger Full Screen Monitoring    :\nKeyboard: fACKNOWLEDGEMENTS\nWe would like to thanks FBFX for the photogrammetry capture of the soldier.","imageUrl":"https://media.rawg.io/media/screenshots/72d/72d85f872303c017bfc5b41e2778691a.jpg","releaseYear":2016,"developer":"Nozon","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10378,"name":"Dungeon Lords","genre":"RPG","price":0.0,"description":"The great wizard Galdryn of the Meadows has been vanquished by a deadly conspiracy within the Circle of Mages. His chief ally, Lord Davenmor, now struggles to save his kingdom from the dark forces of the conspiracy and the onslaught of Lord Barrowgrim’s army of marauders. But there is hope, for according to prophecy a Great Champion shall appear to challenge the evil invaders - the Realm awaits YOU to be this Champion!\nFEATURES STEAM Version:\nNow Supports Steam Multiplayer up to 8 Players with support of Steam Lobby\nAutomap Fog of War\nNew additional ActionBar added with 12 additional action slots using F1-F12 as hotkeys\nActionBar items can now be moved around in Inventory or Equipped and retain viability in the action bar\nRevised Difficulty Settings\nEnhanced Skill, Inventory and Spellbook Features\nRevised Spells, Consumables and usable Items\nFEATURES:\nCo-op story mode for up to 8 players and full single-player game experience\nNew Hero Classes, new and improved Class Skills, and new unique Class action abilities\nFull World and Character Re-mastering for enhanced gameplay experience\n50-70 hours gameplay time\nAll new intuitive Graphic User Interface and Action Bar system\nEnhanced Multiplayer features (includes Trading and Friendly Targeting for buffs and heals)\nDual Switchable Interface Modes (supports Hot-Key action play and Point&Click play)\nImproved Graphic & Visual Enhancements\nUpdated full hardware Screen Resolution support (16:10, 16:9, 1920x1080 etc.)\nNewly Re-Mastered Audio sounds and speech","imageUrl":"https://media.rawg.io/media/screenshots/1c8/1c8816575581ea0c5784e1697f6b1df7.jpg","releaseYear":2005,"developer":"Heuristic Park","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9642,"name":"Mini Ghost","genre":"Action","price":0.0,"description":"\"Mini Ghost\" is a mini metroidvania where the mini hero has to... well, reading can be rather boring, right? I'll best show you the introduction of the game with a mini comic:\nMINI FEATURES- MSX look and feel\n- 100 mini rooms + 4 mini bosses + 24 mini items to collect or buy in mini shops\n- Mini comics included\n- Around 2 mini hours of gameplay\n- Mini price!\n- Prequel of Ghost 1.0\n- Done by the mini creator of UnepicTROLL YOUR FRIENDSSteam friends are playing MiniGhost? Troll them!\nYou can watch them while they play, and you can shoot them stuff, make their enemies bolder, or place fake platforms.\nThere is no better way to laugh!MINI EDITORS\nBesides, the game includes three editors:\n- Level editor: create your own maps and share them on Steam Workshop\n- Character editor: create your own characters and share them on Steam Workshop\n- Tileset editor: give a new look to your map creating your own designs\nSPEEDRUNS\nThe game also includes a leaderboard for speedrunners","imageUrl":"https://media.rawg.io/media/screenshots/407/407849b32d7a004c3caeee4d27c7c23d.jpg","releaseYear":2017,"developer":"@unepic_fran","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9443,"name":"Brave Furries","genre":"Casual","price":0.0,"description":"The Furries Princess along with half of Furries Village has been kidnapped by the Evil Wizard. The remaining Furries have launched a rescue mission. After miles of walking they discover the Wizard's castle. Not knowing what to expect they enter and find themselves in the cellar. There is a strange seal on the cellar doors and there are boxes with runes all over the place. Having no better idea about what to do, the Furries open a box…\nHelp these hilariously cute creatures execute a rescue mission. You will need to explore the Evil Wizard's castle and solve his puzzles to succeed. Hours of mildly brain-teasing gameplay awaits!\n*Extremely easy gameplay rules\n*Very short puzzles\n*Cute and funny creatures\n*Mildly brain-teasing\n*Original gameplay\nThe Brave Furries is a simple story about cute and funny creatures that struggle with the Evil Wizard's puzzles. Puzzles rarely take more than 60 seconds to solve and are very simple to understand but are definitely original and addictive. The game is animated with amusing high quality graphics.\nAlso please check out Space Scrapper (our new game in Greenlight):\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=868920477","imageUrl":"https://media.rawg.io/media/screenshots/6d1/6d15be2b8c172521f945b404b910022e.jpg","releaseYear":2017,"developer":"Crazy Goat Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4970,"name":"Earthworm Jim HD","genre":"Action","price":0.0,"description":"The grooviest action classic is back and in full HD glory! Rediscover this cult adventure full of wild gameplay. Download the full game to join Jim on a wacky quest across the galaxy to rescue Princess What’s-Her-Name and defeat the insane Psy-Crow! Master Jim's far-out powers, use his body as a whip, bungee jump, throw cows, blast through rocket-speed levels and more! Explore a crazy universe offering wild gameplay and hilarious possibilities. Overcome mad baddies, including new enemies in never-before-seen levels. Get help from 1, 2 or 3 friends with the exclusive cooperative gameplay in multiplayer levels.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","imageUrl":"https://media.rawg.io/media/screenshots/dc3/dc37a9203555d8056c27da7fa90d0eb3.jpg","releaseYear":2010,"developer":"Gameloft","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":4619,"name":"The Impossible Game","genre":"Action","price":0.0,"description":"The super-addictive and very, very hard platform game finally arrives on Steam - it's quite possibly the world's hardest game!\nWith just one button, guide your orange square over spikes and jump onto blocks to get to the end of the level. Sounds easy? Any mistake results in instant death, sending you back to the beginning of the level. With an awesome soundtrack synced to the game you’ll quickly become addicted!\nTry and unlock medals throughout the game, including beating the game with no flags — all synced up with Steam Achievements — and use checkpoints to learn the levels with Practice Mode, allowing you to lay checkpoints along the way.\nAs well as five classic Impossible Game levels, this desktop version includes an EXCLUSIVE new Level Editor. Design your own near-impossible levels and send them over the internet to challenge the world!","imageUrl":"https://media.rawg.io/media/screenshots/639/639113c324b20ac7d521a0f6c6f1cd5d.jpeg","releaseYear":2010,"developer":"Grip Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PSP"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"}]},{"id":2736,"name":"Croixleur Sigma","genre":"Action","price":0.0,"description":"High-speed hack-and-slash action!\nTonight, in the Queen's realm of Ilance, two prodigies representing the Knight and Aristocrat factions will do battle in ‘the Adjuvant Trial’. This ritual, which has been held since the founding of the nation, decides which faction will hold military and political authority, and protect the Queen, the living symbol of the realm. The fate of the nation is at stake as these two girls set aside their childhood friendship and undergo a trial in which there can be only one victor.\nCroixleur Sigma is 60FPS of high speed hack-and-slash arcade action game by Japanese indie developer souvenir circ. and featuring gameplay reminiscent of the Devil May Cry series' Bloody Palace mode.\nGame Features:Play as either Lucrezia Visconti or Francesca Storaro and battle your way up the tower through hordes of oncoming monsters to learn the secrets behind the Adjuvant Trial!\n20 Weapons to collect, each with a unique special move! Pick the load-out that suits your fighting style!\nSimple but satisfying combo system, including Move Canceling, Attack Nullifying, Invincible Dashing, and Rigid Body States!\nTake on the Adjuvant Trial in Story Mode with separate stories and multiple endings for both characters!\nTest your mettle and hone your skills in Time Attack Mode, Survival Mode, and Challenge Mode!\nLocal 2 player co-op: take on the monster hordes with a friend in in Dramatic Battle mode!\nFull Japanese voice over\n42 achievements, online leaderboards, and Steam Trading Cards!","imageUrl":"https://media.rawg.io/media/games/47e/47e47a2f246b2870389757d9c0714477.jpg","releaseYear":2014,"developer":"ACTIVE GAMING MEDIA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":673,"name":"Demetrios - The BIG Cynical Adventure","genre":"Adventure","price":0.0,"description":"Demetrios is a quirky adventure game packed with tons of humor!\nBjorn Thonen, a slob of an antique dealer living in Paris, is robbed one night after coming home drunk. Forced to conduct his own investigation with the help of his neighbor Sandra, he ends up involved in a murky, mysterious affair. Will these unlikely heroes be able to rise up and discover ancient secrets?\nA long, varied, standalone adventure (8 to 12 hours of gameplay)The Point & Click and Visual Novel genres mixed together!Over 15,000 lines of dialogHand drawn art in Full HDA high level of interactivityFun mini-games throughout the storySearch for hidden cookies on every screen for optional puzzle hints!Gamepad support","imageUrl":"https://media.rawg.io/media/screenshots/f05/f0576dfdf564917b9b9e8bb254db73e1.jpg","releaseYear":2016,"developer":"COWCAT","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":614,"name":"Stern Pinball Arcade","genre":"Simulation","price":0.0,"description":"Real pinball machines, created by the world's most experienced producer of arcade-quality pinball machines, can now be played on your PC.  Over 10 tables including modern classics like Star Trek™, AC/DC®, and Mustang™ are available as DLC with two FREE tables to play every month!\n•         3D Arcade - Classic arcade setting with pinball tables, neon lighting, novelty props and original works of art created by “Dirty Donny”.\n•         Table Instructions – Detailed tutorials of each table teach you how to become a pinball wizard!\n•         ROM Emulation and code compiled from real tables - 100% accurate gameplay and graphics of real world pinball machines.\n•         DLC - Table Packs, Upgrades, Bundles and new features released regularly.\n•         Leaderboards - Bragging rights over friends or all players world-wide for each table; Single and multi-player games on any of the tables.\n•         Stern Challenge - In this mode, users must hit a target score on each of the tables to earn Challenge points before moving on to the next table- a full game experience in itself.","imageUrl":"https://media.rawg.io/media/screenshots/7f5/7f5d0b1587ea97f2a5ad15c398617cfe.jpg","releaseYear":2016,"developer":"FarSight Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":914783,"name":"Shadow Gambit: The Cursed Crew","genre":"Action","price":0.0,"description":"Ahoy, cursed pirate!\n\nThis is Shadow Gambit: The Cursed Crew, an all-new stealth strategy game set during an alternate history of the Golden Age of Piracy.\n\nThe Curse of Lost Souls haunts the mysterious island chain known as the Lost Caribbean, which is under the control of the terrible forces of the Inquisition. They despise all that is supernatural and use soul devouring fire to hunt cursed pirates like you!\nAssemble Your Cursed Pirate Crew:\nEmbark on a journey with cursed pirate Afia and seek the legendary Black Pearls to revive a cursed crew of your own. Each of your eight shipmates is a playable character with an individual personality and armed with unique supernatural powers. Launch friend or foe with Gaëlle's magical cannon, use Mr. Mercury's soul anchor to open a magic portal or dash across spacetime for split second stealth attacks with Afia's mythical sword.\n\n\nOutsmart Your Enemy:\nPull-off an epic heist and salvage a mysterious treasure of otherworldly power to defy the army of the Inquisition. Infiltrate their fortresses. Sneak behind enemy lines. Cleverly combine the magical skills of your crew to take out a variety of enemies with carefully considered tactics. Feel like a brilliant mastermind when your plan clicks perfectly into place!\n\n\nYour Ship, Your Home:\nJoin The Red Marley, a ghost ship with a living soul. On deck, plan your next adventure or just hang out with your crew mates while they enjoy their un-life. Get to know these legendary cursed pirates of the Lost Caribbean. With individual character missions find out about their backstories, learn who they are and what led them on their cursed journeys.\n\n\nExplore the Lost Caribbean:\nGo ashore a variety of exotic islands in the Lost Caribbean. From locales oozing with cursed soul magic to tropical beaches and lively pirate shanty towns: Every island is a unique hand-crafted sandbox where adventures await.\n\n\nPlay It Your Way:\nFreely select your crew members before embarking on each mission. Utilize their unique abilities to find new strategies against the forces of the Inquisition. Plot your own path to enter and exit each island, be stealthy or more head-on in your play style and use the environment to your advantage. It's your playground to experiment in!\n\n\nManipulate Time and Experiment:\nThe powerful time-manipulating magic of your ghost ship is yours to wield. Pause time to consider your strategic choices or queue up multiple character actions. Capture a memory of every passing moment, to instantly return to if things go south. Change your approach and tactics to discover own unique solutions to each moment in the game – in your own time!\nSYSTEM REQUIREMENTS","imageUrl":"https://media.rawg.io/media/games/e63/e63debd47c79933a6814fbc88b1198c3.jpg","releaseYear":2023,"developer":"Mimimi Productions","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":898355,"name":"Risk of Rain Returns","genre":"Action","price":0.0,"description":"Carefully designed, beautifully remastered, and loaded with new ways to play—Risk of Rain is back and better than ever! Dive into the iconic roguelike full of unique loot combinations, enhanced with new Survivors, overhauled multiplayer, fan favorite content from Risk of Rain 2, and more!","imageUrl":"https://media.rawg.io/media/games/b57/b5714edd9eb12aa05cd018335b2de9cc.jpg","releaseYear":2023,"developer":"Hopoo Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":571756,"name":"Kathy Rain: Director’s Cut","genre":"Adventure","price":0.0,"description":"Set in the 90's, Kathy Rain tells the story of a strong-willed journalism major who must come to terms with her troubled past as she investigates the mysterious death of her recently departed grandfather.\n“Conwell Springs. I never thought I’d return to this place...”\nArmed with her motorcycle, a pack of cigs, and a notepad, Kathy delves into a local mystery surrounding her hometown that will take her on a harrowing journey of emotional and personal turmoil.\n“I ... feel strange. Am I dreaming?”\nAs she follows the trail of clues left by her grandfather, questions emerge: What was Joseph Rain really looking for that night all those years ago? What turned him into a mere shell of a man, confined to a wheelchair? What secret did a suicidal young artist take with her to the grave, and why are so many people in Conwell Springs going mad? The truth is dark, sinister, and yours to uncover…Features:Compelling narrative with an eerie plot set in the 90's\nGorgeous low res pixel art\n40+ hand-drawn environments\n4,000+ lines of fully-voiced dialogue\nEnglish voice acting directed by Wadjet Eye Games' Dave Gilbert\nAtmospheric original soundtrackDirector's Cut Features:Extended storyline with a prolonged ending, hundreds of lines of additional dialogue, and multiple new areas to explore.\nSeveral new major puzzle chains and many small additions and tweaks of existing puzzles.\nEnlarged game environments to fill up the entire screen without any black bars on the sides.\nMade countless visual improvements, such as more character animations, better lighting/shadows and extra weather effects.\nStreamlined mouse controls with an intuitive single click interface.\nController support done right. Lean back in your chair and take smooth direct control of Kathy, with no messy cursor getting in the way.\nExpanded and remixed soundtrack by the original composer, Daniel Kobylarz.\nFive brand new motorcycle designs to unlock and customize the Katmobile with.","imageUrl":"https://media.rawg.io/media/screenshots/3ee/3eea6a5902e15c59c8b503d7f8cb07f6.jpg","releaseYear":2021,"developer":"Raw Fury","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":507192,"name":"In Silence","genre":"Action","price":0.0,"description":"A New ExperienceIn Silence is being developed in order to provide a different online horror experience. You can hunt survivors as Rake by using your hypersensitive senses or play as a survivor yourself, use proximity voice chat and work together with other survivors to either escape Rake, or fight back.A Blind Monster... Rake! Rake’s vision depends on sound. The less sound there is, the less Rake’s able to see. Rake can hear the slightest bit of noise over huge distances and run at an incredible speed. With traits like these, It’s not hard to guess what Rake could do in the right hands.\nShh... Be Quiet!You may be a heartbeat away from being face to face with a monster because of a step you took, a toy you stepped on, or a vase you broke… But was it your plan all along? You could use noise that objects like a TV or a Radio make in order to distract Rake and escape the area, or maybe to set up a trap instead....\nEscape or Hunt!As a Survivor, you have two choices. Either try to escape by repairing a car and leaving with it, or open a secret armory and hunt the monster down.Where Am I?Every match you’ll play is going to be different. Your perks, escape points, roles and the item placement will all be randomized. You will always feel uneasy because there’s no way to predict how the game will go.\nKey FeaturesSingle player\nTake your shot at defeating Rake by yourself!\nNightmare Mode\nThe amount of items that are spread across the map is equal to the amount of items you will require. If there are 3 wheels missing from a car, there will be only 3 wheels in the map.\nPerks\nWith 16 different perks, every one of them will be useful in different situations and games. The perks will help with giving different roles to every survivor such as becoming a formidable hunter or a great mechanic.\nProximity Voice Chat\nYou can hear the voices of other players according to their proximity to you. But don’t forget, Rake will be able to hear your voices too.\nFlashlight and Flashbang\nYou will use an advanced flashlight to defuse Rake. With flashbang effect, this flashlight can stop Rake, but also it can make your friends blind. If you are caught by Rake or your friend is caught, you can stun Rake with flashbang and escape. In order to use flashbang, you have to be sure that your flashlight has enough energy.\nThe Armory\nDuring the match, survivors will be able to find and open a secret armory in order to acquire weapons to aid them with fighting Rake. As a result of opening the armory, Rake might get a bit agitated…\nEnraged Monster\nWhen the armory or the escape gates are opened, Rake gets enraged. During this phase, Rake will be able to kill survivors while running.\nPlay as a Mouse\nIf you die as a survivor, you’ll reappear as a mouse but you’ll still be able to help your friends escape by doing things such as; finding items for other players to use or distracting the monster.\n","imageUrl":"https://media.rawg.io/media/screenshots/950/950d968fbaed4298a01d4678806f56cb.jpg","releaseYear":2020,"developer":"Ravenhood Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":428702,"name":"INCANTAMENTUM","genre":"Adventure","price":0.0,"description":"A folk horror point and click mystery adventure, inspired by English folklore.\nTHE STORY:A mysterious letter brings noted barrow-digger Thomasina Bateman to the isolated and somewhat unwelcoming village of Bewlay, England. A subsequent series of strange events in this ancient and sodden landscape prove that this will be no ordinary dig for Miss Bateman.\nThe excavation of Hob's Barrow will uncover more than was bargained for...FEATURES:- A dark, complex and evolving storyline featuring interwoven elements from real English folklore- with many twists and turns.\n- Traditional point and click adventure game puzzles and interactions, with an easy modern interface.\n- A cast of intriguing characters, from suspicious villagers to sickly vicars to lordly landowners, all with their own unique stories and motives.\n- A distinct \"folk horror\" tone and grounding.\n- Evocative pixel-art graphics, featuring cut-scenes and engaging animations.\n- A suitably atmospheric original soundtrack from the musician behind the award-winning \"Football Game\" soundtrack.\n- Fiends in the furrows, the smell of damp soil, and a cat or two.\nComing 2020","imageUrl":"https://media.rawg.io/media/screenshots/d71/d71c16a48c5b609079545b93a71bf5c1.jpg","releaseYear":-1,"developer":"Cloak and Dagger Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":56053,"name":"Fire Emblem: Path of Radiance","genre":"RPG","price":0.0,"description":"Fire Emblem: Path of Radiance is a tactical role-playing video game developed by Intelligent Systems and Nintendo SPD, and published by Nintendo for the GameCube home console in 2005. It is the ninth main installment in the Fire Emblem series, and the third to be released in the west. As with previous installments, gameplay revolves around positioning characters on a battlefield with the aim of defeating an opposing force. If characters are defeated in battle, they are removed from the rest of the game.\nThe story takes place in Tellius, a separate world from other Fire Emblem games. Tellius is a continent inhabited by the humanoid Beorc and the shapeshifting Laguz. The game begins when the Beorc nation of Daein invades Crimea, a fellow Beorc nation. The protagonist, a mercenary named Ike, discovers Princess Elincia, the last heir to the throne of Crimea, and begins a journey to restore her to the throne. Ike and his group travel across Tellius to form alliances with the other countries and free Crimea from Daein's control, confronting racial tensions and long-standing resentment between the Beorc and the Laguz along the way.\nPath of Radiance began development for the GameCube after the overseas success of the Game Boy Advance game Fire Emblem, becoming the first home console entry in the series since Fire Emblem: Thracia 776. The game is the first entry in the series to feature 3D graphics, full motion cutscenes, and voice acting. The series' transition to 3D caused multiple difficulties for the developers. The localization team worked closely with Intelligent Systems to ensure the localization was as true to the original Japanese as possible. Upon release, the game received widespread critical acclaim for its gameplay and story, but several journalistic sites and magazines made negative comments about the game's graphics. The game debuted at the top of Japanese gaming charts, and was considered to have sold well. A direct sequel for the Wii, Fire Emblem: Radiant Dawn, was released in 2007 in North America and Japan, and 2008 in Europe and Australia.","imageUrl":"https://media.rawg.io/media/screenshots/8f8/8f84d86684aa6e4cfe2c647386159d00.jpg","releaseYear":2005,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"}]},{"id":45812,"name":"The Ultimatest Battle","genre":"Action","price":0.0,"description":"The Ultimatest Battle is a real-time, 2D platform game in which two teams compete in different game modes with an almost completely destructible environment.\nIn the “UB” universe, the player embodies small characters, called \"Nubs”, who are armed to the teeth and possess an arsenal of weapons that differ according to their class.\nEach class has its own advantages and disadvantages. The player can modify the appearance as well as the gameplay of each class by using different items acquired throughout the game.\nUB is a Free-to-Play, absolutely no Pay-to-Win!\nREVEAL YOUR ULTIMATEST SKILLS!!\nThe world of Ultimatest Battle is rich and diverse.\nDiscover the many zones and evolve in a 2D environment that’s almost completely destroyable.\nTake part in zero gravity battles on the Moon, explore Overmine's quarries, play Pirateship boarders, or treat yourself to the Ultimatest Fried Chicken restaurants!\nThere’s something for every taste and every horizon!\nIn The Ultimatest Battle you play small characters armed to the teeth called Nubs who possess different types of gameplay according to their class.\nAre you more of a bazooka, rifle or grenade person? Go for the Soldier's military arsenal!\nHow about a side of cannon powder? If you prefer an ax and a good beer, the Viking is the Nub you need!\nDigging quarries is your passion, and you like taming the land to your advantage? You’re a Miner at heart!\nThere are 6 playable classes, oriented equally to attack, defend or support other players: you can change your class at any time depending on the situation to lead your team to victory!\nFrom classical DeathMatch to ZombieMode, it's not the game modes that are missing!\nTake control of an area to defend in ControlPoint, and chase the opposing team!\nRisk your life saving the princess in SaveThePrincess mode, it will give you an advantage by transforming your enemies into chickens!\nStrike alliances with other players to try and defeat the Boss Casimor and Granny Karnage in Versus Boss mode!\nWhichever mode you choose, coordination and teamwork will lead you to victory.\nEach class has an arsenal of four weapons that can be replaced by objects obtained as you advance.\nAll weapons are equal in terms of power. Modifying the equipment of your character class will simply modify its gameplay, so that only technique counts on the field of battle.\nFind the best combinations for your way of playing to turn the situation to your advantage.\nIt’s not because we spend our time killing each other that we don’t appreciate our fellow players.\nHelping each other out is really important in The Ultimatest Battle. Playing in cooperation with your allies is the key to victory!\nBecome a member of our community and join a bunch of happy Nubs to take part in battles as unlikely as they are epic!","imageUrl":"https://media.rawg.io/media/screenshots/fba/fba898262ff7cb5cabeae92052031f35.jpg","releaseYear":2017,"developer":"Ediogames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":40445,"name":"Pinball FX 2","genre":"Arcade","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/eff/effce2c702e4c228a187fdcf84a531c0.jpg","releaseYear":2010,"developer":"Zen Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40420,"name":"Your Doodles Are Bugged!","genre":"Puzzle","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/ff1/ff1612bbc37c4bac83170341dc93cc59.jpg","releaseYear":2010,"developer":"Spyn Doctor Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":27620,"name":"Mario & Luigi: Partners in Time","genre":"RPG","price":0.0,"description":"In this quest of lunatic proportions, the Mario bros. team up with none\nother than… their younger selves! Control both sets of bros. at once in\nthis intriguing action RPG, where comedy is king and the story leads you\nbeyond the Mushroom Kingdom. Explore Mario’s world across space and time\nas you take down the evil alien invaders, the Shroobs!\n\nIn this precursor to the Mario & Luigi™: Bowser's Inside Story game, the\nbrothers travel back in time to retrieve Princess Peach™, only to come\nface-to-face with baby versions of themselves, the princess, and\nBowser™. While controlling both the adult AND baby versions of the\nMushroom Kingdom heroes, you’ll unleash powerful attacks and cross\nenvironments using special techniques to solve puzzles in creative ways.\nWith four brothers to control, this adventure is bound to get out of\ncontrol!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","imageUrl":"https://media.rawg.io/media/screenshots/572/572483eed674fcda46e3d0cb2fe07719.jpg","releaseYear":2005,"developer":"AlphaDream","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii U"}]},{"id":22674,"name":"Might and Magic 9","genre":"RPG","price":0.0,"description":"You’ve never seen Might and Magic like this. Explore an all-new universe filled with richly-detailed castles, dark, foreboding dungeons, lush outdoor environments, and much more! Lead a party of four player characters and up to three non-player characters on a quest to save your home, the peaceful land of Chendian, from the bloodthirsty Beldonian Horde. Develop each character’s skills in the talents of either Might or Magic in this installment of Might and Magic.Multiple character classes, each with their own strengths and weaknesses.\nA classic \"save the world as we know it\" story with many unexpected twists and turns.\nAn innovative and flexible character development system","imageUrl":"https://media.rawg.io/media/screenshots/fb1/fb1e37d860a99782bc8294d1eaec1c2c.jpg","releaseYear":2002,"developer":"New World Computing","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21605,"name":"Space Giraffe","genre":"Action","price":0.0,"description":"Space Giraffe is an abstract action arcade style game that takes place in a succession of beautiful environments generated by an advanced graphics synthesizer.  It presents itself as a shooter but the more you play the more you discover the hidden depths and strategies that make the gameplay satisfyingly rich and rewarding.  This is the boldest evolution of the trance-shooter, created by the company that helped to define the genre with the groundbreaking “Tempest 2000”.\n200 levels of trancetastic action.\nBeautiful abstract graphics that respond to audio input.\nDeep gameplay that rewards strategic and thoughtful play.\nAccessible enough to entertain a novice player, but deep enough to satisfy the arcade expert.\nIntense, satisfying, synaesthesiac shooting action that you'll return to again and again in search of ever higher scores.","imageUrl":"https://media.rawg.io/media/screenshots/b80/b802500e88adbb10b6b2c604e9631da9.jpg","releaseYear":2008,"developer":"Llamasoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":21002,"name":"Bomb The Monsters!","genre":"Action","price":0.0,"description":"Promised: You will love this addictive game!\nDon't make these monsters angry! Fire your bombs at those lousy creatures and get buildings to collapse on them. With lovely HD graphics and awesome physics!\n\"Bomb the Monsters!\" features the story of a highly talented painter who is living a perfect life with his beloved wife. But one day things are changing when a huge horde of ugly monsters invade planet earth, capture the painter's wife, and exhaust and exploit the whole planet. Now it's up to the player to stop this horrible invasion and rescue the poor hostage - easier said than done!\nThe very well-known gameplay offers an easy entry into the game: In every level the player needs to place a limited amount of bombs next to the monsters for getting surroundings and buildings collapse on them to drive the monsters out. But the monsters are coming in various sizes and shapes and are fat, imbecile and extremely sticky. Because of the physical structure of their bodies, these stupid creatures stick to almost everything what makes it sometimes tricky to bomb them away.\n\"Bomb the Monsters!\" offers over 60 levels in beautiful HD graphics; each level comes with non-linear solutions to eliminate the ugly monsters. Great music and sounds plus a motivating achievement system are part of this addictive mobile game as well and offering fun for the whole family.\nFEATURES:\n* Easy to learn, hard to master!\n* Addictive and very famous game play\n* 60 levels, divided into 6 different worlds\n* Realistic physics. Everything in the game uses physics attributes such as mass, force, friction and gravity!\n* Non-linear solutions for each and every levels\n* Breath-taking animations\n* Great music and awesome sound effects.\n* Motivating achievement system with more than 10 unlockable items.\n* Multilingual","imageUrl":"https://media.rawg.io/media/screenshots/f42/f429bd861821376759029e7fb39df5c4.jpg","releaseYear":2015,"developer":"Finalboss game studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20252,"name":"Mad Riders","genre":"Simulation","price":0.0,"description":"FEEL THE HEART-POUNDING THRILL OF EXTREME OFF-ROAD RACING COMPETITION\nPerform aerial stunts, use your boost wisely, and open shortcuts to dominate your friends on 45 tracks in stunning tropical locations across the globe.\nThe game’s breathtaking speed and accessible gameplay allows players of all skills to instantly pick up on the fun, while the competitive multiplayer and customization options will keep them coming back.\nMad Riders delivers the ultimate off-road racing experience for thrill seekers and fans of wheel-to-wheel action!\nKey Features:\nBe crafty to claim victory\nEnter wheel-to-wheel frenzy, thanks to an intuitive drop-in system, and compete in 3 exciting multiplayer modes playable up to 12 players.\nExperience blistering speed\nBoosting is the key to victory! Fill your boost bar by performing stunts or by collecting rings to be the fastest.\nUse shortcuts to your advantage\nUse shortcuts wisely to steal victory by turning the tide of a race.\nDominate the air\nMastering the air is as important as mastering the ground. Impressive aerial stunts will fill your boost bar to stay ahead.\nRace in stunning exotic locations\nRace on 45 different tracks set in breathtaking locales around the world.\nCompete with other racers\nPut your skills to the test against friends and the community thanks the worldwide online leaderboards.\nDefine your style\nChoose from a large selection of ATVs and buggies. Customize your vehicle and character to match your style.","imageUrl":"https://media.rawg.io/media/games/348/348c75d29c4ad5e101414713c0a866fb.jpg","releaseYear":2012,"developer":"Techland","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":19591,"name":"Blacklight: Tango Down","genre":"Action","price":0.0,"description":"In Blacklight: Tango Down, experience the bleeding edge of advanced warfare. Participate in the “NetWar”: a hyper-realistic battlefield letting you fight tomorrow’s conflicts with or against your friends in the gritty Blacklight universe.  Make your stand across seven game modes with 12 different maps in intense online battles supporting up to 16 players. Or fight through four intense Black Ops missions co-operatively or alone; all the while gaining experience, collecting stats, and unlocking items.  Earn new weapon attachments and items, improve your abilities, and engage your Hyper Reality Visor to locate enemies and take them out.  Customize your character and weaponry from among thousands of combinations to become the soldier you always wanted to be.\nGroundbreaking content: 12 multiplayer maps across seven multiplayer game modes.\nBlack Ops missions: Enhance your skills in four co-op missions with support for 1-4 players.\nHighly-customizable weapons and armor:  Modify the way your firearms shoot, look, and feel among thousands of combinations.\nRank up through 70 levels: Improve your abilities as you unlock tons of new items, camos, armor, and weapon attachments!\n","imageUrl":"https://media.rawg.io/media/screenshots/d0a/d0a7132a2a5b5929a73f05aa42319322.jpg","releaseYear":2010,"developer":"Zombie Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]}]