[{"id":23221,"name":"Deep Blue","genre":"Action","price":0.0,"description":"A multi-dimensional gaming experience beyond anything you’ve ever played before. Deep Blue: Prepare to have your mind blown.\nTake a surreal adventure through space, move between unexplored parts of the universe and beware of everything that is purple! This journey requires caution, concentration, and imagination to find the path and avoid danger. Find your way through an impossible platform architecture and escape on time from destruction.\nTry to control the constantly rolling ball which moves in the three-dimensional maze, avoid deadly obstacles, collect gravitons which will keep the ball on the platform, open and get to the portal before the platform explodes. Sounds easy, right? Just try by yourself :)\nGame Features:\nCustomized platforms that will blow your spatial orientation and reflex\nFour different worlds (parts of universe)\nDynamic gameplay and unique visual style\nEndless runner mode available as bonus levels\nAdditional VR Support\nSix balls with different properties\nFive types of modification and boosts for a ball","imageUrl":"https://media.rawg.io/media/screenshots/7a0/7a043ebb352ba982b08f0b098600ad23.jpg","releaseYear":2017,"developer":"Ice Code Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22626,"name":"Production Line","genre":"Strategy","price":0.0,"description":"Production line is the new car factory management/simulation/tycoon game that pushes your organisational and entrepreneurship skills to the limit. Can you build the ultimate optimised, free-flowing car production line whilst beating the competition and still turn a profit?\nA modern car factory is a near perfect example of efficiency, process-management and flow. A massive army of precision-controlled robots dance to a milimeter-perfect ballet of engineering excellence with perfect timing. Components snake along conveyor belts to a 'just-in-time' ordering system that leaves no pauses, no delay, no confusion or congestion. Nothing exists but the perfect flowing efficiency of high tech car construction...\n...in theory.\nIn practice, of course, life is not so simple. When you get to grips with your first factory design, it certainly will not feel in a state of pure flow...or profit for that matter. Making a handful of built-to-order cars and breaking even is one thing...but competing with the big multinationals and churning out thousands of cars for the mass market is a whole new ballgame.\nTo win market share from the big companies you are going to need planning, an appreciation of future technology, a careful eye on your bottom line, and an ability to design a factory layout that makes use of every square meter, and cuts production costs per car to the absolute minimum. Have you got what it takes to win?\nProduction line is the new car factory management/simulation/tycoon game from Positech Games, the developers of Democracy & Gratuitous Space Battles, and publishers of Big Pharma. This game is designed to appeal to the efficiency geek in all of us, the person who cannot help but organize things for maximum performance. The closet entrepreneur, the stats-geek,  Is that you? if so...welcome to your dream game (we hope!)\nThe key to understanding production line is the division of labor and the merits of purpose-built machinery. At the start, your factory will be small and the individual slots on your production line will carry out large complex tasks (like fitting the car body). As you research better methods, and earn the funds to expand, you will continue to subdivide those slots into smaller (and faster) production areas which keep the flow of new vehicles flowing smoothly. At the same time, product design researchers will be working out how to enhance your cars with new technologies such as automatic headlights, power steering, bluetooth phone support and voice recognition.\nits a race to be productive AND a race to be profitable. Are you ready to compete?","imageUrl":"https://media.rawg.io/media/screenshots/622/62246edd792a5773c79d96879afc513f.jpg","releaseYear":2017,"developer":"Positech Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22134,"name":"aMAZE 2","genre":"Casual","price":0.0,"description":"How long have you developed your thinking and attentiveness? Today we will give you such an opportunity, as an interesting and attractive game appeared on our vast spaces, which allows us to poke our brains. Game aMAZE 2 perfectly suitable not only for your children, but also the whole family.\nTry to get through the tangled labyrinth. After exiting the labyrinth, you will move to a larger labyrinth, and this will continue until you can not get out of all the labyrinths.\nIn this game you need to pass a small ball through the maze. It should be brought to the finish line, which is usually located at the other end of the labyrinth. The game has three levels of difficulty, choose based on your preferences. If you want to go through the game without problems, you can choose an easy level of difficulty. If you want a test for yourself, then safely choose a complex level of complexity.\nEvery time you play this maze game the maze itself is different, we through that was a really cool aspect. Not many maze games will create a whole new maze for you every time you start playing. Levels became even greater, they became even more difficult and more interesting\nUse the keyboard arrow keys to navigate the different mazes\nIn aMAZE 2:\n- 60 levels\n- 3 kinds of labyrinths\n- Achievements\n- Trading Cards","imageUrl":"https://media.rawg.io/media/screenshots/452/452012a0018e9420fac7705f2dd4cf66.jpg","releaseYear":2017,"developer":"Blender Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20453,"name":"Noir Syndrome","genre":"Adventure","price":0.0,"description":"Noir Syndrome is a procedurally generated Detective Murder-Mystery with a new story every time! Featuring slick pixel art animations and a jazzy soundtrack, the player is thrown right in to a highly stylized vision of film noir. Visit locations, interrogate suspects, search for clues, and eventually solve the case before the killer escapes - or you wind up dead yourself.Features: Procedural generation: Murder mystery scenarios with a new culprit and clues each time, every play-through is unique.\nPermanent choices: NPCs, interactions, death, and a slew of other features will all persist until a new game is started. Every action counts!\nNotebook: Collect vital clues in the detective's notebook to help narrow down suspects and solve the case.\nInvestigation: Interact with and examine numerous objects and characters in a number of environments in the search for more information on the killer.\nCountdown: Given a set number of days to solve the mystery, each area visited will decrement the time left, adding to the urgency of every case.\nFreedom of choice: Attempt to solve the case, or live out your remaining time doing as you please - be it fighting the law, going after gang members, or just seeing the city.\nGunplay: Combat is generally to be avoided as a single bullet will take down the player. However, when necessary, the revolver is always available for use.\nBadges: Complete a variety of challenges to earn unique badges which directly influence future playthroughs.\nStatistics and Scores: Statistics and high scores for a wide variety of topics will persist through every game.\nCostumes: Multiple unlockable costumes can be earned in game. Play as the default male or female detective, or unlock a variety of new outfits.\nChallenges: Optional challenges unrelated to the main case are generated each game. Every challenge completed provides permanent bonuses to all playthroughs.","imageUrl":"https://media.rawg.io/media/screenshots/b75/b75a85af81753eb585fa9169a7117cb1.jpg","releaseYear":2014,"developer":"Glass Knuckle Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20261,"name":"Crouching Pony Hidden Dragon","genre":"Action","price":0.0,"description":"Senseï is the undisputed chieftain. His followers are well versed in every extortion, infiltration and martial art. Pony and Biki are his best students, his pride and joy. The duo knows the secret chakra technique like the back of their hand (or hoof in Pony's case). Together they rule the city and its surroundings. Although everyone respects and fears them they are hunted by law enforcement agencies.\nThey are Ninjas.\nCrouching Pony Hidden Dragon (CPHD) is a brand-new Action/RPG game developed for SNK’s Neo Geo console which came out in 1990.\nIt might look like a straight-forward arcade game, but under the surface is a persistent world with a rich and varied set of rules. In CPHD “Run’N Gun” mechanics from the likes Shock Troopers or Ninja commando are combined with playful “RPG” ones from games like Zelda or Secret of Mana.\nYou'll need to explore every level to find the resources necessary for your progress: coins, health bonuses, resurrection potions, special Ninja techniques, etc. Treasure chests are hidden everywhere. You’ll have to find them to afford equipment upgrades from the ninja shops. In addition Pony and Biki gain experience points by defeating enemies, becoming more powerful over time. Be careful though: you’ll have to use your resources wisely. Health is limited so if you don't equip yourself at the armory you're in for a hard time. Money is limited too however: you'll need to choose these investments carefully!\nMake new friends: a local multiplayer co-op mode lets a second player drop in at any time. It’s even more fun, even more frantic and even more strategic!\nLose old friends: there are the same numbers of resources no matter how many players there are; will you share or will you hog everything?\nHave a good adventure!Why create a game for Neo Geo?Several reasons pushed us to develop for this console. The Neo-Geo is a legend amongst consoles, and is the one we dreamed of throughout our childhood and teenage years. For this reason, when we decided to bring our main character “Ninja Pony” to life, we wanted his early adventures to take place in the Neo-Geo universe. Thus we are offering our beloved Pony this welcoming present: to be born into the world of this “Rolls Royce” of consoles. Having our character emerge on cartridge is a way of enshrining him in the Pantheon of video game heroes, alongside Sonic and Mario. It's a way of going back in time! It also made sense with regards to the character's back-story. Crouching Pony Hidden Dragon relates the teenage years of Ninja Pony. This parallels the advent of the Neo-Geo in the history of video games: this console personifies gaming's teenage years.\nLast but not least there were technical challenges we were eager to overcome. We realized that there were very few traces of the tools and documentation required to develop games on Neo-Geo. What's more this arcane knowledge was gradually disappearing!\nWe had to become archaeologists, investigating, looking for clues, piecing together how these games were developed. We created our own software and hardware pipe-lines, started working directly in pixel art again, etc. We were able to leverage our experience working on “modern” video games in returning to blow the dust off these old techniques. It was an exciting job, a true act of video game craftsmanship!Why bring the game to PC?When we announced the Neo Geo version many expressed regret at not being able to play the game. Since our main ambition at Le Cortex is to offer original play experiences to as many people as possible we wanted to avoid restricting the release to Neo-Geo connoisseurs and collectors. So we decided to port the game to the gamers' platform of today: the PC. And in case you were wondering this is indeed a full native port, not the Neo-Geo ROM being run via an emulator!About Le CortexLe Cortex is an independent French Studio located in Paris. We design, write and develop games which aim to offer brand new play experiences.","imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd1592e7a10b85c60d33c624cef6e701.jpg","releaseYear":2014,"developer":"Le Cortex","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19566,"name":"Children of the Nile: Enhanced Edition","genre":"Strategy","price":0.0,"description":"Children of the Nile™ is a unique gem of a city-building game, unparalleled in both grandeur and attention to detail.\nAs Pharaoh you will guide your people through thousands of years of history: from simple hunter-gatherers to the creation of an immortal civilization. Guide your people well and you will build breathtaking pyramids, explore the ancient world and wage war against your enemies.\nEvery inhabitant of your city is a fully developed, living person – part of an individual family and household with wants and needs. From priests to entertainers, scribes to laborers, even the royal family… everyone will need to eat and that’s just the beginning. Every block of stone that is hauled to your pyramid will be pulled by people who pray to the gods in temples of your choosing. Under your supervision, local economies will thrive as goods from reed baskets to gold jewelry will be created, purchased and enjoyed by the inhabitants of your city.\nTo achieve immortality a Pharaoh must look outside his city’s borders and make an impact on the world. Explore and open trade with foreign neighbors and you will have reason to build commemorative wonders that will tell the tale of your dynasty for all time. As your prestige rises so too will your ability to draw more people to your ambitious endeavors and build cities that are truly epic.\nHow will your dynasty be remembered?","imageUrl":"https://media.rawg.io/media/screenshots/3ce/3ceb24ed7fa45b6775249814afeebb43.jpg","releaseYear":2008,"developer":"Tilted Mill Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19398,"name":"Lost Horizon 2","genre":"Adventure","price":0.0,"description":"In the shadow of the Cold War, Fenton Paddock is facing the hardest fight of his life. While the tensions between the superpowers threaten to tear the world apart, the British soldier has to save his family that has been caught by powerful enemies. His adventure leads Fenton far beyond the Iron Curtain and finally onwards to mysterious, uncharted territory. He has to finally face the dark powers of his past and learn what it means to take on responsibility.\n• Legendary and mystical – Our Hero Fenton Paddock joins a new thrilling adventure in the shadow of the Cold War of the 1940s and 50s. On an exciting journey across the continents Fenton encounters new allies and obscure dangers which hold their own secrets\n• Colorful and hand-crafted – Thanks to the Unity 5.0 3D Engine the developers created a vigorous and rich 3D World with a love for detail which the the Players can dive right into. At the same time all the zones keep their hand-crafted charm which fans of the genre love and enjoy so much\n• Intuitive and challenging – open doors, pick locks, combine different components… the Game comes with a lot new haptic features which puts the Player right into the middle of what is happening around him and always calls the player to action. In Addition to this brand-new features, a variety of tricky and challenging new puzzles and puzzle types are waiting to be solved","imageUrl":"https://media.rawg.io/media/screenshots/896/896be034b12489b1910209d6aa853cbc.jpg","releaseYear":2015,"developer":"Animation Arts","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":18355,"name":"Dance of Death","genre":"Adventure","price":0.0,"description":"A mysterious and fascinating quest in Hidden Object genre.\nThe magic of music and love against black magic death. Dance of Death! Will good conquer evil? Investigate the mysterious disappearance of young Luciano Folgeri from the orphanage. Immerse yourself in the atmosphere of an old Venetian mansion full of mysteries. Defeat your fear of ancient curses and prove that love is stronger than death. Do not be afraid! Save the boy! The universe of good spirits is on your side, and the great power of music will help you to succeed.\n- 30 locations\n- Four-chapter story\n- More than 50 puzzles of various difficulty\n- Two game difficulty levels\n- Unique \"Golden Mask\" mini games\n- Mystic component of the story\n- Beautiful music","imageUrl":"https://media.rawg.io/media/screenshots/853/85356d4096e24b344bc2c7cb3c8c0ab1.jpg","releaseYear":2015,"developer":"eight game studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17702,"name":"Kill to Collect","genre":"Action","price":0.0,"description":"“GIT GUD AND DIE TRYING”\nKill to Collect is a cyberpunk rogue-like for up to four player co-op that is designed for short bursts of intense gameplay sessions, rewarding players for their skilled survival. Featuring procedurally generated levels, Kill to Collect brings a constant challenge. No two experiences are the same and every interaction could be the difference between life and death.\nSet in Geoshelter Alpha, a dangerous and dystopian world that is the last known city on Earth, hired bounty “Hunters” patrol the lawless slums below to defeat enemies and reinstill order. Whether hired for money or glory, the “Hunters” all follow the same code: Kill to Collect.Key features\nDiverse Gameplay and Characters\nYou will play as one of four “Hunters,” each with their own abilities and fighting styles. With a diverse cast of characters, each single player run offers a different gameplay experience. Mix and match Hunters in co-op to create complementary team builds and unique synergies.\nThe playable characters include:\nKate Katana - The leader of the group and an all-around badass, sword-wielding, warrior woman.\nIvan Ironfist - The pretty boy raver who packs a punch with his bionic arms and has no need for physical weapons.\nRiot Ray - The tanky former Corp officer who believes the best offense is a good defense.\nShocking Shelly - The rocket-fueled mechanic who fights with her homemade biomata suit, turrets and electrocution.\nStrategic Co-Op Multiplayer\nEncouraging collaboration and precision, Kill to Collect offers a unique co-op multiplayer experience so you can team up with friends to face the perils ahead.\n80’s Cyberpunk Makes Its Comeback\nInspired by 80’s cyberpunk anime and manga classics, Kill to Collect delivers an action-packed, atmospheric experience with a synthwave soundtrack to power your runs.\n3 Game Modes\nClean up the streets in the Story Campaign.\nClear eight floors as fast as possible to get to the top of the leaderboards in Challenge Mode. Choose between playing the Repeatable Challenges or the One-Try Challenge (both refreshed daily).\nHunt any bounty in any order, without the story beats in Free Hunt Mode.","imageUrl":"https://media.rawg.io/media/screenshots/627/627640d6052e23247301ec733a8694cf.jpg","releaseYear":2016,"developer":"Pieces Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17529,"name":"BeatBlasters III","genre":"Action","price":0.0,"description":"Steam Big Picture\nAbout the GameWelcome to Accapella!\n\nWhen Joey and Gina arrive in the musically starved town that outlawed groovy tunes, a chance encounter with the music hating tyrannical ruler of the town (and local butcher) sends them flying. Now lost in the wilderness outside town, Joey and Gina have made it their mission to return to Accapella and put an end to The Butcher’s reign of silence. To make it back they’ll need to earn the trust and aid of the zany locals by helping them with all manner of chores and tasks. Armed only with the power of music and rhythm, Joey and Gina are in for the adventure of a lifetime!\nKey FeaturesCombination rhythm game and action-platformer.\nStrange world filled with fantastical, original creatures.\n3 music powered abilities : An attack power, a shield and a pair of rocket boots.\nRefill your powers by tapping your fingers to the groovy beat.\nAn awesome electro soundtrack for each character.\nUnlock new powers as you advance through the levels.\nUnlock Insane mode for additional challenge.","imageUrl":"https://media.rawg.io/media/screenshots/8af/8aff9d17ab96c33578d754ef98fb0e31.jpg","releaseYear":2014,"developer":"Chainsawesome Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16241,"name":"Zezenia Online","genre":"Action","price":0.0,"description":"Zezenia Online is a growing free-to-play 2D MMORPG, inspired heavily by the MMORPG Tibia. Zezenia Online features a large map of 4 continents with hundreds of spells, monsters and quests to explore. There are 3 main classes, and you can ascend your character to one of the 7 available subclasses at a later stage in the game.\nThe game is created by fans of the old MMORPG Tibia, which explains the similarity in graphics style and gameplay. However, the game is not purely a ripoff or an \"Open Tibia server\", but rather its own game with many unique aspects in game mechanics and \"feel\", that you will notice upon trying it out.\nIf you are into PVP you'll be delighted to partake in the fast-paced and skill-based action the game provides. Should you prefer to play in peace there is a Non-PVP world available as well.\nOther notable game features include dungeons, gathering of ingredients and brewing of potions, player housing, a task system (including boss tasks), battle & soccer arenas and more!","imageUrl":"https://media.rawg.io/media/screenshots/d33/d339d913c05b806e3af0a672f8517eba.jpg","releaseYear":2016,"developer":"Saucer Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15792,"name":"Better Late Than DEAD","genre":"Action","price":0.0,"description":"FORESEEABLE END?\nExplore an open sandbox environment which, depending on your intention, could have or could not have a foreseeable end. But as you investigate further, you may notice some suspicious activity including animals that would not normally be found in an area like this and some inconsistencies that lead to more questions. It is up to you to discover the answers.\n\nCraft items, quench your thirst, satisfy your hunger, fend off animals… What will you really need to escape the island? The answers are waiting.FEATURES:\n•             Craft items using a combination of objects and methods like tying and cutting\n•             Build a shelter to protect you from rain and dangerous animals\n•             Online Multiplayer\n•             Lose blood, break bones, become poisoned and stave off hunger and thirst\n•             Varying weather conditions that affect gameplay\n•             Procedurally generated items that the player must find to leave the island\n•             Dangerous animals including wolves, spiders and bears\n•             Capture animals using traps\n•             Permadeath – Will you be able to escape the island or will you succumb to its menace?Other titles from Excalibur Games","imageUrl":"https://media.rawg.io/media/screenshots/d52/d528f3a979d02bd119bb10f004f5e50f.jpg","releaseYear":2016,"developer":"Odin Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14624,"name":"Summer Nightmare","genre":"Action","price":0.0,"description":"Summer Nightmare is a psychological horror, that shows the life of one of the people, a man who did not love his mother.He was born into a fatherless family, grew up on the streets, and was addicted to gambling.When he found his love, he did not move out from his mother, but brought his beloved to his parents' house.His wife constantly reproached him for living with his mother.One day, his mother died...There were some hitches with the inheritance, but everything was \"miraculously\" resolved ..... His wife still left him when he told her exactly how his mother died, after that, in his life, and some kind of devilry begins to happen at home.\nA short psychological horror lasting up to 30 minutes.NotesNo Saves!Atmosphere:)Unreal Engine 5Achievement's","imageUrl":"https://media.rawg.io/media/screenshots/3e3/3e3be08533f2e8834dac46df9c89e040.jpg","releaseYear":2024,"developer":"Evolut Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14186,"name":"Adam and Eve: The Game - Chapter 1","genre":"Action","price":0.0,"description":"Attention:\nIn this game you will have few lives and a lot of difficulty. Over the course of 11 months, few have managed to come to an end. The game contains only the difficult level.\nDo you accept the challenge?\nIn the beginning everything was good... So what went wrong? Adam and Eve: The Game - Chapter 1, is the first chapter of 2D platform game that retells the biblical story of Adam and Eve. After Adam wake up and notice the lack of Eve, he begins a journey through paradise in search of his mate.\nFeatures:\n25 very nice levels.\nChallenging gameplay.\nCharacter and beautifully illustrations in 2D.\nEasy controls.\nCollects and dynamic jumps.\nVertical and horizontal levels.\nCatchy soundtracks.\nFace the Boss Chapter 1.","imageUrl":"https://media.rawg.io/media/screenshots/525/5250271b2fa9816af3329234f20f7c12.jpg","releaseYear":2016,"developer":"Religious Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13603,"name":"9Dragons","genre":"RPG","price":0.0,"description":"9Dragons is a free to play, 3D MMORPG with fluid martial arts combat, lush environments, and intense PvP. Immerse yourself in a mesmerizing world set in ancient China at the beginning of martial arts chivalry. Choose your destiny by siding with the \"White\" or \"Black\" clans and devote yourself to becoming a true martial artist.BackgroundIn an ancient time in China, the nine heroes (each was dubbed as Dragon), leading one's respective clan, competed to become the One. Through numerous battles and wars, they competed. However, there was one event that drove everyone to doom, the War of Nine-Dragons. Some speculated that there were love-hate relationships among nine clans and their leaders. However, no one was able to provide the real answer that triggered such a tragic event, which caused all of nine clans to disappear from the land.\nMany years passed by, six clans which suffered relatively less from the War than others, resurfaced. And so, our story of Nine Dragons begins...","imageUrl":"https://media.rawg.io/media/screenshots/ebc/ebc62667a4e449f3f59b6e40d11e058d.jpg","releaseYear":2017,"developer":"JoongWon Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13246,"name":"The Aquatic Adventure of the Last Human","genre":"Action","price":0.0,"description":"Digital Deluxe EditionThis edition includes:A pixel art map with all the boss locations\nThe full soundtrack composed by Karl Flodin\nA digital booklet that gives some extra information about the story, weapons, and upgrades\nA few desktop backgrounds\nAbout the GameThe Aquatic Adventure of the Last Human is a pixelated, side-scrolling, underwater action-adventure game about exploring the decaying ruins of our species -- and fighting deadly sea-creatures -- in search of answers about our downfall.Key Features\nMelancholic underwater atmosphere: We really wanted to show the beauty of the sea as well as our influence on nature.\nExploratory storytelling: The story is mainly told through the art and backgrounds with some textual hints along the way.\nUnique conflict encounters: Throughout the adventure, you will encounter -- much like Odysseus in The Odyssey -- monstrous beasts and challenges that you will have to best.\nPolarized gameplay: It's pretty chill until you've gotta fight for your life!\nWe think it's important to bring up global issues that have affected our lives and try to give a different point of view: climate change, terrorism, and technological progress.\nWe’re not lying: You are the last human; humanity is doomed.BackstoryThe water rose by an unpredictable amount due to climate change. The Earth's surface froze over, and humans were forced to live underwater -- where they could still harvest energy and grow food -- changing how cities and districts looked. As resources began to dwindle in the year 2971, sub-aquatic spaceships were sent to a nearby wormhole to look for habitable planets. Things did not go as planned. And now the ship, Argo9, has returned thousands of years later in a time after humans have gone extinct.\nIt's up to you to determine whether the ruins of our species is a travesty or an inevitable conclusion as you explore the lush aquatic world and encounter deadly underwater monsters.The Aquatic Adventure of the Last Human || Digital DELUXE Edition This edition includes a pixel art map with all the boss locations, the full soundtrack composed by Karl Flodin -- and a digital booklet that gives some extra information about the story, weapons, and upgrades. Lastly, you'll receive a few desktop backgrounds that we made. All of this will be found in the game's folder.","imageUrl":"https://media.rawg.io/media/screenshots/927/9277ac1937d82515f89da9f5f29f83bb.jpg","releaseYear":2016,"developer":"Digerati Distribution","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":12758,"name":"Vive le Roi","genre":"Adventure","price":0.0,"description":"January 21, 1793, Revolutionaries are about to guillotine King Louis XVI of France, leaving the elite free to take over and enrich themselves by snapping up the assets of the clergy and the nobility. You are the last hope for the people of France to prevent the King's execution and alter the country's destiny.\nVive le Roi (Long live the King) is a puzzle platform game with levels taking place during the French Revolution.\n30 levels and many puzzles to solve during the adventure\nStealthy trick guards by opening gates, moving objects and much more\nChallenge yourself to complete each puzzle with the minimum amount of moves","imageUrl":"https://media.rawg.io/media/screenshots/47b/47b620361935907c7ea817c885ea514a.jpg","releaseYear":2017,"developer":"Meridian4","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11539,"name":"Box Maze","genre":"Action","price":0.0,"description":"Jump into the life of Cubert, and help him reach his true love as you find your way through unique levels without being destroyed by your enemies as well as other obstacles, encounter new enemies and bosses as you climb the levels, collect cupcakes for your love along the way as you find hidden secrets.\nUse your enemy to your advantage.\nFake & Real doors, which is which? Use your thoughts to quickly as possible find the correct door.\nTest your reflexes at the start of quick thinking levels to grab the quickest time possible.\nBox Maze is a fun game set to push the limits of your memory, reflexes and more.\n170 Achievements.\nCharacter Skins\nCharacter skins have been added to Box Maze as a DLC to give you the opportunity to make your character into anything from a sweet little princess to an evil little devil.\nGAME MODES\nSingle Player\nPlay against a challenging AI set to destroy you as you fight to beat your high score.\nCo-Op\nPlay with a friend against pestly bosses and high level enemies.\nWARNING: May contain secrets.","imageUrl":"https://media.rawg.io/media/screenshots/a97/a9796cded22fd01b0312b3dbdc059912.jpg","releaseYear":2017,"developer":"GamersHype Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":7502,"name":"One More Line","genre":"Action","price":0.0,"description":"ONE MORE LINE is a highly addictive, one button, space disco, skill timing game!\nCreated by Sydney based developers SMG Studio.\nSteam Edition features:\nADVERTISING FREE\nSteam Exclusive features:\n2-4 player Local Multi-player\nSeveral hats to choose from\nUnlockable tails\nSeveral skins\nSteam Cards & Achievements\nAs seen at PAX East & PAX Prime 2015\nWhat people are saying;\n\"The game's so fun. I got everyone on the set hooked on it. It's a very easy game to learn, very hard game to master\"\nBurnie: Rooster Teeth (Podcast #302)\n\"It's finger crack!\"\nGame Stitch Podcast\n\"One More Line is viciousness without respite. A hardcore gaming experience\"\nPocketGamer\n\"An addictive time-waster perfect for downtime at the office or the daily commute\"\nTechly.com\n\"It's a twitchy arcade game that's something of a hybrid between the steering mechanic of slingshot racer and those rotating planet platformer games that are so darn popular.\"\nToucharcade.com\n\"SMG has got the formula precisely right. It's a fast, eye-catching game that's mechanically difficult, but the controls are simple and intuitive, so you never feel cheated, only beaten by your inability.\"\nABC.net.au\n\"An addictive and challenging yet deceptively simple arcade game\"\nJay is Games\n\"One More Line is most entertaining single button game that I’ve encountered.\"\nsuperatomica.com\n\"The controls are responsive and accurate, and if you have a good self-control, as well as a propensity for the psychedelic seventies, this could be the right game for you. 8/10\"\nIGN Italia\nOver 6 million downloads worldwide Thanks for the support!\n----------------------------------------------------------------------------\nScore Register:\n<10: You're not trying\n11-19: You can get that without even trying\n20-25: My mum can get that score\n25-49: OK you're on the way\n50-99: Respect!\n100-199: Fist bump. You're good\n200+: Whoa, nice work!\n400+: :0\n500+: WTFF!\n700+ Best in the world!!!","imageUrl":"https://media.rawg.io/media/screenshots/025/0250731bbda8d96dac34dfd0b0ffaae5.jpeg","releaseYear":2014,"developer":"SMG Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":4672,"name":"Alien Zombie Megadeath","genre":"Action","price":0.0,"description":"Alien Zombie Megadeath is a gloriously intense platform shoot-em-up! You are the lone Spaceman, doing boring space work on a random space platform in deep space when suddenly a huge, relentless, alien force attacks! However these are not your normal everyday aliens...these are alien ZOMBIES! Even through his protective helmet, Spaceman is sickend by their smelliness.\nFor the sake of humanity... and Spacemans nostrils... you must take control of the ill-fated Spaceman and fend off the alien zombie hoards. Alien Zombie Megadeath is an oldschool 2D platform shoot-em-up with enemies coming at you from all sides, in all shapes and sizes. You MUST blast them all to smithereens!\nKey features:\n\nIntense arcade action!\n80 levels, each with their own high score table.\nLots of game types, including: Survival, Adventure, Baby Rescue, Bomb Disposal, Jet Pack and Decoy pods\nLocal Multiplayer\n280 challenge medals to earn\nSpace suit unlockables\nSteam Achievements\njoypad support","imageUrl":"https://media.rawg.io/media/screenshots/81a/81a2455d7c942dcd25d1028da1797c0a.jpg","releaseYear":2011,"developer":"PomPom Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":608692,"name":"Skald: Against the Black Priory - the Prologue","genre":"RPG","price":0.0,"description":"You drag yourself from the black tides, across the corpses of drowned men, and onto the unwelcoming, craggy shoreline. Gulls cry overhead and the stink of seaweed fills your nose. By some miracle you have made it to Idra. It will take all your skill to survive and unravel the eldritch mysteries of the Black Priory. Pray your sanity holds.About the Prologue\n‘Skald: Against the Black Priory’ is an old-school roleplaying game that combines modern design and a fully realised narrative with authentic 8-bit looks and charms currently in development. This is the prologue!\nDelve into a dark fantasy world, full of tragic heroes, violent deaths and Lovecraftian, cosmic horror. Explore an engaging, branching story mixed with rich exploration and crunchy, tactical, turn-based combat that will seem familiar yet innovative to RPG fans, old and new.\nBe sure to check out and wishlist the main game:\nhttps://store.steampowered.com/app/1069160What's in the PrologueDelve into the first few hours of gameplay as you explore the cursed isle of Idra. The prologue features about 1-2 hours of gameplay and will allow you to play around with most of the game's features.\nCurrently we do not support using the prologue save-file for the main game after launch.\nFeaturesThe full game will feature:\nLovingly crafted retro-style art:\nExperience a richly illustrated world of authentic pixel art using thousands of hand-drawn tiles and images\nA palette inspired by the legendary Commodore 64 computer.\nOptional CRT filter for that authentic old-school experience.\nDeep character creation:\nBuild your main character and recruit a party from among a dozen diverse characters, each with their own skill-set, agenda and personality.\nChoose from a dozen classes and backgrounds as well as heaps of feats, spells and equipment as you take your party from level 1 to 20.\nCrunchy tactical combat:\nEngage in challenging, fast-paced, turn- and grid-based combat.\nPlay it your way, with fully customizable difficulty and feedback settings. Or hit ‘auto-resolve’,  lean back, and (hopefully) watch your party cleave a bloody path through their foes.\nA richly detailed, living world:\nExplore the vast expanse of Freymark and the Outer Isles and watch your actions spell doom or salvation for the region.\nFocus on the rich, branching narrative… Or live the life of a mercenary and explore varied sidequests and encounters - the plot will wait for you.\nManage your party as you make camp, recruit hirelings, travel by land and  sea, and interact with powerful factions and their visions for the world.\nBecome part of a fantastic community:\nSkald was made possible by crowdfunding and already has a large, passionate and welcoming community that can’t wait to meet you.\nBy joining Skald’s Early Access you’ll have a direct line to the developer, get sneak peaks and give feedback on forthcoming plans and help shape the game into a modern classic.\nWe will publish the powerful tools used to create the game in an effort to support and encourage modding and content creation once the game has fully launched.\nThe Story of Skald: A Dream Come TrueSkald is the dream-project of a lone Norwegian developer, AL.\nAL missed the thrill of delving into grand, immersive games such as ‘Ultima’, ‘Magic Candle’, ‘Wasteland’ and the Gold Box series. When he noticed the lack of newer roleplaying games that combined the classic (early 90s) charm with more modern game design he decided to take matters into his own hands.\nAL set to work crafting the game of his dreams.\nA highly successful Kickstarter and Indiegogo campaign with 700 backers, and a fast-growing community of passionate fans proves he  made the right call.","imageUrl":"https://media.rawg.io/media/screenshots/cf3/cf3fe354bcd070a01fa9e93c2f4e125a.jpg","releaseYear":2021,"developer":"Scape-IT","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":428799,"name":"Super Mega Baseball 3","genre":"Action","price":0.0,"description":"Super Mega Baseball 3 refines the series’ formula with the deepest on-field simulation yet, comprehensive online and offline game modes including a brand new Franchise mode, and vastly improved graphics. New content includes revamped UI plus tons of new audio, team/character content, and stadiums with variable lighting conditions.\nFeatures:\nChallenge your hand-eye coordination or relax and hit dingers with fluid gameplay that scales seamlessly from novice to beyond-expert levels of difficulty.\nApply and refine your baseball instincts with a sophisticated baseball simulation featuring new pickoff and stealing mechanics, wild pitches/passed balls, designated hitters, and situational player traits.\nTake in the sights and sounds of 14 richly detailed ballparks, each featuring unique day, night and alternate lighting conditions.\nGuide an evolving team to greatness over multiple seasons in the all new Franchise mode featuring player development, aging, retirement and signing/releasing of free agents (1vCPU, 2vCPU, local or online).\nCompete online to win pennants and climb to higher divisions in the cross-platform Pennant Race mode (1v1, online only, controller only).\nCreate your ideal league with a comprehensive customization suite that includes season length/structure, team names/uniforms/logos, and player names/appearance/attributes.\nPlay or simulate any combination of games/teams in customized Seasons and Elimination brackets, solo or with friends (1vCPU, 2vCPU, 1v1, 2v1, 2v2, CPUvCPU, local or online).\nSkip customization and compete for top leaderboard scores with standardized teams and settings (locked player attributes) in Standard Season and Standard Elimination modes (1vCPU, 2vCPU, local or online).","imageUrl":"https://media.rawg.io/media/games/63a/63adb258d31d291ee53168327de6294b.jpg","releaseYear":2020,"developer":"Metalhead Software","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":403032,"name":"Pokémon Mystery Dungeon: Rescue Team DX","genre":"Adventure","price":0.0,"description":"You can meet and recruit Pokémon in a dungeon-crawling adventure within their world! Build a rescue team to take on mysterious, changing dungeons and strategically plan your moves as you venture forth to make the Pokémon world a safer place…and uncover your true purpose along the way.\n\nAs you recruit Pokémon, these trusty teammates will need somewhere to stay, so build camps to house, manage, and strengthen your Pokémon friends. Think hard about who is right for the job and how to approach each mysterious dungeon as you prepare a rescue team. You’ll move a single square at a time or use Auto mode to speed up movement until you engage other Pokémon in turn-based battles—but don’t forget about Pokémon strengths and weaknesses! This version adds gorgeous watercolor-inspired graphics, and more! Get comfortable in being a Pokémon, there’s a lot of work to do.","imageUrl":"https://media.rawg.io/media/games/143/1434552d5c41d650a90ab3e166717156.jpg","releaseYear":2020,"developer":"Spike Chunsoft","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":306154,"name":"Lair of the Clockwork God","genre":"Action","price":0.0,"description":"BEN is a die-hard, old-school LucasArts Adventure fan. His feet never leave the floor, and he’s happiest collecting any old junk he can lay his hands on, in the hopes of combining it all together to solve a satisfying puzzle. His cohort and sidekick DAN has decided there’s no money to be made in Adventure Games any more, so he’s going to be an indie darling platformer instead.\nLAIR OF THE CLOCKWORK GOD sees you switching between both characters and using their unique abilities together in a race-against-time effort to stop all the Apocalypses happening simultaneously by teaching an old computer about feelings.\nLAIR OF THE CLOCKWORK GOD is a new, standalone adventure starring Dan and Ben, heroes of hit point-and-click games “Ben There, Dan That!” and “Time Gentlemen, Please!”, which are somehow already definitely in your Steam library, even if you can’t quite remember how? If not, try one of these? You might be the first to find them ?NCM9-4K9N7-CGJG5 and ?VNYG-VF5R6-TCVPN where the ? are the initials of the protagonists' first names.","imageUrl":"https://media.rawg.io/media/screenshots/8fa/8fa1ea5c236d2cfc12daa71c153b9fbb.jpg","releaseYear":2019,"developer":"Size Five Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":304222,"name":"Conglomerate 451","genre":"RPG","price":0.0,"description":"Game Overview\nConglomerate 451 is a grid-based, dungeon crawling first-person RPG with roguelike elements set in a cyberpunk world.\nYou are the CEO of a Special Agency, instructed by the Senate of Conglomerate city to restore the order in sector 451, where corrupted corporations have established their turfs. Thanks to the last constitutional decree, you are allowed to create human clones. Build your own team, manipulate DNA, train your agents, equip them with high-end weapons, choose what cyberlimbs to implant, and send the squad to the field with only one goal: eradicate crime and restore order at any cost.Key FeaturesManage your resources - Make use of your own personal R&D department to research advanced technology, unlocking new features, powers and options for progression\nMore than just body mods - In addition to upgrading weapon and armor proficiencies, augment your body with interchangeable cyber implants that completely change your agent’s skills and utility\nPain and Trauma system - Even the smallest wounds can have a lasting impact. By taking damage in combat, agents risk generating permanent Traumas that will follow them between missions\nProcedural cyber dungeons - Experience the dungeon crawling you love, mixed with future technology as you take on procedurally-generated dungeons and missions\nIf you die in the game... - Each mission could be your last thanks to agent permadeath. Consider every move, because if an agent dies in battle, they will be lost forever\nHack the world - Enter cyberspace mid-mission and hack your way ahead of the competition to get crucial intel and give yourself the advantageEarly Access coming soon! To be added later:Drugs and Disorders: buy synthetic drugs to temporarily empower your agents, with the risk that they develop Mental Disorders*.\nPerks and Mutations: your agents can acquire special skills (Perks) and obtain Mutations*.\nDiplomacy*: talk to the Narks on the streets of the city and obtain favors.\n* Not in the first Early Access build.","imageUrl":"https://media.rawg.io/media/screenshots/5bc/5bc733ada0ecb9c0dc0cf2808f2eb2cc.jpg","releaseYear":2020,"developer":"RuneHeads","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":296117,"name":"Femdom Waifu","genre":"Indie","price":0.0,"description":"Femdom Waifu is a JOI (Jerk Off Instruction) game where the player is controlled by cruel dominatrix.\nFeatures:\n■ A dynamic game with lust, pain and frustration.\n■ Worship your mistress, obey her commands.\n■ Lots of stroking, edging and verbal abuse.\n■ Different outcomes. Chance to ruin, cum or be totally denied.\n■ Erotic humiliation, kinky tasks and hours of masochistic pleasure.\n■ Made with love.","imageUrl":"https://media.rawg.io/media/screenshots/a02/a025e244c759a54286d7f846c07dfdba.jpg","releaseYear":2019,"developer":"Zee Vital","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":262414,"name":"Discolored","genre":"Adventure","price":0.0,"description":"From Jason Godbey, the creator of The Search, comes a new first-person puzzle-adventure.\nYou arrive at the end of a desert road where a small abandoned cafe sits and a strange tower looms overhead. As you look around you notice everything has lost its color. All objects that once held vibrant lush tones of color are now a pale grey. What is causing the colors to disappear? How can they be brought back? As you explore, solve inventive puzzles, and uncover clues that restore the world back to its true colors, you’ll discover that this strange place at the end of an abandoned highway has deeper secrets to be revealed.\nDiscolored is a surreal, beautiful, and unique experience coming to Steam in 2019!\nFeatures:\nA peaceful, atmospheric experience\nUnique and surreal puzzles\nGorgeous minimalist 3D artwork\nA short experience that can be completed in one sitting","imageUrl":"https://media.rawg.io/media/games/baa/baab551e8fe937012e6aa3f1d9565665.jpg","releaseYear":2021,"developer":"Jason Godbey","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":64544,"name":"Frightened Beetles","genre":"Adventure","price":0.0,"description":"Controller NOW!More fun with vibration!\nLook here!https://store.steampowered.com/app/838390/Merry_Glade/\nAbout the GameAbout the game.\nFrightened Bugs is a small adventure for just a couple of minutes. For some people the game may turn out to be hard, so you must try hard to find out who frightened all Bugs and disturbed the Worm.\nFrom the developer.\nThis is my first animated project and I want it to be free of charge. It was rather hard to withdraw from the pixel art but the result exceeded my expectations. In the end the game turned out to have good animation and funny characters. If you try hard you can end the game in just a few minutes. I really hope these minutes will make you laugh and cheer you up!","imageUrl":"https://media.rawg.io/media/screenshots/bcf/bcf533454970f0bd1da6e941da765857.jpg","releaseYear":2018,"developer":"Anatoliy Loginovskikh","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61805,"name":"Paintball War","genre":"Action","price":0.0,"description":"PaintBall War is a multiplayer, a thrilling first person shooter! The game is created on motives of entertainment in real life, called PaintBall. In the game you will find 15 markers and 4 pistols, with different damage and radius variation! Also, you can try out 2 game modes, the usual fight to the death, where you will have 100 points of health, and the real mode where you will not have right for mistake, you feel yourself as a real player in PaintBall, you will have no chance to miss, either you kill or you kill, because the weapon damage is not important there, one hit is everything! Come in and win, prove to everyone that you are the best!","imageUrl":"https://media.rawg.io/media/screenshots/4bb/4bbaac8fe820aa54293e38578b181bfe.jpg","releaseYear":2018,"developer":"ShadowWolf Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51812,"name":"Countryballs: Over The World","genre":"Adventure","price":0.0,"description":"Hello there, player!\nCountryballs: Over The World is an adventure game obviously based on Countryballs jokes.\nYou are playing as Polandball, who just ran out of his ointment. Will you succeed and get it?List of featuresFunny design\nSimple controls\nThree game-modes\nFunny Achivements (A lot of countryballs)\nCool story\nThe story is a simple platformer with one of the endless modes being a challenge for you to find Polen and the other one is Polandball in Russia.","imageUrl":"https://media.rawg.io/media/screenshots/8f9/8f9d8739db67255f193c93c6c8fcd072.jpg","releaseYear":2018,"developer":"Divertic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":49680,"name":"Red Crucible: Reloaded","genre":"Action","price":0.0,"description":"Destroy, smash and blast your way to victory! Use advanced weapons and vehicles to dominate the battle field.\nCompete with friends or players from around the globe using some of the world's deadliest modern weapons and vehicles. Play with up to 18 players in unique environments designed for infantry, vehicle, and air combat.\nIncludes an integrated store for in-app purchases or use the honor points you earn to unlock additional weapons and gears.\nGame Modes:\n- Team Deathmatch\n- Attack & Defend\n- Territories\n- Frontlines","imageUrl":"https://media.rawg.io/media/screenshots/e0b/e0b90379c703ccedce3eac05d31dd7cd.jpg","releaseYear":2017,"developer":"Rocketeer Games Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":44124,"name":"Space of Darkness","genre":"Action","price":0.0,"description":"ABOUT\nSpace of Darkness is a survival horror game, taking place on a hijacked spaceship where you are the last survivor.\nYou must try to find the last \"rescue capsule,\" but it will not be easy.  On the spaceship you will need XP, a way to get to the rescue capsule.\nA beautiful journey to another universe, but you are not alone once the the adventure leads to a seemingly small bump.  Robot aliens come to the conquer the spaceship -- the crew is dead!  Can you escape?  You must find a way to rescue capsule and save yourself...\nKEY FEATURES\nHealth and Hunger System\nBig spaceship\nPlanet\nRare items\nEnemys\nMedikits\nFood\nJump-scares","imageUrl":"https://media.rawg.io/media/screenshots/244/2447fcd521473ccf83ee0d36f78467da.jpg","releaseYear":2017,"developer":"Aaron Roller","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":38433,"name":"Grand Chase","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/3ce/3cea0935cc04235e9225d1371611f2ab.jpg","releaseYear":2008,"developer":"KOG","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31207,"name":"Project I.G.I.: I’m Going In","genre":"Action","price":0.0,"description":"Pursue and defeat a homicidal ex-Russian Colonel before he turns Europe into a nuclear wasteland in Project IGI: I'm Going In. This first-person shooter emphasizes stealth and guile instead of massive firepower. You will sneak into the toughest military installations in Eastern Europe, and once inside, use your skills in thievery, computer hacking, sabotage, and reconnaissance to stop the madman. The enemy's Artificial Intelligence will react to your every action and use military tactics to track your position. In order to counter its surveillance, bunkers, tanks, and gunships, you will be equipped with NATO spy gear and assault weapons. If the odds get stacked too high against you, call in a napalm strike via your map/communication PDA.","imageUrl":"https://media.rawg.io/media/games/841/84141a40083c0cefd00f3e5463970084.jpg","releaseYear":2000,"developer":"Innerloop Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29849,"name":"Aliens Versus Predator 2","genre":"Action","price":0.0,"description":"AVP 2 takes you to Planet LV1201, where three diverse and bloodthirsty species battle for survival. The story-driven plot weaves together the fates of all three races. Choose to play as Alien, Predator, or Marine as you use your physical prowess, killer instincts, or superior firepower to stay alive.","imageUrl":"https://media.rawg.io/media/games/bc8/bc84784c2630f46ed2e675d0b4a59d62.jpg","releaseYear":2001,"developer":"Monolith Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22435,"name":"Chuzzle Deluxe","genre":"Casual","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/819/8190323faeb01a2c69ba5d65290285c5.jpg","releaseYear":2006,"developer":"PopCap Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20786,"name":"Aces Wild: Manic Brawling Action!","genre":"Action","price":0.0,"description":"Aces Wild is a fast-paced, hardcore, aerial beat 'em up!\nEngage in insane aerial martial arts combat against countless opponents!\nIt utilizes a 'Wild Meter' which increases the power of your attacks but\nalso makes enemies more aggressive!\nYou play as Ace Wilder trying to defeat your brother Rex in a tournament where he and all the other entrants have colluded against you. Utilize a wide range of offensive and defensive skills to defeat hordes of enemies all at once and go for a high score! There are several playable characters and local co-op play!\nIt also has a jammin' soundtrack, smooth frame by frame animation and fully voiced characters!\nGame and Art by Tyler Doak / Kicks , Culture Attack Studio\nMusic by James Landino / KgZCombat MechanicsAces Wild boats a free-form combat system that feels amazing, is fun for new players and deep for hardcore and stylish players.\nWild System\nAs you engage in combat, your Wild Meter will fill up.\nThis increases the damage your attacks do but also makes enemies stronger and more aggressive.\nAttacking enemies builds Wild. Taking damage lowers Wild.\nA true fighter will learn to build Wild for an advantage, then expend it to maintain the advantage before the enemy exploits it.\nRapid Attack\nRapid Attacks allow you to fly through the air and perform quick combination attacks against enemies!\nIt fills up your Wild Meter quickly. The faster you fly, the more Wild you build.\nDefeating an enemy with a Rapid Attack gives you more Wild.\nCrash Attack\nCrash Attacks allow you to deal insane damage and send enemies flying and bouncing off the environment!\nThey get a larger damage bonus from your Wild Meter.\nEvery Crash attack has different properties and they use Wild when you execute them.\nSome have special effects like letting you knock the environment and enemies into each other.\nAn enemy hit with a Crash Attack will receive more damage and yield more Wild when attacked.\nCrash Charge\nBy holding the Crash Attack button, you can expend Wild Meter to Charge the Crash Attack making them bigger and stronger.\nDamage from these attacks becomes ridiculous.\nYou have free-form movement while Charging a Crash Attack.\nDash\nDashing lets you travel in any direction very quickly.\nYou can extend the length of a Dash by holding the button.\nHolding no direction while Dashing lets you perform a Homing Dash.\nDodge\nDodging makes you invincible and lets you avoid enemy attacks. It's the most important skill and you'll be doing it a lot!\nPerforming a successful Dodge makes you invincible for a bit longer than normal letting you attack freely.\nIf you Dash out of a successful Dodge, you will maintain invincibility.\nWild Counter\nIf you press and hold the Dodge button and perform a successful Dodge then press Rapid or Crash attack,\nyou will execute a Wild Counter! There is a different skill for each attack type: Rapid Counter and Crash Counter.\nWild Counters are powerful skills with varying effects.\nPanic Attack\nIf you build your Wild Meter higher than the Panic Threshold you can execute a Panic Attack.\nThis expends all of your Wild but restores your Health, makes you invincible and knocks enemies away from you.\nUse this if things get too scary or if your Wild gets out of hand.\nPanic attacks also increase the Panic Threshold and resets your Rank.\nRank\nRank is a judgement of your performance in combat.\nAs you attack and defeat enemies, your Rank will increase. Taking damage lowers it significantly.\nRank is similar to Wild in that it also makes enemies stronger and more aggressive but is more extreme.\nHowever, Rank is much more difficult to maintain at a high level.\nRank increases the Score you receive from attacking and defeating enemies.\nRank also increases the rate at which you build Wild Meter.\nScoring\nEach time you strike an enemy or defeat an enemy, you earn Score based on how much damage you deal.\nThis is multiplied by the type of enemy and your current Rank.\nScore earned from damage is slightly exponential, so a 20-damage attack is worth more than two 10-damage attacks.\nYou receive a percent bonus to your score for a Stage based on how quickly you cleared the Stage.\nPinata\nCertain enemies will have violet smoke emanating from them. When defeated, they will explode into BONUS NINJAS.\nBonus Ninjas are large swarms of aggressive enemies. It is your chance to boost your score or totally ruin your Wild and Rank.\nA hidden 'Pinata Meter' increases based on your Rank when you defeat regular enemies. This will also yield Bonus Ninjas from regular enemies. The amount of Bonus Ninjas you receive is based on your Rank, Wild and strength of attack.","imageUrl":"https://media.rawg.io/media/screenshots/11d/11d35fdd0e66294525de81e19906e746.jpg","releaseYear":2014,"developer":"Culture Attack Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20694,"name":"Bob Was Hungry","genre":"Indie","price":0.0,"description":"Bob Was Hungry is a challenging precision platformer with many levels designed to truly test your platforming skills.\nBobs have been scouring the universe for food for millions of years. For the most part, food had been plentiful and easy to acquire...planets made entirely of cheese were abundant, and finding one could leave a bob full for a lifetime. However, time has passed, and food has become scarce. Greedy bobs so carelessly ate two or three cheese planets at a time, and now cheese planets are as rare to find as a bob with a full stomach.\nBobs unable to stumble upon one of the last extremely rare cheese-havens were forced out into the unknown. Now they traverse as many planets as they can in hopes of finding a scrap of food to survive. Unfortunately, their trips are dangerous, and the planets are treacherous. Finding food is not like it used to be.\nYou play as one of these bobs, and it is up to you to find the meal that will finally satisfy your bob's insatiable appetite.\nPlay alone, or play online with up to 8-player co-op in four frantic multiplayer modes:\nCo-op: Play with your friends and help one another make it to the end! Recommended for beginners.\n“Shared Death” Co-op: Everyone has to make it to the end of each stage. If one person dies, everyone dies and has to start the stage over.\nCompetitive Race: Race against your friends for the fastest time and the highest score.\nCompetitive Survival Race: Race against your friends, but you only get one life per stage!\nKey Features:\n2-8 player online cooperative and competitive modes\nOnline game modes include co-op, shared death co-op, competitive race, and competitive survival race\nChallenging precision platforming\nOver 170 levels set in 5 Unique Zones\n38 Steam Achievements\nSteam Trading Cards\nController support","imageUrl":"https://media.rawg.io/media/screenshots/6f9/6f98c7e10341792b6e1d4fc87071fa79.jpg","releaseYear":2015,"developer":"Shorebound Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19441,"name":"Silent Hunter III","genre":"Strategy","price":0.0,"description":"The king of submarine simulations returns with an all-new 3D engine, new crew command features, and more realistic WWII naval action than ever before. The movie-like graphics and simple, tension-filled gameplay make this the perfect game for the realism fanatic and the casual gamer.\nRealistic and immersive environment: The suspense-filled atmosphere includes realistic 3D water modeling, day/night cycles, and historically accurate subs, ships, and aircraft. The detailed U-boat interiors, changing weather effects, and engaging audio represent the ultimate in WWII submarine warfare.\nA deadly array of U-boats and weapons: Playable U-boats include Type II, VII, IX, and XXI submarines. Take aim against Allied convoys and warships. In recreating the great submarine battles of WWII, players will hide in silence just below threatening escort ships, fire deadly torpedoes, or surface and pound enemies with the deck gun.\nDynamic campaign: Create your own realistic naval war story. Your military career will be influenced by successful command decisions in an unscripted and non-linear WWII campaign.\nAccessible to players of all skill levels: Players will experience a simplified learning curve that will be easier to handle than standard simulations. Use the naval academy tutorial to learn the basics. Customize the realism settings for play that appeals to a variety of WWII combat fans.\nCommand your crew: The crew will take orders and evolve based on the results of each patrol.\nMultiplayer cooperative play: For up to eight players via LAN.","imageUrl":"https://media.rawg.io/media/games/f39/f39f58a4ac9c54e08f958def1b953649.jpg","releaseYear":2005,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18835,"name":"Mystic Saga","genre":"Adventure","price":0.0,"description":"Reveal the secrets of the past, find ancient scrolls, and find out about the prophecy ancestors! Decipher ancient spells and find magic keys to mastering the power of all the elements!Enter the fantasy forMore than 250 quests!\nCheck out over 15 unique characters!\nDefeat an evil empress!\nExplore ancient Asia!","imageUrl":"https://media.rawg.io/media/screenshots/6a3/6a3efb2ad28265204b649c72f179111a.jpg","releaseYear":2016,"developer":"FIVE-BN GAMES","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]