[{"id":3240,"name":"BlazBlue: Chrono Phantasma EXTEND","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/511/51127ca7d6caeebdcd6aac27fcee3570.jpg","description":"The most definitive installment of the renowned 2D fighting game franchise, BlazBlue, can finally be taken into your living room. Uncover the secrets, of the Chrono Phantasma Extend.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-64\nDUALSHOCK®4\n720p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© Developed by ARC SYSTEM WORKS.\nLicensed to and published by Aksys Games with permission from ARC SYSTEM WORKS.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":2909,"name":"Tharsis","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d8/3d815a4e2166a4abb2395b856dee33f2.jpg","description":"A mysterious signal originating from the Tharsis region of Mars set us on a frantic mission. Who sent it? And why? Impossible questions, but in them lie the key to humanity’s survival.\nNow, millions of miles away from home, a micrometeoroid storm has left us with a severely damaged ship, two deceased crew, and the sneaking suspicion this trip was doomed from the start.\nTharsis is a turn-based space strategy game. With dice. And cannibalism. It puts you in control of humanity’s first mission to Mars, just as it’s struck by a micrometeoroid storm. You must guide your crew through disasters, food shortages,  and the unforgiving nature of space — all while maintaining your sanity amidst cryptic signals and warnings from Mars.\nDefy the odds, make the difficult decisions, and embark on the most important mission in human history.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Choice Provisions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":359373,"name":"Garfield Kart - Furious Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e28/e286c06d88ba2fa3cd9ed05df3f9faca.jpg","description":"Garfield, the famous lasagna-loving cat is back to take on Jon, Odie and company in a no-holds-barred racing game!\nChoose your character and kart according to their characteristics and your driving style, get off the starting line first and control skids to outrun your opponents. Use crazy bonus objects, like the Pillow or the Magic Wand, to gain an edge and get over the finishing line first. Are you lazy like Garfield? Take shortcuts to overtake the other racers with the Spring!\nRace your friends in local mode or online, with up to eight players on 16 iconic circuits from the world of Garfield.\n3 GAME MODES: Grand Prix, Single Race, Time Trial\nMULTIPLAYER up to 4 players in split-screen mode and up to 8 players in online mode\n16 CIRCUITS: Crazy races in stunning environments inspired by the world of Garfield, such as Palerock Lake and Pastacosi Factory\n8 CHARACTERS: Garfield, Odie, Jon, Nermal, Arlene, Liz, Harry and Squeak\n9 ATTACK AND DEFENSE BONUSES to turn the race around\nCUSTOMIZE your character and kart with dozens of accessories","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Artefact","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9716,"name":"BeamNG.drive","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b39/b391b3f197385e46b48e2077eea97f6d.jpg","description":"BeamNG.drive is a realistic, immersive driving game offering near-limitless possibilities. Our soft-body physics engine simulates every component of a vehicle in real time, resulting in realistic, dynamic behavior.\nThe driving feel is authentic and visceral, and crashes are realistic and violent; yet the physics are accessible enough to drive with a keyboard or gamepad while still being authentic with a full racing wheel with uncompromising realism.\nEnvironments and vehicles in BeamNG.drive are hand-crafted with passionate attention to detail. With years of meticulous design, research, and experience, we authentically recreate the feeling and excitement of real world driving.\nWe are a small team from around the world with no obligations to publishers or outside interests. Our users and modding community are our first priority. Help us make BeamNG.drive the ultimate driving experience and discover what an open and uncompromising soft-body vehicle simulator can be.Why is BeamNG.drive the game for you?\nAs an open world vehicle simulator, BeamNG.drive will cover a large array of vehicular disciplines - everything from a delivery mission in a box truck to a high speed rally race or a destruction derby. The vehicle customization and detail will allow you to make your car or truck all your own - fix it up, upgrade it, or strip away body panels to reduce weight. There are a lot of different types of gameplay we want to implement beyond just racing and crashing, such as police chases, stunt challenges, and other specialized minigames. Eventually we would like to have some kind of single player open world career mode, with persistent vehicle ownership and procedurally generated used vehicles to buy and events to run them in.\nIn some ways, BeamNG.drive is about doing anything you want with a car or truck - the stuff other games don't let you do. You can go off-roading in a family sedan or hurl a delivery truck around a racing circuit, all with beautiful soft-body simulation physics. You can mod those same vehicles to be racing beasts, derby monsters, or off-road behemoths - or just thrash them stock. At the end of the day, BeamNG.drive gives you the gameplay you want, and doesn't force you to do anything that you don't think is fun or interesting.The future of the game and our physics engine\nAs we optimize our game and computer technology improves, the amount of vehicles which can be simultaneously simulated at a smooth framerate will increase. Right now you can run 4 to 6 cars at one time on a high end quad-core processor. Each vehicle has around 400 nodes and 4000 beams, all being simulated 2000 times per second. We hope to expand the number of simultaneous vehicles possible to at least 8 with a mid-range processor.\nWe will also look towards having multiplayer in the future, but it may be some time before we can create the multiplayer experience everyone is expecting. We are well aware of the demand for multiplayer and we want it just as much as you, but for the short term we are focusing on the single player career mode, various driving events, fixing bugs, and creating more content. It is feasible that we could implement local and/or same PC multiplayer in the interim.\nAlso, the possibilities extend beyond land vehicles. Users in our community have already made planes and helicopters that fly purely with the existing vehicle aerodynamic physics, with no cheating whatsoever. BeamNG can simulate aircraft in a very authentic way due to its soft-body physics. All the flex that happens to a real plane's airframe arises naturally in BeamNG, and the consequences of excessive stress are also modeled. Fly too fast and your wings will start to bend and rip off. The potential for the BeamNG physics engine is huge.Alpha Access Features All future updates to BeamNG.drive included for free (alpha, beta), also including the final game\nSoft-body physics sandbox\n19 detailed, customizable, destructible vehicles, with more to come\n10 terrains to explore and drive across, with more to come\nFrequent updates adding terrains, vehicles, features, gameplay, and bug fixes\nFull modding and content creation capabilities - make maps and vehicles, and script gameplay\nUse the built-in terrain editor and any 3D modeling, image editing, and text editing software\nOnline authentication is only necessary to update; the game itself does not need an internet connection to run.Alpha TestersUsers that already entered the alpha testing via our website can get a free Steam key.Our goalsOur main focus is on how things move rather than how things look on the screen. We aim to bring our expertise in real time soft-body physics and soft-body physics model design to the forefront of game physics simulation, making available the technology and know-how to as a wide an audience as possible. To achieve this, we are designing the engine and corresponding assets, so as to be independent of the underlying game engine and operating system.\nRight now the physics engine is running on a multicore CPU configuration, but we are also in the process of supporting GPUs via OpenCL.Our missionTo have realistic, accurate, destructible, and malleable physics everywhere. To make anything possible.More Feedback\nMore Feedback can be found there: http://www.beamng.com/content/119-FeedbackContact UsYou can get in touch with us in several ways:\nUse our forums: http://www.beamng.com/forum/\nVia email: http://www.beamng.com/contactus/ or support@beamng.com\nFollow us on Twitter: http://twitter.com/beamng\nSubscribe to our YouTube channel: http://youtube.com/user/beamng\nVisit our Facebook page: http://facebook.com/BeamNGPhysics","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SureHit Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":611184,"name":"I Am Fish","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/deb/debed1495adeac69fd5f0be501ecae35.jpg","description":"I Am Fish is a charming, physics-based adventure starring four intrepid fish friends, forcibly separated from their home in a pet shop fish tank. Over the course of the game you join them as they swim, fly, roll and chomp their way to the open ocean from the far-flung corners of Barnardshire (the smallest county in England) in their bid for freedom and to re-unite once again.\n\nFINTASTIC FRIENDS\nMeet our heroes! Goldfish - cheerful, brave, and adventurous, a natural born swimmer! Pufferfish – a little slow but kind-hearted who can also puff up into a ball and roll across land. Piranha - wild, chaotic, loud, unpredictable, and loves to bite - obviously. Flying Fish – a little aloof at times but a real softy at heart, with the ability to glide through the air! These plucky heroes will leave no bowl unturned, putting their heart and shoal into the mission to re-unite!\n\nNO NEED TO BE A BRAIN STURGEON\nSwim, roll, glide, chomp, flip flop, inflate, fly and bite your way through enthralling challenges. A simple, intuitive control scheme leaves no excuses should your fish perish leaving you feeling very gill-ty.\n\nTHINK OUTSIDE THE BOWL\nWith its idyllic coastline and quaint villages Barnardshire might seem like a perfect slice of quintessential tranquility, but to our aquatic adventurers it’s alive with the very real threats presented by crossing roads, traversing rooftops, dodging deep fat fryers, avoiding wildlife including the cantankerous locals, not to mention fragile fishbowls and the very real problem that fish can’t breathe out of water.\n\nLEAVE NO FISH BEHIND\nWe won’t dwell on grizzly fish death, but should your fish fall too far in whatever make-shift fishbowl it finds itself in, run out of air or generally flounder you will be popped back to the most recent checkpoint to refine your approach.\n\nSWIM TO FREEDOM\nOur four fin-tastic friends will be hitching rides in all manner of ad hoc water carriers including jars, mop buckets on wheels and the occasional pint glass. Cheers! Navigating in each make-shift aquatic vehicle poses its own unique challenge, but don’t worry, the relative freedom of open water is never too far away with inviting fountains, swimming pools and err, sewers full of hazardous materials to splash around in, before reaching the final goal – the shimmering, open ocean.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Bossa Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":37430,"name":"Sam & Max: 101 - Culture Shock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f3/8f33142dd75fdd6897efc06aadbe7aab.jpg","description":"Sam & Max 101: Culture Shock is an adventure quest game based on the Sam&Max comics series by Steven Purcell. It is the first game in the series to be developed by Telltale.\r\n\r\n###Plot\r\nThe main characters are a humanoid dog in a suit named Sam and a rabbit that goes by the name of Max. In their adventure, they will investigate the business of a former television star of the seventies, Brady Culture, that practices hypnosis.\r\n\r\nThe game begins with a call in the office of Sam and Max, but the phone is stolen by the rat named Jimmy Two-Teeth. Upon recovering it, it appears that the call was from the owner of a local shop. The protagonists start on their adventure.\r\n\r\n###Gameplay\r\nSam & Max is a point-and-click adventure game. The players navigate the world by clicking on a spot where they want to move the character. There are numerous hotspots in the game's world, with which the characters can interact with. When the cursor is placed over a hotspot, it gets highlighted, and its name will appear if their appearance turned on in the game's settings. \r\n\r\nYou solve puzzles during the game by logically interacting with the environment, participating in dialogue with over characters and collecting and using the items that you pick up and put in your inventory.\r\n\r\n###Style\r\nThe game's environment is heavily inspired by the 1970s. That can be seen in the clothing the characters wear, the guns and other items in the in-game world.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"}]},{"id":52370,"name":"Metal Gear Solid 2: Sons of Liberty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f1/0f105a3d3ba6225269c4a08b43ecbb73.jpg","description":"Since the incident on Shadow Moses Island, Metal Gear's top-secret technology has been leaked into the black market through the machinations of Revolver Ocelot. As a result, countless variations of Metal Gears have sprung up in every corner of the globe, making the weapon an increasingly common component of the armed forces of nuclear powers. \r\nIn the midst of all of this, Solid Snake, now a member of the anti-Metal Gear group \"Philanthropy,\" has learned that a new prototype Metal Gear has been developed by the U.S. Marines and is being transported in secret to an unknown destination. To learn more about this new machine, Snake must infiltrate the transport, disguised as a tanker, as it makes its way down the Hudson River. Just as Snake is about to begin his mission, however, the ship is seized by a mysterious and well-armed group bent on stealing the new Metal Gear for their own, nefarious purposes.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox"}]},{"id":19353,"name":"Starseed Pilgrim","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f2/2f2958ae87ac35e3442f3c87424a09b2.jpg","description":"The only driving force in this game is the curiosity of the player.\n\n###Unusual game\nIn the game there are no goals set explicitly and in advance, there are no videos telling anything, there are no monsters with which it is impossible not to fight. Nevertheless, something constantly happens in the game, and what happens in it causes both curiosity and consequences - especially, depending on what you do in the game.\n\nFor a start, you can go through a very briefing and then step into the world of the game to explore everything by yourself.\n\n###Unusual setting, unusual gameplay\nThe character of the game is a small man, alone in the whole space of the game. He is surrounded by blocks of different colors. Blocks grow like trees or duckweed on the surface of water. They can even be planted with seeds, just like plants are planted.\n\nEach seed after planting in the \"soil\" germinates differently. As a result, you are always surrounded by growing “bushes” or “fields” of blocks that live their own and special lives.\n\nIt seems that these seeds and blocks speak to you in their own language. Understanding this language and learning how to interact with “plants” is one of the tasks of the game and the condition for success in it.\n\nBut all this time, another dimension of the game world is slowly destroying the very ground on which you stand. It destroys your world, because everything in it rests on this soil.\n\n###Clear answers\nIt is noteworthy that everything that happens in the game has its own logic and can ultimately be clarified definitively and definitely. But until that happens, the player may feel ignorant and even confused.\n\n###Individuality\nThe path to understanding all of this is individual for each player and to a significant degree it is the player who determines what this path will be. The player determines this by his actions, his manner of reacting to what is happening in the game.\n\n###Goals and story\nThe game still has some goals that the player must achieve. But even the discovery of these goals is based on the fact that the game causes the player curiosity and in the process of satisfying this curiosity the player comes to both understanding the goal and the decision whether to reach this goal or not.\n\nThere is also a kind of plot, a story in the game. But this story is represented by fragments scattered throughout the game world.\n\n###Music to relieve\nTo relieve the tension that may arise from the difficulties of the game, music that accompanies the gameplay helps well.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Droqen","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10008,"name":"Sudden Strike 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b1/2b122424f91fb2cf1f0fbf54040bb3a2.jpg","description":"Sudden Strike 4 sends you off on three extensive campaigns set amongst the battlefields of World War II.\nCommanding the Allied, German or Soviet troops, you will lead over 100 different units into battle; like the German bomber Heinkel He111, the Russian T-34 tank, the British Hawker Typhoon fighter plane and the notorious German Panzerkampfwagen VI \"Tiger\".\nIn a first for the Sudden Strike series, you can now choose from one of nine individual commanders, such as George Patton or Bernard Montgomery, who will each allow for different approaches to combat and boast unique abilities.\nProve your strategic expertise in over 20 demanding singleplayer scenarios, the challenge-focused skirmish mode and the ultra-competitive multiplayer mode via Internet.\nExploit the weak spots of tanks, set up an ambush, occupy buildings with infantry, outmaneuver the enemy with clever positioning or unleash devastating air strikes – how you approach each mission is up to you!\nModding support with Steam Workshop integration.\nOptional „Pause & Play“ for more tactical depth","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":30789,"name":"The Curse of Monkey Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e86/e86e7462496702541843ac159ee0f31a.jpg","description":"I've sailed the seas from Trinidad to Tortuga and I've never seen anything like it! The engagement ring I gave Elaine has a terrible pirate curse on it. LeChuck is behind it, I'm sure. I should have known that nothing good could come out of that evil zombie's treasures. And if that's not bad enough, the clairvoyant I met in the mangrove swamp told me that if I am to break the curse and save Elaine, I will have to die!\nExcerpted from \"\"The Memoirs of Guybrush Threepwood: The Monkey Island Years\"\"\n- Third in the legendary Monkey Island series of graphic adventures\n- Film quality animation, voice, sound and music--the undead come to life before your very eyes!\n- Incredible high-resolution (640 x 480) graphics!\n- A barrel of gameplay--estimated 30-plus hours!\n- Two difficulty settings: regular and Mega-Monkey (now with more puzzley goodness)!\n- New and improved insults suitable for swordfights and other fun occasions!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16175,"name":"Labyronia RPG 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/189/1891e2b51da9426dd77bc2ee9657c731.jpg","description":"Following the events of the first installment, you return to the land of Labyronia, now in the cold grip of an evil force.  Roam the war torn lands.  You are the only one who can save the planet from destruction.  The epic sequel to the critically-acclaimed Labyronia. [/h2]\n10 years have passed since the hero of Labyronia fulfilled the Dark Prophecy.\nThis hero, Aeres, fought back against the four elemental beings, invading their strongholds across the land.  He helped dismantle the armies of monsters that had trampled the countryside and devastated the centers of human power.\nBacked into a corner, the elemental beings used their weapon of last resort: a power so bleak that it threatens to suck the life from the planet itself.\nThe world has gone cold, and dark. The sky is completely clouded over.  Dangerous ice wraiths attack any living being that comes near them. The elemental beings cloister in their fortresses, waiting to pick humanity's bones.\nIt's up to the last band of human survivors to find the power to reverse this apocalypse.  If they should fail, the world will be left an eternal frozen wasteland.\nKey features -\nPartly non-linear progression in a large and original world.\nThe Cue system encourages exploration. Find abnormalities to obtain skills, and challenge yourself to collect all the Cues!\nStrategic Boss battles, and smooth combat system with Yanfly's battle engine.\nRandom battles are limited to the world map (and even there it's possible to avoid them usually.) Otherwise, all enemies are visible.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Labyrinthine","platforms":[{"id":0,"name":"PC"}]},{"id":3627,"name":"Road Not Taken","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f37/f37a6ef6d58c92b21410861734d61c69.jpeg","description":"Road Not Taken is an indie isometric adventure game developed by Spry Fox. \n\n###Plot\nThe game's story is a new spin on a poem of the same name by Robert Frost. It tells about a stranger who stands by a fork in the road. The main character takes one path, comforting himself that he'll take another route the other day. Yet he knows that it is highly unlikely that such an opportunity will be available for the protagonist. \n\n###Gameplay\nYou play as a forester, that arrives at a distant snowy town. Your objective is to save the children, that got lost in the forest. You have a fifteen-year career in front of you, which each level being one year. The forest surrounding you changes every year.\n\nIn order to save the children, you have to take them back to their mothers. To progress deeper into the forest, the players have to combine several trees, rocks or sometimes even deer. Each passage through the forest has its own requirements. \n\nCarrying the objects requires energy. There are predators and spirits in the forest. Every one of them can take some bit of energy away from you. \n\nA crafting system is present in the game. As you get to know more recipes, the world around you gets to be more logical.\n\nThe player can interact with the characters in the time. If the player shares items, that were found on the levels, these characters can reward them with special loot.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spry Fox","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":249,"name":"Ys Origin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/514/514612786420f45c8a760342320a07cc.jpg","description":"700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however, erecting a massive tower in pursuit. The battle that raged upon the ground had begun ascending for a second round up above.\nOne day, amidst this turmoil, the Goddesses stole away into the night, vanishing from Ys altogether. And there's only one place they could have gone: the Devil's Tower.\nA search party of knights and sorcerers was hastily formed and dispatched to the surface in hopes of retrieving these runaway deities. Among its members were apprentice knight Yunica Tovah and troubled sorcerer Hugo Fact.\nThis is their story. Or at least, it's how each of them remembers it.\nExpanding upon the gameplay elements introduced in Ys: The Ark of Napishtim and further developed in Ys: The Oath in Felghana, Ys Origin perfects the formula by adding different styles of play and new features never before seen in the Ys universe. Best described as an arcade-like platformer RPG with Metroidvania elements and a complex, multi-faceted narrative, Ys Origin is the perfect mix of action, exploration and story. Screen-filling bosses with complex AI, unique platforming elements, innovative puzzles and a deeply involving mystery await within the wildly varied confines of this classic Ys dungeon.\nCome see how long you can last in the Devil's Tower...Key Features:Officially available in English for the very first time.\nThree unique playable characters in story mode, with additional variations (and characters?) unlockable through other modes.\nFive difficulty levels ranging from \"Very Easy\" for casual players to \"Nightmare\" for true Ys masters.\nUnlockable \"Time Attack\" and \"Boss Rush\" modes for anyone looking to show off his/her boss-taming abilities.\nUnlockable Arena Mode pits players against massive hordes of enemies for unique gameplay rewards.\nOver 40 unique Steam Achievements, Steam Cloud support and hundreds of highly competitive leaderboards.\nMinutely configurable high-resolution graphics with true widescreen support.\nFully adjustable controls supporting virtually any USB gamepad, as well as a standard keyboard and mouse setup.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"DotEmu","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":13533,"name":"Mothergunship","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/254/25460145a8ad267b1c8f91345e5c8092.jpg","description":"Our mission is clear, our determination strong, and our guns are very, very big. Terrible Posture Games, in partnership with Grip Digital, is proud to announce MOTHERGUNSHIP, a bullet-hell FPS hybrid for PC and consoles that pits you, Earth’s last hope, against the armadas of data-hoarding robotic alien invaders.\nMOTHERGUNSHIP mixes bullet-hell intensity with the shooting, gun customization, and traversal of the first-person genre. Fight your way through the alien fleets, facing randomized enemy and level mayhem as you clear rooms and take out some of the biggest bosses seen in the FPS genre.\nFIGHT\nFace off against overwhelming odds in brutal, non-stop combat where thinking on your feet is the only way to survive. Dodge hundreds of bullets with unique FPS/Bullet-hell hybrid gameplay. Each ship hosts hordes of alien machines, deadly traps, and intimidating bosses, all set on preventing you from saving humanity. Go get ‘em.\nCRAFT\nTo take down the MOTHERGUNSHIP, you’ll need your very own personalized arsenal of destruction. Luckily, in MOTHERGUNSHIP you can create the gun of your dreams with one of the most modular gun-crafting systems ever seen in a videogame. Want to have twelve-barrel gun that shoots homing rockets? Or do you prefer a lightning shotgun? And what gun wouldn’t look better with a fishtank afixed to the top?  Go for it! The design of your destructive arsenal is in your hands.\nRESIST\nJoin the ranks of global resistance movement and take back Earth together with your friends. Fight together with a friend in a full CO-OP experience, or participate with the community while you work together to cut through the alien fleet and reach that ultimate goal – bringing down the MOTHERGUNSHIP.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Grip Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":51551,"name":"Stygian: Reign of the Old Ones","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f8/3f84564e93bea37d56f14f62db256bbb.jpg","description":"In Stygian: Reign of the Old Ones, the player journeys from a doomed Arkham into the depths of the Abyss. Create your own character based on 1920's archetypes and carve a path through a broken and mysterious world.\nYour desperate battle against forces beyond comprehension will haunt you until the end. Physical combat will be challenging, spellcasting will have dire consequences, and your sanity will be strained to the breaking point by unknown abominations. Sometimes the best solution will be to flee what lurks beyond the threshold.\nFeatures:\nA hand drawn 2D world reflecting Lovecraft's themes of cosmic horror and dread.\nEnemies, environments and storylines inspired by Lovecraft’s iconic original works. Take part in quests inspired by your favorite stories and see them play out according to your own decisions and role-playing style.\nChoose from 8 main character Archetypes, each with its own origin backstory and specialties.\nA host of weird companions will accompany you on your ill-starred journey: the lonely, antediluvian 'Outsider', a fallen soldier of the Great War reanimated by Herbert West, a psychic (and narcissistic) cat from Ulthar. Recruit these and other outlandish beings to your crew.\nYour character's Sanity and mental state will influence dialogue options. Mental illness comes with advantages as well as hindrances. Sometimes it pays to be mad in a world gone mad!\nStygian's Belief System determines how your characters cope with the warped reality of the new Arkham, as well as the rate at which they regenerate lost Sanity. Belief Systems also offer unique dialogue options, expanding the breadth of role-playing possibilities.\nA new kind of spell system which sometimes takes more than it gives. Being a master of the occult is not as simple as flinging colored missiles from your fingertips. The black magic of Stygian is potent but may cost you your mind, your health, and possibly even much more.\nStrategic, turn-based combat from a 2D perspective, similar to the classic Heroes of Might and Magic games.\nThe struggle in Stygian is not to save the world, for that battle is lost already. Pursue your own goals in these end times: salvation, vendetta, or perhaps something darker.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cultic Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":7477,"name":"Rusty Lake Roots","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ddf/ddf56cd075250439b3d9a37492dae0b0.jpg","description":"James Vanderboom's life drastically changes when he plants a special seed in the garden of the house he has inherited. Expand your bloodline by unlocking portraits in the tree of life.\nRusty Lake: Roots is the second premium point-and-click adventure by Rusty Lake, the creators of the Cube Escape series and Rusty Lake Hotel.\nKey features:\nPick-up-and-play: easy to start but hard to put down\nUnique storyline: experience the beginning and end of characters' lives and build your own family tree\nMore than 33 levels: the biggest Rusty Lake game so far is filled with puzzles\nFull of suspense and atmosphere: switching from calm to very dark moments\nImmersive soundtrack: each level has its own theme song and variations\nAchievements: the tree has more secrets to unravel","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rusty Lake","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":6608,"name":"Westerado: Double Barreled","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/168/16840899b589ffde76915c3d95417b31.jpg","description":"Westerado: Double Barreled is Ostrich Banditos’ homage to Spaghetti Westerns about dirty pasts, consequences and taking a hold of your future. When your family is murdered by a mysterious desperado, you set out into the world to take revenge. Take control of your own fate and that of others, all using your trusty shooting iron. If words aren’t enough to persuade a character, draw your revolver and see what happens. You can shoot whomever, whenever you like. Be an outlaw or a saint, explore the open world, meet a varied cast of characters and decide how you want your revenge story to unfold.\nFeatures\nHunt down the desperado that killed your family and explore the stories of the world’s inhabitants. Discover all the possibilities and create a unique story each time you play.\nRide, shoot, and threaten your way through an expansive Wild West, expanded with all-new environments like the forest, desert and mountains.\nSoak up the western sun in a world built out of the grittiest pixels this side of Montezuma, and an expanded western soundtrack, featuring live recorded banjos, trumpets, saloon pianos and more!\nGUNS! Let your gun do the talking, by drawing and cocking it during any conversation. Shoot whoever you want, whenever you want, no exceptions. Pick your favorite weapon, whether it’s a revolver, shotgun or even a tomahawk.\nMultiple save slots to keep your progress across sessions and explore the splitting narrative.\nTechnical upgrades to include full controller support and 720p/1080p display resolutions.[/i]","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ostrich Banditos","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13482,"name":"Dungeons & Dragons Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9e/a9e717295c03af6550b66163ed3cc6f3.jpg","description":"Enter a world of danger and adventure with Dungeons & Dragons Online®, the free, award-winning, massively-multiplayer online game based on the beloved RPG that started it all.Key Features:Experience the Best Action Combat of Any Free MMORPG: Take control in combat and make every move count.  Leap past deadly blade traps or dodge poison arrows.  Whether fighter, sorcerer, or rogue, every move is your move as you block, tumble, cleave, and more on your way to glory and power.\nPlay for Free: Experience the action, danger, and intrigue of Dungeons & Dragons Online for free! Play as much as you want all the way to level 20.\nExciting Adventures with Iconic D&D Monsters: Come face-to-face with a dragon, defend your sanity from a Mindflayer, or get roasted by a Beholder as you delve into the deepest and most treacherous dungeons ever imagined.  Test your skill against a monstrous number of iconic Dungeons & Dragons foes in your pursuit of power and glory.\nAdventure alone or with friends from all over the world: Set out on an adventure of your own, create a group with friends or join a guild to meet new people.\nCreate a Unique Hero: Craft the characters you’ve always wanted to play with deep character advancement that offers nearly infinite possibilities.  With 8 races, 13 classes and nearly limitless traits and character abilities, it’s possible that no two characters may ever be the same!\nA Rich & Beautiful World: Explore the sun-drenched, magic-powered city of Stormreach, the gathering place for countless DDO players from around the world any time of day or night. See the iconic locations of Dungeons & Dragons brought to life like never before! The world of DDO is yours for the taking.\nEnhance Your Experience: Shop in the in-game store for extra quests, powerful gear, experience boosts, buffs, and more.  You choose how little or how much you spend.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Standing Stone Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11890,"name":"N++ (NPLUSPLUS)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f9/6f9348edd93d9c25d6cc4ed2659703a6.jpg","description":"N++ is a fast-paced, momentum-based platformer about darting around obstacles, narrowly evading enemies and collecting gold in a beautiful minimalist landscape. It’s the first N game on PC since 2004 and we’ve spent those 12 years perfecting the platformer.\nN++ is all about using your momentum to complete levels and get high scores, but in this sci-fi world, there’s a slew of inadvertently homicidal enemy robots trying to prevent you from completing your goal.\nThrough the hand-crafted (NOT procedurally generated) levels, you’ll experience platforming at its most intense. Using only your fluid movement, you need to ‘solve’ each level and get to the exit.\nIn addition to the lengthy and challenging single player campaign, we’ve packed a ton of features into this one last entry in the N series including:\n-4,340 hand-made levels\n-Custom Levels, Level Editor & Global Level Sharing\n-Leaderboards and replays for every level (even the ones you make)\n-Local Co-op Mode (up to 4 players)\n-Local Competitive Mode (up to 4 Players)\n-Hardcore Mode, an intense single-player challenge which only the best ninjas will survive\n-Intense, hidden Secret challenges to discover\n-63 tracks by top electronic artists\n-119 different color palettes let you customize the game’s look and keep it fresh every time you play\n-and more!\nPlay a little, or a lot -- there's no skill ceiling, so you can always get better and better. N++ is a game that has enough bite-sized gameplay to last you a lifetime.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Metanet Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21285,"name":"HeXen: Beyond Heretic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fa/0fa357fe0160e2b592a6fafff0e6683e.jpg","description":"While you were battling the evil forces of D'Sparil, the other Serpent Riders were busy sowing the seeds of destruction in other dimensions. One such dimension is the decaying world where Hexen takes place. A world littered with the mangled corpses of nonbelievers and inhabited by the undead followers that executed them. Only three humans &endash a warrior, a mage and a cleric &endash have escaped the leaders' vicious spell. Now these brave souls have sworn to crush the evil regime that threatens to destroy the world forever. Separated upon entering the mystical portal, the three are forced to attempt on their own what they had hoped to do together: find Korax's stronghold, destroy him and restore order in the physical world.\nBecome one of 3 heroes. Wield superhuman powers and lethal weapons.\nWalk. Run. Fly. Look all around. Inflict serious pain.\nPillage your way through earthquakes, crumbling bridges and fog.\nTrack down powerful artifacts and cast wicked spells.\nFour sick individuals can wreak havoc via network, two by modem.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Raven Software","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":15272,"name":"System Shock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e98/e98c259aeac26d1ef5c1affc670eec83.jpg","description":"After two decades, Nightdive Studios is rebooting and re-imagining the original System Shock. We will keep the new game true to the classic experience, keeping all the things you loved while giving today's gamers the modern look and feel expected from a AAA title.\nHelp fund this game!\nWith the help of members of the original team, including the original Voice Actor of SHODAN, Terri Brosius, Citadel Station has never been more immersive or terrifying!\n“When you’re working on a game, you tend not to think about how people will feel about it 20 years later – or if people will even remember it! The announcement of the System Shock update from Nightdive (and the upcoming System Shock 3 I’m working on) it’s apparent that not only do people remember, they care very deeply about the game. Back when we were working on the original, we wanted to make a simulation-based game that would empower players to tell their own stories through their playstyle choices – an idea that’s still totally relevant today. I’ve long said that if you updated the graphics, sound and UI on System Shock you’d have something that competes directly with any game on the market today. Now the Nightdive folks are doing that update and I’m confident my prediction will be validated. SHODAN demands that you support this so we can all find out.” --Warren Spector, OtherSide Entertainment. Producer on the original System Shock.\nYou're a renowned hacker, the most notorious cyberspace thief in the corporate world. Caught during a risky break-in, you become indentured to a greedy TriOptimum executive. After six months in a healing coma, you awaken to the twisted aftermath of a terrible disaster. Where are the surgeons? Why is the station in such disrepair? Slowly, the chilling realization that something is very wrong creeps over you. Once a prime corporate research facility, Citadel Station now teems with mindless cyborgs, robots and terribly mutated beings, all programmed to serve SHODAN, a ruthless A.I. There's scarcely time to think before it unleashes the first terror...\n\n“The crew at Nightdive heroically brought the original versions of System Shock and System Shock 2 back into circulation. They have thrived as a new audience has rediscovered these classics.  Now Nightdive is remastering the original System Shock to bring it up to date on modern PC’s - with fully updated visuals, audio and a modern interface – making it dramatically more accessible to modern gamers.  It’s quite wonderful to see a franchise that Warren and I helped create get such loving care.\" --Paul Neurath, Founder of OtherSide Entertainment. Co-founder of Looking Glass Studios.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Nightdive Studios","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":4853,"name":"God of War: Ghost of Sparta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c2/5c2aef36106ee4751cdfda8fd408aaf5.jpg","description":"Set in the realm of Greek mythology, God of War®: Ghost of Sparta is a single-player game that allows players to take on the powerful role of Spartan warrior Kratos.  This new adventure picks up after God of War® concludes, telling the story of Kratos’ ascension to power as the God of War.  In his quest to rid himself of the nightmares that haunt him, Kratos must embark on a journey that will reveal the origins of lost worlds, and finally answer long-awaited questions about his dark past.  Armed with the deadly chained Blades of Athena, he will have to overcome armies of mythological monsters, legions of undead soldiers, and amazingly dangerous and brutal landscapes throughout his merciless quest.\n© Sony Computer Entertainment America LLC.  God of War is a registered trademark of Sony Computer Entertainment America LLC.  Developed by Ready At Dawn Studios, LLC.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other terms and conditions located at http://www.us.playstation.com/support/useragreements.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 portable systems that are associated with the purchasing account.\nMemory Stick Duo™ storage media may be required for download.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ready at Dawn Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"}]},{"id":21229,"name":"Flatout 3: Chaos & Destruction","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/050/050946c00aa9c48111af5e3c2469b209.jpg","description":"FlatOut 3: Chaos & Destruction brings a new dimension to high speed destruction racing.\nFeel the adrenaline pulse through your veins as you barrel through insane race tracks against monster trucks, race cars, off road vehicles and much more.\nFlatOut 3: Chaos & Destruction is demolition racing at its extreme. Real world physics with 9 different game modes, and over 47 different vehicles available. Players may choose to race, smash and destroy their opponents in a wide variety of online and offline options.\nLay waste to farm houses, fences, and then wreak havoc in a Detroit suburb, race up the walls in giant waste disposal sewers. Let the chaos begin as you race through over 60 different tracks, narrowly avoiding wrecking balls, Double Decker buses and much more.\nCreate as much destruction in the all new monster tuck mode.\nChoose from 20 different playable characters, select your weapon from the 47 available vehicles! Create as much Chaos & Destruction! In stuntman mode anarchy rules create havoc with some rag doll fun.\nFlatOut 3: Chaos & Destruction offers more vehicles, game modes and different ways to demolish your opponents before crossing the finish line.\nKey features:\n\nPhysics Engine capable of delivering over 20,000 fully destructible objects on every track\n47 vehicles with everything from muscle cars, monster trucks, tanks, bulldozers and more\n9 game modes plus challenge mode that incorporates all game modes into one 62 track race\n10 racing environments with 62 different race tracks\n3 stunt mode environments with 12 stunt tracks\n9 Destruction Derby Battle environments\nAll new Monster Truck, Nightshift, Off Road, and Speed modes\n8 multiplayer modes with support for up to 16 players\nForce Feedback support for racing wheels\nLarger Destruction Derbies with 24 players\nComplete Chaos in Off-Road Mode\nComplete Destruction in All new Monster Truck Mode\nHead to Head in nightmarish, thunderous, rainy, fog weather in Night Shift Mode","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Team 6 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16777,"name":"BIT.TRIP BEAT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f75/f75aabb4cf9d6897b428356871d51566.jpg","description":"BIT.TRIP BEAT is an arcade rhythm game developed by Gaijin Games. \n\n###Art style\nThe game is heavily inspired by the first games for the Atari 2600. It features the same blocky visuals, a pale color palette, and a large number of explosions.\n\n###Gameplay\nBIT.TRIP BEAT is very similar to Pong and does not feature much plot. The players control a small platform that is used to kick off the beats that come from the right side of the screen. The game initially released for the Nintendo Wii, so its gameplay is well-adapted for Wii Remote. The players can control the platform by tilting the remote. \n\nEach level consists of three phases: Transition, Descent, and Growth. Each of them has a difficulty increase, compared to the previous ones. There is a boss fight at the end of each phase. The only way to complete a level is to kill the boss or to get a game over.\n\nThe game's soundtrack is created by the noise that the beats make upon hitting the platform. Each deflected beat gets the player several points. The beats move in various patterns making it hard to hit them back. There are also several special types of beats present in the game, such as the beats that pause on the game field for several seconds. \n\n###Multiplayer\nBIT.TRIP BEAT features a multiplayer mode for two to four players. More platforms appear on the screen as more players jump into the game. In the four-player mode, the platform size gets a bit smaller to make the game less easy.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":187,"name":"NeuroVoider","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78f/78fbf5f53e62e0b37764f17fa14609e2.jpg","description":"Digital Deluxe Edition\nAbout the GameNeuroVoider* is a twin-stick shooter RPG set in a cyber futuristic world about brains shooting around evil robots with nuclear rocket launchers. Battle through the horde of vigilant robots, boost your character with the smoking remains of your victims, and defeat the master NeuroVoider to end this eternal war. Play it coop with up to 4 friends, or go alone in an adventure of hack'n'slash rampage, with a pinch of rogue-lite, and some permadeath.\n* may contain explosions.\nFeatures\nAction packed top-down shooting. May include explosions.\nLocal multiplayer up to 4 players. Total coop rampage.\nProcedurally generated content and hazards. Hope you don't mind a few game overs.\n8736 unique enemies to blow up. Yes, we counted.\nTons of loot to customize your character with. Explode your foes with that \"double twin-plasma shotgun of father doom\" they've just dropped.\nGigantic bosses to challenge your bullet dodging skills. Chances are that they don't fit on your 4K monitor.\nPowerful dark synth music by Dan Terminus. May your ears survive the beat.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14385,"name":"Godot Engine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d3/3d30645edf52e741ab158590635da7e9.jpg","description":"<h3>2D and 3D cross-platform game engine</h3><br/>Godot Engine is a feature-packed, cross-platform game engine to <strong>create 2D and 3D games</strong> from a unified interface. It provides a comprehensive set of common tools, so that you can focus on making games without having to reinvent the wheel. Games can be exported in one click to a number of platforms, including the major desktop platforms (Linux, macOS, Windows) as well as mobile (Android, iOS), web-based (HTML5) platforms and consoles (Switch, PS4 and Xbox One - via thirdparty publishers).<h3>Free, open source and community-driven</h3><br/>Godot is completely free and open source under the very permissive MIT license. No strings attached, no royalties, nothing. <strong>Your game is yours</strong> down to the last line of engine code. Godot's development is fully independent and community-driven, empowering you to help shape the engine to match your expectations. It is supported by the Software Freedom Conservancy not-for-profit.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Godot Engine","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":43050,"name":"The Witcher 3: Wild Hunt – Hearts of Stone","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c19/c193180583c34e5753a1aaf15a586761.jpg","description":"Hearts of Stone is the first official expansion pack for The Witcher 3: Wild Hunt—an award-winning role-playing game set in a vast fantasy open world. Become Geralt of Rivia, a professional monster slayer hired to defeat a ruthless bandit captain, Olgierd von Everec, a man who possesses the power of immortality. Hearts of Stone packs over 10 hours of new adventures, introducing new characters, powerful monsters, unique romance and a brand new storyline shaped by your choices.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":181,"name":"Hearthstone","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1db/1dbc3d0c9de2709e21326cdcb91468ae.jpg","description":"Blizzard’s award-winning card battler – experience the magic, mischief and mayhem with your friends.\nRequires an Internet connection and iPhone 4S, iPod touch 5th Generation, iPad 2 or newer.\nDECEPTIVELY SIMPLE.  INSANELY FUN.\nPick up your cards and throw down the gauntlet! In Hearthstone, you play the hero in a fast-paced, whimsical card game of cunning strategy. In minutes, you’ll be unleashing powerful cards to sling spells, summon minions, and seize control of an ever-shifting battlefield.  Whether it’s your first card game or you’re an experienced pro, the depth and charm of Hearthstone will draw you in.\n\nJUMP RIGHT IN: Fun introductory missions bring you into the world of Hearthstone’s intuitive gameplay.\n\nBUILD YOUR DECK:  With hundreds of additional cards to win and craft - your collection grows with you.\nHONE YOUR SKILLS:  Play in practice matches against computer-controlled heroes of the Warcraft universe.  Thrall, Uther, Gul’dan - they’re all here!\n\nCOLLECTION TRAVELS WITH YOU: Your card collection is linked to your Battle.net account - enabling you to switch your play between tablet and desktop with ease.\n\nAND FIGHT FOR GLORY:  When you’re ready, step into the Arena and duel other players for the chance to win awesome prizes!\nPost feedback about the game in our forums:\nhttp://us.battle.net/hearthstone/en/forum/13619661/\nLanguages Supported:\n* English\n* Français\n* Deutsch\n* Español (Latinoamérica)\n* Español (Europa)\n* Italiano\n* Português\n* Polski\n* Русский (Russian)\n* 한국어 (Korean)\n* 简体中文 (Simplified Chinese)\n* 繁體中文 (Traditional Chinese)\n* 日本語 (Japanese)\n* ไทย (Thai)\n© 2017 Blizzard Entertainment, Inc. All rights reserved. Hearthstone, Battle.net and Blizzard Entertainment are trademarks or registered trademarks of Blizzard Entertainment, Inc., in the U.S., and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":15615,"name":"Viridi","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/beb/beb0ccb2a90f21f3f0f94f919f27e09e.jpg","description":"Nurture a small pot of succulents that grow in real time.\nViridi is a safe haven, a place you can return to for a moment of peace and quiet whenever you need it.\nLeave Viridi open in a second window to keep you company while you work, or check in on your plants as a meditative moment every night. While not fully realistic (they're very forgiving), your succulents will require some maintenance and can die from over- or under-watering. Name your favorite plants, give them special care and attention, and they might even flower for you.\nViridi is free to try and comes with your choice of plant assortments. If you think it has a place in your life, you can buy your favorite plants from the in-game nursery for just a few cents a piece. Remember to visit the nursery occasionally for the weekly free seeding!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ice Water Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":2416,"name":"Pix the Cat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cc/4cc3adec03897d376924497b340745eb.jpg","description":"Symbiosys of Pac Man and Snake, something that unites values ​​of the above mentioned games. And also something more.\n\nThe game has four modes.\n\n###THE ARCADE\nA crazy race in which every movement matters - reflexes work here. You can compete with yourself by running a double - your own best achievement. Success in this mode is the key to other modes, but not only. There are enough other surprises in the game.\n\n###THE NOSTALGIA\nThis mode is a \"Snake\" game, but with a few unexpected twists and turns. 70 levels that cause not only nostalgia (and they very convincingly cause it!), But also a strong interest.\n\n###THE LABORATORY\n100 puzzles that can be solved for any length of time. The result of the solution is assessed higher or lower, depending on the number of moves required for the solution.\n\n###THE ARENA\nThis is not a race or a puzzle, it's a fight. We need to collect ammunition, and then throw it into rivals, lay mines and take into account the ghosts of dead enemies.\n\nIn the game there are both single mode and multiplayer.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":59636,"name":"Desert Child","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/883/883848dea222b0a76ea5ddcb11c598d6.jpg","description":"You’re broke, you’re hungry, and your only friends are a vintage hoverbike and a bowl of ramen noodles.\nIn Desert Child, you are a young and talented hoverbike racer who needs to figure out how you can scrape enough cash together through racing and odd jobs to punch your one way ticket to the Red Planet to enter the biggest race in the universe, the Grand Prix.\nThe world as we know it is slowly starting to become inhabitable, and many people on Earth have moved to Mars for a better quality of life, thanks to a government subsidy that assisted in relocating citizens by providing affordable passage. After several years of running this program, the government announces that in two weeks, tickets to Mars would go up in price, making the exodus to the Red Planet unobtainable for regular citizens.\nYou’ll deliver pizzas, collect gun parts, hunt bounties, and make some fans along the way.  In between races, you’ll explore colorful cities where you can repair and upgrade your bike, dine on the local cuisine, and fight your way through gangsters, bounty hunters, and all sorts of interesting characters, just so that you can have a decent meal and keep your bike running.\nNothing’s free in Desert Child.\nFeatures Hunt bounties, deliver pizzas, throw races - do anything you can to earn cash\nExplore a pixel-art solar system inspired by Cowboy Bebop, Akira and Redline\nCustomize your beloved bike with Guns, Amplifiers and shameless advertising\nDine on a range of interplanetary cuisine with sweet buffs to help you win\nMaster deep combat and racing mechanics and define your own style\nRace, shoot, and get better! Designed for replayability, with secrets that keep you coming back\nChill to a original lo-fi hip-hop soundtrack\nChallenge your friends through local multiplayer","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Akupara Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":32126,"name":"Louvre: The Final Curse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e8/2e8063435066d63339f137fc71a73f4e.jpg","description":"The most terrifying conspiracy has travelled through the centuries and you have been chosen to go back in time to prevent disaster! You are a Secret Service Agent and you have been sent against your will into the very depths of the ancient Louvre castle. Your mission is to wage battle against a mysterious Tempilar brotherhood, thirsty for chaos. You may never return to the 21st century... You are plunged into a 3D world that is astoundingly realistic and filled with historical characters. You will discover a castle that has never been seen before, accurately reconstructed with the help of the Louvre Museum.\nWhat you need in this mentally stimulating adventure are action and reflection. You must uncover the clues and cleverly question the game's characters.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14589,"name":"Windward","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fef/fefb9cd7cedb7bf1c2e69f159edb1272.jpg","description":"Windward is a game in which the player takes the role of a sailing ship captain.\n\n###Gameplay\nThe game is set in the randomized, procedurally generated seas that serve as an open-world sandbox. The player controls a trading cog from the top-down view. He or she navigates the vessel through the seas, uncovers new areas and completes quests and tasks. Most of the tasks are simple and require the player to travel between cities. The ship can carry passengers and cargo to gain money and to fight pirates to gain influence. The goal is to profit from the trade, eventually to join one of the factions and help it to assume control over the new ports. There's no semblance of a plot.\n\n###Ship management\nThe player can upgrade his or her ship to expand the cargo space to earn more money, as well as to increase its firepower and stamina to withstand battles against pirates. The combat system in Windward is simple. When the player's ship approaches the enemy, it fires its cannons. The player has no direct control over the cannons. However, he or she can manipulate the ship so that to take a better position and lure the enemy into a trap.\n\nAs the player progresses and gathers more money, he or she can hire other ships to serve his or her faction. They can form fleets to attack and capture enemy cities. However, the player still only directly controls the original ship.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tasharen Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":61060,"name":"EXAPUNKS","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/162/16261b6dbb99af236fa28ada12e842f9.jpg","description":"The year is 1997. You used to be a hacker, but now you have the phage. You made a deal: one hack, one dose. There’s nothing left to lose… except your life.\nEXAPUNKS is the latest open-ended puzzle game from Zachtronics, the creators of Opus Magnum, SHENZHEN I/O, TIS-100, and more.\nREAD ZINES - Learn to hack from TRASH WORLD NEWS, the underground computer magazine. Tutorials, hacking tips, secret information, searing commentary— TRASH WORLD NEWS has you covered.\nWRITE VIRUSES - Program your EXAs (EXecution Agents) to tear through networks, replicate themselves, trash files, terminate other EXAs— and leave without a trace.\nHACK EVERYTHING - Hack banks, universities, factories, TV stations, highway signs, game consoles, the government... oh yeah, and your own body.\nSLACK OFF - Play ПАСЬЯНС, if you hack the server where it’s stored. Or play HACK*MATCH, if you hack the region lock on your Sawayama WonderDisc. Or create your own homebrew games for the TEC Redshift… if you hack the development kit.\nTAKE DOWN YOUR FRIENDS - Compete with your friends by running your programs directly against theirs in all-out hacker battles. Make every cycle count.\nCREATE YOUR OWN PUZZLES - Create your own networks to hack, and share them with the world on Steam Workshop.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Zachtronics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":22627,"name":"NBA Playgrounds","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/937/937d05e09ad9db991dce2f022f00bc4f.jpg","description":"NBA Playgrounds Update 1.1.0\nMany thanks for the continued support! We have the best players in the world and we are privileged to serve you.\nUpdate 1.1.0 for PC/Steam brings the heat! Challenge your friends, enemies and other players online. Game on! Friends matchmaking is here. With the new Challenge feature, you’ll be able to directly challenge another player to a game on the Playgrounds. All you have to do is agree on a code, open the online mode, switch to Challenges, enter that code and face each other.\nOther additions include a new connection manager, which monitors the connection of players during ranked matches and penalizes disconnections from games that are made to avoid losing. Quitters never prosper on the Playground.\nIn response to great feedback, we’ve also tweaked the entire shooting system from jump shots, to threes, to dunks, layups, and everything in-between. We’ve redone the timing, added a meter, and clarified the entire system. Keep those comments coming!\nAs a big thank you to our rabid fans, we’ve also added 15 new players, including Isaiah Thomas and Dennis Rodman! Those two all-stars and 13 others can be unlocked regularly through player packs, earned during the tournament or when leveling up your profile.\nThanks again for all your great feedback and support. Update 1.1.0 is the beginning. We’re only days from launch and we’re already making the game better thanks to your feedback. You rock!\nNew Features:\n-\tAdded: The Challenge Mode feature, which allows you to challenge other players to online matches\no\tYou can now switch between unranked challenges and ranked games in the online mode\no\tTo challenge another player, you must switch to the challenge mode in the online menu and define a challenge code. By default, your challenge code is your nickname, but you can change it to your own, personal code.  The person you are challenging must enter your code.\no\tIf you have been challenged, please enter your challenger’s code and press “Accept”.\no\tAll challenges are unranked and your ranking/ELO will be unaffected by the results of the challenge.\n-\tAdded: Toxicity system/Disconnection Manager, which penalizes players who abandon matches in any other way than surrendering\n-\tAdded: 5 new versions of Shaquille O´Neal in various teams from his career (Boston Celtics, Miami Heat, Phoenix Suns, Cleveland Cavaliers, Orlando Magic)\n-\tAdded: 15 new players join the roster\no\tThe following players were added: Dennis Rodman, Isaiah Thomas, Larry Bird, Giannis Antetokoumnpo, Kenny Smith, Gary Payton, Klay Thompson, Devin Booker, Tony Parker, Kemba Walker, Seth Curry, Tiny Archibald, John Starks, Tracy McGrady, Pete Maravich\n-\tAdded: A shot-meter was added to help finding the perfect timing for shots, dunks etc.\n-\tAdded: Steam Cloud Save support\n-\tAdded: Steam Big Picture keyboard management\nNotable Changes:\n-\tAdjusted: Shots were adjusted to make the system more accessible and unified throughout all variations\n-\tAdjusted: The steal action was adjusted further to better fit the intended gameplay\no\tIt is now possible to perform a steal action when behind an opponent\n-\tChanged: 3 pointers no longer fill lottery pick bar\n-\tIncreased: The difficulty of 3 pointers was increased\n-\tReduced: The number of steals required for the Las Vegas Challenge #2 was reduced to 10 (was 15)\n-\tReduced: The number of 3-pointers needed for the Paris Challenge #4 was reduced to 6 (was 7)\n-\tReduced: The number of 3-pointers needed for the London Challenge #1 was reduced to 6 (was 10)\n-\tReduced: The number of 3-pointers needed for the Las Vegas Challenge #3 was reduced to 8 (was 12)\n-\tReduced: The inbound time was reduced to adjust it to the overall style of the game\nNotable Fixes:\n-\tFixed: Issues related to the strength of the force feedback effects were addressed\nAbout the GameClassic NBA arcade action is back! Take your “A” game to the playground and beat the best in high-flying 2-on-2 basketball action. Practice your skills offline, play with up to three others on your PC, or take your talents online to posterize your opponents with acrobatic jams and ridiculous displays of skill.\n\n•  Easy to play, challenging to master\n•  Offline and Online Multiplayer\n•  Massive roster of current and retired NBA superstars\n•  All the official NBA teams\n•  Travel to playgrounds across the globe\n•  Hundreds of dunks and moves\n•  Collect all your favorite players\n•  Improve players over time\n•  Compete against the master of the playground himself - Allen Iverson\n•  Even more NBA superstars will be added post-launch\n\n“Up your game!”","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10404,"name":"Niffelheim","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3c/a3cffe57a6a62287f975079c1c4540d4.jpg","description":"Your avatar is a brave warrior who has fallen in battle. But instead of well-deserved peace in Asgard, his soul is trapped in the harsh world of Niffelheim. Survive in this hostile world, ransack the neighbor lands, explore dangerous dungeons and find your way to Valhalla\n\nSurvive in the Underworld\nWarriors remain warriors even after death. Set out on the path to the last challenge and prove yourself to the Gods. In life you were never frightened by the cold, darkness and death, and you won't fear now. make sure you have enough provision, defend yourself and unravel the mysteries of these lands.\n\nDo not be forgotten\nCrush anyone who dares to attack your lands. Each fallen enemy brings you closer to Asgard! Bones, teeth, fur - use all that you scavenge to craft weapons and armor. Build a fortress that will protect you from enemies and help you to destroy the attackers. The Death Priests will issue ultimatums. Will you bend to their will, or reject their orders and accept the battle against their dead minions?\n\nFind a way out\nCollect all the pieces of the portal to Asgard. But be careful - they are fiercely guarded by mighty giants, deadly spiders and hordes of undead.\n\nCraft\nBrew potions from mushrooms and slain beasts to become stronger. Cook the best dishes to feed all your friends. Prepare poison that will kill the most powerful troll.\n\nExplore ancient caves\nReach the very heart of the world to find powerful artefacts that will help you win the final battle. Discover what lies hidden in the darkness.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ellada Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":4098,"name":"Sly Cooper: Thieves in Time","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83d/83d046e6efe7a6d4a31a88177e2605b5.jpg","description":"Sly Cooper: Thieves in Time is a stealth-action platformer game developed by Sanzaru games. It is the fourth installment in the series and serves as a direct sequel to Sly 3: Honor Among Thieves.\n\n###Plot\nSly Cooper's friend Bentley notices that the pages of the Sly family clan manuscript turn blank. That means that someone is changing the history of the clan. Sly and his friends use a time machine that brings them back to feudal Japan in order to fix the timeline.\n\n###Gameplay\nLike the previous installments of the series, the game is a platformer with several stealth-action elements. The players control a set of characters, each of which has their own abilities and tasks to complete. It is possible to switch between the characters during the gameplay as the players see fit. \n\nUnlike the previous games, where Sly Cooper only unlocked new skills, in Thieves in Time, Sly is awarded new suits, that offer their own range of abilities. For example, using the archer suit allows Sly to shoot an arrow with a rope tied to it from his bow to get to hidden areas of the game.\n\nThere is a number of hidden treasures and masks in the game. Each treasure found is later added to the in-game collection and has its own description. Bottles with clues in them make a comeback in Thieves in Time. Upon finding them, the player can unlock a treasure safe which contains several bonuses within itself.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":3557,"name":"Divekick","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b65/b656dab19f80fe35bf0b121e283af521.jpg","description":"Divekick is the world’s first two-button fighting game. It distills the essence of the fighting game genre into just two buttons with no d-pad directional movement. Divekick’s focused gameplay demonstrates how much depth a single move actually has, and introduces (or reinforces) skills fundamental to the genre: mind games, spacing, timing, and quick reactions.\nAt Iron Galaxy we love fighting games. To the average fan, most of what makes them fun is hidden behind a never-ending series of input combinations that they have to memorize. That’s why Divekick has just two buttons: Dive (into the air) makes your character jump straight up. Kick causes your character to fly foot first at a downward angle. If you press Kick on the ground, you can jump away from your opponent. Utilizing these moves, the first hit will win the round, and the player that wins five rounds first wins the game. It’s pure adrenaline, awareness, and outsmarting your enemy. It’s a fighting game deconstructed into its purest form.\nKey Features\n14+ Completely unique and original characters, each with their own fighting style and special techniques.\nIncludes two extra playable characters: Fencer from Nidhogg and Johnny Gat from Saints Row!\nA story for every character in the game, including an intro, ending, and rival battles. You will be moved to tears!\nRanked and non-ranked GGPO-powered online multiplayer, the most trusted netcode in fighting games.  Includes ranking boards for each character, as well as overall.\nSingle player plus Local VS multiplayer for two players, with quick and easy button reconfiguration to accommodate a room full of unique personalities.\nFull Steamworks integration, including Big Picture Mode.\nCoverage\n\"How a two-button fighter became the toast of PAX East\" Penny Arcade\n\"Divekick is living the dream of diving and kicking. Yes, it is real.\" Kill Screen\n\"Divekick: The best (and only) two-button fighter.\" Shack News\n\"Divekick is the Smartest, Most Absurd Two-Button Fighting Game I've Ever Played\" Kotaku\n\"Divekick and Sportsfriends turns friends and strangers into rivals.\" Venture Beat\nIndieCade 2013\nDivekick has been selected for the IndieCade 2013 Festival which takes place from 10/3 - 10/6 in Los Angeles!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Iron Galaxy Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":349286,"name":"The Bard's Tale IV: Director's Cut","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d3/7d344d279e529e78b445ebdc4b573d0c.jpg","description":"Special Editions\nAbout the GameHidden in the shadows, an evil has waited patiently. Until now. Who will face the darkness if not you? A heroic adventure featuring 50+ hours of gameplay, 350 speaking parts, a Legacy Mode for returning fans, and over 100 pieces of incredible music!\nThe Director’s Cut brings more character customization options, new items, new enemies, revised UI, and a free expansion dungeon.Customize How You PlayDefine the way you play, using sliders on numerous options such as saving (including “save anywhere”), the mini-map, waypoint markers and many more. Whether you seek a hardcore challenge, a lighter experience, or something in-between, the choice is yours.Create the Hero You Want To BePlay as Bard, Fighter, Practitioner, and Rogue, each featuring 60-70 skills and collectively unlocking 21 unique classes. Build an array of characters to make every playthrough a unique experience.Craft your Party, Your WayStart your party with a single character, recruiting or creating new heroes to bolster your ranks. Build a party that suits your play style!An Adventure Around Every CornerExplore towns full of quest givers, fight your way through dark and deadly dungeons, and navigate beautiful rolling hills, dense forests, and icy wastes.Outsmart Evil Battle your enemies in dynamic, intuitive turn-based tactical combat,that rewards clever thinking. Use superior strategies, thoughtful positioning, and deadly combos to bring down your foes!Unlock the Secrets of the PastUnravel challenging mysteries. If your enemies don’t get you, the devious riddles and dangerous traps just might.The Blade’s TaleThe sense of discovery and mystery doesn’t stop with the environment. Gain ancient Elven weapons containing secrets which you’ll need to uncover by carefully examining them.New Song of Exploration “Strugglers’ Lament” Whether you just want to explore and fight or if you get stuck, simply play this song to skip mandatory puzzles.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"InXile Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":45455,"name":"Super Lucky's Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47a/47af3dafc5ec388085d3e7902b627b9c.jpg","description":"Gilly IslandSuper Lucky’s Tale, returns with an all-new chapter.  Join Lucky as he journeys to the tropical resort of Gilly Island where Lady Meowmalade has hijacked the festivities and is throwing the greatest (worst) party ever.  Help save the toursists' vacation before Meowmalade ruins their fun and ultimately destroys the Book of Ages!\nGuardian TrialsIt’s Training Day in Foxington! Lucky’s back in Guardian Trials, a dazzling new chapter for Super Lucky’s Tale. Together with a lively cast of coaches, Lucky’s big sister Lyra has set up Lucky with a series of insurmountable challenges that only a true Guardian could conquer. Join Lucky as he puzzles, burrows, leaps, and rolls through a hilariously retro bootcamp that’s tougher than any epic training montage!\nAbout the GameWelcome to Adventure!\n\nSuper Lucky’s Tale is a delightful, playground platformer for all ages that follows Lucky, the ever-optimistic, energetic, and lovable hero, on his quest to find his inner strength and help his sister rescue the Book of Ages from Jinx.  Jinx is the scheming and mysterious villain trying to reshape the world, but for what reason?\n\nAlong the way, encounter a hilarious supporting cast of friends and adversaries.  Lucky must confront the nefarious Kitty Litter, Jinx's mischievous kids - self-taught villains who might not be getting Jinx's plans quite right.  Lucky meets friends and allies along the way too.  He meets misplaced Yetis, Kookie Spookies, a village of farming worms, and other colorful friends inhabiting the Book of Ages.\n\nTest your skills with puzzles and nerve-wracking obstacle courses.  Explore hidden secrets of new worlds with Lucky's signature burrow move.  Dive into unpredictable foxholes, or try devilish side scrolling challenge levels to unlock additional rewards.\n\nHead back to the era of classic platformers with challenges players of all skill levels and all ages can enjoy.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"playful","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]}]