[{"id":22426,"name":"Crystals of Time","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af9/af98612287191a01fab15f634b49ec48.jpg","description":"Help Ashley Ford find her father and solve the mystery of the Three Oak Mansion.  A professional thief, Ashley has inherited this hobby from her father, who suddenly disappeared one night while he was trying to sneak into the Three Oak Mansion.\nYou start the game in front of a big, deserted house that hides a lot of secrets. You are carrying a mysterious crystal that will help you travel in time and find the clues that will lead to the end of the adventure.\nFeatures:\nOver 80 nice hand drawn scenes\n24 minigames and hidden object scenes\nclassic game play mechanics\natmoshperic sound track","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"exosyphen studios","platforms":[{"id":0,"name":"PC"}]},{"id":19442,"name":"Nikopol: Secrets of the Immortals","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c8/3c8f2296e623045051e5b9696f1fd1c7.jpg","description":"From the art and stories of famed graphic novelist and filmmaker Enki Bilal, and the studio created by adventure game legend Benoit Sokal comes Nikopol: Secrets of the Immortals.\nSet in France in the year 2023, the country is governed by a dictator who rules by religious absolute power. A mysterious ship shaped like a pyramid has just appeared in the sky and sent representatives to speak with the French government.\nAs Nikopol, you will find yourself in a suspenseful adventure to find your father and thwart a dangerous conspiracy. Entangled in political intrigue you're caught between two worlds, one of anarchy and one of immortality.\nA thrilling mental challenge in a rich futuristic universe inspired by famed graphic novelist Enki Bilal\nAs Nikopol, you must use cunning and logic to protect yourself from the Immortals' plans and thwart a dark conspiracy\nInteraction with 8 characters in 6 different environments, each made of several settings\nVisually stunning graphics\nImmersive gameplay\nClassic point and click interface","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"White Birds Productions","platforms":[{"id":0,"name":"PC"}]},{"id":1237,"name":"MOBIUS FINAL FANTASY","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bec/becda4123e31bfefb4c7ebcfec488f9c.jpeg","description":"A team of veteran developers of the FINAL FANTASY franchise, headed by venerated producer Yoshinori Kitase of FFVII and FFXIII fame, brings you MOBIUS FINAL FANTASY, a mobile RPG of unprecedented quality. The PC version comes 4K visuals and smooth 60 FPS gameplay. Enjoy a dramatic story and dynamic battles in the high-res!\n* Widescreen Resolution\nA new widescreen full HD 1920x1080 resolution available only on the PC.\nTake in the sights of Palamecia as you venture throughout its lands, with a wide field of view unobstructed by UI elements.\n* 4K Visuals\nMOBIUS FINAL FANTASY is also compatible with 4K resolution.\nYou'll be awed by the level of detail modeled in the game, from the intricate textures of metallic armor to the wisps of clouds up high in the sky.\n* Quality of Life Improvements\nUnbound from the limits of smartphones--no more stressing over battery life or storage space!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Square Enix","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":627521,"name":"Undecember","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d4/8d415666ba185218e7d9d72b6c431856.jpg","description":"Birth of the 13th Being, Evil God Serpens\nLight came from darkness, and that light split into 12 different divine beings.\nThe 12 beings that rose from the void shared their powers to create Traum and lived\npeacefully amongst their descendants. The descendants prospered under the blessings of\nthe 12 beings who were now worshipped as gods. But one day, an unexpected being,\nEvil God Serpens came into existence.\n\n\n\nMain Features\n\nUNCHANGED - The fun of Hack & Slash comes from annihilating countless enemies at once.\nAs a genre where character growth is tied to devastating enemies to obtain new items,\nthe focus was set upon the proposition to \"gain strength after wiping out enemies\" during development.\nStirring away from the typical growth system, players will be able to enjoy\ncompleting their own unique builds.\n\n\n\nUNDEFINED - Freedom to Select Various Combat Styles\nThere are no defined classes in UNDECEMBER.\nOnce a character is created after customization, players will be able to\nfreely change around gears and skills based on personal playstyle.\nBuilds are divided into Strength, Dexterity and Intelligence types, but there are no gear or combination restrictions.\nPlayers are free to cast magic with a sword or summon minions with a bow,\nor create any new unique builds of their own.\n\nUNLIMITED - Infinite Combination of Skills\nRunes are classified by Skill and Link Runes. Link Runes assist the effects of Skill Runes.\nThese Runes can be equipped in a separate space called the Rune Cast,\nand can be obtained through farming or by completing quests.\nEach Rune has levels and grades, which can be upgraded with\nmaterials obtained through farming.\n\nUNSTOPPABLE - Never-ending Choice of Contents\n- Acts: The main scenario of the game.\n- Chaos Dungeon: End-game content available after completing the main scenario.\n- Boss Raid: A cooperative content with up to 8 players.\n- Guild: Gather up to 50 members to gain exclusive benefits such as Guild Buffs.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"LINE Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16378,"name":"Deathtrap","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d86/d860ad3ffad8a9a580067185fc77d093.jpg","description":"Be clever, be quick – and show no mercy.\nBeyond the veil of this world, there is a chain of strongholds that were once built to keep the horrors of the void at bay. And now the monsters are returning from the depths to conquer and kill: only you can stop the monsters before they break through to the everyday world. Choose your hero and defend the silent forts: use, rebuild and improve those ancient traps and magical machines.\n\nDeathtrap is a Tower Defense game with strong action-RPG elements, a game of vicious tricks, killing machines, rotating blades and splattering blood.\nMain features\n\nA truly unique mixture of Tower Defense games and action-RPGs.\nYou and your traps against the whole otherworld: Defeat the hordes in an incredible single player campaign! You are on your own, so it's a good thing that you have deadly devices and powerful spells.\nTeam up with other heroes and save the world together...: Cooperative campaign with specially designed maps.\n…or you can just show your friends your true personality: Players can set against each other in this  game mode, where the defender prepares traps and defensive tactics, while the attacker has the ability to possess and control directly any creature in his or her army and employs skills to weaken the opponent or boost the invaders.\nBecome the Master of the Deathtrap Strongholds: The integrated Map Editor and Monster Editor allows the creation of the user generated content; moreover, you can also  share your deadly, cunning levels and challenging mini-campaigns with others.\nKnee-deep in blood: in the goriest Tower Defense game ever you can finally teach those monsters a savage lesson. Deathtrap gives you destructive spells and deadly mechanisms to smash, freeze, burn the creatures of nightmare, only to mention a few ways that can turn them into tiny, bloody pieces.\nRewards of curiosity: Find the hidden corners on the maps and hunt down the neutral creatures hiding away from the battle for exclusive loot; you can also solve rewarding side quests as well.\nBecome one of the specialists: Choose from 3 diverse classes (Mercenary, Sorceress, and Marksman); each class offers different tactics, skills and powers to dispose your enemies.\nWith experience comes wisdom – and brand new ways to deal with those annoying invaders: The extended and detailed character development offers you 100 levels to achieve and more than 50 Skills per class.\nWeapons of destruction have never been so much fun: fend off the invaders with 25 deadly traps and more than 150 trap upgrades, not to mention the very special upgrades, which are tied to challenging and fun achievements.\nEnter a truly grim fantasy netherworld: the Ink, the mysterious otherworld in the Incredible Adventures of Van Helsing games has hidden regions and ancient secrets; now can face what is waiting in those depths.\nGear up and stand your ground: The detailed equipment mechanics and the comprehensive loot system make your inventory highly customizable.\nA wide variety of horrors to defeat: Invaders come in 3 races and more than 40 different types; the countless combination of monster abilities will make the invading swarms even more colorful.\nMake your legendary weapons even more effective: Artifact crafting gives you new ways to experiment with lethal magical items.\nKing of the Maze: The leaderboards and the rank system lets you compete with other players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NeoCoreGames","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20358,"name":"Eternal Senia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6f/f6fedc26d76623f7768c4bb3ae5ac970.jpg","description":"I believe that gaming should not be anything complicated or diffcult,\nbut a relaxing and pleasure experience.\nTherefore, I designed this ARPG\nbattle system which requires no attack button to play.\nThe simplicity brings a fluent and interesting gaming experience.\nEternal Senia is the realization of this concept.\nI spent one year developing this game.\nIt is a game that can be easily enjoyed by any player.\n●Characters:\nHeroine Senia has both her name and the outlook from \"Ygnizem Seniar\"\nin Ragnarok Online.\nSenia's sister, Magaleta, also originates from a foe \"Magaleta\" in\nlighthalzen dungeon of Ragnarok Online.\nRagnarok Online is, to this day, still my favorite game of all time.\nEtneralSenia is a non-profit making game solely based on my enthusiasm for RO and gaming developing.\nI wish Eternal Senia can bring up the memory of classic\nMMORPG Ragnarok Online to all players who participated.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Holy Priest","platforms":[{"id":0,"name":"PC"}]},{"id":28595,"name":"Halo Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b6/4b6b7816862aebb9df22b5b5a5d71190.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Halo Wars is a strategy game based on the legendary Halo® universe.  Command entire armies of Spartans, Warthogs and more into combat as you join the crew of the “Spirit of Fire” to battle the alien Covenant.  Designed from the ground up for the Xbox 360, Halo Wars let you effortlessly command powerful armies in epic battles. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":17808,"name":"Thirty Flights of Loving","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1f/d1ff17c069307aa1d081906fa8b6687e.jpg","description":"Explore the world of Thirty Flights of Loving through a first-person short story. In this sequel to Gravity Bone, take a deep dive with high-flying schemers, lovelorn criminals, and more stray kittens than you can shake a stick at. Saddle up, gunslinger.\nFeaturing an original soundtrack by Chris Remo.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Blendo Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15854,"name":"STAR WARS - X-Wing Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e22/e223324f42af56a3b4f5dd93444f78ec.jpg","description":"A neutral family fights for its business - and its survival - and is swept up in the struggle against the encroaching Empire. You must defy the strong-arm tactics of a rival family who will stop at nothing to destroy your trading company. Ultimately, you will join the Rebel Alliance for a series of covert assignments and uncover information about the Empire's second Death Star project. The finale? You'll find yourself at the controls of the legendary Millennium Falcon , flying against the massive Imperial fleet in the Battle of Endor. Star Wars™: X-Wing Alliance™ puts you right in the middle of the epic Star Wars™ conflict - and takes space combat excitement to new heights.\r\nKey features:\r\nTake control of the \"fastest ship in the galaxy\" - the Millenium Falcon - as well as X-wings, A-wings, B-wings, Y-wings and Corellian transports\r\nJoin the massive assault on the fully operational second Death Star in the epic Battle of Endor\r\nFifty story-driven single player missions and flexible multi-player options\r\nWith new \"skirmish\" mode, you set your own mission parameters (number of ships, types of ships, targets, and more) to create customized single and multi-player conflicts","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Totally Games","platforms":[{"id":0,"name":"PC"}]},{"id":10304,"name":"Castle of Illusion","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/842/84296aef240c53460837fab66af83b12.jpg","description":"Mickey Mouse returns to star in Castle of Illusion, a fantastical reimagining of the Sega Genesis classic. With all-new HD graphics and gameplay, Castle of Illusion brings Mickey and his world to life in this magical Disney adventure!  When the evil witch Mizrabel kidnaps Minnie, it’s up to Mickey to brave the dangers of the Castle of Illusion to rescue Minnie.  Gather your courage and traverse enchanted forests, take on hordes of rebellious toys and navigate mazes of living books.  Play as Mickey and save Minnie from Mizrabel’s evil clutches!\nFeatures:\n- Play as Mickey Mouse in this reimagining of the classic Sega Genesis.\n- Experience a world of wonder, brought to life with all-new graphics and magical adventures.\n- Journey across five magical worlds filled with Mizrabel’s powerful minions.\n- Complete hidden challenges to customize Mickey with classic costumes!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":59348,"name":"Close To The Sun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e6/4e6a2e44f1181d72f1b12ac4613a9f39.jpg","description":"It’s 1897. Deep in international waters, the Helios stands still. Dark clouds loom overhead as unforgiving waves crash against the hull. Colossal effigies of gold, decorated with magnificent finery, stretch as far as the eye can see.\r\n\r\nBorn of Nikola Tesla’s vision, the Helios serves as a haven for the greatest scientific minds. An unbound utopia for research, independent from state and isolated from the gaze of society. Free to push the boundaries of matter and time.\r\n\r\nJournalist Rose Archer steps aboard the Helios in search of her sister Ada. She quickly discovers not all is as it seems. Grand halls stand empty. The stench of rotting flesh lingers in the air. Silence. A single word is painted across the entrance… QUARANTINE!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Storm in a Teacup","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":50919,"name":"Marie's Room","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c98/c98b6bad7444fc89b2ef9f9ded641c9f.jpg","description":"Marie's Room is a short-story exploration game about an unconventional friendship between two classmates, told through memories. You play as Kelsey, remembering Marie's room as it was 20 years ago. What happened to Marie and Kelsey all those years ago?\n“It was supposed to be simple. Get in, get out. I should have known better.”\nKelsey arrives in a seemingly empty room. She has only one goal, one purpose there -- getting Marie’s journal. But the room is not empty at all. In fact, it’s filled to the brim with memories, memories from 20 years ago, some of them which Kelsey would rather forget. Some of them, she cherishes to this day.\nJoin Kelsey in her trip down memory lane and uncover Marie and Kelsey’s past by exploring Marie’s room as it was all those years ago, or at least, how Kelsey remembers it.\nExplore their stories, linked to every object in the room. Open drawers and search Marie’s laptop for clues. Find out what secrets the room holds.\n“She once asked me, you know: ‘Don't you ever dream, Kelsey?’ And I said I don't. I don't dream, I plan. What I didn't tell her, was that I would not allow anyone to mess with those plans.”","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kenny Guillaume","platforms":[{"id":0,"name":"PC"}]},{"id":21305,"name":"Ampu-Tea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/125/125d7ae0eca068fdc5905c3ab0d84e23.jpg","description":"It’s time for rehabilitation! You’re a recovering amputee, fitted with the latest modern technology. The KS-001 Robo-arm is capable of delicate tasks – if used efficiently.\nWhat better challenge for the son of an Earl than to make tea for his father?\nGood luck son.\nYou'll need it.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"ProjectorGames","platforms":[{"id":0,"name":"PC"}]},{"id":11838,"name":"UBERMOSH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80f/80f2938a1160c6c6894b498cbf15803d.jpg","description":"\"UBERMOSH is an arcade game about cutting bullets with a sword, in a gun-filled cyberpunk mosh pit.\"\nLike a pinball table or a coin-op arcade machine, UBERMOSH was made to give you a shot of adrenaline in a couple of minutes. Each time you play a new level is generated for you to beat your score in 90 seconds.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Walter Machado","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18699,"name":"SpellForce - Platinum Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c08/c0860989069d9f8d23f51e8276eb3e06.jpg","description":"Included in the Platinum Edition are three titles:SpellForce: The Order of DawnIn a world beyond imagination...\nIn their immeasurable greed and constant thirst for power, the thirteen most powerful Mages of all time doomed the land, hurling it into an endless spiral of chaos and despair. Entire countries were wiped out in the blink of an eye when the devastating power of the Elements was unleashed - Elements summoned by dark rituals. Continents shattered like glass, the pieces strewn about like leaves in the wind. Huge armies, bound by the the power of ancient runes, brought war and destruction to the lands that survived the initial onslaught. All that was left were a few islands, connected by magic portals.\nNow, only a few years after the end of the Convocation, evil is back - stronger and more powerful than ever before - to finish what was started. Yet there is still hope. The prophecies tell of a human. A human damned to immortality, bound forever by the power of the blood runes…\nSoon, the time will come when the power of one may change the destiny of many. For better or for worse...SpellForce: Shadow of the PhoenixBy means of an enslaved god's life essence a dark necromancer is trying to reanimate the powerful circle mages and make them his unholy servants. Only the power of the Phoenix Stone will be able to prevent the returning of the Circle.\nThus the rune is summoned again to finally put an end to his former slave-masters.\nBut to free the special power of the Phoenix Stone, the blade of the Shadow Sword is required which is held by the rune warrior of Urgath. The two avatars need to combine their powers and work together to overcome this final enemy.SpellForce: Breath of WinterA Prince of Darkness, a Fial Darg, was set free through the Convocation and took over the reign over the Fire Empire. His whish is to bring the Renegades, the Gods of darkness, back to Eo.\n\nFor the Ritual, to make that happen, he needs the blood of a first-born Elve. But there is only one more left, Cenwen, the Elve Queen, who lives under the ice where she sings for the mighty dragon Aryn…\n\nInnovative game design: The unique mixture of RTS and RPG elements offers a brand new game experience.\nHigh degree of identification with the hero-avatar, whose skills and strengths can be improved by the player.\nClick'n'Fight: This revolutionary control system guarantees instant action, the best possible overview and completely new tactical possibilities in battle.\n6 races - Humans, Dwarves, Elves, Dark Elves, Orcs and Trolls - that can be used simultaneously (!) to build settlements and fight battles and more than 30 different enemy races, from cowardly goblins to powerful demons, Fire Angels, Werewolfs and giant Ice Dragons.\nA multitude of spells, divided into different categories of magic (white, black, elemental, etc.)  and enchanted items\nAwe-inspiring 3D-graphics with zoom levels from isometric to 1st-Person-views\nFree game in SpellForce – The Breath of Winter: The Avatar can develop and upgrade his skills with every map he plays. This mode enables the player to try out other Avatars abilities without playing the main campaign again.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"JoWooD","platforms":[{"id":0,"name":"PC"}]},{"id":17186,"name":"Splatter - Zombie Apocalypse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/144/1444b4c6d7e54a0166d7047083f5cd62.jpg","description":"Splatter is a top-down-shooter with a film-noir-singleplayer-campaign.  Fight against all kinds of monsters hordes with a huge arsenal of weapons, all with top of the line physics-based splatter effects and destructible level environments.\nMeet interesting characters, accomplish dozens of side quests, engage boss fights and upgrade your weapons.\nThe zombies fear light, so use your flashlight strategically to create breathing space in battles and to expose hidden weaknesses of your enemies. Explore the surroundings to find new weapons, resources and secret areas. Spend the money you collect to upgrade your guns and unlock new weapon features and discover the best tactics against the variety of monsters.\nThe story mode spans 16 levels with fully voiced NPCs and dialogs and animated cutscenes.\nTry to beat the Highscores in the Survival Mode or gather up to 4 friends in front of your computer to co-op against the horde.Key FeaturesTopdown shooter with challenging fights against all kinds of zombies and monsters\nFilm-noire-singleplayer-campaign with fully voiced dialogs, cutscenes, bosses, vehicles and side missions\nLights and Shadows add a tactical layer to the battles\nA destructible environment to shatter, with occasional resources hidden inside\nUpgradeable weapons gain new qualities and features with each level\nArcade game modes with online leaderboards pit you against your friends' scores\nLocal multiplayer for upto 4 players with controllers, mice, keyboards... whatever you got there, you can use it\nAnd lots of action, of course","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dreamworlds","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11728,"name":"Halcyon 6: Starbase Commander","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e40/e400df873b9e5ffb03f0abc3e5943b9d.jpg","description":"The GameOn the edge of Terran space lies Halcyon 6, a derelict starbase left behind by a mysterious precursor race. Your mission is to reclaim the derelict station and rebuild it.\nA mysterious alien force is making a beeline towards Earth and this starbase is the best chance for the New Terran Federation to establish new alliances, research new technologies and otherwise figure out a way to stop the impending invasion.\nUsing only the resources you can salvage from the derelict station and gathered from nearby star systems, it’s up to you to rebuild the starbase to lead the Terran Republic’s scientific research, exploration and diplomatic efforts on the edge of known space.\nHalcyon 6 is a passion project who’s design is inspired by our years spent playing classic games like Star Control, Master of Orion, X-COM, Civilization and new classics like FTL.Features:Base Building: spend resources to build station facilities (rooms) to enhance your production and technological capabilities, or build ships to help you control more territory\nExploration: assign your fleets to nearby star clusters, where they can handle emerging enemy threats, do missions for alien factions or secure bonus resources\nCrew Management: assign crew to station facilities to greatly improve their output efficiency, or to ships where they can contribute in unique ways to combat, missions and events\nDeep Tactical Combat: fight tactical ship or ground battles to resolve hostile events, create a foothold in the sector and ultimately defeat the enemy mothership!\nStory Events: based on game criteria like rooms-built, alien diplomacy scores or officer traits/skills, the game will produce story events (often with multiple choice outcomes) that can lead to combat, time-related applied bonuses/negatives, officer attribute changes or any number of crazy in-game stories.Project GoalsUnlimited Replayability: Each playthrough has players dealing with a new randomly generated derelict station, surrounding galaxy, crew recruits, and alien factions\nMotley Crew: Each crew member has unlimited potential for acquiring unique behaviours, traits and abilities, for better or for worse. Making the best use of your dysfunctional crew will be one of the keys to success. Who should be your main Science Officer? The insomniac that works insane hours but has an addictive personality or the agoraphobic mad genius?\nEncounters of the Weird Kind: There are 6 alien factions in Halcyon 6 and they are all quite different with varying objectives and personalities. Only your wit and your crew’s skills will help you navigate the diplomatic waters to gain them as key allies or valuable trading partners.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Massive Damage","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":387345,"name":"Yakuza 4 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/549/549414dd9ecff25b586462b763afe3eb.jpg","description":"Disfruta del cuarto capítulo de la saga de Kazuma Kiryu en 1080p y 60fps.\r\nTokio, año 2010.  Un tiroteo nocturno en el barrio rojo sume a la ciudad en una vorágine de deseos y clamor público. Se suponía que era un incidente habitual en la zona..., hasta que apareció una mujer atormentada por una profunda tristeza. Como polillas atraídas por la luz, algunos habitantes de los bajos fondos se presentan uno tras otro ante Kazuma Kiryu, el legendario yakuza.\r\nA medida que los destinos de estos cuatro hombres se cruzan, la historia de un milagro creado por su apasionada y violenta vida empieza a tomar forma.\r\nPor primera vez en la saga, será posible controlar a varios protagonistas, lo que dará lugar a una historia de una profundidad sin precedentes y acción a raudales. Tres nuevos protagonistas, cada uno con una personalidad única, dejarán huella antes de que la historia llegue a su fin.\r\nCompleta el viaje del Dragón de Dojima.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":21312,"name":"HeXen: Deathkings of the Dark Citadel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/620/620a4d1730f32ef9a284a23487a328ff.jpg","description":"Where HeXen Ends, the True Nightmare Begins. Deathkings of the Dark Citadel is the only official expansion of the original HeXen game. This add-on pack features 20 new single player levels from the original HeXen team as well as a host of new multiplayer options.\nDeathkings of the Dark Citadel was the first true game expansion that Raven Software ever produced. In addition to providing three new hubs for the original HeXen, the Deathkings expansion was the first multiplayer game that allowed eight players to connect to a LAN simultaneously.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"id Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"}]},{"id":15079,"name":"Blackwell Convergence","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1b/a1b8954b78a687083b97d4cd5356f3be.jpg","description":"A new film opens to rave reviews, despite its bloody history. A beautiful uptown office remains unoccupied, despite its prime location. A downtown artist berates himself for selling out, while a Wall Street investor congratulates himself on a job well done. Just normal life in the big city? Or is somthing more sinister binding these events together Bizarre connections are a dime a dozen for the Blackwell family, but just how far back to they go?  Medium Rosa Blackwell and her spirit guide Joey Mallone are about to find out.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13796,"name":"Waves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d38/d3857bf3217f7b30b5e71d4c1963793b.jpg","description":"Waves is a twin stick shooter that can be played by anyone, but with a high enough skill threshold to keep even the most hardened shooter fan entertained.\nSet in a Neo-Cyberspace arena your system is being overrun by bugs, errors and viruses and the only solution is to kill every rogue process before it kills you.\nClear the arena of enemies while racking up a big fat Combo with swift kills and well timed Bombs. If it all gets a bit too much you can use your Time Buffer to slow down the action and turn defeat into victory. Players can compete across seven different game modes with online high-score tables and Achievements in their pursuit of twin-stick perfection.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Voodoo","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":9656,"name":"Shiness: The Lightning Kingdom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/096/0963033cf4c3f1db685221fc3d143033.jpg","description":"Twitch Dev Session\nAbout the Game\nShiness is an Action-RPG developed by indie development studio Enigami, which will let you travel in a captivating universe doomed to destruction ever since the fragmentation of the planet Mahera...\nTravel through an enthralling and interactive world as Chado and his 4 companions, and develop your characters\nHyper-dynamic combat mixing magic with combos, parries, and blocks like a traditional arena fighter\nDevelop 2 types of skills (physical attacks and magic) and unlock new talents and spells\nExplore and interact with a vast world made of multiple environments thanks to you and your companions’ special powers and skills\nNumerous quests and side-quests will give you the opportunity to develop your characters and their reputation\nPlay as Chado and his companions, and travel across the Celestial Islands onboard a flying boat.  After a rough landing on hostile territory, you find yourself in the midst of a power struggle between several kingdoms. Chado might be able to resolve this situation thanks to Shiness, a magical spirit that only he can see.\nExplore a large and captivating world with which you'll be able to interact thanks to the power of your 5 playable characters: crush a big rock using pure strength to enter a secret cave, or use telekinetic powers to activate some mechanisms and discover a back entry…  During your journey, you'll meet dozens of dangerous enemies with whom you'll have to face off during hyper-dynamic fights mixing magic, and traditional fighting game mechanics (hit, block, combos…).  Gain experience during those fights, while progressing in the storyline or by accomplishing numerous side quests.  Evolve your characters, learn new skills and spells, and become the hero who will unify the civilizations of Mahera.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":14503,"name":"Crusaders of the Lost Idols","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ab/5ab64135818193f2ce67190811b3ae2a.jpg","description":"Latest Update!\nIt's a long weekend for many workers, which means more time to grind and finish the event!\nRead more: http://codenameentertainment.com/?page=idle&post_id=553#blog\nAbout the GameUnlock crusaders, Collect gear, and Earn achievements!\nCrusaders of the Lost Idols is the Award Winning clicker idle game of heroic awesomeness.\nCreate a band of unusual heroes to battle monsters, earn gold by killing them and use it to level-up and unlock new character abilities. Organize your Crusaders by designing the perfect formation for maximum damage.\nMaster Formation Strategy over multiple campaigns and events that are updated every month.\nFormation Strategy\nThe only clicker/idle game to feature a formation system. Crusader specific abilities, buffs, and gear challenge the player to find the best formation every campaign and event.\nUnlock Crusaders\nCollect an unusual host of over 54 characters such as The Bat Billionaire, Emo Werewolf and RoboTurkey, inspired by the world of video games and popular culture with more added Every Month.\nCollect Gear, Buffs, and Trinkets\nA cornucopia of content with hundreds of unique upgrades for each character, including unique gear, and buffs are available to collect.\nPLUS\nOver 10,000 Levels\nMaster over six campaigns with dozens of objectives with deep playability and challenge; more campaigns released regularly.\nDaily Quests\nEach day players are challenged to complete mini-objectives that reward success with precious red rubies.\nMonthly Events\nLimited time events featuring special objectives and exclusive new content updated Every Month.\nMissions\nSend your idle Crusaders on side missions to unlock past Event Crusaders, new gear, earn Enchantment Points and jeweled chests plus more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Codename Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11383,"name":"Atom RPG","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/279/279929185f57fb8c64dc9e3e412ed344.jpg","description":"ATOM RPG is a post-apocalyptic indie game, inspired by classic CRPGs: Fallout, Wasteland, System Shock, Deus Ex, Baldur's Gate and many others.\nIn 1986 both the Soviet Union and the Western Bloc were destroyed in mutual nuclear bombings. You are one of the survivors of the nuclear Holocaust. Your mission - to explore the wild and wondrous world of the Soviet Wasteland. To earn your place under the sun. And to investigate a shadowy conspiracy, aimed at destroying all that is left of life on Earth.\nATOM is:\n• A powerful character creation tool, aimed at making the wasteland hero you want to portray!\n• A balanced roleplaying system inspired by GURPS. Each stat combination provides a unique gaming experience, unique dialogues, and new ways to solve some of the quests!\n• Dozens of skills, from lockpicking to gambling!\n• Many hours of gameplay on all sorts of locations. Meet the other survivors in a brave new settlement, built from the dust of the old world. Venture into the wilds, where mutated creatures and savage bandits lurk. Work out the secrets of an old military bunker. Or simply lose yourself, fishing at a scenic pond...\n• Turn-based combat, inspired by Fallout 1 and 2.\n• Random encounters with the dwellers of the Soviet Wasteland - both friendly and dangerous. Sometimes all at the same time...\n• Many deep, multiple-choice dialogues that feel like real conversations with the unique NPCs of the game.\n• Nonlinear gameplay! Dozens of quests, each with many alternative solutions. Play the game like You want to!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"AtomTeam","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":49382,"name":"Slipstream","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41e/41e72fd7afde605b4f0d91bd7fd5889e.jpg","description":"Slipstream is a racing game inspired by the visuals, music, games and cars from the late 80s and early 90s. It's built on a custom game engine, with an authentic retro feel and unique graphics. The soundtrack, drawing from synthpop and jazz fusion influences, sets the tone for a race across a variety of exotic locations from all around the world, including cities, deserts, forests, mountains and beaches. Drifting and slipstreaming mechanics add depth to the driving gameplay, and the result is a challenging and exciting experience.Features Authentic pseudo-3D game engine with 2D graphics, just like the glory days of the arcade racers.\n20 Different tracks, set on a variety of exotic locations all around the world and beyond.\n4 Game modes: arcade, quick race, grand prix and custom.\n5 Car models, each with its own specs and playstyle.\nOriginal soundtrack with 9 exclusive songs.\nUpgrades, drifting, turbos, rivals, forks and much more!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Noctet Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":10607,"name":"Infested Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee7/ee7e610a38e994e8518c1b8a1de5c857.jpg","description":"Command a team of 5 elite soldiers against an alien horde of 100,000.  Surrounded on all sides, you must outmaneuver and outsmart the enemy.\nThe enemy is closing in around you.  Your soldiers are being flanked and the perimeter is slowly collapsing under a vicious alien assault.  Robotic turrets will not last much longer.  Just a little more and the bugs will swarm into your unprotected base.  What are your orders?\nYou order your soldiers to fall back to a defensive chokepoint and rebuild your defenses.  Sacrifice the forward squads to gain some extra time.  Gather your team while equipping them with flamethrowers and laser guns.  Start building a siege cannon for fire support.  Then, while the aliens are busy, flank their main hives to destroy and capture them.\nYou have just pulled off a tactical victory - but there's no time to rest.\nThe aliens are constantly mutating.  One moment your shotguns are ripping through the horde, the next the aliens grow hard, bullet-proof armour.  You must adapt as well.  Equip your team with stealth suits, miniguns, grenade launchers - your commands will decide the battle's outcome.FeaturesReal time tactical combat\nA lengthy campaign where you develop new weapons\nProcedural maps and random mutation system keep the game fresh\n21 Human weapons and buildings for you to wield\n33 Alien mutations to keep you on your toes\nFight thousands of enemies at once","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Rocket Bear Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":323051,"name":"198X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/896/8967763daab67323b37a1e86bfaf98f3.jpg","description":"98X is an arcade epic. A coming-of-age story told through multiple games and genres, worlds and characters. Experience the thrill of shooting, driving, jumping, fighting and role-playing – combined with emotional, cinematic storytelling. This is a love letter to the golden age of arcade games – yet with a scope that was never possible in the actual 1980s.\nThe game is set in Suburbia, just outside the City, sometime in 198X. It follows the journey of Kid, a teenager stuck between the limitations of innocent youth and the obligations of inevitable adulthood. The story unfolds when Kid discovers the local arcade – finding new worlds, and new meaning, in video games. For every visit to the arcade – every game uncovered, every move mastered, every demon defeated – Kid grows stronger.\nAnd what happens when the line between reality and game starts to blur...?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hi-Bit Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":327208,"name":"Zombie Army 4: Dead War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c70/c7070c9ee7e1d4493feb446dd7a10309.jpg","description":"Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!\nThe resistance have defeated Zombie Hitler and cast him into Hell – but the dead rise once again with greater hunger than before! Continue the alternate history of Zombie Army Trilogy in huge new levels, and uncover a sinister plan that takes the Survivor Brigade across Italy and beyond!\nExperience genre-defining ballistics, build the slayer that suits you and harness the power of fire, lightning and divine essence as you upgrade your guns to fight back against the dead. When the horde surrounds you, tear them apart with enhanced melee combat and flesh-rending takedown moves!\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1 player\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCopyright ©2019 Rebellion. All rights Reserved. The Rebellion name and logo, the Zombie Army name and logo are trademarks of Rebellion and may be registered trademarks in certain countries.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rebellion","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":23669,"name":"THE KING OF FIGHTERS 2002","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d2/2d2021a0b04bd5fea05586a4681cae1f.jpg","description":"THE KING OF FIGHTERS 2002 was released in 2002 and is still highly praised around the world to this day thanks to its return to the Series’ ”3-on-3 battle” flagship system, the numerous fan favorite characters returning in this 2002 year iteration, and its game balance. Thanks to the introduction of the “Quick Evasion” and “Max Activation” game mechanics, battles get even more exciting and intense.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"SNK","platforms":[{"id":0,"name":"Neo Geo"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9696,"name":"Eternal Card Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbd/fbdca928fdd7439cba68443cf4d8c6c1.jpg","description":"Raise the Banner!\nWith spells and swords, six-guns and subterfuge, heroes collide in the struggle for the Eternal Throne. Where will you stand? Join the battle in Eternal, the new strategy card game of unlimited choices and unbelievable fun.\nThe Best of Both Worlds\nEternal brings AAA pace and polish to the the infinite possibilities of a deep strategy card game. Build any deck you can imagine by freely mixing cards from an expanding collection, and plunge into lightning-fast battles. The only limits are your own creativity.\nA Game that Grows With Its Players\nIn Eternal, there’s always something new. Frequent new cards release between set launches to guarantee that the meta-game never gets stale. A steady influx of unexplored content keeps even the most experienced players on their toes. What will you create?\nTest Your Wits, Not Your Wallet\nLooking for a white hat that fits? Here you go. All gameplay — every card and every game mode — in Eternal can be earned or unlocked without ever paying a dime. It’s truly free to play.\nEnemies at Every Turn\nEternal’s tactical AI was hand-crafted by some of the best professional TCG players in the world. With dozens of enemy decks, wild “boss level” environments, and unique card mechanics, Eternal stands ready to challenge players at any hour of the day or night.\nThe Choice is Yours\n•\tHundreds of cards combine however you like – there are no limits to what you can build\n•\tFast spells and combat tactics mean you’re never totally safe\nThere’s Always Time for a Game\n•\tInnovative digital mechanics, quick five-minute games, smooth and intuitive tablet play\n•\tConstant rewards and new challenges keep players engaged\n“Play to Win” not “Pay to Win”\n•\tOther games make you pay for card collection; Eternal players can earn every card for free","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dire Wolf Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":327232,"name":"Final Fantasy VIII Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ac/1ac050b86c87138ce6a3354aa90db894.jpg","description":"Coming in 2019, FINAL FANTASY VIII Remastered marks the 20th Anniversary of its original release with a new visual refresh and brings the game’s beloved story to PS4. With overhauled visuals, see your favorite characters come to life like never before!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":14154,"name":"DeadCore","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bc/2bc300aae201a52a4c73e903709cfe37.jpg","description":"After an endless fall through powerful magnetic storms... you awaken.\nYour memory erased, you start exploring the world around you. Someone or something is pushing you higher and higher.\nSuddenly, you spot the most gigantic Tower emerging from the mists. You soon understand that to get the answers to your questions... you have to climb its summit.\nHowever, this is no easy feat. The Tower is protected by a high-tec\nh security system made up of complex mechanisms, fatal lasers, and robots constantly tracking your every move.\nIf you are to survive, you'll need to use all your skills (jumping, double-jumping, dashing etc. ) and make good use of your SwitchGun, that can be used to enable or disable traps and robots in order to reach the top of the Tower and uncover the secrets of its origins.Key Features: Explore a mysterious world composed of immense and staggering levels with a labyrinth of secret passages to discover.\n[* ] Unlock new powers and upgrades in order to access new areas of the Tower.\nChallenge your friends and take them head on with our online leaderboards in Speedrun mode where every hundredth of a second counts!\nReveal the secrets of the Tower by collecting fragments of memory from its former inhabitants as well as new levels and music for Speedrun mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Grip Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4507,"name":"MotorStorm: Apocalypse","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d63/d6369c10d3cff59b237f5f014fcc5475.jpg","description":"MotorStorm Apocalypse is a racing game developed by Evolution Studios. It is the third installment in the MotorStorm series.\n\n###Setting\nYou take part in The Festival, an extreme racing event that takes place in a post-apocalyptic San-Francisco. The city is torn apart by devastating earthquakes. There are no civilians left in the town, apart from scavengers and the PMCs sent to maintain at least some degree of order. \n\n###Gameplay\nThe Festival consists of three categories of events which are different in their difficulty. For every race, the player has to choose a vehicle from a pre-determined class. Buggies, motorcycles, and cars are present in the game. Players are free to tune and customize their vehicles as they see fit. \n\nThe game features an advanced damage model. After sustaining a certain amount of damage, the cars crash and explode. Every vehicle can use a boost for a limited amount of time. If the player boosts for too long, the car can blow up. The car's engine can be cooled off to use a bit more boost. \n\nThe inhabitants of San-Fran will attempt to interfere into the races. The scavengers try to slam the racers off the road using stolen cars or shoot at them while the PMCs create additional hazards for the participants of The Festival, such as an attack helicopter. Players have to keep in mind that the city is still vulnerable to natural disasters with buildings crumbling down on their heads.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":21668,"name":"QuestRun","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d648ccc20f2318dec4c0bc0e4b7364.jpg","description":"Challenging and fast-paced with a modern twist on old school RPG battle systems, QuestRun is unlike anything you have played before. A J-RPG inspired tactical game with rogue-like elements and deep engaging gameplay. You love RPGs but can go without in depth dialogues and scenario based text? QuestRun is for you - taking you to battle in various themed dungeons. Progress as far as you can with your chosen heroes, die in agony and try again! Apply new strategies, try new heroes, choose new perils and die anyway! Untimely, premature deaths await!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phoenix Online Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16210,"name":"Toonstruck","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa1/fa1a7c3a3291dc71f01b8b77460c9be0.jpg","description":"A Word to the wise: BETTER PACK AN ANVIL\nYou are Drew Blanc, animator of The Fluffy Fluffy Bun Bun Show.  Life hasn't exactly turned out the way you planned.  Your boss, Mr. Schmalz, has it in for you. Your creativity has left town.  And just when you think it can't get worse...  it does.  A freak accident involving electronics (don't ask) spins you headfirst into the WHACKED OUT and not-so-warm-and-fuzzy world of your own cartoon creations.\nTo get home, you'll need to unravel the secrets of these loony lands before they unravel you.  Out smart demented clowns, out shock cross-dressing livestock, and outwit the diabolical Count Nefarious!  Send someone an exploding turkey.  Watch Spike the Clown torture balloon animals.  And, if you've got any energy left, try preventing an all-out war between the cartoon forces of good and evil.\nToonstruck  stars Christopher Lloyd and features Ben Stein, as well as the voice talents of Tim Curry, Dan Castellaneta and Dom DeLuise!","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Burst","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4678,"name":"Streets of Rage 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9fb/9fb2f64404aeb409632ab479f2f51443.jpg","description":"After Axel Stone, Blaze Fielding and Adam Hunter destroyed the evil Syndicate leader, Mr. X, the city became a peaceful place to live, and each one of them followed their own paths. One year later, after their reunion, Adam's brother Sammy returned from school to find their apartment in a mess, and Adam nowhere to be seen, and after calling his two friends, one of them notices a photo of Adam chained to a wall, next to someone they knew very well - Mr. X, who returned to turn the peaceful city once again into a war zone. Now, Axel, Blaze, Sammy, and Axel's good friend Max, a pro wrestler, must head out to stop Mr. X once again...hopefully for good...\n\nStreets of Rage 2 differs from the previous title in several ways. There are changes in both graphics (characters now are bigger, more detailed and with more animation frames, and scenarios are less grainy) and gameplay (the rocket move was replaced by a special move that doubles in offense and defense along several new moves), along other new features such as life bars (and names) for all enemies and the radically different new characters.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"SEGA","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":518596,"name":"Nioh 2 – The Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/191/191245618591a873d1ecfcad6b164e8e.jpg","description":"UNLEASH YOUR DARKNESS\r\n\r\nExperience the thrill of taking on hordes of fearsome yokai in a battle to the death in this brutal masocore Action RPG. Create your own original protagonist and embark on an adventure that will take you through devastated locales across Japan during the Sengoku period.\r\n\r\nMuch like the previous title which garnered much praise from fans and critics alike, Nioh 2 contains an original profound story surrounding military commanders from the Sengoku period. However, Nioh 2 goes above and beyond its predecessor by including the new Yokai Shift ability which allows the protagonist to utilize new powerful forms to defeat even the most formidable yokai in battle. New to Nioh 2, your enemies can now create a Dark Realm which raises the stakes of battle and creates new challenges for your protagonist to overcome. We hope you enjoy conquering fearsome monsters as you unleash your darkness in the world of Nioh 2.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Team NINJA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":389851,"name":"The Falconeer","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/166/1663b397065c8e127fc24916ca48249b.jpg","description":"The Falconeer is a new take on air combat. A 3rd person game that puts you in control of a Falconeer, an airborne warrior.  Using ranged weapons , the game still holds true to classic dog fighting mechanics but adds twists such as acrobatics and crazy line up of enemies to take on.   You'll fight other Falconeers, but also large lumbering airships, flying beetles, manta rays and offcourse the dragon-like weavers.  \n\nThe story revolves around a singular conflict, but as a player you'll get to play and experience it from as many angles as you want, offering you acces to all the factions involved. \n\nThe Falconeer is an open-world game. Meaning that a reasonable chunk of the Ursee can be explored and engaged freely.  With different factions and their settlements and bases responding to your actions and faction allegiance.  \n\nYou will need to survive and earn soulshards the currency of the Ursee,  to improve your gear and mount, but also to keep your faction on top in the struggle to control the Ursee.  \n\n\nThe deep running currents of the Great Ursee hide the secrets of long-forgotten gods and ancestors.\nThe Falconeer is an airborne ocean-world fantasy RPG set in The Great Ursee. Take your armed aerial mount to the skies as you explore a bleak and hauntingly beautiful world, filled with wonderous locations and warmongering rival factions vying for the mysterious secrets hidden at the Ursee's unfathomable depths.\n\nThe Falconeer puts you in control of the ultimate airborne warrior.  Delivering devastating ranged attacks and combining classic dog fighting mechanics with acrobatic twists and turns, you’ll go wing-to-wing with rival Falconeers as well as large lumbering airships, flying beetles, manta rays and deadly dragon-like weavers.About Tomas SalaTomas Sala is an independent game artist and designer as well as the co-founder of game studio Little Chicken Game Company. Tomas is best known to most gamers for his exotic Skyrim Mod series: Moonpath to Elsweyr, and has developed a unique visual style over the years that have helped turn helped turn games such as Rekt! (iOS/Switch), SXPD (iOS) and TrackLab (PSVR) into unique visual and interactive experiences","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Tomas Sala","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":374507,"name":"Guilty Gear -Strive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dfe/dfe14d30ed6fccd9db4ae79d3be51d54.jpg","description":"Discover the Smell of the Game with Guilty Gear -Strive-! Immerse yourself in new gameplay mechanics designed to be simple and welcoming for fighting game newcomers, yet deep and creative for veterans. Ride the Fire into a heavy metal inspired alternate future full of over-the-top action, style and fun! Blazing!\n\n“Guilty Gear -Strive-“ is the latest entry in the critically acclaimed Guilty Gear fighting game franchise. Created by Daisuke Ishiwatari and developed by Arc System Works, “Guilty Gear -Strive-“ upholds the series’ reputation for a high octane soundtrack, groundbreaking hybrid 2D/3D cell-shaded graphics and intense, rewarding gameplay.\n\n\n\n◆The fate of the universe will be determined…\nHead into the final confrontation with That Man, the person responsible for all the destruction and damage to the world and and it's inhabitants. Join Sol Badguy, his rival Ky Kiske, and a total starting roster of 15 unique characters as they face the astonishing conclusion to a story 20 years in the making!\n\n\n◆A Sensory BLAST for Your Eyes and Ears\nRock out to the thrashing tracks laid down by series creator and music composer, Daisuke Ishiwatari! Bang your head and beat your opponent to the killer soundtrack while being blown away by the most stunning and dynamic 3D cell-shaded visuals produced to date!\n\n\n◆New Revolution in Fighting Games!\nGuilty Gear -Strive- brings a number of new and innovative game play mechanics designed to allow players new to the series to quickly learn the fundamentals while maintaining the deep, creative gameplay Guilty Gear is praised for. New additions to the series such as a wall-breaking mechanic will allow for new and exciting approaches to battle.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Arc System Works","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":21530,"name":"Numba Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa5a89e2e92ee14965f66bcca4841eff.jpg","description":"An exciting, all-new gaming experience which is fun, challenging and will help you increase your overall mental fitness! Create Numba chains in various sequences. Sound easy? Get ready for some great fun and absorbing gameplay through 3 testing game modes as you strive to become the ultimate Numba Champion in this all-new puzzler.Features:Stunning Graphics and Effects\nCombos, Bonuses, Gems and more\nHigh Score Tables for all your scores","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"PC"}]}]