[{"id":45327,"name":"Phoenix Dynasty 2","genre":"Action","price":0.0,"description":"For now, only Turkey servers are open and the game supports the Turkish language. But don’t worry! US and EU servers are coming soon with English language support! Now you can join the game and test the servers but there may be some lagging problems. Also, you may not understand complex game features, but you can finish the quests using auto-path.\nIf you’re looking for a classical MMORPG and put gameplay features, events and PvP over graphics Phoenix Dynasty 2 is just for you!WHAT’S IN THE PHOENIX DYNASTY 2?%100 English Content and Player Support\n7/24 Active PvP Map\nVillage and City Battles\nCaravan Raids with Team or Single\nSingle or Team Dungeons\nHundreds of Bosses\nUpgradeable Mounts and Suits\nEnjoyable and Interesting Events\nMarket System Free of Paytowin\nAuto-bot and Auto-path System\nVisually Enchanting and Strengthening Wings\nPet System and so much more…GO ON A JOURNEY TO FIND THE SWORD OF INFINITY“When the gouts of sorrow of a mother did turn into blood, the Phoenix, born from the feathers of Pangu as one of the four creatures, shall rise on the azure and fly towards the Sword of Infinity forged in its fire. Whosoever bears the Sword shall lead the Phoenix. Henceforth all dynasties, animals and gods shall unite under the Phoenix Dynasty, thus they shall be in the ascendant of the Nine Realms.”\nYou are the only hope of the Nine Realms now, Azurian! Join now to fight against the army of Darkazure and the malevolence that start to control the World! Build your dynasty and be the hero of this new MMORPG with thousands of players!","imageUrl":"https://media.rawg.io/media/screenshots/0c2/0c29bab7564bf6f024691cbaba31ee9b.jpg","releaseYear":2017,"developer":"Ntroy","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44832,"name":"Destination Primus Vita - Episode 1: Austin","genre":"Adventure","price":0.0,"description":"Get ready to live the extraordinary experience of our SIX crew members aboard the Beaufort ship, en route for Primus Vita.\nDestination Primus Vita is a video game featuring narrative and traditional puzzles set in a science-fiction universe. The world is a dreamlike construct created from the protagonist’s world, thoughts, and feelings while in cryosleep on the way to the planet Primus Vita.\nThe player will navigate from the main Puzzle Room in the train, to the Memory room, where s/he be able to interact with the other 5 companions. And find some clues to solve the puzzles, of course...\nIn the year 3044, a team of six humans travel to the planet Primus Vita to retrieve precious water that was stolen from them hundreds of years ago. A space voyage of 4 years in cryosleep awaits them.\nAfter the arrival of previous teams on Primus Vita, the World Space Agency (WSA) noted that these long periods of cryosleep caused memory loss, depression and an overall loss of cognitive abilities in the soldiers and scientists who undertake these missions.  To combat this problem, NIM, the AI on the Beaufort, created a way to stimulate the sleeping minds of their team members by making them live the Train experience.","imageUrl":"https://media.rawg.io/media/screenshots/319/3190138539fc44f2214bfcf4dd8c7010.jpg","releaseYear":-1,"developer":"Epsilon Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":27407,"name":"Kirby: Triple Deluxe","genre":"Platformer","price":0.0,"description":"Devour trees, obstacles, and huge chunks of stages with Kirby’s Hypernova ability and inhale enemies to copy epic new moves like Archer. It’s a grand new Kirby™ adventure PLUS a new multiplayer battle mode, Kirby Fighters!\n\nWhen a mysterious being kidnaps King Dedede atop a giant Dreamstalk, only Kirby can save the day! Jump from the foreground to the background in dynamic 3D side-scrolling environments while using new and returning copy abilities to defeat enemies. Duke it out in Kirby Fighters, a fierce 4-player* battle mode where you fight using a chosen ability like Sword or Ninja. The last Kirby standing reigns supreme. Whether you’re new to Kirby or an old fan, the Kirby: Triple Deluxe game offers a triple threat—action, adventure, and a battle mode!\n\nKirby's powerful copy ability returns, allowing him to inhale, spit and transform\n\nJump from the foreground to the background in dynamic 3D side-scrolling levels\n\nEmploy new and returning abilities, including:\n\nArcher - Kirby wields a bow to strike silently from a distance\n\nBeetle - Kirby grabs foes with his horn and slams them into the ground\n\nFire - Kirby can roll into a fireball and scorch through the air\n\nSword - Kirby dons a green cap and wields a sword\n\nKirby’s new Hypernova ability lets him inhale obstacles and big chunks of levels!\n\nUse the Download Play feature to duke it out in Kirby Fighters, a fierce battle mode for up to 4 players*! You can also sharpen your skills by playing solo\n\nEnjoy a selection of additional game modes including Dedede’s Drum Dash and Arena\n\nCollect hidden keychains in every level, each resembling legacy Kirby characters\n\nUnlock improved items and new keychains by using the StreetPass™\nfunction to tag other players","imageUrl":"https://media.rawg.io/media/screenshots/025/025725f7aa012fb613ea6b7eccb5abd9.jpg","releaseYear":2014,"developer":"HAL Laboratory","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":22334,"name":"Embers of Magic","genre":"Action","price":0.0,"description":"Embers of Magic is a short, adventure visual novel that tells the story of Liana the witch. She takes an airship down to the surface of the dangerous and corrupt earth beneath her flying city home.\nIt is set in the same world as Brilliant Shadows, but happens 300 years beforehand.\nWriting by Christopher \"Nyo\" Michael Hall\nArtist/Coding by Sita \"Geckos\" Duncan\nEngine: Ren'Py\nComposer: Caelem\nVoices: Adoxographist, Alec Shea, Nyo, Brad Smith and many others...\nEmbers of Magic is a kinetic novel lasting around 30 minutes. All spoken lines are fully voiced. It is 6,262 words in length.","imageUrl":"https://media.rawg.io/media/screenshots/73e/73e9c2a6fbddd6489efacd14da9244c1.jpg","releaseYear":2017,"developer":"Ithaqua Labs","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21358,"name":"Orion: A Sci-Fi Visual Novel","genre":"Adventure","price":0.0,"description":"\"It's a lesson we never seem to learn... time isn't meant for human manipulation.\" Sam Acacius has received a horrifying message: the section of the Orion Torus where he lives, his only home, will be destroyed. This information has been entrusted to him alone. With the identity of the messenger itself obscured, Sam must decide whether the risks of investigation are worth it. What could a single person do to stop the inevitable?\nTo learn the answers behind this message, Sam must confront forces at the very core of society. Whether he succeeds or fails depends on critical choices he'll have to make along the way.\nWhere will his journey lead him?\nABOUT\nOrion is a visual novel, an interactive story that combines artwork, music, sound effects, and voice acting for all its characters. Players will have the chance to influence the direction of the story, resulting in a variety of different endings. Aspects of time travel, artificial intelligence, and virtual reality games are explored in each path.\nFEATURES\n4 main paths with a total of 9 endings\nDistinctive and specially-produced sound effects\nCustom GUI\nOriginal Soundtrack\nFull English Voice Acting\nCG Gallery","imageUrl":"https://media.rawg.io/media/screenshots/621/621af8b49391c0b03123ecd87545b9ad.jpg","releaseYear":2015,"developer":"Cylight Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21177,"name":"Claustrophobia: The Downward Struggle","genre":"RPG","price":0.0,"description":"Grab your weapon of choice, polish your Rogue senses, and get ready to be thrown into the dark and oppressing dungeons of Claustrophobia! Experience deep character development, fast-paced tactical combat, and mountains of epic loot. Here begins a roguelike quest for glory, slaughter, and anything shiny!\nClaustrophobia: The Downward Struggle is a Tactical RPG Roguelike, most heavily inspired by the combination of procedural gear and enemy generation found in games such as Diablo and Torchlight, with traditional Roguelike features found in games such as NetHack and Dungeon Crawl Stone Soup. Gameplay revolves around a classless, stat and gear-based progression system, procedural dungeon exploration, and unforgiving tactical combat.Current Features Unending Procedurally Generated content: Procedurally generated gear, enemies, and terrain makes for infinite progression and adventure.\nClassless Character Development: Build the character you wish to play, and develop them through in-depth stat and ability customization.\nTons of Loot: Collect vast amounts of weapons, armour, and active items, whose powerful abilities, stats, and passive bonuses enhance your gameplay.\nFast-paced, Tactical Turn-Based Combat: Use positioning, clever skill use, and observation to best your enemies.\nFace Hoards of Challenging Enemies: From simple critters to deadly Elite Units, face off against a variety of monsters, each with their own set of abilities. Enemy Modifiers such as Teleportation, Invisibility, Lifesteal, and more, ensure that there’s always a new type of enemy to slaughter.\nTraditional Roguelike Features: Permadeath, a little luck, and unforgiving gameplay means your hero’s life is firmly in your hands.\nScoring & Leaderboards: To remember all those poor souls who didn’t make it.\nSimple, easy to use Interface: All the details and functionality you need, without the clutter.Features Coming Soon Multiple Dungeons: Featuring all new dungeon designs, enemies, rooms, loot, and more.\nStory mode: Dungeons will chain together for longer, more varied gameplay, and progression towards a final, endgame goal.\nMore Character Development Options: More Class Roles, more Abilities, more talents.\nFurther Item & Enemy Development: A much greater range of Item Abilities and Enemy Modifiers.\nTraps & Puzzles: More special room types will offer greater variation to exploration.\nBosses: Extremely powerful monsters who reside on the final floor of each dungeon, who must be defeated before you can progress.\nGear Crafting: Collect materials and salvage old gear to craft powerful new items.\nAchievements & Unlockables: New content unlocked for courageous feats of strength!","imageUrl":"https://media.rawg.io/media/screenshots/c56/c56abc76d74414ac7bb2fc26b90daeef.jpg","releaseYear":2014,"developer":"The Indie Forge","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21022,"name":"Poker Pretty Girls Battle: Texas Hold'em","genre":"Casual","price":0.0,"description":"Enjoy a hot game of poker with the gals at the Pretty Girls Casino featuring Texas Hold'em style poker rules.\n■ Play poker against Pretty Girls\nThere are 16 \"kawaii\" Japanese girls to choose from, each coming your way all dolled up in her cute summer outfit.  Start with four girls and as you progress through the game more will become available.  Poker play is based on the popular Texas Hold 'em style rules.\n■ Each Pretty Girl is unique\nEach girl has her own unique style of play.  Choose your strategy based on each one's personality!  All Pretty Girls feature recorded Japanese voices.  Feel their excitement as they yell out during poker play.\n■ Choose from two game modes\nIn Pretty Mode, collect rewards as you defeat random opponents.\nIn Free Play Mode, choose girls of your liking for your very own poker battles.\n※There is no undressing or nudity in this game.  It is a poker game with Pretty Girl characters included for your playing enjoyment.  Characters and character images are used under license from their respective owners.","imageUrl":"https://media.rawg.io/media/screenshots/733/733479cb8672c93bee82882b7424c07d.jpg","releaseYear":2015,"developer":"Zoo","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20806,"name":"StuntMANIA Reloaded","genre":"Adventure","price":0.0,"description":"StuntMANIA Reloaded is a fast paced 3D car stunt driving and exploration game, where you get to perform the most amazing tricks and stunts in some really cool environments.\nNew in StuntMANIA Reloaded is the ability to drift and slide when driving to take some amazing corners and to produce some awesome burnouts and donuts!\nWe have also added the ability to perform many more mid-air stunts, including flips, twists and flat spins. You can also automatically re-orient the car by pressing the Jump button while mid-air to achieve the perfect landing. Stunts are only awarded if you land properly, to practice you landings!\nExploding cars\nCars now have a Damage Meter. If it gets to 100%... KA-BOOM! You explode... then re-spawn in a random location. And.. when you explode, your car breaks into bits that stay in the level, so you can drive into them and push them around. It's insanely fun.. so on, try it out!\nELEVEN Unique Cars\nYou can select any of the ELEVEN amazing stunt cars each with differing suspension, weight and handling. Any car can be played in any level in any game mode from an easy to navigate game selection menu (once you have unlocked them).\nELEVEN Amazing Levels\nChoose from ELEVEN unique driving environments, filled with stunt and trick ramps, bonuses and hidden challenges including an awesome Power-Ups that will allow you to take your tricks to a whole new level!\nCollect COINS to unlock content\nEach level in Go Crazy game mode contains 1x Game mode coin, 1x Level coin (in 3 pieces) and 1x Car coin (in 3 pieces). Collecting each coin allows you to spend them to unlock other levels, cars and game modes from the main menu. Can you unlock everything?\n\nFantastic new Music and Sound FX\nEach level has it's own new unique Music track... from Rock and Electric to Zany and Fun, and it never plays the same twice in a row. The new Music and SFX in StuntMANIA Reloaded will really get your blood pumping!\nAwesome POWER-UPS\nEach level has randomly placed Power-Ups for you to find and when you do, you will have some amazing new abilities to help you reach even the highest points in a level or the hardest to find areas.\n* Note: SMR graphical requirements are VERY high. If you encounter slow performance, please lower your quality settings and resolution in the Game-Options screen. Especially when using older Mac hardware.\n* Note: Not recommended for Macs with integrated Intel GMA950 Graphics as found in pre 2009 Mac Mini and pre 2008 MacBook.","imageUrl":"https://media.rawg.io/media/screenshots/8e9/8e9dfb7f780b5e15099cec62b480f37a.jpg","releaseYear":2014,"developer":"Sector3 Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18706,"name":"World of Zoo","genre":"Simulation","price":0.0,"description":"What would you do if you had the keys to the zoo?\nWorld of Zoo is the only life sim game that pushes you past the fences and into a world of your own zoo.\nCreate and customize your zoo experience and develop hands on relationships to earn the trust and love of your animals.\nBuild on relationships with the world’s most amazing animals through hands on interaction\nCreate unlimited animals with the Animal Creator\nHours of play with mini-games, achievements and unlockables\nCreate and customize your own zoo\nExperience over 40 different animal species\nLearn about each animal with the National Geographic animal fact cards\nConnect online and share user generated content\n* Some of the animals depicted in the trailer and screenshots are not included in the current version.","imageUrl":"https://media.rawg.io/media/screenshots/984/98440d94e5bb8bc2530b19d23a8e88c7.jpg","releaseYear":2009,"developer":"1st Playable Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"}]},{"id":17185,"name":"Eventide 2: The Sorcerers Mirror","genre":"Adventure","price":0.0,"description":"Embark on a mystical adventure in a forgotten mountain village ruled by an immortal sorcerer. Can you unravel his secret?\nINSPIRED BY ACTUAL SLAVIC LEGENDS!\nExplore an enchanted world full of imps, apparitions, magical animals, and other mysterious creatures taken directly from Eastern European folk and fairy tales.\nSHAPE THE STORY WITH YOUR CHOICES!\nThe decisions you make will influence the fate of characters and the end of the game.\nMEET LEGENDARY CHARACTERS!\nEnlist the help of larger-than-life characters from Slavic folklore, like famous XVIII-century outlaw Yanosik, to defeat the evil mage.\nA CHALLENGING JOURNEY THROUGH BREATHTAKING LOCATIONS!\nTest yourself in mini-games and puzzles while venturing though the beautifully painted mountains full of wildlife and amazing creatures.\nSUPERB VOICE ACTING!\nNarrated by acclaimed voice actor Michael McConnohie, who's known for lending his voice to characters in legendary games.\nBUILD YOUR OWN HERBARIUM AND IMP COLLECTION!\nCollect the cards of magical creatures and herbs in your diary.\nFeaturesEnter the world of Slavic legends!\nExplore gorgeous, hand-painted locations!\nMeet legendary characters from folk tales!\nShape the story with your choices!\nEnjoy the immersive work of a famous voice actor!","imageUrl":"https://media.rawg.io/media/screenshots/3c8/3c806681d3f0352fa078a720253ad3c5.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":16536,"name":"Hide & Spook: The Haunted Alchemist","genre":"Action","price":0.0,"description":"Hide & Spook is a party game for 3 players for the HTC Vive!\nThe Alchemist wears the headset, while the two Ghosts take a controller each and sneak around the room trying to extinguish the candles, using the controller vibrations to locate the candles by feel!\nThe alchemist tries to \"catch\" them by staring at them and thus dispelling them from this earthly dimension, returning the ghosts to whence they came!\n======================\nGame Features:\nThe layout of the alchemist's lab changes every time you play!\nThe alchemist's lab scales to fit your room space, from small to large and in between.\nGreat local-multiplayer game for kids and adults alike!\nThis is a simple 3 player party game, set in a single room!\nIt is recommended that you have a clear space about 2m x 2m, or larger.\nEnjoy!\n======================\nHide & Spook began it's spooky life as a game jam game, as part of the Global Game Jam 2016.\nSince then, we gave it a bit of a spit polish, so you fine VR enthusiasts can try something a bit different with your HTC Vives.\nCredits:\nGame design and production:  Murray Lorden and Tyler Perry.\nProgramming by:  Andrew Giannopoulos, James Whyte, Tyler Perry, Josh Leo.\nMusic by Aaron C Edwards.\nEnjoy!","imageUrl":"https://media.rawg.io/media/screenshots/cb7/cb7ff65378932397fbed46760c167504.jpg","releaseYear":2016,"developer":"Murray Lorden","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16480,"name":"I Am Vegend - Zombiegeddon","genre":"Action","price":0.0,"description":"Captain the Vegendary Heroes, survive the Zombiegeddon and take revenge upon the birds, the pigs, and the zombies! Enjoy this mind-blowing travesty of mobile game hits! - Enemies have joined forces to destroy all plants! They trample down young innocent seedlings, besiege the allotment and steal the seeds! Take charge of Vegendary Heroes special fertilisation squad and box the blighters mugs! To win, you will have to use anything that can shoot – and you'll find that nearly everything CAN! - The final battle will require total involvement: baste the birds with tomatoes, take advantage of carrot ordnance, chop zombies and sprinkle on the salad to watch your green-as-grass recruits grow into seasoned sergeants.Features:11 superfighters, each with a unique fighting style (and potential for development!)\nA host of enemies endowed with various abilities (any resemblance to famous persons is entirely coincidental)\n45 fascinating missions: base defense, hostage rescue, carpet bombing, etc. (we won't leek [gettit?] any more secrets for fear of spoiling your pleasure!)\nElementary controls – you shoot where you tap!\nAnd if that doesn’t fill your boots - for afters we got screwby bonuses and SUPER BOSSES!","imageUrl":"https://media.rawg.io/media/screenshots/89c/89c9d0c79b6fca8f018a2de601a33e2a.jpeg","releaseYear":2014,"developer":"Libredia","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15504,"name":"Dungeon Defenders Eternity","genre":"Action","price":0.0,"description":"Dungeon Defenders Eternity is the definitive version of the hit tower defense action RPG! Slice, shoot and pulverize your enemies, or build defenses to do the dirty work for you. Grab three friends and build a team of heroes from twelve different classes, each with their own defenses and abilities. Then embark on an adventure to defend Etheria from the Old Ones’ army!\nEternity boasts all new missions, new features, a rebalanced endgame, secure online play (no more hacking!), along with a wide selection of content from the original game. Now is the perfect time to experience Dungeon Defenders and its expansions the way they were meant to be played!Key FeaturesDefend with towers\nFour-player online co-op\nGround-breaking story about a group of children who try to save the world\nLevel up 12 different hero classes\nArgue about which hero is the best on our forums\nKill an Ogre with a chainsaw sword\nFight a gigantic dragon (Spoiler!)\nPut some wings on your heroes and dye their clothes pink -- because you can\nLook up the best map builds online; pass this knowledge off as your own[/b]What's NewNew Content:\n5 campaign missions including Embermount Volcano with an all new Boss Fight & cinematics and Omenak with an all new Boss Fight\n2 new bonus missions and a new challenge mission\nA new community made mission (Moonbase)\nVisible armor system with 70 new armor pieces\n10 combat consumables (throw grenades, summon lightning storms, instantly heal your defenses, and more)\nAmulets that let you find and equip unique hero abilities\nNew Features:\nSecure dedicated servers for anti-hacking protection\nDyes that allow you to customize costumes and visible armor\nCrafting system to create and modify high tier items from blueprints\nPet hatching and growth system, with activatable abilities\nDashing and manteling systems for better mobility\nWeapon swapping between two weapon sets\nCommunity tavern, where you can talk and trade with up to 16 other players before starting a mission\nPrivate tavern, where you can start missions with just yourself and your friends\nQuickmatch feature where you can quickly join a mission with other players (optional)\nCross-Platform play with PC, Mac, Linux, and Mobile all playing on the same servers\nOne Dungeon Defenders account, with your progression accessible from any account. Playing on supported Android devices requires purchasing the game on Google Play.\nTransmog System which allows you to change how your visible armor looks (or make it invisible!)\n34 new equipable emotes (not included with purchase of base game)\nRebalanced Gameplay:\nRebalanced missions for shorter match times, less farming, and more interesting enemy clusters\nRebalanced stat system, so increasing stat points in the end game has a larger effect\nRebalanced, instanced loot system that drops less loot at higher quality\nA revised Survival Mode, with shorter play times.\nA revised Hardcore Mode with better rewards\nA revised User InterfaceWhat's Returning\nOur favorite Dungeon Defenders content:\nAll 12 Dungeon Defenders heroes\nAll 12 original Dungeon Defenders campaign missions and challenge missions\nAll 5 Quest for the Lost Eternity Shards campaign missions and 7 challenge missions\n5 bonus missions (Glitterhelm, Karathiki, Tavern Siege, City In The Cliffs, Tinkerer’s Lab)\n2 community made missions (Akatit Jungle, Palantir)\n22 original Dungeon Defenders hero costumes (found in your item box and equippable as a costume item)Important Notes:Dungeon Defenders Eternity is rebuilt from the ground up for security, so you will not be able to continue your previous Dungeon Defenders saves.\nDungeon Defenders Eternity requires an internet connection to play online. There is a offline mode beta, where after updating the game you can play offline with separate heroes.\nDungeon Defenders Eternity requires you to create a playverse account.","imageUrl":"https://media.rawg.io/media/screenshots/7ec/7ec9cd0affdbb2c190a4565a16cf4501.jpg","releaseYear":2014,"developer":"Nom Nom Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14645,"name":"AuroraRL","genre":"Action","price":0.0,"description":"Player takes control over a spaceship that was built with the cooperation all human nations.\nHis task is to explore space, establish relationships with alien races and bring back home any valuable objects.\nAnything, from artifacts of forgotten civilizations to new technologies, from unusual lifeforms to secret alien cookie recipes\ncan help Earth overcome its political and energy crises. The human governments will monitor your efforts:\nthey won’t let you waste their time and use the precious spaceship inefficiently. And who knows what dangers\ncan be found in outer space, dangers that can be a threat not only to the lone vessel, but to the entire civilization...\n1. Adventures and combat in space, on planets and inside spaceships.\n2. Procedurally generated universe: star systems, planets, even animals and plants.\n3. Many different alien races. Some may become your allies while others will definitely become your enemies.\n4. Global storyline and large variety of quests.\n5. Communicate with your crew members and officers, discover their story and personality\n6. Research and development system: discover new technologies and upgrade your ship\n7. Global strategy elements - help humanity establish first colony and outposts outside Solar system and choose\nhow they should progress.","imageUrl":"https://media.rawg.io/media/screenshots/141/1419db9a956fe813c5977288bde08b7d.jpg","releaseYear":2016,"developer":"Sun Dogs","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14582,"name":"Messiah","genre":"Action","price":0.0,"description":"About: Bob is a working-class angel ordered by God himself to go and clean up the putrid, disgusting, sleazy, and infested world of the future. He has been given the power of possesion so that he can sneak up on any person, animal or genetically engineered being and leap right into their souls!\nWith your help, Bob can then use their bodies, their weapons, or even their bare hands to strangle, cripple, impale, and incinerate the cities of sinners sent to stop you from finding Satan himself. Hiding in their souls, Bob can use these sinners' bodies against their will as armor (to take pain for him), or he can use them for camouflage (to hide inside them) and pretend to be just another twisted citizen in the Messiah world...\nThe rules are up to you - enjoy the freedom.\nPossess anyone you want and make them do your bidding\nA grim Cyberpunk atmosphere with a touch of the divine\nSave humanity from the Devil using your brains and your enemies’ brawn","imageUrl":"https://media.rawg.io/media/screenshots/6dd/6dd473b1e76c1efb872e74ad40c5000a.jpg","releaseYear":2000,"developer":"Shiny Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13604,"name":"Radium","genre":"Action","price":0.0,"description":"Radium is a physics-based skill game, featuring unique game controls. A game which avoids any non-essential elements and focuses on the elementary minimum.\nNavigate the ball through the levels, by controlling with two tractor beams that exert force on the ball. In some levels you need to collect tokens to activate the exit.\nThe polarisation change is simple but challenging. By collecting an item the interface changes to yellow, the ball falls upwards and the tractor beams pushes the ball away.Features:\n• 130 levels of increasing difficulty\n• Unique physics-based game controls\n• Automatic zoom and scroll function\n• Polarization change\n• Pure minimalism","imageUrl":"https://media.rawg.io/media/screenshots/58f/58f819e198bc2212661d696c685b7fb1.jpg","releaseYear":2015,"developer":"Lukas Jaeckel","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13559,"name":"Puzzle Cube","genre":"Strategy","price":0.0,"description":"Puzzle Cube was initially developed as a game jam entry for the theme \"Life in 2 Dimensions\". It provides a variation on the challenge of solving the 3x3 cube, by limiting the view of the 3D cube to a 2D perspective and limiting the controls somewhat. The cube can be manipulated to any of the possible configurations that a Rubik's Cube* can.\nThis current version of Puzzle Cube has been developed and is being published as a resume piece. Because of this, it will always be free! With enough interest, development will continue, adding more features to the game.FEATURES\nOnline Leaderboards\nVarious Music, Background, & Cube Skin settings\nThe timer can be disabled (must return to the main menu to re-enable it)\nTutorial Video Link for learning to solve the cube\nKeyboard & Controller support (tested w/XBox One Controller)\n* Puzzle Cube is not associated with or endorsed by Rubik's Cube. This software does not infringe on any Rubik's Cube patents or trademarks. Copyright does not apply to the physical Rubik's Cube product.","imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb760261133ac87a5092f486ad46999a.jpg","releaseYear":2016,"developer":"ThinkOfGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13117,"name":"Cyborg Rage","genre":"Action","price":0.0,"description":"Cyborg Rage is a multiplayer coop space shooter that is all about cooperative online action: Work with your brave wingman to destroy all enemy starships or be destroyed! Master the advantages of your ship class to withstand your enemies!\nCyborg Rage is your source for fast-paced action, massive explosions and a cooperative gameplay core for two pilots that demands good reflexes and fast strategic decisions.Face the future\nThe year 3226: The future. Battle Cyborgs were never designed to be smart or develop any kind of self-awareness. They had been produced in masses as expendable military units. It was a time when security was more valuable than freedom. We sent them to the frontlines.\nToday, they return.\nChoose your ship\nCombine your ship technologies with those of your wingman for a maximum of cooperation!\nDepending on your chosen ship, your arsenal may include a destructive EMP missile, a missile barrage, instant shield rechargers, an electric field, a nano repair impulse, a massive shield, the devouring nuclear missile... and more technologies that will leave your enemies without doubt who is dominating this sector in space.Pilots unite\nMake one of your friends your trusted wingman or let the matchmaking find a player of your skill level to face the challenge together! Just remember: For the moment, you two rely on each other!\nFEATURES\n• Top Down Arcade Shooter\n• Cooperative Online Multiplayer for two pilots\n• Matchmaking with adjusting difficulty\n• Rank up in 5 Leagues\n• Achieve medals\n• Unlock artwork in the gallery\n• Single Player Campaign\n• 3 Button Mouse, Gamepad and Keyboard Controls\nResistance is futile. You will be assimilated. Buy Cyborg Rage today!","imageUrl":"https://media.rawg.io/media/screenshots/877/87756b7b06a05176c9163afdf65ed430.jpg","releaseYear":2016,"developer":"Ragiva Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11550,"name":"MANOS","genre":"Action","price":0.0,"description":"\"This game will be bigger than Skyrim!” - Bill Corbett, Rifftrax/Mystery Science Theatre 3000\nRemember how every film had it's own platform game adaptation? When every man, woman, child, animal and inanimate object were out to get your character? When the streets were filled with bats, ghosts and Frankenstein monsters? MANOS: Director’s Cut will take you back to the absurd adaptations of the past!\nLost on their vacation, Mike and his family have wandered the desert trying to find a place to stay, only to wind up in the mysterious Valley Lodge. Maintained by Torgo, an unusual man/satyr who \"takes care of the place while The Master is away\", the hotel is swimming with paranormal activity which Mike has to brave through to find his now missing family. Who is The Master, and what does he want with Mike's family? Armed with his trusty revolver, Mike will have to wander the haunted halls, venture out into the desert, uncover a dark temple and battle the forces of darkness to find out!\nThe worst movie of all time is now a video game!\nHomages to all of your least favourite terrible movies and games!\nRetro-style cut-scenes telling the not-so-classic story of MANOS, with art by Matt Kap, the pixel artist from The Binding of Isaac: Rebirth and Castle in the Darkness.\nUnlockable PLAY AS TORGO mode","imageUrl":"https://media.rawg.io/media/screenshots/0e6/0e6ec52557c8ce15f751df3e37c143c5.jpg","releaseYear":2015,"developer":"FreakZone Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9813,"name":"Protonwar","genre":"Action","price":0.0,"description":"Protonwar is a multiplayer focused, Fast paced AFPS with an emphasis on quick and flowing movement.\nFull Room Scale VR with HTC Vive and Oculus Touch. Also included Non-VR and Seated VR.\nLocomotion Options for Room Scale VR include a Teleports only mode, and an Advanced mode with multiple locomotion options\nWARNING!\nAdvanced mode may cause VR Sickness for some people, please try the teleport only mode if this is an issue for you!, Thanks!\nJumping with controller gesture's (physics based)\nalso, combine a trackpad jump + controller jump to do tricks!!!!\nTricks like - Dodging, Doublejump, Speed jumping (time to strafe jump in vr lads!)\nTo initiate hold down the climb button, move your controllers down quickly and then release the button, you should quickly get the hang of it, it is all about timing the release correctly. You can use this to push yourself in any direction, for extra fun, jump using the trackpad, then dodge left or right!\nFull Climbing!\nFinally, if there is a wall you see that looks bad ass, you can climb right up that bad boy! Why? Because you can! and it's fun!\nYou cannot shoot while you are climbing though, so watch your back!\nAlso use those mad methods with:\nArm Swing\nPlayer relative\nIncludes game modes:\nDeathmatch\nTeam Deathmatch\nCapture the Flag\nDomination\nHorde Mode\nand more on the way shortly!\nIncluded gameplay Mutators such as:\nBullet Time!\nLow Gravity\nInstagib\nBig Head Mode\nAll Weapons Mode\nand more!\nPlay with a friend, using your friends list for a Steam P2P game. Or play on our dedicated servers. Or host your own using the provided dedicated server executable.\nDesigned for PC players with extensive customization through UI, Config files and Console commands.\nCurrent levels:\nDM-Abyss\nDM-Aerowalk\nDM-Castle\nDM-Hazardous\nDM-Ruins\nDM-Ruins-Night\nDM-Overgrown\nDM-TrinityStation\nOvergrown\nSwampLands\n\"Horde\" mode playable on ALL maps!","imageUrl":"https://media.rawg.io/media/screenshots/b5f/b5fefae07fcfdc19ed8ee66f7c20ba47.jpg","releaseYear":2016,"developer":"Outer Planet Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9773,"name":"Life Forge ORPG","genre":"RPG","price":0.0,"description":"Life Forge is a Free 2D Online RPG. Take part in this sprawling adventure as you explore a massive world, gather resources to craft gear, engage in PvE and PvP, and buddy up with your friends to conquer end-game bosses! With lovingly made custom art, a variety of fun and engaging features, and the heart and soul of a tight-knight community, Life Forge promises to be a game to remember!\nLife Forge is made in SkywardRiver's custom Engine, with contributions from Benjo. (This is not an RPG-Maker game!)\nLife Forge is an ORPG designed to be what you make of it.\nThe story is simple, you are found unconscious along a shore line by an elderly man who leads you to his home for shelter. There, the player soon realizes they have no memories, of course and the world in Life Forge is all new to them. From here, the players life is whatever they make it. A Life Forge, if you will.\nIn the world of Life Forge there is lots to do and be a part of. Players can become great and powerful heroes or, if they wish, villains and take part in quests, explore dungeons and have PvP battles in arenas. If a player decides they don't want to run around and take part in adventurous deeds then they won't have to. In Life Forge crafting is available as well, so If a player wishes then they can harvest all sorts of goods to create a variety of items. All of which they can either use for themselves or sell to other players. Guild and Player housing are also planned features for the game, giving players another little slice of variety and choices which will make their game play unique.​\nFeatures:Mount System\nUse mounts to travel faster! Different mounts will travel at different speeds and there will be several to choose from.Character Creation\nChoose your characters gender and their hair style. We plan to add new races as well.Death and Revive system\nWhen your character dies, you will have 60 seconds to either wait and be revived by another player or respawn back at your last check point.\n*Note: You can press \"V\" to respawn anytime within that 60 seconds.Crafting\nUse materials to craft items and gear! Crafted items will generally be better then what you would find at a shop.Custom Graphics\nYou wont find any RPG Maker graphics here!Stamina and Weight system\nItems have weight and your character has stamina. The more weight you're carrying the less stamina you will have which will cause your character to move slower. Stamina can be raised through strength and endurance.Boss Framework\nEach boss is created to be unique for a more enjoyable boss battle. Custom programming for each boss is put into the game, so expect a challenge!Threat System\nYour character will gain threat when in battle! Be prepared, enemies will attack the fighter with the most threat first. There are also taunt skills to increase your threat even more, for those who feel bold anyways.Quests with Quest log and Tracker\nKeep track of your quest progress and pin the ones most important! By clicking on the quest while in to quest log, the quest(s) will pinned to the game screen for easy tracking!Talent System\nThere are three different skill trees to apply talent points too, giving players the chance to make their character a unique and fun experience.\nAnd of course we have all the basic needs of an ORPG...\nGuilds\nDungeons\nProjectile Weapons\nBlinding Spells\nInvisibility Spells\nSpell Casting and Projectile Enemies\nPaperdolled Items\nZelda-Like Puzzle Systems\nMany other fun features!\n~Life Forge Dev Team~\nSkywardRiver - Lead Developer, Lead Programmer\nZetasis - Lead Developer, Artist\nBenjo - Programmer, Server Host\nNikakosa - Developer\nRex - Developer","imageUrl":"https://media.rawg.io/media/screenshots/d56/d56ae153c285b1e4445015b7b736862a.jpg","releaseYear":2017,"developer":"Rex","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":8893,"name":"Drive to Hell","genre":"Action","price":0.0,"description":"Drive to Hell is an action-packed shooter where you'll take a ride through an army of monsters to exact revenge on the Demon King for destroying your favorite dive bar. Enemies assault from all sides, each with its own special personality and attack style. To take them down, you'll have access to many weapons and items as well as unique vehicles, special abilities and more!\n5 levels with 5 waves apiece, each with its own unique look\n3 difficulty Settings, challenging beginners and experts alike\nUp to 4-player local co-op\nEndless survival mode\nMirror mode\nOver a dozen power-ups & weapons\nHordes of deadly monsters including 5 bosses\nNumerous vehicles each with their own stats & special abilities\nTrophy system with a reward for completion\nOriginal soundtrack\n3 control options (keyboard/keyboard & mouse/controller)\nPlease see Drive to Hell controller guide for more detailsCustomizable options for sound & display\nVertical display resolution options\nSteam achievements & trading cards","imageUrl":"https://media.rawg.io/media/screenshots/0c6/0c62e3b5b1ed34e7e6f580c3b9a75e89.jpeg","releaseYear":2014,"developer":"Ghost Crab Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5612,"name":"London 2012 - The Official Video Game of the Olympic Games","genre":"Sports","price":0.0,"description":"With new sports, new events and new gameplay modes, London 2012 brings the world’s ultimate sporting event to life bigger and better than ever before. Take to the track, negotiate the Velodrome and dive into the deep end in stunning HD while you compete for the pride of your nation. Hone your skills in the Olympic Games mode, and play with or against your friends and family in a variety of multiplayer modes.","imageUrl":"https://media.rawg.io/media/games/6d5/6d52bf52e16a7fe876529a54ba8b9d86.jpg","releaseYear":2012,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3495,"name":"Adventure Time: The Secret of the Nameless Kingdom","genre":"Action","price":0.0,"description":"GAME SUMMARY\nWhat time is it?  It’s time to join Finn (the human) and his best bro Jake (the shape shifting dog) on an original heroic adventure through the mysterious Nameless Kingdom. Go on epic quests, solve challenging puzzles and uncover hidden secrets by exploring a new realm created exclusively for the video game.\nFEATURES\n•\tPlay as Finn with help from his homie Jake!\n•\tAn original top-down action adventure!\n•\tExplore the wild and uncharted Nameless Kingdom, encounter brand new princesses, characters and foes as you battle your way through unique temples and an overworld filled with danger!\n•\tUnlock and upgrade abilities and weapon techniques while exploring and collecting all kinds of stuff!\n•\tDiscover hidden secrets, solve challenging puzzles and complete hilarious quests!\n•\tEncounter new and fan favorite characters including Ice King, Gunter, Marceline, Lumpy Space Princess, Flambo, Magic Man, BMO and more!","imageUrl":"https://media.rawg.io/media/games/ef4/ef4ddb8dbf497a59a51e52feaccd8391.jpg","releaseYear":2014,"developer":"WayForward Technologies","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"}]},{"id":1398,"name":"Pharaonic","genre":"Action","price":0.0,"description":"In Ancient Egypt, death awaits at every corner\nPharaonic is an unforgiving sidescrolling Combat-RPG set in Ancient Egypt. Explore a vast kingdom full of dangers and brutal enemies while you find the truth behind Ahmosis I, the Red Pharaoh.\nOnly the most audacious warriors will have any chance of success. The Pharaoh's army and countless dangerous creatures will stand in your way.Original and streamlined combat system\nPolish your combat skills to the finest and loot the best gear possible to even have the slightest chance of overcoming this difficult endeavor. Will you opt for lightweight equipment, trusting on your agility to avoid death? Or will you prefer to take the blow and strike back even harder? The decision is entirely yours to make.Get ready to challenge the gods\nThroughout your path you will find help from the Daughters of Ishtar, as well as the oppresed countrymen. Learn new skills and subdue divine powers to overcome your opponents. Drink from your life-water canteen to heal your wounds, and acquire new equipment that will help you avoid death one more day.\nIt's a tough journey, but the Gods believe in you. Will you be worthy of that honor?\nPharaonic takes the excellent combat design of Dark Souls and adapts it to a faster paced side-scrolling environment. Use your shield to block and parry incoming attacks, manage your stamina and wait for your chance to attack and defeat your enemies. A single mistake can be fatal, so stay on your toes to avoid making any.FeaturesExplore an Ancient Egypt full of traps and treacherous enemies\nExhaustive, refined and satisfying combat system.\nComplete character customization, with hundreds of pieces of equipment at your disposal.\nFace impressive bosses and their minions in epic fights full of tension.\nTalk with plenty of colorful characters to fill the blanks in your memory and learn what's happening to the kingdom.\nLots of secondary paths to explore, full of treasures and traps.\nDozens of weapons and shields with different combat styles.\nUse the powers of the Gods and cast spells that will help you in your journey.","imageUrl":"https://media.rawg.io/media/screenshots/bb8/bb8dc95abb262b65c4f4956c86b92cb3.jpg","releaseYear":2016,"developer":"Milkstone Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":224,"name":"Ascension: Deckbuilding Game","genre":"Action","price":0.0,"description":"Ascension: Chronicle of the Godslayer, was the first officially licensed deck building card game for iOS, and is now available for your PC as Ascension: Deckbuilding Game, complete with 5 full expansion decks!  Play alone or with friends to battle against the Fallen One for honor and victory. Conceived and designed by three Magic: the Gathering tournament champions, Ascension will provide hours of engaging and strategic game play for enthusiast and experienced gamers alike.\nHighlights\n• Over 300 beautifully detailed cards, hand drawn by Eric Sabee.\n• Full asynchronous support for multiplayer online games.\n• Play against multiple A.I. opponents using varied strategies.\n• Introductory tutorial to teach you how to play.","imageUrl":"https://media.rawg.io/media/screenshots/b97/b979891cc35388daee3baacee0e96324.jpg","releaseYear":2011,"developer":"Playdek","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":979140,"name":"Doronko Wanko","genre":"Action","price":0.0,"description":"『DORONKO WANKO』 is a DORONKO Action Game.\nIn this game, you can become a cute, innocent pomeranian.\nAnd you can make your master's home messy and dirty.\nLet's explore this beautiful house and make it dirty and muddy at will!\nPomeranian can get muddy by \"rubbing\"  against the \"mud\" spread on the floor.\nSpread out the mud with \"splash\"!\nLet's make the whole area muddy and messy.\nSometimes you can find \"hidden pome\" when you are spreading mud all over the house.\nWhen you find all the \"hidden pome\", the \"Good Smell Room\" 's door will open.\n(Let's go inside quietly before others notice!)\nMore mud, more damage!\nYou can check the total amount of damage you have caused from the ending “Receipt”.\nWhen you cause enough damage, you will receive a “gift”?!\nThey will help Pome’s exploration by making it easier to splash mud and obtain key items.\nA little action can cause a huge damage?\nUse personal appliances and toys to get even muddier.\nThe Pomeranian's adventures will remain as a \"badge of memory\".\nA random move may get an unexpected badge.\n\"Put on\" the \"Goods\" and make your Pomeranian more pretty.\nDon't forget the special goods that can release mud!","imageUrl":"https://media.rawg.io/media/games/c27/c272411e5c89f5eb43db90b412b61e9f.jpg","releaseYear":2024,"developer":"Bandai Namco Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":808817,"name":"Tower Princess: Knight's Trial","genre":"Action","price":0.0,"description":"Add Tower Princess to Wishlisthttps://store.steampowered.com/app/1138650/Tower_Princess/\nAdd to Wishlist\nAbout the Game\nOnce upon a time, in a Far Away Land, an Evil Dragon took prisoner every royal heir he could meet. Lots of worthy suitors of every kingdom tried to face the beast, without success. Now it's your turn! You'll have to do your best to beat the dungeon, defeat the dragon, and manage the most perfect date!\nEvery run is a unique adventureA fresh gameplay combination of 3D platforming & roguelite. Choose your knight, invite the princess and take them to the Castle full of procedurally generated dungeons and traps!\nChoose the weapon that suits your playing style!Take a sharp and mighty sword or a long rifle that allows you to fight from a distance and upgrade it with extra abilities!\nCheerful & light-hearted atmosphereDive into the cheerful atmosphere full of encouragement and support. You don't have to be a perfect knight to succeed!\nLet not the charming visual style trick you!The game is inspired by the classic adventure games, 3D platformers and the Dark Souls series and not as casual as it may look at a first glance!\nhttps://store.steampowered.com/app/1138650/Tower_Princess/","imageUrl":"https://media.rawg.io/media/screenshots/d5e/d5eefbde994d4f7429ff93ddc4538bc8.jpg","releaseYear":2022,"developer":"AweKteaM","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":772537,"name":"Sonic Origins","genre":"Action","price":0.0,"description":"Celebrate the games that started it all. Sonic Origins is a brand new collection including Sonic the Hedgehog, Sonic CD, Sonic the Hedgehog 2, and Sonic 3 & Knuckles.\n\nPlay as Sonic, Tails, & Knuckles and immerse yourself in the fully remastered gameplay, tie the games together with all new animations, explore added features, modes, and more!","imageUrl":"https://media.rawg.io/media/games/8d0/8d0d4ee64321119d37ef8d140184a639.jpg","releaseYear":2022,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":589154,"name":"Cook-Out","genre":"Simulation","price":0.0,"description":"Get Your Aprons Ready… Things Are About To Get Messy! The award-winning multiplayer VR cooking game from Resolution Games will soon sizzle on Steam.\nSet within the cook’s cabin of a fairytale forest, Cook-Out: A Sandwich Tale is a wacky and whimsical adventure - brought to you by the creators of Angry Birds VR: Isle of Pigs, Bait! and Blaston - that challenges up to four players to work together to keep the orders coming for a hungry cast of enchanted creatures in this multiplayer VR game.\nAs players progress through increasingly hectic levels, they’ll not only prepare meals but will also need to fight off a number of nasty customers who seem absolutely set on making trouble -- like jesters who will hide parts of orders, or thieves who will keep pilfering ingredients.\nWhile the game is focused on cooperative play, solo players will be able to enjoy the experience with the help of a simulated partner, making sure there’s always a team to tackle tough orders and restore the calm to this wild kitchen.","imageUrl":"https://media.rawg.io/media/screenshots/4c1/4c1cc80e9ea8cb0bd0a25513c16420cf.jpg","releaseYear":2021,"developer":"Resolution Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":491319,"name":"Accident: The Pilot","genre":"Simulation","price":0.0,"description":"Check out more gameshttps://store.steampowered.com/app/991170/Barn_Finders/\nhttps://store.steampowered.com/app/689980/Car_Trader_Simulator/\nAbout the GameBecome a journalist who researches old car accident cases. Help victims and perform first aid, obtain evidence and reconstruct the events to discover what really happened.\nhttps://store.steampowered.com/app/852220/Accident/Examine the victimsEvaluate the victims' condition and get to work!   Are they breathing? Do they have any serious wounds? Anything might be crutial to their survival. Provide first aid, control the bleeding, check for pulse and put them in recovery position if you can. Do whatever is necessary depending on nature of the emergency.Make decisionsWho to help first? How to do it the best way? By helping the wrong way, you can put other people's life in danger, or even your own. Think twice but remember - time's running out!Rewind timeYou made a bad choice? Didn't manage to save all the wounded victims? You have a chance to fix that! Turn back time and try again.Find the reasons behind accidentsWhen you're helping someone, every second counts, there's no time for deep examinations on the reasons behind the accident. But at the end of your rescue mission, you'll be able to analyze the whole situation, pick up the pieces and find out what caused the accident.Various rescue mission scenariosBe a part of different rescue missions: from simple car bumps to serious chain-reaction crashes in various locations, weather conditions and even at different times. Gain experience and learn how to help people in real life situations.","imageUrl":"https://media.rawg.io/media/screenshots/773/773dd70e10b34a0f38864470548eacfd.jpg","releaseYear":2020,"developer":"Glob Games Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":484764,"name":"Barro 2021","genre":"Racing","price":0.0,"description":"Barro 2021 is the next gen for the Barro series, new mechanics, new race tracks, more fun.\nThe game:\nCasual race, just have fun.\nTime trial, do your best and compete with players all around the word.\nLocal multiplayer, split screen,  challenge your friends!\nNew race tracks.\nNew cars.","imageUrl":"https://media.rawg.io/media/screenshots/56e/56e11dca325368708c13f908f0493480.jpg","releaseYear":-1,"developer":"SC Jogos","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":482921,"name":"Little Witch in the Woods","genre":"Adventure","price":0.0,"description":"Little Witch in the Woods is a heartwarming life sim about Ellie, a witch's apprentice. Make potions, study magical creatures, and help the local townspeople in Ellie's journey to become a full-fledged witch.","imageUrl":"https://media.rawg.io/media/screenshots/0dc/0dc90b6b34c4966f50f8831ee433eca5.jpg","releaseYear":2022,"developer":"SUNNY SIDE UP","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":455585,"name":"New Pokémon Snap","genre":"Simulation","price":0.0,"description":"Seek out and take in-game pictures of Pokémon in their native environments in the New Pokémon™ Snap game, only for the Nintendo Switch™ system! You'll even discover behaviors and expressions you've never seen before when you encounter and research lively wild Pokémon.\n\nExplore environments, take in-game pictures and fill your Pokémon Photodex\n\nTravel to unknown islands with beautiful scenery like lush jungles and sandy beaches. The Pokémon pictures you take there will be used to build your very own Pokémon Photodex!\n\nThis brand-new game brings the gameplay of the 1999 Pokémon Snap game for the Nintendo 64™ system to life on the Nintendo Switch system with unknown islands to discover and different Pokémon to see!\n\nPhotograph lively wild Pokémon in their natural habitats as you research and explore unknown islands. Journey through a variety of environments such as beaches and jungles to capture previously-unseen Pokémon behaviors. The photos you take can also be used to fill out your very own Pokémon Photodex!\n\nSee a different side of Pokémon in a new photo-snapping adventure, only on Nintendo Switch\nResearch various Pokémon in their natural habitats and capture Pokémon behaviors that you’ve never seen before\nExplore unknown islands with scenery like lush jungles and tropical beaches throughout your journey\nTake in-game photos to make your very own Pokémon Photodex","imageUrl":"https://media.rawg.io/media/screenshots/967/967d912c7ae0a728bd2f78bce076eb9c.jpg","releaseYear":2021,"developer":"Bandai Namco Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":428022,"name":"Element TD 2 - Competitive Tower Defense","genre":"Strategy","price":0.0,"description":"Overview\nElement TD 2 is a competitive tower defense game based on elemental combinations. The elements that you choose determine the towers that you can build. Compete against other players and prove that your defense can last the longest!Features\nCompetitive multiplayer with up to 8 players\nGlobal servers allow for cross-region play\n44 Towers with unique abilities and multiple upgrade paths\n8 Maps to mix up your tactics on different layouts\n55 Waves to challenge your defenses, plus an endless boss\n5 Modes to alter the gameplay (Random, Chaos, Short, Extreme, God)\n6 elements for combining towers (Light, Darkness, Water, Fire, Nature, Earth)\nLeaderboards to compete against other players for top score\nReplay support to show off your victories and learn strategies from others\nHistory\nElement TD 2 is the culmination of 15 years of competitive multiplayer tower defense development. ETD started back in 2005 as the most prominent WarCraft 3 tower defense custom map. It then returned in 2011 as a leading StarCraft 2 arcade game. Twice wasn't enough though, so in 2016 Element TD returned again as a massively popular Dota 2 custom game. It debuted on mobile devices in 2016 as well.\nWith Element TD 2, we finally present the standalone sequel that is the best iteration of this series.TeamDevelopment is lead by the same team behind every other version of Element TD. ETD 2 is not a departure from the classic gameplay that players have enjoyed over the years.","imageUrl":"https://media.rawg.io/media/screenshots/f18/f18250f9b2048115e63469000cf64aa2.jpg","releaseYear":2021,"developer":"Element Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":224848,"name":"Car Mechanic Simulator","genre":"Simulation","price":0.0,"description":"Now you can feel how it is to be a car mechanic with PlayWay's Car Mechanic Simulator:\n- Collect experience points and prestige\n- Buy licenses for new cars\n- Invest in training agents and advertising\n- Upgrade your workshop\n- Upgrade owned tools and equipment\n- Choose the most interesting from among many available jobs\n- Replace or repair faulty parts\n- Plan purchases of spare parts\n- Complete special tasks\n- Collect awards\nCar Mechanic Simulator is a must have for auto mechanics and fans of the world's most popular autos!\nThe game features:\n- 4 different cars\n- 3 different works shops\n- Nearly 80 different car parts\n- More than 50 types of defects reported by customers\n- Unlimited count of ordered services\n- Unlimited count of special tasks\nGame is free for all without any limitations!","imageUrl":"https://media.rawg.io/media/screenshots/402/4029ae75a37cfac6e95a35cb04265c44.jpg","releaseYear":2019,"developer":"PlayWay","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":60812,"name":"Golf Peaks","genre":"Sports","price":0.0,"description":"Tiny puzzle game where you climb mountains by playing golf.\r\nComing Q4 2018.","imageUrl":"https://media.rawg.io/media/games/84e/84e5fac8fdaad74cced3ee70f7d4ef32.jpg","releaseYear":2018,"developer":"Lukasz Spierewka","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":60550,"name":"Good Company","genre":"Simulation","price":0.0,"description":"Good Company is a single- and multiplayer management simulation about building, automating and optimizing your robot manufacturing empire, set in a colorful 80s-inspired world.\nYou start your Good Company literally with your own hands. With time and more workers, your duties shift. Have managers organize your employees, while you optimize processes and design robots to please the markets. But don’t forget: success is not only about profit. It’s also about reputation, as a boss, and as a corporation.\nPlay in singleplayer (campaign and sandbox mode)\nOr in multiplayer with or against your friends\nResearch new technologies\nDesign your own products\nEmploy managers to optimize production processes\nHire and train new staff\nCreate the optimal workplace for your employees\nManage relationships with contractors, other companies (and the government)\nEngage in stock trading and real estate\nPlan a global marketing strategy\nCompete against other companies for market share","imageUrl":"https://media.rawg.io/media/screenshots/e0a/e0af0f304945488704c9f4ff50ab771f.jpg","releaseYear":2022,"developer":"Chasing Carrots","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":60392,"name":"Creature Romances: Kokonoe Kokoro","genre":"Casual","price":0.0,"description":"This work contains many disturbing, grotesque images and images of non-human creatures. Please be aware of this if you decide to buy this game.Creature Romances - Kokonoe kokoro -\nBUG REPORT!\nTake on the role of Ichitarou Ichinose, an average, easy-going high schooler with an average life. He doesn’t know what his dreams for the future are. He doesn’t have any exceptional talents.\nBut can he win the heart of his childhood friend, Kokonoe Kokoro? She isn't like the other girls.\nShe's a grasshopper. A big one.\nEnjoy this sweet and charming romance story, with a life-or-death decision at the end.\nWill they live happily ever after or die without achieving even a fragment of their dreams?\nRemember: true beauty isn't found on the outside... exoskeletons are.\nContains explicit insect-ual content","imageUrl":"https://media.rawg.io/media/screenshots/949/949850a35ad719f3013a417ae0303631.jpg","releaseYear":2018,"developer":"Nostalgia","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":58756,"name":"Session","genre":"Simulation","price":0.0,"description":"Inspired by the golden era of skateboarding, the early 90s and early 2000, Session's primary goal is to make you experience what skateboarding really is; an incredible sport where there are no other goals other than expressing your creativity and achieving success through hard work, perseverance and bits of madness for no one else other than yourself.  The main purpose of the game is to live the sport in its entirety. Feel what it is to be a talented street skater.  Explore and tame the concrete, film yourself, your friends and share your footage on the internet with the worldwide skateboarding community.\nSession focuses on the authenticity of skating, both in the way the game feels and is presented to the player.  Based on this philosophy, each feature makes the game even more innovative, fun and respectful to the skateboarding culture.","imageUrl":"https://media.rawg.io/media/games/aba/abacd48c118ea106e27f1730f74e0e42.jpg","releaseYear":2019,"developer":"crea-ture Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]