[{"id":14643,"name":"Lone Leader","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e86/e868ab9fdbaef99c5d425bc2f1ced386.jpg","description":"My name is Matthew, I just finished my economic study. That means a new period in life, searching for a well-paid job. As a child I've always dreamed of the future. I imagined foreign adventures, exploring the outside world, living an exciting life, and making survival tours in countries far, far away. Unfortunately these dreams never came about, so I stopped dreaming. I’ve already applied for a job as notary, I should make more money than anyone else could, that was the plan. But a new local problem changed it a bit. The problem is a new type of virus. Oh no, not a virus that makes you ill, no it changes you into a monster, half alive, half dead, a ZOMBIE! Is there any medicine for this? No, of course not.\nThe virus came from the laboratory in the city, a professor contracted it from a sample specimen during a simple lab experiment gone nightmarishly wrong. That meant the beginning of the nightmare I’m in now. Why? Because I’m the last normal human in here except the soldiers of the enemy army who started occupying the city before the virus broke out.\nHowever, it made my life a lot more exciting, interesting. It looks like my child dreams finally came true, but not in the way I've always imagined. For now I've got one thing to do, survive.\nOh, and why I’m still alive? Probably bad luck...\nLone Leader is a zombie apocalypse game, try to survive and break out of the nightmare that’s been created. Kill all the enemies such as soldiers and zombies. Watch out! You only have one chance, so do it right.\nYou spawn in an open world map as player Matthew. In first person you have to collect items to keep alive and escape from the city. The chilling ambience and frightening jump scares keeps players on the edge of their seat in this one of a kind thriller.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SGTTB_SirGoose","platforms":[{"id":0,"name":"PC"}]},{"id":14023,"name":"Darkstar One","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/748/748be0b3cff4a8fea922beff82479029.jpg","description":"Darkstar One offers a fantastic amount of freedom of choice. The story-based missions gradually lead you deeper into the galaxy to new races, new technologies and ever stronger opponents. Explore a vast array of solar systems in search of hidden artifacts of ancient races, essential objects for upgrading your ship--the Darkstar One.\nIn addition to artifacts, acquire credits to purchase better equipment, such as weapons and shields. Earn credits in a myriad of ways: by taking on assignments, bounty hunting, piracy, smuggling, trading, escorting, transporting, rewards and more.\nA vast, simulated universe with many unique races, space ships and battle tactics.\nElaborate story, related by more than fifty minutes of video sequences.\nConfigure and upgrade your ship, Darkstar One, any way you choose--build a fast attack ship with many light weapons or a near-invincible cruiser with heavy weaponry.\nOver two hundred different weapons, shields and equipment items.\nRockets, torpedoes and mines feature special tactical uses: mines can fire at opponents or distract approaching missiles.\nThe \"Spell Weapon\": a special weapon with a powerful effect similar to certain spells in role-playing games. This weapon becomes increasingly versatile throughout the game and greatly increases tactical options.\nAcquire weapons from other races - Mount distinctive weapons from other races on \"Darkstar One,\" each featuring unique functions that require different battle tactics.\nEmbark on special missions - explore canyons or even underground on unknown worlds.\nFreedom of choice - earn credits in many ways: fighting, piracy, assignments, smuggling, trading, escorting, transporting, rewards, and more.\nPlay as the \"good\" or the \"bad\" guy and take advantage of political disputes.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Gaming Minds Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":11498,"name":"The Legend of Heroes: Trails in the Sky SC","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a6e/a6e684d3bba3ea0efff95d9d8b1af3ad.jpg","description":"The coup d’état that threatened to shake the foundation of the Liberl Kingdom has now come to a close and Her Majesty the Queen’s birthday celebrations are in full swing throughout the streets of Grancel. During that same night, a boy who vowed to make amends for his past disappeared before the girl he loved. Clutched in the girl’s hand was the one thing he left for her to remember him by: a harmonica. Now her journey to find him begins…\nThe Legend of Heroes Series Continues…\nThe tale of Estelle and Joshua concludes in this engaging narrative twice the size of its predecessor. Partner up with either Schera or Agate on over 70 hours of core gameplay to thwart the growing evil that threatens Liberl.\nAn Immersive Adventure\nThe meticulously detailed land of Liberl awaits your return with new quests, new mini-games, new collectibles, and new and familiar locations to explore populated by hundreds of unique NPCs with their own stories to tell.\nExpanded Combat System\nThe series’ staple strategic turn-based system with unmatchable customization has been taken even further with all new arts, crafts, upgraded orbments, and combo attacks.\nAcclaimed Soundtrack\nFalcom’s celebrated Sound Team jdk returns with 44 tracks to underscore the tumultuous resolution of one of the most moving and expansive JRPGs ever created.\nThe Hunter of Love\nMore Olivier than ever.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":10877,"name":"Ghost Song","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9c/f9c08f0e2215598eb15643f51b0fedd2.jpg","description":"The desolate moon of Lorian V is a place of curiosity, history, and terror. Awaken on the surface from a long slumber and explore the winding caverns below to uncover secrets, acquire new abilities and face powerful foes. Meet the sleepy, stranded inhabitants of Lorian V and hear their tragic stories. Only by doing all of this will you learn-- remember-- the truth.\nChallenging and rewarding \"Metroidvania\" gameplay\nExplore a large, connected, lonely world of secrets and discoveries\nPrecise, responsive controls\nLonely, isolated theme\nFully voiced NPCs\nAcquire new powers and weapons to discover completely optional hidden areas\nFeed and raise your pet into mysterious evolutions with varying effects\nTouching story of family, courage, redemption and closure","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Old Moon","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":268333,"name":"Walking Zombie 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e82/e8210040c8355038f4b4fa051332b0c2.jpg","description":"The world after the zombie apocalypse is a grim place. You were born into it so you will have to struggle to survive and fight against many kinds of zombies, bandits and dangerous boss monsters. You will be taking important story quests and many side quests, level-up your skills and perks, sell and buy equipment and communicate with (un)lucky survivors.Survival RPG and first person shooterWalking Zombie 2 is good old FPS with story, tens of quests and a lot of shooting stuff with different weapons. Your main enemies are zombies who already control the world - they are everywhere, in many different kinds and - most importantly - in great numbers. You will be using guns with different ammo, grenades or melee weapons to dispose of them and you will be able to heal yourself with medkits and food. As you complete more and more quests, your character will become stronger with better equipment, enhanced skills and gained perks. Will you have more hitpoints, better chance when lockpicking locks or lower fuel consumption while driving across the world map?FeaturesGood old singleplayer post-apocalyptics FPS\nAttractive modern polygon graphics style\nKarma system - good and bad deeds open new options and encounters\nTens of story and side quests\nMany weapons, protective gear and other equipment\nWeapon skins\nVariety of enemies - zombie walkers, bandits, huge boss mutants\nTraders in settlements\nFun minigames and sniper missionStory of the Chosen one with tragic pastCan your story end happily if its start was already pretty tragic? Thanks to the circumstances surrounding your birth, you are the only person that can save the world. You are immune to the effects of virus that turns people and animals into zombies. That also makes you a perfect weapon against undead masters of the planet and the symbol of hope for a better tomorrow. Find out whole truth about your origin and search for the way to create cure - together with friends you make on your path, despite the dangers lurking behind every corner.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Alda Games","platforms":[{"id":0,"name":"PC"}]},{"id":38731,"name":"Ben There, Dan That!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c5/4c5042cb7f136abdd6fd6905d0d4e3dc.jpg","description":"Ben There, Dan That! is a comical game about two buddies. The name of the game is a pun on \"Been there, done that\" and the game's main protagonists, Ben and Dan. They are named after the game's creators.\n\n###Plot\nThe story of Ben and Dan is written in the vein of movies like Bill & Ted's Bogus Journey. Ben and Dan are two friends who always wind up in misadventures. In the game's prologue, Ben has to reanimate Dan who became a zombie in the Peruvian jungle. As the game begins, the two are back to their London apartment. They try to fix their TV antenna to watch their favorite TV show, Magnum P.I. As a result, they are miraculously transported to an alien ship and have to find their way home.\n\n###Gameplay\nThe game is a traditional point-and-click adventure in which the characters have to use items from their inventory to solve puzzles. The player controls both Dan and Ben, switching between them when needed. There's a number of ways the characters can interact with the items and the environment. Each of them is highlighted by the shape of the cursor: a boot to move, a hand to take, an eye to look, etc.\n\n###Style\nThe game uses a very primitive cartoonish style with minimal animation, somewhat similar to animated comedies like South Park. It features a lot of long yet hilarious dialogues with occasional toilet humor. Ben There, Dan That! takes inspiration from the Lucas Arts adventure games like Sam & Max and Full Throttle and contains references to them.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Zombie Cow Studios","platforms":[{"id":0,"name":"PC"}]},{"id":20587,"name":"Final Dusk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f86/f863223734a3d98bdbede1eedda5a136.jpg","description":"Final Dusk is a unique combination of puzzle and action game. Each level consists of two distinct phases. First you need to manipulate the environment using multiple powers to create a safe path for Vampire Princess Mina. In the second phase you need to actively protect Mina on her way to her goal. As you advance you'll discover new locations and learn new powers which you must combine to be able to complete each level and learn the story of the princess and her beloved kingdom.\nA wicked curse has fallen on the people of the Kingdom of Vempire - everyone has turned to stone! It’s up to Mina, the vampire princess, to travel through her kingdom to the evil witch’s tower to reverse the curse.\n4 completely unique chapters\n80 levels\n4 different powers, each with two modes\nHand-crafted, logic and action-based puzzles\nMultiple ways to solve the puzzles\nChallenging bosses\nUser-friendly interface\nFunny and interesting story\nLovely manga art style\nBeautiful 2D animations","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Light Echo","platforms":[{"id":0,"name":"PC"}]},{"id":17033,"name":"YOU DON'T KNOW JACK TELEVISION","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/208/208e3bf6026a5244a65426f544a51325.jpg","description":"No, this is not a video of the YDKJ TV show that aired on ABC in 2001. It’s the YDKJ PC game with trivia all about TV shows! Fans of host Josh \"Schmitty\" Schmitstinstein will love this walk down boob-tube memory lane.\nIf you thought all those hours of watching TV were good for nothing, then YOU DON’T KNOW JACK… Television! With more categories than your local cable provider, YOU DON’T KNOW JACK Television spans over 50 years of boob-tube trivia, from Ralph Kramden to the guy on “King of Queens” who looks like Ralph Kramden. So set down the remote and put your recliner in the upright and locked position… it’s YOU DON’T KNOW JACK Television!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":14509,"name":"Khimera: Destroy All Monster Girls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31e/31e3dbfda29986cb297a6e1596a3f5fb.jpg","description":"Part human, part oni, golem and harpy! The list goes on and on! Born in a lab, Chelshia the chimera is the world's first synthetic monster girl. When her monster inhabited island home is threatened by a band of looting pirates, she springs into action to save the day!\nKhimera: Destroy All Monster Girls is your premiere monster girl beat-em-up platformer experience! Use Suits & Sandals' patented (not actually patented) GIANT STONE FIST technology to punch your way through hordes of monster-pirates to reclaim your home's stolen treasure.\nFind upgrades, collect collectables and solve problems with your fists! Play the game at your own pace in story mode or go for the best time in a marathon-style race mode!\n24 built-in achievements offer praise for completing tasks.\nRace mode lets you compete for the best time against the community!\nXinput and direct input compatibility makes sure all your USB controllers work!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Suits & Sandals","platforms":[{"id":0,"name":"PC"}]},{"id":13036,"name":"Over 9000 Zombies!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a9/7a93e91f94e711b0dc9981502bbfc3cc.jpg","description":"Over 9000 Zombies! is top-down arcade action blown out of all reasonable proportions. An endless horde of zombies is coming your way, how long can you survive?\nSo you might have already sussed out that there’s a lot of undead after you. To stay alive you’re going to need this arsenal of over 20 weapons. Some you might recognize but others are very experimental. Whether you want to shoot, burn, blow up or microwave the zombies there’ll be a weapon for you.\nKeeping the barrel of a gun between you and the zombies is a good start but you’ll want to stay out of the open when things get especially crazy. Scavenge scrap metal to build barricades for protection and deploy automated turrets for extra crowd control.\nYou don’t have to go it alone. Bring both trusted friends and talented strangers into your fold and team up against the hordes with 2 player online co-op and 4 player local co-op.\nThis level of slaughter needs some decent beats. Using cutting edge research techniques we have been able to isolate the optimum audio for efficient undead butchery. Scratch that trigger-finger itch to the sound of intense electro-rock from Clearside.\nThe zombies will never stop. They’re only going to get faster and nastier. Keep your eyes peeled for flaming zombies, highly poisonous zombies, zombie animals, giant eyeballs and even the risen remains of political figures. You’re going to die out there so make sure you leave with a bang.\nCreate your own unique levels to test your mettle and the power of the zombie hordes. Upload them to the Steam Workshop and show the world your creations.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Loren Lemcke","platforms":[{"id":0,"name":"PC"}]},{"id":10844,"name":"Yelaxot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88d/88d2d3497d9773f6ea5201eff81d459c.jpg","description":"Game Features:\n• A Huge Open World • Explore over 200 colorful, beautifully designed, nonlinear areas in the world of Yelaxot.\n• Many Different Obstacles • Platform your way through spikes, saws, lava, and monsters that roam the world day and night.\n• A Large Variety of Environments • Explore many different environments such as grass plains, caves, forests, ruins, islands, villages, lava caverns, ice caverns, cities, farms, lakes, haunted mansions, sky islands, towers, rainy savannas, the sea, a sewer, an underground laboratory, and more...\n• Quests • Help or join the NPCs of the world in adventures to receive rewards that will aid you in your journey.\n• Tons of Collectables • Collect keys, new abilities, artifacts, sacred stones, and many other items to open more possibilities in your quest to save the world from extinction.\n• Numerous Mind Boggling Puzzles • Solve many challenging puzzles throughout the world to open new areas or bring you treasure.\n• Mini Games • Visit an in-game arcade facility with multiple fun playable mini games such as \"Yelaxot Pong\" (A nice classic \"Pong\" remake with multiple stages and paddle colors.) and \"Super Skimo World\" (A fun, challenging little platformer with 15 levels and wall jumping action.) for fun during you adventure.\n• Achievements • Unlock 23 game achievements.\n• Steam Exclusives • Unlock  Steam achievements(23), trading cards, badges, emoticons, profile backgrounds, and more.\n• Original Soundtrack • Listen to a nice, fitting soundtrack while you explore the world.\n• Controller Support • Yelaxot is also playable with Playstation / Xbox controllers.\n• Hours of Gameplay • Spend 15+ hours exploring the beautiful open world, solving puzzles, completing quests, solving riddles, platforming through the dangers that stands in your way, and more...\n-Game Description-Yelaxot is a big mysterious world that was created by the Power of Yelaxot many years ago in space. With the Power of Yelaxot gone, the entire planet along with every being on it is in grave danger! You must set out on an adventure into the world and find the necessary items to restore the Power of Yelaxot, but there is much more to your adventure than you may think... The world of Yelaxot is full of many enemies, puzzles, and obstacles that stand in your way as you travel through the world on your mission.\nYelaxot\n(C) 2011 - 2013 Barkalar Games","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Barkalar Games","platforms":[{"id":0,"name":"PC"}]},{"id":10298,"name":"Minimalism","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/218/218418a983f2c0283258a643315e4634.jpg","description":"Minimalism - platformer with a lot of levels, made in minimalist style - which is a cube protogonist. The game is a kind of labyrinth consisting of levels, to go between them you need to open the doors with collected keys.\nFeatures:\n- 30 increasing complexity as you progress through levels\n- Minimalistic design\n- Good music","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PixelMouse","platforms":[{"id":0,"name":"PC"}]},{"id":3943,"name":"Tales of Xillia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc3/cc3fe06a5684a2c0a20bf54d9ae458c2.jpg","description":"Step into the shoes of one of two main characters and experience the world of Rieze Maxia through its ferocious dungeons, vibrant towns, and sprawling landscapes. Link up with comrades to execute powerful, combination attacks in exciting real-time battles! Customize character appearance and skill set to truly personalize the epic journey ahead!\n1-4 players\nHDTV screen resolution: 720p\nDUALSHOCK®3\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n©MUTSUMI INOMATA ©KOSUKE FUJISHIMA\nTales of Xillia™ & ©2011 NAMCO BANDAI Games Inc.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":686812,"name":"The Legend of Tianding","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e2/9e27325d5144e9f6861fc6b6b8356665.jpg","description":"Play as Liao Tianding (AKA. Liāu Thiam-Ting), vigilante of Taipei city and wanted by the Colonial Japanese authorities. Rob the rich, feed the poor, and fight for justice in the streets of early 20th century Taipei as Taiwan’s legendary outlaw.\nBased on real events, real people and real situations, The Legend of Tianding is an exploration of a place and time often overlooked and presented in the style of Traditional Chinese Manga.\n\nBattle the colonial authorities in style with a tanto, waist sash, and fast paced Kung Fu in tightly tuned technical combat. Execute advanced aerial combos, steal weapons from your enemies, use your waist sash and grappling hook to fly around the battlefield, and strike fear into the hearts of your oppressors.\nTake on incredible bosses like deadly courtesans, greedy businessmen, and even military leaders, each one guaranteed to challenge you with their dynamic abilities and brutal attacks.\n\nExplore the Dadaocheng area of Taipei city as it looked like in the early 1900’s Run through colorful streets, ride on a speeding train, and make your escape through dark sewers, all done in the style of a retro Traditional Chinese Manga.\n\nEven the playing field and tailor Liao Tianding to your playstyle with different equippable talismans! These magical items grant you bonuses such as recovering more health from food, regaining stamina faster, or even reducing the damage you take.\n\nTake a break from rebellion with this traditional Taiwanese board game.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Creative Games Computer Graphics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":428303,"name":"DJMAX RESPECT V","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8e/a8e37251279b8d41c013787bfa42f6a0.jpg","description":"DJMAX RESPECT V delivers an unrivaled rhythm game experience, introducing new modes, new artists, more than 150 unique tracks, exclusive music videos, and for the first time in franchise history, competitive online-multiplayer!\nExperience new tracks and music videos from world renowned artists like Marshmello, Porter Robinson, and Yukika, as well as the return of friendly names including BEXTER, ND LEE, Paul Bazooka, and Makou, among others.\nWhether you crave a casual freeplay session, or desire to crush your friend’s recent high score in real time, DJMAX RESPECT V has you covered. ‘AIR Mode’ will allow you to enjoy a continuous, random playlist, during which you can choose to play or simply listen, as well as leave comments for other players! But if bragging rights and glory are what you crave, new ‘Online Modes’ will put your skills to the test, pairing you against friends and rivals around the world.\nFeaturing both keyboard and full controller support (Coming Soon™), and an extensive tracklist spanning numerous genres, like Pop, Rock, Electronic, Ambient, Jazz and even Easy Listening, DJMAX RESPECT V will leave no rhythm gamer wanting!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"NEOWIZ","platforms":[{"id":0,"name":"PC"}]},{"id":58170,"name":"Rogue Aces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fff/fffbb63b0e856ee15f680478f3216bdf.jpg","description":"It's time to join the Rogue Aces and liberate the islands from The Baron\nand his dreaded pilots. Will you be able to face the fiercest of foes\nwith only one life and three planes?\n\nTake down waves of dastardly enemies in this endlessly emergent air\ncombat rogue-like where nothing is the same twice. With a multitude of\ngame modes to discover, no loading screens to stutter the action and a\nwhole lot of landscape to take back, jump in the cockpit and take back\nwhat's yours!\n","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":41647,"name":"Frozen Hearth","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f1/1f1bd3e33e2ba212ab6b026b7a4046a1.jpg","description":"Frozen Hearth is an indie hybrid of role-playing and real-time strategy games developed by Epiphany games.\n\n###Plot\nThe world is invaded by an unknown deadly force. You must save it from certain extinction by becoming a powerful reincarnation of a legendary Danaan. Save the world from the ice monsters, known as Shangur, that are driven by an unstoppable wave of moving ice and snow, consuming anything it reaches.\n\n###Gameplay\nThe gameplay of Frozen Hearth is heavily influenced by the Defence of the Ancients and other MOBAs. The players control a single character that can issue orders to their army. It is possible to level your character up unlocking new abilities or enhancing the already existing ones. The main objective of a singleplayer campaign is to annihilate the army of your enemy and destroying their base. The player chooses a mission to participate in and spawns on the map. \n\nThe players are also able to cast special magical spells that can either buff their own army or help destroy the enemy one. It is also essential for the player to build special structures to create more powerful units to lead into the fight.\n\n###Multiplayer\nThe game also features a multiplayer mode while the singleplayer one is used to prepare the player for the multiplayer. Once you master the aspects of the singleplayer mode, a multiplayer mode is unlocked, where the players fight each other on the maps that are ported over from the campaign with the same gameplay.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Epiphany Games","platforms":[{"id":0,"name":"PC"}]},{"id":12792,"name":"Realities","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a3/3a3add2e7524f9934294f3dc4194c963.jpg","description":"Explore places that were out of reach before\nRealities brings real world locations into VR - interactive & with stunning photo-realism using photogrammetry. Too many amazing sites are too far away, too expensive to get to, closed off to the general public or too dangerous to visit. Explore those places and discover their stories.\nWalk through the desolate vastness of Death Valley. Explore the eerie abandonned hospital Beelitz Heilstätten in the former GDR. Marvel at the amazing architecture of one of the largest cathedrals of the world, the Cologne Cathedral. Feel the confinement of a cell in Alcatraz. Set foot inside the ruins of an 800 year old Staufer castle.\nRealities is regularly updated with new locations!\nExploring is possible with the HTC Vive & the Oculus Rift","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"realities.io","platforms":[{"id":0,"name":"PC"}]},{"id":375197,"name":"Exit the Gungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28c/28c4b2b8d8c190e8ba4133bef8f96f83.jpg","description":"Developed by Dodge Roll\nExit the Gungeon is a bullet hell dungeon climber immediately following the adventures of the misfit ‘Gungeoneers’ and their journey for personal absolution in Enter the Gungeon. The Gungeon has become a paradox and is collapsing! Armed with an ever-changing weapon, an insatiable need to loot, and the trusty dodge roll, each of our heroes must ascend and escape via their own unique route of increasingly perilous elevators. Battle against the last and most bitter of the Gundead at a frantic pace, slowing down just long enough to chat with some familiar faces… and a few new ones. Shifting rooms, enemies, bosses, bizarre weapons and items all combine to ensure that no two attempts to Exit the Gungeon are the same.\nAlso, you can wear hats. Everybody loves hats, and spin-offs, which this game is… of Enter the Gungeon.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Devolver","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":36542,"name":"Total Overdose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ac/1ac70813d7214c0f7a92b6fbcb739f80.jpg","description":"In Total Overdose: A Gunslinger's Tale in Mexico, you can play as two brothers who are searching for their father's killer. Plumb the depths of Mexican drug trade, fighting lowlifes from the coast of California to jungle hideouts in Mexico. You can use a large arsenal of weapons and vehicles to get your revenge. Total Overdose: A Gunslinger's Tale in Mexico also includes a combat and stunt system that offers you more points for killing with style.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Deadline Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":23004,"name":"Indiana Jones and the Emperor's Tomb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75f/75f22afd3a3913c6b3b4fdbe51aae3da.jpg","description":"As Indiana Jones, you’ll travel to 1935 China to prevent a powerful artifact from falling into evil hands. This globe-spanning adventure pits you against evil Nazis and the Asian underworld. It’ll take more than just a trusty whip and pistol to avoid the perils of the Emperor’s Tomb.\nIndy's latest adventure plays out in dramatic fashion thanks to new gameplay features such as brawling combat. This time, in addition to using his trademark whip and pistol, Indy can engage in fierce hand-to-hand combat against foes, many of whom are well-versed in martial arts. Improvised weapons such as shovels, chairs and table legs also can be used to fend off adversaries. The result is a more immersive and more Indy-like gameplay experience, set amidst spine-tingling movie-like action sequences, such as a rickshaw chase in Hong Kong and a spectacular battle atop moving gondolas in the South China Sea area.\n• Explore levels across the globe from Ceylon and Istanbul to Hong Kong and beyond.\n• Shotguns, submachine guns, improvised weapons - and of course, Indy’s trusty whip and pistol.\n• Fierce fighting action and hand-to-hand combat.\n• Original storyline with new villains, wicked enemies and an alluring partner.\n• Leap, swim, climb and punch your way through exotic locales.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Double Helix Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":22902,"name":"Worms Forts: Under Siege","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ffd/ffd0a0900f9b9cc02ffbcb5032adcdad.jpg","description":"These Worms are coming to crash your castle! Enter the world of Worms’ Forts: Under Siege, now in full 3-D! You can defend yourself from atop your mighty castles or unleash your wrath on your opponents. Crush or be crushed in the classic Worms style!\nWorms Forts: Under Siege! puts you in command of a team of up to four fort-dwelling worms. The game is set wacky 3-D cartoon environments, and you must command your worm garrison to quickly construct defenses to maximize your strategic advantage. Direct your worms to expand your castle and seize valuable resources. Have them build weapons of mass destruction to destroy your opponents' fortifications. Test yourself against the single-player game by battling through the 20 missions, and then lay siege against your friends via hotseat, LAN, or FortNet multiplayer! Now who’s king of the castle? Prove your worth in Worms: Fort Under Siege!Build huge forts and arsenals before completely crushing your enemy.\nRaze and conquer 4 ancient eras as you lay siege in 5 epic battles per era.\nUnleash your fury with classic siege weaponry with a Worms style makeover - from flaming oil to rocket-propelled hippos!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"}]},{"id":19286,"name":"Driver: Parallel Lines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e8f/e8f3f872eb3175d2569d6a05f752d0b8.jpg","description":"You were the fastest wheelman on the street. You were a legend. You were money. Until they set you up and sent you down. Twenty-eight years inside for someone else's crime. Now you're getting out. Guess what? You got a new job, it's called getting revenge.\nDual Time Periods - Experience New York's gritty underworld as the most lethal wheelman for hire in the both the 70's of the past and the modern times of today.\nChoose Your Own Ride - Get behind the wheel of 80 cars and motorcycles including old school classics and modern day marvels.\nConquer New York's Underground - Shoot, smash and steal your way through NYC's gritty underground using an arsenal of short and long range assault weapons.\nFully Customizable Vehicles - Build your perfect ride with custom body work, engine upgrades, tunable suspensions, custom paints and accessories like bullet proof glass and tinted windows.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":17725,"name":"Yargis - Space Melee","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ade/aded79b548258247e7aef66906b80cce.jpg","description":"Yargis is a fast paced, top down spaceship shooter. Customize your ship to join a battle online or offline. Yargis is focused on team based, close combat action. The game has a variety of battle and co-op game modes and a powerful editor make Yargis a great game!\nCONTROLS: Hold down W for Thrust, use the Mouse to steer, and Space for brake. Customize controls in settings > controls for asteroids style non-fixed. http://steamcommunity.com/sharedfiles/filedetails/?id=646975914\nCompete head on with other players online, over a LAN, or play against the computer offline. Game modes include:\nKing of the Hill\nCapture the Flag\nPrison Break\nBase Conquer (Co-Op)\nMaze Race and CTF (Capture the Flag) Maze\nMelee Battle\nPlay Yargis’s single player story over 29 levels. Each level offers new challenges for you and your ship.\nYargis is a pilot for the Earth's military in the year 3013. Despite having explored far beyond Pluto and Alpha Centauri, no contact with alien life has been made. Until now; an unknown species only known as the Mukka are attacking Earth and its inhabitants. It’s up to Yargis to defend Earth and help uncover their fiendish plot, while trying not to get blown to smithereens.\nBlow up enemies.\nNavigate through asteroid fields\nFly through nebulae, stars and space stations\nCompete with your friends on the same computer for lag free space action. Use your keyboard, mouse, or Xbox 360 game controllers.\nYou can earn money and experience points in game by playing both single player and multiplayer. Level up your character to buy cool new ships and use the money you earn to get new weapons and items. Granular upgrades can be used to improve the parts on your ship.\nYargis’ game physics are based in real world physics: your ship has momentum and is affected by gravity. Explosions push your ship and even firing a weapon may affect your ship as well.\nEasily create levels with drag and drop items and Lua scripts for more powerful features. Your friends can instantly download the levels you create by joining your local or dedicated online server.\nDownload your very own copy of Yargis now and join the battle or create your own dedicated server.\nThe Team\nOur team created all of our content including music, graphics, game engine, and story in St. Louis, Missouri. We built our game engine from the ground up for the best and most unique experience.\nWe run 24/7 game servers and we host regular tournaments! Buy a multi-pack of Yargis to play with your friends!\nJoin us in space with Yargis!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"PlazSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16257,"name":"Airstrike HD","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e9/5e9c9d156eea686df874d569ceb59b33.jpg","description":"At ease, pilot!\nYour goal is to destroy all buildings on the mission and defeat all Bosses. One combat operation includes 5 levels and 1 boss mission. The aircraft will lose altitude with each descent, so be cautious!  The randomly placed bonuses on different building storeys might boost or hinder you during the bombardment. If you find such a Bonus crate, try to hit it before it’s gone. If a bomb hits the Crate, you get one of the 10 bonuses.\nFeatures:\n5 combat flight operations\n5x5 levels\n5 aircraft types\n5 tricky bosses\n5 good and 5 bad bonuses\n5 languages\nHardcore mode\nUnlimited fly\nWeather affects the gameplay\nAchievements and cheats\nAnd, of course, a secret level with a seagull!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fifth Dimension Company","platforms":[{"id":0,"name":"PC"}]},{"id":15439,"name":"Pirate Pop Plus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/202/202a1cb855e89685741ba75ef9b40c35.jpg","description":"RETRO-STYLE ARCADE ACTION!\nPirate Pop Plus is a super addictive, gravity-defying, score-chasing, bubble-busting, retro-style arcade game.\nJoin Pete Jr on his quest to defeat the nefarious Bubble Pirate, an evil villain who has trapped the innocent townsfolk in bubbles!\nDodge and pop bubbles with your anchor while collecting power-ups and managing Bubble Pirate’s constant gravity-switching mischief! When you feel at your Piratey-est, test your skill in the ultra-challenging Hyper Mode... The game may be faster and harder, but you'll find treasures beyond your wildest dreams. Coins as far as the eye can see!\nCollect coins to unlock content in the game’s shop like new music, new faceplates, buttons, backlights, and even characters for your bubble-popping mayhem! Yarr!\nOut of the box controller support!\nGeneric twin-stick Analogue Controllers\nXbox 360\nXbox One\nXbox One Windows 10\nSony DualShock 3\nSony DualShock 4\n8bitdo NES, SNES, PRO\nBuffalo NES, SNES\nUSB retrobit / retroport NES adaptor (Windows support coming soon)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"dadako","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14942,"name":"Trick and Treat - Visual Novel","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f8/2f88ab38a530d53376d56d49b724318a.jpg","description":"Type: Visual Novel\nLanguage: English translation\nGenre: Thriller, Mystery and a little romance\nDuration: about 3 hours\nSynopsis:\nA forest is the setting for this story, where our protagonist decides to explore with his friends to corroborate the existent legend, suddenly something attacks leaving our protagonist at the mercy of the unknown. In this adventure will meet two girls, Ashley and Lilian, which he will not to know what are their intentions and hidden secrets.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Eternal Night Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13152,"name":"Intralism","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d7/7d71d078232233b4753b3615fdc1eebd.jpg","description":"Intralism - fast and hard arcade. Listen to music and match notes. Master all the maps or create your own and challenge friends with online multiplayer. But remember: wrong button - failed try.\nThe main focus of development was on the level editor and multiplayer. Players are able to easily add their favorite music into the game and play it with friends.\nFeatures:Challenging Gameplay - For competitive players only. In the Intralism you need all of your reaction and an ear for music\nCustom Levels - Subscribe and rate an interesting maps in Steam Workshop created by other players and become #1 in the online leaderboards\nLevel Editor - Have an interesting idea for a map? Create your own with editor and play it in multiplayer with friends via Steam Workshop\nMultiplayer - Challenge your friends' skills in the online battle\nIn-game Items - Customize game with rare items or sell them on Steam Market\nAchievements - Hidden and multiplayer achievements don't let you get bored. Try to master this game!\nOnline Leaderboards - Track your progress with leaderboards\nSteam Trading Cards And Emoticons","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"KHB-Soft","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":7019,"name":"Dark Arcana: The Carnival","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a02/a021fc474ee5d62130b075da20d231db.jpg","description":"Investigate two worlds: the one you know and an alternate plane existing behind the Hall of Mirrors. Discover the secret of an ancient being known as the Evil One. Reveal the story of star-crossed lovers and stop the Evil One from breaking its magical chains and invading our world.\nWhile traveling through dimensions, you will solve cleverly designed minigames and find hidden objects or play a special minigame as an alternative. Best of all, you will befriend a cute and clever monkey devoted to aiding you on this adventure.\nFeaturesCute helper monkey\nTwo beautifully designed and crafted worlds\nUnique option to switch from HO scene to a minigame\nWonderful hand-drawn art\nBreathtaking events and twists\nMysterious storyline\nClever and unique minigames\nHollywood quality animations\nSpecial Collector’s Edition version full of exclusive extras\nBonus Chapter awarded for completing the game","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":3057,"name":"Sword Art Online: Lost Song","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/afb/afb94aca859faff253659f9f7c6f6ed3.jpg","description":"Enter the VRMMO world of the much-loved anime SWORD ART ONLINE! In Alfheim Online, a world of fairies and magic, you become the hero of the series, Kirito, and together with your wondrous friends try to conquer the floating land of Svart Alfheim. Soar freely through its skies and take down all powerful enemies who dare appear before you!\nExperience fast-paced battles in the air and on the ground, and seamless action sequences in a game that makes you feel freer than ever before! Choose your skills and how you want to evolve; it's all up to you! And remember: the more you grow, the more epic the battles!\nSeven, Rain, and Sumeragi from \"Lost Song\" join the anime regulars in a brand new story!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":421711,"name":"Paper Beast","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee4/ee4579271e2c774fa65b9e62145b1e63.jpg","description":"Wishlist us!\nAbout the Game\nAn adventure and exploration game about wildlife in a dreamlike universe.\nSomewhere in the abyssal depths of the internet, life has blossomed. You are the first human to set foot in this mysterious ecosystem. A strange force seems to weigh on its balance. Join forces with intriguing and endearing creatures to solve the puzzles of Paper Beast.GAME EXPERIENCE\nExplore a colorful and whimsical universe born from the imagination of Eric Chahi, creator of Another World.\nTwo game modes: the adventure and the sandbox, an immersive playground.\nExplore a world populated by majestic and intelligent creatures. Grab them, help them: their behaviour adapts to your actions.\nControl the environment. The gameplay is based on a unique physics engine. Divert rivers, melt the ice, withstand storms to solve puzzles… And fly away!\nExperiment! In the sandbox, live an experience close to a god game. Terraform mountains, dig lakes, populate your ecosystem, unleash tornadoes. Have fun with the physics of the game.\nAn original soundtrack combining the Japanese punk rock of TsuShiMaMire and the ambient style of Roly Porter.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Pixel Reef","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":50603,"name":"Real Pool 3D - Poolians","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16b/16b96d84d3ca632ae673d8a56ed8e83b.jpg","description":"Real Pool 3D (Poolians) is one of the best online pool game. It offers fast, realistic and satisfying game play.\nFeatures:\n1. Play against the computer or real players all over the world.\n2. Realistic controls, graphics and sound effects.\n3. Supports 3 ball, 8 ball, 9 ball, 15 ball, Blackjack, 14+1, killer and snooker.\n4. Supports team play mode which allows maximum 6 players to play in one table at the same time.\n5. Powerful in-game social functions: avatars, profile pages, chats and friend list.\n6. More than 10 types of prized tournaments are held every day.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Poolians.com","platforms":[{"id":0,"name":"PC"}]},{"id":45958,"name":"XCOM 2: War of the Chosen","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/824/8244534a6db2180e177271cebb9c002f.jpg","description":"XCOM® 2: War of the Chosen, is the expansion to the 2016 award-winning strategy game of the year. \r\n\r\nXCOM® 2: War of the Chosen adds extensive new content in the fight against ADVENT when additional resistance factions form in order to eliminate the alien threat on Earth. In response, a new enemy, known as the “Chosen,” emerges with one goal: recapture the Commander. This expansion includes new Hero classes to counter the “Chosen”, new enemies, missions, environments and increased depth in strategic gameplay.\r\n\r\nThree additional factions have emerged to strengthen Earth's resistance – the Reapers, Skirmishers and Templars – each with its own unique abilities and contrasting philosophies. These factions provide powerful hero class soldiers to aid in missions and new opportunities for the strategy layer.\r\n\r\nA deadly new alien known as the Spectre, capable of creating dark copies of XCOM soldiers, has snuck onto the battlefield. Adopt new tactics to counter it as well as the explosive attacks of the ADVENT Purifier and the psionically charged ADVENT Priest.\r\n\r\nEngage in tactical missions across new environments from abandoned cities devastated by alien bioweapons during the original invasion, to underground tunnels and xenoformed wilderness regions.\r\n\r\nManage XCOM’s relations with factions and counter The Chosen’s operations from the Avenger. Employ new Resistance Orders to prioritize your personal strategy. Soldiers, scientists, and engineers can now be deployed for Covert Actions that award supplies and boost faction favor if successfully completed.\r\n\r\nSoldiers can develop bonds with compatible teammates for new abilities and perks. The SITREP system dynamically adds new modifiers to the tactical layer to make sure every mission provides a unique challenge. Advanced campaign options allow for finer adjustments to game length and difficulty.\r\n\r\nUtilize the perfect strategy in new regular one-shot community challenges to claim the top spot on the global leaderboard.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Firaxis","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":36096,"name":"The Chronicles of Riddick: Escape from Butcher Bay","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cec/cecc71ccc1a0dbef796f0404a7f9514f.jpg","description":"The most wanted man in the universe comes to your neighborhood in The Chronicles of Riddick: Escape From Butcher Bay. Set before the events of two movies, The Chronicles of Riddick and Pitch Black, the game tells the story of Riddick's escape from the previously inescapable maximum security prison Butcher Bay, which is home to the most violent prisoners in the galaxy. Battle your enemies in first-person or third-person views using shooting, stealth, or hand-to-hand combat. With Riddick's eye-shine, you can easily see through the dark to take out your foes.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Starbreeze Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":35963,"name":"The Suffering","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/930/930ae02027c73129a863a7ad793a768d.jpg","description":"Experience the terror as you fight your way out of a maximum security penitentiary overrun with ghastly creatures. Your desperate bid to escape this horrific prison and the island that surrounds is only the beginning as you learn the truth behind The Suffering","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Midway Games","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":29696,"name":"Tom Clancy's Ghost Recon: Desert Siege","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc1/cc1e62d86eb5e2e5c73aab0c8afe159b.jpg","description":"East Africa, 2009. A 60-year conflict boils over as Ethiopia invades its smaller neighbor Eritrea, threatening the world's most vital shipping lanes in the Red Sea. An elite team of U.S. Army Green Berets, known as the Ghosts, moves in to safeguard the seas and free Eritrea. As the war rages on, the Ghosts are drawn from Eritrea's shores to the heart of Ethiopia in their deadliest battles yet.\nNew multiplayer modes - Team-based Siege and Domination modes allow teams to attack or defend territory.\nBoth new modes are fully compatible with your original Ghost Recon game - play for hours on the original maps.\n8 new single-player missions.\n4 new dedicated multiplayer spaces.\n9 new multiplayer weapons, including the Bizon submachine gun, the M98 sniper rifle, and the fearsome M-60 machine gun.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Red Storm","platforms":[{"id":0,"name":"PC"}]},{"id":22478,"name":"Insane 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54b/54b5611e35a2f118c8540f1698f9e02e.jpg","description":"Insane 2 offers a number of innovations in the off-road racing genre. Besides the traditional time trial mode, the game features 9 other game modes, including the popular “Capture the flag”, “Gate hunt” and “Pathfinder”, as well as some new competitions, such as bonus hunting, territory control and helicopter pursuit. All of these modes are also available in multiplayer, with up to eight players participating simultaneously.\nMore than one hundred and fifty races combined into championships and cup competitions take place in Europe, America, Africa and the Antarctic. The game has an enormous variety of long distance tracks: sand and snowy deserts, high-speed roads and impassable cross-country paths, African beaches and deserted Antarctic stations.\nThe game features 18 vehicles of different classes, from buggies to monstrous “Bigfoots”, as well as an additional prototype class. Rating points won in the races can be used to upgrade any of the vehicles, from a selection of 15 running gear, body or engine upgrade alternatives. Each vehicle is furnished with a detailed destruction system. Reaching the end of a course without suffering any losses is an enormous challenge that only a select few are able to accomplish. The opponents, who constantly create extreme situations, aren’t the only danger: players also need to watch out for railway crossings, heavy tanker trucks and even lightning in stormy weather.\nKey Features:\t\t\t\t\t\t18 vehicles from six different types: 4x4, SUV, pick-ups, trucks, extreme vehicles and prototypes.\n20 locations, 170 races, 4 continents (Eurasia, America, Africa and the Antarctic)\n10 game modes, also available in multiplayer\nRating and game achievements system\nDetailed vehicle destruction and a car tuning system\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"}]},{"id":20798,"name":"FATE: Undiscovered Realms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e12/e123f53810f0ba71c02717998e57a5b8.jpg","description":"**FATE: The Traitor Soul is now live on Steam!**\nFATE fans! You asked for it and we delivered. FATE: Undiscovered Realms, the dungeon crawl-ier sequel to our classic dungeon crawler, is now available! Import your characters from the original FATE and start a new adventure today!\nWelcome, Hero. The manxome scourge has retreated into the shadows and you are victorious… but all is not well. A new evil and ancient secrets threaten the very balance between the realms. Take on the quest to find the mysterious Book of Fate and save your beloved Grove once again!\nNEW Steam Trading Cards – We made brand-new, never-before-seen art just for you. (and not because we're huge FATE nerds)\nNEW Steam Badges – Shiny new nuggets of awesome for your collection.\nNEW Steam Emoticons – I FATE you.\nNEW Profile Backgrounds – Remind yourself of your amazing, classic, dungeon crawler adventure with these beautiful, Steam-exclusive backgrounds.\nMore Than FATE – Oh, yes. Things just Got Real. This sequel has more pet transformations, dungeons, weapons, monsters and quests than the original.\nGameplay – It’s HARDCORE! Don’t worry; the gameplay will be the familiar, classic RPG style that fans of the original love, but with an optional Hardcore mode. For the super-est of fans. **Insert sick guitar riff**\nProcedurally generated levels – Adventure through endless caverns, dungeons, mines, tunnels, temples, forests, and snowy wastelands. Read as “Endless FUN,” am I right?\nEconomy – Of course, you can still buy, sell and gamble your fat loots!\nClassic – It’s the classic sequel to a classic game. Why haven’t you played it yet?","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"WildTangent","platforms":[{"id":0,"name":"PC"}]},{"id":20104,"name":"Divine Souls F2P MMO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63f/63fb5bbe68b2887892653895c7b4834d.jpg","description":"Divine Souls is a real-time action RPG centered around completing dungeon instances by leveraging an extensive combat combos system. Gain experience from enemies to strengthen your character and to unlock additional moves that unleash additional combo options. Choose from one of four unique classes each with their own distinct set of gameplay mechanics and combos. Collect loot for yourself, trade with others, or list your items into the auction house system.StoryDr. Hildeun has gone missing! Find out what happened as you follow your character’s investigation into Dr. Hildeun’s disappearance.Key Features:Perform beautifully animated combos with a system that is easy to learn. You only need A, S, D, and F keys!\n4 unique classes with more to come!\nPlay alone, party with your friends, or have the system find like-minded others using the party matching system.\nWorry not, the tutorial will guide you through the game’s basics.\nComplete dungeons for experience and loot.\nIncrease the difficulty to suit your skill-level or to challenge yourself.\nLevel-up to increase your character’s strength and to learn new moves that unleash additional combo options.\nCustomize your character with items obtained from loot. Or trade these items to others.\nIncrease your strength by enchanting your items.\nTry alternative dungeon modes involving crystal or portal defense.\nPit yourself against others in a PvP battle arena that resembles MOBA games’ play-style.Divine Souls is a free-to-play game!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"GamePrix","platforms":[{"id":0,"name":"PC"}]},{"id":19316,"name":"Bus Driver","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/316/316b6b57331c85e8aab9879028767bcb.jpg","description":"In Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, whilst obeying traffic rules, and taking care not to upset or injure your passengers. This makes Bus Driver unlike any other driving game - the experience of driving a bus is very different from blazing through a racing circuit.\nBus Driver offers twelve different kinds of buses to drive, an expansive city environment with various districts, and thirty routes with varying weather conditions set at differing times of day.Key features\n12 buses to drive, very detailed models inspired by real-world buses.\n30 routes arranged into 5 tiers with increasing difficulty.\nMultiple duties, such as driving a schoolbus, transporting tourists, sight-seeing tours, and transportation of prisoners.\nHigh replay value based on sophisticated system of traffic rules and game-play related bonuses.\nVarying time-of-day and weather conditions\nLarge city to drive in, with several districts of varying styles (modern, old-town, suburb, airport, harbour, and more).\nLiving roads, with intelligent traffic controlled by our AI system.\nNon-violent gameplay, bus game suitable for everybody.\nFrom the makers of truck simulation games in the 18 Wheels of Steel series and the Euro Truck Simulator series, a solid contender in the bus driving games category.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SCS Software","platforms":[{"id":0,"name":"PC"}]}]