[{"id":21586,"name":"Nux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2dd/2ddec73965f0d84af22fc3f4103d70d8.jpg","description":"You are NUX, sole survivor of the Nexon warrior tribe. The evil Silthax has invaded your home world of Nexolus, devoured your fellow Nexons and stolen the sacred power crystals from your village.\nLegend states that these crystals contain the power of life itself, and have protected your people for an eternity. They may even have the power to reverse the damage that the Silthax has done.\nWith your home in ruins and only your ship and your trusty blaster to protect you, here begins your final mission. Hunt down this vile creature, rid the galaxy of its evil and recover the power crystals!Features:3 fun-filled game modes\nShoot, fly & explore on foot\nAmazing claymation graphics\n4 planets to explore\n13 Action-packed levels","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Idigicon","platforms":[{"id":0,"name":"PC"}]},{"id":5651,"name":"Shadows of the Damned","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c1/0c11fbf99670bdfc4c328ff25ae8460b.jpg","description":"Shadows of the Damned is an all-new psychological action thriller game from iconic Japanese developers including executive director Suda51 (director of No More Heroes), creative producer Shinji Mikami (director of Resident Evil®) and music composer Akira Yamaoka (sound director of Silent Hill®).","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":52371,"name":"Super Mario Sunshine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b7/0b746092287560e4ff5a6ceb5faaed8e.jpg","description":"When Mario, Peach, and an entourage of Peach's loyal Toad friends set out for a tropical vacation on lovely Isle Delfino, they're in store for much more than a relaxing holiday. A mustachioed maniac has mucked up the entire island, and Mario is accused of committing the crime. Armed with a hi-tech water cannon called FLUDD (Flash Liquidizer Ultra Dousing Device), Mario sets out to clean the island, clear his name, and solve the mystery of the villainous vandal. With new enemies, moves, and surprises, Super Mario Sunshine offers plenty of challenges.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Nintendo","platforms":[{"id":0,"name":"GameCube"}]},{"id":15335,"name":"Heaven Island Life","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee3/ee3b4e99ddf603fb19466243b12f23b2.jpg","description":"\"Heaven Island Life\" is an experience designed for the HTC Vive in which you'll explore wonderful places. The inspiration for the environments comes from the Renzo Piano designs and from the book \"Origins of Architectural Pleasure\" in which the welfare is of primary importance.\nIn this updated version you'll be able to interact with a lot of objects in the environment thanks to your \"Soul controllers\".\n- With right controller (trigger) you'll be able to teleport to different places on the island\n- With left controller (trigger) you'll be able to create stones that you can use to create zen gardens or throw them in the sea\nWARNING: The game runs only with the HTC Vive.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"PC"}]},{"id":14796,"name":"Guns, Gore & Cannoli","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/301/30127e8e7642fea4b28a88a7fa2eec12.jpg","description":"Release the Fury!http://store.steampowered.com/app/525510/Guns_Gore_and_Cannoli_2/\nAbout the GameWelcome to Thugtown circa 1920, the height of Prohibition.\nPrepare yourself for a non-stop, action-packed, completely over-the-top, fast-paced, platform game. Set against the gangster heyday of the roaring twenties. Lose yourself in an exciting, elaborate tale of the underground and underworld. Experience friendship, betrayal, vengeance, and witness first hand the rise and fall of a criminal mastermind.\nThis is survival horror, wiseguy style... Capiche?\n\"Leave the gun, take the cannoli... actually, on second thought, take the gun and eat the cannoli, you’re gonna need it.\"\nStory\nThe game tells the story of Vinnie Cannoli and his mob family, set in the fictional Thugtown circa 1925, the height of prohibition. Beneath the city overrun by zombies, there's a dark story of conspiracy and betrayal. Unravel the sneaky mafia ways and government conspiracy while you try to look for your lost pal and for answers about the zombie-outbreak.\nKey Features\nAction-Packed Gameplay\nPrepare yourself for a non-stop, action-packed, completely over-the-top, platform game where you have to fight, shoot, blast and kick your way through a deeply engrossing story. Not only will you have to take on the undead, but also rivalling gangsters and the army trying to cover things up.\nBeautifully hand-drawn 2d graphics and animations\nStep into the atmospherical, shady world built by HD hand-drawn 2D graphics. Experience fluid animations and cinematic style cut-scenes.\nImmersive World and Period\nDespite Prohibition and the imminent Depression, people are ready to drink themselves to (un)dead. Every inch of the game is like a picture straight from the Prohibition era. The cars, the furniture, the Speakeasy clubs, the music and the weaponry reflect the turbulent days of the roaring twenties.\nLocal co-op mode\nPartner up to 4 friends and unravel the mystery together.\nAbout Crazy Monkey Studios & Claeysbrothers\nWe're a passionate team on a mission to create amazing games!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Claeysbrothers","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9555,"name":"Phoning Home","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e3/6e39d75aa32665ab6292a257dc199203.jpg","description":"You play ION, a young exploration unit on a mission to secure natural resources. When you crash-land on an alien planet your ship is almost completely destroyed. Not only do you have to survive in a strange new world full of dangers, but to have even a hope of escape you must find a way to contact your home planet for help.\nWith only your ship’s A.I. for company, you set out to explore your new home.  On your journey you encounter ANI, a small, stranded service unit who identifies as female. ANI is the first to admit she’s a bit mad, but she is also a valuable resource, and it soon becomes clear that there will be no escape without her.\nAnd so, the two of you begin a journey that neither of you is prepared for, on a planet where even the laws of nature seem not to apply.  A journey in which ION and ANI must face the strangest of all possible challenges if they are to have any hope of living to tell their own story.\nFEATURESExplore a new frontier. Large open environments with realistic environmental effects – from time-of-day lighting to dappled forests and snow-covered mountains, to volcanoes, canyons, deep oceans and scorching deserts – you must find your way.\nExperience a story with living (but not breathing) characters, brought to life by voice actors.\nSurvive harsh weather conditions and temperatures – and protect ANI at all costs!\nAn intriguing mix of exploration, logic and action gameplay.\nCreate portals to traverse the landscape.\nFight – or find ways to avoid combat.\nCraft improvements and critical tools from resources found in the environment.\nDiscover the remnants of an alien civilization, decrypt their language and restore their technology.\nEnjoy a beautiful soundtrack.\nBe warned. Phoning Home starts easy, but gets quite challenging in the later stages of the game. Can you leave the planet?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ION LANDS","platforms":[{"id":0,"name":"PC"}]},{"id":817970,"name":"Aseprite","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/800/800c59bb908eb13c696dc7a46f59c148.jpg","description":"'Aseprite' is a pixel art software available for PC on Steam and the official website. It was initially published during 2001, although received a stable release on June 6th, 2014. The program was developed by David Capello, which allows the user to create 2D digital art and animations using a pixel-based style.\n\nOfficial Description\n-\nAseprite is a pixel-art tool to create 2D animations, sprites, and any kind of graphics for games.\n\nFeatures:\n-\n• Compose sprites using layers & frames as separated concepts\n• Create images in RGBA or Indexed color modes\n• Open/Save GIF animations, sequence of PNG files, etc.\n• A timeline where you can copy/move layers, frames, or specific images\n• Animation tools: Real-time animation preview, onion skinning, tag frames\n• Pixel art tools: shading, pixel perfect strokes, RotSprite rotation, tiled mode, filled contour\n• Export/import sprite sheets\n• A command line interface to automate conversion and sprite sheets generation\n• Updates for the whole v1.x series up to v1.9.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"David Capello","platforms":[{"id":0,"name":"PC"}]},{"id":19602,"name":"The Blue Flamingo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b3/0b399f22aed7c10a21964ce0ca417291.jpg","description":"Every now and then, pilots from all over the world join to challenge each other in a big competition. They take turns finishing a dangerous track filled with foes, hoping to dominate the score table.\nYour team is making the final preparations. The band are setting up to perform. And your ship - ”The Blue Flamingo” stands ready and waiting in the hangar...\nThe Blue Flamingo is a straight forward, bite size, Shoot em up game created entirely using handmade models. A 32 feet long handcrafted model was built specially for the game, along with countless props and assets that were filmed and photographed. All the effects, rocket flares and explosions were created using firecrackers and other pyrotechnics.\nLike every other Shmup, this is a game that challenges you to reach the highest possible score. This is made interesting by an economical system that allows you to invest your score in upgrades, which makes earning more score points easier. On the other end, you are rewarded with interest on what is left of your score when you progress to the next level. You have to make a choice - to upgrade and try to regain the score, or rely on your skills to beat the increasingly difficult levels.\nUse your greed wisely to beat your friends and climb up the score table.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Might and Delight","platforms":[{"id":0,"name":"PC"}]},{"id":10047,"name":"Warstone TD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63d/63d4f9cbf888f0d09927f02af9e7c21f.jpg","description":"A fearsome Chieftain is gathering an army, intent on the subjugation of the realm. The Villagers cry out for a hero! Someone to rise up and rescue them from their plight. This burden falls to you. Build a city, train an army, and equip your subjects. Seek out the assistance of helpful allies, such as dwarves, amazons, and sorceresses. With allies to help, and an army of your own, you can defeat the invading army and make the realm safe again!Features 7 basic units, with a further 15 available as upgrades!\nIntriguing story with beautifully drawn artwork.\n3 Vastly different Classes for you to choose from: Warlord, Sorcerer, and Treasurer. Over 70 different skills in all!\nDiverse array of spells: Firewall, Lightning, Meteor Shower, Titan's Fist, Summon Elemental, Poisonous Cloud, Transmutation, and more! Only 4 spells can be brought into battle though, so choose wisely!\nMultiple different game modes: Classic, Challenge, Survival, Maze, Hero Defense, Attack/Defend (Also used in PvP,) and Co-op missions throughout the campaign.\nUpgrade Defenders in the workshop! Multiple upgrades with several tiers for each defender. More upgrades become available as you build and improve your town.\nGameplayUnlike regular Tower Defense games, Warstone TD has a unique method of summoning defenders (towers). You start with a fairly empty map and a few stones where you can place defenders. As the level progresses, more stones appear and some even drop from enemies, allowing you to place them in any valid position on the map. Powerful Warstones also appear occasionally which give significant bonuses to defenders standing on them. You can summon any of the 5 basic defenders on the stones: Peasant, Archer, Rifleman, Sorceress, and Elemental. Each basic defender has its own upgrade path, damage type, gold cost, and special abilities!\nWarstone TD also has 2 extra base units only available for use in attack/defense missions, the Eagle and the Wolf. Each have branching upgrade paths, like the basic defenders. With such a variety of defenders and game classes there is a huge amount of tactics in PvP battles, increasing replayability even further!\nThere are 30 story missions and each mission has 3 modes: Campaign, Challenge, and Survival. The player can choose the difficulty of each mission from 4 settings: Easy, Normal, Hard, and Nightmare. Each mode has a unique achievement which gives a star when completed, the color of the star corresponds to the difficulty of the mission: gold for Nightmare, silver for Hard, and bronze for Normal. Levels have a lot of possible solutions but, with so many combinations, you're going to need to perfect your strategy to master them. And just in case you forget how awesome you are, there's an online leaderboard, which tracks your score, both in Campaign mode and PvP. Compete with your friends, or enemies!\nClass systemAfter you progress through the first 4 missions in the campaign, you are able to choose a class to augment your abilites in battle. The classes are non-linear, you can pick and choose skills from any class, but you have to focus on a class if you want to get the most powerful skills.\nThe Mighty Warlord greatly increases the effectiveness of your army! He improves the power and abilities of your defenders, can unleash the power of stone to help in battle; allowing placement of stones to slow nearby enemies, or give you a surge of mana and gold. He also has skills which allow your defenders to level up in battle, becoming more powerful with each successive rank.\nThe Cunning Treasurer's weapon is gold! He is a master of item storage, able to fit an improbably large number of items into his backpack, and find many more scrolls and even potions during battles. Everything he does is for gold! He is able to increase bounty for enemies killed, make his own defenders cheaper, and eventually can even get a powerful spell that allows you to transmute an enemy into pure gold! With all of these abilities, the Treasurer can field a much bigger army than any other class.\nThe Powerful Sorcerer is able to complete levels using only spells! He can bring up to eight spells into battle, increasing flexibilty greatly. His skills revolve around buffing spell effectiveness, regenerating mana, unlocking more powerful spells, and he can even transform units into mana. Among the spells the sorcerer can unlock are: Summon Elemental, Reduction; which shrinks and debuffs monsters, Meteor Shower, and Teleportation; which allows you to teleport defenders to any available stone on the map.Join the fight today, in Warstone TD!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Battlecruiser Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5571,"name":"Front Mission Evolved","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f42/f4223f77565e5ec5eb44997552f43c4e.jpg","description":"In the year 2171, the world is a changed place. The countries have merged into rival super nations called U.C.S. and O.C.U. The human race started a massive push into space by building orbital elevators to set up surveillance satellites to watch over their adversaries. However, tension rises when a U.C.S. orbital elevator is destroyed by unknown forces. Dylan Ramsey, a young engineer, finds himself quickly caught in a swirl of destruction, conspiracies and crumbling alliances in a new war brewing between the O.C.U. and the U.C.S.\nThird-Person Shooter Action - Fast-paced action awaits as players battle enemies in the concrete mazes of cities, the frozen wastes of the Antarctic and a host of unique locations.\nCustomization Options - Players can strategize their combat by choosing from dozens of weapons, shoulder attachments, and wanzer parts to build a war machine that suits their play style.\nOnline Multiplayer - FME is the first in its series to boast online multiplayer with a team-based mode with up to 4-on-4 wanzer-sized death matches.\nOver-the-Top Visuals - Features breathtaking CG movies by Visual Works, the cutting-edge studio whose previous work includes cut scenes for the acclaimed FINAL FANTASY® series.\nBattle Skills - Gain a tactical advantage over an opponent by equipping your weapons with a wide variety of different skills such as a corrosive or piercing shot.\nE.D.G.E. System - Activate the E.D.G.E. system on your wanzer to enter a state of high-performance overdrive by boosting its power and slowing down enemies.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":14701,"name":"The Chosen RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99e/99ec158f8191982fa2d541a9c0dfb27e.jpg","description":"The Chosen is a heroic RPG.\nStarting with the faded dream of his missing father, our hero, Edge decides to give his mother's grave a visit. Upon returning, Edge sees his good friend Serenity in a desperate fight with unknown soldiers. Where did these soldiers come from? Why have they been ordered to attack their peaceful village?\nAfter following the trail of these soldiers to the town's historic magic tower, Edge and Serenity discover a mysterious warrior trying to pull the great sword God's Tear from its pedestal. After fighting off this attempt from taking the town's prized possession, Serenity and Edge watch as the mysterious warrior vanishes into thin air leaving even more questions to be answered. Who was this mysterious man? Why was he trying to take the God's Tear?\nAfter this encounter, Edge and Serenity embark on an epic adventure to further discover the purpose of this attack. During this investigation, these two will uncover an ancient myth of their world that foretells a tale of one true hero being chosen to wield the God's Tear and challenge the greatest evil ever to face their time.\nWill you be able to unravel the mysterious plot against you and find your father? Will you become the Chosen?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Little Big Lee","platforms":[{"id":0,"name":"PC"}]},{"id":9324,"name":"The Journey Down: Chapter Two","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/656/6568d7fa828438c43780a754a9c464ab.jpeg","description":"Far below the noisy metropolis of St. Armando, Bwana follows in the footsteps of his lost father together with Kito and Lina. In their search for the mysterious Underland, they discover a dark conspiracy shrouding the fate of Captain Kaonandodo.\nIn the second chapter, the plot thickens as our heroes plunge down into the mist below the Edge and wind up in the foggy and treacherous town of Port Artue where they find themselves cornered by pirates and on the run from the law.\nThe Journey Down is a classic point-and-click saga with an Afro-Caribbean vibe.Features\n* A twisting tale of intriguing adventure\n* Tons of handpainted environments\n* An all original jazzy reggae soundtrack\n* A fully voiced cast\n* HD art and animations\nhttp://store.steampowered.com/app/220090/\nhttp://store.steampowered.com/app/579760/","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BlitWorks","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":52016,"name":"Rogue Hero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/efc/efc2826d2fcfb54ffb59ea0f88017524.jpg","description":"Rogue Hero is a 4 player action rpg with roguelike elements, combining procedural dungeons and an expansive overworld full of secrets. Take down the various dungeons, build up your village, or just fish, farm and swim around Tasos.\nRogue Hero features classic top down sword slashing combat with a large set of tools, spells, and weapons at your disposal. Fight through 5+ dungeons each with their own style, room layouts and unique dangers.\nDungeons are procedurally generated to connect hand made rooms and mix up the layout so no two runs are the same. Keys, puzzles, and traps are mixed up, even within the rooms things won't always play out the same way. Combining randomization with hand placements gives replayability without the fallbacks of uninteresting design that can come from full random generation.\nPlay in solo or in coop with up to 4 players through the entire campaign beginning to end. Build up your village into a bustling community, take down the dungeons that threaten the outer areas and collect tools to open up your world. Max out your Hero and take them into the infinite dungeon to see how they stack up against a never ending onsluaght of enemies, traps, and puzzles.\nFish, Fight, Farm, Build, Explore there's many things to do in Rogue Hero all with their own progression that feeds into other activities and pursuits.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Heliocentric Studios","platforms":[{"id":0,"name":"PC"}]},{"id":39920,"name":"TRON: Evolution - The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa4/aa44d34786832ceceb9aad20c6577f0a.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"n-Space","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":18615,"name":"Space Quest Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d10/d1092a3fa77995a04698d1677d766ad3.jpg","description":"Relive the classic series brought together in one collection.\nRoger Wilco, a sanitation engineer on the spacelab Arcada, awakes from a nap to discover that space pirates have killed everyone onboard. Roger must escape The Sarien Encounter before they use the Arcada's Star Generator against his home planet of Xenon.\nHero and recipient of the Golden Mop, Roger Wilco can barely bask in the promotion of head janitor before he is abducted by the evil Sludge Vohaul. Will Roger escape the dangerous Labion Terror Beast and thwart Vohaul's Revenge?\nAnother narrow escape finds our hero on Phleebhut, where Arnoid the Annihilator wants Roger to settle some debts. Meanwhile, the sinister CEO of ScumSoft and The Pirates of Pestulon have abducted the Two Guys from Andromeda, and Ace Janitor Roger Wilco is their only hope.\nThe Sequel police have been sent by a reborn Sludge Vohaul to exact his final revenge. Roger Wilco and the Time Rippers must travel throughout Space Quests past and future to save Roger Jr. and Xenon.\nCaptain of the SCS Eureka garbage scow and graduate of the StarCon Academy, Roger Wilco faces The Next Mutation when the commanding officer, Captain Quirk, plans to destroy the StarConfederacy.\nCourt marshaled for breaking regulations while saving the universe, Roger Wilco once again finds himself on janitorial duty. While trapped on shore leave, Wilco must rescue Corpsman Santiago and embark upon The Spinal Frontier.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":16613,"name":"NEKOPARA Vol. 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d41/d4188b34e71babfed6d510268b86404d.jpg","description":"Business is booming for La Soleil, the patisserie run by Kashou Minaduki with his two catgirls, Chocola and Vanilla, his sister Shigure, and the Minaduki family's four catgirl sisters.\nAmong them are the sarcastic oldest sister who hides behind a facade of toughness, Azuki, and the clumsy youngest sister who always tries her best even if she ends up doing more harm than good, Coconut. No one got along better than these two catgirls when they were younger, but lately, they've been fighting all the time.\nDespite their sisterly love, a small misunderstanding ends up driving a wedge between them. As the story of these catgirl sisters unfolds, they'll grow to understand each other and strengthen their familial bonds in this heartfelt catgirl comedy, which is only a little lewd. Now open for business!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":802000,"name":"Immortality","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e2/1e2b5d7cdeb5e048a981a3ed2355e83d.jpg","description":"Match cut your own path through the footage and solve the mystery:\r\n\r\nWhat happened to Marissa Marcel?\r\n\r\nIMMORTALITY is an interactive trilogy from Sam Barlow, creator of Her Story. Use the cinematic ability to teleport from scene to scene to explore a treasure trove of newly unearthed footage from the three lost films of Marissa Marcel and traverse decades of movie history:\r\n\r\n1968\r\n\r\nAlan Fischer directs Ambrosio his adaptation of M. G. Lewis’s notorious Gothic novel The Monk. He casts unknown Marissa Marcel as the infamous Matilda.\r\n\r\n1970\r\n\r\nJohn Durick writes his thriller Minsky with Marcel in mind. Set in New York City, the movie concerns the death of a famous artist and Marissa stars as the muse suspected of murdering him.\r\n\r\n1999\r\n\r\nFor his swansong, Durick teams up with Marcel again as she returns from a lengthy hiatus. The movie Two of Everything is a subversive thriller which explores the duality between a successful pop star and her body double.\r\n\r\nNone of these movies was ever released. They were thought to be lost or destroyed. Until now.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sam Barlow","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":613490,"name":"Seven: Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aae/aae175cdc8f9b2c2ebd9a3c0e3ae32be.jpg","description":"Seven: Enhanced Edition is an open-world, isometric stealth and action role-playing game, in which you play as Teriel, a master thief sent on a mission that will shake the foundations of the Vetrall Empire. Includes the Drowned Past expansion.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"IMGN.PRO","platforms":[{"id":0,"name":"PC"}]},{"id":18654,"name":"Invasion: Brain Craving","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e3/8e3a08d7b953ef3cbeba4b59414c6045.jpg","description":"Congratulations! You, my friend, are one of the lucky few who were immune to the pathogen! Alas, your friends and family are now flesh-eating zombie-types, but try not to hold that against them. So, let's see what's behind door number 1! Zombies! Bad luck, chum! Try again!Features:Zombies AND JRPG Elements! What could be better?\nRandomly generated world with 729 combination possibilities!\nRandom event seeds ensure no two play-throughs are the same!\nSurvive in apocalyptic wasteland! Keep your stamina high and your team-mates healthy!\nTraditional side-view battle system!\nPlethora of recruitable characters!\nSteam Achievements!\nSteam Trading Cards!\nIt's the zombie-slaying survival game with JRPG elements you didn't know you wanted!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"New Reality Games","platforms":[{"id":0,"name":"PC"}]},{"id":10095,"name":"Hover: Revolt Of Gamers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f31/f318f21a94d41eadf3812711007013a9_YMbnDZT.jpg","description":"Hover: Revolt of Gamers is a fast-paced single and multiplayer Parkour game in a futuristic 3D Open World.\nThe game takes place in ECP17, a high-tech city also called Hover City by its inhabitants and located on a distant planet. The Great Admin cut the communication with the Galactic Union and established a strong dictatorship. Having fun has become illegal and entertainment is banished.\nYou're in charge of a team of young rebels, the Gamers, fighting against the new anti-leisure laws oppressing the city. Equipped with high-tech gears allowing amazing jumps and speed, they roam the city to sabotage the propaganda, help citizens, and find a way to reach the Orbital Station. This way they could warn the Galactic Union and put an end to the oppression.\nHover: Revolt of Gamers is both a single and multiplayer experience. At any time you can instantly switch from offline to online mode and join your friends or players from around the world and progress through the adventure by cooperating or playing against them. No matter where you are and what you’re doing, you’ll be able to connect. Hover: Revolt of Gamers is also a community-driven game offering many tools to players to create missions or mini games.\nAn Amazing CityHover City is a huge futuristic colorful city. Its buildings offer breathtaking vertical playgrounds.\nFull Open WorldExperience total freedom. Explore the city from its skyline to the underground while doing “parkour”, tricks and high-speed races.\nBuild Your Team10 playable characters are available to unlock. Improve their skills to create the perfect team. You can also customize their colors.\nVarious GameplaysThe core action is based on nervous races and amazing tricks but the game also offers many alternative ways to play from stealth missions to sport matches with friends.\nChoose Your ExperienceInstantly switch from single to multiplayer, whenever you want. Play first or third person or activate the auto camera that mixes both and offers you a dynamic experience.\nCreate Your Own ChallengesWithout leaving the game, use a very simple editor to create your own challenges playable solo or multiplayer.\nCrazy MovementsEquipped with high-tech suits, gamers are able to run at crazy speed, slide, bounce, push off walls and realize incredible jumps. As many ways to play with the City's verticality and escape the police.\nTricks and CombosDemonstrate your skills by realizing grinds and crazy tricks and prove you are worthy to become one of the Resistance's leaders. During a multiplayer mission, realize incredible combos to generate Stunning Auras which will lower your opponents' moral and boost your allies' statistics.\nExperience, Skill Grid and ChipsGain experience and unlock chips that improve the aptitudes of your Gamers. You can trade your spare chips in order to get better ones through the E-Swap trading system.\nOnline MultiplayerJoin your friends online at any time and continue the adventure together, whether you are cooperating or working against them. Participate in race, events or scoring battles created in real time by the community.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":428185,"name":"The Ambassador","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3a/d3acd13985428d02900ab47eca599b40.jpg","description":"Please Wishlist and FollowAs a very small team creating this passion project, every Wishlist and Follow on Steam goes a very long way for us.\nAbout the GameThe Ambassador: Fractured Timelines is a twin-stick fantasy shooter centered around the ability to stop time. You’ll play as Gregor, a newly recruited member of the Eternal Fellowship, and an Ambassador of Time. Just as you are learning to use your newfound powers, the Fellowship’s capital city is mysteriously destroyed! As one of the only remaining fellows, you must find those responsible and return Tamaris to its former glory.\nThe Ambassador features:\nFast paced, strategic combat designed to stretch your time-stopping abilities.\nA vast world composed of fortresses, tall mountains, dense forests, and the smoldering remains of Tamaris.\nAn action-packed campaign spanning five unique environments, two timelines, and 55 levels.\nAn armory of weapons, magic trinkets, and armor, all more unique than the last.\n20 hidden journals containing the history of the realm.\nTough as nails Horde Mode after completion of the campaign\nMultiple difficulty settings ranging from easy and accessible to head-smashing-into-desk mode!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"tinyDino Games","platforms":[{"id":0,"name":"PC"}]},{"id":20906,"name":"DarkEnd","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ca/2ca752445059ba9fcb0e692ef4f6c8f9.jpg","description":"Can you conquer the ever changing dungeons of DarkEnd and save the fall of humanity? Choose your heroes and venture into a world filled with numerous treasures, mysterious secrets and discover a haunting past in this 10+ hours of retro 2D Dungeon-Crawling!Your hero, your destiny There are four playable characters, each with his/her own unique story-line. Select your heroes and help them face their dark past.\nXia: A primagus from the East with the mastery over prime elements.\n\nGriselda: A necromagus with rare ability to control dark ether.\nSvas: A Blood Hunter – master of gadgets and the bowgun; a feared assassin of the night.\n\nLucion: A Knight Templar reputable to be the one chosen to wield the godblade Lorelei.Retro Dungeon-Crawling ExperienceEnjoy traditional gameplay reminiscent of dungeon crawlers RPGs from the 90’s. The battles are challenging yet rewarding, along with a multitude of quests, hidden enemies and treasures around every corner! In addition, DarkEnd also features flexible skill trees that allow you to shape your hero to your liking and tactical needs!Play as you pleaseThere are 4 difficulties which will allow you to either fully experience the game or simply blitz through. Do not like grinding for EXP? Turn on the \"Milestone Leveling System\" and your heroes will level up automatically as the story advances.The choice is yours!High Replay ValueThe story unfolds according to your choice of heroes! Replay with different characters in New Game+ to fully discover the truth behind the DarkEnd.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kodots Games","platforms":[{"id":0,"name":"PC"}]},{"id":20589,"name":"Make it indie!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af7/af7e765dc7051a9059848aefc48db47e.jpg","description":"About the GameClaw your way through the abyss of the mind and survive the horrors that stalk you as you attempt to survive seven days as... an Indie Developer.\nMake It Indie! is an indie game about making an indie game. It is up to you to make tough choices about your indie game while also managing your schedule. Will you crunch to oblivion, ignoring the world around you? Or will you risk it all for a much needed break?\n\nMake It Indie features:\n• Over 30 minutes of HD videos that immerses the player in the life of an indie developers.\n• An intuitive gameplay experience.\n• Multiple unique endings.\n• Truly diverse music tracks.\n\nP.S. Don't take this game too seriously!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sometimes You","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20017,"name":"Broken Dreams","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d6/6d6d2b748a17d27cf8b96402b1fb1e1e.jpg","description":"Have you ever loved somebody so much, that you'd have done anything for them? Broken Dreams is a platformer in which Jack can create 'shadow friends; copies that repeat his previous actions. Complete with a melancholy story, gothic artwork, professional voice-overs, Broken Dreams has received fantastic ratings across the board.\nBroken Dreams is an expansion on the original flash-based game. Complete with full-screen support, new levels, a free asset pack (featuring artwork and music featured in the game) and Steam Trading Cards. Now you can add this awesome game to your Steam Library!\nFeaturing: Beautiful, hand-drawn artwork\nA darkly-enticing story about unrequited love\nProfessional voice-acting\nPlatforming awesomeness, with a twist! Hit space to create a 'shadow' - copies of the character that be be used to circumvent obstacles, as jumping platforms and more!\nControl both characters simultaneously using the keyboard - work together to solve the level!\nAsset Pack includes Music and artwork used in the game","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mihai Morosanu","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":787607,"name":"Golf Gang","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aaa/aaa644279a0e950c8cd0c674e4ab9d27.jpg","description":"GOLF GANG IS OUT NOW!\nAbout the GameGolf Gang is a racing game. It’s a party game. It’s the fastest game of minigolf you'll ever play!  Blend precision with speed to dominate the green in 8-player online mayhem or hone your skills in a solo speed run.\nMULTIPLAYER MADNESSHit the ball while it’s moving, and race round the course at breakneck speed. Challenge your friends across Golf Gang’s three game modes and hundreds of holes to show them you’re the one that’s found the sweet spot between frenzy and finesse.\nMOD SCENEBend the rules to your liking and get creative with Golf Gang’s multiplayer modifiers. Combine low gravity, explosive collisions, and bullet time, plus many more. Create thousands of unique ways to play, each more chaotic than the last.\nGOLF FOR GLORYCompete with your mates for the top of the leaderboard in addictive time trials, classic, and hybrid modes. Golf Gang is all about that classic “just one more go” feeling, as you sneak in an extra hole or 18 during your lunch break!\nCUSTOMIZE EVERYTHING!Turn heads on the course with custom skins, trails, hats, accessories and more, dazzling your opponents with style, as well as skill. Workshop creators can bring their modding skills to a new arena and utilize Unity to craft entire courses for the Golf Gang community!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Lazy Monday Games","platforms":[{"id":0,"name":"PC"}]},{"id":285714,"name":"Pacify","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee4/ee40157d1cb5c1cee73fa5b6d630a082.jpg","description":"STORYYou just signed on with PAH Inc. Paranormal Activity Helpers Incorporated, yeah sounds corny, but the pay is great. They said you won't ever be in any real danger, and they have tons of work right now. Your first job is at some old haunted house. There is a broker wanting to put the house for sale, but with everyone in the town spreading rumors of evil living inside the house, he needs some proof that it is safe. He actually seems creeped out himself. Anyway, he hired PAH Inc. to check the place out. You can go check it out alone if you'd like, but I would take at least 3 more friends with me. Check the place out, and if there is anything supernatural going on, try to bring evidence back to PAH Inc.MYSTERY OF THE HOUSEThis house was built over 100 years ago. The owners ran a funeral parlor. They held normal funeral services such as ceremonies, wakes, cremation and burying the dead. The rumor around town is that they also offered a very special service, a way to talk to your deceased loved one on last time. Several people paid for the service, and after some type of ritual, they were able to speak to the dead. Something apparently went wrong during one of the rituals. A person from town and the owners of the house disappeared and were never seen again. Over the last century, a few people that investigated the incident never returned. A few kids sneaking around the place claimed to hear laughter and see a little girl in the window. There probably isn't any truth to any of it.GAMEPLAYIn Pacify, you will be running for your life around the narrow corridors of a dark, old house. There is a little girl that switches between good and evil roaming around. Different circumstances can cause her to change. Once the evil takes over, it will chase you and your friends all over the house. You must find a way to Pacify the evil and escape the house. As the game progresses, the evil gets smarter and faster.\nPlay alone in single player mode, or play with up to 3 more friends in multiplayer. In multiplayer mode, you can choose to play with or against your friends. Read the notes for clues about Pacifying the girl. Find and use keys, dolls, wood and matches to help you on your way. The girl can hear and see you. Stay out of sight, and stay as quiet as possible. Try different types of strategies to win.\nSingle Player Mode\nYou can go in the house alone, but the game will be difficult. You must do the work of 2-4 people all by yourself. It is possible though and very scary to take on the girl all alone!\nCo-Op Mode\nIn co-op multiplayer, you work together trying to help each other escape the house. You can save each other from the girl by interrupting her when she catches someone.\nPVP Mode\nIn pvp mode, everyone is an intern for PAH Inc. vying to get a full time position. The person that does the most work gets hired. You can push each other down and get in each other's way. Pushing a player on the floor stuns them for 5 seconds and causes them to drop their keys.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Shawn Hitchcock","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":29204,"name":"Knack 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/264/264f6b47e63e639a2c7e837bcea463e6.jpg","description":"Meet Knack, a little guy with surprising moves and the ability to transform from big to small and back again in this family-friendly adventure from the developers at PlayStation.\nSurprising Abilities\n•    Over 20 awesome moves including boomerang, whip rush, sword, multi-bomb and body slam\n•    Grow to the size of a building or shrink down to just two-feet tall\n•    Jump in a tank or robot and control it – or just destroy them\n•    Collect relics to power up and smash your way through hordes of enemies\nFamily Friendly\n•    Seamless co-op mode so you can play together whenever you choose\n•    Accessible gameplay for kids and challenging gameplay for adults\n•    Pick up and play or sit down for a Knack marathon\nAdventure & Puzzles\n•    Save the world from a villain who’s reviving ancient weapons and enormous titans\n•    Vibrantly colored world with stunning graphics\n•    Puzzles for varying skill levels\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 Sony Interactive Entertainment Inc.  KNACK is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":22704,"name":"Rayman 3: Hoodlum Havoc","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b7e/b7ef2fd6572750367ed77e2703402966.jpg","description":"Rayman’s in prime form with new high-tech powers and gear like Shock Rockets, the LockJaw, Funky-Boards and other cool stuff. Charge into intense strategic battles with the crazed Hoodlum Army and massive transforming bosses. Plunge into enormous, eye-popping worlds packed with zany comedy and a wacked-out cast, featuring John Leguizamo as Globox, and enjoy a bizarre, epic adventure filled with a unique blend of humor.One of the latest installments of the great Rayman series - awesome humor and great music\nGreat 3D platformer gameplay that challenges you on every step\nA great variety of gameplay styles - from different flavors of platforming, to funky arcade racing","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Ubisoft","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":22394,"name":"Borealis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b8/7b87220e0dbbc130f0cf7a50dd5f52fb.jpg","description":"Borealis is a Zen game focused on measured motion and planning, rather than swift action.\nThe goal is simple: don't get hit. You have no weapons to fight back though. That would be too easy. In fact, you can't even move very fast. Your only way through is to guide the incoming waves into each-other through subtle and careful shifts. Violence is the last refuge of the incompetent, after all. Better to guide your opponent into destroying itself.\nThe game is composed of many environments, each of which has a unique style and set of missiles, as well as its own sound profile. Each will require a different strategy, and produces more interesting types of missiles as you advance. All of this is done to a procedurally-generated soundtrack that is completely driven by what happens in the game.\nFeatures:\nThree gameplay modes: Survival, Score run, and Endless\nMany different moods, which each represent a massive change in gameplay\nCompletely procedurally generated, with incredible replay value\nKnown to induce meditation-like trances in monkeys*\n*Not actually tested, results may vary.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Conrad Nelson","platforms":[{"id":0,"name":"PC"}]},{"id":20736,"name":"Ballpoint Universe - Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdd/bddc90fded6a5e9eb81a206d5bcc9f70.jpg","description":"Ballpoint Universe Infinite is a shoot-em-up adventure game featuring artwork entirely drawn in ballpoint pen. Explore immaculate worlds, discover the secrets of the doodles, and customize your Ink-Ship for battle!\n\nPress\n\"Ballpoint Universe Infinite is too exuberant to ignore.\"  - Gamespot\n\"Holy Crap, This Entire Game Is Drawn In Ballpoint Pen\" - Kotaku\n\"I’m not in any way, shape, form, or doodle of a mechanical steampunk owl creature writing this one off. It’s positively packed with promise...\"  - Rock Paper Shotgun\n\"There comes a point in every artist’s life where they see something so amazing, so unreal, that they question what the hell it is that they’re doing with their own life. Watching the trailer for Ballpoint Universe is one of those times for me.\"  - Daily of the DayFeaturesExplore incredible hand-drawn worlds\nCustomize your ship\nTake missions and blast through waves of enemies\nTest your skills in Infinite Mode\nAbout the DevelopersArachnid Games is a fancy name for what is really just three dudes who love making games together.  We're based in Berkeley, CA, and started in 2012.LinksArachnid Games Home\nArtist's Tumblr\nArachnid Facebook","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Arachnid Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15404,"name":"Hyperdimension Neptunia Re ; Birth2 Sisters Generation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90e/90ebd473491430d3bc3019a890309bf0_w9TSfLN.jpg","description":"超次次元ゲイム ネプテューヌRe;Birth2\nGamindustri in 1080! Experience all the humor, turn-based battle, and crazy HDD transformations of Re;Birth2 with the sheen of 1080p excellence!\nFour or More for War! Have up to 4 characters on the battlefield, and 4 more on the sidelines, ready to jump in and give their support!\nStella goes Rogue! Send Stella out to brave Gamindustri’s dungeons in this realtime mini-game and she’ll collect all kinds of treasure for you – you just sit back and eat pudding! Be careful though, because if she dies in the dungeon, she’ll lose all her special gear!\nThe World’s your Oyster! Customize the Gamindustri experience with Plans, which allow you to do things like increase/decrease enemy difficulty, change the items you’ll receive from a dungeon, and more!\nBuild-a-Sword! Use Idea Chips and Blank Discs to create custom equipment that can open up new worlds of skills for you!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Idea Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":9931,"name":"Tiger Knight: Empire War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4a/f4a7f5c30e8ce7deaa69e820d28b65ad.jpg","description":"Tiger Knight: Empire War is an epic Action Strategy PVP game that brings vivid, historically accurate detail to large-scale warfare set circa 200 BC. Featuring meticulously researched battle equipment and weaponry, music from renowned Final Fantasy Composer Hitoshi Sakimoto, and delivering high-octane strategic combat - Tiger Knight: Empire War delivers a thrilling gameplay experience that will keep you coming back for more!\nIn the Early Access phase of the game, players can take control of three of the most powerful armies in Chinese history - the Three Kingdoms. Each army boasts its own strengths and weaknesses, allowing players to choose the forces that best represent their battle strategies. Tiger Knight brings the archers, infantry, cavalry and generals of the Wei, Shu and Wu armies to life using an optimized Unreal3 engine, as well as the PhysX physical engine, Hair Works and advanced action motion capturing. The developers at NetDragon have spared nothing in their attention to historical accuracy, researching existing ancient artifacts to design each weapon and piece of armor available in the game, while using real-life battle equipment to record in-game sound effects.\nThe game features three distinct modes of play, and will soon expand the selection of armies to include the Romans, as well as many of histories other greatest forces! Join the battlefield today to see why so many players have already fallen in love with Tiger Knight: Empire War!Game ModesCommand Mode: PVP Mode (with soldiers)\n10-14 players from all camps can respectively command 1 adjutant and up to 40 soldiers. Command Mode consists of battles comprising hundreds of units and includes two sub-modes: Conquest and Siege.\nDuel Mode: PK between generals (without soldiers)\nThis mode features battle without soldiers. It supports a 16V16 battle and contains six sub-modes. Players can fight individually or in teams. Each bout lasts for about 15 minutes.\nEpic War: Cooperation between teams (PVE Mode)\nPlayers must cooperate as a team to fight with the AI in realistic simulations of famous battles from the Three Kingdoms period. This mode features three difficulty levels: easy, normal and hard.Game FeaturesControls\nUtilizing a classic keyboard & mouse control scheme by default, players attack/parry with their mouse and move/issue orders with the keyboard. Players have access to a vast amount of combo attacks, charge attacks, and charge and penetration techniques to defeat opposing forces in battle.\nRestraint on Weapons and Armors\nTiger Knight employs a unique method for calculating damage and defense. Damage is classified into several types according to weapons and attack methods (chop, crush and pierce). Armors are offered in cloth, leather, iron and composite materials, and weapons will have different effects when paired with distinct armors. Damage will also vary based on the location of each battle.\nReal-Life Battlefields\nTiger Knight features numerous iconic real-life battlefields, each requiring a tailored combat strategy. Players’ success will hinge on how well they adapt their strategy for each location.\nVarious Collection Modes\nTiger Knight features 10 upgrade modes, each containing 5-10 troops. Players unlock and upgrade new modes by obtaining experience, prestige and copper, recruiting adjutants from famous heroes in the Three Kingdom Period and training them in different skills and formations.\nVast Equipment Supply\nTiger Knight offers players more than 1000 historically accurate pieces of armor and weaponry, as well as 50 horses and accompanying gear. Each weapon and piece of armor is useful under certain circumstances, enabling players to outfit their generals to their preferred style of play.\nUnique Adjutant System\nIn addition to unlocking new soldiers, Tiger Knight players can also recruit famous adjutants throughout the game. These adjutants each have unique capabilities and skills, special formations, and different levels of loyalty.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NetDragon Websoft Holdings","platforms":[{"id":0,"name":"PC"}]},{"id":864991,"name":"Torchlight: Infinite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/049/049fa2b57f9b0dd9470737508d91a018.jpg","description":"JOIN US ON DISOCRD\nAbout the GameThe Journey to Restore Light and Brilliance\nWhen Ember Tech submerged to every corner on the land of Leptis 200 years after Torchlight II... all lives thrive under the Ember power. Beyond the prosperous civilization, the darkness that never stop corrupting begins to consume and outwit lives... It is then, a team of heroes with elite powers emerges. They confront darkness in the eye as they embark in the epic quest to fight back darkness corrupted Aemberons.\nGrind to Get All\nLoot to upgrade build styles and to establish a sparkling private legendary catalogue. Unlimited drops from battles all await for your selection to reveal their true value. Enhance hero builds or to prove your grind power in the in-game free-market.\nRich Build Possibilities\nTogether with 5 unique heroes - and many more to come - 24 talent tabs, 200+ legendary gears, 230+ powerful skills all fuelling into the utmost infinite possibility on hero builds to suit any playstyle. Whether it's blasting foes with fields of fire and ice, hacking and slashing through waves of Aemberons, or raining fury justice down with magical projectiles - you build your very own hero!\nUltimate Free-Market\nA hundred Torchlight Hunters can aspire infinite amount of unique hero builds, and you, can be an important component to someone's prominent build. Utilize the Trade house to be a part of a booming economy. One man's trash might be another man's treasure! No one knows how much value your loots hold, until you get involved!\nBustling Thrill\nWith no stamina and no cooldowns, grind in full power anytime, anywhere! Whether you choose to smash down the incoming waves with melee attacks; blast off magical explosions and draining pools; snipe down ranged enemies, you own your very battle style. Nothing can hold you back from revealing the secrets of the fading light...\nBurden-free Gaming\nStaying outright free-to-play, all gears, affixes, crafting material and upgrades on attributes are all loot-based. Exclusive drops to accomplish your unique build style goals can only be obtained from power grinds. Further your personal visions on builds and appearance from available microtransactions.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"XD","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":487916,"name":"Super Mario 3D World + Bowser’s Fury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd2/cd22f0dcf8f080086c60f77eed7a8a93.jpg","description":"The cat’s out of the bag—Super Mario™ 3D World is coming to the Nintendo Switch™ system!\nPounce and climb through dozens of colorful stages! Mario (and his friends) can use power-ups like the Super Bell, which grants catlike abilities, like climbing and scratching. Work together locally* or online** with up to three other players to reach the goal…and to see who can get a high score.\n\nThe Super Mario 3D World + Bowser’s Fury game features the same great co-op gameplay, creative levels and power-ups as the original game, but also so much more. Additional details about what fun things this game has to offer will be revealed soon!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":428801,"name":"8Doors: Arum's Afterlife Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e64/e640092f72a5775ac9ee5109f1e67e53.jpg","description":"Description\n“8Doors: Arum’s Afterlife Adventure” is a story-driven Metroidvania style 2D action platformer heavily influenced by Korean folk tales of the afterlife. Play as ‘Arum’, a brave girl that has voluntarily entered the realm of the afterlife in search of her father’s soul and adventure through the 8 doors of purgatory and solve mysteries that lie deep within the realm of the afterlife. Defeat wretched wraiths blocking your way and rescue fugitive souls who need your guidance.\nFeature\nGame Play\nExplore : 8 different area of purgatory and various level designed obstacles.Battle : Though battle with combo attack and dodge. More than 30 species of specters and 12 species of boss specters with unique patterns.Growth : Ability, Passive skill and 7 weapons. What can get from proceeding the game.\nWorld View, Story\nWorld View : The fascinating world of after death of The Orient.Story : Korean traditional fork tale based background concept and characters.\nArt, Graphic\nUnique art : Using only 3 Color only 3 color 'White'/ 'Black'/ 'Red' to show our world.Animation  : All Character drawn by hand 2D frame by frame animation.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Rootless Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":56088,"name":"killer7","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cd/3cd0ecac1ed63a949a14e21b2e22eb9a.jpg","description":"Killer7  (stylized as killer7) is a 2005 action-adventure video game for the GameCube and PlayStation 2, developed by Grasshopper Manufacture and published by Capcom. The game was written and directed by Goichi Suda, also known by the nickname Suda51, and produced by Hiroyuki Kobayashi.\r\nThe game follows an elite group of assassins called the \"killer7\". The assassins, physical manifestations of a man named Harman Smith, perform hits on behalf of the United States government. Through these missions, the killer7 uncover a deeper conspiracy regarding the role of Japan in U.S. politics and secrets about the nature of their organization. Killer7 features first-person shooter elements and a unique on rails control scheme, but the core adventure-style gameplay has been compared to Myst and Snatcher.\r\nKiller7 was Suda51's first game released outside Japan. It received polarized reviews due to its unconventional control scheme, linear gameplay, and complex noir plot. While some reviewers appreciated the stripped-down controls and stylized arthouse approach, others panned it as confusing and restricting. However, the game's soundtrack, presentation, visual style and thought-provoking story received generally positive responses from critics and considered as the best aspects of the game and lead to several accolades and nominations. Despite these setbacks, Killer7's cult appeal led to remakes of Suda51's older works and the successful launch of No More Heroes.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Engine Software","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"},{"id":0,"name":"PC"}]},{"id":19520,"name":"Dark Void","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/020/0201753dc1c4ab83779c68888e7abff9.jpg","description":"Dark Void™ is a sci-fi action-adventure game that combines an adrenaline-fueled blend of aerial and ground-pounding combat. Set in a parallel universe called \"The Void\", players take on the role of Will, a pilot dropped into incredible circumstances within the mysterious Void. This unlikely hero soon finds himself swept into a desperate struggle for survival, joining forces with a rebel human group called The Survivors.  Trapped in the Void, these resistance fighters are battling to hold off a mysterious alien race that plans to threaten Earth.\nDark Void’s unique combination of jet pack-booster aerial dog fighting and third-person combat brings a thrilling new gameplay dynamic to the third-person shooter experience.  Taking 3D action to a whole new level, Dark Void’s unique vertical combat system allows players to dangle from thousand foot drops as they take cover and hurl enemies to their doom, bringing a whole new sense of tension and thrill to the player.  Will is also equipped with a powerful rocket pack which allows for fierce in-air combat, hurtling through the Void at blistering speeds while shooting down anything that gets in his path.\nSci-Fi action/adventure combines aerial and on-foot combat for a totally unique third-person shooter experience\nWill’s jetpack delivers total freedom of movement allowing players to race against UFOs in high-speed chases and rain death from above onto unsuspecting otherworldly foes\nSpeed and scale unmatched by any other action title: send Will zipping through tight corridors and then out into immense canyons and futuristic geoscapes\nGravity-defying vertical combat system, where moving up is the only way to bring your enemies down\nSeemless transition between jetpack flight, ship-to-ship dog fighting and third-person shoot-em-up action all exists within the same level - not broken up into different \"areas\"\nHuge bosses that require fast reflexes and aerial barnstorming maneuvers to defeat\nDeveloped by Airtight Studios, a new group featuring team members from the Crimson Skies series of video games","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Airtight Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":165,"name":"Crashlands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfc/dfceb16cb2856f7b8ac27ffa17ecc900.jpeg","description":"TIME Magazine Top 10 Games of 2016\n\"Usually I can say what a game IS and be done, but it's hard to figure out what Crashlands ISN'T. It's a funny, crafty, fighty, jumpy, makey, adventurey, type... thing. I think they started making a cool game and just couldn't stop. \" - Tycho, Penny Arcade\nCraft, battle, and quest your way through Crashlands, a story-driven Crafting ARPG overflowing with sass!\nBecome Flux Dabes, a galactic trucker whose latest shipment gets derailed by a chin-strapped alien menace named Hewgodooko, leaving you stranded on an alien planet. As you hustle to retrieve your packages you’ll become enmeshed in a nefarious plot of world domination, which will require all of your wits and both of your glutes to overcome. Learn recipes from the local sentient life, make new friends, uncover ancient secrets and deadly bosses, tame everything and build yourself a home-away-from-home as you learn to thrive on planet Woanope.Key FeaturesExpansive Crafting System\nUnlock over 500 craftable items as you explore the world and learn its secrets!\nSelf-managing, Infinite Inventory\nIn Crashlands, your inventory is infinite, manages itself, and retrieves your tools when you need them, so you can focus on adventuring, questing, and building. You'll never have dig through your bag or return to your base to free up inventory space!\nRPG-Style Character Progression\nBecome more powerful through creating ever-more-amazing items! As you grow in power, you can venture to new regions of the world, meet strange characters, discover new stories, and encounter new and interesting enemies.\nSkill-Based Combat\nLearn the attacks of the enemies you encounter, and use your skill, agility, and wits to defeat them! You can even augment your fighting prowess with the power of the dozens of gadgets you can craft. Set your enemies on fire, stun them, slow down time, and more!\nIntuitive Base Building\nBuilding a base in Crashlands is so simple it feels like fingerpainting. You can create beautiful, sprawling bases in minutes!\nTameable Creatures\nEvery creature in Crashlands can become a trusty combat sidekick. Find an egg, incubate it, and hatch your very own adorable or hideous bundle of joy. You can even craft special items to grow and empower them!\nHuge World... with Huge Problems\nFour sentient races, three continents, an epic bid for the future of the planet, and you - trapped in the middle, trying to deliver your freakin' packages. Take your time to dive into the sidestories of the characters you meet or just rush headlong into making that special delivery. With hundreds upon hundreds of quests, there's a lot to do and discover on planet Woanope!\nCrossplatforminess\nDon't want the fun to stop? Crashlands is also available on mobile - the exact same game, with your cloud-synced progress - so you never have to stop!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Butterscotch Shenanigans","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":61622,"name":"The Spiral Scouts","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/961/961793262cbc8d8942d93406337c8142.jpg","description":"Join Remae, the newest member of the Spiral Scouts, on her slap-tastic puzzle solving adventure through a world of crazy characters and redonkulous realms. Experience a fartwarming tale of personal growth, self discovery, poop, wieners and butts.\nThe founders of the Spiral Scouts have been isolated and sealed away within their realms by a mysterious force, preventing them from gathering together at the Citadel to perform the Spiral Ceremony; a sacred tradition of paramount importance. It's up to you to travel to each realm and earn enough Scout Badges to break the seals and reunite the founders before it's too late!\nEarn up to 30 Scout Badges across a lively forest, a spooky graveyard and whatever that other place is!\nOver 50 unique puzzles that'll challenge you to think through solutions in a variety of interesting ways!\nNon-linear progression allows you to tackle challenges in almost any order!\nSlam-packed with dozens of idiots to interact with, each with their own stupid problems to solve!\nCute paper cut-out art style that weirdly fits with all the depraved and disgusting stuff in the game!\nSick original soundtrack by the composer behind the music for \"HuniePop\", \"Song of the Deep\" and \"Welcome to the Game\"!\nTake drugs, make fun of losers, fart in people's faces, witness horrific atrocities and so much more worse!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cantaloupe Kids","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12356,"name":"Governor of Poker 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/133/1331e46bec3921ade582905c514dac15.jpg","description":"Governor of Poker 3 is the best free multiplayer poker game with a great design. In this multi-player version of Governor of Poker you compete live with thousands of real poker players to prove you are the best and number 1 Texas Hold ’em poker star!\nBecoming a poker pro is a long journey through Texas; you will start as a rookie and work yourself all the way up to become a VIP poker player, a high roller to end up winning high stake games  in the Gold area.\nGreat Game features :\n-  5 DIFFERENT POKER Formats:  Cash game, Sit & Go tournament, Push or Fold, Big Win and Royal poker.\n-  Play BLACKJACK 21: many different betting amounts\n-  Big FREE welcome package of poker chips, gold and a Cowboy or Cowgirl hat.\n-  FREE chip stack bonus every 4 hours!\n-  Distinguish yourself by winning badges and trophies with your poker skills\n-  Cross platform game: Play against mobile(Android and iOS), steam and web players\n-  Play with poker buddies: Make friends & Invite them to play with you at the same table and send chip gifts!\n-  Complete poker achievements and win gold coins and XP points.\n-  Chat with other hold em players through chat and animating emoticons. Use them to bluff or taunt players so you win the poker hand !\n-  Connect your email and continue playing your Steam poker progress on your Android or Apple iOS device!\n*** What are you waiting for?! Download and Join the most exciting poker adventure now! ***\nNote:\nThe games are intended for an adult audience. (e.g Intended for use by those 21 or older)\nThe games do not offer “real money gambling” or an opportunity to win real money or prizes. (e.g the game is for amusement purposes only)\nPractice or success at social casino gaming does not imply future success at “real money gambling”","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"YoudaGames","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]