[{"id":840789,"name":"Entropy: Zero 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b49/b49f665aa3b632284a932fc146c29fa5.jpg","description":"The pessimistic, wisecracking, door-kicking zealot known as 'Bad Cop' is back.\n\nCommand a small army of Combine synths and soldiers on a Northern campaign to capture Dr. Judith Mossman.\n\nTread in the wake of Gordon Freeman at Nova Prospekt. Explore the mysterious 'Arbeit Communications' facility. Discover what lies beneath. Drive an APC through the arctic wastes. Confront the rebels on their doorstep and uncover a long-forgotten secret.\n\nEntropy : Zero 2 is a modification for Half-Life 2.\nFeatures\nOverhauled combat - new effects, enemies and weapons!\nA brand new campaign spanning seven chapters of content.\nOverhauled enemy AI, enemy willpower and enemy variants create exhilarating combat scenarios.\nA narrative driven experience with a fully-voiced and choreographed cast.\nCommand squads of Combine soldiers. Have them do your bidding!\nExperiment with Xen grenades - weapons that consume enemies and objects and spawn Xen lifeforms in return.\n\nWarning: Entropy : Zero 2 contains flashing lights that could affect you if you are photosensitive. Please be careful when playing if you suffer from epilepsy or photosensitivity.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Breadman","platforms":[{"id":0,"name":"PC"}]},{"id":802170,"name":"Farthest Frontier","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/550/550c2282ba1024106d0f5c8a8580dbd2.jpg","description":"Protect and guide your small band of settlers to forge a town from untamed wilderness at the edge of the known world. Harvest raw materials, hunt, fish and farm to sustain your advancing town. Produce crafted items for villagers to trade, consume, equip and fight with as you battle for your survival against the elements and outside threats (pacifist mode available for players who do not want to engage in combat).\nKey Features\nHarvest, Grow, Craft - Harvest 14 different raw materials from wood, stone and clay, to metal ores, wild herbs, and honey. Grow 17 types of food, including forage items, fish and game, plus 10 food crops, each with different characteristics. Produce 32 crafted items and materials in a multi—tiered economy.\nBuild and Advance - Construct 50 different types of buildings as you grow your town from a fledgling settlement to a bustling city. Your town center and housing will advance through multiple building tiers as the prosperity and desirability of your town increases. Upgrade production buildings to increase efficiency and enable production of more advanced items.\nMost Detailed Farming System Ever - Strategically select from 10 crops with unique growing characteristics and configure crop rotations to maintain soil fertility, avoid heat and frost damage, and prevent the accumulation of diseases. Cultivate your fields over time, removing weeds and rocks, raising fertility and adjusting soil mixture to achieve maximum crop production to keep your growing population fed.\nAdvanced Town Simulation - Villagers actively live their lives and perform their jobs in real time. Watch as villagers carry goods across town from remote work-sites to be processed into materials and crafted into items. See foods and goods delivered to homes, the trade post or stored for later use. Develop roads, transport wagons and improve storage methods to facilitate the efficient movement of goods through your town and prevent spoilage.\nRandomly Generated Maps - Farthest Frontier is highly replayable and no game is ever quite the same with beautiful, completely randomized terrain generation and resource distribution. Controls allow players to specify the amount of water or mountains they desire, with extreme maps leading to unique challenges.\nIdyllic to Brutal - Customizable difficulty options allow players to turn off features like invaders and disease, for a more tranquil experience or max out difficulty to truly test their town-builder prowess.\nEnvironmental Interaction - Develop your economy based on which resources are locally abundant and produce items for trade to acquire that which you lack. Erect fencing to keep deer away from crop fields and stop bears from raiding food storage. Manage tree cover to prevent underground water supplies from drying up. Balance the need to clear land for agriculture around vital natural resources like wild growing medicinal plants and forage items.\nAll Them Old-Timey Diseases! - Ensure your villagers have clean water to stop outbreaks of dysentery and cholera. Collect berries and plant greens to avoid scurvy and ensure a healthy diet. Make sure villagers are properly shoed and clothed to reduce chances of contracting tetanus, rabies or frostbite. Build a healer’s house to quarantine the infected and provide herbs and medicine for treatment. Manage rodent populations by collecting waste, securely storing food and employing rat catchers to ward off the feared bubonic plague.\nFend Off Would-Be Invaders - Choose to play on pacifist and avoid combat altogether or engage with varying levels of raider difficulty to raise the stakes for your town’s survival. Progress from wood palisades to stone walls, build towers and barracks, recruit and equip soldiers in the defense of your town as rising prosperity attracts the attention of raiders and foreign armies seeking plunder.\n\nCrate Entertainment is a fully independent developer and publisher located outside Boston, MA. Crate is best known for the critically-acclaimed action-RPG, Grim Dawn. Join the Crate community and help shape the future of development of our games and be among the first to receive news about Farthest Frontier by participating in polls and discussions on our forum.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Crate Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":496696,"name":"Mr.Mine","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80e/80ea6e3c930dacb0644b6f7ce38dd9e8.jpg","description":"Like Cookie Clicker, A Dark Room, Candy Box, Mr. Mine is a classic idle game that you won't want to quit.\nOriginally released in 2012, Mr.Mine was played more than 10 million times and has now been remastered for Steam.\nMr.Mine approaches incremental games in a novel way by emphasizing adventure and discovery.\nManage a team of miners and upgrade your drill to idle your way through the mines and discover mysteries and treasures in the depths below.FeaturesTons of Modular drill upgrades.\nNumerous Quests to complete.\nLots of blue prints to collect and craft.\nMany Secret encounters. Can you find them all?\nChests with hidden upgrades.\nUnlock new features the deeper you go. Discover them all!\nAfraid of federally induced inflation? Mine tons of precious gems and ores to make your billions! Klang Gang!\nUpdated artwork & rebalanced progression from the original!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Austin Oblouk","platforms":[{"id":0,"name":"PC"}]},{"id":393544,"name":"PROP AND SEEK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/26b/26b8cfd4a749b615be6180917b661df6.jpg","description":"Prop and seek is a hide and seek game which 16 players take turns to hide or seek. You can be a prop to hide or be a hunter to find all hidden props.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Vidibidi Games™","platforms":[{"id":0,"name":"PC"}]},{"id":61148,"name":"The Hong Kong Massacre","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6f/a6f09d44e16cdea3fdd6efd19716b4b7.jpg","description":"The Hong Kong Massacre is a fast paced top-down shooter set in the city of Hong Kong. Inspired by Hong Kong action movies the game let's the player engage in hard-boiled gunfights around the city, in levels ranging from restaurants to building rooftops.\nThe game features slow motion and dive/dodge mechanics to aid the player engage in epic gunfights. Every shot is deadly so there is no room for mistakes.\nEach level contains not only enemies to kill but also different challenges for the player to complete that unlocks weapons and upgrades.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"VRESKI","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":51170,"name":"Mr. Prepper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b09/b09617645c68ec6508a4068d9a913b34.jpg","description":"Mr. Prepper is about to be preppered. You know something is wrong, the risk of a nuclear war is in the air and you need to be prepared for what's comming. They promised freedom but dealing with your paranoid government is just another day in this survival crafting game;\n- Build an underground shelter\n- Craft machines that can keep you alive; farms, greenhouses, tools, vehicles etc.\n- Trade with neighbors, give them what they need, get what is useful to you\n- Make a plan, you need to get out of this country\n- Beaware of the secret police, they don't want you to be prepared, they want you to stay in their control\nMr. Prepper is the guy who live in a country which once was the land of freedom but step by step its government changed everything. If you don't obbey - you dissapear. Be as they want you to be or be gone. Our hero decided to opose, to get out of this delusion of life. The only way for him to hide his plans and his doings is to build an underground shelter and construct a machine that helps him get out across the border. But he will need materials, materials so rare in this world - help him get them, help him escape without being discovered.\n- Craft\n- Trade\n- Survive\n- Get out of there","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Rejected Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":32989,"name":"Spider-Man: The Movie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b73/b73205dce2310f1ecdfe760877540b8b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Neversoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":17383,"name":"Meltdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c70/c70ecfab3d0c4fdfb62d84c3ebda9fc7.jpg","description":"Meltdown is a tactical arcade shooter featuring both singleplayer and intense online multiplayer.\nSet against a captivating sci-fi backdrop, the action game invites players to follow its main character, Zed, as he tries to shoot his way out of the remote space station that he has been trapped on as a result of a system malfunction.\nDuring the course of the adventure, players can collect loot and level-up their character as they make their way through randomly generated levels. They can choose to play single player or co-op multiplayer, while experiencing an engaging gameplay, matching their gaming skills and style.\nClear all the missions and run the prestige mode !Key Features: Online Cross-Platform Co-Op & PvP Up to 4 Players\nLocal Co-Op Up to 4 Players\n30 Random Generated Levels\n3 Specializations (Specialist/Soldier/Medic)\n3 Big Boss Battles\nWave-Attack arena challenges\nVR Mode","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phenomenon Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14226,"name":"Meridian: New World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf3/cf32196b5122000f9b48979488c96753.jpg","description":"An accomplished, old-school, indie, futuristic Sci-fi RTS with RPG elements!!\nPlay as Daniel Hanson, commander of the first expedition to planet Meridian and uncover the dark secrets it holds! Shape the world around you with every decision you make and through every dialogue with your crew. Meridian: New World offers countless options to devise your own strategy, including various equipment options for your units and special abilities for you to rely upon. Use your abilities anywhere on the battlefield and turn the tide of battle by weakening the enemy troops. Alternatively take the covert approach and sabotage the enemy power supply to shut down their production. You can rely entirely on researching superior weapons or special abilities. Or you can risk building a large economy, constructing a massive army from your enormous resources. The strategy you use and how many troops you sacrifice to reach your goal will influence the attitude of your crew towards you. Are you ready to shape the history of galactic colonization?\nhttp://store.steampowered.com/app/312330\nBrought to you as the brainchild of Ede Tarsoly - the sole man behind Elder Games - Meridian: New World was mostly received with disbelief and awe at the fact that it's a one-man production. While it remains true that Ede is the source of every detail of the game, some assets were created by his friends Balázs Bodnár, Tamás Gyermán and Gábor Menyhárt, who are credited with their contribution.\nEngaging and original story with varied missions\nA single player game\nPolished, dynamic and fluid unit control\nBeautiful graphics; realistic environments\nAmazing immersive music\nSteam Workshop\nShare the maps you create in the editor with the Community.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Elder Games","platforms":[{"id":0,"name":"PC"}]},{"id":11932,"name":"Infra","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/753/753093303c30b95ff5be8bdddf090cce.jpg","description":"Episodic FormatINFRA is released in an episodic format. Currently released and included with the game are INFRA: Part 1 and INFRA: Part 2. The last part, INFRA: Part 3 (release date to be announced) will be released as a free update to all owners of the game.\nFeature ListSolve varying mechanical and electrical puzzles\nExplore highly detailed maps with multiple routes and hidden secrets\nVisit dozens of unique locations, each with their distinctive gameplay\nAvoid hazards and survive in the crumbling world\nLearn about the city of Stalburg and its people\nUncover a massive scheme behind the city's problems\nAbout the GameINFRA puts you into the boots of an ordinary structural analyst – nothing more than a desk jockey assigned to survey some routine structural damage. Quickly though, your mission turns from a mundane trek to a fight for survival, all caused by deep-rooted schemes of the past. Your tools are simple: the camera around your neck and the wits to navigate a virtual labyrinth of debris. How you tell your story is your choice, will you have the commitment to finish your duty, or will you ignore all else but the preservation of your own life?\nINFRA is what we like to call a gun-free puzzle adventure. Instead of large explosions and powerful guns, you will rely on your cunning to survive puzzles in an incredibly detailed world. As you travel through the infrastructure of a city you will find that your actions and thorough observations ultimately determine if others will survive. A society obsessed with upgradation has brought a disaster upon itself and it is your job to help restore it.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Loiste Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":11241,"name":"Kopanito All-Stars Soccer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/daf/daf946baff624d57e02bf6fe9b1df780.jpg","description":"Early Access SummaryKopanito is now more than 2 years in constant development. Everything started back in July 2014. For the first year the game was developed internally and then we decided to hit Steam Greenlight. This is also our first game!\nThis post is a short summary of the whole Early Access period, which is now ending (and we like summaries). Leaving Early Access is a big milestone for us too.\nIf you've monitored the game's progress for some time, then this post may give you a better picture of the whole development process overall. Hopefully you will find this lecture interesting.⚽️ The Idea behind Kopanito\nSo why to make an arcade 2D football game in 2016? We've started working on the game in 2014. From our research it appeared that there weren't many popular arcade football games available on Steam. And having a choice is a good thing.\nClear inspirations for the game were classics such as Nintendo World Cup (graphics, crazy super-moves), Sensible Soccer and Kick Off (skill-based gameplay). We've spent countless hours on these games 20 years ago ːkopanitosmileː So why not to make something similar today?\nWhat does skill-based mean? It means, that you need to learn the game's mechanic over time (like in real life football). You need to work out your precision and reflexes to be a better player. Luck means little in Kopanito. The better player just wins and there aren't footballer stats that can help you. You are the stats. Super-moves also are skill-based, the better you play, the more of them you gain during a match. Some super-moves can neutralize opponent's super-moves.\nKopanito is also a game that we wanted to play. To bring back fun to football games. We've made it with love, working sometimes on weekends or in overtime, being vocal on the forums and responding to the issues reported.⚽️ Greenlit in 201517-26 August 2015\nKopanito is on Steam thanks to the Steam Greenlight process and votes by the community. The 9 voting days were very stressful for us (as probably for most indie devs). You can still see the original Kopanito's Greenlight page and how the game looked like in 2015:\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=499023836⚽️ Early Access17 September 2015 - v0.2\nKopanito has been released initially on Windows and OS X (Linux support came later).\nAt start there were 104 national teams in the game, 7 stadiums, 4 super-moves, practice mode, friendly matches, 7 tournaments and local multi-player. The graphics were a little simpler. There was no higher AI levels, only the beginner AI.⚽️ Pixel Heaven and Poznań Game Arena 2015September & October 2015\nThese are two gaming events organized in Poland. Pixel Heaven takes place in Warsaw and PGA takes place in Poznań (our home town).\nIt was great time and first occasion to observe how a greater audience react to the game. There were guys playing, kids playing and even girls playing the game and had great fun!\nKopanito got 5 awards during these events: Best Gameplay, Big Bang!, Retro Roots, Revelation and Grand Prix. The last one awarded by the audience votes, the rest awarded by the jury.\n► Pixel Heaven 2015: preparations, first day, second day, awards\n► Poznań Game Arena 2015: preparations, first day, second day, tournament, third day, award⚽️ Difficulty levels, more tournaments and teams25 November 2015 - v0.3\nPreviously only the beginner AI was available, but now there are 3 more, giving a total of four of them: beginner, amateur, professional and legend (the last one must be unlocked).\nThis was first time when the game was available on Linux and Steam OS.\nKopanito got translated back then to several languages, but later we've decided to remove translations until game's features will 'settle'. Localization support will return soon.\nOther stuff added:\n► 9 more competitions to complete: Pacific League, Microstates Cup, Central American and Caribbean League, Pan Arab League, Commonwealth Cup, Pan American League, Mediterranean League, Continental League and World League,\n► 10 new teams: Angola, Bulgaria, India, Israel, Luxembourg, Morocco, Northern Ireland, Puerto Rico, Republic of Ireland and Thailand.\n► The \"How to play\" guide in the game.⚽️ Leaderboards and match challenges21 December 2015 - v0.4\nThe leaderboards in Kopanito were organized into 4 leagues: Bronze, Silver, Gold and Platinum.\nPlaying matches (alone or in co-op or online) gives you fame points. Completing match challenges (see the image below) will give you even more fame. The more fame you have, the higher you will be in the global ranking. Advancing to a higher league requires to accumulate given amount of fame shown on the leaderboards screen, different for each league. Each league is also limited in capacity.\nMatch challenges are additional objectives that can be completed during a tournament match (against AI). There are 31 different challenges in the game as of v0.9. Some examples:\n\"Do not concede a single goal in a match\"\n\"Score a goal by dribbling past the goal line with the ball\"\n\"Score a goal using the teleport super-move\"\n\"Cancel a super-shot using the ball magnet\"\nand more...⚽️ Steam Trading Cards29 December 2015\nTrading Cards, badges, emoticons and profile backgrounds landed on Steam for You to collect ːkopanitosmileː Each trading card is a fragment of a greater illustration from a match situation. It took several weeks to paint them by our illustrator.⚽️ Achievements and custom tournaments29 January 2016 - v0.5\nThe Trophies screen got added to Kopanito with 225 achievements to complete (later reduced to 224). Most of the achievements are quadruple (bronze, silver, gold and platinum), so for example winning Oceania Cup on the Legend difficulty level gives you 4 achievements (one per difficulty level). There are 70 unique achievements.\nCustom Tournament is a perfect thing for parties with friends. Each friend controls one national team and you organize a cup for them, eg. World Cup, European Cup or Champions League. This is basic, but you can also do more crazy stuff, as there may be more than one human per team.\nCustom Tournament can be started in one of the three formats:\nLeague (round-robin) with 4-16 teams,\nKnock-out stage only with 4, 8 or 16 teams,\nGroup stage with knock-out stage with 12-32 teams. You can specify number of human and AI teams participating and decide how well AI will play. Progress of the competition will be saved, so you can also make longer session or more parties!⚽️ Freeze super-move, replays and GIF generator1 April 2016 - v0.6\nThe new (back then) Freeze super-move allows you to embed nearby players in an ice-block (except goalkeepers). Note that you may also freeze your teammates too. Frozen players wont participate in the game for some time. You can slide tackle a frozen teammate to defrost him faster.\nThe ball can also be frozen or, actually stopped, even in mid-air. It's a good method to cancel opponent's shots, including super-shot. Try it for yourself :)\nAlso action replays got added, activated automatically after goals. It's a side-product of online multi-player which was then in development. Up to last 8 seconds are recorded and can be replayed back.\nAn action replay also can be processed into a GIF animation. This feature was inspired by the first GIF animation uploaded by one of the community members. Greater collection of player-generated GIFs can be seen on the Artworks section of the Community Hub.⚽️ Headers, bicycle kicks and manual passes introduced10 June 2016 - v0.7\nThis update introduced important gameplay improvements. We've added headers and bicycle kicks to the game and modified the ground passes to work similarly to lob passes.\nThe game got more challenging too by adding manual passes (previously these were assisted). Manual passes require more precision, but also introduced more diversity in pitch situations. Kopanito got even more skill-based. The more you play, the better you are.⚽️ Online multi-player introduced17 August 2016 - v0.8\nThe big day has come. It took us a few long months to implement the online modes on an already working game (which is harder to do than doing in it from the start).\nYou can play with other players around the world in quick match modes: Duel (1 vs 1), Doubles (2 vs 2), Chaos (3 vs 3), Complete (5 vs 5).\nThe Create Party mode allows to customize an online match by choosing teams, stadium, decide of the match duration and invite friends to play against.\nNeat feature is that local friends can participate in online modes too.⚽️ Indoor stadium1 September 2016\nThe new Indoor Stadium has walls around. It means that there are no throw-ins, corner kicks and goal kicks during a match, the game is faster this way. A tournament taking place in this stadium is present in the game too.\nAdding this stadium to the game is a direct result of the poll organized in the game's Community Hub on Steam. Thanks everyone for voting!⚽️ Halloween teams, improved corners, automatic passes28 October 2016 - v0.9\n4 new teams have been added to the game related to Halloween: Vampires, Zombies, Werewolves and Pumpkins.\nCorner kicks now allow for more options. You can make a ground pass, a lob pass or a precise shot at the goal.\nThe automatic (assisted) passes are back in this update but along with the manual passes. Two passing systems give best result and improves depth of the game.⚽️ Summary\n2 years of development in numbers:\n10 000+ hours of work\n5 400+ code commits\n100+ fixed issues reported by you\n20 updates on Steam\n800 000 000+ fame points achieved by youThe people involved in the development of the game:\nAdam Śledzikowski - CEO\nMaciej Fedorów - Public Relations\nTed Wennerström - Music & Sound Effects\nPaweł Stepanow - Graphics\nPaweł Dzierzbicki - Development\nTomasz Grajewski - DevelopmentWe would like to thank all the community here on Steam for testing Kopanito and reporting issues, so we could make fixes and improvements to the game over the past year.\nThank You very much!\nPractice makes perfect.\nAbout the Game\"This is the product of what would happen if the fast-paced and thunderbolt world of Super Mario Strikers met the charming and intense world of Sensible Soccer. Sprinkle some unforgettable scenes from Shaolin Soccer and you have Kopanito All-Stars Soccer.\"⚽️ Skill-based gameplayWhat does skill-based mean? It means, that you need to learn the game's mechanic over time (like in real life football). You need to work out your precision and reflexes to be a better player. Luck means little in Kopanito. The better player just wins and there aren't footballer stats that can help you. You are the stats. Super-moves also are skill-based, the better you play, the more of them you gain during a match. Some super-moves can neutralize opponent's super-moves.\nIt may not look serious, but we guarantee, that it is. Kopanito's match engine is well-balanced. Use slide tackle to intercept passes or knock-down opponents (or even score a goal!). Pass the ball straight to your teammates (ground or air) or pass the ball between opponents. Score goals using chip shots or by swerving the ball using slow-motion shots. There are various set pieces, like corner kicks or throw-ins too, but no rules apart from that! Don’t forget, it is a fast-paced game - it might be funny and cartoonish, but it’s not that easy. Try it yourself!⚽️ Crush your opponent with a super-moveIf you play well-enough, you will be awarded with a super-move. Then you can pull the ball using a super-strong magnet (because why not) or teleport into a different spot on the field, activate a big windmaker to blow things out of your goal-line, perform a super-shot that knockout opponents down on the path of the ball and freeze your opponents with the freeze super-move.⚽️ Try it with your friendsThere is support for up to 5 controllers (4 gamepads + keyboard). Try the game with your buddies in a friendly match in various game modes – in any desired combination including 5 vs AI game or play in cooperation through a tournament. You can create own tournaments (league, knockout or league + knockout). You decide about stadium, ball and number of teams. You are the Boss here!⚽️ Online multi-playerYou can play with other players around the world in quick match modes: Duel (1 vs 1), Doubles (2 vs 2), Chaos (3 vs 3), Complete (5 vs 5). The Create Party mode allows to customize an online match by choosing teams, stadium, decide of the match duration and invite friends to play against. Neat feature is that local friends can participate in online modes too.⚽️ AI won’t let you restFour different difficulty levels. The easiest one is a child's play, while the last one... you'll pull your hair out trying to beat the game. Also, there’s a practice mode if you just want to learn basic moves.⚽️ Many competitions and teamsComplete 17 tournaments and leagues in different parts of the world with regional national teams. A tournament consist of a group stage and knockout stage. In a league we apply a round-robin system. Depending on the type of event, there can be 12, 16, 24 or more teams competing. You can choose from 100+ national teams (even the most exotic ones) from all over the world and play on 7 stadiums.⚽️ Goal replays and GIF generatorYour awesome goals and incredible actions can be converted to an animated GIF and shared with your friends on a different the social media channels. See the collection of GIFs created by the community.⚽️ Bringing back memoriesClear inspirations for the game were classics such as Nintendo World Cup (graphics, crazy super-moves), Sensible Soccer and Kick Off (skill-based gameplay). We've spent countless hours on these games 20 years ago So why not to make something similar today? Having a choice is a good thing.\n⚽️ Kopanito on IndieDB ● Facebook ● Twitter ● YouTube ● Official Site","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Merixgames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10792,"name":"DRAGON QUEST HEROES II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1a0/1a0c129bd23f66c74418f1a82e5f5fc3.jpg","description":"Limited Edition\nDRAGON QUEST HEROES™ II Explorer's Edition provides a huge arsenal of bonus items!\nPurchase the Explorer's Edition for a limited time only for the ultimate start to your adventure!\n\n18 bonus items in total:\nDragon Quest I Hero costume\nSlime Knight's Shield\nGreat Sabreclaws\nRobo-Bow\nSlime Stack Stick\nImp's Fork\nPlat o' One Tails\nGolem Gauntlets\nDrackerang\nGoodybag Abacus\nShadowblade\nGem Slime Sword\nNight Club\nRobo-Razor\nRoyal Flush\nArchdemon Arcs\nBuilder's Mallet\nAurora & Luceus costumes from Dragon Quest Heroes\nReviews & Accolades4/5 \"A real joy. \" – Trusted Reviews\n78/100 \"Dragon Quest Heroes 2 looks amazing!\" – PCGames_de\n8/10 \"A must-have for all the fans of the series\" – Gamernetwork\n8/10 \"Among the best of its genre.\" – Multiplayer_it\n8/10 \"Excellent exponent of the musou genre.\" – HDBlog_it\n8.5/10 \"Entertaining and rewarding \" – Gamesoul_it\n85/100 \"A great follow-up of the best current musou game.\" – 3Djuegos\n86/100 \"A sequel full of action, RPG and adventures.\" – Vandal\n85/100 \"High quality, fun and amusing.\" – LaPS4\n8/10 \"Très bon\" – Gameblog\n90/100 \"Simply fantastic\" – Jeuxvideo-live\n8/10 \"A success\" – Actugaming\nAbout the Game\nDRAGON QUEST HEROES II is a hack-and-slash, field-roaming Action RPG that sends players on a new adventure to restore order to a once peaceful world filled with hordes of monsters and battles of epic proportions. Up to 4 players can band together in cooperative multiplayer to conquer swarms of enemies and defeat challenging boss monsters. There is also a cast of many playable characters each with unique moves and abilities – including a host of familiar faces from the DRAGON QUEST® series and four brand new heroes that must team up to defeat an unknown threat looming over the Seven Realms!\nFeatures\nOnline Multiplayer – Up to 4 players can play online\nTransform into a monster and battle as one of them\nNew world, new story & new adventures\nNumerous unique characters each with unique abilities\nChange your vocation and play in any fighting style with a variety of magic & weapons!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Omega Force","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":9866,"name":"Atom Universe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e8/5e88aea6a96754c6467234f6b1ae1c15.jpg","description":"Atom Universe is a Free-to-Play social Virtual World: a theme park featuring fun people and fun things: plenty of games, rides and amusements, as well as advanced social interactions.\nAtom Universe is the best place to hang out: Everything you’ve ever loved about Fun Parks is here for you! From Carnival games like Coin Pushers, Shooting Galleries, Whack-a-Mole and Skeeball to big ones like Bowling, Mini Golf and Batting Cages, to the REALLY big ones - Ghost Trains, Rollercoasters and Karting.\nAnd the BEST thing about Atom Universe is that you can do all of these things in the fine company of other people - bring friends along or come and meet lots of new ones!\nAtom Universe is first and foremost a hub for people to meet, chat and socialise. It’s essentially like a chatroom, but with loads of fun to have alongside. All of our games involve some sort of element of multiplayer, some competitive and some co-operative, so you will always find people to get involved with!\nConstantly evolving and growing, offering more things to explore all the time, Atom Universe is the funnest place not on Earth!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Atom Republic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9809,"name":"Caves of Qud","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6e/e6e4a23d51a5fe13c8bb155371516436.jpg","description":"Caves of Qud is a science fantasy roguelike epic steeped in retrofuturism, deep simulation, and swathes of sentient plants. Come inhabit an exotic world and chisel through layers of thousand-year-old civilizations. Decide: is it a dying earth, or is it on the verge of rebirth?Who are you?Play the role of a mutant indigenous to the salt-spangled dunes and jungles of Qud, or play a pure-strain descendant from one of the few remaining eco-domes—the toxic arboreta of Ekuemekiyye, the Holy City; the ice-sheathed arcology of Ibul; or the crustal mortars of Yawningmoon.\nYou arrive at the oasis-hamlet of Joppa, along the far rim of Moghra'yi, the Great Salt Desert. All around you, moisture farmers tend to groves of viridian watervine. There are huts wrought from rock salt and brinestalk. On the horizon, Qud's jungles strangle chrome steeples and rusted archways to the earth. Further and beyond, the fabled Spindle rises above the fray and pierces the cloud-ribboned sky.\nYou clutch your rifle, or your vibroblade, or your tattered scroll, or your poisonous stinger, or your hypnotized goat. You approach a watervine farmer—he lifts the brim of his straw hat and says, \"Live and drink, friend.\"What can you do?Anything and everything. Caves of Qud is a deeply simulated, biologically diverse, richly cultured world.\nAssemble your character from over 70 mutations and defects and 24 castes and kits—outfit yourself with wings, two heads, quills, four arms, flaming hands, or the power to clone yourself—it's all the character diversity you could want.\nExplore procedurally-generated regions with some familiar locations—each world is nearly 1 million maps large.Dig through everything—don't like the wall blocking your way? Dig through it with a pickaxe, or eat through it with your corrosive gas mutation, or melt it to lava. Yes, every wall has a melting point.\nHack the limbs off monsters—every monster and NPC is as fully simulated as the player. That means they have levels, skills, equipment, faction allegiances, and body parts. So if you have a mutation that lets you, say, psionically dominate a spider, you can traipse through the world as a spider, laying webs and eating things.\nPursue allegiances with over 60 factions—apes, crabs, robots, and highly entropic beings—just to name a few.\nFollow the plot to Barathrum the Old, a sentient cave bear who leads a sect of tinkers intent on restoring technological splendor to Qud.\nLearn the lore—there's a story in every nook, from legendary items with storied pasts to in-game history books written by plant historians.\nDie—Caves of Qud is brutally difficult and deaths are permanent. Don't worry, though—you can always roll a new character.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Freehold Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5607,"name":"NBA 2K12","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a89/a89fae8a07c23b511a7fba1c4a3a0485.jpg","description":"The NBA 2K franchise is back and bigger than ever, allowing fans to finally END THE DEBATE as to who are the best teams and players of all time.  Featuring such NBA legends as Michael Jordan, Magic Johnson and Larry Bird as well as all of your favorite NBA players of today, NBA 2K12 is packed with new features that will put fans center court of an unprecedented basketball experience.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"2K","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":3357,"name":"Toukiden: Kiwami","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84f/84fe73fa5ab5b72a066d9e0d5530c3a5.jpg","description":"\"Toukiden: Kiwami\" is a hunting action game where players take on the role of a Slayer possessing unique abilities, and battle the Oni to save mankind from destruction.\nTo defeat these huge Oni, players band together to sever, pierce, and crush parts of the Oni using the Targeted Destruction System!\nMultiplayer for up to 4 players is supported.\nSever! Pierce! Crush!  -Targeted Destruction System-\nSome of the Oni players will encounter are many times the size of a human. Defeating these require more than simply attacking. Players must sever a part from the Oni's body, pierce it, and then crush it in order to destroy it. The appropriate use of blade or bow, and cooperation between friendly Slayers is the only way to successfully defeat an Oni!\nSpirits of Heroes of Japan's Past (Mitama)\nWhen Oni are beaten, they release captured spirits called Mitama. These Mitama can take residence in weapons and aid the Slayer unlock certain special powers for use against the Oni. There are a wide variety of powers and players can enjoy creating their own original equipment. Also, each of these 300 Mitama from across time come with a special illustration and voice, making them fun to collect.\nAn Original World painted in Japanese history\nThe story is set in a world set apart in time and space by the power of the Oni. The player starts as a rookie Slayer in a Slayer village called Utakata and fights the Oni in areas that display characteristics of time periods ranging from ancient days to the early Shogunate.\nFriends and Allies\nThere to show this new rookie around are the veterans Slayers of the Utakata village. These warriors, including Ouka, a swordswoman with no equal in the organization, will guide and train the player as together they battle the Oni and save the human race.\n* The images are from an in-development build and may differ from the final version.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":2407,"name":"Rogue Galaxy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b2d/b2d4a421e855e27ffd63a454dfd47e2c.jpg","description":"Set Sail on a Space Pirate Adventure.\nJaster dreams of exploring the galaxy. In a sudden turn of fate, he is recruited into a band of space pirates and takes flight on an adventure of a lifetime. Set off to discover new worlds on a quest to find a legendary planet that holds the key to the greatest treasures in the galaxy.\n• Explore what you see with no load times\n• More than 100 hours of gameplay\n• Choose from 8 different space pirates\n• Unique real-time combat.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Level 5","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":892898,"name":"Remnant 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/347/3478db948d4f25d40da7c22c0fd1039c.jpg","description":"Remnant II pits survivors of humanity against new deadly creatures and god-like bosses across terrifying worlds. Play solo or co-op with two other friends to explore the depths of the unknown to stop an evil from destroying reality itself.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Gunfire Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":493434,"name":"Lust from Beyond: Scarlet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3d3/3d37e29bbf87a5f140e27e6000e5cdbe.jpg","description":"PLAY NOW OTHER FREE GAME FROM THE UNIVERSE!https://store.steampowered.com/app/1170820\nTHE STORY WILL CONTINUE IN THE LUST FROM BEYOND (COMING SOON)https://store.steampowered.com/app/1035120/Lust_from_Beyond/\nFIND OUT HOW IT BEGAN...https://store.steampowered.com/app/523650/Lust_for_Darkness/\nAbout the Game\n\"Lust from Beyond: Scarlet\" is a stand-alone, free introduction to the full version of \"Lust from Beyond\" - a horror game with elements of eroticism and occultism. This is not a demo version - you won't experience any spoilers here. The presented story is unique to this title. \"LFB: Scarlet\" is the second introduction to the Lust from Beyond. The goal of this title is to present topics and mechanics not mentioned in \"LFB: Prologue\". This time we will focus more on survival, gore and sexual elements. Moreover, we will present a new faction - Scarlet Lodge.\nAlan's mind is possessed by a hardly satisfiable sexual drive. To control his emotions, Alan meets with a psychiatrist who is supposed to solve his problems. During the session, Alan talks about a strange date in an abandoned theatre. The story quickly turns into an experience filled with dread and dark desires...\n- Bold erotic motives adapted to the horror convention\n- Interactive sex\n- Running from your opponents and fighting mechanics\n- A world inspired by the works of Lovecraft, Giger and Beksinski\n- Exploration of graphically advanced environment full of interactive objects\n- Ingenious puzzles\n- Vibrant sound and music","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Movie Games Lunarium","platforms":[{"id":0,"name":"PC"}]},{"id":428077,"name":"Ultimate Zombie Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ade/ade344e264a91fabd91ee97d3e8e6f62.jpg","description":"Ultimate Zombie Defense is a Top-down Co-op Survival Horror set in the suburbs of a once quiet city, in the heart of continental Europe. The city and the surrounding 250km landmass have been sealed off in an attempt to curtail the outbreak, although sadly all attempts have failed, until now.\nYou and your friends are elite members of the military dropped into this plagued location and have only one mission: Locate and destroy the source of the infection.\nWell, what are you waiting for? Get to it, Soldier!\nFEATURING:\nAn extensive base building system where you may place objects such as chain link fences, sandbags, barbed wire, concrete barriers, turrets, mines, fog lights and other military-grade components!\nApocalypse proof weapon selection from the classic pump shotgun to the flamethrower, grenade launcher, mini-gun and many, many more!\nEpic Slow-mo that will trigger during your most impressive moments\nUnique Boss fights to challenge even the most seasoned zombie slayers\nA variety of infected including more than 12 Unique monster types\nMetal music mayhem - Rock out whilst laying waste to hordes of the undead!\nChoose between 8 unique characters to battle the army of the dead\nSolo game mode for offline play\nCOMING SOON:\nCooperative gameplay for up to four players\nLeaderboards that track worldwide statistics\nFull controller support\nUnlockable achievements\nFull day & night cycle - Make sure you have a well-lit base before nightfall!\nFight in the rain, sleet & snow with a fully dynamic weather system","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Terror Dog Studio","platforms":[{"id":0,"name":"PC"}]},{"id":60769,"name":"Football Manager 2019","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e2/2e2d9ffd0c533abffd3b94dbbd64fd4c.jpg","description":"Pre-Purchase Offer\nAbout the GameIn Football Manager 2019 YOU are the author of your club’s success: you define the tactics and style of play, and drive player recruitment to build the ultimate squad. You take an active role on the training ground, developing your squad and fine-tuning the preparations for upcoming matches.\nThen, when Match Day arrives, you take your place on the touchline, overseeing proceedings as your players cross that magical white line. Now, your footballing vision is put to the test!\nWill the perfect substitution or tactical tweak be the difference between an agonising defeat or an ecstatic victory?\nTest your skills in 50 of the biggest footballing countries\nClimb to the top of the table and beyond with any one of world’s top 2500 clubs\nPlay the transfer market and scout more than 500,000 real players and staff\nWatch your unique football vision play-out on our acclaimed 3D engine\nThe Bundesliga and Bundesliga 2 are fully licensed and playable for season 2018/19 and give a very early flavour of what’s to come as we build towards kick-off on November 2nd.\nIn total, there are 26 fully-licensed league competitions from 11 countries as well as a host of individual club licences from some of the world’s biggest leagues, with more still to be confirmed.\nLicensing updates along with new features and game upgrades will drop towards the end of September on our social channels, so get following now to get ahead of the game.\nFootball Manager 2019 is available to pre-purchase now and managers who do so prior to full release on November 2nd will net a cool 10% off.\nAdvanced pre-purchase will also permit early access to a fully-playable Beta version of the game which should be available at least two weeks prior to the official release date. Single player careers started in this Beta version will also continue into the full game.All purchases of Football Manager 2019 also include a free copy of Football Manager 2019 Touch for PC/Mac only.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sports Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":29066,"name":"Rockstar Table Tennis","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba8/ba87f6d2d240b339fc2c549ac13669ee.jpg","description":"(Online Interactions Not Rated by the ESRB) The Games on Demand version supports English, French, Italian, German, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Rockstar Games presents Table Tennis is the debut next-generation title from the creators of the Grand Theft Auto and Midnight Club franchises. Developed by Rockstar San Diego, Table Tennis harnesses the incredible power of Xbox 360™ through an advanced game engine designed specifically for next-gen console technology. Utilizing the full capabilities of the hardware, Table Tennis is visually stunning, the physics are fluid and natural, and, when coupled with the intuitive gameplay, the competition and ferocity found in a live table tennis match are authentically recreated. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Rockstar San Diego","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":23400,"name":"Medieval Kingdom Wars","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77c/77c48320953913ecdacfd8aacf28084d.jpg","description":"Medieval Kingdom Wars brings a fresh perspective to the grand strategy genre, combining it with a full-on real time approach, and daring to go where few strategy games have ventured before…Redefining Medieval Grand Strategy, by combining historical accuracy, a huge living and changing world, and historical quests, all in a real-time environment. Build your cities, wage your wars, serve your king, and experience siege combat with a degree of brutality never seen before\nInnovative Real-Time Strategy with solo/co-op multiplayer mode, and soon to be added single player grand campaign\nThe bloody siege combat of the period, with numerous survival elements and brutal historical realism. Includes looting corpses and hunting rats to feed your starving garrison\nRealistic, medieval siege combat with intricate stronghold construction, and over 30 siege weapons and units\nFeaturing the most detailed and beautiful maps seen in this genre. The world map covers all of Western Europe\nBeautiful and Dynamic World Map\nIncredible Historical Accuracy\nComplex Economic Survival Model\nControl Enormous Cities\nWeather and Seasons Change\nPowerful World Editor &Workshop\nAnd so much more awaits you...","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Reverie World Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18816,"name":"You Have 10 Seconds","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/433/433af818153836e5e8871190fb841f30.jpg","description":"You Have 10 Seconds is a fast paced arcade style platformer game with over 40 levels.\nIn the game every single level is on a 10 second timer, so you have 10 seconds to get from the start of the level to the end without dying and before time runs out.\n- Unlock new areas and collect new items to affect game play after each world.\n- The game runs at 60fps for precise platforming\n- Levels are quick but hard to master\n- Gamepad/Controller support\n- Four unique level soundtracks for each area of the game\n- In game Achievments\n- Free to play\nDownload the soundtrack!\nhttps://tamationgames.itch.io/you-have-10-seconds-official-soundtrack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":17886,"name":"Windforge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f14/f141d66c004019980b827df732ec0911.jpg","description":"WindForge is a side-scrolling block-building game where you explore hostile skies in an ever-changing Steampunk world. Everything you see can be created or destroyed, creating an RPG without barriers that rewards creative problem solving and improvisation. Take off in fully customizable airships, and embark on a journey of discovery and survival that will take you to the heart of the world and beyond.\nFeaturesEpic story line and quests that drive gameplay without constricting freedom\nThe first game to include minable sky whales, and meat blocks\nLarge completely destructible procedural world with multiple environments\nContra-style action mixed with the creative fun of Terraria\nBuild and fly fully-functional airships\nOver 1200 craftable items and counting\nEasy-to-control, skill-based combat with 360-degree aiming\nStorylineThe modern way of life on Cordeus is reliant on refined Sky Whale oil. Everything from the machines used daily, to the food that is eaten, is ultimately dependent on the oil. The citizens of Cordeus are so hungry for oil that the once abundant population of Sky Whales is dwindling. At current rate, the noble species will face certain extinction in a few short years. To avoid falling back into the dark ages, civilization must find a new source of energy. It is said that an ancient people named the Aetherkin had exotic sources of energy. Energy more powerful than anything any human has ever seen. Unfortunately, research related to the Aetherkin is strictly forbidden by law. In an attempt to save humanity’s way of life, YOU have been secretly hired to uncover this ancient energy source.\nHighlights\nFreedom & Creativity\nExplore, create and destroy anything!\nA Dynamic Procedural World\nSteampunk Airships\nConnect With Snowed InJoin the community! Check out the Windforge Forum!\nOfficial Website | Facebook | Twitter | YouTube | Tumblr | Instagram\nJoin the Windforge Steam Community group. We also have T-Shirts and Prints for sale!\nWe would love to hear your feedback!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Snowed In Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17259,"name":"Trick & Treat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35b/35b6f84dc5d7aae76057c12ddc7b6b51.jpg","description":"NOTICE:\nPlease run the game in your Library, or the achievements may not be unlockedヽ(；▽；)ノ\nAnd please don't press F12 to take a screenshot. It will bring the game back to tile.\nA young witch named Charlotte and her maid Amelia went trick or treating on the Halloween Eve, and somehow they decided to visit a cursed mansion.\nBefore Amelia could figure out anything, she was on her own in this huge, ominous house. Dance with the ghosts, play with the dolls, and hopefully, she can uncover the dark past of the house and see Miss Charlotte again.\nYou'll play as Amelia the Pumpkin Maid. It's about exploring and solving puzzles in a spooky atmosphere. There will be some horror elements, romance, many deaths (bad ends) and a happy ending of true love.\n- Warning -\nIt contains blood, death, jumpscares, and ghost/monsters.\nA light-hearted Halloween adventure. The puzzles are not hard, either.About 90 minutes gameplay.Original spirites and CGs.Multiple ends and 9 dead ends.A hidden room (Extra) will be available after the Normal or True end.A new outfit for Amelia will be available for the second run :DSteam Achievements\nOriginal music in the trailer: \"Halloween\" by Zephysonas\nSpecial Thanks: SophiaSW, Duelist","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rabbiton","platforms":[{"id":0,"name":"PC"}]},{"id":17143,"name":"Crystal Caves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/136/136a0cb25d00eee183c79c0fc20727b3_rVGY8mz.jpg","description":"The game begins with Mylo rocketing to the Altairian star system on a simple treasure hunt. But what happens is far more dangerous than even Mylo bargained for. He enters an underground world of chambers full of alien technology and traps. Strange alien creatures and robots inhabit the caves, protecting the priceless crystals from money-greedy explorers.\nThere are three unique episodes to the Crystal Caves saga: \"The Trouble with Twibbles\", \"Slugging it Out\", and \"Mylo Verses the Supernova\". Each episode has a unique story twist and graphics. Can you help Mylo strike it rich and quit his day job?Features\nAlien Acrobat: Mylo can walk up-side-down - some levels have such low gravity that the recoil from Mylo's laser pistol can knock him into other dangers!\nBrave New World: Lightless levels, falling hammers, egg-dropping alien bats, free-roaming slither eyes, web-shooting alien spiders, and much, much more!\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"3D Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9535,"name":"Quern - Undying Thoughts","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f5/7f5cc3e4281a25a255a880101c23517c.jpg","description":"You try to clear your vision and get on your feet after your arrival. You hear the portal closing behind you as you take a step forward. You are trapped, your way back is gone.\nQuern - Undying Thoughts is a first-person puzzle adventure game, inviting you on a journey to explore it and solve its challenges. Put your mind to the test with the increasingly complex puzzles, and unravel the mysteries of the island.\nImmerse yourself in the beautiful scenery of the island as you discover new places. Follow the hints of the past as you delve deeper into the story to understand the importance of your presence.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Zadbox Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":22463,"name":"Fortune Summoners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a43/a43ed1ada8de49a27aefd028e1d06441.jpg","description":"Elemental Stones: stones imbued with the power of an Elemental Spirit, which grant the wielder of one the ability to control that element via 'magic'.\nIn the country of Scotsholm, three centuries have passed since they were first created. Elemental stones are now mass-produced and widely used, making magic a personal, commonplace part of people's lives.\nIn this time and place lives a girl named Arche Plumfield. Arche, having moved with her family to a new home in the town of Tonkiness, has begun attending the only school in the area... the Minasa-Ratis School of Magic, founded by one of the greatest arch-magi in Scotsholm's history.\nBut Arche, not realizing that one needs an Elemental Stone to use modern magic, begins a little adventure to find one for herself, to avoid burdening her parents with the expense.\nHer adventure will lead her to places she never imagined...\n\nKey Features:\t\t\t\t\t\tA massive gameworld to explore - nearly a dozen dungeons to delve into, and easily 25+ hours of gameplay, with lots of extra content to explore!\nGorgeous, detailed 2D sprite backgrounds and animations - like the best 16-bit game you never got to play!\nClassic platformer-RPG action in the vein of some of the true greats of yesteryear!\nConquer the challenges before you with intelligent AI companions - you can let them do as they want or customize their behavior to your heart's delight!\nStunning, professional-quality music and sound!\nFull support for Xinput controllers, including the XBox 360 controller, as well as keyboards!\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Lizsoft","platforms":[{"id":0,"name":"PC"}]},{"id":20089,"name":"HIT","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52b/52b77ecb1d9b8b15e88d525085093320.jpg","description":"This is the first project by EP4.As a newcomer to the gaming industry, I present you with the game I made to kill time while you waiting anything or anyone.\nThe game was created as a car simulator. In subsequent updates, new cars will also be added to the map and the open world, physics will get  a new character similar to real life, optimization will also be made in updates.\nThe gameplay begins with a garage from which you need to leave and move in search of entry into the mountainous area, having overcome the mountainous area, namely, having made a circle through the mountainous area, you need to return. In the next update, after completing the mission, you will have access to a map that leads to another town.\nAll controls, buttons are listed below\nPurchasing  this product, you receive weekly gameplay updates as well as many interesting missions and tasks (will be added after the first update)\nHaving bought this product, you will watch how the game will reach new heights and also add all the wishes of buyers\nDo not judge strictly if there are any ideas write to the contact address\nUP,LEFT ARROW,RIGHT ARROW,DOWN -Classic controls,\nEnjoy playing and spending time\nAll errors,updates and others will be in next 4 months.\nHave a nice time in HandleIT","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NEXON Company","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":17592,"name":"Guncraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad8/ad8ac55e358121eadb0de7192f25cb38.jpg","description":"Block and Load!  Combining the addictive nature of block building sandbox games with the speed and competition of modern first-person shooters, Guncraft takes voxel-based gaming to a whole new level.  Players can create maps and arenas based on anything imaginable and, once complete, can utterly destroy them with bullets, bombs, grenades, tanks, helicopters, gunships, and much more.  In the heat of battle, soldiers can create custom blockades and fortresses instantaneously.  Watch out – just when you think you’re safe, enemies can tunnel through walls and dig through floors to ambush you from behind, above or below!\nIn addition to standard modes like Deathmatch, Team Deathmatch, and Capture the Flag, Guncraft offers over seven outlandish game modes like Lava Survival and Racing Mode, plus 100% customizable load-outs that include perks, weapons, vehicles and more.  Even better, the core crafting mechanics of Guncraft are available throughout every aspect of the game, enabling players to build maps, prefabs, characters, and weapons on the fly, then decimate them all to take down enemies.\nKEY FEATURES:\nVoxel design coupled with hardcore FPS elements: Player-controlled vehicles, perks, killstreaks, class load-outs, clan system, and ranks.Create custom levels, weapons, and characters – you are literally only limited by your imagination!7+ outlandish game modes for up to 16 players (Online/LAN), including:  “Lava Survival” – Magma slowly rises as players build upward to avoid the instant orange death. It’s a new variation of “Last Man Standing”.  “Onslaught” – Four players band together to fight off endless waves of deadly robot spiders, soldiers, drones, and aircrafts. “Spleef” – Players drill and destroy blocks on the platform near or under their opponents in order to cause them to fall to their deaths, while fervently avoiding suffering the same fate.  “Siege Mode” – A building and prefab centric game mode where two teams are pitted in a race to build a trebuchet-style catapult first. Be sure to defend it, else you get your structure destroyed by the other team. \"Racing Mode\" – Race to the finish and blow up everyone in front of and behind you in the process! You can even team up with a friend for some double dash style action in the fast paced new game mode!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Exato Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":17580,"name":"Redshirt","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b1/9b18cc0cea3d5cad0ed2988255e80822.jpg","description":"Redshirt is the comedy sci-fi sim about social networking aboard a space station, starring the station's most ambitious low-ranking peon: you! Navigate the professional and interpersonal politics of the ubiquitous \"Spacebook\" to curry favor among friends and colleagues. As intense intergalactic conflict rages around you, it's up to you to accrue those all-important \"likes\" on your status updates! Whether you're looking for love, opportunities for promotion, or even a chance to play Zero-G golf with the captain, you can schmooze your way through social circles and claw your way up the career ladder. Perhaps you too can finally achieve the dream of an off-station transfer, or even the Redshirt's opportunity of a lifetime: being sent on an away-mission!\n\"Redshirt’s take on science fiction clichés is amusing, telling short stories in the form of status updates and messages, but the activity of playing the game is rather intense, even though it’s a turn-based life management sim. As if accidentally snubbing friends and causing heartbreak wasn’t enough, a short while into your misadventure, a disturbing message arrives. A calamity is coming. The station is doomed. People will die.\" - Rock Paper Shotgun\n\"Spying on an ex in a video game even though there’s no tangible benefit to doing so WHATS GOING ON\" - Red Door Blue Key\nRedshirt received an Honorable Mention in the 2014 IGF Awards for Excellence in Narrative!\nSocial Networking, But Not As We Know It...\nRedshirt is a comedy sci-fi social networking simulation game. Create & customise your character, a brand new arrival aboard space station Megalodon-9, where you start your career on the lowest possible rung: a Transporter Accident Cleanup Technician. You also realise that everyone on the station is required to use the proprietary social network, \"Spacebook\"!\nYou hear rumours something terrible will happen soon aboard the station, and it's up to you to stop being a disposable nobody before it's too late! You can do this by interacting (through Spacebook!) with randomly-generated, AI-driven characters with their own unique personalities, trying to win friends and influence station citizens. Or, you can focus on what skills you need to climb the fairly-extensive career tree. Or, save up your KarmaCreds. Or, flirt your way up the station. The choice is yours, and there are different strategies. You just have a limited time in which to do it, otherwise... terrible things will happen. You are a Redshirt, after all!FeaturesSatirical, tongue-in-cheek social simulation, filled with humour and political intrigue.\nDetailed character creation: choose from 5 different species, from human to tentacled squid creature!\nEach game is unique: Megalodon-9 is full of procedurally generated AI-driven characters, each with their own random personalities and profile pictures.\nCustomise station settings: define the kinds of personalities you'll encounter, from friendly chatterboxes to self-obsessed bigots.\nUpdate your Spacebook, strategically 'like' statuses, and send private messages to your fellow station citizens.\nArrange Spacebook 'events' with your friends, frenemies, and even higher-ranking officers, to influence your relationships and skills.\nMultiple routes to success through turn-based gameplay, from skills-based diligence, to romance, to charismatic schmoozing.\nNavigate an extensive, non-linear career tree, by gaining the right skills... or just by making the right friends.\nMake friends and manage romantic relationships -- if you can handle the drama!\nStrategically manage your interests and skills.\nBuy items in the Self-Help Object Purveyor (S.H.O.P.) to increase your stats and skills, from RoboCats to illegal hoverbikes!\nAway missions!\nHumorous parody of social networking culture.\nPuns! So many puns. More Reviews & ArticlesIndieHaven (8/10): http://indiehaven.com/redshirt-review-2/\nDads Gaming Addiction (8/10): http://www.dadsgamingaddiction.com/redshirt/\nSoftpedia (8/10): http://www.softpedia.com/reviews/games/pc/Redshirt-Review-400716.shtml\nZOMGPlay (7/10): http://zomgplay.com/2013/11/15/review-redshirt-pc-ios/\nTiger Gaming: http://tiger-gaming.org/redshirt/\nJayisgames.com: http://jayisgames.com/archives/2013/11/redshirt.php\nAnthony Burch (Borderlands 2 Lead Writer): http://www.heyash.com/why-i-like-redshirt\nRed Door Blue Key (4/5): http://www.reddoorbluekey.com/reviews/review-redshirt/\nPaste Magazine  (8/10): http://pastemagazine.com/articles/2013/11/redshirt-review-pc.html\nThe Mary Sue: http://www.themarysue.com/redshirt-game-review/For more reviews (and also information about development of Redshirt), please visit the forums.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Tiniest Shark","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":16767,"name":"Rhino's Rage","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5df/5df6173e9c80e590c289d9fc6e4652cb.jpg","description":"It is a turn-based tactical game, where you can accelerate and bunt enemies.\nThere is a game mode for one player in different modes with own combat mechanics and characters with unique team roles are used in the game: pusher, stopper, tumbleweed and sprinter.You can use abilitiesDress up clothes with different rarity: armor, cloak, hats, boots – this will give different bonuses to your characterPlay on various maps","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Defroids","platforms":[{"id":0,"name":"PC"}]},{"id":15667,"name":"Master of Orion 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e3/8e3fb44c7a31ed7f0222dda4529bd533.jpg","description":"Experience first-hand the challenges of leading one of 16 different races into unequalled galactic supremacy and face a universe of decisions. Set policies, explore, build, declare war, negotiate - put all these elements into motion to guarantee your place in the annals of space and time.\nAre you prepared to become the Master of Orion, and to discover the truth behind the Orion Sector and its inhabitants? Welcome to the world of Master of Orion 3. Your journey begins here.\nDominate the galaxy as any one of 16 unique races\nEspionage, disinformation, subterfuge, betrayal, subversion and assassination - do whatever it takes to achieve victory\nDynamic galaxy generation ensures that no two games are ever the same","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Quicksilver Software","platforms":[{"id":0,"name":"PC"}]},{"id":13838,"name":"BlackShot: Mercenary Warfare FPS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7e/a7ebcb250345608166fce7f47a58c238.jpg","description":"About BlackShotBlackShot is a free-to-play, first-person shooter set in a post-apocalyptic world.\nJoin other mercenaries in brutal team combat, multiple game modes, and experience in-depth customization to create your perfect warrior!Story\nThe old world ended on the fourth of December, 2033.\nIn the preceding decade, advances in human cloning had led to the development of the ultimate weapon; the expendable clone soldier, the Mercenary.\nNations began expanding their borders aggressively, seeking more resources in order to expand their clone armies. The entire world soon became embroiled in global conflict.\nBlackShot is one the world’s elite mercenary groups. You are a newly contracted Mercenary.\nWill you rise through the ranks to become elite?Multiply Game ModesRunning Man Mode (RM)\nTeam Death Match (TDM)\nTeam Flag Match (TFM)\nSearch & Destroy (SD)\nProtect the Commander (PC)\nUnlimited Battle Arena (UBA)\nBunker Defense (BD)Mercenary Level & Rank SystemRise from lowly Recruit all the way up to Commander-in-Chief\nReceive Weapons, Gear, and Tactics at every level!Gear SystemEnhance your mercenary with Gear to make them better, stronger, faster!\nReceive stat bonuses or increase your weapon load.Tactical SlotsAdd depth to your character customization by assigning weapons expertise.\nUnlock more slots as you gain ranks, and create a deadly mercenary!Clan System & Dedicated Clan ServersCreate your own or join an existing clan, customize your emblem, and dominate!\nClan rankings and Clan servers for team matches.WeaponsMassive array of weapons such as AR, BR, Snipers, SMG, Shotguns and many more.\n7 Mastery categories and multiple ranks that unlock unique weaponry!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vertigo Games America","platforms":[{"id":0,"name":"PC"}]},{"id":12441,"name":"Savage Resurrection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/919/919e13139f20999c399f093236be34e2.jpg","description":"The rebirth of the classic action FPS / RTS hybrid \"Savage 1\" is here! Experience fast-paced combat and cunning strategic gameplay in glorious Unreal 4 environments. Engage in epic 16v16 front-line combat, or take Command to outplay and outmaneuver your team's way to victory.\nSavage is a multiplayer-only game with a competitive focus. Combat includes both melee and shooter aspects, and should challenge even seasoned gamers. Servers are currently located in the US and EU, with more planned. Players may also host their own servers, use ours, or play offline!As a member of the fearsome Beasts or crafty Humans, you must fight to:Secure strategic resources and positions\nCraft and expand your team's buildings and structures\nResearch and acquire new weapons and items, to gain the upper hand in combat\nCrush your opponents with mighty siege weapons, sneaky sabotage, or by strangling their economyFeatures:Quick-match\nPractice mode with bots and AI commanders - fully offline or play with your party!\n16v16 Standard matches, with an AI Commander\n16v16 Advanced matches, with a human Commander\nCompetitive matches with locked rosters and no team swap\nCustom matches on official dedicated servers, or hosted locally, or hosted by another player, or fully offline!\nStats and Leaderboards\nCosmetic Items + Steam Drops + Trading Cards\n5 Maps\nPlayer hosted dedicated serversDigital Deluxe Edition\nExclusive bonuses include:\n3 gold weapon skins\n3 cosmetic crate keys\nUnique in-game vanity effect\nSoundtrack\nAccount icon flair\nTaunt, and Taunt Image\nOur continuing development (and server hosting) is funded largely by cosmetic item purchases: there is no persistent power progression system, there are no paid upgrades or boosts. This is a competitive game: there will be no Pay2Win.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"S2 Games","platforms":[{"id":0,"name":"PC"}]},{"id":4495,"name":"Choplifter HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed0/ed0ea126a8d3ff141ab0679f256e1d7a.jpg","description":"In Choplifter HD, players take on the role of an up-and-coming rescue pilot asked to join the elite, international helicopter rescue team.  Pilots will be trained to command a variety of helicopters deployed on 30 different missions.   Pilots must bank, hover, touch-down and sometimes even shake zombies from their chopper during lift-off in order to make their rescue and complete their mission.\nKey Features:\t\t\t\t\t\t\t\t\t\t\tChoplifter HD dares players to risk their lives in order to save others!\nPlayers pilot many different helicopter types inspired by current military models\nVaried and dangerous terrain including urban areas, jungle outposts, arctic bases, and desert compounds with missions taking place at all hours of the day and night.\nCommand a variety of helicopters deployed on more than 30 different missions ranging from captured military prisoner extraction to saving survivors of viral outbreaks\nManeuver, fire, and extract under perilous conditions in order to carry out rescues\nOriginal Choplifter franchise creator Dan Gorlin serving as design consultant\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Desconocido","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":4472,"name":"ModNation Racers: Road Trip","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58f/58f8c72517534e5b4b531e8cdec7c848.jpg","description":"Welcome to the never-ending season of ModNation™ kart racing, where competitive racing and community creativity collide.  Whether you race for the fastest time, customize your own karts or tracks, or you discover new courses online – ModNation™ Racers gives you everything you need for your next \"Road Trip!\" We have put the creation at your fingertips...literally.  Touch the screen and rear touch pad to raise or lower the terrain.  Use common gestures to create or edit your Mod, Kart, or Track.  If that wasn't enough, you will have full access to all creations made on the PS3™.  That's right, download and play with your favorite PS3™ creations on your PlayStation®Network and take it where ever you go.\n©2012 Sony Computer Entertainment America LLC.  ModNation is a trademark of Sony Computer Entertainment America LLC.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item’s use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item.\nOne-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":2682,"name":"SENRAN KAGURA ESTIVAL VERSUS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83c/83c860a54f67dc35f21756421d444786.jpg","description":"The flame that burns twice as bright burns half as long, and so it is with the lives of young shinobi. Death comes swiftly — for the lucky ones — and for those still living, grief is a constant companion. Ryōbi and Ryōna, two shinobi sisters of the Hebijo Clandestine Girls’ Academy elite, know that truth all too well, and they mourn their beloved elder sister every day.\nBut when a mystical phenomenon appears, drawing the shinobi world’s finest young ladies into a parallel dimension, everything they know about life and death turns upside down. Taken to a strange world resembling a warm summer island, the girls find themselves face to face with their departed loved ones.\nThe island’s mysterious mistresses challenge the girls, who hail from four different rival schools, to a contest of strength and wits. The winning school, so they promise, will not only learn the highest secrets of shinobi lore, but will also have the honor of laying their loved ones’ souls to rest.\nThe buxom beauties prepare for a new kind of battle, facing not only their rivals, but questions galore. Can the islands’ hosts be trusted? Will the other schools play fair, team up, or cheat? Will there be time to enjoy the beach before the fighting starts? Will anyone manage to keep their clothes intact? And…if they do win, can they bear to part from their loved ones a second time? ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThe high-flying, high-bouncing ninja girls of SENRAN KAGURA return, this time with more moves, more playable characters, more story and attitude, and more destruction online with matches that can support up to 10 players. All the previous shinobi girls return with a host of upgraded moves to master, and new playable characters offer more challenges to conquer, along with a story that's equal parts sexy and shocking, serious and scandalous, busty and brawling.\nKEY FEATURESA Little More Violent, a Little More Sexy and a Ton More Fun\nThe series’ busty ninja girls take to the beach, flying high in bouncy battles with more outrageous moves than ever before.\nBiggest Roster in Series History\nWith over 25 playable characters, each with her own style, technique and role in the story, there’s a shinobi to fit any taste and preference.\nEnhanced Production Values Bring the Story to Life\nDynamic camera angles, expressive animations and full anime cutscenes deliver a storytelling experience unlike any other in the series.\nAll-New Multiplayer Battle Royales\nUp to 10 players can enter free-for-alls and team battles in a variety of events, from the traditional deathmatch to the less-traditional “Understorm” and “Capture the Bra.”","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"XSEED Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":966216,"name":"Palia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/30a/30a0519b83acc48ac2068705d0cc7b38.jpg","description":"If you're looking to escape the hustle and bustle of life, it's time for you to come home to Palia.\n\nStart your journey in this free-to-play multiplayer cozy sim, set in a breathtaking new world that you can truly make your own. As you start your adventure in the idyllic Kilima Village, you will discover there's more to Palia than just this simple farm life...\n\nUnravel a deep mystery about what happened to ancient humans, as you reappear in the world alongside other players. Befriend the local Majiri, learn their backstories, build friendships or maybe even romance!\n\nGive back to the community by honing your skills in fishing, hunting, farming, crafting, cooking and more!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Singularity 6","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]}]