[{"id":10570,"name":"A-Tech Cybernetic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94b/94be41cd69630e96169ef4a349ef8c3e.jpg","description":"A-Tech Cybernetic is a visibly beautifully elaborated sci-fi game taking place at external and internal venues, whereby players are exposed to such effects and impacts, which are not possible for a human being to experience in real life without any dangers. The enemy consists of robots created by the humans, which are very realistic-looking enemies with an unbelievably detailed finish.\nWhile preparing our game, we put emphasize on that it shouldn’t be “another wave shooter”, but a real challenging creation, in which the accomplishment of each new level will be a real feeling of success. Besides this, as part of an interesting and exciting story, you can discover the secret of the A-Tech Cybernetic, in which the sense of thrill and fear are guaranteed.\nOur game is developed exclusively for VR platforms, exhausting all the possibilities to make you feel as if you were on another planet, but still in the reality. Our commands are adjusted to this as well, to make it as life-like as possible, be it physical fighting, shooting or pulling your bow.\nFirstly only the Swarm mode can be accessed. You will have the chance to liquidate the enemies raiding on you! Take possession of the weapons in your surroundings, and try to survive as long as possible! Pistols, machine-guns, shotguns and several other weapons will be at your disposal, to become the hero of A-Tech! But beware, if you run out of ammunition, you can only count on your fist! :) Collect as many points as possible!\nFeatures:\n•\tElaborately detailed, innovative graphic design:\no\tWe are striving to elaborate virtual reality and shooting to a new level with the A-Tech Cyberntic. For this, we created such a visual world, which you have never seen in any other VR game!\n•\tLife-like armament:\no\tUse the VR tools as if they were real weapons! Pull the bow, aim with the pistol, and fight just as if you were in reality!\n•\tChallenge!\no\tWe experienced in several VR games, that there is simply no challenge in them, and no matter what, you always win at the end. We guarantee that in our Swarm mode we will really make you sweat, and achieving every higher level in the game will be a real experience of success for you! :)\n•\tBullet-time:\no\tWe all like to liquidate our enemies in a very spectacular way. The Bullet-time provides an excellent tool for this!\n•\tExplosive barrels!\no\tEvery now and then you get explosive barrels to ease your fight against the swarms!\nFuture release plans for the Game\nStep 2. March - May (Future)\nIf One level was not enough, then we raise the stakes! We expand our repertoire with an additional level, and many more weapons. More levels, more weapons, even more fun :)\nStep 3. Jun-Jul. (Future)\nSwarm mod was only the beginning! During the 3-4 hours’ long Story mode you can reveal the secrets of what happened to Earth, and what did the A-Tech Cybernatic do to humans! But be careful, for there are new dangers lurking for you on every corner. In the story mode, you will find every single element required for a proper horror game. Save our world from chaos, Be our hero All IN VR!\nAfter the story mode. (Future)\nMultiplayer and Co-op mode ;)\nFeatures coming soon:\n•\tStory mode:\no\tIn our Story mode you will find all kinds of tools which are necessary for you to really feel like being in a real horror game. With atmospheric ambience.\n•\tPuzzles:\no\tAre you fed up with the brainless shooting VR games? Do you miss creative solutions and puzzle tasks to be solved from them? Then you won’t be bored in our story mode.\n•\tTraps, traps and traps!\no\tAre you in big trouble? Place new traps; to make the job of your enemies as difficult as possible!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"XREAL Games","platforms":[{"id":0,"name":"PC"}]},{"id":10443,"name":"Mosaic","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/db9/db97619f5a9fe6573f7bf2fb26702fd8.jpg","description":"Mosaic is a 3D adventure game with 2D puzzle elements.\r\nFrom the creators of Among the Sleep, Krillbite Studio is going from horrors of childhood to the dreadful horrors of adult life.\r\nMosaic is a mysterious narrative game, where you follow the repetitive and lonely life of an average commuter.... Until one day, when strange things start happening.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Krillbite Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":4985,"name":"METAL SLUG XX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/448/4488210a1d332c9eee113dd9cda19158.jpg","description":"METAL SLUG XX blasts off on Steam!\nMETAL SLUG XX was originally released on PlayStation®Portable in 2009 and PlayStation®4 in 2018 as part of the classic 2D run-and-gun action shooting game series from SNK, and now returns to service on Steam with graphics upscaled to 1080p and 4k screen resolution support! Moreover, Leona Heidern, who was a paid DLC character in the original PSP® game, is now playable for free and from the get-go!\nGAME FEATURES\n■7 missions of intense action! Hidden routes for endless replayability!\n7 missions of breathtaking action, charismatic characters, Slug vehicles, and a variety of other content await players in METAL SLUG XX. Branching paths are also hidden throughout the stages for those who want to play and clear METAL SLUG XX to completion!\n■New military classes and return of the fan-favorite “Combat School”!\nChallenge more than 70 mini games prepared by a beautiful instructor, and clear them all to reach the legendary and devilish “Super Devil” military rank! Get promoted to acquire a mobile satellite that will assist you during your missions!\n■Leona playable from the start! 7 soldiers ready for battle!\nIn addition to the traditional METAL SLUG characters such as Marco Rossi, Tarma Roving, Eri Kasamoto, and Fio Germi, Ralf Jones and Clark Still from KOF’s Ikari Team have also been recruited for this mission! Also from the Ikari Team, Leona Heidern, who was a paid DLC character in the original PSP® version of METAL SLUG XX, will also now be playable from the start. Are you ready to stop every enemy attack via her powerful “Moon Slasher” special ability!?\n■Tons of hours of gameplay with achievements!\nMETAL SLUG XX features no fewer than 34 achievements. Players can also enjoy the co-op local play with their friends!\nGet ready for endless hours of intense action and fun with METAL SLUG XX on Steam! Rocket Lawnchair!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"SNK","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":736257,"name":"Xenoblade Chronicles 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae7/ae7cfc9a66232839112663899d2c8d8d.jpg","description":"A vast world awaits in Xenoblade Chronicles 3, the next game in the acclaimed RPG series from developer MONOLITHSOFT. Players will step into the roles of protagonists Noah and Mio amid turmoil between the hostile nations of Keves and Agnus. Six characters hailing from those nations will take part in a grand tale with “life” as its central theme.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Monolith Soft","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":681570,"name":"Demon Turf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a28/a289b31f456f1837fabc2fd2f0a9ed1e.jpg","description":"The Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead the task falls to Beebz, a young demon barely a thousand years old, who decides it’s time for her to kick every turf leader’s butt and become the Demon Queen herself.\nA unique aesthetic combining the expressiveness of 2D illustrations with the depth and sense of exploration 3D environments can offer!\nA world chock-full of humor and style, from the music accompanied by the protagonist’s rapping to the colorful characters inhabiting the world!\nA unique take on progression! Take a victory lap and explore previously beaten levels to discover their liberated state, with plenty of mechanical and environmental changes to uncover. Or take some time off in the hub town taking on sidequests and other distinct challenges instead.\nPull off some clever platforming combinations or get physical with a special physics-driven combat system that ramps up the chaos and fun. Push, pull and spin your enemies out of your way.\nA different take on checkpoints, freeing the player to place them wherever they want. Show off without them for a perfect run, or place one in preparation for a challenging section.\nUnique challenges like the “Photo Hunt” mode where you’re tasked to take pictures of hidden locations & surprising moments! Or simply take picures and selfies for fun and share them across all social media!\nAn awesome collection of purchasable mods that can be combined in clever ways to completely change your play style! Or you could buy some dyes & pets instead, the world's your oyster!\nTons of carefully crafted levels that constantly introduce new challenges as well as en- gaging bosses full of character and life! Until Beebz gets to them...\nFrom the makers of Slime-san comes their newest creation! The team used everything they learned from their 2D platformer to elevate this 3D platformer to the next level!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fabraz","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":17884,"name":"Pharaoh's Tomb","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/207/2078bc13f634d7a035910a2e82540cac.jpg","description":"Nevada will be forced to overcome the seemingly impossible. Monsters, mummies and bats are just some enemies you will have to defeat, as well as environmental hazards such as traps, pits, and falling spikes.\nRun, jump and spear your way through the Pharaoh's Tomb in adventure as timeless as the Pharaoh himself.Features\nIntrepid Explorer: 20 exciting, hazard-filled levels to explore.\nHigh-Score Hero: A high-score table allows your to track your treasure-hunting skills.\nTreasure Hunter: Find bonus items to increase your wealth.\nBlast from the FAST: Utilizes the FAST (Fluid Animation Software Technology) system for flicker-free movement.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"3D Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16647,"name":"Depths of Peril","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f1/4f10d3de505f17dc35db05357640dee1.jpg","description":"Depths of Peril is a single player action RPG (role-playing game) with strong strategy elements. You play as a faction leader protecting the barbarian city, Jorvik, by destroying threatening monsters and completing quests. At the same time, you compete with rival factions to see who will rule the city. Barbarians choose their leaders by fighting to the death!\nAs a faction leader, you must deal with rival factions through diplomacy, trade, and in time, war. Between battles and raids against other barbarian factions, you build the most powerful faction possible, to withstand your enemies. Building the power of a faction involves exploring a fantasy world, slaying dangerous monsters, solving quests for the city, avoiding deadly traps, and plundering loot to share within your faction.\nBut in this world, actions actually have consequences, so take care. Annoying the powerful and aggressive Legion of Fear faction will cause them to declare war and destroy you. Ignored Orc uprisings in the Black Forest will cause even more trouble. Protect ally covenants that are being raided, because friends are hard to come by.\nA unique blend of action RPG with strategy elements\nPlay as a leader of a faction fighting for supremacy\nNavigate relationships with enemy factions using diplomacy, trade, war, and raids\nExperience real and hard consequences from a living world\nExplore a breathing, evolving world\nTraverse a random, seamless world\nDelve into a deep wellspring of history (40+ short stories, 60,000+ words)\n","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Soldak Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15240,"name":"World's Dawn","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb3/fb38e67f307bf348ef7a5a41fe57f062.jpg","description":"World's Dawn is a colorful life and social sim set in a sleepy seaside village. Inspired by the Harvest Moon series, it features vibrant top-down graphics, a huge cast of quirky characters to meet and befriend, and 30+ hours of charming gameplay. Soak in the enchanted, whimsical atmosphere of Sugar Blossom Village as you build friendships, find love, harvest crops, tend livestock, customize your farmhouse, compete in festivals, fish, forage, mine, cook, discover magical secrets and more!\nRELAXED GAMEPLAY\nEngage in a variety of small town activities at your own pace — build friendships, find love, harvest crops, tend livestock, fish, forage, mine, cook, discover magical secrets and restore your dusty old farmhouse.\nA DYNAMIC VILLAGE\nExplore a dynamic seaside town that grows and changes as seasons pass by. Sugar Blossom is rich in history and culture, and plays host to a variety of festival mini-games and market events throughout the year.\nCHARMING CHARACTERS\nBefriend a charming cast of 32 individual villagers, all with their own personalities and quirks. Get to know them through a deep relationship system and hundreds upon hundreds of lines of unique situational dialogue.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wayward Prophet","platforms":[{"id":0,"name":"PC"}]},{"id":15190,"name":"Gladiator Trainer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdd/fddaa130f47b3c9c4b3ae3d2704a2d58.jpg","description":"In the ruthless world of the Crownlands, which is ruled by the One True Queen, it has never been easy for someone of low class to rise above their place in the caste system society.\nEven now, with the realm recovering from a great war and the alliances between the great eight dominions more fragile than ever, there is little that a commoner can do to make his mark on this chaotic world.\nExcept, perhaps, through the prestige of the arena.\nThis will be your route to power and glory. Use your wits, your wealth, and your warriors to build a team of gladiators that will allow you to rise in status from the lowest drinking dens to the queen's royal arena.\nYou are given a run down estate that you must restore in order to properly train your fighters.\nAlong the way you will encounter travelers that will offer to improve your fighters stats. Some may even try to convince you to rally against the queen. Will you protect and unravel the conspiracy against her or will you join the rebellion to take the Crownlands away from the Queen?\nAlong your journey, you will need dancers and weapons trainers to build your fighters into an experience fighting army. Armories are available to customize your gladiators weapons and armor. Prized maidens will be looking for a proper suitor to marry and will offer large amounts of money through dowries to help fund your empire.\nBe careful who your allies are and be wary of anyone you do not know.\nCan you become prestigious enough to be the Champion of the Crownlands?\nCan you build a gladiator empire that stands the test of time?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":6830,"name":"Nyan Cat: Lost In Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76b/76b0d76f668f413b7142c60dd28dad1d.jpeg","description":"** Official Nyan Cat Game **\nPlay with the most celebrated flying cat in human history. Drink milk, eat ice-cream, collect coins, buy gorgeous boosts, fly like a superhero (sorry... supercat), jump onto platforms made of cake, avoid angry dogs, and discover the infinite space. And that's not all, you can choose from multiple game modes, where you can play with Nyan Cat's evil foe Tac Nayn, learn to fly on different planets with Nyan Wings or visit parallel universes. If you're tired, you can even train and feed your own Nyanagotchi. Oh, and last but not least: you can enjoy the wonderful Nyan-song as many times as you want! All this funky stuff can't be missed.\nFeatures for Humans:\n- Tasty COLLECTABLES (energy drinks, donuts and more)\n- Crazy POWERUPS (rockets, bubbles and more)\n- Freaky POWERDOWNS (dynamites, flashlights and more)\n- Evil ENEMIES (dogs, UFOs and more)\n- Leaderboards & ACHIEVEMENTS\n- Stunning boost ITEMS (score multiplier, shield and more)\n- 5 GAME MODES, including Nyan Wings\n- NYAN EDITOR!\n- NYANAGOTCHI room: keep your Nyan happy to earn gifts! The happier he is the quicker you get your prize.\n- Different background THEMES (Halloween, Xmas and more)\n- Different forms of NYAN CAT (Supernyan, Zombienyan, and more)\n- TAC NAYN\n- Nyan nyan nyan nyan NYAN nyan (nyan, nyan and more)\nFeatures for Nyans:\n- Nyan nyan nyan nyan POWERUPS nyan nyan nyan ACHIEVEMENTS nyan nyan SUPERNYAN nyan ONLINE HIGH SCORES nyan nyan nyan BEAUTIFUL PIXEL ART nyan nyan nyan","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"isTom Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":4216,"name":"Frobisher Says!","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Compatible with PlayStation®Vita only.\nAn exclusive app for PS Vita, Frobisher Says! is a collection of crazy mini-games, devised deep within the eccentric mind of Frobisher himself. Bell ringing, soup stirring, accordion playing – if you can imagine an activity, Frobisher has probably thought of it, added an outrageous twist and created a unique challenge to test you.\nTo be successful, you’ll need to make use of the full range of features your PS Vita has to offer. Tickle the touchscreen, wiggle the analog sticks, shout into the microphone – who knows what you’ll need to do? Whatever it is, you need to be quick, as the faster you can complete each challenge, the more points you’ll get before the next task begins.\n25 mini-games are available when you first play, additional games will be unlocked as you go and others will be available to download from PlayStation®Store.\nOn top of the side-splitting single player mode, up to eight players can battle it out in multiplayer sessions by passing one PS Vita system around between them. Who will play well enough to get their high scores on the online leaderboards?\nFind out more about the fun-filled world of Frobisher Says! over at us.playstation.com.\nLook out for other great Discovery Apps – innovative apps and games designed to show off the unique features of your PS Vita – right here on PlayStation®Store. You can read this title’s instruction manual via its LiveArea™ – just select the question mark icon.\nGameplay requires PS Vita memory card (sold separately).\nCompatibility Notices: 1 – 8 Players, Network Features, 510MB Minimum Space Required, Touchscreen/Rear Touch Pad, Dual Analog Sticks, Front and Rear Camera, Motion Sensor, Microphone.This item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.This item may be used solely by this Sony Entertainment Network account on up 2 activated PlayStation® devices, with no more than 1 activated device within a 24 hour period.  Content may not be used by any other account. Frobisher Says!™ ©2012 Sony Computer Entertainment Europe. Published by Sony Computer Entertainment Europe. Developed by Honeyslug Ltd. “Frobisher says” is a trademark or a registered trademark of Sony Computer Entertainment Europe. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"}]},{"id":4011,"name":"Ratchet: Deadlocked","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e6b/e6bb8cf72996aa239d6e76668a48120e.jpg","description":"Introduces a new mission structure approach, where players are rewarded with a constant progression of items such as weapons, armor, and health. \r\n\r\nSquad based gameplay allows players to demolish the competition by commandeering your allied bots through critical and strategic battles.\r\n\r\nEnhanced online gameplay, featuring five modes of play and 12 levels. Modes include Conquest, Deathmatch, King of the Hill and more.\r\nThis item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.This item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account.  Please see software description for device compatibility. ©2005, 2013 Sony Computer Entertainment America LLC. Ratchet: Deadlocked is a trademark of Sony Computer Entertainment America LLC. Developed by Insomniac Games.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":479678,"name":"Shadow of the Tomb Raider: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/63e/63e1419ccc655614bab6469b357023a6.jpeg","description":"Shadow of the Tomb Raider Definitive Edition experience the final chapter of Lara’s origin as she is forged into the Tomb Raider she is destined to be. Combining the base game, all seven DLC challenge tombs, as well as all downloadable weapons, outfits, and skills, Shadow of the Tomb Raider Definitive Edition is the ultimate way to experience Lara’s defining moment.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":52434,"name":"Mario Bros. (1983)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ef/8efa90f72b466c632d7f95dd02be5e50.jpg","description":"Mario Bros. (マリオブラザーズ, Mario Burazāzu) is a platform game published and developed for arcades by Nintendo in 1983. It was created by Shigeru Miyamoto. It has been featured as a minigame in the Super Mario Advance series and numerous other games. Mario Bros. has been re-released for the Wii's, Nintendo 3DS's, and Wii U's Virtual Console services in Japan, North America, Europe and Australia.\nIn the game, Mario is portrayed as an Italian-American plumber who, along with his brother Luigi, has to defeat creatures that have been coming from the sewers. The gameplay focuses on Mario and Luigi exterminating the creatures by flipping them on their backs and kicking them away. The original versions of Mario Bros.—the arcade version and the Family Computer/Nintendo Entertainment System (FC/NES) version—were received positively by critics.","review":"","timePlayed":0.0,"releaseYear":1983,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Atari 7800"},{"id":0,"name":"Atari 2600"},{"id":0,"name":"Atari 5200"},{"id":0,"name":"NES"},{"id":0,"name":"Atari XEGS"},{"id":0,"name":"Commodore / Amiga"}]},{"id":52106,"name":"Escape from Tarkov","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9a/a9ab53644b92698b18957a362c99b4e2.jpg","description":"Escape from Tarkov is a hardcore and realistic online first-person action RPG/Simulator with MMO features and a story-driven walkthrough.\nWith each passing day the situation in the Norvinsk region grows more and more complicated. Incessant warfare in Tarkov has sparked massive panic; the local population has fled the city, but those who stayed are looking to improve their fortunes at the expense of others. Having accepted the new reality, savage Tarkov locals - \"Scavs\" flocked into well-armed gangs and started the redivision of the city. Nowadays, Tarkov is separated by unseen borders, controlled by different groups. Gain-greedy gunmen would go to any length to have their way, including the murder of civilians and direct confrontation with the two private military companies.\nThe players will have to experience living in the skin of one of the mercenaries who survived the initial stage of the Tarkov conflict. After choosing one of the sides – USEC or BEAR – the player’s character starts to make his way out of the city. Tarkov is sealed off by UN and Russian military, supply chains are cut, communication with operational command is lost, and in these conditions everyone has to make his own choices of what to do and how to get out of the chaos-ridden metropolis","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Battle State games","platforms":[{"id":0,"name":"PC"}]},{"id":22159,"name":"Gloom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/86f/86f2bffc0ea8b056e9e94f048dbd56ec.jpg","description":"You are a nameless dreamer, trying to make sense of the mystery that is the Common Dream. You know that deliverance lies within the lost pages of the Necronomicon and in the enigmatic Abyss deep within the Dream. To reach these, however, you must fight through hordes of insane dreamers and eldritch beings, as well as discover your past and the occult history of the Common Dream.<br/><br/><ul><li>H.P. Lovecraft inspired, original story - told carefully piece by piece<br/></li><li>Challenging combat that respects the player's ability to learn and adapt<br/></li><li>Procedural level structure that ensures endless replay value<br/></li><li>Wide array of weapons, items, and foes to offer tons of unique, compelling scenarios<br/></li><li>Permadeath system akin to modern roguelike titles<br/></li><li>Beautiful, stylized pixel art with the audio to match</li></ul><br/>Developed and published by Hunchback Studio<br/>Created by Aleksi Sirviö<br/>Music by Valtteri Hanhijoki","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hunchback Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21259,"name":"Agricultural Simulator: Historical Farming","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e1/9e188877fb47a182013c151463f0c917.jpg","description":"Enjoy being a farmer between 1950 and 1970 in the Agricultural Simulator – Historical Farming. The game takes you to the good old days and you will experience the charming farming of the 60's and 70's. Fans of nostalgia and history will be glad to work with original designed machines and to till a field with well known Old-timer Tractors. With the new feature – the dynamic ground Agrar Simulator – Historical Farming presents the first real furrows which will be left when working at the fields with strong machines. The furrows will have impact on the driving behavior of the tractors and guarantee pure realism. It is up to the player to decide in which region he would like to cultivate his farm. There are two amazing scenarios – idyllic highlands, valleys and woods in the alp-region or the fascinating Toscana region with measured climate.FeaturesExperience the charming farming in between 1950 and 1970\nOriginal drafted Old-timer tractors of well known brands like John Deere, Lanz Bulldog etc.\nPure Realism due to features like the dynamic ground with furrows.\nTwo different scenarios – Toskana and the northern Alp-Region.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Actalogic","platforms":[{"id":0,"name":"PC"}]},{"id":17733,"name":"Magical Diary: Horse Hall","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/575/5757c7f570d2b32e3b2cf0016505de69.jpg","description":"You have been invited to attend a magical school. Here you can make new friends, learn dozens of spells, face exams in the school dungeons, run for class office, and try to find a date for the May Day Ball. But be careful! You might end up in detention, be lured into a secret society, be forced to marry your professor, or even be expelled!Key FeaturesDesign your own character\nPursue friendship or romance with male and female characters\nAll puzzles have multiple solutions\nOver seventy spells to learn\nUnlock secret plotlines and events\nHighly replayable – make different decisions for a completely new story","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hanako Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17439,"name":"Warlock 2: The Exiled","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/deb/deb908a2e95956155a810a18eb36b269.jpg","description":"Previews:Rock Paper Shotgun:\nhttp://www.rockpapershotgun.com/2014/03/20/preview-paradox-warlock-exiled-strategy/ :\n\"Warlock II is everything I wanted from a sequel to Masters of the Arcane...\"\nPC Gamer:\nhttp://www.pcgamer.com/uk/previews/warlock-2-hands-on-set-fire-to-angry-dragons-in-this-cheery-turn-based-sequel/\n\"... quirky sense of humour and a good variety of enemies, units, spells and randomised occurrences.\"\nQuill18:\nhttps://www.youtube.com/watch?v=FpBMZKE3irc&feature=youtu.be&a\n“I am enjoying this very much”\nAbout the GameThe worlds have been shattered, and you have been exiled to one of these shards. The time has come to return to Ardania and seek vengeance on those who cast you out. Battle through the fractured realms inhabited by other exiles, hostile Mages and terrifying creatures. Once back in Ardania you will face your greatest threat: The United One and his four Vicars. Conquer all who oppose you, reclaim your home and take your revenge.\nWarlock 2 is a turn-based strategy game of fantasy warfare. Rival against Great Mages, lead mighty armies into fierce battles, wield ancient magic and faith as your weapons.\nExperience the challenge in single or multiplayer. Play the new \"The Exiled\" mode or enjoy the game in the Sandbox mode.Features\nA fantasy wargame like no other – A diplomatic victory is not an option, you cannot relax until your enemies lie crushed under the might of your strategic brilliance! The turn-based hex maps gives you time to ponder your next move and your weapons are the vast armies that relentlessly march to conquer all that oppose you.\nYou are the Great mage – Select who you are from a roster of over a dozen Great Mages, all with different abilities and spells, and choose which people you command on your path to victory. If no Great Mage suits your taste you can even custom build your own from scratch.\nProudly wield your magical power – Not only a superb battlefield commander, your immense magical powers will also aid you in your conquest. Carefully research over 170 spells and choose what to specialize in, from direct attack spells to terraforming, or maybe align yourself to one of the Gods to harness their powerful blessings. With time, you are even capable of customizing each spell using powerful glyphs.\nDiverse worlds requires different approaches – The several different and randomly generated maps all have their unique challenges and opposition to defeat. Use the terrain to your advantage!\nDifferent campaigns – Choose from either engaging your foes on a grand map in the sandbox game mode or the path of the Exiled, a revenge tale full of twists and turns, where you strike back at those who banished you from the world of Ardania.\nRaise armies – The people you lead and conquer all bring their unique units to your command. Choose if you want to field a stalwart Human army, command the Undead hordes, use the mysterious Planestriders, or mix and match them all plus others to your delight. There are a total of six different races to pick from, each with their own strengths and weaknesses.\nHire heroes – When your reputation grows, random heroes will be attracted to your cause, bringing with them their own special flavor to add to battles. Equip them with legendary artifacts, found or crafted, and make them your battlefield commanders.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ino-Co Plus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14804,"name":"Reign Of Kings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bfc/bfcc1435dfefca9e0b58828d7f0f293b.jpg","description":"Struggle to survive in a harsh medieval world. Hunt wildlife, mine resources, build structures, and craft weapons and armor in order to protect yourself. You may form a guild, bring war to all opposition, and try to seize the throne and become king!\nIn Reign of Kings we allow you to collect resources and craft a wide variety of items needed to build a vast and powerful kingdom. We were primarily inspired by Rust & Chivalry in the development of this game.\nIn addition to standard resources, you may compete over the Ancient Throne which resides in a throne room which overlooks the island. All players who are not part of the King's Guild are taxed on the resources they collect.\nThe development of a melee combat system adds a gritty and visceral feeling to Reign of Kings that will allow players to become deeply immersed in a realistic and intense medieval survival experience.\nThe world itself is designed to inspire competition and struggles for power.  Resource locations strategically spread throughout the game will create inequity and envy.  Players will have the ability to make war, or even capture and hold other players in order to get what they want.  Each player will have the power to decide the fate of the kingdom, or choose to entirely forego the responsibility of ruling the kingdom and roam the land as a freeman.\nCAPTURE\nPlayers have the ability to capture, hold, and execute other players. The player can capture them with rope or iron shackles. Once shackled, a player is no longer able to access their inventory aside from their orifice slot. The captured player's inventory is accessible for the captor to search them.\n\nAdditionally, a rope will be attached to a prisoner which will allow them to be pulled in any direction their captor wishes. In order to avoid severe grieving situations, players can hide a sharp stone or lock pick in their orifice. This \"hidden\" item can help them escape capture or commit suicide.\nPUNISHMENT & DEATH\nPunishment & Death Once the player has control of a captive, there are several options available for managing a prisoner.  Options range from simply locking them in a cage or dungeon, public humiliation in the pillory, or simply executing them.\nTHE ANCIENT THRONE\nThe Ancient Throne can be claimed by any player. Holding the Ancient Throne will grant its owner dominion over the entire map (change name of realm) and taxation rights over every other player.  The King of the Ancient Throne will receive the ability to collect the resource tax from every player within the game by visiting the Ravens Treasure Tree. The ravens automatically collect taxes in the game (behind the scenes of course, sneaky little things), and place them in the chests in their Treasure Tree.\n\nIn addition, the King of the Ancient Throne will have access to the Ancient Sword and the Ancient Crown.\nPRODUCTION & REFINING STATIONS\nPlayers will have the ability to collect resources and to craft them into useful items or building materials. Additionally, the progression mechanic for being able to craft higher valued items will be reliant on upgrading production stations to a higher level.  (Need a better quality sword?  Upgrade your anvil.)  Production and refining stations can craft or refine items as long as there are resources available unless ordered to do otherwise.  This allows the player the freedom to do other things while his kingdom remains productive.\nCOLLECTION STATIONS\nCollection stations can be placed for grain and water. Collection stations will passively produce raw materials given they have enough fuel.\nThese collection stations will be fully interactive and if left un-defended will offer a nice target for unscrupulous or enemy players.  With this in mind, the player will want to protect their resources.\n\nSIEGE EQUIPMENT AND RAIDING BASES\nOnce the players build stone walls and iron doors, players will not be able to simply bash their way inside. Players will now need to employ one of many different techniques for entry.\nThe ranged option is to build trebuchets and launch large stones from afar at your opponent's castle. Players must place a counterweight to offset their projectile weight in order to get the range and destruction power they need from the stone they are launching. Players may also rotate the trebuchet. This alignment takes some practice but is very rewarding when set correctly.\nPlayers may choose to go a more stealthy route by crafting lock picks. Lock picks, however, are very hard to craft, and do not work on iron doors and iron gates.\nPlayers defending a base may employ their own trebuchet or set up a ballista which is great for killing other players at range.\nFIRST PERSON COMBAT\n\nOur combat systems allow melee and ranged combat to take center stage when war breaks out. Inspired by games like Chivalry, Reign of Kings' combat system is being tuned for satisfying, fast paced action. Players fight over the scarce resources and face off to defend or capture the throne.\nMELEE\n\nPlayers equip brutal weapons and use mouse buttons in an attempt to chop, slice, & stab through an opponent. Players will want to upgrade their weaponry to inflict the highest amount of damage as melee combat will always be dangerous and unpredictable.  Armor will be highly prized in Melee as it will keep you in a fight much longer.\n\nWe support delimbing and decapitation of an opponent to represent the visceral and brutal experience of medieval close-quarters warfare.  A variety of period realistic weapons and armor will be available for the player to craft as they progress toward elder content.\nRANGED\nRanged fighting in ROK will encompass the use of the bow, crossbow, javelin, and throwing stones. A good way for a player to stay alive in a fight during the early game will be to use ranged weaponry and speed.  Keeping out of sword range from a marauding knight is always a good idea, but even more so if you’re not equipped with the quality of armor that can absorb a hit or two.\n\nA simple bow and spear may be capable of taking down wild game, but may not provide enough piercing power to get through the finest plate male.  It’ll be important for the player to learn what kinds of weaponry are most effective in a fight as it will be critical knowledge to stay alive and have impact in a fight.  Higher tier Steel-pointed javelins will be able to pierce some armors, but the crossbow is the best option for punching a hole through the most heavily plated opponent at range.\n\nThe general rules of ranged weaponry will apply in ROK to determine functionality.  The bow will have the highest accuracy and reload speed, the crossbow will have greatest piercing power but is slow to reload, and thrown weapons will have the highest damage output, but are for short range use only.\nLOOT\nROK features a plague-ridden village that was cursed and abandoned by the old gods. This village features plague-ridden villagers, loot crates, and some high-end loot drops. It is dangerous to be in the village for long periods of time due to the disease that will damage the player's health.\nDEATH\nROK uses a roguelike death model similar to Rust.  When players die, they will fall to the ground as a ragdoll container that can be looted by other players.  Dead players will be provided with a random re-spawn option that can be improved through bed placement.\nCHARACTER CUSTOMIZATION\nPlayers begin the game by creating a unique character.  They will be able to refine their look in great detail by editing their body parts, choosing hair, and establishing a banner scheme to help them identify loyal friends during gameplay. You can also choose the voice style of your player's taunts.\nBUILDING\nUsing the standard block, ramp and stairs, ROK building materials will consist of sticks, thatch, clay, wood, re-enforced wood, and stone.  Thatch, sticks, wood and clay will be widely available and often the first choice in material for beginning level housing. While these materials will offer shelter from poorly equipped enemies, they are easily breached by other players. Stone will offer much greater resistance to basic attacks and will only be damageable with siege tactics.  Players will be able to build their homes, towers and castles any way they like, but will need a great deal of space during elder content play in order to hold a large number of production, refining, and collection stations.\n\nBuilding castles will be a natural occurrence for players who reach elder content gameplay.  With the large number of production stations, refining stations, collection stations, chests, torture devices and respawn beds available for the player to build, comes the need to protect a large footprint of space.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Code}{atch","platforms":[{"id":0,"name":"PC"}]},{"id":14070,"name":"Crookz - The Big Heist","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4c/d4c1c8f516024684557bfe72feecd3a1.jpg","description":"It’s the 1970’s: the era of Funk, flared jeans and disco-fueled Saturday nights. A crack team of expert thieves turn Grand Larceny into an art-form by using their many talents to break into the richest homes and steal the finest jewelry - all to finance their hedonistic lifestyles. That is until a lucrative museum heist in Venice involving a famous gem known as ‘Luna Stone’ ends in betrayal and the team broken apart. Five years later the remaining gang members reunite with a plot for revenge against their traitorous former comrade – but naturally, their plan will also make them rich beyond their wildest dreams…\nCrookz - The Big Heist is a tactical strategy game set in the funky 1970’s with a slick and groovy atmosphere. Show off the art of thieving by plotting stylish heists and robberies; utilizing espionage and quick-thinking to avoid detection. Implement a successful strategy by assembling and kitting out your team before the job and planning the best way in.FeaturesDiverse and thrilling Single player campaign.\n18 extensive missions set in a colorful and stylish 70’s setting.\nCustomize your gang of thieves with up to six playable characters. The powerful bruiser makes a good hatchet man, while the lockpicker is responsible for the finishing touches.\nKit out your team with all manner of elaborate tools: like camera jammers, chloroform or explosive charges.\nTest your skills under tough conditions in Challenge Mode by unlocking new heists and competing for the ultimate highscore against other players.\nUnique gameplay mixes quick-thinking with in-depth strategy.Bonus - Short Film","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kalypso Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":7694,"name":"Star Trek Timelines","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a56/a560e3af02e4e0db88893847bfcf7f31.jpg","description":"Explore the Final Frontier in the ultimate sci-fi strategy RPG, Star Trek Timelines! Join Starfleet and overcome challenges as you boldly go where no game has gone before – across the entire history of Star Trek.\nFEATURES\n● ASSEMBLE YOUR CREW from hundreds of characters from Star Trek, The Next Generation, Deep Space Nine, Voyager, and Enterprise, each with their own unique skills and abilities\n● COMMAND ICONIC STARSHIPS, including the USS Enterprise, Voyager, Defiant, a Klingon Bird of Prey, the Borg Cube, and many more\n● ENGAGE YOUR ENEMIES in stunning 3D ship battles with exciting PvE play or in PvP Battle Arena where you’ll test your crew’s mettle against the best captains in the galaxy.\n● EXPLORE THE GALAXY, gaining influence among a dozen factions, including the Federation, the Maquis, the Dominion, the Terran Empire (TOS: “Mirror, Mirror”), and the infamous Section 31\n● CLIMB THE LEADERBOARDS and win rare rewards with special event missions.\n● STUNNING GRAPHICS bring the 24th century to life in the most immersive and thrilling Star Trek experience available\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Disruptor Beam","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":3998,"name":"Earth Defense Force: Insect Armageddon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa5aa4efd3905a2726d3124129c9f16b.jpg","description":"Thousands of giant insects and aliens once again ravage the earth, and only the Earth Defense Force can stop them. Defend the city of New Detroit against an infestation bigger and meaner than ever before. Destroy these monsters at all costs, even if it means turning entire city blocks into rubble!\nEnjoy raw arcade shooter satisfaction on a gigantic modern scale.  Collect over 300 weapons: assault rifles, rocket launchers, energy weapons, sniper rifles, grenade launchers and more! Play with 4 upgradeable armor types: Jetpack, Battle, Tactical, and Trooper. Experience  Massive replayability through arcade style scoring, tons of weapons to collect, and multiple difficulty levels in every game mode!\nIn addition, the game also features a six player Survival mode that pits a human squad against a nonstop onslaught of the largest enemies the aliens have to offer.  New Detroit’s giant bug problem is unavoidable, and mankind’s last hope lies with the Earth Defense Force.  Defend the world from the insect invasion, even if it means blowing up the entire city as part of the extermination process.\nEarth Defense Force: Insect Armageddon and the soldiers are equipped better than ever in the latest cult classic iteration that follows in the footsteps of Earth Defense Force 2017 (Japanese Title “Earth Defense Force 3” developed by Sandlot), and Earth Defense Force: Insect Armageddon continues the rich history and hardcore fun of the series.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"D3 Publisher","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":692220,"name":"Football Manager 2022","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/541/541952e533e0d1a144017cf95cbbc2e0.jpg","description":"M22 brings new, progressive ways to find that winning edge, instil your footballing style and earn it for the fans. Pack includes an FM 'Coaching Planner' to take your tactical planning and squad building to the next level. Football isn't just about winning - it's about overcoming the odds and earning your success. Fighting your way to the top or clawing your way back from the brink; these are the moments that taste sweetest. In Football Manager 2022, you're the architect of your club's destiny - the fans' fortunes rest with you. Prevail in the moments that matter to turn their dreams into reality and earn your place alongside the managerial greats.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Sports Interactive","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":484832,"name":"Kill It With Fire: Ignition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be8/be804df87e7a9d6e05365df266d8a8d6.jpg","description":"The full game is out now!https://store.steampowered.com/app/1179210\nAbout the GameJOIN OUR DISCORD\nThe spider - mankind’s most ancient and deadly nemesis.  As a licensed Kill It With Fire exterminator, it’s time to fight back!  Assemble your arsenal of increasingly excessive weapons, track spiders across suburbia, and burn everything in your path! IGNITION is a sampler chapter for the full game. Get an idea of what to expect when we launch in Summer 2020!\nTo defeat spiders you must exploit their one weakness: FIRE. Or bullets. Or explosions, throwing stars, gettin’ smushed by stuff...pretty much anything, really.  But that doesn’t mean it’ll be easy - first you’ve gotta find the spiders.  Use state-of-the-art arachnid tracking technology to pinpoint your quarry’s location among hundreds of potential hiding spots - then, torch everything and smash the spider with a frying pan after it runs out.  It’s the only way to be sure.FeaturesDozens of weapons.\nCreepy crawlies.\n“Realistic” fire simulation system.\nGratuitous chaos and destruction.\nFinally learn the truth about spiders.\nThe IGNITION demo features about half hour of gameplay!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Casey Donnellan Games","platforms":[{"id":0,"name":"PC"}]},{"id":484823,"name":"Hand Simulator: Survival","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fd/1fdaaec8903c3e2e08f0f9c2b35ed395.jpg","description":"In the company of friends or strangers you find yourself on a desert island. Your task is to live longer than anyone else, wait for the ship, attract its attention with a bonfire and sail away from the island. Look for water. Hunt animals. Build houses and build fires. Do everything not to die on the first night from the unbearable conditions of survival.\nHand simulator: survival uses a brand new hand controller. With it, you can quickly run, jump and interact with the world. Less errors, more stability.\nDynamic change of day and night, as well as a limited number of resources will not let you relax. Only the most dexterous will survive.\nYou can experience yourself on the island in the company of up to 8 people.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"HFM Games","platforms":[{"id":0,"name":"PC"}]},{"id":37305,"name":"World in Conflict","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/203/203c0cfb38822055144f47370c14a7a5.jpg","description":"World War III rages and a Soviet-led army has launched a surprise attack on the U.S.A. Command your troops into fast-paced battles fought on a fully destructible battle-field. Strategy meets intense action in this epic clash of Super Powers!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Massive Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":25310,"name":"Resident Evil: The Umbrella Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5cd/5cd15af407f7a7385dcae71b30acacc6.jpg","description":"Swarms of undead creatures and mutated terrors rule the streets,\npestilent hordes born of Umbrella's botched biowarfare research. Gather\nyour firepower, choose various routes and pathways, and prepare to face\nthe horror as you uncover the dark truth that could take Umbrella down\nforever.\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Capcom","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"}]},{"id":21323,"name":"Eryi's Action","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bf/2bf048b63c07d6f75414b258dfc53880.jpg","description":"One fine day, Eryi went to eat the melon that she had been SO looking forward to... but it was nowhere to be found! Then she noticed a note on the table. She picked it up and read: \"Your melon looked delicious, so I took it. From Farta X\"\nFuming with rage, Eryi set out from her house to get her melon back from Farta.\nEryi's Action is a 2D ‘trapformer’ by developer Xtal Sword that is visually inspired by Super Mario, but has gameplay akin to games like I Wanna Be the Guy. Don’t be fooled by its adorably charming looks – this game abounds in traps and wants you to die! However, where IWBTG was murderously difficult, Eryi's Action is additively challenging and FUN!\nTrap placement is often laugh-out-loud funny and seriously engaging. Some traps simply need to be learned to avoided, but others are puzzles that will require your skill and wits to beat. Either way, Eryi’s action delivers laughs, frustrating and satisfaction & all for just $4.99!\nFeatures:12 action-packed stages & boss fights!\nAdorably charming world & characters!\nFiendishly cunning traps!\nIt’s okay to fail! Autosave has your back!\nFUN! You'll die a lot, but you WILL go back for more!\n32 achievements!\nCreated by Xtal Sword: http://xtalsword.com\nLocalized & published by Nyu Media: http://nyu-media.com\nDISCLAIMER\nXtal Sword and Nyu Media Ltd assume no responsibility for any damage, injury, rage, addiction or mental trauma caused by playing this game. Play at your own risk!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Xtal Sword","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20565,"name":"SATAZIUS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/836/836a9d72755cb69160cf673f80184344.jpg","description":"The year is 2051. Location: SATAZIUS, a long-abandoned planet.\nThe cruiser Agano was on patrol when it was attacked and stricken by a confederacy of space pirates that had established a base on SATAZIUS. The pirates attacked the Agano intending to steal the assault ship ‘Trafalgar’ that was stowed aboard the Agano, but the Trafalgar made a successful emergency escape.\nThe crew of the Trafalgar calculated the probability of successfully escaping the pirate overrun planet at 0.02%; the probability of charging into and successfully destroying the pirate base was 1%.  Taking the higher probability escape plan, the crew of the Trafalgar turned their ship toward the pirate horde and began their charge into the heart of SATAZIUS.\nSATAZIUS is an awesome old school side-scrolling arcade shooter by accomplished indie developer ASTRO PORT (Gigantic Army, Armed Seven, Supercharged Robot Vulkaiser), featuring an arsenal of 13 types of upgradeable weapons, power-ups, obstacles and boss encounters that arcade veterans will enjoying getting to grips with. Customize your ship by selecting two side weapons which can be cycled and deployed at any time during the action, and a charge attack to unleash massive destruction.\nThere is a plethora of enemy ships to shoot down, tight spaces to navigate, power ups to grab, and bonuses to acquire. Featuring great stage design, a thumping techno soundtrack, fast and outstanding action, old school graphics and giant bosses, SATAZIUS is a true throwback to old-school arcade shoot ‘em ups, replete with homages which will be instantly recognizable to fans of arcade shooters.\nKey features:13 upgradeable weapons to choose from\n4 difficult levels allowing accessibility for new players while challenging veterans as well\nVaried and exciting stage design\nMassive bosses\nWinner of the August 2008 Jikkyo Play Contents Award","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"ASTRO PORT","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17512,"name":"Arctic Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df5/df5c399107189ef669fb1c57dd09163c.jpg","description":"Like Pharaoh's Tomb, Arctic Adventure is a CGA game containing 80 all-new diabolical levels, packed with mind-bending arcade action designed to keep you from ever succeeding. Nevada will face freezing waters, diabolical traps, slippery ice patches, falling stalactites, runaway snowballs and even abominable snowmen! There are many, many more obstacles for Nevada to overcome in this highly adventurous series.Features\nClick or Stick: Flawless keyboard and joystick controls.\nHigh-Score Hero: A high-score table allows your to track your treasure-hunting skills.\nTreasure Hunter: Find bonus items to increase your wealth.\nBlast from the FAST: Utilizes the FAST (Fluid Animation Software Technology) system for flicker-free movement.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Apogee Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17036,"name":"The Lost Valley","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b5/0b525e970d9e9d3380e3cef972a6d270.jpg","description":"Game story:\nYour plane was destroyed by lightning near an unknown continent.\nYou're the only survivor on the plane.\nAfter some exploration, we found that there are many enemies hidden here.\nLook for guns and kill the enemy!\nGet out of this forest!\nContent and games\n-Players operate characters to fight with enemies\n-All kinds of guns\n-Explore the vast map\nFeatures of the game:\n-The first person is a really exciting way to play.\n-Players need to collect the enemy's guns to deal with the enemy.\n-Please pay attention to the enemy. They are hiding in a secret place\nGame control mode:\nA-right\nS-back\nW-forward\nD-right\nF-pick up guns\nLeft click - shoot!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DD GAME","platforms":[{"id":0,"name":"PC"}]},{"id":13244,"name":"Castle of no Escape 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b1/0b18f0699e1115c9f1802364df57cbaf.jpg","description":"Prepare yourself for the dangers of the cursed castle! Countless heroes have tried and failed to destroy the ancient spell that holds its walls. Meanwhile, hundreds of monsters are roaming inside, guarding the sword shards — the last known thing to be capable of defeating the demonic castle owner, thus shattering its magical structure.\nAlthough, you are not alone — some help could be obtained from the merchants, who, for reasons not truly understood, offer their services right inside the lair of evil. Though, it seems to be only a matter of time for them to disappear...\nExplore 6 x 6 x 6 = 216 rooms of randomly generated hazards and enemies while collecting the necessary artefacts. Plan your next step carefully, because save points aren't a thing in a rogue-lite game! There is, however, another option, explained below.FEATURES\nBattle System: Every character is different, try them all! Perform the Agile attack when you're in a pinch. Use armor and shields to your advantage and boost armor stats using the emblems.\nPAL/NTSC modes: If the game feels too unforgiving, you can tone down the difficulty, lowering the framerate to 50 (PAL). Note, though, that music and sounds become more evil at the 83% of their original pitch.\nPassword System: Just like in an old NES game, in this game you need to input 13 characters to get back to your game session. Still, the powers of evil prevent you from saving anything much more than the artefacts you've found...\nUnfold the mystery: Defeat minibosses to unlock more playable characters.CREDITS\nGame by D. E. X. and Kolenka Team\nTrailer by Dr. Zlo\nPortuguese-Brazil translation by Gianvelox\nWe're open to translators! Get the game to YOUR language!\nhttp://steamcommunity.com/app/542350/discussions/0/142261027577392827/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"D.E.X. Team","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":12746,"name":"Lost Lands: Mahjong","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/add/addd86b7eee2a9cd906f8168ef43b9c5.jpg","description":"Persecuted by ill fate, the elven nation land on a lost island. They'll need sharp blades as well as sharp minds to survive.\nPlunge into the fantastic journey with the game Mahjong! Complete more than 150 levels, get awards, finish more than 200 quests, collect many collections and help elves to survive on the mysterious island.\nWith their kingdom in ruins the elves were forced to set off overseas to search for a new home. By fate's will, a storm crushed their ships on the shores of a lost island. High mountains, fragrant valleys and shimmering rivers - what else might the children of nature need? But their beautiful new world is filled with danger. When attempting to leave, the elves learn that the island is surrounded by an impenetrable magic storm. The survivors recall a legend about the last of the ancient elves, who shall awake from a thousand year's sleep to help them overcome hardship.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FIVE-BN GAMES","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":11865,"name":"STANDBY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a5/5a5482ce6d9fc29f0f9680099fa6f27e.jpg","description":"STANDBY is easy to pick up but hard to master precise platformer. Challenge your reaction in this fast-paced game and get out of the glitched world. Enjoy smooth controls by dashing through the vibrant levels, crushing and overcoming all the obstacles on your way.\nSlide, crush, dash and teleport through the levels!You’ll never know what new mechanics will appear next!\n54 Unique Levels!Each will introduce you new mechanics on the go and will raise the bar for difficulty!\nPrecise controls! Because great platformers come from great character movement!\nGlitchy beats!They will follow you along the way ‘till your great escape!\nLeaderboards!So you can become the fastest out of all and brag about it!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NoClip","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":655,"name":"Pathfinder Adventures","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7db/7db82f0c61c5acee01da9b1ffcfc05a5.jpeg","description":"Standard Edition and Obsidian Edition contentsThe Standard Edition of Pathfinder Adventure contains:\nBase Deck & 6 Additional Adventure Decks\n11 Iconic Characters\n~1000 original cards\nTreasure Cards 1: 88 Uncommon and Rare Treasure cards.\nThe Obsidian Edition of Pathfinder Adventures contains:\nBase Deck & 6 Additional Adventure Decks\n11 Iconic Characters\n~1000 original cards\nTreasure Cards 1: 88 Uncommon and Rare Treasure cards\nEpic and Legendary Cards 1: 106 Epic and Legendary Treasure Cards\nGold, Runes, and Charms: 5000 Gold, 8 Runes, and 21 Charms\nPillars of Eternity Promotion Cards: 3 promotional ally cards: Eder, Pallegina, Goblin Golem of Obsidian\nAll Alts: 11 Alternate Equipment sets for the Iconic characters\nLegendary Items: 3 Legendary rarity cards\nFuture Goblin campaign Deck 1 with 2 new Goblin Characters.\nAbout the GamePathfinder Adventures brings one of Paizo's most successful products, the Pathfinder Adventure Card Game, into the digital realm in an enhanced experience. Additionally, it emphasizes the characters, story, and world of Pathfinder's rich and diverse world.\nFeatures players experience exclusively in the digital version include:\nReactive cutscenes featuring Pathfinder's iconic characters.\nExplore towns, cities, dungeons, and landscapes of the Rise of the Runelords campaign maps for places like Sandpoint and Thistletop.\nBeautifully enchanced and animated location backdrops.\nMultiple Adventure profiles so players can experience the campaign using every character.\nPlay through a tutorial that distills the rulebook down into a small mini-adventure.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":570172,"name":"My Time at Sandrock","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b13/b1315418c35bd241dc592f4e271b7bec.jpg","description":"My Time at Sandrock – Just like My Time at Portia, takes place in a wholesome post-apocalyptic world around 300 years after the Day of Calamity.\n\nYou'll take a job offer in the city-state of Sandrock, assume the role of a fledgling Builder being sent to a wild and rugged townscape. It’s up to you and your trusty toolset to gather resources, build machines, and fix up your workshop into a well-oiled production machine, and save the town from the jaws of economic ruin, as well as a few other unexpected complications.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Pathea Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":484881,"name":"Siege Survival: Gloria Victis Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be4/be4c22ec629553634fb23fc601246ac9.jpg","description":"WISHLIST THE FULL VERSION OF THE GAMEhttps://store.steampowered.com/app/1167140/Gloria_Victis_Siege_Survival/\nEXPLORE THE WORLD OF GLORIA VICTIShttps://store.steampowered.com/app/327070/Gloria_Victis_MMORPG\nAbout the GamePLAY THE PROLOGUE!\nThe Prologue is a free standalone version of Siege Survival: Gloria Victis, a survival resource management game in the style of This War of Mine, set in the medieval world of Gloria Victis. The prologue shows the origins of the invasion and gives a quick and thorough overview of the game's mechanics, but it also let you try out multiple tactics and make various important choices. Prepare yourself for having to choose who's not going to be well-fed: your civilians, soldiers, or maybe animals? Also, depending on how you progress while scavenging, you can join another survivor to your group, or trade with a helpful citizen taking care of the wounded soldiers.\nThe choice is yours!THESE WALLS CAN’T FALL\nYour homeland is drowning in war and chaos. As a group of civilians trapped under siege, you’ll face the ordeal of surviving the invasion. Though you do not participate in the fighting, the castle’s fate is in your hands.\nSupport the last soldiers standing against overwhelming enemy forces. Craft supplies and manage your resources during the day, and scavenge through the fallen city during the night. You must stand until the rescue comes!ENDURE THE SIEGEYou must support the soldiers with weapons and provisions. The wounded and sick also demand your care. But your resources are limited. You must find ways to preserve food, and develop your infrastructure to use your supplies more effectively.\nSCAVENGE THE FALLEN CITYTake the risk of sneaking into the fallen city plundered by the invaders. Under the cover of the night, you can find precious resources, trade with scavengers and other low-lifes, and help the surviving citizens – or exploit them. But be careful, enemy patrols keep watching the streets. You’re no warrior, so a fight is always the worst option. You must be smart to remain unseen... and alive.\nMAKE DECISIONS, FACE THE OUTCOMEIn a war like this, one dilemma might lead to another and no decision is clearly good or clearly bad. One person’s survival may come at the cost of another’s death, no matter if he’s friend or family. Sacrifices must be made – with no guarantee they’ll pay off. In these desperate circumstances, however, survival means more than just staying alive, as morale is paramount. When you have to choose between sustaining the soldiers’ strength and taking care of your own survival, what will you sacrifice?\nYOUR BACK AGAINST THE WALLA messenger had cut through the enemy lines to bring back reinforcements, but it will take weeks before help arrives. You’ll face hunger, wounds, diseases, and despair – but also the growing tensions between the civilians and the last defenders of the city. The soldiers won’t hold for long without your support and if the defense falls, the invaders will have no mercy. The odds are against you – what will you do to survive?\nTELL YOUR OWN STORYSiege Survival: Gloria Victis is developed on a game editor platform we created with the goal of sharing it with the modding community along with the game itself – at the release if possible, or later as a free DLC. It will allow you to create new scenarios for the game from scratch and expand the universe of Gloria Victis with your own unique ideas and stories!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"FishTankStudio","platforms":[{"id":0,"name":"PC"}]},{"id":341619,"name":"Spirit Hunter: Death Mark","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4be/4be4860cce1f8bb67fa0263b32c0760b.jpg","description":"You have been Marked...\nA strange rumor is spreading through the shadows of Tokyo's H City: a mysterious disfigurement, like a grotesque birthmark, has been appearing on the bodies of certain individuals. Anyone who receives the Mark will rapidly die of unknown, horrifying causes.\nDeprived of your memories, you arrive at a mansion rumored to protect the bearers of the Mark. As the doors swing open, the countdown to death has already begun...\n1 player\n4GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©Experience. Licensed to and published by Aksys Games.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Aksys Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":297249,"name":"Lust from Beyond","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/298/29871aed83995d07b587635e6921ed1a.jpg","description":"Lust from Beyond is a psychological horror with occult and erotic themes. The game creators are Movie Games Lunarium, developers of Lust for Darkness - the game that proved it is possible to create a liaison of erotica and horror. Now, thanks to the experience gained in the previous production, Movie Games Lunarium is returning with Lust from Beyond, opening the door to a realistic world full of desire, fascination and fear.\r\nVictor Holloway, an antiquarian, is tormented by visions of a sinister land full of lechery and pain. To learn its secrets, he joins the Cult of Ecstasy, whose members seem to know the answers to his disturbing questions.\r\nVictor learns the cult's life from within, getting lost in its blasphemous and sexual customs. Pleasures of this world are soon not enough. The cultists, following Victor's visions, attempt to enter Lusst'ghaa - the Land of Ecstasy beyond the borders of our reality.\r\nBold erotic themes adapted to horror conventionGameplay from the point of view of an occult sect's memberWorld inspired with the works of Lovecraft, Giger and BeksińskiExploring a graphically advanced environment, full of interactive itemsIngenious puzzlesRunning from, and even fighting otherworldly monsters!Rich sound and music design\r\nCan't wait for Lust from Beyond? Don't miss the upcoming kickstarter campaign, during which you'll have a chance to play an exclusive demo!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Movie Games Lunarium","platforms":[{"id":0,"name":"PC"}]}]