[{"id":16515,"name":"Sunrider: Mask of Arcadius","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4b/f4b4e4b696bc03f059c6d79b4995824d.jpg","description":"As Captain Kayto Shields, embark on a galactic voyage of heroism and survival. With his home world destroyed and his nation conquered, the inexperienced Captain Shields, and his newly minted vessel, the Sunrider, are left as the only hope against a galactic evil intent on subjugating all sentient life. Together with his loyal First Officer, he undertakes to find allies across the stars to retake his home planet and restore peace to the galaxy. Sunrider: Mask of Arcadius is the second installment in the Sunrider trilogy, which includes all of the content of First Arrival. Save the galaxy in this epic adventure through the stars!Features\nYour homeworld conquered, your mission is to gather a team of pilots for your mecha squadron. Build your relationship with your allies by interacting with them between battles. Find out your squadmates’ back stories and help shape their destinies.\nManage a squadron of mechs and your own assault carrier. Victory on battle depends on proper allocation of funds between researching new technologies, purchasing better weapons, and balancing limited funds between mechs to suit your play style.\nCommand your forces in turn-based tactical missions. Properly manage each mechs’ strengths and weaknesses to maximize your offensive capabilities and minimize casualties.  Each mech has a suite of unique weapons and equipment which gives every pilot a unique battlefield role.\nTravel through the galaxy on missions and fight the enemy throughout the stars. Explore a deep world with a history spanning thousands of years.\nHigh technical graphics show off extreme detail and stylish mecha action.\nThe story of Sunrider features the greatest elements of space opera – huge space armada battles, political intrigue, moral decisions, and romance. Experience the vast scale of Sunrider!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Love in Space","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4148,"name":"Zombie Driver HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d4/3d48e2f29341c31e69f80d107d0a1871.jpg","description":"Zombie Driver HD is a single-player action game, combining elements of shooter and racing. The events set in a zombie apocalypse environment. \n\n###Modes \nThere are three game modes. The first one is a classical story mode.\nYou play as a taxi driver, who is doing his work when the virus appears. You need to get to the military checkpoint, where you have to complete different missions: picking up survivors around the city, transporting something or even killing. You have to fight with the bosses – substantial mutated zombies. In the second mode, Blood Race, the player enters the brutal race. You can chase the cars and take them down. There are three distinct game types: classic race; eliminator, where the player needs to take down cars as many as he can; the endurance, in which you need to race with a ticking bomb in your vehicle. The last one is Slaughter. You try to survive on different arenas as long as you can. \n\n###Gameplay \nAs for the vehicles, there are 13 types of driving. It includes a fire truck, bulldozer, and tank.\nEvery vehicle feels different, so you can taste it and choose the most convenient one. Upgrading the vehicle on the fly is possible. The game offers the variety of weapons. You can burn zombies with flamethrowers or attack with the launcher. You fight with crowds of zombies at a time, especially in the Slaughter mode. The types of enemies can be unusual: there are zombies dogs, for instance. Medical drops, scattered around the city, can help to manage your health.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Exor Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9538,"name":"theHunter: Call of the Wild","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e6f/e6fed89f004972a1967e181fe63e78b0.jpg","description":"theHunter: Call of the Wild offers the most immersive hunting experience ever created. Step into a beautiful open world teeming with life, from majestic deer and awe-inspiring bison, down to the countless birds, critters and insects of the wilderness. Every inch of the 50-square mile world is crafted using Apex, award-winning technology crafted by Avalanche Studios during a decade of developing explosive action games. In addition to its rich single player experience, theHunter: Call of the Wild offers unique multiplayer options – cooperative and competitive – for up to 8 players. Share the ultimate hunting experience, and earn those bragging rights!KEY FEATURES:\nA Next-Generation Hunting Experience.\ntheHunter: Call of the Wild offers the most immersive hunting experience ever created. Step into a beautiful open world teeming with life, from majestic deer and awe-inspiring bison down to the countless birds, critters and insects of the wilderness.\nExperience complex animal behavior, dynamic weather events, full day and night cycles, simulated ballistics, highly realistic acoustics, scents carried by a sophisticated wind system, and much more. All systems work together to increase immersion and bring out the hunter in you.\nExplore a Vast Open World. By Foot or ATV.\nExplore 50 square miles of varied terrain, ranging from wetlands and dense forests to lush valleys and open farm fields. The vast world of theHunter: Call of the Wild is split up into separate and distinct hunting reserves, each one filled with surprises and memorable moments.\nTake on missions and challenges from the locals, or go off the beaten path. Discover lookouts, hunting towers and outposts. Tired of walking between your hunts? Get the ATV Saber 4x4 (optional paid DLC) and drive around! This capable vehicle will carry you across rough terrain at breakneck speeds. Exploring the open world has never been more fun.\nA Decade in the Making.\ntheHunter: Call of the Wild is the evolution of theHunter, Expansive Worlds’ stand-out hunting game, with over 6 million registered players and 7 years of live operations.\nAvalanche Studios and Expansive Worlds bring hunting to a new generation of players. theHunter: Call of the Wild is built using Apex – Avalanche Open World Engine, award-winning technology crafted during a decade of developing explosive action games.\nBecome a Hunter. Design the Hunt.\nAcquire and equip a range of rifles, handguns and bows and customize them with scopes and different ammunition types. Find and master your favorites. Practice and steady your aim at the shooting range. Develop your character by unlocking various skills and equipment. Learn how to use callers and scents, but above all else, study your prey: pay close attention to animal behavior, traits and patterns of movement.\nNew to hunting? Not a problem. Intelligent systems will aid and assist to make sure you get the most out of your hunt, whether you’re a hopeful novice or grizzled veteran.\nShare Hunting Experiences. Earn Bragging Rights.\nIn addition to its rich single player experience, theHunter: Call of the Wild offers unique multiplayer options. Join up to 8 friends (or complete strangers!) in cooperative and competitive modes. Enjoy a wide range of in-game challenges and events. Hunting is more rewarding and exciting with friends, so share your experiences and earn those bragging rights.\nHead out with your friends using ATVs. Moving between hunting spots on four wheels is fast, easy and most importantly – a lot of fun. Besides, after a long day of hunting, no one is going to turn down your invitation for an impromptu off-road race!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Expansive Worlds","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16255,"name":"Edna & Harvey: Harvey's New Eyes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8b/a8be747402ff458ca85fcca3038cd21c_8t0MBsj.jpg","description":"Edna & Harvey: Harvey's New Eyes is a point-and-click adventure made by Daedalic Entertainment. It is the second installment in the self-titled series, preceded by Edna & Harvey: The Breakout released three years prior — in 2008.\nBoth games' setting is the 2D comic world. The game design feature of the game is an absence of bars with the actions, usually to the genre. Gameplay only allows speaking with the other characters, choosing the corresponding emotional reaction (much like a dialogue wheel in Mass Effect series) and connect objects within the inventory. \nThe story follows Lilli — the protagonist of the game. The setting is the female school in some Abbey. After the news of a probable brainwash, the main character and some other pupils decide to expose corrupted school officials. The story, like this, tracks themes of a problematic youth, father-and-son issues, and adolescent disobedience. The game features three endings: the player is free to choose any one with their choices not affecting the outcome.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":10520,"name":"World of Guns: Gun Disassembly","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/794/7943eb38a763c014c84ddae7378b865c.jpg","description":"World of Guns: Gun Disassembly is a sandbox puzzle game based on disassembling real-world guns and other mechanisms. \n\n### Gameplay  \nIn World of Guns, the player can assemble and disassemble numerous weapons and mechanism in the 3D environment. All the models are accurately recreated using original weapons and technical documentation. They include even the smallest details and let the player explore the inner mechanisms. All models come with detailed descriptions so the game can serve as an interactive encyclopedia. Additionally, the game features shooting ranges with timed objectives. \nThe game offers several game modes: free learning of any weapon or disassembling/assembling by memory or against the clock. The results can be uploaded to the online leaderboard. \nThe game’s models catalog includes more than 190 models of firearms, automobiles, aircraft, and motorcycles. Developers continuously increase the number of models available in the game. \nWorld of Guns is a free-to-play game. Initially, most of the models are locked. To unlock them you can spend in game-currency, which you get from completing challenges or via microtransactions. There are several DLC packs with exclusive models. Some of them even include animals and dinosaurs skeletons.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Noble Empire","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17698,"name":"King's Bounty: Armored Princess","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c7b/c7b096cd3105533133e3ae6ed3a9214d.jpg","description":"King’s Bounty: Armored Princess is a real-time strategy game, serving as a direct sequel to King’s Bounty: The Legend, and based on an older series of King’s Bounty.  The game is set first in the fantasy world of Endoria, same as the predecessor, and then swiftly transfers to the world of Teana, where the main events occur.\nThe protagonist has a task of finding the legendary knight of her kingdom, the previous game’s main character, to save her besieged world. Role-playing elements of the game include three different classes for your hero, a different companion, which provides help in battle, and inventory system which affects your gameplay by adding various excellent or dangerous situations.\nThe art style of the game is reminiscent of fantasy-themed cartoons, but it also makes every character in the game unique and distinct, with almost no animation repetitive or texture getting overused. The soundtrack adds to the immersion in the fantasy battles, providing a mood for every location and making a significant impact on the playthrough.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Katauri Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17713,"name":"Gun Monkeys","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35f/35f508784c30d59edb3d51e7e706b12e.jpg","description":"Gun Monkeys is a side-scrolling shooter video game which only has a multiplayer mode. The gameplay of this game is well-known for its greatness yet lots of reviewers criticized the difficulty of finding other players in the online multiplayer mode. \nIn the game players control monkeys with guns who have to compete against each other. The arenas of the game are procedurally generated and contain environmental hazards. Due to problems related to finding other players in multiplayer mode, Gun Monkeys was removed from Steam. \nGun Monkeys was originally released at a price of $9.99 yet later due to various problems, the price was dropped to $5.99 and was bundled in a pack of two games from which one was as a gift for a friend. \nThe reception from critics for the game was mixed. Almost everyone praised the gameplay aspect of it, saying that it is simple yet skill-heavy and tactical and basically a fun experience.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Size Five Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10261,"name":"Homeworld Remastered Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fa/8fa13bde20f4a6737145462ec3d0565e.jpg","description":"Homeworld Remastered Collection is a remastered collection of real-time space strategies Homeworld and Homeworld 2 including all their expansion packs developed by Gearbox Software. \n\n###Plot\nFor eternity, the people living on Kharak were certain, that this planet is not their homeworld. There was a Question of Origin, which could not be answered by any scientific research. A spaceship crashes on the planet's surface. A Guidestone and a hyperengine were discovered. The people of Kharak unite to build a spaceship and set off to find their true origin.\n\n###Gameplay\nHomeworld is a real-time strategy, which takes place in space. Like in most strategy games, the gameplay focuses on gathering resources, building armies, and using them to annihilate the enemies or complete tasks. There are both singleplayer and multiplayer modes available to the players.\n\nThe singleplayer campaign consists of a number of levels. On each level, the players have a primary objective with several side-quests which can change as the mission progresses.\n\nThe main ship of the fleet serves as a mothership, which can build other ships. The mothership cannot move. There are immovable objects on every level, which can be mined using special ships that will take the ores to the mothership. These resources are later used to build new ships, such as miners or attack vessels. \n\n###Remastered Edition featured\nThe gameplay was left untouched by Gearbox Software. Only the graphics and the UI got heavily refined.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Aspyr Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16466,"name":"Relic Hunters Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b7/4b7e3a11b7c89ff12b3861e3a7b4b97c.jpg","description":"A surreal game about shooting evil ducks and turtles, created by two developers. The game is available for free to all Steam users, and its source code is publicly available as well. Developers urge users to develop the game with them.\n\nIn the far side of the Galaxy, Duke Ducan, the head of the Ducans, pursued the Asteroid Dungeon Nemesis in search of powerful Relics. The player gains control of Spaceheart and his squad, who lands on an asteroid for the same purpose - to get powerful artifacts. The story missions tell about the team's progress from planet to planet in search of Relics and trying to get rid of Ducans.\n\nThere are six characters available in the game, and there is also an ability to complete the story campaign in a local cooperative mode. In Adventure Mode there are 12 levels available, as they pass, new characters, weapons, and items will unlock. Endless Mode is also available, with its unique mechanics.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rogue Snail","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17564,"name":"Shadowgrounds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/550/550a1374bf25a545fb5ef67c08a64ad7.jpg","description":"Shadowgrounds breathes fresh air into the action genre with explosive combat sequences, an innovative weapon upgrade system, and an intriguing storyline. The adrenaline-pumping, top-down gameplay and audiovisual fireworks set the scene for this new action experience which also includes single computer (split keyboard or joystick) co-op play.\nUPGRADE THOSE WEAPONS! Use a devastating arsenal of high-tech weaponry to dispose of the alien threat. Each weapon has multiple upgrades that maximize the carnage. Unleash the flames of the Flamethrower's Fuel Trap, cause mayhem with the Grenade Launcher's Poison Grenades, slash and dice the monsters with the Laser Rifle's Pinpoint Laser - and many more!\nWHAT LURKS IN THE SHADOWS? Shadowgrounds uses cutting-edge realistic lighting and glow technology to light up the battlefield and create detailed shadows producing an atmosphere of fear. But the lighting and the flashlight also affect some aliens' behavior - take advantage of that and you can turn the tide in the game of fear by using your flashlight effectively.\nDESTRUCTIBLE ENVIRONMENT! What good are weapons and special effects if you can't wreak havoc on the environment? Shadowgrounds lets you go all-out - glass shatters, ground shakes, trees fall, barrels explode and furniture blows to smithereens. You can use the environment to your advantage.\nTHEY'RE BIG AND NASTY! Big, brutal monsters await you. Prepare to face many different bosses who will do anything to stop your journey. They're nasty, blood-thirsty beasts, but don't give in to fear - remember to use the environment and the lighting to your advantage!\nUpgrade weaponry with powerful modifications.\nFace enormous monsters in boss battles.\nDestructible environment allows you to wreak havoc with your arsenal.\nVisit many exciting locations, including a secret military base and the alien-infested colony New Atlantis.\nFight side-by-side with NPC allies against the massive alien hordes.\nCheck security cameras and computer logs to investigate alien origins.\nRealistic lighting with gameplay effects bring the aliens out of the shadows.\nEnjoy horrifying sound effects and a thrilling music soundtrack made exclusively for Shadowgrounds.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Frozenbyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16683,"name":"Zeno Clash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f4/3f4124c8bb3e3b8ec6b70b9a5ce493ac.jpg","description":"Zeno Clash is an action/fighting game set in a punk fantasy world. The game is played from a first person perspective and the combat is generally up close and brutal.\nExperience a deep storyline set in a fantastic world. Play the role of Ghat, a man banished by his own brothers and forced to begin a desperate journey past the forbidden desert and to the end of the world.\nNominated in 'Excellence in Visual Art' at the Independent Games Festival, the original visuals, which make full use of the Source engine features, breathe new air in the fantasy game genre. The new close combat mechanics are also a deviation from traditional action in the first-person genre that will feel fresh for new and veteran players.\nEngaging melee combat in first person\nThe new melee combat system allows players to perform a variety of movements like deflect & elude combos, knockback finisher punches and punishing grab attacks. Learn new attacks as the game progresses and confronts you with more formidable foes.\nFantastic visuals powered by the Source engine\nPlayers will be immersed in a fantastic world, beautiful and disturbing at the same time. The unprecedented art style brings a fresh new approach to the first person genre. The surreal environments and characters will keep players wanting to discover more.\nSurvival mode challenges\nJump right into the action in engaging unlockable \"tower challenges\". The player must overcome enemy waves to progress through the tower levels. The game will rate the player in different categories like speed and performance. A leaderboards system will rank you against your friends, so the challenge never ends.\nDeep storyline\nPlayers will play the role of Ghat; the son of a impressive hermaphrodite creature called Father-Mother, whose children form the most powerful clan in the city of Halstedom. Ghat must escape from his family and start an incredible journey with his female companion Deadra, who will aid him in the dangerous lands of Zenozoik.\nBizarre weapons\nThe game features an unusual arsenal of eccentric weapons that are built from scraps and junk. Hammers and clubs will be the most effective when fighting heavy characters that can only be brought down with extreme force.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"ACE Team","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":4465,"name":"Worms Ultimate Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa7/fa7cd93b815b298dd0efa829b98a2aa6.jpg","description":"A series, that brought players several notable titles, was mostly set in 2D because artillery turn-based games have a set of mechanics that compliment the closed maps and complicated terrain. But Worms Ultimate Mayhem is a modernized remake of the different direction, taken by the Team 17. This game is a direct remake of Worms 4: Mayhem, expanding the movement mechanics to the 3D environments.\nWorms Ultimate Mayhem adds several features to the typical Worms gameplay. Each player controls a team of 4 or fewer worms and can control one worm at a time, moving around, using items and attacking in a set amount of time. Then after each player moved and attacked in turn with all of their characters round starts over, and the game goes until only one player or a team left. There’s an option for players to play a single player campaign and challenges, from the previous Worms 3D games, or a match against bots with an improved AI. But any Worms have multiplayer modes, both local and online, with ranked matches. Each worm team can be customized with names, voices, hats, signature weapon, taunts and tombstones. Added in-game voice chats and real-time lighting, shaders and post process effects are adding to the improved design and comfortability.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":22844,"name":"Treasure Adventure Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8d/b8dea961327394025d64ddcd90abfe84.jpg","description":"Treasure Adventure Game casts you in the role of a young boy who lands on an island that is a fragment of what was once a continent, destroyed in the war between a demon and a wizard. You accept quests, travel across the oceans, and generally have a bang-up time of being a little boy in a big world, out there looking for treasure and adventure. Your equipment consists of a hat, a parrot, and a boat that appears whenever you touch water.\nPuzzle-platformer with a huge, open world to explore\nMeet mysterious other-worldy beings, and find multiple endings\nDiverse environments with changing weather and NPCs that are react accordingly\nOriginal music that changes with the background and creates an enchanting mood\nTreasure Adventure World is an HD reimagining of Treasure Adventure Game:\nhttps://store.steampowered.com/app/268770/Treasure_Adventure_World/","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Robit Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2760,"name":"BIT.TRIP Presents... Runner2: Future Legend of Rhythm Alien","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/695/69511e8a8ec8edf9b85c3e68190844a4.jpg","description":"Runner2 is the sequel to the critically acclaimed and IGF award winning BIT.TRIP RUNNER.\nIn the style of the BIT.TRIP series, Runner2 is a rhythm-music platforming game.\nPlayers will run through fantastic environments, using brand new moves, to brand new soundtracks as they run, jump, slide, kick, and soar toward the goal of tracking down the Timbletot and thwarting his evil plans to destroy not only our world, but every world there is.\nRunner2 features 5 exciting worlds, 120 tantalizing levels and 5 death defying BOSS battles! Play as 8 different characters - find secret areas to unlock new and zany costumes!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Choice Provisions","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":1430,"name":"The Final Station","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/acb/acb4f324aeb126cf5816ea0f4a9d8325.jpg","description":"The Final Station is an action-adventure game developed by Do My Best Games.\n\n###Plot\nIt is 2059, 134 years after the First Visitation when UFOs crashed on Earth and began infecting humans creating zombies. With many countries destroyed, humankind was able to repel the attack at a large price. A united government is formed, migration to unaffected regions takes place. Life slowly comes back to normal. Railroads become the main transportation method, connecting the last remaining cities. The unnamed main character works as a train driver. After he finished the delivery of special cargo, the Second Visitation begins. \n\n###Gameplay\nThe Final Station is a two-dimensional pixelated game that focuses on survival and resource management. The main objective of The Conductor is to reach his home to protect his daughter. The players arrive at numerous stations on their journey to look for fuel, food, and ammunition. The survivors of the Visitation can also be found at the station and be taken with you on the train.\n\nWhile the players travel to other stations, they can interact with the survivors they had picked up. They may request food, medicine or offer a quest upon talking to them. These survivors will walk off your train when they reach their destination. \n\n###The Only Traitor DLC\nA DLC was released for the game. It offered a different plot perspective, new enemies and instead of driving a train, the main character drives a car.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":39039,"name":"God of War III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/289/289951d92239d05f2a663d632aa3888a.jpg","description":"The final part of the original trilogy about Kratos, who is on the mission to revenge his loved ones and who killed the god of war and took his place. The game is exclusive for PlayStation 3 and 4.\r\n\r\nGod of War III is a typical action-adventure slasher. The game is the seventh in the series, it is a direct continuation of God of War II story. The main elements of the game are borrowed from ancient Greek mythology. The player controls Kratos - who lost his place on Olympus this time. Together with the goddess of the land of Gaia, he climbs Mount Olympus to defeat Zeus but fails and thrown into the waters of the River Styx. The plot narrates about the ascent of the main character back to the tops.\r\n\r\nFrom the gameplay point of view the game is not much different from the previous parts. This is also an action packed third-person slasher with RPG elements and handcrafted cinematics. In the hands of Kratos, two blades, whose possibilities can be improved for in-game currency, other weapons will be available as the passage progresses. All levels of the game end with boss battles with heavy use of Quick-Time-Events.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"SCE Studios Santa Monica","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":16700,"name":"The Night of the Rabbit","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a16/a165c67bb75b40b5f8a310c55e9d34de.jpg","description":"###The secret formula\nThe game - developed and published by German studio Daedalic Entertainment for Microsoft Windows and OS X in the spring of 2013. In the last days of the summer holidays, twelve-year-old juggler Jerry Hazelnut finds a recipe for a secret formula with which can create a carrot flame. Mixing all the ingredients, Jerry stumbles upon mysterious suitcase. Inside is a magic wand and hat, which later turns into a white rabbit. His name is Marquis de Hoto, and he tells Jerry about the existence of an infinite number of parallel universes.\n\n###Key features\nThe gameplay is based on the basic principles of point-and-click adventure games: the player controls the main character with the mouse, manipulates objects from the inventory and tries to solve with their help puzzles. The items can be used by themselves or mixed before use. Jerry has a special coin that can find hidden magic. Its usage also highlights all usable objects on the screen which significantly simplifies the game. In addition to other items, on the game levels are scattered collectibles, like stickers and audiobooks. They almost do not affect the gameplay, but by collecting them, the player can get an achievement on Steam and some information about the game world.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":327260,"name":"Twelve Minutes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f8/0f808c8ecd5134e76d0a60570f66e56a.jpg","description":"TWELVE MINUTES is a real-time top-down interactive thriller with an accessible click and drag interface.\n\nWhat should be a romantic evening with your wife turns into a nightmare when a police detective breaks into your home, accuses your wife of murder and beats you to death...\n\nOnly for you to find yourself immediately returned to the exact moment you opened the front door, stuck in a TWELVE-MINUTE time loop, doomed to relive the same terror again and again...\n\nUnless you can find a way to use the knowledge of what’s coming to change the outcome and break the loop.\n\nTWELVE MINUTES blends the dream-like tension of THE SHINING with the claustrophobia of REAR WINDOW and the fragmented structure of MEMENTO.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Netflix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":223331,"name":"The Walking Dead: Michonne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b30/b30d472a13528007721f4a236b04ae7f.jpg","description":"The Walking Dead: Michonne - A Telltale Miniseries stars the iconic, blade-wielding character from Robert Kirkman's best-selling comic books. Haunted by her past, and coping with unimaginable loss and regret, the story explores Michonne's absence between issues #126 and #139 of the comic book. In this three part miniseries, players will discover what took Michonne away from Rick, Ezekiel, and the rest of her trusted group… and what brought her back.\n***Save 20% on additional episodes in The Walking Dead: Michonne by purchasing the Season Pass [Episodes 2-3 bundle] via in-app in the 'Episodes' menu***\nMinimum specs:\nGPU: Adreno 300 series, Mali-T600 series, PowerVR SGX544, or Tegra 4\nCPU: Dual core 1.2GHz\nMemory: 1GB\n- - - -\nExamples of supported devices include:\n- Galaxy S5 and up\n- HTC One (M7)\n- LG G2/G2 Mini and up\n- Motorola Moto X\nExamples of unsupported devices include:\n- Galaxy Tab 4 and below\n- Galaxy S5 Mini and below\n- Nexus 7 2012\n- Droid RAZR","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Telltale Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":60817,"name":"Forager","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/467/467ec166bdb3c8f8232e205047194dba.jpg","description":"YOU WERE ASKING FOR MORE FORAGER...Originally made for a jam (in which Forager won second place!), over 100,000 players tried and LOVED the prototype! You were all asking for MORE FORAGER, so here it goes! A full 10+ hour experience for everyone on Steam!\nAfter a full year of development, the game on Steam features a TON of new content, systems, and exclusive features!\nNew lands and biomes (Deserts, Graveyards, Snowy Mountains, Volcanoes, and more!)\nCombat mechanics have been added! (Dungeons, Bosses, Raids, Night time invasions, etc).\nNPC interaction. Find quirky companions to trade or talk with.\nFarming mechanics, including caring for animals and the harvesting of all sorts of crops and herbs.\nArchaeology mechanics. Play as a professional secret-finder as you raid ruins, dig for artifacts and display your findings in your own museum!\nAlchemy & Rune Inscription mechanics. Allowing you to go all in on the crazy wizard fantasy, destroying big masses of resources with a single bomb or creating trees out of nothing with a powerful spellbook.\n16+ new skills to learn and master, in a free-form upgrade system that allows you to customize your experience as you see fit. This brings the number of skills up to 64 total, each unlocking new items, structures or gameplay modifiers!\nRandom events have finally been added!\nNew resources, objects, structures, animals, puzzles, secrets and more! More EVERYTHING!\nSteam only features!\nPATREON\nThis game will get FREE updates thanks to the generous support of my hundreds of patrons!\nAbout the GameForager is a 2D open world game inspired by exploration, farming and crafting games such as Stardew Valley, Terraria & Zelda.\nGather, collect and manage resources.\nCraft useful items & structures.\nBuild and grow a base out of nothing. Buy land to expand and explore.\nLevel up and learn new skills, abilities, and blueprints.\nSolve puzzles, find secrets and raid dungeons!\nAchieve anything you want! The choice is yours, you set your own goals to work towards!\nStart small and improve your base, skills, equipment, network of friends (and enemies!) and build your future as you see fit! You can play Forager in a very varied array of playstyles...BECOME... A GATHERERBECOME... A FARMERBECOME... A MERCHANTBECOME... AN ADVENTURERBECOME... A BUILDER","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":60545,"name":"I’m not a Monster","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0da/0da3910a656f417ef5853381b9f97e59.jpg","description":"Demohttps://store.steampowered.com/app/907290\nAbout the GameEach session features a group of up to six players, where every player is randomly assigned the role of civilian or monster, with a max. of two monsters.\nElaborate a team strategy, but don’t trust your teammates.\nSuspect everyone and question players’ every move as you narrow down the list of possible shapeshifters.\nSave as many passengers and kill as many monsters as you can.\nBut watch out: once infected by a monster, you have just a few moves to heal, otherwise you’ll become a monster yourself.\nMake the most of the loot from boxes around the starship: a combination of two weapons will give you a unique ultimate ability that you can use to turn the tide of battle.\nMake use of your disguised appearance.\nParticipate in the conversation to learn your enemies’ strategy and adapt to it.\nTake advantage of your species: you can see everything that your fellow monster sees.\nInfect the passengers to respawn if you are disclosed and killed.\nInfect the civilians to turn them into ones of your own.Each turn for civilians and monsters has two time-limited stages:\nPlanning Stage: players choose their actions;\nAction Stage: all planned actions are executed at the same time.If you’re reading this, you’ve already seen the trailer and screenshots. So, there’s really no need to say more. Go grab your copy and prepare for adventure!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cheerdealers","platforms":[{"id":0,"name":"PC"}]},{"id":18701,"name":"Supreme Commander","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bac/bac1670a3d55d603171224368cb8bed8.jpg","description":"The game was created by the man who also created the game Total Annihilation and in many ways embodies the same approach to the games of this genre.\nEarthlings have discovered the technology of instantaneous relocation to any other planet. This was the beginning of a process of large-scale colonization. Over time, the colonists wanted independence from earthlings, alien races were discovered, with which some earthlings entered into an alliance, while other earthmen learned symbiosis with artificial intelligence.\nFinally, the Earth was destroyed, leaving in the universe several opposing \"races\". And on every uninhabited planet, the struggle for resources can now unfold.\nThe main resources are two, Matter and Energy. To use resources, it is often important not to have a stock, but to achieve the inflow of both resources in a certain amount per second.\nThe new territory is thrown Supreme Commander - the key unit in the game. From it on the territory are distributed units with special functions.\nThe game allows you to instantly \"take off\" over the entire territory and view it all. Another function is to divide the screen into two parts. Dividing the screen into two parts, you can work with each part in the same way as with the entire screen before the separation - increase or, conversely, view from the height.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":1808,"name":"Door Kickers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37b/37b929f27906b62a0bdbb733b2cd0ce6.jpeg","description":"Door Kickers is a real-time strategy about SWAT operations, where each mission present players with a top-down layout of a map, covered in a fog of war. Commanding units with top-down perspective allow players to plan ahead and Players form a professional team with five different classes and can deploy up to ten operatives based on mission conditions. The game has more than 80 single missions, six multilevel missions, randomly generated missions, and community-generated content. \nMissions are based on different in-game objectives, from total elimination to saving a VIP and disarming bombs. Each mission will be rated after the completion with a three-star rating. On top of the actual missions, players can try out to complete challenges, like completing a mission with only a squad member or complete it with a perfectly executed plan. The difficulty arises with the fact, that enemy positions are switched every time mission starts.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"KillHouse Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":12250,"name":"The Dream Machine: Chapter 1 & 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0a/b0a14be9cf5547d82f079a5e988d0733.jpg","description":"The Dream Machine is an award-winning adventure game about dreams and voyeurism. It's built by hand using materials such as clay, cardboard and broccoli.\nIn Chapter 1 you play as Victor Neff, the husband in a young couple who've just moved into a new apartment.  While trying to get settled in you discover that all is not as it seems in the quiet, unassuming apartment building...\nIn Chapter 2, Victor goes to confront the landlord, Mr. Morton, only to find his apartment empty. Can Victor find the elusive landlord in time and is there more to Mr. Morton than meets the eye?Key FeaturesWorld: Explore a creepy apartment complex and uncover the mysteries within. Get to know your neighbors and discover their secrets.\nStory: Delve into the minds of strangers and loved ones as you’re trying to save them from The Dream Machine.\nGraphics: Wander around beautifully detailed environments built using physical clay models and hand-crafted sets.\nPuzzles: In order to progress you have to solve puzzles ranging from simple pushovers to fiendish brainteasers.\nMusic: A haunting original soundtrack weaves through the narrative, emphasizing the surreal atmosphere of the game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cockroach","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":473489,"name":"The Vanishing of Ethan Carter Redux","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/456/456490b36f6c929aa92b344282b34df2.jpg","description":"The Vanishing of Ethan Carter is a first-person story-driven mystery game that focuses entirely on exploration and discovery. It contains no combat or explosions of any kind. If our game leaves any scars, we hope you won’t be able to see them.\r\n\r\nYou play the game as Paul Prospero, an occult-minded detective who receives a disturbing letter from Ethan Carter. Realizing the boy is in grave danger, Paul arrives at Ethan’s home of Red Creek Valley, where things turn out to be even worse than he imagined. Ethan has vanished in the wake of a brutal murder, which Paul quickly discerns might not be the only local murder worth looking into.\r\n\r\nInspired by the weird fiction (and other tales of the macabre) from the early twentieth century, The Vanishing of Ethan Carter aims to significantly evolve immersive storytelling in games. While it features a private detective and quite a few mental challenges, The Vanishing of Ethan Carter is not an especially puzzle-ridden game. Our focus is on atmosphere, mood, and the essential humanity of our characters.\r\n\r\nStill, the discoveries won’t happen on their own, or without your help. Using both Paul’s supernatural skill of being able to communicate with the dead, and your own powers of observation, you will discover the mystery behind a trail of corpses, the roots of a dark ancient force lurking in Red Creek Valley, and the fate of a missing boy.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Astronauts","platforms":[{"id":0,"name":"PC"}]},{"id":14447,"name":"Poly Bridge","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ac/2ac6f80402afe5afddcebb8d8b0780c4.jpeg","description":"Poly Bridge is an indie puzzle building-based game developed by Dry Cactus.\n\n###Gameplay\nIn Poly Bridge, the players have to build a bridge across a river. The bridge has to be strong enough for several vehicles to pass it, let alone the bridge has to hold its own weight.\n\nThe game does not disable physics after the player is finished with building up the bridge, as each vehicle present in the game has its own weight and length, so the player-built structure has to be adaptive in some cases. For example, long vehicles, such as cargo trucks, will not be able to ride on steep constructions, so the bridge has to adjust itself based on the weight of the vehicle. \n\nThere are also several obstacles for the player-built bridges present in the game, as sometimes a boat can spawn on the level and try to swim under the bridge. Storms are also a vital part of the gameplay, as the players have to also take into the amount the power of wind and adjust their creation as well.\n\nThe main catch of the game is that the players do not have unlimited resources, so they will have to make the best out the things at hand. Several types of materials are present in the game with each material having a certain amount of strength. The river gets wider and wider as the player progresses through the game, as well as the number of vehicles that have to pass the bridge for level completion.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dry Cactus","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":16263,"name":"Commandos: Behind Enemy Lines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/253/2539258054a5e134aec9a75fc1da7ad7.jpg","description":"The first game in the Commandos series.\nThe action takes place during WW2. The player commands a detachment of saboteurs.\nThe game offers twenty missions. In each mission you need to perform several tasks - destroy the bridge, headquarters, military equipment, enemy commander, save someone from captivity. Different weapons are used for different tasks. Sometimes it is necessary to use pre-captured enemy equipment, including tanks and a submarine. Locations are diverse: Norway, Germany, France, Libya, Tunisia and others.\nThe group acts in the deep rear of the enemy. This means that the number of enemies is always much greater than the number of our soldiers and we have to act secretly. To let the enemy find us means to fail the mission and doom the squad to perish.\nThe group includes fighters who can do a lot of things: climb walls, control land and sea transport, shoot sniper weapons, fight with harpoon, use mines and syringes with poison.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"}]},{"id":22853,"name":"Worlds of Ultima: The Savage Empire","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/792/79204e34ab11b16bf3851d5f1ab8d83c_FfMnNYv.jpg","description":"You, the Avatar, have been transported by your Moonstone to the primitive and savage world of Eodon. There, you must work towards uniting the native tribes to face a common threat: a race of gigantic ants known as the Myrmidex. You won’t be alone, however, as you will be assisted by Professor Rafkin, ace reporter Jimmy Malone, and the exotic jungle princess Aiela. Take control of strange and powerful shamanistic magics and confront a varied bestiary that includes vicious dinosaurs and even mad high priests.\nWorlds of Ultima 1: Savage Empire was built using a modified Ultima VI engine; it’s familiar to long-time fans but it’s also a great starting point for people who are new to the world of Ultima. Featuring a text-based conversation system along with turn-based combat, Worlds of Ultima 1: Savage Empire should find a permanent space on your hard drive.Journey to a fierce jungle where savage dinosaurs, stone-age tribes, and mad scientists make their home!\nA highly interactive world where you can harvest plants, gather minerals, and craft items from gathered materials.\nAn old-school RPG in the tried-and-true Ultima tradition.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Origin Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16144,"name":"Dungeon Siege","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d79/d790c12a425f81fa079b973e5f8814d0.jpg","description":"Dungeon Siege is an action RPG developed by Gas Powered Games. It is the first title in the series.\n\n###Plot\nIn the fictional Kingdom of Ehb, a farmer sets out to another village to warn its residents about the invasion of the Krug. The story unravels rapidly, and the players have to save the whole kingdom.\n\n###Gameplay\nDungeon Siege is played from a top-down third-person perspective. At the beginning of the game, the players create a character to play as. On his way, the main character finds new comrades that can join his party. Seven other characters can join the player's party and are controlled by the artificial intelligence. The players can switch between the characters in this party at any gameplay moment. \n\nThe game features a seamless open world. The players encounter numerous monsters on their path, and their party defends themselves. There is no character class system in the game. Instead, if the player uses a certain item for a long time, their handling skill of it will increase. Such a system was later implemented in The Elder Scrolls IV: Skyrim. After leveling up, the players gain a base stat increase. \n\nThe game features an inventory system, represented as a grid, where the items take space and can be rotated and placed differently in the inventory to save some space. \n\n###Multiplayer\nThe game features a cooperative experience for eight players. It is possible to play through the game's main storyline or engage in a horde mode on a specific multiplayer map.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":35519,"name":"Dungeon Siege 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e6a/e6a840ae2e65dae347529b603bf15ea2.jpg","description":"The game combines the genres of Action / RPG / Hack and slash. Dungeon Siege II is part of the Dungeon Siege series.\n\n###Dungeon Siege Series\nThe series began with Dungeon Siege, there was the addition of Dungeon Siege: Legends of Aranna, followed by the full continuation of Dungeon Siege II with the addition of Dungeon Siege II: Broken World, an independent game of Dungeon Siege: Throne of Agony (for PlayStation Portable) and the game that completed trilogy - Dungeon Siege III.\n\nThere is a trilogy of movies released on the plot of this series of games.\n\nThe first game and the setting of the entire series\nIn the first game, the action takes place in the fictional \"medieval\" kingdom of Abe. The player controls the farmer, who must warn the nearby city of the invasion of enemies.\n\nIn Dungeon Siege there are no levels and missions, the player travels the game world, fights against enemies, recruits supporters to his team and controls the tactics, weapons and magic of all team members.\n\n###New Horizons in Dungeon Siege II\nThis game is based on a plot from ancient times of the same world.\n\nOnce the two most powerful creatures of the world, Azunai and Zaramoth, fought with each other, and each had a powerful magical artifact. When the sword struck the shield, it split, and this caused a worldwide cataclysm.\n\nThe sword is now in the hands of the warlord Valdis, fighting on the side of the Dark Wizards.\n\nThe hero of the game and his friend Drevin were mercenaries in the army of Voldis, but after one successful operation, Valdis destroyed all the mercenaries. Drevin died, but the hero managed to survive.\n\nNow the hero fights against Valdis, overcoming a variety of obstacles. But his main task is to pick up the pieces of the shield of Azunai - and now the shield can become more powerful than the sword of Valdis-Zaramoth.\n\n###Gameplay\nThe gameplay of the second part is somewhat different from the first. Between cities there are now teleports, and equipment acquires additional properties with a successful selection of the kit.\n\nFor the team, the hero can, as before, invite a variety of characters, and in addition - pets. Now the pet can be a full-fledged fighter, a creature with magical abilities.\n\nChanges have been made options for pumping characters and battle management system.\n\nIn the game for the first time in the series there are gifts - superpowers that can help if conventional means are not sufficiently effective.\n\nMagic in the game is divided into the \"magic of nature\" and \"combat magic.\" The Nature Mages use healing and protective spells, summon magical creatures and use the magic of cold. Combat Mages inflict damage to the enemy with the magic of fire, lightning, death, curses. They can also summon magical creatures - with the appropriate tasks. Each magician can also impose auras of improvement (\"buffs\") and deterioration (\"debuffs\") on himself, his team or enemies.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"PC"}]},{"id":9969,"name":"App Game Kit: Easy Game Development","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49d/49dae660a0fc843b23d63af8ce34e33c.jpg","description":"App Game Kit is a powerful game development engine, ideal for Beginners, Hobbyists & Indie developers. Now anyone can quickly code and build apps for multiple platforms using AppGameKit's BASIC scripting system. With just a few commands you can have demos/games up and running on mobile devices. Bob Duffy, Developer Relations Intel Corporation, said “AppGameKit is a great cross platform development tool. It allows developers to quickly optimize and compile apps.”\nGames can be developed and deployed to your chosen mobile devices for rapid prototyping. AppGameKit does all the heavy lifting for you - making it easy to code, compile and then export apps to each platform. All you need to focus on is your game/app idea. It's that simple!\nAppGameKit also caters for more seasoned developers, allowing you to use the AppGameKit C++ libraries and benefit from all the features of AppGameKit's core game engine. A great example of this Echoes+ developed by Binary Zoo and now FREE to download on STEAM;\nhttp://store.steampowered.com/app/338000/Features\nPlatforms\nYou can create games with AppGameKit on Windows, Mac or Linux devices. The games you make with it can then be exported to run on;\nWindows\nMac\nLinux\niOS\nAndroid (inc Google, Amazon & Ouya)\nHTML5\nRaspberry Pi (free from TGC website)\nAppGameKit IDE\nCross platform Geany editor\nIntelliSense\nCode folding\nColour schemes\nEdit multiple projects\nFast Compiler\nFull de-bugger\nBroadcast direct to device\nExport to exe, app, ipa, apk\nCommands\nAppGameKit has commands for all the important areas of game creation. These can all be called as BASIC commands or as library calls in C++ and XCode.\n3D Graphics\n3D Primitives\n3D Bone Animations\nShaders\nLighting\nRay Casting\nCamera controls\nMeshes\nFormats supported: .X .3ds .md3 .smd .md5 .lwo. .ac .b3d .dae .3d .lws .ms3d .blend .m3 .obj and .ago\n3D Physics\nCharacter controller\nRagdoll\nJoints\nRigid Bodies\nContact reports\nRaycasts\nPhysics world commands\nCompound collision shapes\n2D Graphics\nSprites\nParticles\nShapes\nText\nFonts\nTweening\nSpine support\nBlend modes\nImage formats: jpeg, png\nPhysics\nBox 2D collision\nRendering Control\nShaders\nRender to Image\nSounds & Music\nPlay sound files\nPlay music files\nSound formats: Wav\nMusic formats: Mp3, Ogg, M4a\nBlending Sounds\nChange sound pitch and balance\nUser Input\nMouse\nMulti Touch\nController support\nJoystick/Virtual Joystick\nKeyboard\nEdit box\nButtons\nMisc\nVideo playback\nNetwork (broadcasting, messages, shared variables)\nFile I/O\nHTTP\nMemblocks\nSensors\nGPS\nSocial feeds - Facebook & Twitter (iOS & Android)\nAdverts\nIn-app purchase (iOS & Android)\nGame Centre (iOS & Android)\nNotifications (iOS)\nRate this app (iOS)\nTime & Date\nCamera access\nQR codes\nZip archiving\nExtensive Help & tutorials","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"The Game Creators","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17703,"name":"Castlevania: Lords of Shadow – Ultimate Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa9/fa98d87e1aaf45cb7c9133be10d62bd7.jpg","description":"It is the end of days and ungodly powers isolate the Earth. The world's alliance with the heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow. Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil wreak chaos and death upon the living.\n\nGabriel Belmont is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny and hopefully salvation for the world.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PC"}]},{"id":14793,"name":"Hammerwatch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d0/7d0b195745242ae8916a49444d08e4e4.jpg","description":"Hammerwatch is a fast-paced hack and slash adventure game. It can be played alone or with friends, up to three people. \n\nAncient and mysterious Castle Hammerwatch, where a group of characters fight their way from floor to floor, to the very top of the castle. Thousands of monsters prevent the heroes from passing this path. Numerous puzzles require the heroes to find a solution. Secrets are waiting to be discovered. The ancient dragon awaits the heroes at the top. Heroes must not only kill the dragon, but also come back together.\n\nThe game includes a level editor which lets you build your own adventures or play levels created by other players.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BlitWorks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":29238,"name":"The Crew 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b49/b49e403e116e9734e95b4c88e5b2ae74.jpg","description":"Pre-Purchase Offer\r\nPre order The Crew® 2 now and capture the thrills of the  American motorsport spirit with The Crew® 2 Legendary Motors Pack including :\r\n- Harley Davidson Iron 883TM 2017\r\n- Mercedes-AMG C 63 Touring Car 2016\r\nGold Edition\r\nGo beyond the limits with the Gold Edition and get The Crew® 2 Motorsports Deluxe Pack and the Season Pass and 3-day early access.\r\nTHE CREW® 2 - GOLD  EDITION\r\n- A 3-day early access\r\n- The Crew® 2 Season Pass\r\n- The Crew® 2 Motorsports Deluxe Pack that includes:\r\n*Ford F-150 Raptor Race Truck 2017\r\n*Abarth 500 2008 Monster Truck Edition\r\n*Pilatus PC-21\r\n*3 outfits to customize your pilot\r\nDigital Deluxe Edition\r\nTake the challenge to new heights with the Deluxe Edition which includes The Crew® 2 Motorsports Deluxe Pack:\r\n- Ford F-150 Raptor Race Truck 2017\r\n- Abarth 500 2008 Monster Truck Edition\r\n- Pilatus PC-21\r\n- 3 outfits to customize your avatar\r\nAbout the GameThe newest iteration in the revolutionary franchise, The Crew® 2 captures the thrill of the American motorsports spirit in one of the most exhilarating open worlds ever created. Welcome to Motornation, a huge, varied, action-packed, and beautiful playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, and sky. From coast to coast, street and pro racers, off-road explorers, and freestylers gather and compete in all kinds of disciplines. Join them in high-octane contests and share every glorious moment with the world.\r\nThe Crew® 2 gives you the chance to showcase your skills and rise as a multi-skilled motorsports champion.\r\nFEATURES\r\nWELCOME TO MOTORNATION – TAKE THE CHALLENGE TO THE GROUND, SEA, AND SKY\r\nPush boundaries and take on new experiences in iconic locations. Fly and spin through fog and clouds above the snowcapped Rocky Mountains, burn rubber in the backstreets of New York City, sweep through the Mississippi River, and explore every inch of the Grand Canyon. Driving your dream hypercar, riding some of the most iconic American bikes, and taking control of the swiftest aerobatic planes and powerboats: opportunities for fun and challenges are limitless in a fully redesigned USA.\r\nSWITCH INSTANTLY BETWEEN VEHICLES & ENJOY A 100% SEAMLESS EXPERIENCE\r\nThe Crew® 2 is about open world freedom behind the wheel of your favorite rides. Shift from one to another with just a push of a button using the Fast Fav feature and experience the full potential of this huge and seamless open world. Cruising through L.A in your dream hypercar, switch to the swiftest aerobatic plane to rise above the skyscrapers and enjoy stunning perspectives over Hollywood, then swap it for a slick powerboat as you reach the coastline, landing smoothly on the Pacific ocean: opportunities for fun and challenges are limitless.\r\nBE THE CHAMPION YOU WANT TO BE\r\nJoin four different motorsports families from around the country: street and pro racers, off-road experts, and freestylers. They’ll hook you up with new rides, and they’ll introduce you to their own unique motorsports culture and set of disciplines. Through competitions and chance encounters, find and hone your personal style, collect and customize your dream rides, show them off in your HQ, and make your mark on the entire US motorsports scene.\r\nSHARE AND SHINE IN A CONNECTED WORLD\r\nThe world of The Crew® 2 is fueled by the need to share your personal accomplishments and unique moments with friends and others – break records and be a pioneer! Every time you achieve something, it will be saved as a new challenge for other players, while you will be encouraged to surpass the feats of others. Capture and share all of your best moments with the press of a button.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":18700,"name":"Supreme Commander: Forged Alliance","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb4/bb41da0fc0e3839f426ba476a9d644ef.jpg","description":"Supreme Commander: Forged Alliance is a standalone expansion pack for Supreme Commander which includes a new campaign, a faction, 110 new units, new modes and multiplayer maps. It is an RTS game.\n\nTwo years pass after the Black Sun weapon was fired. The president of the United Earth Federation was murdered. The Seraphim occupy Earth. The old enemies unite to fight back the alien race. \n\nThe gameplay does not differ much from the original Supreme Commander. The main feature of the game is still the number of the vehicles featured. Players can fight on land, air, and water. The game also features various stationary buildings and experimental units that can withstand a massive amount of damage.\n\nThere are two types of resources in the game: Mass and Energy. Both of them are essential for the development of the player's army and economy. It does not matter how much materials you have for your future expansion. The speed you gather them at is what's important. One of the core mechanics of the game is the mining of Mass from the destroyed units and buildings while Energy can be obtained from trees and unfinished buildings.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"PC"}]},{"id":614954,"name":"Battlefield 2042","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/af2/af2b640fa820e8a8135948a4cd399539.jpg","description":"Battlefield™ 2042 is a first-person shooter that marks the return to the iconic all-out warfare of the franchise. Adapt and overcome in a near-future world transformed by disorder. Squad up and bring a cutting-edge arsenal into dynamically-changing battlegrounds supporting 128 players, unprecedented scale, and epic destruction.\r\nALL-OUT WARFARE\r\nThe next generation of fan-favorites Conquest and Breakthrough features the largest Battlefield maps ever and up to 128 players. Experience the intensity of all-out warfare on maps filled with dynamic weather and spectacular world events.\r\nConquest\r\nBattlefield's massive, iconic sandbox mode returns – this time supporting 128 players on PC. The maps have been specifically designed for this vast scale, with action divided into \"clusters\" of various kinds. Also, the action now centers around sectors consisting of several flags instead of individual control points.\r\n\r\nBreakthrough\r\nThe return of Breakthrough sees two teams – Attackers and Defenders – battle over larger-scale sectors as the Attackers push towards the final objective. Each sector is designed to house a larger number of players, enabling more strategic choice and more flanking opportunities. Approach the capture areas from multiple locations and take advantage of more types of tactical possibilities.\r\nBATTLEFIELD PORTAL\r\n\r\nDiscover unexpected battles and enter the wide universe of Battlefield in a community-driven platform that gives you the power to change the rules of war. The possibilities are endless when you can customize weapons, gear, rules, and more in this creative sandbox mode. Replay classic experiences with select content from Battlefield 1942, Battlefield 3, and Battlefield: Bad Company 2, or leverage the modern content from the world of Battlefield 2042 to discover, create, and share something completely new.\r\nBATTLEFIELD HAZARD ZONE\r\n\r\nA tense, squad-focused survival experience, Battlefield Hazard Zone combines edge-of-your-seat gameplay with the best of the Battlefield sandbox. Inserted as a four-member squad, you must locate and retrieve critical Data Drives scattered throughout the battlefield, while competing against opposing squads with the same objective and local militias. Succeed by gathering the Data Drives and choosing when to extract before a storm overtakes the area in this high-stakes, one-life experience. Every bullet, every skirmish, and every decision counts.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Electronic Arts DICE","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":12321,"name":"Darwinia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/beb/beb6ba7eedced500ae9a5df4589ec735.jpg","description":"Combining fast-paced action with strategic battle planning, Darwinia features a novel and intuitive control mechanism, a graphical style ripped from 80's retro classics like Tron and Defender, and a story concerning a tribe of nomadic sprites trapped in a modern 3D world.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Introversion Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11676,"name":"For The King","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b5d/b5d5f8b3ac428c1c6e31518ab2670414.jpg","description":"Early Access is Now LiveAdventure Awaits! For The King is now available for Early Access. Check back often for updates, new content, and other related news. Please visit the Official Forums for more details on build notes, feedback, tips and tactics. Happy Adventuring!\nAbout the GameThe King is dead, murdered by an unknown assailant. Now the once peaceful kingdom of Fahrul is in chaos.\nWith nowhere left to turn and stretched beyond her means, the queen has put out a desperate plea to the citizens of the land to rise up and help stem the tide of impending doom. Set off with your make-shift party, either single player, local, or online co-op. Choose to split your party up and cover more ground, or stick together for protection. A sound strategy can mean the difference between life and death.\nFor The King is a challenging blend of Strategy, JRPG Combat, and Roguelike elements. Each play through is made unique with procedural maps, quests, and events. Brave the relentless elements, fight the wicked creatures, sail the seas and delve into the dark underworld. None before you have returned from their journey. Will you be the one to put an end to the Chaos?\nFight and die as a party in fast paced and brutal turn-based combat using a unique slot system for attacks and special abilities. Find and gather herbs for your trusty pipe to heal your wounds and cure your maladies. Set up safe camps or brave the horrors that nightfall brings.\nJust remember adventurer, you do this not for the riches or fame but for your village, for your realm, For The King!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Curve Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":3558,"name":"DRIVECLUB","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1de/1deed95a21d854f8a5cdfc249ff54c6c.jpg","description":"Driveclub is focused on professional car racing on the track. You can create or join the clubs, the so-called communities up to 6 people, what makes the passage of common tests sufficiently easier (the actions of the club members affect the result). The environment and tracks are inspired by real locations in different parts of the planet. Also, there is an opportunity to generate dynamic weather conditions (rain, snow, fog, as well as day or night).\n\nThere are three main in-game modes: tour, single event and multiplayer. In the tour, the player is given the opportunity to complete individual tests with a specific set of purposes and with particular test cars. In the check-in mode, one of three additional modes can be chosen: drift, race and time race.\n\nThe game has a vast diversity of cars (in total 50 models), the auto park updates each time with the appearance of patches.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Evolution Studios","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":12877,"name":"X-Blades","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b84/b843050122d37256c20b603518b2c883.jpg","description":"X-Blades is a hack and slash game in the fantasy setting. It follows Ayumi, a young adventurer that uses two pistol-blades. One day she was cursed and now needs to find the way to break free from it. You take on the role of Ayumi and lead her through hordes of monster towards the secrets of her world. The protagonist gets involved in the struggle between Light and Darkness, and her choices throughout the game will lead to the victory of one of these forces.\r\n\r\nThe game features a character development system that includes different skills you can upgrade with experience point during the game. The skills are light and dark, and the ending depends on what path you choose. The core gameplay is typical for the hack and slash genre: you need to clean up levels full of enemies and kill bosses. Besides using swords and guns, Ayumi can cast spells to her opponents. Different attack types are most effective against different enemies.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Gaijin Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]}]