[{"id":5426,"name":"Crash Bandicoot 3: Warped","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/837/837a609b0584db5d03534c8e767861b1.jpg","description":"Oh, yeah! He's back! AND he's ready to rumble! It's a whole new adventure with Crash Bandicoot, and this time he's time traveling through the ages with his little sister Coco! Scubadive with the sharks, ride a baby T-Rex, go soar the skies in a plane, gallop along the Great Wall of China on a tiger, dodge ancient Egyptian mummies and much much more!","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation"}]},{"id":3307,"name":"The Escapists","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc4/bc46fd9543044b48ce87929f3e0d28a2.jpg","description":"The Escapists is an indie adventure game with role-playing and puzzle elements developed by Mouldy Toof Studios.\n\n###Gameplay\nYou play as a prisoner with only one goal in mind - escape. The players can acquire items that will help them in the process of escaping either by buying them from fellow prisoners or crafting them. In fact, you can always steal the items you need from someone else.\n\nIt is possible to interact with other inmates who can assign tasks to the player. By completing these quests, the players can increase their respect or earn some money. Different activities such as visiting the gym or reading in the library increase the player's stats which increase the chances of a successful escape. \n\nIn order for the player to not be spotted by their wardens, it is essential to avoid their attention and follow the timetable by eating food with all the other inmates, appearing at a morning gathering, and so on. The cells are often searched, so the player has to be careful and hide the tools required for the escape. If one should get detected, they're moved to the punishment cell and lose all the items and preparations they made for the escape.\n\n###Miscellanious\nFive add-ons for the game were released. Each of them added new prisons, including the iconic Alcatraz prison, new escape options, crafts and much more.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3580,"name":"FIFA 15","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be5/be51faf9bec778b4ea1b06e9b084792c.jpg","description":"FIFA 15 brings football to life in stunning detail so fans can experience the emotion of the sport like never before. Witness the intensity of crowds chanting and cheering like on match day, and listen to commentators guide fans through the story of the game with Dynamic Match Presentation. For the first time ever, all 22 players on the pitch are connected with Emotional Intelligence – now players will react to opponents and teammates within the context, and relative to the narrative of the match. Next Generation Visuals put fans on Living Pitches with grass that wears and tears as the match progresses. Authentic Player Visuals make players lean, athletic, and true to their real-life appearance. Player Control heightens the responsiveness of player movement, gives athletes more control and personality on the ball.\n*Users who have enabled Chat Restriction or UGM Restriction on their Sony Entertainment Network account will be unable to access the 'Pro Clubs' game mode.\nVideo output in Full HD 1080p requires 1080p native display.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\nNetwork Players 2-22\n27MB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n© 2014 Electronic Arts Inc.  EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc.  Official FIFA licensed product. © The FIFA name and OLP Logo are copyright or trademark protected by FIFA. All rights reserved. Manufactured under license by Electronic Arts Inc.  All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":1820,"name":"Worms W.M.D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c7/4c7fd2f57c9be42040505ad8287f0198.jpg","description":"Just UpdatedThe Liberation update unleashes a brand new war-torn theme as a canvas for your latest skirmishes.\nThe land has been ravaged by battle and a complex series of tunnels have been crafted to allow Worms to traverse the map. Take up arms for the liberation through the 5 additional missions and weaponise your Worms to tear apart the enemy forces with 4 extra weapons to choose from. Then transform the terrain with the devastating power of the amphibious ‘Drillboat’, and drill your way to victory.\nJoin the liberation now!\n·         New Theme\n·         5 New Missions\n·         New ‘Drillboat’ vehichle\n·         4 New Weapons\n·         New Worms customisations\nAbout the Game\nThe worms are back in their most destructive game yet. With a gorgeous, hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some much-loved classic weapons and gameplay, Worms W.M.D is the best worms experience ever.\nWork your way through 30 campaign levels of increasing difficulty using the huge arsenal of new and classic weapons at your disposal. Use new vehicles to cause chaos amongst the enemy ranks and use buildings to gain the tactical advantage as you try to dominate the battlefield!\nTake on up to five opponents in hilarious all-out tactical worm warfare with up to eight worms each, either in local or online multiplayer, including ranked play. Flatten your opponents with the Concrete Donkey. Turn them into chunks of worm meat with the Holy Hand Grenade. Rain down hell from above in helicopters or pound them into oblivion with the tank. With 80 weapons and utilities at your fingertips, this is Worms at its chaotic best!Key Features\nWonderfully 2D: The best implementation of the Worms formula yet, now with a brand new worm, and gorgeous digitally-painted 2D artwork.Vehicles: Worm warfare gets serious with the introduction of vehicles for the first time in the series. Dominate the landscape in warfare-ready tanks, take to the skies to unleash hell from from above in helicopters and more! Buildings: Keep your head down, and hide out in a building. Buildings provide a tactical advantage by hiding away your worms, and keeping them safe from direct attacks!Crafting: No more waiting around while your opponents take their turns! Grab the crafting crates that drop from the sky during games to make fiendishly upgraded versions of items such as the Electric Sheep, the Bazooka Pie and the Holy Mine Grenade to unleash on your enemies!Classic Worms Physics and Gameplay: Our brand new engine recreates the feel of the fan-favourite entrants in the series; and sees the reintroduction of the much loved Classic Ninja Rope!New and classic weapons: Over 80 weapons and utilities at your fingertips, including many returning classics and a slew of new additions such as the Dodgy Phone Battery, the Unwanted Present and the OMG strike. Mounted Guns: As if over 80 weapons and utilities wasn't already enough! A range of different gun types are placed around the landscape, allowing your warmongering worms to do even MORE damage!Hilarious single player plus online and local multiplayer warfare: Worms W.M.D comes locked and loaded with a huge arsenal of Training Missions, Campaign Missions and Challenges for the solo player. Train up then head online to create havoc in multiplayer modes including ranked play, with room for up to six players with eight worms each on a map!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":481910,"name":"Call of Duty: Black Ops Cold War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6b1/6b14dc4cc1785e396580c69165e55d2d.jpg","description":"The iconic Black Ops series is back with Call of Duty®: Black Ops Cold War - the direct sequel to the original and fan-favorite Call of Duty®: Black Ops.\n\nBlack Ops Cold War will drop fans into the depths of the Cold War’s volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters and more.\n\nAs elite operatives, you will follow the trail of a shadowy figure named Perseus who is on a mission to destabilize the global balance of power and change the course of history. Descend into the dark center of this global conspiracy alongside iconic characters Woods, Mason and Hudson and a new cast of operatives attempting to stop a plot decades in the making.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":17092,"name":"Receiver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/666/666bb577dbf6c3b012c67e2782d79b27.jpg","description":"Receiver was created for the 7-day FPS challenge to explore gun handling mechanics, randomized levels, and unordered storytelling. Armed only with a handgun and an audio cassette player, you must uncover the secrets of the Mindkill in a building complex infested with automated turrets and hovering shock drones.\nWatch the videos to learn more about our design experiments in this game!Key FeaturesDetailed simulations of a Colt 1911 pistol, S&W Model 10 \"Victory\" revolver, and Glock 17 with full-auto mod\nTaser robots and machine gun turrets with physically-based damage models\nBallistic modeling of ricochets and bullet drop\n11 audio tapes to prepare you to defend yourself against the inevitable Mindkill event\nBecome literate in how guns actually operate","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wolfire Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":47,"name":"Yooka-Laylee","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/213/2138ba3c97d02b581ca0b50805fcd49c.jpg","description":"Digital Deluxe Edition\nYooka-Laylee Digital Deluxe is the ultimate platforming package, including an exclusive digital manual and art book, plus the game’s incredible soundtrack!DIGITAL MANUAL & ART BOOK\nYooka-Laylee’s 24-page digital manual and art book features exclusive details on the characters, worlds and challenges set to feature in the highly-anticipated platformer revival! Oh, and there are a few excellent puns in there too, if you’re interested.\nThe digital artbook includes never-before-seen concept art and in-development images offering an insight into the creation of the game. Marvel at the post-it note origins of serpent salesman Trowzer! Say ‘wow’ as you discover that Dr. Quack used to ride a tank! A must-have for fans.SOUNDTRACK\nYooka-Laylee’s mouth-watering (ear-leaking?) soundtrack combines three of gaming’s greatest composers, the legendary David Wise (Donkey Kong Country, Diddy Kong Racing), equally esteemed Banjo-Kazooie composer Grant Kirkhope (Viva Piñata, GoldenEye 007) and the award-winning Steve Burke (Kameo: Elements of Power). This is one musical performance you definitely don’t want to miss!\nController SupportNotice: A controller is strongly recommended to play Yooka-Laylee\nAbout the GameYooka-Laylee is an all-new open-world platformer from genre veterans Playtonic!\nExplore huge, beautiful worlds, meet (and beat) an unforgettable cast of characters and horde a vault-load of shiny collectibles as buddy-duo Yooka (the green one) and Laylee (the wisecracking bat with the big nose) embark on an epic adventure to thwart corporate creep Capital B and his devious scheme to absorb all the world’s books… and convert them into pure profit!\nUsing their arsenal of special moves, our heroes will tackle a huge variety of puzzles and platforming challenges in their search for Pagies, the golden bounty used to unlock — and expand — stunning new worlds, each jammed to the gills with oddball characters, hulking bosses, minecart challenges, arcade games, quiz shows, multiplayer games… and much more!KEY FEATURES:\nINTRODUCING OUR NEW BUDDY DUO: Yooka and Laylee boast an awesome arsenal of abilities built for platforming fun and unlocked with added freedom from the serpent salesman Trowzer.\nCARVE YOUR OWN PATH: Purchase and unlock moves with freedom, choose to expand your favourite worlds into even larger, more complex playgrounds and equip unique Tonic gameplay modifiers to customise your play style. Every player will have a unique experience.\nA COLLECT-EM-UP FOR THE MODERN ERA: Seek out a roster of shiny collectibles with gameplay progression at their core (as well as other, more valuable materials), such as the dual action Butterfly Energy or tricky Ghost Writers!\nA CAST TO LAST: Meet (or beat) a huge cast of memorable characters brought to life by the art and audio teams behind legendary platform games, and destined to endure in future adventures as part of Playtonic Universe. Expect all manner of grunts, squeaks and squawks.\nA DREAM SOUNDTRACK: David Wise (Donkey Kong Country) and Grant Kirkhope (Banjo-Kazooie) combine for a melodic masterpiece! Seriously, clean out your ears – they’re in for a treat.\nBUDDY UP: Establish your own buddy-duo and adventure through Yooka-Laylee in co-op mode! Taking control of a unique co-op character, a second player can assist Yooka and Laylee by stunning enemies and helping them tackle tricky challenges. No piggyback required.\nAND A WHOLE LOT MORE: Discover unique boss fights, mine cart challenges, retro-tastic Arcade games, quiz shows and 8 unique multiplayer games!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":452646,"name":"Astro's Playroom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bfe/bfe7780b7d4342540be2e5273d49e54c.jpg","description":"From the team behind the critically acclaimed PlayStation VR adventure ASTRO BOT: Rescue Mission comes a brand new platformer pre-loaded on your PS5 console.1\n\nExplore four worlds, each one showcasing innovative gameplay using the new and versatile features of the PS5 DualSense™ wireless controller. \n\nThe game is free for all PS5 console users and is designed to be enjoyed by gamers and families alike.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Japan Studio","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":17741,"name":"Pony Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1cb/1cb8247e712e8797003387083acf30c0.jpg","description":"###Arcade soul\nGame by the authorship of one person: Daniel Mullins. The developer conceived it as an interactive arcade machine, which was called Pony Island. According to the idea, the player soon learns that the machine is infected with a certain demon, which captures the souls of players.\n\n###Key features\nThe main character gets help from the soul of a player already captured: he could not cope with the devil's trials. Pony Island is a point-and-click game that simulates the operating system using the user interface. The main task of the player is to study the internal software shell of the gaming machine, where he got stuck and tried to escape the demon. The gameplay of the game changes constantly and the player needs to participate in mini-games like endless runner and shoot-em-up.\n\n###Money for the dream\nPrior to Pony Island, Daniel Mullins was already trying to release the game: right after college, in 2014, he collected the necessary money to develop his first game Catch Monsters. The successful crowdfunding experience allowed Daniel to pursue his dream and not work on boring work in the office. Pony Island was developed in just 48 hours, during the Ludum Game Jam, and later appeared on the platform for indie games Steam Greenlight. After that, the popular YouTube PewDiePie recorded and published a let's play of the game, after which the game gained enough votes, and a full release happened.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Daniel Mullins Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":19503,"name":"Unreal Tournament 3 Black","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e3/9e3f90e9d012bbf3f6bfa91be67d7572.jpg","description":"The Titan Pack gives players a substantial amount of enhanced features and new content, including many original environments, new gametypes, the namesake Titan mutator, powerful deployables and weapons, new characters, and the Stealthbender vehicle.\nAlso included are sweeping enhancements to AI, networking performance, UI usability and mod support, plus the addition of 57 Steam Achievements to make the UT3 experience even more satisfying. The Titan Pack also brings client-side demo recording, major Server Browser enhancements, a new maplist system, plus mid-game mutator and gametype voting functionality to the PC.Titan Pack includes:\n16 environments  four Warfare, three vCTF, six Deathmatch, and three CTF maps  that are new to the PC and PS3 versions\nThree bonus pack maps, CTF-Face, CTF-Searchlight and DM-Morbias\nThe namesake Titan mutator, which lets players overwhelm opponents as a 15 foot tall titan, or crush them as a 30 foot tall Behemoth\nGreed and Betrayal, two gametypes that breed new-found fervor throughout the competitive UT3 arena\nTwo powerful weapons, the Stinger Turret and Eradicator Cannon artillery\nTwo valuable deployables, the X-Ray Field and Link Station\nThe Slow Field power-up, a portable version of the Slow Field deployable\nStealthbender, a new vehicle that carries two spidermine trap deployables, one EMP mine, and one each of the new Link Station and X-Ray Field deployables\nTwo new characters, Nova and Kana\n57 awards attainable as Steam Achievements\nSignificant AI enhancements, especially in vehicle gametypes; networking performance upgrades; greatly improved menu flow and UI usability; better mod support\nClient-side demo recording, highly improved Server Browser, a new maplist system, plus mid-game mutator and gametype voting functionality for PC                     About Unreal Tournament 3\t\t\t\t\tUnreal Tournament 3 marks the return of the world's premiere first-person shooter. Unreal Tournament 3 unleashes the full power of Unreal Engine 3, taking graphics, gameplay, and challenge to a whole new level. Players engage in intense battles with other human players online, or against Unreal artificial intelligence that sets the industry standard. With the most powerful futuristic weapons and vehicles available, this is FPS action at its best!\nUnparalleled graphical and physical realism from the award-winning Unreal Engine 3 technology delivers the most compelling first-person shooter experience to date...online and offline!\nVast arsenal of weapons - Unreal Tournament has always been known for brutal weaponry, and now the arsenal is even bigger and badder. Detonate your opponent from a distance with the ever popular Shock Rifle or blast away at close range with the Flak Cannon. Over two dozen weapons and vehicles have been upgraded and enhanced for maximum killing potential.\nNew single player campaign! This is Unreal Tournament like you've never seen it before! The Necris invasion has begun, and your clan was one of the first to be slaughtered. Head to the front lines and join this Epic battle to defend humanity while taking your revenge.\nNew and favorite characters - Fight side-by-side with or compete against new and returning characters from the Unreal universe, all with enhanced abilities, extremely detailed designs, and distinct personalities.\nEnhanced popular game types, including Deathmatch, Team Deathmatch, Capture the Flag, and all-new Warfare mode and more.\nOnline innovations - Unreal Tournament 3 brings back all the award-winning online features of previous Unreal Tournament games, plus seamless loading on servers, improved matchmaking, and co-operative campaign play online.\nPC version bundled with the award-winning Unreal Engine 3 Toolset - Build your own levels, game types, and more, or download the latest mods from the massive Unreal community.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Epic Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":2822,"name":"Lovers in a Dangerous Spacetime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b47/b47da312357f548ceeb3a4d00021cd1d.jpg","description":"In Lovers in a Dangerous Spacetime, the player assumes control over the crew of a pixelated spaceship. Your goal is to navigate it through the dangerous 2D space, avoid asteroids and fight off enemy ships and space monsters. Every time the ship hits an object, it loses some of its health. \nThe spaceship contains several devices, such as thrusters, laser cannons, and deflector shields, and one character can only control one device at a time. To keep the ship running and safe, the protagonists have to constantly move around the ship to activate a certain device. This is why, although Lovers in a Dangerous Spacetime can also be played alone, the game is strongly oriented towards the cooperative multiplayer. Up to four players can participate and form a crew to thoroughly control every device. Even in the single-player mode, there’s the second protagonist, presumably your character's lover, who is controlled by the AI and obeys your orders. \nPink-colored surfaces, gigantic hearts that need to be unchained, and other visual elements highlight the game’s underlying theme of love as the means to survive. The game’s visuals are colorful, albeit simple, and are based on the “superflat” art style.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Asteroid Base","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12648,"name":"Warhammer 40,000: Dawn of War - Soulstorm","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61d/61dd8a874f97c7fa1f4c90d9c6318414.jpg","description":"Warhammer 40,000: Dawn of War – Soulstorm is the third and final expansion for 2004 strategy game Warhammer 40,000: Dawn of War. Unlike two previous expansions (Winter Assault and Dark Crusade), it was not developed by Relic Entertainment, but by Iron Lore Entertainment. \nBeing the expansion of Dawn of War, the gameplay in Soulstorm is similar to the original game. It is a real-time strategy combat-focused game based on the tabletop wargame Warhammer 40,000. The players have to build bases, train units, obtain upgrades, gather recourses and fight with enemies, strategically using unique traits of different units.  \nThe main difference in Soulstorm is the addition of two new factions: all-female imperial division Sisters of Battle and Dark Eldar – a faction of Eldar space pirates with apparent sadistic tendencies. It also features new aerial type of units for every fraction, the new campaign and few new mechanics and gameplay tweaks.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":4489,"name":"Crysis 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/899/899ce332d07c3fc1dd924bf828d1f484.jpg","description":"The sequel to Crysis is set three years after the original. All events of the 2020 incident, especially the human-alien conflict, were kept secret, and CryNet Systems is hunting for survivors of the first contact. However, the extraterrestrial race of Ceph did not give up its plans on the Earth. Crysis 2 introduces the new protagonist, a US Marine codenamed Alcatraz. Prophet, the squad leader from Crysis, also makes an appearance, and his recorded memories guide Alcatraz as he uncovers the alien plot. As in every game of the series, the protagonist is armed with a futuristic Nano Muscle Suit, a military exoskeleton that adsorbs damage, heals and strengthens the wearer. The suits were updated since Crysis, introducing modules for suit customization and a new Tactical mode. The player can now use multiple suit modes at the same time. \r\nMost levels are set in the urban environment this time to distinguish the game from the original. Alcatraz is eventually tasked with defending New York from the alien invasion, and the battle ensues at iconic places like Times Square. The game also includes a multiplayer mode that pits the United States Marine Corps against C.E.L.L. mercenaries.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":19436,"name":"Beyond Divinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f69/f69d51606fb5d72b462c75e8de9383f5.jpg","description":"Beyond Divinity is a role-playing game with hack-and-slash features, a second installment in the series. The game is set in a fictional world 20 years after its predecessor,  following new story, new possibilities and new threats for the world.\n\nThe game’s main character, a paladin in servitude to the Divine, is forced to be joined with a death knight, his ideological nemesis. The main story is focused around their unwanted bond, and the game employs various mechanics regarding the control of two characters. Role-playing elements will allow the players to create a unique path for deuteragonists, and to find different ways to defeat their enemies. The game features lots of dialogue filled with witty humor, reflecting on the situation that our characters are in.\n\nDespite game’s premise of a simple hack-and-slash adventure RPG, the problematic caverns and long dungeons will provide a great sense of challenge even to the veterans of the genre, as the game punishes every mistake that the player makes. However, considering the astonishing soundtrack and overall setting of the game, the difficulties can be set aside, as the game will allow the players to immerse in the journey truly.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Larian Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12319,"name":"DEFCON","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d6a/d6a68393fa48d1f2f2ae8e3406fc5ff9.jpg","description":"DEFCON is a unique RTS from British Introversion Software, known for such experimental projects. The user interface is minimalistic and simple: it resembles a tactical card stylized as Cold War films such as Dr. Strangelove and WarGames.\r\n\r\nThe game is divided into Defcon phases in which players need to place military forces on a real world map. There are aircraft carriers, submarines, air defense and other equipment capable of either launching a nuclear warhead or reflecting it. The winner in the match is the one who most effectively bombarded the enemy territory. Defcon is a game about pure gameplay, there is no history, as there is no story campaign.\r\n\r\nIn addition to playing with AI, a player can compete with real people online in multiplayer matches. In total, such matches can accommodate up to 6 people and this significantly complicates the gameplay. Opponents should guess the location of the rival's troops and inflict the most accurate nuclear strike.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Introversion Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12649,"name":"Warhammer 40,000: Dawn of War - Dark Crusade","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13a/13acc25a1390a95785ea53b996faa545.jpg","description":"Warhammer 40,000: Dawn of War - Dark Crusade is a second expansion pack to Warhammer 40,000: Dawn of War developed by Relic Entertainment.\n\nThe plot of the game revolves around the battle for the planet Kronus. Seven races fight for the colony. This Crusade can only result in the victory of one of the armies and total devastation of all others.\n\nThe campaign consists of two parts: Global Battles and Real-time fights. In the Global Battles mode, each race starts the campaign on their main base. They fight for Kronus that is divided into 22 provinces. The movement around the map is resembled by moving the figure of the race leader. Most of the game it is possible to move your army only once and only to the closest province. If the player captures a specific province with a spaceport, the travel to any province becomes available.\n\nTwo types of resources are present in the game: energy and influence. Both these resources are unlimited. The players also have to keep an eye out on their squad's morale. If the enemy uses a certain type of weapon, the squad's morale goes down and the soldiers are less eager to fight.\n\nThe game also features multiplayer real-time battles.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":3325,"name":"Octodad: Dadliest Catch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41e/41e431c48530788de5e8bddf8dcfba32.jpg","description":"Small freeware game Octodad has found a lot of popularity as a simple comedic demo of a game engine and the controls over the octopus, successfully trying to pretend to be a human. Octodad: Dadliest Catch is a direct and full-fledged sequel to the game, telling a story of a smart and resourceful octopus. We follow Octodad on his day to day activities, until the day when his past caught up to him, and now he has to save his family from the man that knows his secret identity. The cook by the name Fujimoto kidnaps the Family of Octodad, and now the player will have to find their way to save them.\nThe game control scheme is notorious among the fans because players have to control one of two sets of tentacles as arms and legs, switching between the two with a press of a button. All that, while trying to perform simple or complicated tasks, like finding things or picking up objects. The game is divided into several levels, each with a list of objectives.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Young Horses","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":1116,"name":"Reus","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/825/8259c21da3dcb834daec3675a4dcebd3.jpg","description":"God game genre is long forgotten. Only a few remember old and classic games such as Black & White series. Reus managed to revive this genre. In this game the player can control giants who have the ability to terraform and can provide certain resources like animals, plants and minerals which are more than 100 in the game, which lets them to create life and alter genes as well as to modify the nature of the planet which is two-dimensional. The player also has an option to experiment with various terrain types. But most importantly, giants have to provide support to humans on the planet. Although, the player cannot control humans yet player’s actions can change human’s behavior. The player has the option to let giants either praise or punish humans on the planet and the player can help humans to achieve various developments. There is a complex system of upgrades in the game. Reus has a unique art style and interesting soundtrack. This is a gem for everyone who feel nostalgia for god game genre.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":579507,"name":"Death's Door","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3e/a3ea71c18e81d54ebaf982dadb9a8738.jpg","description":"Reaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow with greed and power.\r\n\r\nTalon Sharp Combat: Utilize melee weapons, arrows and magic to overcome a fantastic array of beasts and demigods. Mistakes are punished and victory is rewarded. Gain an edge by customizing your character stats and mastering the abilities and upgrades you obtain.\r\n\r\nA Beautifully Bleak World: Venture beyond the Doors and explore a land full of twisted inhabitants and countless secrets, bringing hope to the weird and wonderful characters you’ll meet along the way.\r\n\r\nA Dark Mystery to Unravel: Track down and defeat colossal tyrants with stories and motivations of their own. Experience a somber yet darkly comedic tale, uncovering the truths behind the flow of souls, the role of the Crows and the origin of the Doors.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Acid Nerve","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":9906,"name":"Figment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dcc/dcce37f6d000c846c7aa23ccebf53a73.jpg","description":"A musical action-adventure set in the recesses of the human mind... Welcome to the world of Figment. A strange and surreal world; a place filled with our deepest thoughts, urges and memories, populated by the many voices we hear in our heads.\nThis mind has been quiet and calm for many years. But something has changed. New thoughts have started to emerge - taking the shape of nightmarish creatures who spread fear wherever they go. The only hope is for the grumpy Dusty, the mind's former voice of courage, to get back to his old self and help the mind to face its fears.\nJoin Dusty and his ever-optimistic friend, Piper, on an adventure through the different sides of the mind, solving puzzles to set things straight, beating back the nightmares and seeking to restore the courage that's been lost.\nExperience how traditionally hand-painted brushstrokes come to life in a world filled with surreal art, colorful illustrations and charming characters. Experience the unique artstyles of the joyful Freedom Isles, the radiant Clockwork Town and the ominous Pathways.\nMusic is an integral part of Figment. Explore a rhythmic environment full of trumpet trees, piano houses and singing enemies and discover how your actions influence this musical universe and its dynamic soundtrack.\nTake an emotional journey to face universal human fears and help Dusty bring peace to the mind again. Overcome the Nightmares by using their dirty tricks to your advantage.\nFigment offers various challenges for all kind of players. Swing your sword skillfully at the enemies, rack your brain to solve puzzles and combine the two in epic musical boss battles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bedtime Digital Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":2234,"name":"The Banner Saga 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3af/3af9976b83868a1042eac59531a1a986.jpg","description":"Middle of the trilogy, Banner Saga 2 keeps the core of a tactical fantasy game with RPG elements. Banner Saga 2 is covering up the chapters 8 through 15 and picking up the story from the ending of the first game. The caravan was fleeing to the Walls of Arberrang, in order to escape the Dredge. The central character of the second game depends on who lost the Silver Arrow, Rook or Alette. Players will be able to see the perspective of Bolverk is some chapters.\n\nSince the game is developed by only three people, it is much easier to gather feedback by the team directly, they were able to listen to the criticisms and complaints from players about prolonged battles and lack of variety, so Banner Saga introduces new units, new talents, and new enemies. Any choices made in the first game have an impact on the events of later chapters. An entirely new race resembling centaurs, called The Horseborn.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Versus Evil","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":1108,"name":"Manual Samuel","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37c/37c927bb0af482dbb9e16df7cbbb5e43.jpg","description":"Manual Samuel is a classic adventure game with a wild twist. After making a deal with Death, our hero, the spoiled rich-kid Samuel, must survive for 24 hours controlling his entire body manually. From breathing and blinking to driving and working, all these tasks will fall to you. It won’t be easy, with Death himself tagging along for the ride, you might be in some very deep feces!\nFeatures:\nA hilarious story of love, redemption and death with secrets to uncover along the way.\nUnique, hand-drawn 2D art and animation bring the world of Manual Samuel to life.\nPlay solo or share control of Sam’s body with a friend for local co-op fun.\nMaster the brutal time-attack mode.\nScintillating soundtrack by Sondre Jensen and Ozan Drøsdal.\nOver 600 lines of dialogue expertly executed by eloquent voice actors.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3332,"name":"FINAL FANTASY X/X-2 HD Remaster","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a14/a14acef284eaa4854f83c99e80fc15d8.jpg","description":"FINAL FANTASY X tells the story of a star blitzball player, Tidus, who journeys with a young and beautiful summoner named Yuna on her quest to save the world of Spira from an endless cycle of destruction wrought by the colossal menace Sin.\nFINAL FANTASY X-2 returns to the world of Spira two years after the beginning of the Eternal Calm. Having been shown a mysterious but familiar image in a sphere, Yuna becomes a Sphere Hunter and along with her companions Rikku and Paine, embarks on a quest around the world to find the answers to the mystery within.\nBased on the international versions of the games that were previously only released in Japan and Europe, FINAL FANTASY X/X-2 HD Remaster brings these timeless classics forward to the current generation of fans, old and new alike.\nKey Features:\nCharacters, monsters, and environments have been fine-tuned to HD detail, providing a richer, deeper FINAL FANTASY visual experience.\nOther features in the PC version include remastered/rearranged BGM,\nInternational Edition content,\nAuto-save and 5 game boosters including high speed and no encounter modes.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Square Enix","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":11407,"name":"Banished","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bf/0bfa18254ae627cab7f0159a24d178cd.jpg","description":"You control a group of exiled travelers. They have only clothes and a cart with food. They are driven to the bare land and now they are fighting for survival. There is no money in their society, but they can exchange with the inhabitants of other cities that sometimes appear. Such trade is one of the key ways to obtain many critical resources.\nThese people from the very beginning of the game know all the necessary technologies, but they can use technologies only after they have accumulated the necessary amount of resources.\nThe basis of the game is the management of society in the conditions of limited all available resources.\n\nThe main resource are residents. They need not only food - they also need happiness. Without this, people will live less and die more often, the city will cease to grow. Residents are engaged in 18 crafts, from farmers to healers, in the bowels there are ore and stone, on the ground forests grow.\nFor winter, warm clothes and fuel are needed. Cutting woods for firewood can not be reckless. Old forests give way to the herds of deer, which feed the townspeople, as well as some medicinal plants. Unreasonable exhaustion of any resource leads to death. There is no universal strategy in the game - each time the amount of resources on the map is different.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shining Rock Software","platforms":[{"id":0,"name":"PC"}]},{"id":427,"name":"Plants vs. Zombies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/590/590aa45fbab8d43b57f93dd60027af7f.jpg","description":"The first part of the famous casual game about plants and zombies from the studio PopCap. The player will act as a homeowner, who uses different types of plants to protect his house from the invasion of zombies.\n\nIn the game, there are several types of plants and mushrooms that have a unique defense or attacking characteristics. The playing field is divided into 5 or 6 horizontal lines, along which the undead moves. To plant a plant, you need to spend a local analog of gold \"suns.\" Most plants can attack enemies only on their own line, however, as they pass and purchase upgrades, you can attack and enemies on several lines.\n\nThe game has three modes: singleplayer, multiplayer and Adventure Mode, in which players can earn currency for upgrades. As you go through, additional modes open: for example, Survival Mode and Puzzle Mode with mini-games.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"PopCap Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"}]},{"id":52827,"name":"Crash Bandicoot 2: Cortex Strikes Back","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a84/a84dc4980063ce934705ea5d8d241939.jpg","description":"A direct sequel to the Naughty Dog’s Crash Bandicoot was quickly put together, due to the success of the original. It’s a direct continuation of the story, with Crash trying to stop Doctor Neo Cortex from conquering the world once again. After his defeat in the original game, Cortex fell from his lair into the cavern, filled with glowing crystals. When he examines them thoroughly, it is clear that only these crystals can absorb the energy that would otherwise destroy the planet, and in order to gather all 25 remaining crystals he tricks Crash into helping him.\nCrash Bandicoot 2 is built on the same engine as the first one. Each stage has a crystal, and each of them can be accessed through the Warp Room. At the end of each level, Crash will have to face four bosses before his final clash with Cortex. As a 3D platforming game, Crash Bandicoot allows players to run and jump through the levels, with a fixed camera, centered either directly behind Crash in 3D sections or placed to the side in 2D platforming sections. Each stage has a set of hazards, that might come in forms of enemies with fixed walking and attack patterns, environmental traps, or boxes that will damage Crash when he breaks them.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation"}]},{"id":47428,"name":"Hunt: Showdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/929/929a78693f607a3332ecb89fe7ffaf06.jpg","description":"Savage, nightmarish monsters roam the Louisiana swamps, and you are part of a group of rugged bounty hunters bound to rid the world of their ghastly presence. Banish these creatures from our world, and you will be paid generously—and given the chance to buy more gruesome and powerful weapons. Fail, and death will strip you of both character and gear. Your experience, however, remains in your pool of hunters—called your Bloodline—always.\nHIGH RISK, HIGH REWARD, HIGH TENSION\nHunt’s competitive, match-based gameplay mixes PvP and PvE elements to create a uniquely tense experience where your life, your character, and your gear are always on the line. At the beginning of each match, up to five teams of two set out to track their monstrous targets. Once they’ve found and defeated one of these they will receive a bounty—and instantly become a target for every other Hunter left on the map. If you don’t watch your back, you’ll find a knife in it, and your last memory will be of another team of Hunters walking away with your prize. The higher the risk, the higher the reward–but a single mistake could cost you everything.\nPROGRESSION\nEven in death, you will be able to progress among the ranks of Hunters via your Bloodline. Though one character may die, their experience will be transferred to your Bloodline, where it can be applied your other Hunters. If you make it off of the map alive, you will be able to use the money and experience you earn to kit out new Hunters and prepare for the next match. If you die, you lose everything but your experience.\nDARK SIGHT\nDark Sight allows Hunters to see into the veil between worlds, making that which cannot be seen by mortal eyes visible to those who have been initiated. Use Dark Sight when you are tracking monsters, and a ghostly light will guide you toward your next target. Dark Sight also marks players carrying a bounty, making them more vulnerable to ambush while trying to escape.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Crytek","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":1720,"name":"Q.U.B.E: Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cf/0cfe4ec4dcffb8fcac999d7176c69176.jpg","description":"Q.U.B.E: Director's Cut is a puzzle game developed by Toxic games. The Director's Cut adds new story elements to the game and new voice acted lines along with new levels and music. VR support was also added.\n\nThe players find themselves in a sterile environment aboard a mysterious space cube-like ship that is on a collision course with Earth. The player is contacted with by another astronaut that warns the player that they have to find a way to find a way off the ship which will cause it to self-destruct. You set out on your mission.\n\nUpon coming to, you find yourself in a suit and with a pair of gloves that manipulate the in-game objects. The environment around you is made out of blocks that can be moved in a specific way based on their colors. Some blocks are made to be extended or retracted, some are used as a trampoline, while others can rotate some parts of the walls upon interaction. \n\nAs the game progresses, the puzzles get harder and harder. In some cases, the players have to remember the setup of the blocks in the room as the only visible blocks in the room are the colored ones.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":19237,"name":"Warlock - Master of the Arcane","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3f/d3f90322b1e759f2cb071d64a9731406.jpg","description":"Welcome to the World of Ardania, the famous part of Majesty series. You play as Grand Mage that aims to build a powerful empire. The player is granted the ability to command armies, user magic on the battlefield and claim the title of one and only ruler of the Ardania. \n\nWarlock - Master of the Arcane -- is a take on a turn-based 4X grand strategy game that uses fantasy setting as one of its main gimmicks. Research and use many of the game’s spells and their combinations, conjure powerful enchantments and annihilate your enemy. The gameplay mimics Master of Magic that was released back in the 90s. The player can claim victory by killing all virtual opponents in the battles, by completing the Unification ritual, or by just killing one of the eight gods’ of Ardania Avatar. The choice is yours!\n\n\nThere are a total of 5 DLC available for the game. They feature new races, modes, city buildings, and stories to enhance the gameplay even more.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ino-Co Plus","platforms":[{"id":0,"name":"PC"}]},{"id":10088,"name":"Owlboy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fc/0fc933e3dfbbf4306840ef429d73fa9a.jpg","description":"Owlboy is a pixel-art platformer game about an owl-humanoid boy called Otus. When his homeland was attacked by pirates, Otus starts an adventure to protect his home and reveal the secrets of his race. He makes new friends on the way. Each of them has special powers, useful during fights.\n\nOwlboy features classic platforming gameplay with a twist: unlike in many hardcore games of this genre, here you can fly and have almost no chance to die by falling. Otus can pick things up and use them as weapons or to solve puzzles. There are several ways to complete the same missions; your choice depends on your imagination only. Also, there are suitable tactics for different enemy types: while you can defeat some of them with direct force, the others can be destroyed in more creative ways.\n\nThe game’s world is organized like a huge cylinder with Otus’ village on the bottom; during the game you will fly higher and higher. Missions are set in separate locations; after completing them you will return to the central hub to get new quests.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"D-Pad Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9697,"name":"Alien Swarm: Reactive Drop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b3/4b3cbf42e305385dd6bdcde65daf7099.jpg","description":"Alien Swarm: Reactive Drop is a standalone expansion pack to Alien Swarm developed by Valve. The base game is included.\n\n###Setting\nIn distant future, the interplanetary travel was finally made possible. One planet was classified by the government for establishing a secret research base. It got overrun by aliens who were brought to the planet for research. A super elite squad was sent to deal with this problem.\n\n###Gameplay\nAlien Swarm: Reactive Drop is a cooperative top-down shooter. While only four-player squads were present in the base game, the limit was brought up to eight for the expansion pack. \n\nThe game's core mechanics are not much different from the base game. The player's squad has to reach the end of the level while completing objectives, that require teamwork. For example, one of the players has to weld the door while the others cover them.\n\nThe game features a class-based mechanics. Every class is proficient in their own field and has to work in a team in order to succeed in the game. Four classes are present in the game featuring eight unique characters.\n\nIt is also possible for the players to unlock new weaponry for their classes by progressing through the game. Players also get new items for leveling up. It is also possible to reset your progress after reaching max rank and earn a badge for your proficiency.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Reactive Drop Team","platforms":[{"id":0,"name":"PC"}]},{"id":28608,"name":"Fable II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cec/cec82d526f9d056d426c985562963eec.jpg","description":"This game supports English.  Download Fable II, the best-selling action role-playing game, in which you take on the role of a Hero in the fully realised land of Albion. Play through an epic story, become the world’s greatest fighter, gunslinger or mage. Explore dozens of open, unique environments with your faithful dog. Make friends, fall in love and start a family. Meet hundreds of characters and face some very tough decisions. In Fable II, everything you do has a consequence.  There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Lionhead Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":3877,"name":"Magrunner: Dark Pulse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25e/25ee259fb2926db1abb8dadddf7ad4bc.jpg","description":"When technology meets Cthulhu!\nMagrunner: Dark Pulse is an action-puzzle game in which technology confronts the Cthulhu Mythos, as imagined by author, H. P. Lovecraft.\nYou are Dax, one of seven Magrunners selected among the elite to participate in MagTech Corporation's space training program. But, what should be the chance of a lifetime quickly becomes a horrific nightmare.\nEquipped with your Magtech glove, you must harness the ability to magnetically polarize and manipulate objects in the environment to survive and surpass challenging puzzles. Your reflexes and ingenuity will be pushed to their limits as you make your way through 40+ immense and dangerous levels, including high-tech training rooms and the endless chasms of the lost cosmos, on a path to confront the horrendous creatures of Cthulhu!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Frogwares","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":12280,"name":"Tomb Raider IV: The Last Revelation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cff/cff82846d13e80b50529db058367d221.jpg","description":"Tomb Raider IV: The Last Revelation is an action-adventure game developed by Core Design. It is the fourth game in the Tomb Raider series.\n\n###Plot\nYoung Lara Croft who is accompanied by professor Werner Von Croy goes to Cambodia to find a mysterious artifact known as Iris. Unfortunately, due to an accident, the professor dies and Lara has to return to Great Britain. 15 years later, Lara opens up an Egyptian tomb where an ancient Egyptian god Set was buried. She incidentally awakens an old god, so now Lara has to get him back to the tomb to prevent the Apocalypse from happening.\n\n###Gameplay\nThe main gameplay formula of Tomb Raider is largely the same. The players have to explore the levels in order to find certain items. In their search, the players have to avoid and fight enemies and use aerobatics to progress further into the level.\n\nHowever, compared to the last game, The Last Revelation features some major gameplay changes. Now Lara can swing on ropes to get over gaps and pits, she can use pipes to climb up the buildings, and shimmy on ledges. Instead of using the old circular inventory system, it is now linear, where all the items in your inventory are placed in a horizontal line. The players can now utilize a compass, yet it is only used for putting in cheat codes or solving a puzzle on one of the game's levels. The items in your inventory can be combined together.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"}]},{"id":3843,"name":"Blacklight: Retribution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b44/b44e00fd4718f0a22981c370d7855b35.jpg","description":"Blacklight: Retribution is a multiplayer only game in the cyberpunk setting, a direct sequel to Blacklight: Tango Down. Aside from the tutorial level and matches against bots with human teammates, there is no single player content. Current game modes include not only staples of the genre like Deathmatch and Team Deathmatch, Capture the Flag and King of the Hill, but there is also a twist on the formula in case of Kill Confirmed mode. Players will have to kill enemies, but in order for the kill to count, it’s necessary to collect tokens from them. Teammates can pick up tokens from their friends in order to deny the kill points for the enemy team.\nLater added Onslaught and Siege modes brought more gimmick objective-based gameplay to the game. Total of sixteen maps of different sizes, complexity, and styles, which on top of the fully customizable equipment and appearances allows players to find unique look and playstyle, fitting for them.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hardsuit Labs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":52215,"name":"Burnout Paradise Remastered","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb6/cb63a33e16f90fa6f008cc093239dad3.jpg","description":"Make action your middle name as you rule the streets in Burnout™ Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!\nBurnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all addons from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K on the PlayStation 4 Pro.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\nNetwork Players 2-8 - Full game requires PlayStation®Plus membership to access online multiplayer\n10GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nConditions and restrictions apply. See https://www.ea.com/games/burnout/burnout-paradise-remastered/disclaimers for details.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":9598,"name":"Project CARS 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/84f/84f3b9c804cbc2b39b4023531427e7e9.jpg","description":"Pre-Purchase OfferPre-purchase now to get the Japanese Cars Bonus Pack containing 4 legendary racing machines from Nissan and Honda, plus unique racing liveries. Only if you already have Project CARS: Feel free to pre-order Project CARS 2 at a discounted price!\nDELUXE EDITION\nTake your ultimate driver journey to the max. Grab the Project CARS 2 Deluxe Edition and get accesss to the full game, Season Pass, and all bonus content including new cars, tracks, events, liveries.\nAbout the GameFEATURES:\n• 180+ licensed cars from iconic manufacturers\n• Full 12K & VR Support\n• Tested and tuned by pro racing drivers\n• All-new motorsports (IndyCar, Oval Racing, Rallycross) join old favorites incl. GT3\n• LiveTrack 3.0: Dynamic surface & weather physics affect vehicle performance and handling in real-time\n• New loose surface racing (ice, dirt, mud)\n• Full 24-hour cycle featuring real-time atmospheric conditions and seasonal ambience\n• State-of-the art physics model\n• Revamped gamepad handling\n• Class-leading Esport capabilities","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Slightly Mad Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":6530,"name":"Uplink","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e22/e22da89ed54225d0c4687a6ef5d0f765.jpeg","description":"You play an Uplink Agent who makes a living by performing jobs for major corporations. Your tasks involve hacking into rival computer systems, stealing research data, sabotaging other companies, laundering money, erasing evidence, or framing innocent people.\nYou use the money you earn to upgrade your computer systems, and to buy new software and tools. As your experience level increases you find more dangerous and profitable missions become available. You can speculate on a fully working stock market (and even influence its outcome). You can modify peoples academic or criminal records. You can divert money from bank transfers into your own accounts. You can even take part in the construction of the most deadly computer virus ever designed.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Introversion Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":55984,"name":"Beyond Good & Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee5/ee5e06ae04f89f0a73b2af9e8015cae2.jpg","description":"The game belongs to the action adventure genre, but differs significantly from other games of this genre in the quality of the game world. All the characters that the main character of the game meets have their own personality, you can almost always talk with them, and even the dialogue scenarios with each of them have several options, and vary depending on the situation in the game.\n\nConstant changes are common to the whole game world. Any significant action of the hero or his opponents, any noticeable change in any one place entails a change in other places.\n\n###Plot\nThe game takes place in the year 2435 on the planet of miners Hillys, which suffers attacks from DomZ monsters. These creatures abduct the inhabitants of the planet.\n\nThe elite unit of galactic special forces - Alpha Sections - protects the population of the planet from aliens. However, there is an underground rebel organization IRIS Network on the planet. The IRIS Network does not believe that Alpha Sections is really at war with the aliens.\n\nThe main character of the game is Jade, a girl of 20 years. She and her uncle organized a shelter for children whose parents were abducted by DomZ. The shelter is located on a small island with a lighthouse.\n\nAt some point, Jade is being attacked by the so-called Eye of the DomZ - it looks like an attempt to take over her mind. Uncle helps repel the attack.\n\nAnd then the representative of the rebels of the IRIS Network begins to contact Jade, and says that Alpha Sections does not protect the planet from aliens, but, on the contrary, in every possible way contributes to the final defeat.\n\nJade begins to act as a photojournalist, collect materials to expose Alpha Sections.\n\nFurther, there are many events in the game and several completely unexpected twists, revealing both Jade's special abilities and her very special origin and purpose.\n\n###Gameplay\nThe basis of the gameplay - solving puzzles and riddles, finding the right directions and finding the right buttons to open the doors.\n\nMany tasks are impossible without a partner. There are several partners in the game, and they can not only help with puzzles, but also take part in battles.\n\nWhen encountering enemies, Jade fights with Daï-jo's staff. Subsequently, she acquires weapons capable of hitting targets at a distance.\n\nTo move, Jade uses hovercraft, which can be improved, both in terms of movement and in terms of weapons - hovercraft also has it.\n\nJade is constantly taking pictures. She is paid for the photo, although the main task of Jade is to procure Alpha Sections revelations.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Ubisoft","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":373504,"name":"Resident Evil: Resistance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09e/09e34396a92952c57b1bfb1decfddfa3.jpg","description":"A new asymmetrical-multiplayer survival horror experience set in Raccoon City!\n\nCapcom's Resident Evil Resistance is a new 1 vs. 4 asymmetric online survival horror experience set in the world of Resident Evil, and part of the Resident Evil 3 package. Unleash your inner evil as a cunning Mastermind or join the fight as one of the resourceful Survivors desperately trying to escape every obstacle the Mastermind puts in their way!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]}]