[{"id":19240,"name":"Europa Universalis III Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/894/894b41c4664f51b692e07d57c2c2ae1e.jpg","description":"The third Europa Universalis game offers the player to lead a major world civilization through the Early Modern era. Unlike its predecessors, Europa Universalis III uses 3D graphics instead of 2D.\n\n###Gameplay\nThe player chooses a country and administers its diplomacy, economy, military, and society. The game has an emphasis on development rather than war, and the combat system does not allow you to directly control the units. You can pick any time period from between 1453 and 1789 and any country from a roster of 300. Despite the series' title, civilizations are not limited to Europe. \n\nThe country's current leader and state of affairs are generated on the basis of real history. Once the player enters the game, however, the events are randomized and only depend on the player's actions. A new feature introduced in EU3 is that the player can hire up to three court advisors (EU’s equivalent to Civilization’s “great people”). Each advisor has his or her area of influence and helps to improve the empire’s science, culture, or army. \n\n###Expansion packs\nContrary to its name, Complete edition doesn't include all of EU3 expansion packs (it is Chronicles edition that does), but only two of them: Napoleon's Ambition and In Nomine. Napoleon's Ambition is set after the main game's timeline, lasts until 1821, and deals with the Napoleonic Wars. By contrast, In Nomine begins in 1399, and includes late medieval features like Byzantine Empire, Tamerlan's conquests, and the Hundred Years War.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":510061,"name":"Ghostrunner Demo","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c80/c80f6c86de421615f4e84a07e5dde573.jpg","description":"Get your sword ready and check Ghostrunner here\nGhostrunner is a hardcore FPP slasher packed with lightning-fast action, set in a grim, cyberpunk setting of a futuristic mega-structure. Climb Dharma Tower, humanity’s last shelter after a world-ending cataclysm. Make your way up from the very bottom to the top, confront the tyrannical Keymaster and take your revenge.\nThe streets of the tower-city are full of violence. Mara the Keymaster rules with an iron fist and little regard for human life. As resources grow thin, the strong prey on the weak and chaos threatens to consume what little order remains. The decisive last stand is coming. The final attempt to set things right, before mankind goes over the edge of extinction.\nAs the most advanced blade fighter ever created, you’re always outnumbered, but never outclassed. Slice your enemies with a monomolecular katana, dodge bullets thanks to superhuman reflexes and employ a variety of special techniques to prevail.\nOne-hit-one-kill mechanics make the combat fast and intense—use your superior mobility (and frequent checkpoints!) to fearlessly engage in a never-ending dance with death.\nGhostrunner offers a unique single-player experience of fast-paced, violent combat and an original setting that blends science-fiction with post-apocalyptic themes. It tells a story of a world that has already ended and its inhabitants who fight to survive.\nPre order now and receive two in-game katana swords, one of which is exclusive to GOG!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"}]},{"id":10387,"name":"BUTCHER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4f/f4fef87f21a8b34abfb638dffdd9db5b.jpg","description":"https://store.steampowered.com/app/629260\nThe easiest mode is 'HARD'!\nBUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. As a cyborg programmed to eradicate the last remains of humanity, your sole purpose is to well... annihilate anything that moves.\nSo grab your weapon of choice (from chainsaw, through shotgun, to grenade launcher) and kill your way through underground hideouts, post-apocalyptic cities, jungles and more. And if you're feeling creative, there are plenty other ways of ending your enemies' misery - hooks, lava pits, saws... no death will ever be the same.\nIf kicking corpses into a lava pit and adorning walls with blood is your idea of a good time, BUTCHER is THE game for you.\n(header photo by Bartłomiej T. Listwon)Key features: Ultra-violent uncompromising carnage in the spirit of Doom and Quake (chainsaw included)\nRelease your inner artist, paint the walls with (permanent) blood (up to 4 million pixels available to be painted per level)\nUse the environment (saws, hooks, lava pits, animals and other) to brutally dispose of your enemies\nPut your reflex and patience to the ultimate test\nChoose from an array of weapons (featuring classics like chainsaw, railgun and the deadly grenade launcher)\nAdorn more than 20 levels with the insides of your enemies\nSoak in the dark atmosphere reinforced by a wicked, heavy soundtrack (while you kick corpses around)\nDie painfully: melt in lava, become piranha food, get crushed by heavy doors... and more!\nAbsolutely no mercy for anyone!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crunching Koalas","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17575,"name":"Defense Grid: The Awakening","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b31/b31c8dee16e2f127c072fb40cb960c7d.jpg","description":"###Microsoft’s tower defence\nThe game is one in the genre of tower defense, developed by Hidden Path Entertainment for PC and Xbox 360. Later it was ported to the Mac, and for other consoles in 2013. For Xbox owners, it was distributed free of charge to all holders of the Gold Xbox Live subscription. The game was actively promoted by Microsoft at Game Developers Conference 2008.\n\n###Key features\nThe player must defend his own military bases from alien attacks. The latter aimed at power cores, which are located on each map at power plants. To protect the cores player has at their disposal ten different types of towers. They have to be built on platforms specially allocated for this. Thus each level turns into a puzzle, created by the developers for the player to solve. Enemies can not attack the towers, and killing the foes is the only source of resources for the player. Each tower has its own strengths, and for the maximum efficiency, they must be correctly positioned on the map. The player has to defeat Fifteen types of enemies, each like towers, with its own strengths and weaknesses.\n\n###The Plot\nThere is a story in the game, despite the simplicity of the gameplay. It is based on the fact of an attack by some alien race on the planet, where for some unknown reason the defense grid is disabled. Completing the levels, the player turns on each node of the defense system and eventually one by one and reflects the enemy attack. The game is set in the distant future, and the scenery for the battles contains ancient ruins and military bases built amid the dying grandeur of civilization.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Hidden Path Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"}]},{"id":17666,"name":"Dead Rising 3 Apocalypse Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9e/b9eab82d4868455c1ab6bfed473605c4.jpg","description":"Steam Big Picture\nFree Upgrade to Apocalypse Edition!Dead Rising 3 Apocalypse Edition now includes the ultimate open-world zombie game along with all four of the “Untold Stories of Los Perdidos” episodic downloadable add-on packs.  Welcome to the Apocalypse, where your zombie slaying thrills await.\nAbout the GameAnything and everything is a weapon in Dead Rising 3. Explore the zombie-infested city of Los Perdidos, and find a way to escape before a military strike wipes the entire city, and everyone in it, off the map. With intense action and an unmatched level of weapon and character customization, Dead Rising 3 delivers a heart-pounding experience unlike any other as you explore, scavenge and fight to survive in a massive open world on the brink of a zombie apocalypse.FEATURESWelcome to Los Perdidos – Set 10 years after the events in Fortune City players are taken to the massive open and infected world of Los Perdidos while being immersed in action and stunning visuals.\nAll the survival horror action comes to PC – Fully optimized to run at a high resolution, the PC release includes full Steam and game controller support.\nMore zombies than ever before – The zombies are smarter and deadlier than ever with intelligent AI and shared awareness forcing players to employ all their cunning skills and creativity to stay alive.\nHundreds of unique combo weapons and vehicles – Combine and customize hundreds of pieces found throughout the sandbox world including the gruesome Boom Cannon weapon or the Party Slapper vehicle.\nFace the horror alone or with a friend – Join forces with a friend for endless zombie killing mayhem and earn experience points that carry back to your single player experience.\nBonus Downloadable Content – All four of the “Untold Stories of Los Perdidos” downloadable add-on packs are now included.  Each add-on chapter focuses on a different protagonist and gives players access to crazy new weapons and vehicles that carry over to the main game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Capcom Vancouver","platforms":[{"id":0,"name":"PC"}]},{"id":5688,"name":"The Saboteur","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e3c/e3ce1e24d0ee02dfbb75b5692042127d.jpg","description":"Not all wars are fought on the open battlefield. Download The Saboteur to visit 1940s Nazi-occupied Paris, as you play tough Irish racecar mechanic Sean Devlin. Working with the French Resistance, Sean is out for revenge against ruthless Nazi Colonel Kurt Dierker, who executed Sean’s best friend.\r\n\r\nThis open-world action thriller takes you through the seedy streets of Paris, as you seek to undermine the German authority and lead a rebellion. Fight across rooftops and through dangerous alleys, and operate a wide variety of vehicles as you navigate your terrain. You can even climb the Eiffel Tower or Notre Dame Cathedral for a sniping mission.\r\n\r\nUse stealth and disguise to strike at the heart of the Nazi war machine by disabling trains, destroying bridges, and blowing up enemy facilities. As you work to remove the oppressive forces from parts of the city, the drab black-and-white palette gives way to bright colors, signifying that you have inspired the townspeople. The more you incite the people, the more they will aid you by intervening in fights or providing a quick getaway from pursuing Germans. The Saboteur presents a fresh take on World War II and features dramatic cinematic elements.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":58773,"name":"Sable","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46a/46acc41c5ee0aea0e2d9c685a9a7427b.jpg","description":"Sable is a coming-of-age tale of discovery through exploration across a strikingly rendered open world desert. Go on a deeply personal journey across an alien planet as the young Sable, exploring ancient monuments, ruined architecture, and ships fallen from the cosmos, all while learning the history of its inhabitants and discovering her place in the world.\r\n\r\nWhat is the history behind these broken monuments scattered about the land? How did the nomadic clans come here, and what made them stay? What's the greater importance that Sable must come to understand as part of this rite of passage? Only the inquisitive mind will come to understand the lessons held within the sandy confines of the planet's secrets: lessons of life, family, and being a part of something greater than one's self.\r\n\r\nKEY FEATURES:\r\n• **A WORLD OF ADVENTURE:** Travel across a far-way desert planet on the back of your hoverbike to uncover relics of an ancient past.\r\n• **A VOYAGE OF EXPLORATION:** Meet nomadic peoples and assist with their quests to learn their stories, as they lead you to the far reaches and hidden secrets of the sand-weathered planet.\r\n• **A QUEST OF SELF-DISCOVERY:** Accompany Sable through this rite of passage as she learns valuable lessons of the clan, and the people and culture of her world.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Shedworks","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":28637,"name":"Forza Horizon","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/994/99496806493c2f39b9f191923de2a63b.jpg","description":"Forza Horizon is an open-world racing game developed by Playground Games exclusively for Xbox 360. It is the fifth installment in Forza franchise and the first game in Horizon subseries. \r\n\r\n### Plot and setting \r\nThe game takes place in the state of Colorado during fictional Horizon Festival, a huge street-racing event. The player chooses a character and participates in different activities throughout the festival. \r\n\r\n### Gameplay  \r\nIn contrast to previous Forza titles, the game lets players explore the area of the festival at their own pace. The game, however, keeps realistic physics system from previous games. There are dozens of various racing events scattered throughout the game world including point-to-point races, drift, races against planes and many more. Besides that, the player can interact with other AI racers, challenging them to race. While exploring the map, the player can find hidden vintage cars that can later be upgraded and added to the garage. \r\nThe game incorporates a popularity system. Winning races, performing stunts, smashing particular objects, completing speed traps challenges increases the player’s popularity giving access to more difficult races. \r\nBesides racing Forza Horizon has auto-show, which lets player sell and buy cars, tuning, cars customization and photo mode. The later allows the player to make photo shoots outside the car.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Playground Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":15507,"name":"Chasm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/440/44033fc85538bdc53498d10cca25079d.jpg","description":"When a small mining community falls silent, a young soldier named Daltyn is sent to investigate. Upon arriving in the remote mountain town of Karthas, he discovers that paranormal forces have sealed the town off from the outside world. Now trapped, he's left with no option but to explore the mines below the town and uncover the source of the disturbances.\nSix huge procedurally-generated areas await, each lovingly crafted in a retro pixel art style. Help Daltyn gain new abilities and equipment, evade dangerous traps, and defeat hordes of deadly enemies in order to save Karthas - and possibly the world!Key FeaturesExplore six massive procedurally-assembled areas from hand-crafted rooms\nEnjoy challenging retro gameplay and authentic pixel art (384x216 native res.)\nBattle massive bosses and discover new abilities to reach previously inaccessible areas\nCustomize your character by equipping armor, weapons, and spells\nWindows, Mac, & Linux versions with Gamepad support","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Bit Kid","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":7778,"name":"Always Sometimes Monsters","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/10a/10a6168ea3d6ad2c14f5c218477a990b.jpeg","description":"###Sad story\nMade by two developers from Canada in the RPG Maker, the game tells the story of the author who receives a note that the love of his life marries another on the other side of the country. Before the wedding, there is a month, and at this time the player needs to get to the opposite part of the country and return his love. In addition, the main hero was overtaken by the creative crisis and couldn't finish the manuscript of his book. The landlord adds trouble too by expelling him from the apartment for debts.\n\n###Key Features\nThe game continues for 30 virtual days, for which the main character needs to solve one task. How - is the choice of the player. Most decisions made influence the further development of the story, each completion can be unique because the goals can be achieved in different ways. In the game, not only the plot is the non-standard for the genre but also the combat system, which is simply not there. Instead, the game offers the player to understand the relationship of in-game characters and build emotional connections with them. The game has a fairly elaborate character customization system: you can adjust the gender, age, sexual orientation. In addition to the cosmetic effect, it affects how the main character will react in the virtual world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1713,"name":"OlliOlli","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0df/0df3e72c789c89f7e29fe776acb40cfa.jpg","description":"OlliOlli is a skating simulator, is an indie-game developed initially for handhelds, e.g., PS Vita. It is the first title of the series with the second numerical part of the series a year afterward.\n\n###Gameplay\nThe player is presented with the 2D world, which is filled with the ramps, cliffs, railings, and another environment to perform tricks on. As in many titles of its sort, the player gets bonuses for the number of stunts, safety landing and doing combos. The world consists of 50 levels: each one has 5 (250 overall) trophies, accomplishing every one of them unlocks the next level and so on. \n\n###Stylistics\nThe game features pixel-art graphics presuming the level design to be minimalistic. Such style, nevertheless, brings a unique trait to the game's mechanics. While it doesn't feature any of the usual skateboarding title's trampolines and pools, the minimalistic nature of the Olliolli brings the hardcore out and forces the one behind the controller to mash the buttons repeatedly, memorizing the playthrough during the entire level. Final parts of the game resemble the hardcore platformers like Super Meat Boy more than they resemble traditional skating games like Tony Hawk.\nThe title is also being praised for the soundtrack — it matches the indie stylistics and is available for sale separately.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":28203,"name":"Forza Motorsport 7","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ff/2ffc64e3c5569e29627aeb8b8637d693.jpg","description":"Forza Motorsport 7 immerses players in the exhilarating thrill of competitive racing. From mastering the new motorsport-inspired campaign to collecting a wide range of cars to experiencing the excitement of driving at the limit, this is Forza reimagined.\n \nThe best-looking, most realistic game we’ve ever created – Forza Motorsport 7 was built from the ground up for Xbox One X to be an immersive true 4K and 60fps experience. Plus, with HDR and race conditions that change each time you return to the track, Forza Motorsport 7 was crafted as a visual masterpiece.\n \nThe ultimate automotive playset – Forza Motorsport 7 features more than 700 ForzaVista cars to collect, race and customize and 30 racing environments with more than 200 ribbons. Plus, Forza Motorsport 7 offers more Porsche models than any racing game and an unparalleled portfolio of car manufacturers, including every premium brand. And for the first time in Forza’s history, players can personalize their appearance with a massive race gear collection that includes hundreds of options spanning decades of race history and pop culture.\n \nEveryone can play, compete and watch – Forza Motorsport 7 continues in the footsteps of previous games by providing unprecedented tuning, new Assists and Mods to suit players of all skill levels. And thanks to the Forza Racing Championship ESports league, enhanced spectating modes and Mixer integration, everyone can compete.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Turn 10 Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9658,"name":"Warhammer 40,000: Eternal Crusade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/724/72465528abeee31c16502e947a1a9e13.jpg","description":"Warhammer 40,000: Eternal Crusade is a real-time strategy game developed by Relic Entertainment. This is the fourth part of the Dawn of War series. \n\n###Plot \nThe game is set in a dystopian vision of the future. In the universe, humanity developed a galaxy empire called The Imperium of Man. The main characters are humans and galaxy monsters, such as the Space Marines, the Eldar, and the Orks. The player aims to perform in battles and make points. These points can be used in the shop as an exchange for new items. \n\n###Gameplay \nThe player can choose his protagonist: it may be anyone from the races and factions except for the Tyranids, an army of enemies. The player can buy different items, such as weapons or the character’s appearance. He can also change the chosen race or faction during the game. Eternal Crusade features classic RTS visuals like galaxy views, rockets, spaceships, explosions, and lots of vehicles. The player can track his progress by advancing through classes: they differ from infantry to ground assault. It lets the player join veterans and elites of the universe. \n\n###Gameplay development \nThe developers launched the founder program before the game was released; it let the players buy additional packs and get the game keys and bonuses before the release.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Behaviour Digital","platforms":[{"id":0,"name":"PC"}]},{"id":22837,"name":"Syndicate Plus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/253/2537a892d72f5e49f13669e9455e1e03.jpg","description":"In the dark and twisted cities of tomorrow, corporate syndicates compete for global dominance. But the boardroom deals and corporate takeovers of the future look very different from today: they are lead by marketing directors who manage teams of half-men, half-machine cyborgs with no conscience and plenty of guns.\n- Includes Syndicate and the American Revolt expansion.\n- Amazing level of immersion created by smooth gameplay, intense music, fantastic sound effects, and stylized cyberpunk visuals.\n- More than 50 missions that include extraction, extermination, and (forced) persuasion.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Classic Macintosh"}]},{"id":3628,"name":"Sacred 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79b/79bcdd4724582082bebdfc106c939d94.jpg","description":"Sacred 3 is a hack’n’slash game, a third installment in the series.\n\n###Plot\nThe game starts with a brief introduction to the fantasy world of Ancaria. The realm prospered for a long time, until the ruler of the Ashen Kingdom struck a deal with demons, and invaded his neighbors. The player must take action as one of the six playable characters, each with different classes and abilities, and save the world.\n\n###Gameplay\nThe third game of the series has shifted from being an RPG diablo-like game to an arcade slasher, removing skill trees and development, while adding even more enemies, dynamic action and refined physics. Each level in the campaign shares similarities with one another, as the objectives are simple: defeat enemies, reach the checkpoint, defeat the boss and unlock the next level.\n\n###Graphics and other features\nThe game is rich with fantasy characters, colorful landscapes and well-designed enemies. The special effects in battle provide the player with an arcade touch: blood splatters from every foe, mysterious explosions occur to left and right, ground quakes from fearsome bosses.  The game features a 4-player cooperative mode, where players take up arms as different heroes and join in battles against hordes of enemies.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":19609,"name":"Lost Planet 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/178/1783e3c7516c4b4c081545cdc3e10e5a.jpg","description":"Lost Planet 2 is a third-person shooter, the second installment in Capcom’s Lost Planet series. \n\n### Plot  \nThe game takes place on E.D.N. III, a planet full of hostile alien insectoids named Akrid. The story begins ten years after the events of the original game. The climate of E.D.N. III starts getting warmer. Military organization NEVEC begins a dangerous operation to exploit a unique Akrid Cat-G. The game consists of six episodes. In each of the player controls different characters, mainly from NEVEC’s spec-ops. \n\n###Gameplay \nThe game is divided into six episodes. Each of them consists of several chapters that in their turn consist of several missions. There are no checkpoints during the missions, so each of them requires a player to complete it in one sitting without dying. The player explores levels both by foot and via special mechanized armor suits known as Vital Suits. The Vital Suits have their own set of heavy weapons such as rocket launchers and chainsaw. On foot, the player can use a grappling hook to reach remote places or hang on other Vital Suits. \n\n###Multiplayer \nThe game has the strong emphasis on multiplayer. It offers both cooperative and competitive modes. Versus multiplayer shares many similarities to previous games, adding new game modes and customization options.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":16182,"name":"Revolution Ace","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/808/808808c9ddbc895a1b784e08d1ba05b8.jpg","description":"Revolution Ace is a top-down tactical shoot-em-up game developed by Laser Guided Games.\n\n###Setting\nIn a distant future, humanity is on the verge of total extinсtion after a long war against sentient artificial intelligence. Humans scrap all the resources they have left and attempt a last attack on the machines. You are a soldier of the resistance, an air force pilot who joins the attack.\n\n###Gameplay\nThe gameplay of Revolution Ace bares a close resemblance to classic top-down scrolling shoot-em-ups with several key additions. For example, the players are free to modify their plane as they see fit since a progression system is present in the game. You start off with a simple plane that can be equipped with new weapons and armor upgrades.\n\nSince air, land, and sea enemies are present in the game, the plane that is piloted by the player is already packed with several air-to-land missiles and machine guns. Over 20 weapons are available for the plane. It is also possible to equip perks to obtain passive bonuses, such as an improved armor shielding or piercing bullets.\n\nUnlike in classic shoot-em-ups, your armor does not go down with the first shot it takes. This was made to focus the player's attention on killing enemies rather than on dodging bullets like in bullet hell type of games.\n\nThe game also features a two-player online or local cooperative mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Laser Guided Games","platforms":[{"id":0,"name":"PC"}]},{"id":5692,"name":"TimeShift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ad/7adc6352280fe0e6626902e444e22195.jpg","description":"Master time to become the ultimate weapon!\nDr. Aiden Krone has made a Time Jump across the space-time continuum - a reckless act with frightening consequences. Now, a disturbing alternate reality has evolved within the bleak and rain-soaked Alpha District. Armed with the experimental Beta Suit, you alone are able to slow, stop and reverse the flow of time. Only with this ability can you lead the uprising to victory and put an end to Krone's madness.\nHarness time as the Ultimate Weapon: Slow, stop and reverse the flow of time to destroy your enemies\nUnleash a powerful arsenal of weapons and vehicles in 24 combat missions\nUp to 16-player multiplayer, featuring the use of time grenades in 14 different maps, allowing for unique style of slow, stop and reversal of time\nCompletely customize your multiplayer experience with over 40 different features to fit your style of gameplay\n\nTimeShift only supports multiplayer connectivity over LAN or direct connection.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":251525,"name":"Project Winter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66c/66c766bd3a4fae2685473a4320ad168c.jpg","description":"Survive & Escape in this 8 person multiplayer game of Teamwork & Betrayal.\nIn the middle of a harsh winter, eight strangers find themselves trapped in a log cabin in the woods. Encounters with wildlife are inevitable, and the ever-present winter elements will make it difficult to survive alone. Teamwork is essential in this game of survival.  In the struggle to endure, players are stronger together and weaker apart. Lurking amongst them are those that are capable of deadly deceit and treachery.\nPlayers are randomly assigned into two roles: Survivors and Traitors. Survivors must work together as a team, gathering resources and completing objectives to escape. They must also identify the traitors trying to stop them. Traitors are unknown to survivors and work together to gain the trust of other players, while sabotaging their efforts. Players must keep an eye on health, warmth and hunger, as well as be aware of who they trust.\nYour goal is to Survive Amongst Wolves.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Other Ocean Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":22911,"name":"Syndicate Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/458/458b15ae352f92a2cb160d16c03dd4cf.jpg","description":"“Remember, the meek shall inherit nothing.” - The Book of Cataclysm\nCongratulations on becoming our newest EuroCorp Executive! You now hold the distinctive honor of being one of the few who will determine the shape of our Company. Your EX-ALFA3 clearance allows you to use the Marionette Remote Drone Operation Suite. Your squad of Agents will follow every order without fail or question, and you are free to eliminate or destroy any targets as you see fit. This will serve you well as those zealots of the Church of the New Epoch think they can compete against our Company. Your mission is to remove them completely. To that end, we have transferred 50,000 EuroCorp credits to your account. Failure to use your funds wisely or to eliminate the competition will require you to auto-euthanize. We feel confident that your skills and integrity will ensure that this state of affairs will never arise.\nSincerely,\nThe EuroCorp Board of Directors\nWelcome to an urban hell of ultra-violent mayhem. Welcome to Syndicate Wars where you’ll take control of a squad of cybernetically enhanced Agents and wreak havoc on the enemy. Funnel money towards research that will allow you to upgrade your team and make them into more efficient killing machines. Use the environment to assassinate, destroy, and eliminate your targets all from a classic isometric perspective. If you need cannon fodder, why not set your Agents loose armed with Persuadertrons to control huge crowds, or even enemy agents, and get them to do the dirty work for you? So whether you’re keeping EuroCorp in the black or burning infidels for the New Epoch, Syndicate Wars will have you giddily carving a path to victory. Welcome to the merciless future of violent squad-based real-time tactics!Rob a bank with a nuclear grenade! Bring the house down--literally! The environment is fully destructible!\nPlay either side as EuroCorp Syndicate or Church of the New Epoch.\nFuturistic weapons--the Persuadertron, Electron Mace, Satellite Rain, Nuclear Grenade--give you all kinds of nuking, electrocuting, propagandizing fun!","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":20612,"name":"Hotline Miami 2: Wrong Number Digital Comic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd3/cd3ce589bed4a811cceda3dd57754ec4.jpg","description":"Download the Hotline Miami 2: Wrong Number digital comic series by Dayjob Studio and dive into the backstory of several factions on a path to confrontation. The entire five-part series is free to download and comes in a single app that launches from your Steam library.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dennaton Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13858,"name":"Fran Bow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f77/f77b685304e3c05087aed1d18a7b667f.jpg","description":"Fran Bow is a creepy adventure game that tells the story of Fran, a young girl struggling with a mental disorder and an unfair destiny.\nAfter witnessing the gruesome and mysterious loss of her parents, found dismembered at their home, Fran rushes into the woods, together with her only friend, Mr. Midnight, a black cat that Fran had previously received as a present from her parents.\nIn the forest, Fran goes into shock over the loss of her parents and when she recovers, she’s at Oswald Asylum, an oppressive mental institution for children, and Mr. Midnight is nowhere to be found.\nAfter having a dream about her beloved cat, Fran decides to escape from the mental institution to find him and go back home to Aunt Grace, her only living relative.\nFeatures\nStory driven creepy psychological horror adventure game.\nUnique and peculiar hand drawn 2D Art-Style and 2D animation.\nSelf administer medication to open the terrible hidden world that will help solve puzzles and find objects.\nA big variety of puzzles designed with different levels of difficulty and specifically based on the story.\nThree arcade inspired mini-games all with different art style to be part of the transitions in the story.\nInteractive and occasionally playable pet cat, Mr Midnight.\n50+ interactive unique characters with unique personalities.\nOriginal Soundtrack.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Killmonday Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":48897,"name":"Opus Magnum","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dda/dda32189c8a4a0231fa9bd8012f72df1.jpg","description":"“It is not an exaggeration to say that without alchemical engineering, civilization would not exist.”\nHailed as the most promising alchemist of his generation, Anataeus Vaya has just accepted a position as Head Alchemist of House Van Tassen, the oldest and richest of the city’s ancient Houses. But dangers lurk behind the family’s opulent facade, and alchemy alone may not solve every problem.\nOpus Magnum is the latest open-ended puzzle game from Zachtronics, the creators of SpaceChem, Infinifactory, TIS-100, and SHENZHEN I/O. Master the intricate, physical machinery of the transmutation engine— the alchemical engineer’s most advanced tool— and use it to create vital remedies, precious gemstones, deadly weapons, and more.\nDesign Machines - Design and build machines that carry out alchemical processes using a variety of components including programmable arms, customizable tracks, and more esoteric devices like Van Berlo’s wheel and the Glyph of Animismus.\nOpen-Ended Puzzles - Compete against your friends and the world to build the simplest, fastest, and most compact solutions to the game’s challenges. Export animated GIFs of your elegant designs to show them off.\nSteam Workshop - Make and share your own puzzles with full Steam Workshop integration and an easy-to-use puzzle editor. Play the top user-submitted puzzles in the prestigious Journal of Alchemical Engineering, curated by Zachtronics!\nRich Story - Intrigues and dark plots swirl around the city’s ancient Houses. Alchemists, who hold the power to create almost anything known to science, are highly sought— and highly dangerous.\nSolitaire Minigame - Alchemical engineering takes focus and concentration. Take a break with Sigmar’s Garden, an original alchemy-based solitaire game. Every game is winnable, but not every game will be won…","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zachtronics","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1657,"name":"Tumblestone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe8/fe81a278bb7fa0fa73a30bf77afcea50.jpg","description":"Tumblestone is the first original action-puzzle game of the past fifteen years. Race your friends in multiplayer or challenge yourself in story mode. Solve progressively more difficult and creative puzzles, help a sausage make friends, and find out what happened to the Tumblecrown. Your friends play for freeYou can generate an unlimited number of free Steam keys to send to your friends so that they can play with you online, up to five games per day. Key FeaturesCompetitive multiplayer: Tumblestone's intense puzzle-solving action will turn playing \"just a few more rounds\" with friends into a late-night Tumblestone marathon.\nLocal multiplayer: Up to four players on a single computer.\nOnline multiplayer: Play online against your friends or make new ones using Tumblestone's ranked matchmaking system.\nBots: Have an open slot? Play against the computer. But can anyone withstand the punishing Nightmare bot?\nStory mode: The 40+ hour story campaign will test your puzzle-solving prowess. Featuring 10+ gameplay modifiers, challenge puzzles, and boss battles.\nArcade modes: Kick back and relax with the casual Marathon mode, scratch an intellectual itch with the Infinipuzzle mode, or get your blood pumping with the fast-paced Heartbeat mode.\nLeaderboards: Online leaderboards let your friends know you're better than them.\nQuests: Hundreds of unique quests to complete.\nStats: Rank up, then compare how you stack up against your friends.\nPersonalization: Choose from a dozen unique characters and environments.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Quantum Astrophysicists Guild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4304,"name":"The King of Fighters XIII","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad7/ad7b8d629f5df8f26d3924111cce87cd.jpg","description":"With the triumphant return of fan favorite characters like Mai, K', and Vice, extensive refinement of the core fighting engine based on community feedback, and vastly improved network functionality, The King of Fighters XIII™ represents the HD entry in the series that fans have been waiting for.\n© SNK PLAYMORE 'THE KING OF FIGHTERS' is a registered trademark of SNK PLAYMORE CORPORATION. Published by ATLUS. Exclusively distributed by Index Digital Media, Inc.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"SNK","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":14829,"name":"Turok: Dinosaur Hunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61f/61f183e3d12c7846ed6bd3c027a9fa47.jpg","description":"Turok is back and no dinosaur is safe! When it was first released in 1997, Turok introduced gamers to a world teeming with cunning enemies, traps, puzzles and deadly weapons all within a vast 3D environment ready to explore. Now the classic game has been restored and enhanced with a new visual engine and exciting new features to sink your teeth into!\nNew features include:\nSupport for high resolutions, and widescreen\nImproved gameplay and level design\nOpenGL for video backend to provide portability and support for vertical sync\nDynamic lighting, bloom, FXAA, enhanced water effects, lights shafts and more\nAbility to freely rebind all keyboard, mouse, and gamepad inputs\nSteam Achievements\nThe Lost Land...\nA world where time has no meaning - and evil knows no bounds. Torn from a world long gone, the time traveling warrior Turok has found himself thrust into a savage land torn by conflict. An evil overlord known as 'The Campaigner' seeks to shred the fabric of time and rule the universe using an ancient artifact known as 'The Chronoscepter'. The Chronoscepter was shattered thousands of years ago in an effort to keep it from falling into evil hands. The Campaigner has constructed a massive focusing array which he plans to use to magnify and pervert the power of the Chronoscepter in order to shatter the barriers between the ages and rule the universe. Turok has vowed to find the eight pieces of the Chronoscepter spread throughout the Lost Land and put an end to The Campaigner's evil plot...\nTo learn more you must enter the world of Turok\nCompletely 3-D Virtual World\nRun, jump, climb in any direction in a fully 3D world, with the ability to independently look and aim your weapons up, down, or sideways.\nIntelligent Enemies Programmed for Ferocity\nVariable aggression profiles make each enemy behave uniquely.\n14 Monstrous High-tech Weapons\nFrom the Grenade Launcher, Plasma Pulse Rifle and Alien Weapon, to the Quad Rocket Launcher and, the mother of all guns, the Atomic Fusion Cannon!\nAdvanced Interactive Backgrounds with Particle Technology\nCobwebs sway. Bubbles form rings on the water's surface. Bullets ricochet. Trees explode into flames and crash to the ground. Waterfalls boil with foam.\nBionically Engineered Dinosaurs\nRazor-toothed Raptors. Artillery-packing Triceratops. Alien Infantry and a Laser-Guided T-Rex. Following your every move with head-tracking technology.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Nightdive Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":3327,"name":"FINAL FANTASY TYPE-0 HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d02/d02c886eb3b04a18bebe4bc4f085053a.jpg","description":"FINAL FANTASY TYPE-0 HD is an HD remaster of FINAL FANTASY TYPE-0 developed by Square Enix.\n\n###Plot\nFINAL FANTASY TYPE-0 takes place on a fictional continent of Orience, which had been divided by four nations that call themselves the Crystal States. Each nation has a power crystal, which became their national symbols. \n\nThe crystals can mark humans as residents of a specific state. From time to time, some servants of the countries appear. They are blessed with the ability to transform into a crystal and have a prolonged life cycle. These people lose their memories other time, so they are given one specific task to complete. \n\nThe apocalypse is coming. Only several chosen ones can stop it from happening.\n\n###Gameplay\nThe game features a real-time combat system that somewhat resembles the same system from the previous games by Square Enix. The players control several playable characters at the time, as when the players assume control over one of the characters, the other characters are handled by the AI. \n\nEach character has their own weapon, unique attacks, and abilities, which can be upgraded further into the game if the player has enough points that are gathered after leveling up the characters.\n\nThe players can focus their attacks on one enemy and execute critical hits on them or get a rare opportunity to one-hit kill the enemy. All the skills of your party can be used together to execute a special combo attack that deals a great amount of damage to the enemy.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":191,"name":"Jetpack Joyride","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed3/ed321d61cfd2348917a1b9060ec341d7.jpg","description":"###Blast from the past\nA hit for mobile devices, released in the distant 2011 when the platform was just starting to move towards games. The game is an endless side-scrolling runner, the first time it appeared on devices running the iOS. Later the game was ported to other platforms, among which two unusual for the first decade of the twenty-first century: browsers in the form of the flash game and Sony Playstation Portable. The last game could be downloaded using the PlayStation Network. The game is often compared to another mobile hit of the era - the game Fruit Ninja, in which the player needs to cut fruits.\n\n###Key features\nThe game uses simple one-button control, for which the player can quickly adapt. Pressing the button raises the main character, and if the player releases the button, the protagonist falls. The game has a huge number of upgrades and a lot of enemies. Levels are full of obstacles, in order to get to the next, you need to fly a certain distance, after which the visual style of surroundings and enemies will change. The further you fly, the harder it is.\n\n###Continuous support\nDespite being released a long time ago, developers are still updating the game. The story tells about Barry Steakfries, who worked as a vendor in the gramophone manufacturer. The company eventually closed due to poor sales and the main character ended wandering the streets where he stumbles upon a jetpack. Dreaming of such a device in childhood, the main character does not hesitate to put it on and goes on the adventure.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Big Ant Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"}]},{"id":546464,"name":"FIFA 22","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/355/355d2ec5d6b87518228dc30a9bb0e70d.jpg","description":"HyperMotion integrates advanced full-team mocap data and machine learning to heighten gameplay in every match in FIFA 22, harnessing the power of next generation consoles to deliver the most realistic, responsive and fluid gameplay experience we’ve ever built. FIFA 22 brings a new season of innovation across every mode in the game; enjoy more consistency between the posts with a goalkeeper rewrite that brings more composure to the most important position on the pitch, live out your football dreams as you create and manage your custom club to glory in Career Mode, get rewarded for your flair with restyled gameplay in VOLTA FOOTBALL, welcome back football’s most memorable players as FIFA Ultimate Team™ Heroes, and feel the atmosphere of your next big game with the most immersive matchday experience ever seen in EA SPORTS FIFA.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Electronic Arts Vancouver","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":251596,"name":"Observation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/593/593efcd141bed7bae0b44926faedd0ba.jpg","description":"Observation is a sci-fi thriller uncovering what happened to Dr. Emma Fisher, and the crew of her mission, through the lens of the station’s artificial intelligence S.A.M. Players assume the role of S.A.M. by operating the station’s control systems, cameras, and tools to assist Emma in discovering what is happening to the station, the vanished crew, and S.A.M. himself.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":18304,"name":"Men of War: Assault Squad","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31b/31bac382a13d14c5748b481326f4092b.jpg","description":"Men of War: Assault Squad is a real-time strategy game developed by Digitalmindsoft. It is a stand-alone expansion pack to Men of War.\n\n###Story\nThere is no fictional plot present in the game. Instead, the players take part in real battles of World War II. \n\n###Gameplay\nThe game features multiple singleplayer campaigns for the U.S. Army, Vermacht, Great Britain, the USSR, and Japan. Nonetheless, the game does not focus on these campaigns much, as they are only used to introduce the players to the core mechanics of the game before allowing them to compete in the game's multiplayer mode.\n\nEach campaign consists of 5 missions, 3 of which focus on the assault on the positions of the enemy, with the next one revolving around holding your own ground and counter-attacking the enemy forces. In the last mission of any campaign, the players have to control a small squad that is sent out behind the enemy lines to sabotage the enemies' defense.\n\nDuring the game, the players take control of specific combat squads and armor, that can be called in by using the reinforcement points. These points are awarded to the player upon capturing and holding the control points. The capture of new positions allows for purchasing new vehicles and troop upgrades. The main objective of any singleplayer mission is to capture all the points on the map.\n\nMen of War: Assault Squad comes bundled with a map editor.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Digitalmindsoft","platforms":[{"id":0,"name":"PC"}]},{"id":557,"name":"Kingdom Rush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dda/dda72bb771ccb6099a9f04fed1d154c9.jpeg","description":"Kingdom Rush is a tower defense game, the first installment in Kingdom Rush series. The game was initially released as a flash game by Armor Games but later received ports for iOS, Android, Windows, and Linux. \n\n###Gameplay\nThe gameplay of Kingdom Rush shares many similarities with other tower-defense games. On each level, you have to defeat your town from waves of enemies crawling across the map.\nTo do so, you place towers which automatically attack enemies that get in their range of attack. There four types of towers in Kingdom Rush: Ranged Towers, Melee Towers, Mage Towers, and Artillery Towers. Ranged Towers shoot arrows at any enemy that gets in their sight. Melee Towers spawn troops that march towards enemies and engage in close combat. Mage Towers fire magic bolt that is especially effective against armored enemies. Artillery Towers are the slowest and the most expensive ones, but they deal much damage and can hit several enemies with one shot. Aside from placing towers, a player can use special abilities such as meteor strikes that directly damage any emeries on the map. \nThere are 12 levels in the primary campaign and several extra levels that can be unlocked after beating the game. Additionally, there is an Endless mode with one map that lets player stand against infinite waves of enemies for as long as they can.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ironhide Game Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Web"}]},{"id":327,"name":"Toki Tori 2+","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe8/fe8cb32a27b3dfda006209ca2feff24c.jpg","description":"###Re-re-re-re-release\nDespite its cute appearance Toki Tori 2+ is a challenging puzzle adventure experience. It offers the player a unique take on popular Metroidvania gameplay - you progress by exploring, observing and experimenting with a game’s world. The game was developed by Dutch studio Two Tribes and is a sequel to 2001 original release of Toki Tori. An enhanced version of the game became available in autumn 2013 first on Nintendo Wii U. The game has a long life - it was released again but this time on Nintendo Switch in 2018 in 60 FPS and support for HD Rumble on Joycons. The game also tried on mobile market: it is available for iOS and Android. \n\n###Key Features\nYou play as a yellow chicken called Toki Tori. One day it receives a telepathic message from all over the country. Five Ancient Frogs asking for help destroy the floating crystal endangering everything. Gameplay-wise the game is very different from its predecessor: for example, Toki Tori cannot use items. Instead, the protagonist gained two skills that help Toki Tori manipulated the game world and its inhabitants. The team of developers continues to support the game, fix bugs and add new features on a regular basis: thanks to the recent release on Switch, players got the ability to fast travel and some control adjustments.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Two Tribes","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Wii U"}]},{"id":397471,"name":"The Suicide of Rachel Foster","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/238/238df3e0dd805f3b0bef671909d22de8.jpg","description":"1993\nLEWIS & CLARK COUNTY, MONTANA, US\n\nTen years ago, teenager Nicole and her mother left the family hotel after discovering her father Leonard's affair with, and pregnancy of Rachel, a girl her own age who eventually committed suicide.\n\nNow that both of her parents have passed, Nicole hopes to fulfill her mother’s last will to sell the hotel and make amends to Rachel's relatives. She returns to the hotel with the family’s lawyer to audit the decaying structure.\n\nAs the weather unexpectedly turns for the worst, Nicole has no way to leave the large mountain lodge, and finds support in Irving, a young FEMA agent, using one of the first radio telephones ever built.\n\nWith his help, Nicole starts to investigate a mystery far deeper than what people in the valley thought. A story of love and death, where melancholy and nostalgia melt into a thrilling ghost tale.\n\nFeatures:\n- Explore the vast and detailed hotel, unravelling dark secrets of the family's past\n- Binaural audio for a truly immersive experience\n- Intriguing, touching and mature storytelling\n- Multi-layered narrative thriller, combining elements of mystery and horror","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ONE-O-ONE GAMES","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20554,"name":"Worms Pinball","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df5/df5eee47410d0625f4f2ef708c95faf9.jpg","description":"Worms Pinball is a modified version of Team 17’s game Addiction Pinball. The PC version was initially released in 1998 and PlayStation port in 2000. While Addiction Pinball had two playable tables: one based on Worms and one on World Rally Fever. The Worms pinball version included only the first one. The PC version used to be only available as part of The Full Wormage Collection or alongside Worms Blast before it was re-released on Steam in 2012. \n\n###Gameplay \nThe gameplay is mostly similar to other pinball games. You control to flippers at the bottom of the playfield.\nYou launch the metal ball to the top of the table and use flippers to prevent it from falling to the drain. The points are by different targets with the ball. There are five areas: Arctic, Mars, Jungle, Desert, and Hell. The player has to complete different missions and acquire new weapons. For example, you have to glide iconic Worms’ Ship Sheep with flippers. There are three difficulty levels that affect the number of balls available to the player. \nThe developers claimed to do extensive research to emulate the pinball physics as accurately as possible. \n\n###Design \nThe player can choose from four viewing angles. Most of the sound effect are rehashed from previous Worms games. The table design features a lot of the series characters and significant items.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":2310,"name":"Mighty No. 9","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb0/fb05d26860505d5bc58619f9b8359c15.jpeg","description":"Mighty No. 9 is a sci-fi game that strongly resembles the classic Mega Man series.\n\n###Plot\nThe main protagonist is Beck, a battle android from the Mighty Numbers series (his number is 9). A virus attack led to a machine uprising, and Mighty No. 9 is among the few robots that were not infected. His creator, Dr. White, sends him to stop his rampaging kin and find out who is behind the attack. The Xel technology allows Beck to bring his fellow Numbers back to reason. He will also assimilate their data to send it back to the lab so that Dr. White could find the cure for the virus. Beck is occasionally assisted by Call, a female robot unaffected by the virus.\n\n###Gameplay\nThe player controls Beck in a 2D environment. Like in Mega Man, the protagonist jumps platforms and fires a gun. Beck can also use the special acceleration ability that allows him to leap long distances and through his enemies. By leaping through injured opponents, Beck can assimilate their Xel to receive a temporary power-up. The type of a power-up depends on the color of a Xel: red gives Beck more powerful attacks, green speeds him up, yellow improves his stamina, and blue heals him. Gathering Xel from Mighty Numbers, Beck receives new special abilities.\n\n###Multiplayer\nThe game includes a cooperative multiplayer for two, in which the second player controls Call. Her gameplay is very different and is largely defensive as she uses deflector shields to protect herself and Beck.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"}]},{"id":662,"name":"Waking Mars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1dd/1ddb8ea784f98fc8cb77c0e5ccd28105.jpeg","description":"###Best for mobile\nThe game is an adventure-platformer, where the player takes control over the main character, traveling through the Martian caves. You will have to manage the thrust of the jetpack that the protagonist has. The game was released on the PC in 2012. Before this, it was repeatedly recognized as the best game for mobile devices.\n\n###Key features\nThe game is set in the future. In 2097, humanity finds life on Mars and sends researchers to make the first contact. But something goes wrong, and one member of the expedition is imprisoned in underground caves, one on one with turbulent alien flora and fauna. The player must learn the features of the underground Martian inhabitants in order to escape unscathed to the surface and learn the secrets of the Martian past. The developers claim that the cave network is open for exploration, in which it is possible to find long-lost ruins and mysterious ciphered signals. The game also has a mechanic for growing alien organisms in order to feed them to others and thus move along the underground labyrinths. The game has almost no aggression: for example, the main character can not shoot and to solve puzzles, you need to use the physical engine model. The game supports both classic inputs for a mouse and keyboard or a gamepad.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Tiger Style","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1981,"name":"Lovely Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/458/4589cd61f57fe507df050370e16738eb.jpg","description":"The game is a first-person shooter with an emphasis on maximum speed passing - maximum speed, on the one hand, is one of the goals, and on the other - passing at high speed is more consistent with the circumstances of the game, it contributes to successful passing.\n\n###Plot\nThere is no plot for the game, there are repetitive elements that carry the obvious meaning - where to shoot and what to get. Any touch to the \"enemies\", any falling or getting a bullet in the hero leads to instant death. The hero does not have spare “lives”, so you have to use the save game function.\n\n###Gameplay\nThe game does not involve \"exploring the world\", you can move mainly forward. But each level has its own “micro-levels” contained within larger areas.\n\nThe player has a weapon that shoots - but the blue squares that represent the bullets in this game fly much slower than the bullets, their trajectory is visible. This feature, combined with the requirement to complete the game as quickly as possible, creates one of the fascinating difficulties of the game.\n\nYou have to shoot not only at fixed objects, but also at moving objects. For example, there is a category of objects that fall from above, and you need to shoot them while they are flying - if you allow the collision of these objects with the ground, the player dies.\n\n###Indicators\nThe game evaluates the passage of the level of a three-point system, where three points means the passage with the maximum accuracy and maximum collected items.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"tinyBuild","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19580,"name":"Steel Storm: Burning Retribution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23a/23a9831eb644ffc7fed0d5817aaab32d.jpg","description":"Steel Storm: Burning Retribution is the second episode of the Steel Storm series. It’s a top-down arcade shooter where you control a hovertank and need to kill dozens of AI enemies. While Steel Storm was a free game, Burning Retribution was released as a commercial project.\n\nThe game is set in a science-fictional universe on a planet attacked by highly-technological aliens. Steel Storm’s single-player campaign is split into several missions where you need to destroy objectives and clean up locations. During fights you can collect boosters and upgrade your vehicle. The in-game world is completely destructible with the fast-paced action and explosions you can set. \n\nHowever, the game is focused on multiplayer experience. It features deathmatch and a cooperative playthrough, with up to 16 players in every mode. There are also additional challenges in the game. If you complete them, you can unlock first-person camera perspective to look at the game at the different angle.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Kot in Action Creative Artel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3763,"name":"Tales of Symphonia (2014)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/459/459a3bd05e0f59fce631897e3d6f2f6e.jpg","description":"THE EPIC BATTLE FOR SURVIVAL\nIn a dying world, legend has it that a Chosen One will one day rise from amongst the people and the land will be reborn. The line between good and evil blurs in this epic adventure where the fate of two interlocked worlds hangs in the balance.\nAN EPIC ADVENTURE – Over 80 hours of gameplay in this epic, emotionally charged storyline.\nREAL-TIME 3D BATTLE SYSTEM – Experience the fierce, action-packed battle system. Combine hundreds of special attacks and magic spells.\nA CLASSIC ART STYLE LIVES ON – Become absorbed in endearing cel-shaded characters designed by renowned artist Kosuke Fujishima\nFIRST TIME ON STEAM – Based on the PlayStation®3 port of the original GameCube game, this RPG classic is finally available for PC.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]}]