[{"id":313748,"name":"The Procession to Calvary","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/437/437ef2730e0b5efb3a268ea2c7e7c7c0.jpg","description":"A time to love, and a time to hate; a time for war, and a time for peace. Ecclesiastes 3:8About\nHuzzah! The holy war is over! Your oppressors have been vanquished, the churches of the Old God lay in ruin and thousands of innocent people have been murdered! But it's not all good news; the tyrant Heavenly Peter has escaped your clutches, and you have been tasked with the mission of finding him...\nYour journey will take you through a richly detailed landscape built from hundreds of different Renaissance paintings. You will steal a ship, feed a donkey, compete in a talent contest, assist an inept street magician, sing, dance, play the (magic?) flute, poke a man's face, hunt for treasure and have a chat with Our Lord God Almighty... But will you find Heavenly Peter? And if you do, how will you take your revenge!?Features\nPointing and Clicking – A traditional point and click interface, with a 'verb coin' interaction menu and a simple inventory from which you can drag and drop your preciously hoarded items.\nRenaissance Artwork –  Paintings by Rembrandt, Botticelli, Michelangelo and many more are brought together into one consistent world, in a way that is also as sympathetic as possible to the original works.\nClassical Music – a soundtrack selected to fit with the style of the artwork. Music from classical composers such as Vivaldi, Bach and George Frideric Handel will accompany you on your journey.\nStandalone Story - The Procession to Calvary is set in the same world as Four Last Things, but it's story can be played independently.\nOptional Murder – You will be equipped with a sword. This will become useful in a number of different situation, but you will be strongly discouraged from using it on people. Ignoring this advice - and murdering anyone who stands in your way – will serve as a useful method of skipping any puzzles you don't like. But be warned; your actions might come back to haunt you...\nNonsense – A style of humour reminiscent of the surreal, anarchic comedy of Monty Python. Lofty subject matter is treated with refreshing flippancy. Gags about butts are taken very seriously. But rest assured, while some of the jokes may be ridiculous, the puzzles make perfect sense! (or at least adhere to a consistent internal logic)\nMoments of Surprising Profundity – Actually, no... Don't read too much into it.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Joe Richardson","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":61004,"name":"Meteor 60 Seconds!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb1/fb1ed494009170636bc775031a88ced4.jpg","description":"Meteor 60 seconds! is a simple, fun, comic-like action game that simulates your life if there were a meteor heading towards Earth and you had 60 seconds to live. Do anything you want to do with your last 60 seconds, even if it's illegal! What about planting an apple tree?Story\nNASA recently stated that a massive meteorite will collide with Earth soon and that Earth will be destroyed!\nSurprisingly, we all only have 60 seconds left to live before the earth is destroyed!\nWhich means YOU ONLY HAVE 60 SECONDS LEFT TO LIVE!!\nWhat will your choice be...?Features\nSimple, fun side-scrolling action game\nComic-like story\nMulti Ending\nGame by Avocavo","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Avocavo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":16220,"name":"Close Your Eyes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b5/4b50358d46c3613e79e273eaf6b66b4b.jpg","description":"Welcome, Ladies & Gentlemen!\nA-ha, how y'all doing? Now, the name of the game is to answer truest to yourself. There's no right and wrong, everyone's a winner! Ooorrr a loser, depending how you think about it. Life is all about perception, you see. Onto the first question!\nYou're a murderer, we all know it. But do you think you are?\nThrough a stroke of sheer luck, you've managed to escape death row. Taking to an underground subway, you must try to find your salvation. Can you break free of the past that binds you? And please, can you close your eyes? Just close them.\nOriginally started as a 2014 Ludum Dare created RPG Maker Horror Game, reworked twice to become a brand new terrifying experience.Enter a horrific & twisted surreal world full of diabolical traps, puzzles, & questionnaires.Featuring original voice-work, artwork, & music to help create an unsettling atmosphere.Multiple endings and a variety of secrets encourage multiple playthroughs, as things are not always what they seem.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bending Spoons Apps IVS","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":15343,"name":"The Dreamlord","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/192/192a0b41ed013378fa9f400fff9e463a.jpg","description":"One of the few First Person Platformers ever created!\nFight your way out of this dream world created by the dreamlord just for you.\nCollect Dreamlord powers, Mind Fragments and lost memories. Jump from platform to platform in order to reach the end portal in time and escape. The Dreamlord has given you jump pads, teleports, elevators, anti-gravity devices and lots of platforms to jump on and get to the end. Prove to him you are worthy of waking up.\nIf you fail, you will remain in the dream world... Forever!Features:17 different objects which combine to create different puzzles.\n20 different levels with 3 difficulty options, plus a Hardcore mode, for old-school gamers!\n3 unlockable powers - Double jump, Second chance and Move obstacles.\nRealistic physics simulation, real-life gravity acceleration.\nVoice overs.\nCollectible Mind Fragments and lost memories.\nDetailed graphics with normal mapping, specularity mapping...\nExpansion system including level packs, model packs, voice overs & sfx, events\nAwesome In-game Level Editor. You never leave the dream world...Dive in a dream environment filled with traps and obstacles and find the exit. Its your only chance to wake up again!Objects:Apart from the regular columns, there are:\nMind fragments - give more time and recover lost memories.\nPower fragments - take them to unlock a certain power.\nJump platforms - makes your legs stronger to jump higher.\nAnti-gravity platforms - reverse your gravity when you're under it.\nMoving platforms - move back and forth in fixed intervals.\nBreakable glass platform - it breaks when you get off.\nDisappearing platforms - they start to fade away once you step on them.\nFireball trap - shoots fireballs at fixed interval.\nTeleport - teleports you to a different part of the level.\nButton Activated platforms - hidden, until you press the corresponding button.\nElevators - go up and down.\nSinking platforms - going down when you step on it.\nTransparent platforms - mainly to confuse you about the main path or to hide a different path.\nSpikes trap - activate after you step on a column above the spikes or show/hide on fixed interval.\nTeleport trap - shoots teleports that will take you to the beginning of the level without resetting anything.\nSwinging metal ball - it'll push you off a column.\nHanging spikes - start sinking when you step under them.Download expansion packsThe Expansion Manager allows you to download an expansion pack from our official page, or from a friend and play it right away in the game, without any complications.The Expansion ManagerThe Level Editor (Expansion Manager) is built into the game. It uses the gameplay as a base which allows you to test the level while you're creating it with the same physics and movement as a regular player.\nIn the Expansion Manager, you can easily change the order of the levels for an expansion pack, change the goal times, create/move/delete or modify objects with only a few buttons. After you're done, you can just archive the expansion folder and share with your friends or other players around the world, giving them a little more diversity. You can also upload it on the official Dreamlord page for everyone to enjoy.InformationYou can find more info at my official website or at the Online Game Manual.\nThank you for reading, I hope you enjoy my game!\nVen Mesechkov,\nMesetts Software.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"mesetts","platforms":[{"id":0,"name":"PC"}]},{"id":14004,"name":"Tom Clancy's Ghost Recon Island Thunder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a9a/a9a277919fdff0bdb7c03f2d88501c81.jpg","description":"Ghost Recon takes the next step in battlefield realism with Tom Clancy's Ghost Recon™: Island Thunder™.\nCuba, 2009: Castro is dead, and the first free Cuban elections in decades are thrown into turmoil by a drug-funded warlord.  The Ghosts, an elite team of U.S. Army Green Berets, are sent to Cuba as part of a UN peacekeeping force to destroy the rebel forces and their mercenary leaders and secure the elections for a free Cuba.\n8 new single player missions in an all-new campaign set across the island of Cuba.\n5 new dedicated multiplayer maps.\n12 new multiplayer weapons including the M4 SOCOM rifle and the MM-1 automatic grenade launcher.\n2 new multiplayer game types.\nNew Cuban enemy vehicles, new allied vehicles, and insertions by helicopter.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Red Storm","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":617209,"name":"Redfall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/683/6834c702c73e28ef2b3b003bb2c54567.jpg","description":"Announced during the Xbox & Bethesda Games Showcase, Redfall is a new co-op, open-world first-person shooter from Arkane Austin, the award-winning team behind Prey and Dishonored. Play it solo or in co-op with up to four players to face off against a legion of vampires that have overtaken the once-quaint island town of Redfall. In signature Arkane style, you will choose your path across the island and through the vampire masses as you discover what caused this plague of bloodsuckers, then put an end to the threat. Pick from a roster of heroes with unique skills and gear them up with customizable weaponry found throughout the island. Do whatever it takes to build the perfect team of vampire slayers.\n\nRedfall is coming exclusively to Xbox X|S and PC in Summer 2022 and will be available with Game Pass on day one.\n\nThis Used to be Such a Nice Place\n\nRedfall used to be a bustling, beautiful island community. It had everything a coastal town in Massachusetts should have: a lighthouse, a lobster shack, a boardwalk…\n\nWhen the vampires took over, they blocked out the sun, pushed back the tides, and effectively walled off the island from the rest of society, trapping everyone who remained. Now vampires rule the town by night and the human cultists who worship them patrol the streets by day. Not too many people venturing out of safety to check out the boardwalk these days, and forget about getting fresh lobster.\n\nEnter: You.\n\nIn Redfall, you’ll choose from a lineup of unconventional heroes, each with their own unique abilities and specialized weaponry, and face off against the bloodsucking legions threatening the island. You can go it alone, building your chosen character around solo play, or you can select the perfect character to round out a roster of heroes in up to four-player co-op.\n\nMeet the Squad\n\n“We wanted players to have an Arkane experience, but with the option of playing with friends this time,” says Co-Creative Director Ricardo Bare. “As a result, we thought going for heroes with strong personalities and distinctive backgrounds would make for a stronger game. We think players are going to enjoy not only the interaction of their various abilities as they fight the vampires, but also seeing their chemistry develop over time as they liberate Redfall.”\n\nRedfall features a rich campaign that explores not only the story of the island and the creatures plaguing its streets, but the stories of our four heroes as well.\n\nLayla Ellison – She may be the youngest member of the team, but there isn’t much she can’t handle with her wits and wildly powerful telekinetic abilities.\n\nJacob Boyer – Jacob is an ex-military sharpshooter with a penchant for dark clothing and a mysterious vampiric eye. If you need to find him on the field, look for his spectral raven circling overhead. Jacob won’t be far away.\n\nRemi de la Rosa – Always spotted with her robotic compatriot, Bribón, Remi lives on the frontlines of conflict, using her brilliant mind and strong sense of empathy to protect her loved ones and help those in need around the world.\n\nDevinder Crousley – Inventor and internet-famous paranormal investigator, Devinder is ready to prove to the world that vampires are real – but he’s going to need to survive them first.\n\nHow did they end up in Redfall? Why are they fighting to save what remains? Why do Layla’s powers manifest in the forms of an old-fashioned elevator and an umbrella? You’ll answer these questions and more as you explore Redfall.\n\nThe Things that Bite in the Night\n\nThe Arkane vampire isn’t afraid of crosses or allergic to garlic. They probably don’t sleep in coffins or need an invite to come into your house. Not that long ago, these vampires were just normal people. Well, normal, greedy people. People who were so obsessed with the idea of eternity that they used science to turn themselves into monsters.\n\n“Vampires are perennially fun, classical villains, because they’re ripe for every generation to reinvent and experience in a new light,” says Bare. “In our case, Redfall vampires are science-inspired, triggered by biotech longevity experimentation.”\n\nNow they’re building an army on Redfall, and there’s a clear hierarchy of power. After their transformation, some vampires develop abilities like the Angler (seen in the trailer), who uses a psychic harpoon to drag you away from your team. These vampires are getting stronger and stronger as they grow their numbers and you’ll need to ascend a ladder dripping with blood in order to reach the creatures at the top that started it all.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Arkane Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":50119,"name":"Boyfriend Dungeon","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1d/d1dc7b7675f953d482ff72df5af69c55.jpg","description":"Beautiful weapons to romance with unique personalities\nProcedurally generated dungeons and varied combat styles\nEach weapon feels and plays differently\nInclusive, tasteful approach to gender and sexuality - male, female, and non-binary romance\nPrecious memories created with your lovers can save your life in the dunj\nFor your summer job, you’re tasked with clearing the creatures in “the dunj”. Soon you discover weapons you find transform into cuties… and they’re SINGLE! (What a craaazy coincidence because you also happen to be up for grabs yourself.)\nSpend the cash you earn on romantic outings to forge precious moments with your lovers and work together to clear the rampant monster infestations, because after all, a couple that slays together, stays together.\nÉpée (Isaac): the sharpest dresser\nDagger (Valeria): tired of backstabs\nTalwar (AJ): worried he’s becoming an antique\nAnd more revealed as we go …!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Kitfox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17992,"name":"Bridge Project","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05a/05a4b9071f82fc1054d3264975cc31ac.jpg","description":"Build A Bridge... and Get Over It!\nThe Bridge Project is the successor to the original and award-winning Bridge Builder simulation, all amateur designers and structural engineers finally have a new challenge on their PC.\nThe gameplay has been subject to much tweaking and development with new up to date materials exciting scenarios and a variety of tasks waiting to be solved.\nBuild stable bridges in a variety of landscapes with detailed environment.\nTake on the task of constructing a huge variety of different bridges: suspended, folding, stone, steel, wood, car or railway bridges.\nWhilst you enjoy the enhanced graphics and the new, improved physics engine putting the most spectacular bridges to the test with stress tests.\nDownload free levels from the global Bridge Project community, and participate in competitions.Key Features All-new in-game graphics with a variety of detailed 3D objects\nNew user interface for easy operation\nAdditional materials such as wood and concrete\nIn addition to trains, cars and ships you can now test vehicles such as buses and tanksYour Bridges Extended weight and stability testing of different vehicles, or natural events such as storms or earthquakes\n48 varied and challenging levels: different towns, canyons, rural areas\nSet the design tasks to different modes - simple or expert.\nEditor feature - build your own levels and share them with other players\nCompare your technical skills with other players in the global online ranking\nTake part in competitions, improve your own record!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Application Systems Heidelberg Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":17634,"name":"Off-Road Drive","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb1/cb1312820ffaf88c3349a2c4510475d0.jpg","description":"Off-Road Drive, the off-road racing simulation for PC, is the first game ever to deliver a true-to-life, off-road, extreme racing experience. Players will take part in The Russian trophy, Off-Road Trial, Thai Trophy and many other events through the worst driving conditions with a variety of natural obstacles like swamps, rocks, snow and sand.\nNo other game features this variety of off-road sport vehicles including tuned stock SUVs and trucks, as well as several classes of prototypes specifically built for off-road driving. The vehicles can be equipped with an assortment of special cross-country equipment and accessories including winches, low gear, differential gear locking, clinometer, altimeter, tire air pressure control, sand tracks, etc.\nThere has never been such an innovative simulation of interactive terrain response as well. Terrain under the vehicle will act just like it does in real life, the car will sink in dirt, the dirt will create a rut and will stick to the car and tires affecting its handling. Stones will fly from underneath the wheels and damage other trucks. The game will feature various surfaces that will not only affect tire friction but have complex reactions based on car weight, speed, wheel torque, tire condition, time on this surface, depth of car immersion into the surface and much more.\nKey Features:\t\t\t\t\t\tLeading international off-road championships.\nRacing and mud bogging.\nTough challenges and obstacles to beat.\nSpecial off-road equipment and accessories (Lowered gearing, front/rear locking differentials, winch, etc.).","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"1C-Avalon","platforms":[{"id":0,"name":"PC"}]},{"id":17260,"name":"Lucius Demake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1a/e1a62920e12ab0ead89781437e47d81a.jpg","description":"When Lucius was born on the June 6th, 1966, nobody expected him to be anything other than a normal little boy but everything changed on Lucius’ 6th Birthday,\nwhen his true calling was revealed to him.\nEquipped with supernatural powers, take control of Lucius as he begins his blood filled tour of horror through his own house, using Hell’s powers of telekinesis and mind control to orchestrate deadly accidents that will minimize the population of the Dante Manor one by one by one.Key Features:Unique 2D horror adventure gaming experience\n2D Open World\nUncinematic Cut-scenes with 16 colors and low amount of pixels.\nBreathtaking 80's Atmosphere and Stunning low-res Visuals\nHarness Supernatural pixel Powers, including Telekinesis and Mind Control\nExperience the terror of a classic tale from the horror movie genre\nLucius Demake is based on the original Lucius game:\nhttp://store.steampowered.com/app/218640/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Shiver Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":13186,"name":"Picross Touch","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/98c/98cb409c0254136aeb0f02bc07c69757.jpg","description":"Picross, also known as Nonograms or Paint-By-Numbers, is a very fun and addicting puzzle game. The goal is to complete each puzzle by using the power of logic.\nPicross Touch provides you with a fun and hassle free way of playing picross.\nEvery puzzle in Picross Touch has a single solution, making them logically solvable.\nFeatures:\n- THOUSANDS of levels, you will never run out of puzzles to play.\n- 366 Original Puzzles.\n- Workshop integration is all done in game, no need to subscribe.\n- Built-in Level editor, share custom levels easily.\n- Tutorial to help you learn the rules.\n- Various options to fit your play style.\n- Cloud save support.\n- Achievements.\n- Leaderboards.\n- Resume any level from where you left off.\n- Undo, fix your mistakes.\n- Select your favorite color, and the game will generate a theme for you.\n- No Ads, No in app purchases, No nonsense.\n- Hassle free fun gameplay.\n- Clean, minimalistic design.\n- Provides hours upon hours of awesome puzzle fun.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ethan W Larson","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":11544,"name":"Zup! 4","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cac/cac27c766a0e3567821afb1636c23429.jpg","description":"Minimal physical puzzle with explosions\n▪ 60+ Levels\n▪ 550+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nMusic: bensound","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":4529,"name":"de Blob 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/92b/92b68a0371a4f59d8340730c2eca7169.jpg","description":"In de Blob 2 Comrade Black and the Inkies are back with a whole new plot to rid the world of color. With all-new help from Papa Blanc and his flock of followers the Blancs, Blob and his friends will have their work cut out for them bringing color back to the citizens of Prisma City. Set off on an action-packed color adventure where custom paints, patterns and music bring the world to life. De Blob 2 is a creative evolution driven by your imagination.\nImagine: Set off on an action packed color adventure with 12 new single player story levels where custom paints, patterns and music bring the world to life any way you want\nLaugh: Only the colorful prankster Blob can foil Papa Blanc's evil hypno plot to steal all the color from Prisma City\nPower: Speed smash through walls, jet jump over skyscrapers and slam squash Inkies with all new power-ups that turn you into a super Blob\nExplore: Paint your way past icy outposts, tropical bio domes and distant space stations to free the fair citizens of Prisma City\nTransform: Inside, outside, above the Earth and below it, Blob embarks on mini missions and epic boss battles to restore color and music back to this rich universe\nShare: Recruit your friends to join the color evolution in all new co-operative multiplayer modes.PC","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BlitWorks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2506,"name":"Rocketbirds 2: Evolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fe/8fed7f90c2ee5cadf8752ce3d2e0da54.jpg","description":"This Story Tastes nothing like chicken! - Step into the webbed feet of “Hardboiled Chicken”, the series’ undeniably plucky superchicken secret agent and venture into the game's full Story Mode campaign. Thanks to the return of the evil penguin despot, iL Putzki, Hardboiled must hunt down and eliminate him once and for all using jetpacks, new guns, disguises and skills only fit for the Bond of super-chicken agents.\nRescue 'em All! - Assemble a strike force of great magnitude and go on rescue missions behind enemy lines in the game's 1 - 4 player dropin / drop-out, online/offline Rescue Mode. Leave no bird behind!\nEvolution is Delicious! - Featuring enhanced, nuanced controls, new combat systems, an expanded arsenal, slick graphics and the cordon bleu of musical soundtracks, the sequel has truly evolved!\nPurchasing this content entitles you to both the PS4™ system and “PS Vita” system versions!\n3D display with compatible 3D active glasses (sold separately) required for 3D features. Visit www.us.playstation.com/support/3D for details.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-4\n5GB minimum save size\nDUALSHOCK®4\n3D Game\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCopyright © 2016, Ratloop Asia Pte Ltd.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratloop Asia Pte","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":2430,"name":"Life Goes On: Done to Death","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b5/0b5d4ec9ca420bde7b617c19e00b7074.jpg","description":"Life Goes On: Done to Death is a comically-morbid platformer where you guide heroic knights to their demise and use the dead bodies to solve puzzles. Wanting to live forever, a mighty king sends his army of knights to find the Cup of Life. On this quest, you will summon knight after knight to be brutally sacrificed. Impale knights on spikes to create a safe path. Catch a knight on a sawblade to land the body on a button. Freeze knights into blocks of ice to reach higher ground.\nYou’ll also electrocute knights to open doors, blast knights out of cannons, and even zombify a knight to be your violent, dim-witted friend. As you journey through treacherous and trap-ridden worlds, you’ll show no mercy to solve each challenging puzzle.\nIn this game, death is not a setback. It is your only means to progress.Key Features\nYou must die to solve puzzles.\nWe hope you’re okay with killing knights, since this is a pretty twisted way to solve puzzles! Dying is your only way to progress. As you sacrifice knights, you'll figure out how to use the dead bodies with the mechanisms in the game to solve each challenging puzzle.\nMorbid, yet comical gameplay.\nYou’ll kill so many knights, you might even feel remorse! But flinging a bumbling knight into a saw blade or turning one into your violent, puzzle-solving friend is comical. Trust us.\nVibrant, trap-ridden worlds.\nJourney through 65+ levels within four vibrant, colourful worlds full of lava, ice, spike pits, portals, zombies, cannons, and much more. And there are extra-difficult challenge levels for hardcore puzzle-addicts.\nUnlockable hats and weapons. (Silly ones, of course!)\nCan you find the Cup of Life wearing a horse head? On top of solving puzzles, you'll be able to unlock amusing hats and weapons. Your knights will spawn wearing silly hats, like beanies and berets, and wielding even sillier weapons, like dead fish and spatulas.\nFind Jeff!\nWho is Jeff? Well, he's furry, cute, and lurking in every level. Will you be his friend?\nChallenges!\nThere are awards for solving levels with the least number of knights and completing them in record time!\nLife Goes On: Done to Death also includes a kick-ass boss fight, a map-integrated storyline, an armoury to check out all your hat and weapons, and other features that will make you laugh at death.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Infinite Monkeys Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":368,"name":"Death Rally","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b3b/b3b9152abac27801df6839ef326d2978.jpg","description":"Load your guns, start your engines...THE CLASSIC IS BACK! Brought to you from Remedy, renowned developers of Max Payne and Alan Wake, Remedy's Death Rally classic top down racer is back, stronger and more vicious than ever.\nThis is no Sunday Drive. This is Death Rally, so be prepared to be blown away, literally. Make a run for the finish line with a trail of burnt rubber and spent brass behind you..along with the flaming wreckage of any fool dumb enough to get in your way.\nThe gameplay is addictive, intense, explosive fun! Win races, upgrade your cars and weapons to defeat incredible boss drivers to beat the story mode. Join the multiplayer! lock and load and enter the Death Rally, humiliate and destroy your opponents or sabotage their race.  You choose how you win, NO TRICK IS TOO DIRTY!Key Features:Experience the fury of Death Rally, hone your skills and prepare to race\nMassive career mode,win events,earn achievements and unlock cars,weapons and challenges\nMultiplayer mayhem, prove yourself against your opponents\nAmazing Iconic tracks in the city, desert, jungle, ice and more. Including a unique track only for PC\nFeaturing amazing guest drivers\nSabotage and Destroy and earn your spot on the Leaderboards\nGameplay supports keyboard and controller","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":366843,"name":"Syberia: The World Before","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/067/067df4bb30f618958ffc58ad8e3b0a38.jpg","description":"Vaghen, 1937: Dana Roze is a 17-year-old girl, who is beginning a brilliant career as a pianist. However, shadows begin to appear over her future as the fascist threat of the Brown Shadow hangs over Europe, at the dawn of the Second World War.\r\n\r\nTaiga, 2004: Kate Walker survives as best she can in the salt mine where she has been imprisoned, when a tragic event propels her into a new adventure in search of her identity.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Microids","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":48930,"name":"Killing Floor: Incursion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9bd/9bdbb68e11ae881900d70ae175c03550.jpg","description":"From Tripwire Interactive, makers of Red Orchestra and Killing Floor franchises, comes a multi-chapter, story-driven adventure made specifically for VR. Explore this detailed and immersive world alone or with a partner while fighting for your life with pistols, shotguns, axes, and even the occasional leftover limb. Travel through diverse environments, from creepy farmhouses to mysterious catacombs, in order to uncover who or what is behind the Zed menace.   Discover what the Horzine Corporation is really up to and be careful who you trust.\nWhen it’s all over, invite a friend to go back with you and see if you can pull them through alive.  Good luck!\nKey Features\nCo-Op Play: When the going gets tough, bring a friend!  Play co-op with a friend in both Story and Holdout modes.\nNarrative Campaign: Play through the five-stage, fully voiced story campaign to uncover the secrets behind Horzine and their relationship with the Zeds.\nHoldout - Endless Game Mode: See how long you can last against the Zeds in this endless mode! Increasingly tough groups of Zeds are thrown at you until you finally succumb. A new weapon, special power ups, and other mechanics are available in this mode.\nVisceral Gore: The Zeds you attack don’t just die; they get decapitated and dismembered as heads and limbs go flying, all covered in blood. You can even pick up these Zed bits and use them as weapons!\nImmersive Environments: Five different environments to explore, from high tech virtual training facilities to dilapidated trailer parks, each with its own threats and story.\nA Variety of Weapons: Chop, slash, shoot, and blast your way through hordes of Zeds with weapons ranging from fire axes to sniper rifles.  Each level introduces new options for violence.\nTerrifying Zeds: Some Zeds stumble, some crawl, some sprint, and some shoot at you with plasma cannons!  Each Zed has its own tactics, strengths, and weaknesses that you must learn if you want to survive.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":18079,"name":"Cubemen 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d9a/d9a9ca085ef465e3a9afebc2ee0fb99a.jpg","description":"Cubemen 2 is a fast paced, action packed, original 3D Strategy game where you use your little Cubemen units to defend and attack enemies in a range of awesome game modes including CTF, Skirmish, Territory and more.\nFor the multi-player enthusiasts, you can compete in up to 6 player online Solo or Team battles against other humans or AI, for the top spot on the global rankings. Host your own online games or join other games in the easy to use game lobby.\nFor those that prefer the single-player experience, Cubemen 2 offers 2 unique single-player game modes plus a Campaign mode, all with online rankings so you can compete against the worlds best.\nCubemen 2 offers enough variety to satisfy everyones strategy gaming needs.\nPlay on an almost endless supply of new and exciting user generated levels, or launch the easy to use built in level editor and make and share your own. All levels are stored locally so you can play your favorites when offline.Key Features:\nFive outstanding game modes including CTF, Territory and Rescue!\nCustomizable unit skins... Play as Cowboys, Knights or even Luchadores!\nBuilt in Level Editor to play and share your own levels\nCustomizable level themes...  Choose from over 20 styles\nNo static towers. Move your Cubemen around the level and attack or defend at will\nCampaign mode where you compete against others for a global ranking\nUp to 6 player cross-platform multi-player carnage\nFind new online levels to play with a single click\nNine specialised unit types including path blockers, mines and freeze lightning\nReal 3D levels with Teleporters, Healing Stations and floating platforms\nOnline ranking for all game modes\nTeams and individual multi-player games against Humans, AI or both!\nClean, rich and simplistic visuals that keep the focus on the strategy\nAll skins and themes in Cubemen 2 on Steam are now permanently freeOriginal soundtrack for Cubemen and Cubemen 2, Composed by Levan Iordanishvili.\nTrack list:\nCubemen 1 Main Theme\nRicky Rockets\nFlint Flamer\nFrill Grunt\nMoty Mortar\nLaslo Laser\nFred Freezer\nSid Sniper\nMike Medic\nCubemen 2 Main Theme\nWaly Wall\nMilo Mine\nLarry Lightning\nCubemen 2 Rock On\nCubemen 1 Main Theme Piano\nCubemen 1 Main Theme Sheet Music\nThe soundtrack will download to your computer to the following location .../SteamApps/common/Cubemen 2/Soundtrack folder.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"3 Sprockets","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16529,"name":"Super Amazing Wagon Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4df/4df2b2905d35238afebadd722588e6a0.jpg","description":"Super Amazing Wagon Adventure is a fast-paced 2d shooting game with a random story. You control a group of three migrants traveling west along a wagon trail. The game consists of short scenes that are sequenced together in a semi-random way to tell a crazy adventure story. One minute you could be massacring a herd of buffalo, the next attacked by eagles while falling off a cliff.Features\nStupidly fast. The scene changes every 3-30 seconds with some new enemy or obstacle to overcome. Face bears, snakes, spiders, buffalo, avalanches, sharks, and more!\nRandom. The scenes you play are sequenced together in a semi-random way, so you never know which dangers you will face. Rare and bizarre events provide extra surprises.\nUnlockable wagons. New wagons with special weapons and characteristics are awarded for completing challenging tasks and surviving rare events.\nCustomize your party. You pick your party members’ names and appearances. Name them after your friends and then watch them die one by one in brutal ways.\nA true challenge. There are no checkpoints or save games. When a party member dies, they stay dead.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"sparsevector","platforms":[{"id":0,"name":"PC"}]},{"id":1120,"name":"Rise of the Tomb Raider: 20 Year Celebration","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/451/451e5c6d5420d4862b9de70441cdc11a.jpg","description":"In Rise of the Tomb Raider, Lara Croft becomes more than a survivor as she embarks on her first Tomb Raiding expedition to the most treacherous and remote regions of Siberia.\nRise of the Tomb Raider: 20 Year Celebration is PS4™ Pro Enhanced and offers three modes to customize your gaming experience: 4K Resolution for unprecedented fidelity, High Framerate for even smoother gameplay, or Enriched Visuals for the lushest and most realistic graphics possible.\nThe game includes the new “Blood Ties” single player content, PSVR support for “Blood Ties”, new 'Lara's Nightmare' zombie combat mode, new Co-op play for Endurance mode, new “Extreme Survivor” difficulty setting for the main campaign, 20 Year Celebration outfit and gun, and 5 classic Lara skins. It also includes all previously released downloadable content. With over 50 hours of gameplay, and nominated for more than 85 awards, this is the most comprehensive version of the critically-acclaimed experience.\nVR games may cause some players to experience motion sickness\n1 player\nDUALSHOCK®4\nPlayStation®VR Compatible\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nRISE OF THE TOMB RAIDER, TOMB RAIDER, CRYSTAL DYNAMICS, the CRYSTAL DYNAMICS logo, EIDOS, the EIDOS logo and LARA CROFT are registered trademarks or trademarks of Square Enix, Ltd. SQUARE ENIX and the SQUARE ENIX logo are registered trademarks or trademarks of Square Enix Holdings Co., Ltd. All other trademarks are the property of their respective owners.PlayStation®Camera Required\nVR games may cause some players to experience motion sickness","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":796094,"name":"Max Payne 2 (RU)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c2/1c2f28f822cae8cd2d39e994f2683edd.jpg","description":"Max Payne 2: The Fall of Max Payne — жестокая любовная история в стиле фильмов «нуар». Темная, трагичная и напряженная глубокая история, полная шокирующих поворотов и открытий. Любовь причиняет боль.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":743469,"name":"Forest of the Blue Skin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fa/6facf732c1e333b235e8c6ff98057503.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":476122,"name":"Stellar Blade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fbd/fbdef5455da4c4033bed896e1540f6a1.jpg","description":"Project Eve is an action-adventure game that takes place in the not-too-distant future on the ruined Earth against unknown enemies.\n\nAccompany the powerful heroine Eve, join forces with comrades along the way, and take up the \nchallenge against the tough adventure.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"SHIFT UP","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":387244,"name":"Lust from Beyond: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/079/079cfb4d56acbca84e3322f80c8a01cb.jpg","description":"THE STORY WILL CONTINUE IN THE LUST FROM BEYONDhttps://store.steampowered.com/app/1035120/Lust_from_Beyond/\nAbout the GameOpen the gate to a realistic world full of desire, fascination and fear!\nLUST FROM BEYOND: PROLOGUE is a story introduction to full version of LUST FROM BEYOND. Don't treat it like a demo - it's standalone short game without spoilers from the main game.\nSTORY:\nChristopher is tormented by visions of a sinister land full of lechery and pain. To learn its secrets, he joins the Cult of Ecstasy, whose members seem to know the answers to his disturbing questions.\nChristopher learns the cult's life from within, getting lost in its blasphemous and sexual customs. Pleasures of this world are soon not enough. The cultists, following Christopher's visions, attempt to enter Lusst'ghaa - the Land of Ecstasy beyond the borders of our reality.\nBold erotic themes adapted to horror conventionGameplay from the point of view of an occult sect's memberWorld inspired with the works of Lovecraft, Giger and BeksińskiExploring a graphically advanced environment, full of interactive itemsIngenious puzzlesRunning from, and even fighting otherworldly monsters!Rich sound and music design","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Movie Games Lunarium","platforms":[{"id":0,"name":"PC"}]},{"id":331009,"name":"Kingdom Hearts Re: Chain of Memories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4d0/4d005e5885ba56c59ac83110ef8b6b22.jpg","description":"Sora, Donald and Goofy travel down a long road that meanders through endless fields, and come to a crossroads. As Sora stands in the crossroads, he gazes up at the night sky and thinks of his lost friends. Just then, a mysterious man approaches from down one of the branching paths. \"Ahead lies something you need,\" he says, \"but to claim it, you must lose something dear.\" The man vanishes before a single path, leading to a castle that eerily resembles a girl's drawing... In the coming journey, what will Sora and his companions gain, and what will they lose? In addition to Sora, players can control Riku in this adventure that bridges the gap between KINGDOM HEARTS and KINGDOM HEARTS II\nA full 3D remake of the original GBA release, KINGDOM HEARTS Re:Chain of Memories offers a refreshing rendition of the hit title for the PlayStation 2 system. The talented voice cast from the North American releases of KINGDOM HEARTS and KINGDOM HEARTS II, including David Gallagher and Haley Joel Osment, return to breathe new life into the beloved characters. The mini-game catalog has been completely renewed, now with four brand new experiences accompanying the main adventure.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":61584,"name":"428: Shibuya Scramble","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82f/82f1c0bcb97084efcd4a0f7e622f4a56.jpg","description":"A kidnapping on the streets of Shibuya brings together a hot-blooded detective, hard-hitting journalist, former gang leader, the head researcher of a big pharma manufacturer and a part-timer stuck in cat costume for a series of events each more unexpected and outrageous than the last. Can they—or the city itself—make it through the day?\nGame Features\nReal Actors and Locations\n428: Shibuya Scramble uses a mix of still photography and live action footage for a cinematic gaming experience that pulls you on a whirlwind tour of downtown Tokyo.\nTangled Fates\nAn innocent choice by one character can have disastrous consequences for another. Unravel the narrative threads, discover how they tie together and use the JUMP system to move between scenarios as five stories run in parallel.\nEaster Egg Hunt\nSometimes the wrong decision can lead to the right outcome, or at least an amusing game over. With over 50 endings, multiple bonus modes and extra scenarios, there’s more to the city than there seems.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Android"}]},{"id":23308,"name":"Madden NFL 18","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f8/7f855adce366ee32e3fb3334f147f84b.jpeg","description":"Madden NFL 18 takes a significant visual leap delivering the greatest looking Madden of all time with the power of the Frostbite engine.   See stunning new stadium exteriors surrounded by vast cityscapes and watch the spectacle of NFL gameday come to life in the most photo realistic game to date.  Pre-order today and receive an Elite player from your favorite NFL team and five Squad Packs in Madden NFL Ultimate Team, the complete NFL team-building mode with superstars from the past and present where there is a new way to play, every day.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-4 players\nNetwork Players 2-6 - Full game requires PlayStation®Plus membership to access online multiplayer\n50GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n*Conditions and restrictions apply. See https://www.easports.com/madden-nfl/game-disclaimers for details.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":16298,"name":"Chimpact 1 - Chuck's Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afb/afb3d31da6f73f340b732ce2998c8a37.jpg","description":"Chimpact 1: Chuck's Adventure\nLuscious environments with a variety of delightful characters make Chimpact top of its class. Collect gems, medallions and bananas by chucking your chimp through stunning jungle landscapes. Use bananas to add abilities to your chimp and complete all levels perfectly.\n**** Game Features ****\n- Chimp chucking, gem collecting, banana popping, medal earning fun for all!\n- Simple, one-touch gameplay\n- Four stunningly lush worlds with 12 levels each\n- Two complete game modes to beat: Gem Quest and Totem Trail\n- 240 challenge medallions to earn\n- Eight abilities to earn and three chimps to unlock\n- Beautiful environments + cute characters\n- Watch your chimp monkey about when you collect full banana strings","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Yippee! Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":14228,"name":"iREC","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cea/cea6a0927a1991588f8bc7a593cec463.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Labory","platforms":[{"id":0,"name":"PC"}]},{"id":12690,"name":"NEKOPALIVE","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ace/acef6b788aaf70272663627af1f097d6.jpg","description":"WHAT WAS ORIGINALLY A APRIL FOOLS' PRANK, HAS NOW BECOME THE PURRFECT VR SHOWCASE!\nWhat's NEKOPALIVE? Why, it's a \"cat-certo\"!\nThe catgirls of La Soleil take to the stage and step into the spotlight with their very own live concert. Dancing, singing, MIX'ing, and purring, this is the NEKOPARA event that comes right home to you, and you've got the best seat in the house! No idol can compare to a catgirl, nyaaa~\nWith full support of VR devices, this interactive concert allows you to jump into the venue in full 3D and zoom, pan, tilt and gaze at the beautiful graphics and fun choreography. Grab your glowsticks and prepare for 'otagei', because this is your chance to experience NEKOPARA as if it was real and right there in front of you.\nSongs include Thump Thump ☆ Heart-Throbbing ☆ Flavor [トキドキ☆ココロ☆フレーバー] and 100% Meow Power Nyantasy [100にゃんパワーで夢心地]","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"PC"}]},{"id":5686,"name":"The Lord of the Rings: Conquest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df3/df32ec248aea1ecff6bd679ec5eb22dd.jpg","description":"Play as the heroic forces of good and, in an all-new evil campaign, as the legions of Sauron’s evil army, including Cave-trolls, Oliphaunts, the Balrog and Sauron himself.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":992,"name":"Yomawari: Night Alone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e10/e10f2ae931b211667f10faaa05982578.jpg","description":"A young girl is walking her dog Poro around town at dusk when a tragic accident forces her to return home with only Poro's leash in hand. The girl's sister commands her to stay home while she goes out into the night to search for the dog. Time passes. Growing impatient, the girl decides to search for her missing sister and dog herself.\nBut when she steps foot outside, she realizes that this is not the same town. The darkness has made the town unfamiliar, and she appears to be utterly alone...save for the spirits that stalk her. The girl must hide from, outsmart, or outrun the hunting spirits while she searches for clues to find her loved ones.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NIS America","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":802435,"name":"Final Fantasy VII Rebirth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/511/511995d5dfcf18965dbb354d2ba9e176.jpg","description":"The Unknown Journey Continues...\n\nAfter escaping from the dystopian city of Midgar, Cloud and his friends set out on a journey across the planet. New adventures await in a vibrant and vast world – sprint across grassy plains on a Chocobo and explore expansive environments.\n\nAn Expansive World\n\nAs the party searches for Sephiroth, you will explore the beautiful, expansive regions of the world and open up new areas to discover. Dig deeper into the world of FINAL FANTASY VII with rewarding side content and mini-games, plus various unique forms of transportation to navigate the world.\n\nAn Evolved Battle System \n\nCombine strategic thinking with thrilling action combat alongside your comrades, including newly added characters. Deepen their relationships to unleash powerful team-based combos .\n\nBeyond the Walls of Fate\n\nIn this standalone adventure for fans and newcomers, Cloud and his comrades venture across the planet, their fates unwritten, making each step outside the dystopian city of Midgar fresh and mysterious.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":570171,"name":"Sunblaze","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/375/3751567b445a703a4469d05305471feb.jpg","description":"”Whose blood is that on the walls?” -Josie\nDo you think you’ve got what it takes to be an actual superhero? Well, then you need to help Josie to beat the superhero training simulator, and to become the hero our world needs!\nIn this beautiful, hand-crafted precision platformer, you’ll play as Josie, aka. Sunblaze, with a mission to complete your superhero training. Your dad, a former superhero himself, built the training simulator dreaming of your journey to become a superhero. The simulator is full of puzzles, brain-tickling challenges, double jumps, dashes, spikes, drones... And a purrfect sidekick: the cat. You have got a cat. What else do you need?\nWell, skills. That’s what you need. Do you think you’ve got ’em? Dive into Sunblaze now, and be the hero... called Sunblaze.\nAll you need is a simple story\nThe story takes place inside a training simulator, where Josie is being trained to be a superhero by her father. There’s witty dialogue, embarrassing moments and of course the most important part of the family — the cat!\n\nSmooth and gameplay drivenThere’s no need to take a boring pause as you complete a level in Sunblaze. The in-game simulator calculates and draws you the next level immediately as you complete one! It is a delight to look at, but remember to keep your head clear - the next level is about to start!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Games From Earth","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":302977,"name":"Stranger Things 3: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ed1/ed1553bcf3794b144092968a11ef30a2.jpg","description":"Developed and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun with a fresh new twist. Fans will be able to experience their favorite show through a mix of exploration, puzzles, and combat.\r\n\r\nJust like in the show, teamwork is at the heart Stranger Things 3: The Game. Fans can team up in two player local co-op or in singleplayer mode alongside an AI partner, in the role of one of twelve vharacters from the show, each with unique abilities and attributes. Together, they’ll play through familiar events from the series while also uncovering never-before-seen Stranger Things secrets, ensuring a fun experience for those new to the world of Stranger Things and series super fans alike!\r\n\r\nKey Features\r\n\r\nExperience the show in a new way, exploring the eerie world of Hawkins to uncover new mysteries beyond what’s seen in Season 3.\r\n\r\nJump right into the action of this pick-up-and-play adventure: simple gameplay mechanics allow fans of all skill levels to get in on the fun.\r\n\r\nTake your game to the next level by trying out different character combinations and collecting all the secrets the expansive world of Hawkins has to offer.\r\n\r\nTeam up with a friend, leveraging drop-in/drop-out local co-op to take on the mysterious monsters of Hawkins together. While playing solo, use a collection of \"buddy commands\" to control both characters and still experience all the fun.\r\n\r\nChoose from 12 playable characters, each with their own unique talents and stats.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Netflix","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":277932,"name":"SpellForce 3: Soul Harvest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e7/6e7cd89b0b80fb823d65d8ad3f78b662.jpg","description":"Three years after the Purity Wars, Nortander is on the cusp of a new era.\nHowever, things aren’t as peaceful as they seem – when the Queen calls you, a disgraced General, back to your homeland, you’re plunged in a war on many fronts: While a hatemonger threatens to tear apart the Dwarven realm, an enigmatic cult of Dark Elves harvests the souls of people for reasons unknown.\nGather your allies and prevent a catastrophe!Features:Standalone addon to the RTS/RPG mix SpellForce 3\nStory mode featuring a dark and enthralling story with a playtime of around 20 hours\nBuild your distinct heroes by a deep skilltree\nLead your army to victory in a new sector-based RTS system\nUse unique mechanics of your army units to win epic battles\nUse flying units for even more advance tactics\nPlay 5 distinct factions: Humans, Orcs, Elves, Dwarves and Dark Elves\nEpic fantasy soundtrack and bleeding edge top down graphicsMultiplayer Features:Each faction has three unique heroes that compliment individual play styles\nA modern multiplayer lobby will allow easier matchmaking and ranked play\nPlay new game modes for a special challenge\nCreate your own maps with the powerful modding tools.New features compared to SpellForce 3:All-New Campaign: Featuring new storyline with over 20 hours of content\nAll-New abilities and skilltrees for even more diverse heroes\nAll-New RTS Gameplay: Sector-based system with a focus on global resource distribution and unique faction mechanic\nUnique mechanics and unique unit kits make the races feel very diverse and offer replay-value in the campaign\nFlying units allow more tactical elements\nNew factions: Dwarves and Dark Elves\nOverhauled UI makes the game more pleasant to look at and more readable","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Grimlore Games","platforms":[{"id":0,"name":"PC"}]},{"id":39187,"name":"NosTale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/770/7709e9366a3e1415123a9f7653410879.jpg","description":"Your legendary story begins today!Become part of a thrilling journey and change the fate of the world. Explore breathtaking locations on your adventures, fighting against monsters and other players, or join forces to defeat even more powerful enemies.Choose your path! Swordsmen, Archers and Mages – each class offers a unique flavour and the opportunity to create your own personalised character.\nTame wild animals, train them and use them tactically in battle. Other players and partners can also join you on your adventures.\nTake some time out from adventuring in your very own Miniland, a place where you can build your own home, look after the garden and party with your friends.\nJoin an active community and play NosTale – free gaming fun for PC and notebook!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Entwell","platforms":[{"id":0,"name":"PC"}]},{"id":28526,"name":"Fruit Ninja Kinect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a71/a716436bd36cbea4979b0ad7ecae578d.jpg","description":"YOU are the ninja! The worldwide gaming phenomenon Fruit Ninja has now arrived for Kinect!  Your arms are now blades, and the epic battle against the world's most delicious produce is just beginning. Fruit Ninja Kinect is an amazing evolution of the slice-em-up genre created by Halfbrick, utlising next-gen power for the juiciest combat ever!  With Classic, Zen and the frenetic Arcade Mode, Fruit Ninja Kinect includes all the action you know and love with precision control - along with special features exclusive to Kinect! With Party Mode, multiple players can turn a normal night into a fierce tournament - and the new Challenge system will reveal the true masters among your friends!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Halfbrick","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":17045,"name":"Quest for Infamy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bed/bed5e89ae0c9179b115e06e379f336a2.jpg","description":"Why Be Famous When You Can Be Infamous?\nReturn to the glory days of role-playing and adventure with this humor-filled fantasy epic, styled in the vein of classic PC RPGs, where you play the charming villain. Blending turn-based combat and spellcasting with puzzle solving and adventure, players can choose from three character classes—brigand (strength), rogue (stealth), or sorcerer (magic), each with unique storylines and adventures—in one of the largest retro role-playing experiences ever. A spiritual heir to yesteryear's heroic quests, adventurers are invited to explore a world of hand-drawn wonder, as they wind their way through trap-infested dungeons, battle slavering beasts with swords or custom-made spells, and steal entire town's worth of treasure from unsuspecting townsfolk. Being bad has never felt so good!\nClassic fantasy Adventure/RPG packed with adventure, puzzles, combat, and spellcasting\nPlay as one of three anti-heroes with unique quests: Brigand, Rogue, or Sorcerer\nLie, cheat, and steal your way through tales of charming villainy with multiple endings\nUse swords, spells, or wits to blaze a path to victory: Styles vary with every play\nHand-drawn world seamlessly blends role-playing and adventure\nInteract with over 50 NPCs and explore over 200 rooms\nCustomize your own spells, skills, and adventures","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Infamous Quests","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]