[{"id":378579,"name":"Teardown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/580/580515de11a1b996918fa3ac118210bc.jpg","description":"Plan the perfect heist using creative problem solving, brute force and everything around you. Teardown features a fully destructible and truly interactive environment where player freedom and emergent gameplay are the driving mechanics.\r\n\r\nTear down walls with explosives or vehicles to create shortcuts no one thought were possible. Stack objects, build structures or use floating objects to your advantage. Take your time to create the most efficient path through the level and get ready to run.\r\n\r\nThe moment you pick up your first target an alarm goes off and the heat is on. Run, jump, drive, slingshot, do whatever you need to collect all of the targets and escape before security arrives.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Tuxedo Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":19272,"name":"BADLAND: Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a3/6a3ee4e7f0466634bf2aec806688f7cf.jpg","description":"Fly and survive through the Game-of-the-Year- winning world of BADLAND and discover an astonishing number of imaginative traps, puzzles and obstacles on the way.\n9.5 / 10 - Games969 – “Challenging, fun and darn addictive”\n9 / 10 - IGN Hungary – “Impressive”\n9 / 10 - Gaming-age - \"Shines brightly\"\n8.5 / 10 & the Joystick Award - SpieleTipps – “Highly recommendable”\n8.5 / 10 - WhatsYourTagBlog – “Awesome!”\n8 / 10 - GamingTrend - “The multiplayer mode is fantastic”\n8 / 10 - WeGotThisCovered - “Deliciously difficult”\n8 / 10 - TrueAchievements –  “Hours of fun”\nWith BADLAND: Game of the Year Edition, you get to experience the multi-award-winning action adventure like never before. Redesigned for Steam, BADLAND: GOTY Edition builds on the stunningly atmospheric, hand-painted graphics of the original BADLAND with enhanced, above Full-HD visuals, completely redesigned controls, over 15 hours of single player campaign and awesome multiplayer fun for up-to-four players with both local co-op & battle modes.\nBADLAND is an atmospheric side-scrolling action adventure platformer set in a gorgeous forest full of various inhabitants, trees and flowers. Although the forest appears to be right out of a beautiful fairy tale, there’s something terribly wrong. The player controls one of the forest dwellers to find out what’s going on, and discovers an astonishing number of imaginative traps and obstacles on the way.\nFeatures:\n- New: Level World added with over 40 000 levels\n- New: New Day added - Welcome to Eternal Day with a new level every one to two weeks\n- Side-scrolling action adventure platformer with innovative physics-based gameplay\n- Local multiplayer awesomeness for up-to-4 players with co-op and battle modes.\n- Single player campaign with 100 truly unique levels\n- 100 multiplayer co-op levels and 27 battle levels\n- Full Game Controller support\n- New controls with full left/right/up/down control & all levels modified for the new controls\n- Supports even 4 players on a single keyboard (old-school style) and any combination of keyboard and controllers\n- Enhanced, above Full-HD graphics.\n- 77 Achievements\n- Cloud save & Steam trading cards\n- Leaderboards\nFollow us:\nFacebook - http://www.facebook.com/badlandgame\nTwitter - http://www.twitter.com/badlandgame\nBlog - http://www.badlandgame.com","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frogmind","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]},{"id":28083,"name":"LEGO Marvel Super Heroes 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e6f45ae541c5016e270e132d223ffe2.jpg","description":"LEGO® Marvel Super Heroes 2 Deluxe Edition\nIt's about TIME! Get the Deluxe Edition now and gain access to the main game and season pass content! Join your favourite Super Heroes and Super Villains from different eras and realities in the all-new, original adventure, LEGO® Marvel Super Heroes 2!\nAbout the GameIt's about TIME! Join your favorite Super Heroes and Super Villains from different eras and realities as they go head-to-head with the time-traveling Kang the Conqueror in the all-new, original adventure, LEGO® Marvel Super Heroes 2! Play as the Guardians of the Galaxy, Spider-Man, Thor, Hulk, Black Panther, Captain Marvel, Doctor Strange, Green Goblin and dozens of other Marvel Super Heroes and Villains in this cosmic battle across the time-tossed city of Chronopolis! Travel across lands -- from Ancient Egypt to The Old West, Sakaar and New York City in 2099 -- and transport objects or characters through the centuries! And, with new battle modes, friends and family can play against each other in a series of themed challenges and battle arenas!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12725,"name":"RUSH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0da/0dab7553a533264235d77719bd83a5b2.jpg","description":"RUSH is a 3D puzzle game developed by Two Tribes. It is a remake of WiiWare title Rubik's Puzzle Galaxy: Rush. \n\n### Art-style  \nThe game’s art-style is very reminiscent of other Two Tribes title – Edge. It is extremely minimalistic. The levels themselves are mainly made of white cubes, and the other object is simplistic and colorful, and are mostly just geometrical shapes. \n\n### Gameplay  \nThe game consists of more than 70 levels. Your goal is to guide multicolored cubes to a certain spot on the level throughout the multi-layered levels; the game world is fully 3D.\nTo do so, you have to place individual tiles over the cubes’ course. They affect cubes’ direction and speed. There are also special tiles such as teleports. Each level has several entrance point and exits for the cubes of different colors. Some of them can have special objects like conveyor belts that affect cubes’ behavior. After the player places the tiles, they can press the button to start the movement of the cube. From this point, the player cannot affect them, and if any cubes collide or fall from the edge of the level, the stage restarts.\nThe main concern for the developers was the maximum simplification of the controls so the player can focus on the puzzles alone, so all the movements in the game may be performed with the sole mouse.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Two Tribes","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":60624,"name":"Evergarden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebf/ebfd656e5006cb0197a298cca8f66034.jpg","description":"Lose yourself in an endlessly satisfying puzzle game set in the midst of a mysterious forest world. Transform your garden by combining plants into strange new forms, and unearth deeply hidden secrets as you become engrossed in the game’s calming rhythm. Wander into the forest and help bring it back to life with the help of Fen, your creature guide. Evergarden may feel familiar at first, but you will discover it is like no game you have played before.FREQUENTLY ASKED QUESTIONSQ: What type of game is this?\nA: Evergarden is an “evergreen” puzzle game, set inside a narrative adventure.\nWe’ve spent years developing the core puzzle game to be accessible and relaxing, but also very deep and strategic. On a basic level, you’ll combine plants on a board to create more valuable items, and grow your garden within a turn limit. The game holds a lot of secrets though, and most players will spend months mastering the strategies required to get a great score. This portion of the game also has a leaderboard.\nBeyond the garden puzzle board, there lies a mysterious forest environment to explore, with its own puzzles and progression. You’ll use the stones that you earn by playing the core puzzle board to solve puzzles, and unlock new “songs” which add depth and fun to the puzzle board.\nQ: How long is the game?\nA: The core puzzle game is “evergreen”, which means you can play it repeatedly and keep mastering it, without ever truly “completing” it. The adventure game portion will take most players 4-8 hours to explore, and there is also a daily challenge portion with a new procedural puzzle to unlock every day.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"FlippFly","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":45381,"name":"Mirror","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/85f/85f9c6504b3a43298216691619cc37fe.jpg","description":"In this world, you will play different roles and have many stories with female characters in several different world. There are elf thief who thinks herself a noble, dragon maid who can never make up her mind, queen who loves females, forest huntress that enjoys the company of her toy-boys...\nJoin us in this match 3 combat game, capture the girl and do anything you want to her! Dig more into the girl if you would enjoy...","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Olympus","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15915,"name":"Grey Goo","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e37/e37cfceae9b2f79c29a1e9a8155c2d63.jpg","description":"Grey Goo is a real-time strategy game developed by Petroglyph Games in collaboration with Weta Workshop.\n\n###Plot\nOn a distant habitable planet called Ecosystem Nine, three factions confront each other. Humans, Betas, and the Grey Goo nanobots. The humans arrive on the planet to investigate an unusual signal, as they thought to be to only intelligent beings in the planet system. Betas established a colony after escaping from their own planet. And the Goo used to be an old human-made surveillance system, which reprogrammed itself and tries to return to its creators while consuming everything on its way.\n\n###Gameplay\nThe players are free to choose any faction to play as both in singleplayer campaign and multiplayer PvP mode. Each faction has its own set of units, buildings and drastically differs in gameplay from every other one. For example, Betas rely on speed and mobility to outmaneuver their enemies, while humans can use teleportation devices to deploy their forces to the battlefield quickly and reconstruct their own base in a matter of seconds. \n\nThe game's developers put a heavy emphasis on the preference of macro decisions instead of micromanagement. This being said, the player's strategy serves as a deciding factor in winning the game, not the speed with which they buy their units and build structures.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Petroglyph","platforms":[{"id":0,"name":"PC"}]},{"id":9564,"name":"Sid Meier's Railroads!","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/adb/adb9e34f5ee059021fc21474f79ec6ee.jpg","description":"Sid Meier's Railroads! is an economic strategy developed by Firaxis and Sid Meier. Despite the creation of Railroad Tycoon by Meier, he was inspired by Miniatur Wunderland to reimagine his original creation.\n\n###Gameplay\nRailroads! is a 3D economic real-time strategy. In contrast to Sid's previous games, the game field of Railroads! is a bit smaller which encourages more interactions between the players. The game has little space for creating flat and long parts of the roads, hence why hills, mountains, rivers, and straits are much more important.\n\nThe game focuses more on the economic aspect of railroad building. Players create and sustain a whole industry using the railroad system. The game features an auction system. From time to time, new technologies are up on the auction and the player who made the largest bid is granted exclusive rights on using this tech for ten years. After ten years pass, the technology is made available for every player. It is also possible to put one of the factories the player own up on the auction for sale.\n\nThe creation of railroads themselves is much easier and automated than in Railroad Tycoon. Railroad building can also be used to prevent your opponents from creating new useful paths.\n\nThe game features 15 historical scenarios where the players can act as several notorious railroad magnates of the past.\n\nA multiplayer mode is also present in the game. Four players can play a game using LAN or Internet.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":3253,"name":"Hatoful Boyfriend","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/81e/81e5cf3f433473af3a04888e3baceeba.jpg","description":"In Hatoful Boyfriend: A School of Hope and White Wings, the player enters the world of sentient birds to romance with them.\n\n###Setting\nThe game is set in a weird post-apocalyptic future, where the human civilization was taken over by the birds. In a twist similar to Planet of the Apes film series, a pandemic killed most of the humans and transformed birds into sentient beings. They established a new civilization on the ruins of their human predecessors. The few remaining humans survive in the wilderness as hunters and gatherers.\n\n###Plot\nThe player assumes the role of a teenage human girl. She is the only human student who was allowed to study at the institute run by the pigeons. She befriends several of her co-students and can become their romantic interest, despite being a member of another species.\n\n###Gameplay\nHatoful Boyfriend is a visual novel and therefore has minimal gameplay. The player interacts with the characters mostly by clicking on dialogue options. Some of the options require the main character to have certain stats. The game rewards multiple playthroughs by unlocking documents that reveal more of the game's world and plot.\n\n###Endings\nThe game has thirteen endings that depend on the choices made by the protagonist. After the player discovers the certain four endings, the Bad Boys Love mode is unlocked. This mode reinvents the plot with a horror twist. In this mode, the protagonist receives dark visions, and deeper explores the conflicted relationship between birds and humans.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":21416,"name":"Alien Shooter 2: Reloaded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7cf/7cf3a3a31d53a283984e6cf1b3781c21.jpg","description":"Alien Shooter 2: Reloaded is a remake of the original Alien Shooter: Vengeance which is the sequel to the first Alien Shooter and part of the three-titled Alien Shooter series. It is developed exclusively for Microsoft Windows. \nInteresting feature: the size of the Reloaded version were reduced to 300Mb, instead of keeping it the original 1Gb to draw the attention of players with a slow internet connection.\n\n###Gameplay\nThe first Alien Shooter is a shooter with an isometric perspective with the top-down look. In contrary to the previous game, Reloaded now have eight characters to choose from: they differ not only by appearances but also by stats and characteristics. The leveling in the game is made through killing enemies and earning enough experience points to level up and raise the stats accordingly. \nThere are three main game modes: Campaign, Survival and Shooting Range. The campaign is divided between 17 missions in contrary with Vengeance — the game had only 15 of those.  \n\n###Story\nThe setting of the title is 2030 Earth, with the player being quested to eliminate everything on their way in M.A.G.M.A. laboratory — there was a recent experiment there, and things got out of control. At the end of the story, the player is given an opportunity to either save one or another character. The ending depends on their decision.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":496,"name":"République","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8e/f8e26a97d0b6c77dd83f757d1bc5e66a.jpg","description":"At long last, République: Episode 5: Terminus is finally here! All of us at Camouflaj are anxious to finally release the fifth and final chapter of République. To all of you who waited patiently for the series conclusion, we deeply appreciate your patience and support. The team here at Camouflaj put our hearts and souls into this epic final episode -- we hope you agree that it was worth the wait.\nJust as we did with previous episodes, Episode 5: Terminus is not just an additional chapter but it comes with thousands of fixes and enhancements. Here’s a breakdown of the major changes we made in addition to adding the fifth episode:\nImproved performance, crash frequency, and optimized framerate for lower-end devices\nResolved issue where Hope falls out of the game world on some machines with AMD graphics cards\nFixed issues regarding Hope’s trouble retrieving the EP3 cassette at beginning of episode, near desk in Reception Area\nUnity default typeface no longer appears by default in certain prefabs (English alphabet only)\nImproved and revised navigation, pathfinding, and collision in Episode 1-3\nImproved camera rotation limits and view in all episodes\nUI and pop-up improvements in all episodes\nUpdated 2D art for some scannable items in Episode 1-3\nIn addition to the upgrades we’ve made, here is some of the new stuff you can expect in Episode 5 (without spoiling too much):\nHostile Cameras: These new security cameras scattered throughout the game world will scan Hope and alert guards to her presence. Players can only inhabit them for a limited time, adding a neat layer of complexity to the gameplay loop.\nBranching Paths: This is something we’ve kept close to the vest for a long time: EP5 has branching paths that change the course of the episode based on a decision you make early on. We don’t want to reveal too much, but this is a huge addition that greatly expands the content offered in Episode 5, offering a nice incentive to play through the campaign again.\nA New Metamorphosis: Players are returning to the world of some previous episodes, but will find it looking and feeling much differently than before. You’re going to see new areas, meet new enemies, and forge some interesting alliances…\nWe want to say more, but it’s better if you to experience it for yourself!\nWhen you’re done with the game, I encourage you to check out our final installment of The Making of République (available now in the Deluxe Edition), and take a look back on the production of this massive, four year endeavor. We’ve prided ourselves on giving you a window into our world by providing open and honest in-game developer commentary tracks, and these video documentaries are an extension of that. You might even see some old footage from back when we were younger, healthier, and less sleepy.\nFinally, we want to give a shout out to composer Zinc Lemone for his work on Episode 5’s soundtrack (also included with the Deluxe Edition.) I’ve had some standout favorite tracks in previous episodes, but EP5’s soundtrack in simply incredible from start to finish. (“Loose Change” is the *JAM* y’all.)\nWatching Episode 5’s final moments come to life this past year has been bittersweet. It’s hard to believe that we are finally at the finish line after first announcing the game back in 2012. We owe a lot to our initial Kickstarter backers, our publishing friends at GungHo Online Entertainment, and our stellar voiceover cast including Rena Strober, Jennifer Hale, David Hayter, Dwight Schultz, and Khary Payton. It’s not an exaggeration to say that République is the product of thousands of people coming together and making it a reality.\nThank you all, from the bottom of our hearts. It’s been an incredible journey.Camouflaj","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Camouflaj","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":438599,"name":"BPM: BULLETS PER MINUTE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a06/a06ad03386dc427ec2365d541b324b75.jpg","description":"Fight as a mighty Valkyrie to repel the forces of the underworld from invading the world of Asgard.\n\nGameplay\nIn BPM, all of your actions and the actions of your enemies are tied to the beat of the music. Your enemies perform a dance-like sequence of attacks to an epic rock opera. BPM is inspired by retro shooters of the 90’s. It is fast, frenetic and rhythmical. You can double jump, dash, rocket jump and bunny hop to evade your opponents.\n\nYour goal is to reach the end of randomly generated dungeons, collecting different weapons, abilities and items each time you play. These weapons and abilities can radically alter the way you play, making each playthrough unique.\n\nYou must defeat 7 bosses to reach the final boss. Each boss moves and attacks in a unique way that you must learn to exploit if you want to succeed. Some attacks require you to jump over fields of lava, some to dodge fast projectiles, some to hold fast for a beat.\nFeatures:\nShoot, jump and dodge to the beat while battling hordes of enemies.\nFight powerful bosses in challenging boss battles that will push you to the edge.\nExplore randomly generated dungeons.\nChoose from 5 different characters with unique strengths and weaknesses.\nWield a powerful arsenal of weapons, all with different behaviour for firing and reloading to the beat of the soundtrack.\nBattle a diverse array of enemies, each with unique rhythmic behaviours.\nGet overpowered and fire shotgun rockets while flying through the air.\nUtilize abilities that radically alter the way you play the game, from teleport to freezing bolts.\nEquip over 40 items that buff your character in unique and interesting ways.\nExperience an epic rock opera soundtrack.\nChallenge modes for extra gameplay.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Awe Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3913,"name":"STREET FIGHTER X TEKKEN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e2/1e23f3c3e83e8fb562c58408b3d5fd63.jpg","description":"###Ambitius crossover\nOne of the most ambitious crossovers in the history of crossovers. Heroes of two iconic series of fighting games will battle against each other at the most popular locations from both franchises.\n\n###Story and setting\nDespite the format, the game has a story: according to it, the world was hit by a cataclysm - an object of unknown origin fell into Antarctica. It emits water-like energy that enhances the capabilities of the fighters. For most fighters, the story is standard. The exception is made for the anchor characters from both series: Ryu and Ken or Kazuya and Nina. In total, the game has 38 characters, 19 of each series.\n\n###Key Features\nIn terms of gameplay, the game is a mix of two combat systems: there are mechanics as Super Combos and EX Attacks from Street Fighter built into the classic for Tekken gameplay. All characters from SF series are controlled by a six-button system, and for Tekken fighters, a standard four-button control is available. Players choose two characters: one from each universe. Fighters can be changed right during the battle. The game also features two new mechanics: the Gem System and Pandora Mode. Thanks to the first, the player can put up to three gems on the fighter that improve from the characteristics, and the second turns on when one of the fighters left less than 25% of health. In this case, this character can be sacrificed in favor of Pandora Mode, which enhances the remaining character strength and gives an infinite Cross Gauge.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Capcom","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":643,"name":"DEAD OR ALIVE 5 Last Round: Core Fighters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c4/8c44bf4c09f224dc6341c4f22cbd67ff.jpg","description":"Featured DLCBeautiful collection of mandarin dresses for the characters of DOA5LR!\nPlease check http://store.steampowered.com/app/587170/\nAbout the GameThe final word in fighting entertainment - DEAD OR ALIVE 5 Last Round!\nThis is a free version which allows use of most game modes, including online play. However, only a limited number of playable characters are available, and Story Mode is locked. Other characters and Story Mode are available as separate downloadable content purchases.\n* The images are from an in-development build and may differ from the final version.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":342,"name":"The Jackbox Party Pack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3f/d3f9638e581b01d872bec784aaa9bdad.jpg","description":"NOTE: These games are same-room multiplayer party games.\nFor 1-100 players! Your phones or tablets are your controllers! The team behind YOU DON’T KNOW JACK presents FIVE guffaw-inducing party games in one pack! Games include:\nThe comedy trivia sensation YOU DON’T KNOW JACK 2015 (1-4 players) with hundreds of all-new questions.\nThe hilarious bluffing game Fibbage XL (2-8 players), with over 50% more questions added to the original hit game Fibbage.\nThe bizarre drawing game Drawful (3-8 players) - you draw right there on your phone or tablet (very little/no real skill required).\nThe racy-as-you-want-to-be fill-in-the-blank word game Word Spud (2-8 players).\nThe wacky-fact-filled Lie Swatter (1-100 players). Players play using their phones, tablets, or even computers as controllers – making it the perfect easy-in entertainment piece for your next game night or party. No big mess of controllers needed!  Once a game is started from the in-pack menu, players simply connect to the “jackbox.tv” web address on their device and then enter the on-screen room code to enter a game\nYou’re gonna need more than one party for this.\nNote: The games included in this pack are in English only.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19666,"name":"Else Heart.Break()","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8a/f8a1203fcf76a4352cd711702d252aa1_FOf3lw6.jpg","description":"The world of this game consists not of atoms, but of bits of information - its reality is homogeneous with the reality of what is happening inside the computer.\n\nOn the one hand, this is unusual - but on the other, it makes it possible to create anything if you become a programmer.\n\nYou do not need to become a programmer to play this game - the world consisting of bits, this is only part of the plot of the game. And the game itself is intended for everyone, including those who do not have programming skills at all.\n\n###A boring character in a boring city\nThe character controlled by the player is called Sebastian. He arrives in the city of Dorisburg. He was offered a job there - not a programmer, but only a seller at Wellspring.\n\nThe city is unfamiliar to Sebastian, he has no acquaintances there. Sebastian (that is, you as a player), until there is nothing left but to wander, explore the city, study duties at work and live quite ordinary life, go to a bar in the evenings, attend parties, make friends and hardly wake up to walk to work.\n\n###Knock, knock, Sebastian\nEvents get a significant acceleration when Sebastian meets a girl named Pixie. The main story of the game begins with this acquaintance.\n\nBy the way, both the tempo of the story and its specific turns depend on what you decide (along with Sebastian). Everything can be stretched in time or, on the contrary, it can be carried at full speed, and where it goes - there is more than one option.\n\nPixie girl tells (and shows) Sebastian that their world is a world controlled by coding and programming.\n\nTrue, not everyone knows this, and all the more, not everyone is allowed to use this knowledge for actions on their own.\n\nBut where there are programmers, there are hackers. Moreover, the temptation is so great - to turn a trolley bus into a personal supercar, for example.\n\n###How to say it in Sprak\nSebastian acquires a gadget called modifyer - it shows the code of any object in the game. The codes are written in the Sprak language, which is very similar to Basic.\n\nThe ease of transforming the world encourages Sebastian to try more and more different things. Errors are inevitable on this path - and it is difficult not to notice them, because try not to notice how you incorrectly programmed the skyscraper!\n\nBy the way, the Sprak language is in itself a source of pleasant puzzles, having more than one solution for each puzzle. And the matter is not so much in the capabilities of the language, as in your capabilities - after all, you can find a variety of solutions for the same problem. For example, instead of “writing” a high-speed car for yourself, you can “write” a passage to the right place - even if it is separated from your “reality” for many kilometers.\n\n###Big Play\nHowever, the game is not about harmless entertainment - a group of hackers who are at war with the government agency Ministry comes in contact with Sebastian. The government, of course, does not like it when everyone changes everything at will, and hackers resist control.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Erik Svedäng","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11563,"name":"SPORE Galactic Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/034/034f57407f60d07f25d716fc2c01d768.jpg","description":"Spore: Galactic Adventures is an expansion pack for 2008 life simulation and strategy game Spore \n\n###Gameplay \nThe core gameplay stays the same as in the original game. You create a species and guide through five stages of evolutions: Cell, Creature, Tribal, Civilization, and Space stage.\nThroughout the game, you can change your creature’s appearance, skills, and, in later stages, create vehicles and structures associated with this species. The expansion pack mostly affects the Space stage of the game. Its main feature is an introduction of Adventures: special missions that are played in third-person perspective, similar to the Creature stage. These missions are available as quest given by alien NPCs or from the main menu. The missions’ goals vary. For example, you can have to defeat certain enemies, talk with NPCs, solve a puzzle, befriend with aliens. In each of the missions, you play as a captain of your spacecraft. You can customize it in Captain Outfitter menu, giving it new cosmetic items, as well as weapons, tools, and social items that alter its attacks, movement, special abilities or social skills. There are several premade adventures, but the expansion focuses mostly on giving the player to create their missions and share them with other players. The Adventure Creator offers wide arrange of tools to change the terrain, add new enemies, NPCs, tasks, interactive objects.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts Maxis","platforms":[{"id":0,"name":"PC"}]},{"id":61471,"name":"Farming Simulator 19","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/309/309f6f52d63d494270c3f4ca24e66839.jpg","description":"The best-selling franchise returns this year with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farming experience ever.\n\nFarming Simulator 19 takes the biggest step forward yet with the franchise’s most extensive vehicle roster ever! You’ll take control of vehicles and machines faithfully recreated from all the leading brands in the industry, including for the first time John Deere, the largest agriculture machinery company in the world, Case IH, New Holland, Challenger, Fendt, Massey Ferguson, Valtra, Krone, Deutz-Fahr and many more.\n\nFarming Simulator 19 will feature new American and European environments in which to develop and expand your farm and will introduce many exciting new farming activities, including new machinery and crops with cotton and oat! Tend to your livestock of pigs, cows, sheep, and chickens - or ride your horses for the first time, letting you explore in a brand-new way the vast land around your farm.\nFarming Simulator 19 is the richest and most complete farming experience ever made!\n\nMAIN FEATURES\nThe biggest step forward for the Farming Simulator franchise, offering the most striking and immersive graphics ever\nUse and drive hundreds of faithfully reproduced farming vehicles and tools, including for the first time John Deere\nTend to your livestock including pigs, cows, sheep, chicken, and for the first time horses\nRide your own horses and explore the vast areas offered in huge open worlds loaded with farming activities\nDevelop your farm online with up to 16 players and enrich your Farming experience with community-created mods","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":12354,"name":"Jalopy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb6/eb6c283c4ad2cba34874f1e24a4dbeff.jpg","description":"Navigate miles and miles of tyre changing, fuel burning, carburettor busting, mud clattering terrain, through night and day, rain and shine. Adapt to whatever the procedurally generated world of Jalopy can throw at you.\nUpgrade, maintain and care for your Laika 601 Deluxe motor vehicle. Keep close attention to everything from the state of your tyres, the condition of your engine and even the space in your trunk. Repair each aspect of your scrappy little car and install unique upgrades to deal with the changing world. Everything from cargo weight to the condition of your carburettor will determine how your car performs on the open road.\nThe rise of capitalism brings an economical conundrum. Scavenge for scraps to make a small return of investment, or become a baron of the open road and smuggle contraband under the eyes of border patrols to make a sizable profit.\nDeveloper Greg Pryjmachuk worked on the Formula 1 franchise from 2009 through to 2014.  In late 2014, Greg began work on this new driving simulation featuring the fictional Laika 601 Deluxe car; reminiscent of the East German “Trabbie”, it will need much love and care to keep it going on this memorable road trip!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Minskworks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3532,"name":"SingStar","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c3/8c312247dac2ef29cb69bc9995991e5c.jpg","description":"SingStar is a singing game, distributed for free for PlayStation consoles. The series has been going on for 14 years already, developing the games for all of the PlayStation since PS2. \nCrucial to notice: it is not a rhythm game but a singing game. Here the players need to sing karaoke-style, not match screen patterns with the background beats. Every version of the game differs from the previous one by the song list. It is rare that any technological improvement is included. For example, PS Move support or a special microphone release.\nSingStar (2014) adds AR function for the PS4 gamers: it is now possible to see the lyrics or even avatars through the camera. Other than that it is just a competitive game featuring no plot whatsoever. The Party Mode includes up to eight singers simultaneously — the competitions like 'Pass the Mic,' or 'Medley' are available there.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":20498,"name":"Bad Rats: the Rats' Revenge","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a97/a97b0e257daca77c23cf93ac9fff7487.jpg","description":"In Bad Rats, the player controls the rats that try to kill their prisoner, the cat, in a cruel and unusual manner.\n\n###Premise\nThe goal of the game is to kill the cat. Each level is a maze with rats on one side, and the imprisoned cat's cell on the other. An object like a bomb, a heavy safe or a chainsaw lies prepared next to the cat. The goal is to navigate anything across the maze to make the deadly object fall and kill the prisoner. The rats themselves can die a grisly death in the process, but as long as the cat is dead, the level is passed.\n\n###Gameplay\nThe game is centered around creating physics-based contraptions with the resources given to the player. The rats cannot kill the cat directly, and they have to make a kind of Goldberg machines and test them before using them on the cat. They can use rockets, trampolines, bombs, and other devices. The player places his or her rats across the level, taking into account their roles and abilities. For example, there's a rat that beats objects with a baseball bat, a rat that fires itself from a cannon, and a heavy fat rat, among others. \n\n###Style\nBad Rats is infamous for its rude and overly simplistic visual style. It also became highly controversial and received a lot of criticism for its uncensored portrayal of bloody violence and gore. The game became a sort of a meme in the gaming community, and some claimed it was one of the worst games ever to be released on Steam.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Invent4 Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20960,"name":"The Plan","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/327/3271755bdf6feb24e5823f89f3024d6d.jpg","description":"For the stealth action game by Eko Software see \"Th3 Plan\".  This is a very different game.\n\n\nDescription from From Steam: \"A fly ascends to the skies, pondering the pointlessness of its brief existence.\nThe Plan was developed as a side project by Krillbite Studio, who's currently finishing their main project Among the Sleep.\"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Krillbite Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17874,"name":"Double Dragon: Neon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a4/7a48f6e1f542f41c7866b3beacb7a189.jpg","description":"BRO-TACULAR!\n\nLegendary martial artists, Billy and Jimmy Lee return in this creative re-imagining of the classic beat ‘em up, Double Dragon Neon.  Fight your way through countless henchmen including Linda and Abobo on your way to rescue the love of your life, Marian!  Trained in the special form of martial arts called Sōsetsuken, hunt down and defeat the evil Skullmageddon!\n\nClassic beat ‘em up feel with new powers, new attacks, and a sinister new foe!\n\nFeatures\nMix tape system lets you mix and match unique abilities and powerful new attacks.\nString together attacks for brutal combos to keep your foes down and out.\nBrawl through a variety of levels including dangerous city streets,  twisted science labs, an evil stronghold, outer space and more!\nUse a variety of weapons including bats, knives, whips, and more to incapacitate unsuspecting enemies.\nOriginal soundtrack by award winning composer and sound designer Jake Kaufman.\nDeveloped by WayForward, the award winning team responsible for DuckTales: Remastered, BloodRayne: Betrayal, and A Boy and His Blob\nSteam adaptation and online co-op developed by Abstraction Games.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":19430,"name":"Dragon Age: Origins Awakening","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/736/736e1e2e7670169114a48b5f65f66bdb.jpg","description":"Dragon Age: Origins Awakening is an expansion pack to fantasy game Dragon Age: Origins developed by BioWare.\n\n###Plot\nThe game's story continues where Dragon Age: Origins ended. The protagonist becomes a commander of the order of The Gray Knights which acquire a manor in their protectorate. The players arrive at the castle, where the creatures of the Darkness still attack humans even after the murder of their leader. The Knights find information that several Darkness creatures became sentient and began their investigation.\n\n###Gameplay\nThe game's core mechanics are largely the same as the base game with several additions. Now the players have to take care of the land in their possession, making decisions about building up new defenses (by looking for ores and purchasing new buildings). \n\nThe story takes 10 to 15 hours to complete. There are many side quests present in the game apart from the main story. Unlike the base game, you cannot romance any of the Knights as there is no love story whatsoever in the expansion pack.\n\nThe players are free to create whatever character they like, but the story does not depend as much as it did on the player character's race. There are three specializations with several classes in them. That makes it very easy for the players to create a character to fit their own playstyle.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BioWare","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"}]},{"id":16042,"name":"Endorlight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b7/9b7a0b5098e32bfe030115f17df363ba.jpg","description":"Endorlight is a roguelike platformer developed by Unika Games. \n\n###Gameplay\nEndorlight is a typical roguelike game. That means that death is permanent. Upon death, the players lose all their items, yet it is still possible to retrieve them if you find a way to the spot you died on. The main objective of each level is to find an exit off of it.\n\nThe game has no saving system whatsoever. The players have to play through the game in one sitting. There are more enemies on each level with them being much tougher. The players will have to win a boss fight every five levels. After defeating a boss, a new world biom is unlocked. Each boss is different, has more health and does more damage upon hitting the player.\n\nIt is possible to collect gold and use it to purchase several character upgrades, such as increased health, damage multipliers and much more. The game also features a leaderboard that logs how much levels did the player pass, how much gold did they gather, and how much time did it take them to do so. \n\nYour arsenal is not large, as the only things you can get through your enemies are your ax, your bow, and your whip.\n\n###Controversy\nThe game was pulled off Steam for violating copyright law, because of the usage of the open-source code of another game Spelunky and copying another game called Caveblazers, but on a different engine.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Unika Games","platforms":[{"id":0,"name":"PC"}]},{"id":10239,"name":"Battlestations: Midway","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/123/123745b2adbd3cbc7c8e41fc839230dd.jpg","description":"Battlestations: Midway is an immense action game that drops players into massive air, sea, and undersea battles from Pearl Harbor to Midway. Players command massive fleet attacks and take direct, real-time, control of every plane, battleship, and submarine in the battle.\nBattlestations: Midway's blends intense 3rd-person action with epic, large-scale naval combat and brings to life the great Pacific battles of the World War II. From the chaos of Pearl Harbor, through the Philippines, Java and the Coral Sea all the way to the epic Battle of Midway.\nInnovative gameplay lets players take direct control of over 60 different warships, planes and submarines from a 3rd-person perspective. Players can instantly switch to and control nearly every vehicle in the battle.\nThe game features 11 large-scale campaigns with 12 bonus challenge missions.FEATURES:\nRevolutionary gameplay: Experience epic WWII combat from multiple perspectives as you jump between dozens of units, playing as a pilot, a gunner, a submarine captain or even carrier fleet commander.\nMassive air, sea, and undersea battlefields: Every battle takes place simultaneously in the air, on and under the sea.\nMovement of your fleet and the individual efforts of any one vehicle is critical to success.\nSixty warships: Features the Wildcat and Zero Fighter planes, the Dauntless Divebombers, the B17 and B24 bombers, the USS Lexington and USS Yorktown carriers, and Japan's infamous super battleship, The Yamato.\nRealism: Cutting-edge graphics bring the Pacific oceans and island chains alive with lush real-world environments, dynamic weather effects and incredibly detailed vehicles and weaponry.\nFeaturing 11 massive campaigns with 12 bonus challenge missions and an immersive storyline.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":5543,"name":"Colin McRae: DiRT 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9de/9de9d9c51e2867486222a7b3e0fb6062.jpg","description":"DiRT 2 is a racing game developed by Codemasters. It is the seventh installment in the Colin McRae Rally series.\n\n###Gameplay\nFive disciplines are present in the game such as Rally, Rallycross, Trailblazer, Land Rush, and Raid. Special events appear on the map from time to time which includes Gatecrasher, where the players have to smash yellow barriers placed on the track; Domination, where you have to set the best time possible on a sector of a racing course, and Last Man Standing which resembles a usual Rallycross event with the elimination of the last racer to cross the finishing line on a lap. Every one of them can be played either offline or online. Racing events take place all around the world. The main objective of the game is to win all the X-Games events present in the game. \n\nThe players use an RV as their headquarters. There you can choose races to participate in, customize a wide range of cars or choose your co-driver. Multiple racing stars are present in the game, most notably Ken Block and Travis Pastrana. \n\nThe game features an enhanced physics engine which simulates vehicle weight with pin-point accuracy and allows for realistic terrain effect on the handling of the car driven by the player. \n\nA multiplayer mode is also featured in the game. Compete with seven other players either in ranked or unranked matches.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Codemasters","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":586153,"name":"Goose Goose Duck","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/983/98330a21cccd92d900d7b97b81e6db9e.jpg","description":"Goose, goose, DUCK? You and your crew on the SS Mother Goose must work together to keep your ship in tip-top shape during your long interplanetary quest. Keep an eye out for those malicious Mallards, who are out to get you and your team.\nThis Game Includes:\nPrivate and Public Game Lobbies.\nIn-game Voice Chat and optional proximity chat in private lobbies.\nLoads of Cosmetics to customize your goose! Hats, Shirts, Farts, Pets!\nCrafting! Complete tasks to obtain materials to craft cosmetics.\n2+ maps including S.S. Mothership and Black Swan!\n3+ built in game modes including Classic, Hide and Seek, and Goose Hunt!\n7+ optional sub-roles including the Dodo Bird, the Cannibal, and the Morphling!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Gaggle Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":3183,"name":"Broken Sword 5 - The Serpent's Curse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd2/dd2959a5d4ef08ca3ba887945a117334.jpg","description":"Broken Sword 5: The Serpent's Curse is a point-and-click adventure game developed by Revolution Software. It was funded through Kickstarter.\n\n###Plot\nOn an art exhibition in a modern-day Paris, a criminal disguised as a pizza boy shoots the art galleries owner and steals the painting that was captured by fascists in Catalonia in 1937. George and Nico accidentally meet each other and begin the investigation of this event.\n\n###Gameplay\nBroken Sword 5: The Serpent's Curse is a 2-dimensional game that is, unexpectedly, features a third-person camera. Like in the previous titles of the series, the game still relies on its point and click user interface. In order to bring something new into the gameplay, Revolution Software added crafting into the game. Crafting allows creating new items that are essential to progress further into the game's levels. \n\nLike in the previous game, Broken Sword 5: The Serpent's Curse relies on its hotspot system. There are special spots scattered across the levels. When the players stand right on them, several actions will become available for them.\n\nCharacter death scenes are back again. It is possible to die if the players react too slow on something or make a wrong decision. The players do not start off the last checkpoint after death. Instead, the players spawn right before their death scene.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Revolution Software","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":12737,"name":"Viscera Cleanup Detail","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a64/a64f58684478a9057873e370a0b7e5af.jpg","description":"Disaster! An alien invasion and subsequent infestation have decimated this facility. Many lives were lost, the facility was ruined and the aliens were unstoppable. All hope was lost until one survivor found the courage to fight back and put the aliens in their place!\nIt was a long and horrific battle as the survivor dueled with all manner of terrifying life-forms and alien mutations, but our hero won out in the end and destroyed the alien menace! Humanity was saved!\nUnfortunately, the alien infestation and the heroic efforts of the courageous survivors have left rather a mess throughout the facility. As the janitor, it is your duty to get this place cleaned up.\nSo grab your mop and roll up your sleeves, this is gonna be one messy job.\nToday, you're on Viscera Cleanup Detail!\nKey Features:\nJanitorial Simulation - Step into the boots of a space-station sanitation technician and deal with the horrific aftermath of a sci-fi horror event. Blood, viscera, spent cartridges, worker bodies and other messes litter the facilities.\nClean - It's your job to clean up the mess, so clean it up you shall! Use your trusty mop, gloves, dispenser machines, plasma laser and sniffer tool to help you get all that blood out of the floor and off the ceiling! You can even try and punch-out if you think you've done your job.\nSandbox Gameplay - Don't want to clean? Just want to make more of a mess and play around with the physics? Go ahead! You can save your game as well; that's kind of us!\nMultiplayer - You can even enlist some friends/coworkers to come and help you clean up (or make even more mess). Split-screen co-op is available too!Important: Buying Viscera Cleanup Detail also gets you our spin-off titles, 'VCD: Shadow Warrior' and 'Santa's Rampage' free!\nSanta's Rampage comes included in the main game download AND as a standalone copy you can use to connect with others who only own Santa's Rampage.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"RuneStorm","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3344,"name":"Ether One","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb5/fb5c78ebdff1690dc2db9cdf5e5462fe.jpg","description":"A walking simulator or first-person adventure game from the independent British studio White Paper Games, for which the project became a debut. According to the developers, the game explores the fragility of the human mind.\n\nThe player takes control of the nameless hero who works as Restorer as an employee of the futuristic memorial recovery company Ether Institute of Telepathic Medicine., Whose task is to investigate the thoughts of a   woman named Jean Thompson with a diagnosis of dementia. The restorer can project himself into one's mind. The game has puzzles, the essence of which is to reconstruct the memories of a woman. The narrative assumes several variants of the development of events so that each new passage can surprise those already familiar with the game.\n\nThe game was released on the PlayStation 4 and PC. On computers twice: in addition to the original release, in 2015 Redux version of the game was released.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"White Paper Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":517384,"name":"Turnip Boy Commits Tax Evasion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ce/4ce87a0d1274009bc19588eb491b1e01.jpg","description":"Take control of an adorable turnip who happens to be an absolute menace to society. After failing to pay taxes and getting evicted from your home, you must go on an epic quest to pay back your massive debt to Mayor Onion. Garden tools to solve plantastic puzzles, meet eccentric vegetables and fruits, and take on treacherous fights against animals both big and small. Along the journey uncover what’s spoiling this garden community and rise to tear down the corrupt vegetable government!\nA thrilling, single-player adventure full of tax evasion, petty crimes and more.\nDungeons full of puzzles, enemies and rare treasures to pay back your debt.\nBattle massive beasts that terrorize the garden community.\nGrow and harvest plants to aid in your journey.\nA large cast of quirky food-based characters, all with their own stories and problems.\nTons of tax documents to rip up, allowing you to erase your paper trail and potentially destroy the government.\nEarn collectible hats and alternate between which one to wear.\nMultiple endings based on how effectively you commit tax evasion.\nA deep history of the world and how it became what it is.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Snoozy Kazoo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":257255,"name":"The Witcher 3 Wild Hunt - Complete Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/52b/52be96c19be0d79eeb8664e4ca2aabd5.jpg","description":"Play as a Highly Trained Monster Slayer for Hire\r\nTrained from early childhood and mutated to have superhuman skills, strength, and reflexes, witchers are a socially ostracized counterbalance to the monster-infested world in which they live.\r\n- Gruesomely destroy foes as a professional monster hunter armed with a range of upgradeable weapons, mutating potions, and combat magic.\r\n- Hunt down a wide variety of exotic monsters, from savage beasts prowling mountain passes to cunning supernatural predators lurking in the shadowy back alleys of densely populated cities.\r\n- Invest your rewards to upgrade your weaponry and buy custom armor, or spend them on horse races, card games, fist fighting and other pleasures life brings.\r\n\r\nTrack Down the Child of Prophecy in a Morally Ambiguous Fantasy Open World\r\n- Built for endless adventure, the massive open world of The Witcher sets new standards in terms of size, depth and complexity.\r\n- Traverse a fantastical open world: explore forgotten ruins, caves and shipwrecks, trade with merchants and dwarven smiths in cities, and hunt across open plains, amidst mountains and at sea.\r\n- In a time of war, track down the child of prophecy, a living weapon of great power whose coming was foretold in ancient elven legends.\r\nMake choices that go beyond good and evil and face their far-reaching consequences.\r\n\r\nGame of the Year Edition\r\nThe Witcher 3: Wild Hunt Game of the Year Edition brings together the base game and all the additional content released to date.\r\n- Includes the Hearts of Stone and Blood & Wine expansions, which offer a massive 50 hours of additional storytelling as well as new features and new areas that expand the explorable world by over a third!\r\n- Affords access to all additional content released so far, including weapons, armor, side quests, game modes and new GWENT cards!\r\n- Features all technical and visual updates as well as a new user interface completely redesigned on the basis of feedback from members of the Witcher Community.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":58757,"name":"Jump Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bac/bac558c863989fadc4fede908c15cd64.jpg","description":"Jump Force is a crossover game based on the characters from various anime and manga franchises. It is based on the propriety featured in Weekly Shonen Jump magazine and is meant as a celebration of its 50th anniversary. The game is powered by Unreal Engine 4.\r\n\r\n###Plot\r\nA cataclysmic event caused the Shonen Jump world to collide with our real world. Both heroes and villains from various manga series appear on our Earth and fight in a chaotic battle for the survival of humanity.\r\n\r\n###Gameplay\r\nThe characters face each other on an arena in teams of up to three players. \r\n\r\n###Characters\r\nThe game includes more than 20 popular characters. Most famously, it features characters from franchises like Bleach (Ichigo, Rukia, and Sosuke), Dragon Ball (Son Goku, Vegeta, and Frieza), Naruto (Naruto and Sasuke) and One Piece (Luffy, Zoro, Sanji, Sabo, and Blackbeard), as well as several characters from Yu Yu Hakusho, Hunter x Hunter and Yu-Gi-Oh!. The story mode also includes two of Death Note characters (Light and Ryuk). Some of the characters make their first appearance in a video game, and some feature several forms. There are also completely original fighters created for the game. Many of the location backgrounds are also based on the anime/manga series as well as on the real places like New York and the Alps.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":17906,"name":"Cities XL Platinum","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/264/264b921f97923e16f381117759262858.jpg","description":"Cities XL was intended to be an Online Multiplayer game, where people would build their own cities and trade materials or blueprints. This was one of the ways to improve the game City Life and bring more detailed and grander experience. But it became a single-player game, due to the lack of online subscriptions, so now any new player will have the tools and possibilities, meant for a much bigger project. Cities XL Platinum edition of the game added even more features.\nThe gameplay is straightforward – players have access to the resources and landscape, and they have to build a city with a working infrastructure. Three types of building can be built in the assigned zones: Reside, Commercial and Industrial. Social classes of potential residents can separate residential areas. The task is to run a simulation of a functional city, where the mayor has to listen to the concerns of residents, building and fixing roads and means of public transportation and make sure, that there’s always enough energy and resources. Players will be able to build more than 1000 buildings on 60 expansive maps.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":11751,"name":"Blood Bowl Legendary Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6b4/6b4353172a07d3c4c83fa731f7ddaee6.jpg","description":"Blood Bowl is an ultra-violent fantasy football simulator inspired by the Warhammer universe. The game was created in 1986 as a parody of a real sport and for a long time existed in a desktop format. The primary goal of the game is to deliver the ball to the enemy's score-zone. You can do this in two ways: to run into it or give a pass. The turn lasts until the player performs an action by all the characters.\n\nThe Legendary Edition includes 20 races, 11 of which appear in the game for the first time. Each race involves unique gameplay. Matches take place in the form of a crazy mix of turn-based combat and a sports simulator. Players noted the high difficulty of the game and its dependence on a successful dice roll: even the most simple move can fail due to a bad throw. In the career mode, the player is encouraged to start building his own team from scratch, buying new players, cheerleaders and additional coaches.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10641,"name":"Black The Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6a4/6a43b22f180792bb0474cf3100413682.jpg","description":"Collector's Edition\nIn addition to the core game, Black The Fall's Collector’s Edition includes the game's digital soundtrack, alongside a PDF artbook containing imagery from throughout the game's development process.\nSoundtrack listing:\nTrack 1 [04:49]: Dessolation\nTrack 2 [04:50]: Dissonant\nTrack 3 [05:31]: Glitch\nTrack 4 [06:24]: Hope\nTrack 5 [14:41]: Landscape For Every Escapism\nTrack 6 [02:29]: Outside\nTrack 7 [10:51]: Postlude\nTrack 8 [03:03]: Step Into The Light\nTrack 9 [08:08]: The King Is Dead\nTrack 10 [04:42]: Unexpected Friend\nTrack 11 [03:41]: Uplifting\nTrack 12 [02:35]: Void\nAbout the GameAfter decades of toil, an old machinist plots his escape from the oppressive grasp of the Communist regime. Through hidden passages, shadow and grief, he struggles. Ingenuity, reflexes and deception are his tools. Along the road, he befriends the most unlikely creature, an abandoned little robot. Could they escape this bleak and deadly world, together?\nFeatures\n•  Unravel the puzzles buried within the oppressive atmosphere of a dystopian dictatorship\n•  Harness the power of a stolen designator tool to manipulate both man and machine\n•  Befriend a lonely lost robot and earn its loyal companionship\n•  Take your shot at overthrowing a Communist State inspired by real world events","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":364975,"name":"The Coma 2: Vicious Sisters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/945/945afcc72ce19b6636c02b81cae2eb24.jpg","description":"Mina Park, a student of Sehwa High, awakens at night in her school. It isn’t long before she realizes that something is amiss. The once-familiar school where she spends her evenings studying looks twisted by something dark and sinister. She finds herself pursued by someone or something that looks eerily like her teacher. To survive, Mina must venture beyond the boundaries of her school and into the surrounding district. There, she will encounter strange creatures, mysterious strangers, and uneasy allies.\nThe Coma 2: Vicious Sisters is an atmospheric, story-driven game. Immerse yourself in the warped Sehwa district as you encounter an engaging cast of characters, solve puzzles, discover revealing clues, and fight for survival against a relentless psycho.\nHeroines, forced to confront their worst fears, rarely emerge unscathed. Over the course of the story, Mina will encounter dangerous scenarios from which she could sustain permanent damage. Craft items to anticipate future dangers to avoid injury.\nDark Song is now more fearsome and powerful than ever before. Falling into her grasp could spell instant death. Running and wielding your flashlight makes you an easy target. You must precariously balance the urgency of exploration with your absolute need to survive!\nFear Dark Song’s relentless pursuit to kill you, now with an all-new AI.\nCraft items to prepare for critical life-or-death situations or risk permanent injury.\nExplore the nightmarish district of Sehwa and discover its dark secrets.\nScavenge resources to survive deadly encounters and afflictions.\nUnlock tools and upgrades to reach previously inaccessible areas.\nHide to avoid detection and certain death. Pass challenges to conceal your location.\nFeaturing vibrant, hand-illustrated in-game visuals and comic strips.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Devespresso Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":1692,"name":"Crimsonland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/adf/adfa87c6b78fe175e7441fabd89ad75d.jpeg","description":"Crimsonland is a 2014 re-release of the 2003 dual-stick top-down shoot 'em up with the RPG elements. That is the only game within the IP.\n\n###Gameplay\nThe game consists of the player and infinite waves of the enemies divided into the levels. The walkthrough may be eased by inviting up to three other players into the game. \nThere are seven game mods: \"Quest\", featuring 60 levels on different areas, each with the individual set of goal thus the name; \"Survival\" in which there are infinite waves of enemies and player is challenged to hold out as long as possible; \"Rush\" gives the protagonist only AK-47 and asks him to react quickly to the enemies; \"Nukefism\" does not allow the player to wield any weapon, but the collection of bonuses allows him to crash the foes; \"Weapon Picker\" speaks for itself — there is no ability reload, so the player is forced to change the firearm every time they run out of ammo. \"Blitz\" is just upgraded \"Survival\" and finally the \"Gembine\" which is just 2048 tiles game in the Crimsonland setting. \nThe \"Typ'o'Shooter\" mode was removed — players had to type the words appearing on the screen to kill the enemies in it.\n\n###Story\nThe title features no storyline whatsoever. The only sign of a story is the quest system. Completing the quest allows the player to unlock more weapons and perks.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"10tons","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":9789,"name":"Google Earth VR","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e46/e467e49e03b95b4733c44303d0102cb3.jpg","description":"Google Earth VR lets you explore the world from totally new perspectives in virtual reality. Stroll the streets of Tokyo, soar over the Grand Canyon, or walk around the Eiffel Tower. This virtual reality app lets you see the world’s cities, landmarks, and natural wonders. You can fly over a city, stand at the top of the highest peaks, and even soar into space. Earth VR comes with cinematic tours and hand-picked destinations that send you to the Amazon River, the Manhattan skyline, the Grand Canyon, the Swiss Alps, and more.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Google","platforms":[{"id":0,"name":"PC"}]}]