[{"id":16579,"name":"Game Corp DX","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d6c/d6cb87be442351caa6cbbff1d3d3755c.jpg","description":"Manage your Game Studio, earn big bucks, impress the critics, beat rival studios and clean up at the awards!\nBased on the Flash game that has been played over 5 Million times, Game Corp DX is an enhanced version that has been built from the ground up to be enjoyed on PC, Mac and Linux with proper full screen support, faster performance, Steam features and a lot more polish!\nBuild your Game Corp from scratch and make it into the best one ever!\nStart small by making micro games to give your workers experience\nPick a project name, scale and genre\nExpand your Studio and your team, hire new workers, train them to use better tools and use those tools to make better games!\nTrain your workers to the max and create the ultimate Game Developer team!\nPublish your games, impress the critics and beat the other Studios at the Annual Videogame Studio Awards!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Endless Loop Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9867,"name":"Rick and Morty: Virtual Rick-ality","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccd/ccd34c9f511f91edaa03bea681d207ea.jpg","description":"Rick and Morty have teleported into your living room for a cutting-edge VR adventure from Adult Swim Games and Owlchemy Labs (Job Simulator). Play as a Morty clone as you explore Rick's garage, the Smith household, and alien worlds.\nExperience life as a clone of Morty and all the trauma that comes with it. Step through portals to strange worlds, help Rick with his bizarre experiments, and use your hands in VR to pick up and play in an interaction-filled 3D Rick-ality. Follow Rick's directions (or don't!) to solve puzzles and complete missions in this fully voice acted adventure.\nFeatures:\n-It's your favorite 2D characters in 3D. It's RICK AND MORTY VR! They're 3D now!\n-Probe, prod, throw, and smash iconic items like the Plumbus.\n-Also, it's got this thing!\n-Teleport around rooms and walk through portals.\n-No really! You walk with your actual feet through virtual portals!\n-Get yelled at by Rick, and question your own self worth.\n-Smack Rick in the face.\n-Real fake doors!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5535,"name":"Condemned 2: Bloodshot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d05/d058d2555d52a40192a140d31f0b1560.jpg","description":"Condemned 2: Bloodshot is a thrilling first person action game that you won’t want to miss. It's been a year since a ruthless serial killer terrorized the city, but once again the bodies are piling up. As renegade special agent Ethan Thomas, you are society's last defense against the darkness threatening to consume us all.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SEGA","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":885,"name":"Small Radios Big Televisions","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/878/878ccd56976d559db37bad49da0e5fed.jpg","description":"Descend into abandoned factories in search of lost cassette tapes that hold boundless virtual worlds. Explore, manipulate, and distort the tapes to make them reveal their secrets. Solve mechanical puzzles and map the winding halls of these empty monoliths. Will you be able to find the way out, or what has happened?Key FeaturesCollect: More than 30 different tapes and distorted versions to explore.\nListen: Distinctive soundtrack that changes along with each tape that is warped.\nSearch: Find items within the tapes to help you continue on your journey.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Adult Swim","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":644781,"name":"MIR4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/650/650350f286e4e809da148b9495031489.jpg","description":"[Features]Warriors, which path would you choose in the land of MIR?\nVenture into the unknown seeking the next adventure\nPerhaps live a peaceful life through hunting and gathering\nOr wage war against other warriors and clans to conquer over all.\nFollow your heart and choose your path.\nThis is where your story begins... Mir4.\n*Beauty and elegance of Oriental movementExperience the elegant style of oriental martial arts combined with real-time fluid combat motions.\n*All paths lead to your growthEvery trade has its master! Tired of hunting? Try gathering or mining.\nAll of your activities in MIR4 will ultimately reward you with character growth.\nYour time and effort spent in-game never goes to waste!\n*Who will claim the treasure. Free LootingUnprecedented Free-for-All looting system where anyone has the right to claim loot.\nBe aware of others when attempting to loot!\n*Hidden Valley CaptureHidden Valley, the core of MIR4's economy.\nMonopoly through control or mutual gain through coexistence.\nWhich path will your clan choose?\n*From my battle to our war, Castle Siege.Face the challenges of life and death alongside Clan-mates\nCompose an epic story through countless glorious battles\nAt the end of your conquest, the strongest Clan will be born!\nFor your Clan's honor and legacy, start your war now in MIR4!\nA true cross-platform massively multiplayer game that allows you to play with your friends from your PC and Android/iOS devices.\nMIR4 supports 12 different languages.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Wemade Co","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":320375,"name":"Die Young: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/819/81990df452e7bc9985517ff3fbd7c644.jpg","description":"Die Young: Prologuenarrates the events that occurred a few hours before the main story of Die Young.\nhttps://store.steampowered.com/app/433170/Die_Young/\nIn Die Young: Prologue you play as Nehir, a field agent of a well-known political party.\nThe party's agenda is to deconstruct and eliminate Brother n.1, the leader of Island's community.\nCollectively, Nehir infiltrated the Island with her peers.\nTheir mission was to free the leader of their party who was being held captive.\nThe secondary objective of their plan was to kill Brother N.1.\nThe plan, however, took a turn for the worst.\nIn a last-ditch effort to assassinate Brother n.1, Nehir blew her cover and was forced to make a daring escape.\nThe Prologue covers her desperate attempt to reach the rendezvous point. Will she be able to save herself or will she die young?\nDie Young: Prologue is an action-adventure with a more linear structure than the open-world of Die Young, but it leaves the player with the possibility of using different approaches and paths to escape.\nThe game consists of three levels: Introductory, Main, Final.\nIf players choose to explore these levels, they'll discover several useful items that'll unravel the deep lore behind Die Young.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"IndieGala","platforms":[{"id":0,"name":"PC"}]},{"id":22220,"name":"FlatOut 4: Total Insanity","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee4/ee4520c8196ae7594f67fb653adf2b85.jpg","description":"FlatOut Is Back!\nFlatOut 4: Total Insanity™, where reckless driving has never been this much fun.\nFlatOut 4: Total Insanity™ blends everything everyone has ever loved about FlatOut into one offering.  Gamers will also be introduced to all new and exciting features, game modes, and vehicles which will soon become personal favorites. Another installment of nitro fueled demolition and derby racing featuring a variety of tracks, modes, arenas and multi-player options are available. Welcome back to FlatOut!\nExclusive to STEAM version of FlatOut 4: Total Insanity™\n•\tBig Picture Mode\n•\tSteam Achievements\n•\tPartial Steam Controller Support\n•\tSteam Leader Boards\n•\tSteam Cloud\n•\tSteam Trading Cards\n•\tExclusive Arena: Ice Lake Arena\n•\t2 Exclusive Drivers: Gadget Stewart and Dave Worker\n•\t2 Exclusive Vehicles: Ice breaker and Repair truck\n•\tSteam Workshop coming 30 days post launch\nFlatOut 4: Total Insanity™ Features\n•\tHigh Speed racing and collisions on a variety of tracks and environments\n•\tCustomizable Cars: Gamers will unlock 27 cars to customize and race, including tributes to fan favorites and new additions to the garage\n•\tGamepad Controller Support\n•\tDynamic Tracks: FlatOut 4: Total Insanity™ features 20 tracks including traditional derby racing, time trials, arenas, assault levels, carnage levels and much more\n•\tDestructible Environments: Chaos and destruction return to the world of racing with high speed collisions and wild destructible environments\n•\tThe Legendary Stunt Mode:  Featuring 12 stunts in total. Six new stunts and six re-imagined classic stunt mini-games await fans in search of epic crashes and death-defying maneuvers\n•\tArena Mode: Three game play styles including Death Match, Capture the Flag and Survivor\n•\tNew Assault Mode: An arsenal of deadly weapons at your disposal to slow or destroy opponents\n•\tSingle Player: Race, Destroy and enjoy Stuntman mode offline before showing off your skills in multi-player\n•\tMultiplayer Mayhem: Competitive online modes allow up to eight players to master destruction arenas, race courses and set traps\n•\tHot Seat Mode: Take turns with your family and friends in hot seat competition of Stunts\n•\tThumping Indie Soundtrack:  FlatOut features a global range of over 35 amazing indie music tracks\n•\tMale and Female Drivers:  12 Drivers: 6 males and 6 females:\n•\tClassic\n•\tMilitary\n•\tPrisoner\n•\tPunk\n•\tClown\n•\tHippie\n•\t+ 2 Exclusives: Gadget Stewart and Dave Worker\n•\tUses the power of next gen devices with high end 3-D rendering\n•\tSophisticated Physics engine based on Nvidia PhysX and KT Engine","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":11513,"name":"STAR WARS: Rebel Assault I + II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/467/4679ac4202053ae7546e28d35d3e87bc.jpg","description":"Star Wars™: Rebel Assault\nRebel Forces have won their first battle against the dark side... But the war has only just begun!\nAs Rookie One, you are thrust into a 3D galaxy far, far away to crush the evil Empire, once and for all. Take your T16 Skyhopper on a training run through Beggar's Canyon... Then dodge asteroids and blast TIE fighters in a deep space rumble... tackle a fleet of menacing AT-ATs on the icy tundra of Hoth... and ultimately annihilate Vader and the evil Empire with a kamikaze trench run on the infamous Death Star.\nStar Wars™: Rebel Assault II: The Hidden Empire\nThe story opens in the vicinity of the Dreighton Nebula, where Rookie One is part of a Rebel scouting patrol. He's investigating disappearances of Rebel spacecraft near Dreighton, a region rich with mythology about vanishing spacecraft. Legends of the region go back to the days when early hyperspace travelers lost their bearings and disappeared in the currents, eddies, and storms of the nebula. During the Clone Wars, two opposing combat fleets, at the height of battle, were swallowed up by the Dreighton Nebula, leaving it as the battle's only true victor.\nFeaturing original, live-action Star Wars footage, Rebel Assault II: The Hidden Empire hosts a multitude of ground-breaking improvements, including intuitive and challenging arcade game play; fifteen land, sky and space missions; an original Star Wars story; full-Screen high-quality video; four skill levels from easy to hard; a digital John Williams Star Wars soundtrack; and authentic sound effects by Skywalker Sound.\nPilot X-wings, B-wings, speeder bikes and the legendary Millenium Falcon.\nBattle stormtroopers, TIE fighters and a Super Star-Destroyer.\nDigitized cinematic sequences from the Star Wars trilogy with additional footage created exclusively for the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3248,"name":"Velocibox","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e88/e8893618a8c231218be136516de62cf0.jpg","description":"Velocibox is a twitch-heavy action game crafted for the hardcore audience.\nFlip, spin and dodge your way through more than 70 deviously designed patterns.\nFeatures an insanely difficult Super Velocibox mode for the uber-hardcore.\nSo addictive the developer has been called a filthy drug dealer.Popular YouTube FeaturesFeatured in popular YouTube Let's Plays such as UberHaxorNova, jacksepticeye, Markiplier and more!\n\"One of the hardest ******* games I think I've ever played.\" - UberHaxorNova\n\"This is a whole 'nother realm of twisty-nipple-freshness!\" - jackcepticeye\n\"Yoo-ba-do-bi. Ha-ba-da-bubu. Ha-ba-fu-biii! Haaa! Ha-ba-ja-foo-boo!\" - MarkiplierImportant UpdatesParty pooping frame rate dependency bug has been fixed.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"LOOT™ Interactive","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":795,"name":"LASER DISCO DEFENDERS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1b/d1b3e307229aa601ddcd2970ea2eebf7.jpg","description":"Save the galaxy and its taste in music, in this self-inflicted bullet hell - Pew! Pew! Pew!\nJoin the Laser Disco Defenders on their quest to defeat the evil Lord Monotone and prevent him from using the coveted Mirror Moon to force the galaxy into dancing along to his, and only his, tune. In this self-inflicted bullet hell you must stay on your toes as each laser beam fired ricochets off walls and can hit you too! Traverse randomly generated levels and face off Monotone’s various robotic machinations. Be it flamboyant flame sneakers or a cool rapid fire chrome suit - you decide how your favourite disco defender looks and plays based on what outfit you choose to wear. Time to save the galaxy and look like a cool cat!\n\n•\tThanks to randomly generated levels no play through is the same\n•\tChoose your own look and play style with different characters and outfit combinations\n•\tOnline leader boards shows you the “master of the dance floor”\n•\tIncredibly groovy 70’s disco style soundtrack\n•\tFunky visuals inspired by 70s fashion and cheesy sci-fi flicks","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Excalibur Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":61849,"name":"Project Hospital","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b7/1b75f567d565a793d01000f4c58a5ba6.jpg","description":"Become an ace doctor, an aspiring architect and a successful manager at the same time. Design your very own hospital, tweak every detail or use one of the predefined models and just jump to the doctor’s duty.\n\nContract different insurance companies to gain access to patients with interesting medical conditions, perform examinations, laboratory tests and use various equipment to solve the diagnostic puzzles. \n\nHospitalize your patients, perform surgery and more!\n\nHere's a list of languages we're expecting community translations will be available for release:\n\n* Italian\n* French\n* Spanish\n* Spanish (Latin-American)\n* Brazilian Portuguese\n* German\n* Dutch\n* Russian\n* Polish\n* Croatian\n* Czech\n* Chinese (traditional)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Oxymoron Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":53377,"name":"Lego Star Wars: The Video Game","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/243/2438ebcc86247ea7ee978664e082ce66.jpg","description":"Lego Star Wars: The Video Game is a Lego-themed, action-adventure video game based on the Lego Star Wars line of toys, and the first installment in the Lego video game franchise developed by Traveller's Tales, which would develop all future Lego titles from that point on. It was first released on 29 March 2005, and is a video game adaptation of the Star Wars prequel trilogy: The Phantom Menace (1999), Attack of the Clones (2002) and Revenge of the Sith (2005), with a bonus segment from A New Hope (1977).\nIt is the only TT Games' Lego title to be rated E by the ESRB for consoles (the handheld version of TT's Lego video games may have an E rating) while other Lego video games 2005-onward are E-10.\nIt was developed by Traveller's Tales for the Microsoft Xbox, Sony PlayStation 2 video game consoles, and Microsoft Windows personal computers, with Griptonite Games developing the Nintendo Game Boy Advance version. These initial versions were published in April 2005. A Mac version, developed by Aspyr, was released in August 2005. A Nintendo GameCube version of the game was released on 26 October 2005. All versions were published by Eidos Interactive and Giant Interactive Entertainment, with Star Wars assets licensed through LucasArts.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 2"}]},{"id":20116,"name":"Alpha Runner","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edf/edf14999d05f8d09760d3ef75c8b4d60.jpg","description":"Experience a challenging and addicting platform game, that never ends (until you die). Alpha Runner keeps players on their toe's by creating different scenerio's so the game is not quite as easy as it looks. Alpha Runner has both Global and Friends Only leaderboards which allow you to be the very best between friends and others. With Alpha Runner's randomly generated worlds, you cannot plan how it will play out. Alpha Runner is a must play for anyone who wants an extreme and competitve challenge.\nAlpha Runner will have frequent updates which contain new obstacles and game-modes to make the game even more enjoyable.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LightsoutGames","platforms":[{"id":0,"name":"PC"}]},{"id":19636,"name":"Sideway New York","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25a/25ab8bc9cec197c91f50555077e5aa9e.jpg","description":"Battle your way through a twisted graffiti world where your prowess in puzzle solving makes the difference between life and death!  Jump into one of the most unique and visually compelling 3D game worlds ever created.  Follow the twisted journey of Nox, through a fast-paced 2D adventure set in a 3D world. Unlock new abilities to defeat enemies and rescue friends. Beware, in Sideway™ New York, you’re in a world where your favorite color might just kill you!\nKey Features\n\nExperience an Adventure Platformer like you’ve never seen before!\nMaster the challenges of changing camera angles, gravity and movement between 2D and 3D worlds!\nCollect unlockable abilities that let you SOAR, SLIDE, JUMP and BLAST through your enemies.\nSupports full drop-in/drop-out local co-op\nFight bizarre boss battles, including a sadistic pink bunny that vomits sadistic pink mini-bunnies...yeah, we've got that!\nCheck out the bangin’ soundtrack by Mr. Lif.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Playbrains","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":15757,"name":"Surgeon Simulator VR: Meet The Medic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edc/edc4417c2bbf275b080f7f6fd955359f.jpg","description":"Check Out the Full Game - Surgeon Simulator: ER!http://store.steampowered.com/app/518920\nAbout the Game\nSurgeon Simulator VR: Meet the Medic – be the Medic and operate on the Heavy in this free exclusive for HTC Vive!\nYou’re leaning over a strangely familiar patient in dire need of a brand new heart, alongside an operating table full of terrifying implements you’d hoped never to have to pick up for yourself. What will you do? Which one will you reach for first? The bonesaw, or a sandvich…?\nNow, you have the chance to get truly ‘hands-on’ and test your backstreet surgery skills in VR.  Surgeon Simulator VR: Meet the Medic, allows you to step into the shoes of Team Fortress 2’s, The Medic, where only you can save The Heavy as his life ebbs away before your very eyes.\nThis brand-new virtual reality experience from Bossa Studios reunites two of TF2’s most-loved characters, who were originally brought to Surgeon Simulator back in 2013. Now, fresh into the VR stage, where you perform life-changing surgery under the gentle gaze of Archimedes, the dove from Valve’s hit game. Poke with a pencil, slash with a machete, chop with an axe, perform delicate tasks with a baseball bat; but be careful...time is ticking.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2383,"name":"Karateka","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b4/9b42279591a018adcaae8a92cad80de1.jpg","description":"From PRINCE OF PERSIA creator Jordan Mechner, the original side-scrolling karate classic comes to Steam with art by Jeff Matsuda (The Batman) and music by Grammy-winning composer Christopher Tin (CIVILIZATION IV).\nWhether you are a nostalgic Karateka fan or new to the game, Karateka will charm you with its classic love story set in feudal Japan. Fight to save the lovely Mariko from the evil warlord Akuma and reunite her with her True Love!Key Features:\nRhythm-based combat mechanic. Easy to grasp yet challenging to master, the cinematic gameplay seamlessly blends a series of escalating karate battles with a simple human story.\nThree playable characters. Three endings. Three suitors vie for Mariko’s love: A fearsome Brute, a noble Monk, and her brave True Love.\nHighly replayable. Innovative “three suitors” system offers a compact single-playthrough experience, yet challenges advanced players to unlock more difficult achievements and endings as their skill improves.\nUnique real-time score by Christopher Tin tells the story through the music. Authentic Japanese instruments and themes let you “hear” the onscreen action in real time.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"DotEmu","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":45429,"name":"Yet Another Zombie Defense HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3f/e3fab0d941e730831407f5b816a26fdb.jpg","description":"Build your base by day. Defend it by night. Stay alive as long as you can.\nYet Another Zombie Defense HD is all about defending yourself against hordes of darkness attacking you every night. However, when you're the only survivor struggling against waves of enemies who are getting stronger and stronger, your end is inevitable. The only important question is how long can YOU survive?\nThe game is a top-down arcade zombie shooter with strategy elements. You're able to choose from variety of weapons to mount them onto auto turrets and set up defensive barricades to stay alive as long as you can. It's for gamers who like to put their skills to the test, find optimal strategy, and reach the highest spot on leaderboards! It also features both online and local co-op mode, where you can blast zombies with up to three friends as well as player vs player deathmatch mode!\nWe have some great news who everyone who wanted more from Yet Another Zombie Defense. The upgraded version is coming to Steam in just two weeks and it's going to bring a lot of awesome improvements, including frequently requested Steam Workshop integration!\nFirst of all, the HD version was entirely rebuilt with Unity3D engine, which is an awesome tool for indie developers and drastically decreases time needed to make any changes. The tech that the old version was build with called Microsoft XNA was abandoned by Microsoft in 2010 and it's been a burden to work with. This is why last year we've decided to drop XNA and switch to Unity3D. It's been a lot of frustrating and painful work to port an entire game from one engine to another, but now it's clear it was well worth it - it looks much better now and we're able to add new features and content in no time.\nThe use of Unity3D engine also allows us to integrate Steam Workshop, so hopefully we'll see some great stuff that the game's community will make! Other improvements already made are better rendering and physics, new zombie characters and animation, as well as the addition of new enemies trying to get you killed. And the fourth playable character, finally. There's also features like localization including non-English chat, cloud saves, non-Xbox controller support with full controls remapping, overall better stability and performance, as well as many other minor improvements.\nAnother great news is that everyone who owns the base version will be granted a 75% off coupon at the game's launch, and will be able to cut its price from $3.99 to just $0.99! It's as low as we could get in order to justify the cost of porting to Unity3D, upgrading the content and keeping the game updated after launch. We really believe that you won't be disappointed by what you're going to get for the one buck!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Awesome Games Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":10788,"name":"Aura: Fate of the Ages","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/06c/06c691548e07e9182ff4145c9f38f9bc.jpg","description":"Achieve power and immortality in Aura: Fate of the Ages, a challenging game where you must discover hidden artifacts and explore new worlds. As Umang, your mission is to deliver sacred rings to Grifit, the old master, before the evil Durad steals them. You'll interact with various characters while exploring expansive environments across four worlds--the Ademika Valley, Mechanical World, Isoteric World, and Island of Unity. Solve puzzles and complete challenges to uncover valuable clues and inventory items.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Streko-Graphics","platforms":[{"id":0,"name":"PC"}]},{"id":3204,"name":"Madden NFL 16","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5f/d5f8f7d4c462c76cd41108e1ca2e6f5a.jpg","description":"Be the playmaker in Madden NFL 16 with all-new controls that allow you to dominate in the battle for air supremacy.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-2\n16GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc. The mark ‘John Madden’ and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear,\nInc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. All rights reserved. Offcially Licensed Product of “NFL PLAYERS INC.” and “NFLPLAYERS.COM.”\n© 2015 VUDU, Inc. All rights reserved. ©2015 All other trademarks and tradenames are the properties of their respective owners. Fastcard® is a registered trademark of InComm.® U.S. Patent No. 7,578,439\nhttp://easports.com/madden-nfl/madden-16-preorder-disclaimers","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":1956,"name":"Cosmonautica","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c2dd5a939b3dd0cef93a4bb62b5c35b.jpeg","description":"Cosmonautica is a quirky and unique blend of space trading and crew simulation.\nCast off! Are you ready for some hilarious adventures in outer space?\nStart by boarding a washed-up space cruiser and fulfill your destiny as an aspiring captain on the hunt for fame and fortune. Cosmonautica combines elements of space trading and crew simulation to create a unique experience. Only if you take good care of your crew you will be able to succeed.\nDo you have what it takes to become the best trader, smuggler, pirate or even space taxi? It’s your choice!\nSimulated Galaxy - Cosmonautica offers a detailed and amusing trading simulation gameplay that challenges you among others with pirate attacks, diverse quests and unique crew members. Explore a dynamic and procedurally generated galaxy. Every game is different!\nCrew Management - Sign up to eight exceptional and lovable crew members to create a ragtag team of the universe’s best and brightest. Take care of your crew and promote them to reach their full potential. Only if they fit together well and are satisfied, you are able to get the optimum out of your space ship.\nElaborate Trading Simulation - Trade a bevy of goods, including some rare and illegal stuff, with fellow space merchants while exploring the solar systems. Explore the galaxy and pursue intergalactic trading over many solar systems - each with it’s own traits.\nLively Story & World - Meet unique characters while you embark on a campaign to unveil the secret of a container and the mysterious past of your board A.I. N1L. Or just roam freely through the galaxy in sandbox mode.\nOne-of-a-Kind Ships - Choose from a range of ship types, equip your vessel with upgradeable rooms and customize your ship's appearance for even more individuality.\nExciting Space Battles - Command demanding space clashes against enemy ships with crafty maneuvers and tactical actions during encounters. Directly attack or outsmart your enemies by using your hacker’s ability. Or pick the peaceful route and choose diplomacy.\nCross-Platform Play - Cosmonautica supports cross-platform saved games, which will allow you to play the same game on PC and take it on the go with your tablet or other suited devices.\n\"Zappy gameplay mix between trading, fighting and crew management. Cosmonautica is different than other space simulations. Ludicrous.\"\n- PC Games (Germany)\n\"When we think about interstellar travel, our minds often go straight to intense battles with alien warships, exploration of hostile worlds, or cunning diplomacy. We often forget that between all of the action, our heroes still need to eat, sleep, bathe, and take some private meditation time (this is code for pooping).\"\n- Destructoid\n\"I’ve had a brief dabble with an early build of the Stuttgart-built indie game, and it’s exactly what the ‘Elite meets life sim’ beermat description suggests.\"\n- Rock, Paper, Shotgun\nWe’re Chasing Carrots, a small indie developer based in Stuttgart, Germany and after our first game “Pressure” we’re putting the steering wheel and earthly restrictions aside and give you the freedom of the endless space.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Chasing Carrots","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":211,"name":"Injustice: Gods Among Us","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2b/d2bf506b184ac94ca5f10570c8ab6d41.jpg","description":"Build an epic roster of DC super heroes and villains and get ready for battle! INJUSTICE: GODS AMONG US is a free-to-play collectible card game where you build a roster of characters, moves, powers, and gear and enter the arena in touch-based 3-on-3 action combat.\nTHE FANS HAVE SPOKEN:\n5/5: “This game is awesome you will not be disappointed.”\n5/5: “This game is amazing it's got everything. It makes you think. It's got action mixed with a nice collectable card game. It's a game I just can't put down.”\n5/5: “This game keeps getting better! - Every character, every new card, the gears, the new booster packs and online battles! Everything is so fresh, so cool!”\n5/5: “Love the game, can’t believe I waited this long to download it”\n5/5: “Best game ever.... Even better then Clash of Clans”\nFIGHT\nUse the touch screen mechanics of your mobile device to battle your enemies in 3-on-3 action combat. Swipe and tap to perform combos and build your power to pull off special attacks and super moves taken straight from the console version of the game.\nLEVEL UP\nBuild your move set, increase your powers, upgrade your characters and gear, and beat your competition. Constantly evolve your card collection to fit your style of play and put your best team forward as you take on a series of DC super hero and villian combatants.\nONLINE MULTIPLAYER\nTake on real opponents in Online Multiplayer Battles. Compete against players worldwide on the leaderboards, and in tournaments filled with awesome rewards. Lead your team to victory!\nMASSIVE ROSTER\nCollect and play as your favorite DC Comics icons: Superman, Batman, Wonder Woman, The Joker, Green Arrow, Flash, Bane, Green Lantern, Doomsday, and many others. With each alternate version of these iconic characters you get a new set of powers and moves, and a whole new fight!\nAMAZING GRAPHICS\nDelivers best-in-class graphics on your phone or tablet, with custom animations for every single super hero and villain. Take the battle to Arkham Asylum, the Batcave, The Watchtower, and other iconic locales from DC Comics, fully rendered in 3D.\nPlease Note: INJUSTICE: GODS AMONG US is free to play, but it contains items that can be purchased for real money.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":359267,"name":"Shady Part of Me","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/80a/80a665ecc94d6a3ef805e644d12d4bf1.jpg","description":"Shady Part of Me is a puzzle game, where gameplay serves narration.\nThe player will be invited to play two little girls.\nOne is the shadow of the other.\nAlong convoluted scenes, story twists and surprising memos, their story takes place. They evolve. They try to cooperate and reach their common goal : freedom.\nShady Part Of Me is a solo game.\nThere are Two Girls but One Character.\nAnd therefore One Player.\nKey Features\nSwitch from 2D to 3D at will\nPlay with light, shadows and perspective to overcome obstacles\nArt rendering in watercolor like style\nThe puzzle is your mind and you have to break the dream.\nLive the drawn narrative journey of your character\nEvolve in a world where light and shadow really follow the laws of physics","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Douze Dixièmes","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":61275,"name":"Speed Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ee4/ee4cfe4010177f14a6c9cf807ccad6c7.jpg","description":"Speed Brawl is a 2D combat-racer about moving fast and hitting hard! Maintain your momentum, build your combos, and unleash powerful special moves. Find your own fighting style, and assemble the finest team of brawlers ever seen. Then do it all again faster... faster... FASTER!!!Features6 Unique Brawlers with their own play styles\nLoads of upgrades to customize each fighter and blast through the competition\nRazor sharp visuals and beautifully animated characters\nOver 50 unique action-packed events and races to wade through across multiple Speed Brawl Leagues.\nLocal and online co-operative play through the whole campaign!\nStoryLondon, 1888. After a decade of war with the Lunar invaders we named the Selenites, the British Empire finally vanquished the insect-like menace thanks to a dashing officer by the name of Hugo Wells. He crushed the colony’s queen and in doing so cemented his status as both a hero of the empire, and the de facto patriarch of the drone-like Selenites.\nFollowing the war, the Selenites became the new workforce of our industrial revolution, ushering in a new era of progress and prosperity. Freed from the shackles of employment, man could pursue more earthly endeavors. However, listlessness and disobedience rampaged throughout the middle and working classes. In order to satiate the masses, Hugo Wells conceived of the ultimate entertainment. An elite sport where only the bravest, the fastest and the most worthy warriors could wage a petty war against the enslaved Selenite hordes. Welcome… to Speed Brawl!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kongregate","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":39604,"name":"Ion Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef4/ef4e2cdecef011fec21e5bc5c957ba01.jpg","description":"In ION ASSAULT players wield thousands of Ion Particles to blast, fry and disrupt anything on screen as you see fit!\nGAMEPLAY WITH A TWIST: By centering its gameplay around its unique fluid and particle physics system, ION ASSAULT adds a twist to arcade style space shooters!\nANYONE CAN PLAY: Utilizing its dynamic level intensity, ION ASSAULT is both accessible for the beginner as well as challenging for the skilled gamer. The faster you destroy obstacles, the more enemies the game will throw at you, so play it safe and clear one obstacle at a time or go crazy and see how many enemies the game can throw at you for a maximum score!Key features:Classical Shoot’em up with tactical depth: Ion Particles are limited for each level\nWield thousands of Ion Particles.\nUse your space ship to fight against enemies and to destroy asteroids by absorbing and blasting Ion Particles.\nCollect valuable power ups to improve your ship, your defense or your fire power.\nBlast 30 different enemies using a variety of patterns to attack.\nFight through 4 large sectors, each guarded by a huge boss!\nOver 20 levels, 5 levels in each sector\nConquer the leaderboard by mastering the innovative multiplier-based scoring mechanic.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Coreplay","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":18860,"name":"Space Codex","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/894/8949ff4a2c7b26d560e92d99ed75d59b.jpg","description":"Space Codex is a casual retro arcade minimal awesome top-down shooter featuring waves of enemy spaceships with different attacks in what is, literally, a bullet hell. To beat them, you will have power-up options available through the map. The game only gets harder. How long can you stay alive?\nFeatures:\n- Multiple and unique power-ups\n- Beautiful retro, pixelated graphics\n- Unique chiptune soundtrack\n- Multiple enemies with different behaviors\nMusic by:\nVisager\nsawsquarenoise\nTeknoAXE","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"takk","platforms":[{"id":0,"name":"PC"}]},{"id":18262,"name":"Luxor Evolved","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/022/022e2c5212fb8b00d671a4d0ee7744df.jpg","description":"In an all-new, completely revamped LUXOR Evolved, the chains are faster, the power-ups more awesome, the shooters more stealthy.  In this retro-styled arcade shooter, you’ll experience a faster, more intense LUXOR, unlike any you’ve seen before.\nRevisiting the arcade classics, LUXOR Evolved is action packed with 65 unique levels, addicting effects and sound tracks. This number one marble shooter game has tons to keep the challenges coming and your shooter firing.\nKey Features:\n65 levels of all-new fast and furious LUXOR\n7 Interactive Sound Tracks\n21 power-ups and 3 super power-ups that upgrade your Shooter\n4 Game modes\nUnlockable secret levels and bonus levels\n33 Achievements","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":17671,"name":"Remnants Of Isolation","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a5/1a5ce5092723113f39a39eba70b115e4.jpg","description":"Grand Prize Winner of the 2014 Indie Game Maker contest.\nMagic is a curse. A plague upon the world and those that live in it. Those that are born with this curse unwittingly sap the mana from the earth they stand in. In order to prevent these abominations from draining away the world's lifeblood, they are locked away in a castle in an isolated dimension. It is in this castle that the cursed are to remain, removed from society so that their magic does not harm normal people. They are to be kept here for the rest of their miserable lives.\nAt least, that's the way it should have been...\nSuddenly, a loud crash is heard. A young girl, kept apart from the rest of the castle, looks up from the ground. The magical barrier that prevented her escape slowly dissipates. Standing up, she pushes open the gate and finds her first taste of freedom. Guide her as she teams up with a renegade mage boy to search for the truth behind the castle, her unique magic, and a way to escape.FeaturesA simple, but deep Spell Fusion system that allows for lots of experimentation.\nA heavy atmosphere made from a somber soundtrack, terrifying enemies, and a powerful tale.\nSimple puzzles that rely on each character's field abilities.\nA variety of locations to explore.\nA twist on traditional turn-based combat via MP charging.\nDiscover the tragic stories of the castle's inhabitants by piecing together bits of information found throughout the adventure.\n3 different endings affected by your actions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team Isolation","platforms":[{"id":0,"name":"PC"}]},{"id":16559,"name":"UBERMOSH:BLACK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/796/796106cffe1289d0bebdea79a9b4cf93.jpg","description":"UBERMOSH:BLACK is the second volume of the arcade series UBERMOSH.\nCut bullets with your sword, shoot with heavy guns and splatter enemies with a rage fueled psionic wave.\nA love letter to the community, Black comes with the \"brainclap\" feature, a new class mod, more achievements, more enemies, a new ultimate gun and a complex balance to allow 30% more stuff on screen creating an even more intense combat experience, packed in 90 seconds bursts.\nWelcome back, to UBERMOSH.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walter Machado","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14142,"name":"Blitzkrieg 2 Anthology","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/425/4258ed0ffc18009a4eb7a42bbf03c6c7.jpg","description":"FREE DEMO AVAILABLE!\nAbout the GameEnhance the full Blitzkrieg experience!\nhttp://store.steampowered.com/app/235380/\nhttp://store.steampowered.com/app/313480/\nBlitzkrieg II comes with tremendous focus on new strategic opportunities, global war and gritty realism of WWII battles. On the side of Soviet Armed Forces, US Army or German Wehrmacht you plan entire operations and lead your men into fierce action, choose reinforcements and use a wide range of new weapons in three full-blown campaigns that span the globe. New graphics engine and significant step over the original game get you in control of the most dramatic and bloody conflict of the past century.Real Strategy\nDecide what missions to fight, accumulate and call in any type of reinforcements, capture train stations or airfields to receive more troops by railroad or get air supremacy during the entire operation. Accomplish tactical objectives and missions to support your war efforts at strategic level and ensure your combat efficiency in the decisive battles.\nPromote and assign commanders to combat units to expand your tactical advantage with over 50 unique skills and real-life abilities. Order engineers to plant TNT charge and blast passing enemy units, use linked grenades for extra damage, suppress infantry with flak fire and master other combat techniques introduced in Blitzkrieg II.Real War\nPhilippines, Iwo Jima, Tobruk, Moscow, Stalingrad, Ardennes - fight on every major front of WWII from the heart of Europe and blistering sands of Africa to the deadly jungle isles of the Pacific. Your mission goals will vary from counter attacks and air warfare to covert operations and seashore landing onslaught.\nGet access to hundreds of authentic weapons from “Satan” flame tank to Tiger II and T-35 monsters, from “Zero” fighters to V-2 ballistic missiles and 305-mm railroad guns. Make use of special forces, sappers, assault engineers and even guard dogs!\nKey Features\nFight on every major front of WWII in 68 missions through 3 campaigns that span the globe!\nPlan your actions strategically, choose what missions to fight, what reinforcements to get\nGet in control of over 250 authentic WWII units and 60 types of infantry\nOpen new tactics and abilities as units grow in experience\nUse structures and terrain for cover, destroy everything in your path, fight day and night under any climatic conditions on the ground, sea, and in the air!\nExperience intense WWII battles in stunning full 3D interactive environment, thanks to the advanced Enigma Engine with true Line Of Sight and Line of Fire systems\nStep, if you dare, into the fury of multiplayer action with match-making and auto-rating support at the special dedicated server\nCreate war the way you want it with versatile Map and Mod editor","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":12617,"name":"StarBreak","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef6/ef60ed771476b743ce013b7a0f7214a2.jpg","description":"StarBreak is a unique skill-based action platformer MMO where you explore strange sci-fi worlds alongside dozens of other players, kill legions of dangerous aliens and fight epic boss battles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Crunchy Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12502,"name":"Drive Megapolis","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/357/35727d1c85db76eb8e9f2c26c96c1dfc.jpg","description":"Improve your real life driving skills in Drive MegapolisFor those of you who are dreading that intimidating driving test, wanting to polish up their road skills for a drive through, or are looking to improve on their existing driving skills to avoid getting points on their license – Driving Megapolis 3D offers a viable solution. Specifically designed for European roads and the rules around it, this simulator is designed to be used on a PC.A cut above the restBoasting a host of features, this driving simulator is designed to be interactive and also a learning opportunity. This is a uniquely built driving simulator, which tracks you're driving mistakes along the way and highlights them clearly, giving you the chance to improve upon them. Fully packed with a bunch of scenarios, the Drive Megapolis 3D simulator comes with a series of thirty missions each one more exciting than the last. Each one designed to fulfil an objective. With the option of playing with a manual or automatic transmission.\nWe have included various options which include a host of vehicles and terrains from which you can choose from – a total of seventeen in fact. Additionally it also has real life functions including simulated design which means the roads will be busy with trams and buses – meaning if you live in a busy city around Europe you can expect the same scenery from the simulator as well.Features:\n30 missions. Objectives include parking, stopping and standing, entering and exiting the box, driving around tightly parked cars, driving to destinations, 'do not damage the cargo' and others.\n17 vehicles to drive! They include front and rear wheel drive, 4x4, buses, trucks and 19 additional modded traffic cars.\nCity, mountain and off-road maps to explore.\nYou can also encounter trams, trains and trolleybuses in addition to the above vehicles on the road.\nYou can pick up passengers in buses.\nRealistic clutch, stalls and engine simulation unique to each vehicle\nRealistic physics and weather affect conditions on different types of roads\nPeople and animals that will react according to your driving skills\nlogitech g25/g27/g29 compatible and can be calibrated to support other steering wheels.\n3 monitor setup are also available.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"npp_trainer","platforms":[{"id":0,"name":"PC"}]},{"id":388313,"name":"Control: The Foundation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/29f/29fe9a8afd1770f11b148b23308a098a.jpg","description":"The Foundation: Expansion 1. Explore the roots of the Oldest House and discover strange secrets unknown even to the Bureau. The Foundation doors are open, but some things should remain buried. The Foundation includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":292963,"name":"RAPE DAY","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53d/53d03e630b0764cdb848998eaad4dd94.jpg","description":"Control the choices of a menacing serial killer rapist during a zombie apocalypse.  Verbally harass, kill, and rape women as you choose to progress the story.\r\nIt's a dangerous world with no laws.  The zombies enjoy eating the flesh off warm humans and brutally raping them but you are the most dangerous rapist in town.\r\nRape Day is a choose your own adventure visual novel.  It does not include grinding or any other time wasting activities.  So skip the foreplay and enjoy your Rape Day; you deserve it.\r\nRAPE DAY - THE VISUAL NOVEL GAME  CONTAINS:\r\n571 Images\r\n7,851 Words\r\nEvil Choices","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Desk Plant","platforms":[{"id":0,"name":"PC"}]},{"id":54403,"name":"GoldenEye 007 (1997)","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a1/5a145fe3002fc988140f7f00edcb9715.jpg","description":"GoldenEye 007 is a first-person shooter video game developed by Rare and based on the 1995 James Bond film GoldenEye. It was released for the Nintendo 64 video game console in August 1997. The game features a single-player campaign in which players assume the role of British Secret Intelligence Service agent James Bond as he fights to prevent a criminal syndicate from using a satellite weapon against London to cause a global financial meltdown. The game includes a split-screen multiplayer mode in which two, three, or four players can compete in different types of deathmatch games.\nGoldenEye 007 was developed over a period of two and a half years by an inexperienced team led by Martin Hollis, who had previously worked on the coin-op version of Killer Instinct. It was partially conceived as an on-rails shooter inspired by Sega's Virtua Cop, before being redesigned as a free-roaming shooter. The game was highly acclaimed by the gaming media and sold over eight million copies worldwide, making it the third-best-selling Nintendo 64 game. It received the BAFTA Interactive Entertainment Games Award and four awards from the Academy of Interactive Arts & Sciences.\nRetrospectively, GoldenEye 007 is considered an important game in the history of first-person shooters for demonstrating the viability of game consoles as platforms for the genre, and for signalling a transition from the then-standard Doom-like approach to a more realistic style. It pioneered features such as atmospheric single-player missions, stealth elements, and a console multiplayer deathmatch mode. The game is frequently cited as one of the greatest video games of all time. A spiritual successor, Perfect Dark, was released in 2000, while a reimagining of the game, also titled GoldenEye 007, was released in 2010.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Rare","platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":19970,"name":"Nightmares from the Deep 3: Davy Jones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/172/172e12f7b3b8236b809655abc5c0e635.jpg","description":"Nightmares form the Deep 3: Davy Jones -  get ready for the final chapter of the epic pirate trilogy! Become a fearless museum custodian Sara Black to face your greatest enemy, the legendary pirate Davy Jones. Discover his greatest secret and save your daughter!\nAfter a series of mysterious notes give Sara the evidence she needs to prove to the world the existence of the historical figure of Davy Jones, she calls a press conference to reveal what she has learned; that both Davy Jones and his mythical treasure are real, hidden away on a cursed island.\nSuddenly Davy Jones’s sails appear on the horizon, and the undead pirate enters the museum to kidnap Sara and her daughter.\nThey are taken to the hold of Jones’s ship. In order to save her mother, Corey Black agrees to sign a dark pact with the Sea Devil himself…\nSara Black must face her hardest task yet: in order to save her daughter from the soul-stealing pact with Davy Jones, she must find a way to cancel it.\nWill she succeed? Who is the voodoo witch who lives on the cursed island? Or the brilliant alchemist? Why does the ghost of a beautiful young girl roam Davy Jones’s island, and what is her connection to the legend?\nFeaturesThe final chapter of the critically-acclaimed Nightmares from the Deep series\n29 mini-games and 11 hidden object scenes that tell parts of an extraordinary story\n12 mysterious statues to awake – they know the past of the legendary Sea Devil\n68 diverse, majestic locations that allow you to explore almost the entire pirate island\n32 achievements to unlock\nExtras: concept art, game music\n3 types of Collectibles – 12 sea horses, 10 pirate cards and 24 puzzle pieces\nAdditional adventure, in which Sara Black discovers the shocking truth about the survivors living on Davy Jones’s island","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19319,"name":"El Matador","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fc/6fc580295b9e59e43f8db7df68935a13.jpg","description":"Experience the adrenaline-fuelled danger and heart-pounding excitement in the war on organised drug syndicates. When standard procedures fail, the hardliners are brought in.\nBecome El Matador, a DEA special agent tasked with taking down the drug barons. A new narcotics cartel is rising across Central and South America, sharpening its claws and extending its reach. Locate the encampments, infiltrate the headquarters, and put an end to the cartel's influence. In a tale of corruption, revenge and morality, the mission brief is simple: Eliminate the threat - Ultimate justice, El Matador style.Key features:Hard-hitting, movie-style storyline\nHuge arsenal of realistic weapons\nDiverse South American settings, from lush jungle to mansions and harbours\nReal physics, interactive environments and destructible objects\nGang members, clan bosses, kingpins, and many more villainous enemies\nAtmospheric engine animations bring the scenery to life\nWide range of graphical effects, including cascading shadow maps, high dynamic range rendering and many more\nSlow Motion Action feature\nFrenzyCAM mode","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Plastic Reality Technologies","platforms":[{"id":0,"name":"PC"}]},{"id":11232,"name":"Blood Bowl: Chaos Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/07a/07a68ba6b48089646960bbbdcfd3c875.jpg","description":"Inspired by the Warhammer Fantasy world, Blood Bowl is an ultra-violent combination of strategy and sports games.\nThe Chaos Edition features 23 playable races, including 3 that are totally new, each offering its own game style!  Make a competitive team, train it and buy the best equipment. Brutal victory after victory, improve your players' skills to make them into true Blood Bowl players! This is a no holds barred bonecrunching sport!  Even if tactics are your favored route, you can also choose from a large selection of incredible and vicious moves: bribe the ref, devastating spells or illegal weapons…\nIn the Chaos Edition, three new races are making their triumphant arrival on the field: the malevolent Chaos Dwarfs, the outcasts of the Underworld teams and, for the very first time in Blood Bowl, the Daemons of Khorne! The new Lizardmen Stadium is more than ready to welcome all new teams, along with a new challenging mode, World Cup: participate in a prestigious competition, and lead your team from the qualifications to the bloody final tournament!\nBlood Bowl can be played online.  Create your team, improve it and lead it to the top of the official rankings!  Develop your own private internet league to organize your own tournaments!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10067,"name":"Nomad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fcc/fccb688ff5d2c360e25f1d005d7c59ed.jpg","description":"Nomad is an atmospheric first-person platformer where you embark on a relaxing journey of melancholy to rekindle one of nature’s long-lost wonders.\nYour goal is to climb on top of a colossi to awaken it from its eternal slumber by combining jumps and a magical rope.\nClimb the CollosiUse your trusty grappling hook to latch onto the collsi and propel yourself forward. Chain your grappling hook to launch yourself into the air. Explore and create your own paths up the giant.Explore nature from a new perspectiveExplore a magical land of enormity. Enjoy breathtaking views as you continue to rise higher and higher into the clouds.\nNomad was created by Bob Wu and David Zheng as part of the University of Southern California’s Game Development class. This included a collaboration with many talented musicians at Berklee College of Music, including David Contarino, Zhengzheng Fan, Sara Maeng, Albert Wang, and Andrea Brun. For more information, please visit our publisher page. To learn more about the USC Games program, the #1 Games Program in the world, check out the USC Games website, linked to the right.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Diminished Studios","platforms":[{"id":0,"name":"PC"}]},{"id":1033,"name":"The Bug Butcher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90a/90a742dbaae83d313768fdbf5dd3ae27.jpeg","description":"The Bug Butcher is an action-packed 2D side scrolling shoot em up game where peril comes from above.\nSo in a nutshell, pest control with machine guns in space.\nThe core mechanics hold old ties from the classic arcade shooter “Super Pang” where you shoot vertically, but with modern day twists. You are Harry, a brash and tenacious exterminator who has a knack for decimating bugs.\nHarry’s current assignment takes him to the infested futuristic research facility on planet Zoit. The surviving and dwindling number of scientists employed him for his slaughtering skills. Harry’s mission: survive until the decontamination of the building is complete, hoard coins like his life depended on it, and protect the scientists at all costs. Watch out for the spiders they have a particular fondness for rubber encased science/scientist. After landing, you will move from room to room through the facility blasting rockets, lasers, and wielding the power of lighting upwards at anything not human.\nRavenous swarms and ferocious waves of bugs of every size will attempt to kill you, but luckily there will be weapon and health pick-ups to aid Harry on his quest. Fierce reflexes are mandatory for survival, but Harry’s brutal power-ups will let the guts fly and make the larva cry! If you love games with humor, perfect platforming, grotesquely cute art, nightmarish bosses, and real personality then The Bug Butcher will suit your fancy.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":776325,"name":"The Serpent Rogue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/669/669d464b1623d01828cc02f1b13ed780.jpg","description":"JOIN US ON DISCORD\nAbout the GameThe Serpent Rogue is a botanical action-adventure game built around exploring a medieval fantasy world, mastering the art of alchemy, and taming wild creatures.\nPlaying as a mysterious alchemist known only as The Warden, you will craft, brew, boil & concoct potions all in your stead to protect the realm from the dreadful Serpent Rogue!EXPLORE THE UNKNOWN\nThe ominous Serpent Rogue has laid down roots on Mount Morbus. Its evil is spreading quickly, and it threatens to overwhelm the realm. It is your task as the Warden to confront the Serpent Rogue and bring peace and tranquillity to the land. Explore every inch of the map, unearth secret passages, and expand your knowledge to stand against the incoming disaster.CRAFT POTIONS & EXPERIMENT\nUsing your alchemy skills, craft and experiment with different ingredients to create extraordinary potions each with its own unique effects. Take on quests from the inhabitants of the cursed land and earn resources to further your exploits.CHOOSE YOUR ACTIONS\nEach action you take will create interesting sequences of cause and effect. Keep too many creatures in one place and this will attract blood-thirsty reapers. Forget to bury the perished ones and you’ll start to attract corpse-eating ghouls. Hoard too many items in one location and attract plague-spreading vermin.EVOLVE\nShapeshift into different creatures, brew potions that will alter your body, give you unique abilities and create the perfect balance between human and creature.END NOTEFollow, join the community and chat with the devs. Look in the external links to join our Twitter, Youtube and Discord. We're always there for you!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sengi Games","platforms":[{"id":0,"name":"PC"}]}]