[{"id":962211,"name":"Undawn","genre":"Action","price":0.0,"description":"Join Our Discord\nAbout the GameExplore, adapt, and survive in Undawn, a free-to-play open-world survival RPG for mobile and PC developed by LightSpeed Studios and published by Level Infinite. Embark on an adventure with other survivors four years after a worldwide disaster where hordes of infected roam a shattered world. Undawn combines PvP and PvE modes as players fend off dual threats of the infected and other humans as they fight to survive in this apocalyptic wasteland.\nSURVIVE YOUR WAY\nBecome the ultimate endurance expert. Protect your home, allies, and what's left of humanity against overwhelming odds. The seamless open world of Undawn is filled with realistic details, made using Unreal Engine 4. In this world, players must brave rain, heat, snow, and storms and track their character’s survival indicators such as Hunger, Body Type, Vigor, Health, Hydration, and even Mood. Changes in the environment will also affect these survival indicators in real time. Players can customize their character’s appearance and outfits, interact with other players to trade weapons and resources, and fight to protect their resources.\nEXPLORE AN EXPANSIVE OPEN WORLD\nDare to explore a huge seamless map filled with distinct terrains such as plains, mines, deserts, swamps, and abandoned cities, each with diverse ecosystems filled with animals, plants, and weather systems. While exploring the remains of society, players can discover special game modes through interactive environmental items, embattled strongholds, and dynamic weekly events and side quests. Players must bravely explore the continent, learning to craft tools, master different weapons, build a shelter, search for survival buddies, and do everything they can to stay alive. The infected can appear anytime as you are exploring and are a huge threat to your continued existence!\nREBUILD THE RUINS\nRebuild a new home and a new civilization with the wisdom of humanity – build your base of operations to your specifications and survive on your own or with your friends inside a massive 1-acre manor. The robust free building system allows more than 1,000 types and styles of furniture and structures, as well as ways to grow your settlement over time. Search for other outposts to form alliances and fight back against the infected together to keep your home safe.\nSQUAD UP TO SURVIVE\nSet yourself up for success as a member of the storied Raven Squad. The raven is traditionally a symbol of death and bad omens but can also stand for prophecy and insight. Your squad lives between these two meanings each day and night. In the new world, four years after the disaster, survivors have split into different factions, each with their own rules of survival. Face off against members of the Clowns, Eagles, Night Owls, and Reivers for territory, and get through some darkest nights for the next sunrise.\nARM YOURSELF FOR THE APOCALYPSE\nProtect your home, allies, and what's left of humanity against all odds with a wide variety of weapons and armor for you and your homebase. Beyond the standard weapons, players can also use other tactical gear including melee weapons, drones, decoy bombs, auto turrets and more to level the playing field. Choose from more than 50 types of vehicles for quick supply runs and to conquer new lands, while utilizing tailored-to-environment tactics to dominate the various infected zones found throughout the game.","imageUrl":"https://media.rawg.io/media/screenshots/ec6/ec680a95a4605451cfc568299fb92405.jpg","releaseYear":2023,"developer":"Level Infinite","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":865059,"name":"ASTLIBRA Revision","genre":"Action","price":0.0,"description":"Join our Discord Server\nTravel Through Unfamiliar WorldsExplore a vast, dangerous, yet beautiful world. Broken up through multiple chapters, join the protagonist and Karon, his talking bird companion, as they confront time and fate.\nBack to The Golden Age Of JRPGs, with Side-scrolling ActionSlashing, Smashing, thrusting countless enemies while building up stamina for powerful Possession Skills, which are enough to melt away anything that blocks your way, including huge bosses that could take half, or even more of the screen. Fight aggressively while thinking strategically, always pick up the most trust worthy equipment, and select the best suited skills to deal with ever changing circumstances.\nFight God-Like Boss BattlesBattle ferocious bosses throughout the story, each with their own set of attacks and challenges. Upgrading abilities and acquiring new skills are vital to finishing each battle and progressing through the protagonist’s story.\nMultiple Ways to Build Your CharacterA warrior mastered ranged combat with bows and throwing knives? A mage smashing enemies with staffs and cast magic at the same time? Play it in your way. Gathering experience to level up, collecting force to grow up, forging and mastering equipment to open up more tactical options.\nCombat and Story, Why Choose When You Can Enjoy Both14 years in development and more than 1 year for revision, award-winning indie developer KEIZO gave his all into this work. The plot keeps twisting as characters growing in an ever expanding world; Classic themes like time travel and tons of spoilers are all custom-made with the developer's own style. In ASTLIBRA, Story elements are often made into game mechanics, for example, your soul-mate Karon is not just a sidekick to talk with.\nFruitful Endgame with Even More ChallengesWith 6 difficulty options, all kinds of players can enjoy the combat system at their own pace, but no one can finish all those contents casually - even after you \"beat\" the game, the Postscript after Final Chapter will provide extra story, new adventure and fresh system, tapping the potential of skills, equipment, as well as your imagination.","imageUrl":"https://media.rawg.io/media/screenshots/008/008cd177826cb6b94b0a4fa1e70f88c8.jpg","releaseYear":2022,"developer":"KEIZO","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":842446,"name":"Selene ~Apoptosis~","genre":"Adventure","price":0.0,"description":"🌟Check this out!🌟https://store.steampowered.com/app/1555110/Chasing_Tails_A_Promise_in_the_Snow/?utm_source=widget_sa&utm_medium=steam\n🌟 More from FCD 🌟https://store.steampowered.com/app/1936310?utm_source=widget_sa&utm_medium=steam\nAbout the GameIt all begins as a beautiful stranger appears at a lonesome doorstep. This is a love story of a man who slept too little and a stray cat.\nSelene ~Apoptosis~ is a free mystic thriller visual novel filled with dark romance and even darker secrets. Fight for those you love. Fight for your life. Find the truth.\nAnd, most importantly, eat well.\nCONTENT WARNINGThis visual novel deals with mature themes and may not be appropriate for those who are easily disturbed. It contains scenes of violence, sexual references, strong language, horror elements and general mature content. Player discretion is advised.\nFEATURESYou can pet a cute catgirl.\nA mystic thriller/horror story inspired by Stephen King's works.\nThe main story is completely free.\nChoices-driven branching narrative.\nOver 5 endings.\n2 to 3 hrs of content (depends on your love for good artwork)\nSecret discovery journal.\nJapanese and English voiceover for female characters. You can also choose to switch that off.\nAdd to your Wishlist now not to miss the launch - and be the first one to play!","imageUrl":"https://media.rawg.io/media/screenshots/11f/11f2012d6f13b14ccdeb34ff2716a928.jpg","releaseYear":-1,"developer":"Nupu Neko Dev","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":780324,"name":"Fray Fight","genre":"Action","price":0.0,"description":"All roads end in Valhalla, but the legacy you build before reaching your doom is up to you. Pick your character and choose your build carefully while you survive waves of enemies and attempt to make it where no one has before.\nBattle swarms of thousands of enemies while strategically planning your build. Gather enough gold and choose your items carefully to unlock powerful synergies and make it through the next timed wave.\nFray Fight is still very early in development with tons of updates planned. The following only represents the minimum features at launch.Game Features 6 unique characters with more being added\n40+ Items\n3 epic bosses\n4 maps\n27 achievements\nMeta upgrades\nSupports keyboard, controller, mouse, and touch screen","imageUrl":"https://media.rawg.io/media/games/e5b/e5b4038be9c6e23da2a98d51caec8a9f.jpg","releaseYear":2022,"developer":"Playsaurus","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Web"}]},{"id":617120,"name":"The Outer Worlds 2","genre":"Action","price":0.0,"description":"New solar system, new crew, same Outer Worlds. The Outer Worlds 2 is coming...and when that day is closer we will show you more...but until then enjoy this.","imageUrl":"https://media.rawg.io/media/games/67d/67de45e83579bd921dffbaf3b4700c9d.jpg","releaseYear":-1,"developer":"Obsidian Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":484907,"name":"Iron Conflict","genre":"Action","price":0.0,"description":"COMMUNITY\nAbout the GameIn Iron Conflict, you assemble a squad composed of three types of historically-accurate war machines (units) to fight on randomized battlefields supporting up to 10 players on each side. Command a fearsome fighting force with unmatched firepower and put your strategic might to the test in this addictive online strategy and tactics game powered by Unreal Engine 4.Real Weapons Of WarIron Conflict features military vehicles ranging from the end of World War II up to present day. Crush the enemy with a Type 99A2 tank or soar across the unfriendly skies in the F-35 Lightning II!\nFight Epic Battles On the Ground and In the AirFrom tanks to planes, each vehicle has distinct controls and playstyle. Command from a “birds-eye” perspective or micromanage your units – the choice is yours!!\nImmersive Tactical GameplayChoose from three different unit types to form a squad. Play your way or complement your teammates’ tactics to secure victory.\nNo Battle Is the SameJoin 3v3 and 5v5 matches, or dive into 10v10 online matches where 60 total units fight on randomly generated, massive battlefields!\nUnited We Stand, Divided We FallTeamwork makes all the difference in Iron Conflict! Keep communication channels open, coordinate with your team at every step, or all will be lost ...","imageUrl":"https://media.rawg.io/media/games/05b/05bf16f09990694667d257770e99c0d3.jpg","releaseYear":2021,"developer":"Angela Game","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":325055,"name":"Zup! 9","genre":"Casual","price":0.0,"description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60 Levels\n▪ Achievements\n▪ New cubes\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre","imageUrl":"https://media.rawg.io/media/screenshots/448/448806bb1dd9a846b30606b30f47bac3.jpg","releaseYear":2019,"developer":"Quiet River","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":323187,"name":"Swords of Gurrah","genre":"Action","price":0.0,"description":"Fight in front of a blood thirsty crowd as a Sci-Fi Gladiator in Swords of Gurrah. Swords of Gurrah is a virtual reality game focused around hand-to-hand combat weapons. Fighters come from all over of their own free will to risk their lives against man or beast!!!! Fight to the death all to experience the thrill of victory - and if defeated to die for glory!\nGurrah is a single player and multiplayer online game. It takes skill beyond typical gaming to keep up: swing, slice, slash, dodge, duck, and destroy. VR does amazing things to bring life-like hand-to-hand combat into your home.\nThe Weapons:\nThese high-tech weapons were forged using nano chip technology. The weapons are designed with the illusion of light weight but actually have the momentum and weight of their ancestor's. Gurrah has a wide selection of weapons: one hand swords, shields, glaives, spears, axes, heavy-class swords, double-sided sabers, daggers, and throwing stars. Select and train, the choice is yours!\nThe Beasts:\nThe arena presents many threats to keep gladiators on their toes. Fully armored bulls, tigers, hydras and more are ready for battle. Bred and bio-engineered to fight with ferocity.  Each beast presents a new challenge, testing the ability of a warrior to adjust on the fly. The crowd must be entertained!","imageUrl":"https://media.rawg.io/media/screenshots/699/699970e7d6a5e111989e5bf432813383.jpg","releaseYear":-1,"developer":"Devster","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61203,"name":"Dead or School","genre":"Action","price":0.0,"description":"Zombies conquered the land of Tokyo.\nWithout hope, in underground shelters, people lived quietly.\nHisako, a girl who grew up underground, heard the word “school” from her grandmother.\nSchool is where children play and learn.  It is a paradise for young people.  The best place to spend their youth.\nHisako dreamed of  this “school”, and one day, she was on an underground train heading above ground.  What awaits her? Despair...\nDefeat enemies, grow your own character.\nCollect items, create your own most powerful weapons!\nHack and Slash X Girl's action\nGear obtain with money or gears, disassemble weapons, collect parts, customize your own weapons, and enhance your abilities.\nMix and match the parts.\nUnlimited possibilities to customize your equipment; Attack, Weight, Rare effects...\nGain many skills by advancing the player's level.\nDynamic actions become possible, when various weapon skills are combined.\nMake your own unique character!\nNotice the changes in the player, when a certain level of damage is received.\nPay attention to your status, caused by damaged clothes.\nIncreasing your collection raises your parameters.\nVarious souvenirs scattered around, people in need of assistance...\nTry to collect a variety of items within the game!\nShinjuku, Asakusa, Akihabara and Roppongi...\nSave Tokyo's towns that are filled with Zombies. “Here I come! On an underground train!”\nNow gigantic monsters rule the ground above.\nA monster with a body of steel, Asakusa's Sensoji temple is occupied by thunder gods...\nDon't let tough enemies attack you and get in your way!\nVarious action moves:\nGrab onto steel frames, get in and out of your enemies range, clear difficult stages, move on to the next level.\nMain character: Hisako\nGrew underground, in despair, while the surface world was controlled by zombies.\nGifted with superior athletic abilities and a strong determination, her mind is unaffected. She faces the reality of the ground above.\nHer dreams are: Make many friends, and play in school!\nThough, she does not like studying...","imageUrl":"https://media.rawg.io/media/screenshots/39b/39b8b0bc5d67fa4ccf07ae0de27ded80.jpg","releaseYear":2018,"developer":"Studio Nanafushi","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":58574,"name":"Hyrule Warriors: Definitive Edition","genre":"Action","price":0.0,"description":"Cut down enemy hordes as Legend of Zelda™ characters—in full 1080p TV mode—or in two-player on one system! Link and Zelda can battle in costumes from the Legend of Zelda: Breath of the Wild game, while Tetra and King Daphnes appear in scenes based on the Legend of Zelda™: The Wind Waker game. Find and care for fairies who will aid you in battle! All features and downloadable content from past versions of the game, including My Fairy mode and elements from The Legend of Zelda: The Wind Waker, can now be enjoyed in crisp HD on the Nintendo Switch™ system. This time, you won't face the dark sorceress, Cia, alone. Command legendary heroes and villains in battle to achieve objectives as you unleash special attacks. Advance the story to unlock characters, each with their own moves and weapon types. Collect rupees and other items to upgrade weapons and craft badges, which bolster your warriors' abilities. The fate of Hyrule rests in your hands!","imageUrl":"https://media.rawg.io/media/games/c93/c93309893552f4b118a58819e9a73050.jpg","releaseYear":2018,"developer":"Koei Tecmo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":58445,"name":"a Museum of Dubious Splendors","genre":"Adventure","price":0.0,"description":"The Museum of Dubious Splendors is half a storybook and half an exploration game.\nIt is a collection of folklore and oral tales, punctuated by peculiar rooms, that you wander through.\nThese tales, have been recreated from a collection of stories by Mir UmarHassan, a Gujarati poet whose works have proven notoriously difficult to translate because of the mellifluous use of Urdu and Hindi in his compositions.\nThe collection, entitled \"in Dubious Splendor\", was written (in Gujarati) in nineteen sixty two for the Malwa Chronicle,  but the stories therein were mangled and edited without the author's permission prior to their publication in serialized form.\nThis contested collection of stories, became momentarily infamous as the subject of the first court case to arbitrate authorial ownership in Independent India.\nEven today, despite countless restorative efforts by scholars, it cannot be said with with any certainty that the text that we used for this adaptation was the original as written by UmarHassan.","imageUrl":"https://media.rawg.io/media/games/b3b/b3b2585a6b378b51cad4f2eec139d62b.jpg","releaseYear":2017,"developer":"Studio Oleomingus","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":56389,"name":"Circus Charlie","genre":"Action","price":0.0,"description":"Circus Charlie (サーカスチャーリー, Sākasu Chārī) is an arcade platform game originally published by Konami in 1984 in which the player controls a clown named Charlie. It was released for MSX in the same year, followed by ports to the Nintendo Famicom in 1986 by Soft Pro and the Commodore 64 in 1987. It was released along with other Konami classic games on the Nintendo DS compilation Konami Classics Series: Arcade Hits.","imageUrl":"https://media.rawg.io/media/screenshots/1e9/1e99695d085a792f09755c951f9f7770.jpg","releaseYear":1984,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Wii U"}]},{"id":51800,"name":"Little Adventurer III","genre":"Casual","price":0.0,"description":"Small plot: save the little girl, I bid farewell to him. I returned home, there are several rogue on the road. I am hesitating if I should help him. Help or not determine the different lines of the story. The outcome is the same. After encountering a decryption project. Cracked it. Met grandfather. Back to their home. Playing a variety of small games.\nfeature:\n✨ There are many mini games. Such as jumping obstacles. Puzzle (1.2.3.4.5) (1.2.3.4.5)\n✨ Short story. I wrote a short story.\n✨ backpack. Story line. Personality attributes. as follows:\nB backpack can view the current possession of items.\nI attribute the current person's specific attributes.\nq The story of the current story lines specific records.","imageUrl":"https://media.rawg.io/media/screenshots/861/86171585fdc0965d5eaea796bfb756f8.jpg","releaseYear":2018,"developer":"HuBiao","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50753,"name":"Bud Spencer & Terence Hill - Slaps And Beans","genre":"Action","price":0.0,"description":"The first OFFICIAL Video Game of Bud Spencer and Terence Hill!\nBud Spencer and Terence Hill in their first virtual adventure. A brand new story! Whether in the Western Saloon, Miami Downtown, at the fairground etc... you'll get the full load of funny conversation, slaps and of course lots of mass brawls.\nSlaps And Beans is a co-operative or single player scrolling beat’ em up game with the addition of platform elements and mini-games in which you'll interpret the characters of Bud Spencer and Terence Hill.\nThe key ingredients of Slaps and Beans are:\nRetro pixel art graphics\nBud Spencer & Terence Hill style fighting system\nCo-op multiplayer\nMini-games\nA red with yellow tarp Dune Buggy\nA lot of slaps and a lot of beans (obviously)","imageUrl":"https://media.rawg.io/media/screenshots/6a4/6a47d12f2bf90839394bf466142c1e89.jpg","releaseYear":2017,"developer":"Trinity Team","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":50309,"name":"Slasher's Keep","genre":"Action","price":0.0,"description":"It's a first-person roguelite with a focus on melee combat and loot. Now for some vague copy followed by a list of features:\nYou have been imprisoned and left to rot in the depths of Slasher's Keep, a frightful construct towering above the forgotten forest in the remotest wilds of Ool. As rulers came and went the keep remained the final destination for the nation's most undesirable elements. Many a scoundrel has tried and failed to escape its dungeons, perilous as they are. Will you share their fate, or will you overcome the challenges ahead involving the features below?\nrandomly generated levels\nvarious traps to trigger and secrets to find\nrandomly generated items granting you stats and abilities\ndynamic melee combat with different swings and thrusts, as well as precise parrying\nsmacking of enemies into spikes and chasms using your inventory sack\nvarious types of enemies with different abilities\nvarious types of magic wands for a bit of ranged combat\ntwo playable characters to choose from with more to unlock\na drag-and-drop based crafting system\ncartoon graphics made up of cel-shaded models, hand-drawn sprites and even some procedural animation","imageUrl":"https://media.rawg.io/media/screenshots/991/991c9ee3d6bd41f91ca99ec03242b129.jpg","releaseYear":-1,"developer":"Damian Schloter","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":47273,"name":"PAPERVILLE PANIC!","genre":"Action","price":0.0,"description":"Welcome to Paperville, Rookie! As the fire departments newest recruit, you're in for a sweet ride at your new employment. Cheque cashing, boot sorting, lunch stealing - after all, in a town made of arts and crafts, how often would there ever be a fire?\nPaperville is proof that anyone has what it takes to be a hero, as long as safety and saving lives aren’t priorities. A tongue-in-cheek look into the world of firefighting, in a town filled with strange critters, odd personalities and secrets to discover.\nGuided by a less-than-stellar fire department, you must help restore Paperville to it’s former papery glory. From clearing building fires, rescuing citizens from rubble, hacking through doors, to dealing with townsfolk and their personal issues, Rookie does it all.\nOnly you can be the one to save Paperville.\nWell, someone else probably could, but you’re all they’ve got.\nExplore the living, breathing town, from beach to balcony to bedroom, and get to know the people of Paperville.Save the townspeople from imminent danger - and from themselves.Atmospheric music helps set the scene as you traverse smokey spaces filled with fire.Use a number of different weapons to tackle the problems in front of you.Shoot, smash, pull, deduce, and lift your way through missions to find the solution and be the hero Paperville never deserved.","imageUrl":"https://media.rawg.io/media/screenshots/f3f/f3fecd4f51b31c1f488bf3b0bc59307c.jpg","releaseYear":-1,"developer":"Ultimerse","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46457,"name":"Sky Jump","genre":"Action","price":0.0,"description":"The main character, Jamho, glimpses the tremendous sight\nin the sky in his dream.\nHe is fascinated by the unknown curiosity of the sight\nand makes plans.\nI saved money to buy a light aircraft, and the area\nwhere I often see square cubes.\nExploring. Then, find a map hidden in the sky\nand do something beyond it.\nTo find it, he starts to climb shouting \"Jump\" and \"Jump Jump.\"\nWhat did you see to make this powerful jump?\nLet's be a player and follow the journey.\n[Jump your body using a left controller trigger.\nJump one step at a time and arrive at your destination.]","imageUrl":"https://media.rawg.io/media/screenshots/31e/31e49673806d6fc85ed5f71803689ba2.jpg","releaseYear":-1,"developer":"Easy game","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45301,"name":"1bitHeart","genre":"Adventure","price":0.0,"description":"Welcome to 1bitHeart―the latest title from Alicemare and LiEat developer △○□× (Miwashiba). In this unique and endearing adventure game, take on the role of Nanashi, a lonely, agoraphobic boy, as you solve a slew of mysteries around town while also making friends.\nThis is the story of a world in which pretty much everything is controlled and watched over by computer programs.\nOne day, Nanashi―a young boy who has been cooped up in his room―meets a mysterious girl.\n“Let’s make some friends.”\n“OK!”\nNanashi accepts the young girl’s sudden invitation without giving it much thought.\nAt that very moment, some very strange things begin to occur in town...\nDetective Part (Story Mode)\nGather information and topics by exploring the town and speaking with people to progress through the story.\nConversation Part (Story Mode)\nUse the topics and info you’ve gathered to piece together conversations while progressing through the story. (The game ends when your HP reaches 0.)\nFree Mode (After clearing Story Mode)\nTalk and mingle with the residents of the town, make friends, and play mini games in Free Mode.\n*This title was originally a free game, but the Steam version includes specially added events, etc.\nThis was the 3rd game I made, where I first experimented with a side-scrolling system, voice over and detective elements.\nI probably spent the most time working on these 3 things, including revisions.\nWhen designing the town, I had foreign cartoons in mind and was aiming more towards a foreign audience than a Japanese one.\nHowever, the game is set in Japan of the near future and the character design is aimed more towards the Japanese aesthetic.\nI took advantage of the fact the game is set in Japan to make some cultural references here and there.\n\"An adventure game where you make friends\". Not a typical tag-line, but if there is any aspect that takes your fancy I hope you will play my game!","imageUrl":"https://media.rawg.io/media/screenshots/b17/b172ad39b713c3e300e41d0c5294b062.jpg","releaseYear":2017,"developer":"△○□×","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40395,"name":"The Sims Medieval","genre":"Strategy","price":0.0,"description":"Do you ever wish you lived in that glorious time when men were knights, women were princesses, and cities were kingdoms ruled by kings in large castles? Or would you rather be a pirate out hunting for rare treasure with a hook for a hand and a parrot on your shoulder?","imageUrl":"https://media.rawg.io/media/games/9a3/9a393c1d075d4a475fa8e6e41fe8c096.jpg","releaseYear":2011,"developer":"The Sims Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40323,"name":"El Shaddai: Ascension of the Metatron","genre":"Action","price":0.0,"description":"The Games on Demand version supports  English, French, Italian, German, Spanish, Japanese.  Humanity’s future rests in your capable hands in El Shaddai ASCENSION OF THE METATRON, an innovative new action-adventure epic that casts the player in the role of a brave warrior named Enoch. He has been tasked by Heaven to recapture the fallen angels that are wreaking havoc on human civilization, and must ascend a maddening, otherworldly tower and defeat unimaginable horrors along the way. Combining breathtaking visual artistry, a variety of exciting and unique gameplay styles, and a timeless story line inspired by ancient Biblical apocrypha, El Shaddai delivers an experience truly unlike anything that came before it.","imageUrl":"https://media.rawg.io/media/games/68c/68c7edce51fade580867d15b614c9fac.jpg","releaseYear":2011,"developer":"Ignition Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":35284,"name":"Tom Clancy's Rainbow Six 3: Athena Sword","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/4dd/4dd1c31dcfc6827f776b60e9b7de3d24.jpg","releaseYear":2004,"developer":"Ubisoft Milan","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31894,"name":"The Thing","genre":"Action","price":0.0,"description":"While investigating the enigmatic deaths of American scientists in the Antarctic, a military rescue team encounters a strange shape-shifting alien life-form that assumes the appearance of the people it kills. As the team leader, you must forget everything you ever learned about obliterating aliens simply with a barrage of violent ammunition--this monster is difficult to see, hard to kill, and seemingly impossible to evade. In the midst of this lurking terror, you must convince your squad to cooperate and complete tasks essential to both the success of the mission and your own survival.","imageUrl":"https://media.rawg.io/media/games/5b9/5b910de05c60070908d0f4ba7bc30155.jpg","releaseYear":2002,"developer":"Computer Artworks","libraryGames":null,"platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":28715,"name":"NHL 09","genre":"Sports","price":0.0,"description":"EA SPORTS™ welcomes you to NHL®09, the series that is coming off of 7 “Sports Game of the Year” awards. NHL 09  continues to lead sports gaming innovation with enhanced controls, added depth and accessibility.  A new Be A Pro mode allows gamers to step on the ice as themselves and progress from the AHL to the NHL in a quest to become the next great NHL superstar. NHL09 will also be the first true console sports massively multiplayer online game,  allowing you to assemble a team online featuring your created player and five friends in the new EA SPORTS Hockey League.  The game also features an all new defensive skill stick that allows for stick sweeps, better poke checks and the ability to lift an opponent’s stick to prevent a shot.  If you love sports games, you will love NHL 09.","imageUrl":"https://media.rawg.io/media/games/911/911a39429166076b4e407c09e5e00b97.jpg","releaseYear":2008,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22897,"name":"The Settlers 2: 10th Anniversary","genre":"Strategy","price":0.0,"description":"After fighting a losing battle with drought and the mysterious disappearance of their women, a brave people set out to sea. The survivors need your help as they are challenged to the ultimate test: survival. Food and building materials must be developed, for the productivity of future shipbuilders, foresters, brewers, and scouts depends on it. Construct gold, coal, iron, and granite mines. Cultivate the land, build farms, establish fisheries and hunting grounds, build up your stocks of animals and manage forests; the well-being of your subjects rests in your hands. Most important is to get your women back!\nBristling with top-notch 3D graphics, The Settlers® II: 10th Anniversary brings you back into the world of the Settlers. Build up your economic power base and tame the land. Prepare to defend your hard-won kingdom - for you are not alone! Watch out for the, hot-blooded Nubians and the technologically advanced Asian kingdoms. Send out your scouts, position your soldiers on the borders of your kingdom, build look out posts, and give the order for more catapults. Let the battle commence!\nMultiplayer notice: The game's multiplayer servers have been taken offline, however, multiplayer over LAN is still available.\nRevisit the world of The Settlers® II, now with enhanced 3D graphics and new gameplay additions.\nPlay as any one of the three available nations: Romans, Nubians, and Asians.\nOrder your subjects to fell trees, mine granite, and build houses - watch as the game evolves!","imageUrl":"https://media.rawg.io/media/screenshots/41d/41d27eb667b3cf6b7b600c27540e982c.jpg","releaseYear":2006,"developer":"Blue Byte","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22639,"name":"Anno 1701 A.D.","genre":"Strategy","price":0.0,"description":"ANNO 1701 A.D. includes Anno 1701 and its expansion Anno 1701: The Sunken Dragon.\nANNO 1701 is the most elaborate and expensive game production in the German speaking region and the sequel to the most successful, multi-million selling game series of all times. The third part of the unique combination of different genres creates a real-time building game and is also set in 16th and\n17th century, the era of discoveries and maritime trade.\nFor the first time, players of all experience levels were included in the development and could help significantly to make the unique gaming experience now even more accessible. The player is engaged in creating, expanding and maintaining a flourishing metropolis, while communicating with other players or interacting with other parties via trade or diplomacy.\nBecome a rich merchant, virtuoso builder or experienced strategist – the open structure of ANNO will reward any individual approach! The fascinating vibrancy of the self-built world, the ever present interaction with the player and an enthralling atmosphere offering excitement and fun will grip everyone who ever played ANNO 1701 A.D. forever.Unique combination of city-building strategy, trade, discovery, diplomacy and battle.\nMaximum interaction with the game environment through numerous event details, such as cheering or protesting of the people, lovingly animated and composed characters, and through trade and diplomacy with foreign people.\nExtremely detailed and vivid graphics with innovative effects and breathtaking realism in flora and fauna, in the city or in occurring natural disasters, such as tornados, volcanic eruptions or earthquakes.\nPerfect introduction, even for the less experienced player, for example with the unique ‘Info mode’ and a simplified, clearly structured user interface.\nExcitement without fail in over 100 different voluntary special tasks (Sub-Quests), which are dynamically integrated into the game and provide useful rewards.\nSecret diplomacy with special tasks such as sabotage, espionage or demagogy allow for an intelligent, strategic approach.\nMulti-player mode for up to 4 players via LAN and the option of cooperative play.\nMilitary element with troop formation and feedback in spectacular land and sea battles.","imageUrl":"https://media.rawg.io/media/games/0d1/0d1a3155ea5e5bb46930ac64d04266fd.jpg","releaseYear":2006,"developer":"Related Designs","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20954,"name":"Crab Cakes Rescue","genre":"Casual","price":0.0,"description":"Crab Cakes Rescue is a unique puzzle game that will pinch your brain! Navigate your way through nearly 100 vibrant levels by shedding your shell to create new opportunities to escape! Each time a shell is shed, a block is created and your crabby crustacean self is shrunk. You must use these tricks wisely as you have a finite number of shells! And beware of pesky seagulls and other bothersome beach buddies as you find the best way to get up, down, and around each mind-boggling level. Prepare to spend hours on the sandy shore of Crab Cakes Rescue!Features:Nearly 100 mind-pinching levels!\nMultiple ways to finish each level - you decide!\nAvoid pesky birds and pollution\nUse your shell “lives” to create new opportunities to win!","imageUrl":"https://media.rawg.io/media/screenshots/d52/d52f463d279d8edf5b0f3af5c5dd646f.jpg","releaseYear":2014,"developer":"Mission Critical Studios","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20628,"name":"Crazy Machines: Golden Gears","genre":"Strategy","price":0.0,"description":"In this \"Rube-Goldberg\" style puzzle game, experiment and build your wacky contraptions with physics action like never before! Experience dazzling visuals of explosives, fire, and true to life physics behavior when you put the experiment into motion!\nIncluding the Level Editor and Community for Crazy Machines Golden Gears!\nAre you a creator or do you just want to puzzle?\nThe level editor allows players to take control and put their minds to work!  Build and create puzzles! Make videos, take screenshots and create crazy art to share with the community! Anyone can download your creations, play & rate them!  Enjoy spectacular visuals, sharp shaders, textures, and backgrounds as the action unfolds!\nChoose from more than 60 parts/items to build your creation\nUse the same tools Viva’s level designers use to create Challenge levels\nFull Tutorial allows you to master the versatility of Crazy Machines' Level Editor\nBuild “real” puzzles or “self-solving” chain reactions\nCross Platform play allows you to share puzzles across various platforms.\nEarn Golden Gears for building and uploading puzzles, which can be used to unlock more Challenge Levels\nSort and choose community puzzles by date, rating, popularity or alphabetical\nEndless amount of content from a growing community\nHow do you get the Professor's Wind-Up Mouse to the other side of the room? Open the inventory, choose your parts and put your thinking cap on!  With over 60 different Parts in your inventory, each puzzle can be solved in your own unique way. Lasers, Nitros, Dynamite, and Explosives can be used to cause constructive damage. Tie objects with Balloons or Weights for a rise or fall. Activate the Mouse or Truck to push and pull your objects to their destination. The possibilities are endless!\nNote: The power cord is part of the item. For electric powered devices, tap on the power cord and then tap on the power outlet to connect the item to a power source.FEATURESUp to 42 challenges.\nUse your creativity to master levels and earn 3 stars.\nCool Physics engine with fire, wind, gravity and particle effects.\nBuild and solve experiments with over 60 different Parts.\nCreate and share your own puzzles with the brand new Level Editor  Choose from more than 60 parts/items to build your creation","imageUrl":"https://media.rawg.io/media/screenshots/805/805bad9dda0c6e060d3ea9c666d440ba.jpg","releaseYear":2014,"developer":"Fakt Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19024,"name":"Putt-Putt Joins the Parade","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameWhat does it take to be in a parade?\nHard work, a bright shiny chassis and a little help from your friends. That's what Putt-Putt® discovers as he gears up to join the annual Cartown Pet Parade. Children will be delighted as they meet the local carfolk, explore a toy shop, tool down the road and more. Along the way, they learn to think ahead, deal with unexpected problems, and give others a hand. The road to discovery has never been more fun - or more educational. Charming talking characters, lively sound effects and lifelike animation keep your child focused on the adventure.\nPutt-Putt® Joins the Parade is fully-loaded with originality and activity. Even adults find it hard to resist getting in on the fun. What's more, Putt-Putt® offers lots of exciting new options every time kids play. The result is an entertaining learning experience that never gets old.\nSurprise Click Points. There's no telling what will pop up when you click on a garage door, a magnet or even a flower. Talking fire engines and dancing mice are just some of Putt-Putt's® many roadside attractions. With so much to see, kids won't want to miss a thing.\nNeed Help? Just See Smokey. Smokey's always there to give Putt-Putt® a hand. Help screens have never been friendlier.\nClean Up's a Breeze. Kids help Putt-Putt® get cleaned up for the parade with a simple click of the mouse. Taking a shower is more fun than ever.\nMoo-ve Over. Children's problem-solving skills are developed as they learn how to deal with cow roadblocks and other unexpected problems.\nPutt-Putt® Opens Up a Helpful New World. Kids learn how to earn money and remember an address. They even learn the value of doing a good deed.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/32e/32e6e28e768c7809c56918e4effd46a1.jpg","releaseYear":1992,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":17201,"name":"Blob From Space","genre":"Casual","price":0.0,"description":"With this game we try to challenge the player to finish the entire game with only 3 continues.\nThere are no save points so you have to make the entire run in one go.\nIf you have friends (Or the internet) you can share cheat codes to skip some levels, but don't forget you will not get the maximum amount of points and maybe not able to unlock certain achievements using cheat codes. The choice is yours.\nWith this game we're trying to get back to the old retro gaming age. Of course back in the time we didn't had Steam and it's awesome features, so it's not completely back to the retro gaming age.\nWe try to make the game challenging as possible. Easy to learn to play, but you will need some skill to complete the game, because the further you get in the game, the harder the challenges will be. At some point you will have less vision, or maybe you're Blob will be upside-down.\nPaying homage to games from the earliest days of video gaming, Blob From Out of Space is easy to play, but difficult to complete 2D side scroller.\nBlob is flying through space when his UFO gets shot down by a rocket and crash lands on an unknown planet. Blobs brother is promptly captured by the planets evil leader and it's up to Blob to save him and to escape from the planet.\nHow the game plays is up to you. Each decision opens up a new path. Collecting diamonds opens up more choices, but with them comes addition risk. With only 3 continues available and no save, risk is a bad thing! Discovered a cheat? Share it with your friends, but use a cheat and you won’t get the maximum number of points. The choice is yours.\nThis game has:\nController support\nLocal Co-op\nTrading cards\nAchievements\nSpecial Blob powers\nTransform into enemies\nStick powers - slow down enemies\nWall jumping - jump against walls and jump again to reach places you were never able to reach without wall jumping\nTo make the game more challenging during the story we will be adding new gameplay features every update.\nGameplay features:\nOver 100 levels including Dark levels (play with only a small amount of the screen visible); Vehicles levels (drive/fly a vehicle and avoid explosions and bombs); Underwater levels (no jumping, but watch out for water creatures)\nGreat learning curve\nMini games - Diamond Rush and Retro Blob (Puzzle game)\nChallenge your friends in YOLO Mode\nPlay with friends in local co-op mode\nRelaxing game modes:\nDiamond Rush\nRetro Blob (Puzzle game)\nBased on community feedback, we will be delivering regular updates including upside-down levels.","imageUrl":"https://media.rawg.io/media/screenshots/0e5/0e5d1a5a0f8a5805bed55072340c316f.jpg","releaseYear":2014,"developer":"JosPlays","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16535,"name":"AGON - The Mysterious Codex (Trilogy)","genre":"Adventure","price":0.0,"description":"AGON - The Mysterious Codex is a trilogy featuring the first three episodes of the AGON series: The London Scene, Adventures in Lapland and Pirates of Madagascar. The story begins in 1903. Professor Samuel Hunt, a historian of the British Museum receives an anonymous message and a page torn from an old codex. Mysterious forces challenge him to explore hidden places of the world and find the last masters of long-forgotten ancient games.Professor Hunt searches the darkest corners of the Museum for clues and embarks on his journey tothe snowfields of Lapland and the jungles of Madagascar in search of cursed relics known as the“AGON”.Key FeaturesIntriguing plot from an award-winning story-teller\nStory-driven puzzles\nExploration and travel to exotic places\nEngaging characters and excellent voice acting\nRich atmospheric sound, authentic music\nHistorically correct, gorgeous graphics\nRe-playable ancient board games\nSuitable for all from 10 to 80++\nRuns on older technology","imageUrl":"https://media.rawg.io/media/screenshots/caa/caae988c41bf22d3a8d8d23cfd1ce445.jpg","releaseYear":2006,"developer":"Private Moon Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14828,"name":"Welcome to the Game","genre":"Simulation","price":0.0,"description":"Welcome to the Game is a creepy horror / puzzle game that takes you into the world of the Deep Web. Explore the Deep Web with the sole purpose of trying to find a Red Room, an online service / website that allows you to see and participate in interactive torture and murder.\nWelcome to the Game puts you behind a computer screen to explore the deep web. You are challenged to find 8 hidden keys throughout the deep web to build the Red Rooms URL. During this process, you are challenged with hidden puzzles on the Deep Web, have to solve mini puzzle games to prevent from getting hacked and there may or may not be kidnappers trying to kidnap you. Experience the true horror and eeriness of what is really out there on the deep web without actually going on the deep web.","imageUrl":"https://media.rawg.io/media/screenshots/f10/f10d1f66d16b790970b06468f5cb7535.jpg","releaseYear":2016,"developer":"Reflect Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14597,"name":"Kalonline","genre":"Action","price":0.0,"description":"Kalonline is the Oriental Fantasy MMORPG for the most hardcore players. Have you ever heard about Oriental Fantasy? It’s not China fantasy. Kalonline is Korea fantasy in the oriental. In Kalonline, the players can explore the abundant oriental fantasy world. Also, the players can experience the special by Kalonline’s transformations and job tree. Kalonline is a free-to-play Massively Multiplayer RPG for PC. Kalonline was optimized for the low PC system or laptop. Kalonline invites the players to Oriental Fantasy World.\nSUMMARY\nKalonline scenario is based on the 74th war between ‘Chiu’(Ha-Nin), the king and ‘Hun-Won’(Ban-Go), the king for a zone and throne. Chiu is called ‘Doggaebi’ with 73th war 73 win. ‘At the end of the North’ he met the king of the demons who has lost his body at the Canyon of the Dead Man and he made a contract with the demon king for the throne. After the contract, Hun-Won is reborn as the demon king and he attacks Chiu with the troops of the demon. And now, the grand scale war between Chiu and Hun-Won is started for the throne.\nGAME FEATURES\n1000 vs 1000 castle siege\nVarious Characters and 32 job tree\nTotal of 32021ea equipment and Items\nIndividual transformation (Ancient animal power and visual system)\nPet system(Oriental fantasy animals)\nAlchemy, Talisman of expert, Mining, Processing and Making\nOriental graphical background and traditional building\nAbundant contents; PVP, guild vs guild, occupational battle, PK, mini game and etc.\nFatality skill system","imageUrl":"https://media.rawg.io/media/screenshots/b07/b0799a44ba37e18cca16f036d80d7fd7.jpg","releaseYear":2016,"developer":"Inixsoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13964,"name":"Summer Sale","genre":"Simulation","price":0.0,"description":"Experience Winter Sale without losing money. Buy games that you like or those that you don’t.\nBe the cool guy that owns every game in store. Customize your game as you like. Change colors and widget locations. Don’t like default game color. Then CHANGE it without any microtransactions.\nNon-stop WINTER SALE even in summer, autumn and spring.","imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbfcb009c0517c4f9f99b623fe174b1c.jpg","releaseYear":2016,"developer":"Ductape studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13817,"name":"Horizon","genre":"Action","price":0.0,"description":"Horizon is a turn-based space strategy game of galactic exploration and conquest in which you are in control of humanity’s destiny.\nYou will explore deep space, find new frontiers and discover alien artifacts hidden on long-abandoned planets. You will also learn more about the galaxy as you come into contact with ten other species, each with their own unique culture, history and schemes.\nA fully interactive galaxy allows you to navigate open space between stars and planets. Patrol your borders and, when the need arises, defend your territory by engaging in ship-to-ship tactical combat. Develop new colonies and then watch them become galactic centers for trade, industry and science - and of course military bases, outposts and shipyards to build your battle ships. Push your empire to its limits and go beyond the known horizon!\n_Key Features\nAdvanced turn-based tactical combat which many 4X fans have been requesting for years\nFull Tactical ship control includes managing movement, weapons and more.  Board other ships, attack from planetary and orbital defenses\nA Distinct open world system, where ships can explore without artificial limits and where combat can span many turns before concluding\nInteract with alien races of different levels, including ancient civilizations featuring their own unique storyline, schemes, ships and technology\nAn immersive galaxy storyline with open-ended missions that add another layer of gameplay over classic 4x mode which is also available\nEngage in meaningful diplomacy choices that will impact the game outcome, includes coordinated actions with your allies against your enemies\nDiscover more than 80 technologies each with 10 levels of upgrades. Conduct planetary surveys and dig for artifacts\nDesign and customize your ships’ weapons and systems based on available technology\nA detailed economy and colony management system with different types and levels of colonies based on your build choices\nPlay in different galaxy configurations from a few dozen stars to over a hundred star systems containing more than a thousand planets\nFully Customize your race or play as one of eight original races (NEW: Includes a mod that unlocks 3 additional ancient races now playable)\nExtended Modding support with the ability to create your own races and even write your own scripted quests","imageUrl":"https://media.rawg.io/media/screenshots/c2f/c2f2e5e44665c9fe29f9105334fcc5d3.jpg","releaseYear":2013,"developer":"Ketchapp","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":13164,"name":"Putt-Putt Travels Through Time","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameWham BOOM BLAM boing!\nMr. Firebird's time machine has gone haywire and Putt-Putt's® best pal Pep, is lost somewhere in time. Grab your compass! Putt-Putt® needs your child's help to find him. Together, they'll leap through time, explore new dimensions and discover surprising new friends. Meet Ms. Brachiosaurus - she holds the key to unlocking the secrets of the dinosaurs. See what pans out when you visit Silverado Sam, the prospector from the Old West. Be sure to check out Darien the librarian from the Future - he just may have the book you need. These are just a few of the delightful friends who will help your child reunite our pals. It's an adventure-of-the-centuries that will keep kids coming back time and time again!\nLike the real world, Putt-Putt's® world changes every time you play.\nSpecial games and activities test memory, challenge math skills and encourage creativity!\nClick Points reveal hundreds and hundreds of hidden surprises.\nOut of time? You can save the game and finish it later.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/0fc/0fc60d9254def4261b65f239143af19e.jpg","releaseYear":1997,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":13131,"name":"Blood Feed","genre":"Action","price":0.0,"description":"Insectville was a warm and charming mid-west community, one of those that leave doors open at night and everybody know everybody little society. You used to describe it as \"so sweet that made you vomit, drink bleach and literally gave you cancer\".\nAfter 4 combat tours (Radio Operator, -1 confirmed kills) going back home wasn't easy - you knew the dooms day was coming, it was just a matter when.\nAs cheerful as you were, despite all your flaws, community welcomed you back with open hands, you started your life once again, settled down, wife, kids and barbeques.\nHaving joyful life didn't shatter your insticts a bit, you kept stacking a stash of ammo & guns in the basement.\nSunday evenings with your former marine buddies, throwing cans on your neighbour's lawn, calling him piece of trash, pulling him out of house, giving him a free waterboarding eperience - You all had sincere laugh - this just couldn't last forever.\nAnd finally, it came. When you suddenly woke up in the middle of day, you realized you are alone, literally the whole town was empty.\nAs an experienced soldier you spotted enourmous beetle looking at you with what you could swear was \"the smile on his face\".\nYou rushed back to your house directly to the basement, you have been preparing for this your whole life.\nThe time has come.\nBlood Feed - The Mystery of Insectville is FPS depthless and mindless shooter, where you, smashing through the waves of bugs, insects and hordes of most disgusting things that ever roamed the earth, need to unravel the mysterious dissapearance of the whole town, including your family.\nMultiple enemy types including various bosses will make you puke at first sight and shoot and run for your life.","imageUrl":"https://media.rawg.io/media/screenshots/43c/43c3aabd118fd8e8a772975c81bcc747.jpg","releaseYear":2017,"developer":"Racing Bros","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12968,"name":"GRANADO ESPADA","genre":"Action","price":0.0,"description":"Granado Espada is about discovering new continents during Europe’s Age of Exploration era between the 1500s and 1700's. The Multi character control (MCC) is the most unique feature of the game, allowing players to control a party of up to three characters at a time. The approach to this style of game play makes Granado Espada feel like a hybrid MMORPG and RTS.\nGranada Espada's automatic hunting system called ‘Keep Mode’ is a function in the game that players seem to respond to positively. Players can grow their characters and family without the \"grind\" most MMO's are notorious for.\nThere are over 100 characters to add to your party of three to control in each battle. This is where the strategy mechanic comes into play, as each battle, monster or dungeon requires a particular mix of characters to successfully defeat each challenge.","imageUrl":"https://media.rawg.io/media/screenshots/f58/f5861e72760aec916813aac894d1020f.jpg","releaseYear":2017,"developer":"HanbitSoft","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12589,"name":"SpellKnights","genre":"Action","price":0.0,"description":"SpellKnights is a Third-Person Multiplayer Fantasy Shooter developed with Unreal Engine 4,  in which four knights fight with a magical mana (four elements of the nature: Water, Fire, Earth and Wind) to achieve the honour of the Arena.\nWith eight Interactive Arenas as stages (The Temple, the Cove, the Jail, the Ruins, the Forge, the Sanctuary, the Tower and the Sky), the player will personalize his knight with special skins and own weapons. The battle occurs in a competitive Show/Sports League with Tv cameras which will transmit the matches in a strategic fight in which each player must manage the best way of the assigned mana (2vs2 y 1vs1vs1vs1).\nThe competitive arenas allow the knights to win in quick matches of two-five minutes. On Early-Access there will be two Game Modes:\nLast man standingTeam Vs Team\nThe key to win is to manage the magic mana at the same time not to be defeated.","imageUrl":"https://media.rawg.io/media/screenshots/c07/c078c52cfb2937d749167ae912c65a69.jpg","releaseYear":2016,"developer":"Mechanical Boss","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12509,"name":"Infinitum","genre":"Action","price":0.0,"description":"In this game you have to find seven artifacts, which, according to legend, the need to create a cure for the virus, which is rampant in many star systems.\nTo do this, you have to fly a dozen star systems, dozens of planets to visit with different climates, search the abandoned stations and lunar bases. Somewhere you will be trapped hostile-minded creatures, and somewhere in the environment itself is opposed to you.\nYou need to be constantly maintained at a level of oxygen reserves and life support systems, both on the ship and the main character.\nIn search of artifacts you will be find black boxes left by previous searchers, whose efforts have been unsuccessful.\nAnd also do not forget about the search for dark energy and matter are brought together, you can create antimatter, with which you can make jumps between star systems.\nAnd, of course, you can just take a leisurely stroll, flying around a pulsar or black hole, walking on new worlds.\nFeatures:\nAt some locations you can hear the real sounds of celestial bodies (electromagnetic waves transferred to the audible range), such as a pulsar, black hole sun, the magnetosphere of Saturn and others.","imageUrl":"https://media.rawg.io/media/screenshots/a78/a78943f45d6d4e502b61571ff2d854fb.jpg","releaseYear":2017,"developer":"VGstudio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":3693,"name":"R-Type Dimensions","genre":"Shooter","price":0.0,"description":"The coin-op classics, R-Type & R-Type II, are together on the PlayStation®Network! Fight through all 14 Bydo-infested stages in retro 2D graphics or shiny 3D graphics - and swap back and forth with the touch of a button 'on-the-fly'. The new 3D graphics are accompanied by fully re-imagined arrangements of the timeless R-Type music tracks! The classic game-play remains untouched while the new Infinite game mode allows continuous progression from game start to final boss... the Bydo will not evade you this time! Both game modes can be played as single player or local multiplayer. Pull yourself together, save the earth and strike down the Evil Bydo Empire!!\n1-2 players\n131KB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\nTozai Games is a trademark of Tozai, Inc. registered or protected in the US and other countries. R-Type and R-Type II are trademarks of Irem Software Engineering, Inc. registered or protected in the US and other countries. R-Type Dimensions is protected under US and international copyright laws ©1987-2014 Tozai, Inc. and/or Irem Software Engineering, Inc. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/c27/c27c673eea5e2cfdf73a4589ec70e448.jpg","releaseYear":2010,"developer":"Tozai","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]}]