[{"id":12929,"name":"The Talos Principle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/948/948fe7f00b6cba8472f5ecd07a455077.jpg","description":"The Talos Principle is a puzzle game set in Ancient Greece full of technological devices. You take on the role of Talos, artificial man, the protector of Crete in Greek mythology. You are led by Elohim, your mentor, who allows you to explore the world and open portals to other locations, such as Ancient Egypt or Medieval Europe. The only place Elohim forbids you to go to is the Tower. Of course, the goal of the game is to enter it and reveal its secrets.\nYour way to the Tower lays among turrets you must avoid solving various environmental puzzles. The further you go, the more complicated these puzzles become, turning into long series of actions. You get new abilities and can interact with a larger amount of items, and the game remains challenging during the entire playthrough. \nBased on Greek mythology, The Talos Principle rises such philosophical problems as the humanity of artificial intelligence, androids’ desire to live forever and the confrontation between God and his creatures. These ideas are described in multiple notes, diaries and terminals.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":3052,"name":"STAR WARS Battlefront","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bd2/bd2cc7714e0b9b1adad1ba1b2400d436.jpg","description":"The game takes place in the setting of the epic \"Star Wars\". This game is the third in a series of games with the common name of Star Wars Battlefront.\n\nThe gameplay consists of battles. You can play on the side of the rebels or on the side of the Empire. You can also go through missions based on the stories of movies. You can play alone and in multiplayer modes, supporting up to 40 players. Multiplayer modes work in a network game or behind a single screen. The game provides an opportunity to participate in the battles for Hoth, Endor, Tatooine and other legendary planets. There is a mission on the unexplored planet of Sallast. You can control not only players, but also a variety of techniques, including huge walkers. As the game characters are present the main characters of the \"Star Wars\" Darth Vader and Luke Skywalker, Boba Fett.\nThe novelty of the series is the presence of species from the first and from the third person.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":10428,"name":"Heroes & Generals","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98c/98cd77a9f61b31a6ddab1670b079c841.jpg","description":"Heroes and Generals is a team game, and its primary purpose is to establish control over the territory (domination) by the team of its faction. To do this, you need to capture and hold the control points. Players can be reborn on them. At the moment, the game has three military factions: the United States, Germany and the Soviet Union. The player can purchase fighters of these factions and develop them. It is also possible to create a group of warriors, thereby allowing you to play with friends.\n\nThe variety of weapons and equipment depends on the faction. Also, you will have access to various upgrades. For stuff you can buy better shells, to set the supply crates for the infantry. Its different components can improve the weapon, and it is possible to put optics on some gun.\n\nThe game includes infantry units, tanks, aircraft and ground vehicles during the Second World war. The game has a diverse European landscape, from fields in rural areas to cities.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Reto-Moto","platforms":[{"id":0,"name":"PC"}]},{"id":41490,"name":"Divinity: Original Sin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/963/9639183ff27251b0b686acaa6aac0297.jpg","description":"<br/><br/>Gather your party and get ready for a new, back-to-the-roots RPG adventure! Discuss your decisions with companions; fight foes in turn-based combat; explore an open world and interact with everything and everyone you see. Join up with a friend to play online in co-op and make your own adventures with the powerful RPG toolkit. <br/><br/>In <strong>Divinity: Original Sin</strong> you take on the role of a young Source Hunter: your job is to rid the world of those who use the foulest of magics. When you embark on what should have been a routine murder investigation, you suddenly find yourself in the middle of a plot that will rattle the very fabric of time.<br/><br/><strong>Divinity: Original Sin</strong> is a game that gives you a lot of freedom and plenty of gameplay mechanics to use or abuse. The game's epic story may drive you toward your ultimate end-goal, but how you get there is entirely up to you.<br/><br/>Or up to you and a friend, because Divinity: Original Sin can be played completely cooperatively, and features both online and local drop-in/drop-out multiplayer. Great adventures become even greater when shared with a trusted comrade-in-arms!<h3>Key Features</h3><ul><li><strong>Become part of a reactive, living and vast open world.</strong> Explore many different environments, fight all kinds of fantastical creatures and discover tons of desirable items.<br/></li><li><strong>Experience gripping party- and turn-based combat.</strong> Manipulate the environment and use skill &amp; spell combos to overcome your many foes: Use magic to make it rain on your enemies, then cast a lightning spell to fry them to a crisp. Experiment with different skill combinations to ruin the day for enemies and townspeople alike. <br/></li><li><strong>Play with a friend in co-op multiplayer.</strong> Make decisions together (or disagree entirely), as your interactions and relationship with your partner influence the game.<br/></li><li><strong>Unravel a deep and epic story</strong>, set in the early days of the Divinity universe. No prior experience with other Divinity games is necessary, however. The game takes place well before its predecessors, Divine Divinity and Divinity II: The Dragon Knight Saga, but will still feel familiar to fans.<br/></li><li><strong>Classless character creation</strong> lets you design the character of your choice. Endless item interaction and combinations take exploration and experimentation to another level of freedom.<br/></li><li><strong>Create your own adventures</strong> and share them online. With Original Sin comes the powerful toolset used by the game's designers. Yours are endless new stories to make and share with other players!</li></ul><h3>Digital Collector's Edition</h3>The Digital Collector's Edition contains:<br/><br/><br/><ul><li><strong>2 copies of Divinity: Original Sin</strong>: one for you and pass on the second key to a friend<br/></li><li><strong>Award-winning <strong>Divine Divinity</strong> and <strong>Beyond Divinity</strong><br/></strong></li><li><strong>The Golden Grail DLC</strong>: an in-game item that allows you to colour your items in gold and sell them for more.<br/></li><li><strong>Zandalor's Trunks DLC</strong>: enjoy a unique in-game undergarment as rare as it is opinionated.<br/></li><li><strong>Design Documents</strong><br/></li><li><strong>Art Pack</strong><br/></li><li><strong>Soundtrack</strong></li></ul><br/>","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Larian Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":3561,"name":"Spelunky","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fad/fadc4be043ed07904012d47cd02671e4.jpg","description":"You play as an adventurer known as a spelunker. The primary task is to explore the caves, collecting as many treasures as possible, avoid the traps of enemies. \n\nA spelunker can whip or jump on opponents to defeat them, can pick up items from the ground that can be thrown at the enemy. You can also set various traps and use a limited supply of bombs and ropes to move through the caves. A notable feature is that the levels are randomly generated and grouped into four complexes \"areas\", each of which has a different set of items, enemies, terrain types and special functions.\n\nThe player may also encounter girls who are in difficulty. They can be taken away and attributed to the exit. If you successfully perform this action - health will be replenished. You can unlock the girl as a playable character; the gameplay is identical, except that, playing for her, you meet spelunkers on the way to salvation. Another aspect that can be unlocked - \"Tunnel man\", which is present the mattock instead of the whip.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Mossmouth","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":16199,"name":"Killer is Dead - Nightmare Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a72/a72e405a19f93dc68cbc06d7a39b2a4a.jpg","description":"The hero \"KILLER IS DEAD\" acts in the world of the near future. This world is very similar to ours but still different. The name of the hero is Mondo Zappa, and he is the executioner, the executor of the death sentences. His goal - to execute the notorious criminals scattered all over the world and beyond. His right hand is real, he uses it to wield a sword. And the left, artificial hand has different weapons.\nThe game includes twelve missions: from short linear levels to long levels that require exploration. There are three types of missions: the main ones that move the game forward, missions inside the main ones and missions of «Scarlett\" type, in which a female supporting character with this name appears.\nThe edition of Nightmare is distinguished by a new mode of complexity. In this mode, the enemies can be defeated only by a few specific attacks, the game requires more skill here. These attacks can be opened by inflicting a series of blows on the opponent and not getting a blow at the same time. Attacks can be combined with each other.\nAfter the third episode, the \"Smooth Operator\" add-on is unlocked.\nТhere is also a \"Theater Mode\" to review the videos and learn from his gaming experience.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"PC"}]},{"id":4869,"name":"Tomb Raider: Underworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/341/3413d7275fb1e919f00a925df8288b77.jpg","description":"Tomb Raider: Underworld is an action game developed by Crystal Dynamics. It is the eighth installment in the series.\n\nUnderworld continues the story of Tomb Raider: Legend and Tomb Raider: Anniversary. Lara tries to unravel the secrets told in the ancient Scandinavian legends in order to find Avalon - a place where her mother disappeared years ago.\n\nTR: Underworld is played from a third-person perspective. The game features a very interactive world. Lara leaves footprints in the snow, mud sticks to her legs if she kneels and could be later washed away with rain, the damage done to the environment is permanent and enemies' bodies do not disappear. A dynamic animation system is present in the game which allows for more character interaction with the world.\n\nThe developers put a strong emphasis on the fact that Lara is able to do anything that the players expect from her from grabbing a ledge to using her grappling hook to pull objects.\n\nThe game is non-linear to some degree as multiple mini-puzzles are present on several levels.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":28110,"name":"Vampyr","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23b/23b42b7a896140f4ce1d0df8c42fa012.jpg","description":"London, 1918. You are newly-turned Vampyr Dr. Jonathan Reid. As a doctor, you must find a cure to save the city’s flu-ravaged citizens. As a Vampyr, you are cursed to feed on those you vowed to heal.\n\nWill you embrace the monster within? Survive and fight against Vampyr hunters, undead skals, and other supernatural creatures. Use your unholy powers to manipulate and delve into the lives of those around you, to decide who will be your next victim. Struggle to live with your decisions… your actions will save or doom London.\n\nBE THE VAMPYR – Fight and manipulate with supernatural abilities\nFEED TO SURVIVE – Be the savior and the stalker\nSHAPE LONDON – A web of interconnected citizens reacts to your decisions","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":59313,"name":"Gris","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51c/51c430f1795c79b78f863a9f22dc422d.jpg","description":"Gris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to better navigate her faded reality. As the story unfolds, Gris will grow emotionally and see her world in a different way, revealing new paths to explore using her new abilities.\r\nGRIS is a serene and evocative experience, free of danger, frustration or death. Players will explore a meticulously designed world brought to life with delicate art, detailed animation, and an elegant original score. Through the game light puzzles, platforming sequences, and optional skill-based challenges will reveal themselves as more of Gris’s world becomes accessible.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nomada Studio","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":3635,"name":"Rogue Legacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/598/59851e152a6898c8bf79069b5bf2f4db.jpg","description":"The game begins in the castle, in which the heroes are \"settled\", there are also important things for the game, money and useful qualities. Much can be bought outside the castle.\r\nYou meet not only enemies but also other characters with whom interaction is possible. The smith can sell weapons and armour, and the gipsy can sell different magic things. A meeting with an architect can help with the exploration and reconstruction of the castle. The study of the castle promises useful finds. Among other spaces of the game are a forest, a dungeon and a tower.\r\nAt the disposal of the player, there is a book in which all the messages encountered during the game are collected. Messages inform us about what is there and what is happening.\r\nThe map is always generated anew and randomly, and the hero always dies at the end of the game, but all of his money is saved, and they can improve the character of the new game. The gameplay consists of searching and developing strengths and things, battling with opponents and finally - killing the main boss.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":248521,"name":"Valheim","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/adb/adb59be81367b19c2544457424bcf086.jpg","description":"Prove your worth!\nAre you worthy of entering Valhalla?\nYou have been sent to Valheim, the 10th Norse world. Only by defeating the mighty beasts of these lands will you win the favor of the gods. This quest will take you to the far reaches of this world, from the deepest forest to the highest mountain peak. You will craft powerful weapons, build unyielding castles and sail longships towards the horizon.\n\nDescription\n\nValheim is a game about exploring a huge fantasy world inspired by norse mythology and viking culture. You start your adventure at the relatively peaceful center of Valheim. The further from the center you travel, the more challenging the world becomes. But you will also find more valuable materials that you can use to craft deadlier weapons and sturdier armor. You will also build your own viking strongholds and outposts all over the world. Eventually you will build a mighty longship and sail the great oceans in search of exotic lands … but be wary of sailing too far...\n\nFeatures:\n\nFlexible house and base building system.\nIntuitive item crafting (weapons, armor, food etc).\nHuge procedural world.\nDodge & block based combat system with a wide range of weapons.\nDefeat bosses & collect trophies.\nEngaging food & health system.\nBuild & sail ships.\nMultiplayer (with focus on cooperation).\nDedicated server.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dvoid","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17885,"name":"Overlord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1c/d1cd8a226cb224357c1f59605577cbf2.jpg","description":"The hero of the game is Overlord, a great warrior, resurrected by predatory creatures - minions, to defeat the seven rulers of the seven provinces and capture their lands with all that is there. Overlord had a predecessor, who owned all the lands, but their present rulers defeated and killed him. And they fell into seven deadly sins, one for each.\nThe hero uses the old destroyed tower as a base. He brings there all the trophies and gradually transforms it into a comfortable, spacious and in every respect well-equipped room. Among the trophies are artefacts stolen from the tower, which add even new places to the tower, increase the health and magical power of Overlord.\nMinions are of four kinds, each species has its own abilities. Minions perish in battle, but Overlord can summon new ones from special wells, paying for it with the life force of dead enemies. You can build a smithy and then buy and improve weapons there.\nOverlord can behave differently, he is tempted by the same sins that enslaved his opponents. Its \"corruption\" exists in the game as one of its parameters, measured, displayed and affects the course and end of the game.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"}]},{"id":42215,"name":"Dying Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a5/4a5ce21f529cf8fd4670b4c3188b25df.jpg","description":"Dying Light is a first-person action horror game with the elements of survival. It is a first part of the Dying light series followed by Dying Light 2. The game is set in the open-world environment of fictional Harran city. Players are offered to assume the role of an undercover agent Kyle Crane who has been sent in the quarantine zone. His mission is to find the rogue politician Kadir \"Rais\" Suleiman lost somewhere in the infected giant city. On the way to achieving the goal, Kyle will meet other survivors, who desperately try to stay alive among zombies. The chief game mechanic is running the generators and turning on streetlights throughout Harran to make another part of the map accessible and safe at nighttime. The game features day/night time cycles that change the game remarkably: the action becomes fast-paced, and all the infected people turn into dangerous zombies. Therefore, the gameplay is based on armed combat against mutants and Kyle’s sneak and parkour skill for preventing it.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Techland","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":58494,"name":"Battlefield V","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/45b/45b57ed59de4b84effd8f6bc4b7bf515.jpg","description":"Battlefield V is the sixteenth game in its franchise. \r\n\r\n###Plot\r\nLike the original Battlefield, the game is based on the real events of World War II. The game focuses on the obscure battles of the war. It features storylines that tie the battles together and consist of episodes called “war stories”.\r\n\r\n###Gameplay\r\nBattlefield V puts a strong emphasis on realism. The game avoids video game abstractions in favor of immersive experience of the war. For that goal, the game aims to increase the player's interaction with the environment, such as doors, vehicles, or ammo. The ammo and other resources in the game are scarce, forcing the player to use a tactical approach.\r\nThe game gives a spotlight to women in the military who are among the main characters in the campaign. The player might also choose to play a female character in the multiplayer, as the gender is not tied to a class. The game also allows the players many customization options for costumes, vehicles, and weapons.\r\n\r\n###Modes\r\nBattlefield V has many multiplayer modes, some of which are new to the series and some are reimagined versions of the modes from previous games. For example, The Grand Operations mode is based on the original Battlefield mode called Operations. This mode imitates a military campaign and consists of a series of battles with different objectives and non-linear progress options.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":452649,"name":"Resident Evil: Village","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6cc/6cc23249972a427f697a3d10eb57a820.jpg","description":"Experience survival horror like never before in the eighth major installment in the storied Resident Evil franchise - Resident Evil Village.\n\nSet a few years after the horrifying events in the critically acclaimed Resident Evil 7 biohazard, the all-new storyline begins with Ethan Winters and his wife Mia living peacefully in a new location, free from their past nightmares. Just as they are building their new life together, tragedy befalls them once again.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":398423,"name":"Gothic Playable Teaser","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64e/64e4fc48c5d977188e8c47287f2a2cef.jpg","description":"This is not a full game. Its a playable teaser version to a potential approach for a new Gothic game. Nothing is set in stone.\n\nSo your feedback is essential to turn Gothic into a modern game. Therefore, and to reward your loyalty, Gothic - Playable Teaser is totally free for all fans who already have any of the titles in the Gothic saga or developed by Piranha Bytes!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":19647,"name":"Crysis 2 - Maximum Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ed/1edaaa9e24e0072772244633d01642f4.jpg","description":"The sequel to the game Crysis.\nThe army of aliens returns to Earth to destroy all of humanity. On the streets of New York, the epidemic mows people in millions. Chaos reigned everywhere, the city is rapidly turning into flaming ruins. The army and the police are powerless before the newcomers, and the only escape is an option. But if we call on the help of unique technologies, there is a chance to save ourselves and humanity. The hero is the one who has these technologies - and he fights alone, saving the city and people. And he is protected by a unique fighting device - Nanosuit 2.\nThe game focuses the player's attention primarily on destroying opponents in urban landscapes. The game is replete with clues - points to objects and places that can be used to win in combat, ways to reach the goal in another way.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Crytek","platforms":[{"id":0,"name":"PC"}]},{"id":719,"name":"Deponia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2e/c2e6ad5c838d551aeff376f1f3d9d65e.jpg","description":"Quest, very close to the original canon of the genre. The game has a minimum of hints, and puzzle solving is often very unobvious.\nThe plot of the game moves forward with the actions of the main character - Rufus, who lives on the planet of Deponia, long ago turned into a dump. Rufus dreams of moving to Elysium - a planet where life is entirely different.\nHe calls himself an inventor, but his ability to invent is very doubtful, like his successes in life in general. He lives in the home of his ex-girlfriend and does not do anything useful. Nevertheless, one day he manages to get on the ship of the organisation \"Organnon\", to get on Elysium. He meets on this ship a girl from Elysium, but when trying to protect her in a conflict with the owners of the ship accidentally pushes her off the ship. The girl flies down and falls on Deponia. Then the intrigue begins, the locals build their plans for the girl, and Rufus returns to Deponia and, as it turns out, has romantic feelings for the girl (and still wants to get to Elysium). In all this takes part the mayor of the city and many other residents, as well as robots. The girl herself lost her memory of the fall, and the members of the Organnon have an intention to blow up Deponia.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"}]},{"id":4397,"name":"Battlefield 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8bd/8bda6d876f3e241c6024022299553efd.jpg","description":"The eleventh game in the Battlefield series, a direct sequel to Battlefield 2.\nYou can play for 4 characters.\nSgt. Henry Blackburn, \"Black\" - the main character, the American Marine of the 1st reconnaissance battalion.\nSgt. Jonathan Miller, Jono is a sergeant, operator of the M1A2 Abrams tank.\nLt. Jennifer Hawkins, Colby is a lieutenant, pilot of the American F / A-18F Super Hornet bomber.\nDmitry Mayakovsky, \"Dima\" - an operative of the GRU, a former fighter of the special unit \"Vympel\".\nThe main hero is Henry Blackburn, his character is the main part of a single campaign. The missions in the game are presented in the form of memoirs of Blackburn, on whose behalf the story is being conducted.\nLocations - Long Island, Paris, Tehran and Iraqi deserts, Persian Gulf, Azerbaijan. The behavior of various weapons is closest to reality: recharging, portability, the trajectory of bullets, the dependence of the speed of bullets emanating from the barrel and their energy from their caliber and barrel length. The number of additional modules for weapons and the weapons in Battlefield 3 is 10 times more than in Battlefield 2.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts DICE","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":704634,"name":"Uncharted: Legacy of Thieves Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de6/de66bc4c72b45c3bb906c85d0628112d.jpg","description":"Are You Ready To Seek Your Fortune?\r\n\r\nSeek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection. Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, and over the top moments of the beloved thieves – Nathan Drake and Chloe Frazer.\r\n\r\nIn an experience delivered by award winning developer Naughty Dog can, the UNCHARTED: Legacy of Thieves Collection includes the two critically-acclaimed, globe-trotting single player adventures from UNCHARTED™ 4: A Thief’s End and UNCHARTED™: The Lost Legacy. Each story is filled with laughs, drama, high octane combat, and a sense of wonder – remastered to be even more immersive.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":13886,"name":"Star Wars: Battlefront II (2005)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/662/6625a20ca1d13699ee7c191b20a02408.jpg","description":"Battlefront II has a lot of similar elements with its predecessor, though, some new game mechanics were added.  The primary goal, as in the previous part, for most missions, is the elimination of the enemy unit, however, in the campaign mode, a variety of combat tasks is now available, and the implementation of them is the key to victory. \r\n\r\nThe differences between Battlefront II and Battlefront mainly relate to increasing the number of game modes (campaign, galaxy conquest, instant action, challenges and multiplayer), the ability to play for different heroes and villains, the presence of the ability to sprint and to flip ahead. \r\n\r\nThroughout the game, there is a battle between two armies. But the action can be different (it all depends on the selected mode and version of the game). Also in some cases, there is a so-called Fake Console, which allows the player to edit the parameters of the battle on his discretion.  Battles can take place both on the planets themselves and in outer space in the orbit of these planets.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":10293,"name":"Tabletop Simulator","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f86/f869253c68b38fa789f58cc5be2cb996.jpg","description":"###Mods and Kickstarter\nA unique set of digitized board games from the Berserk Games studio. The studio successfully raised funds for development in 2014 at Kickstarter and released the project in the same year. Only two people worked on the game: they just graduated from college and had some experience developing game mods. The game uses the Unity graphics engine and is available on Steam for Microsoft Windows, Linux, and OS X.\n\n###Game mechanics\nThere are no conditions for victory or defeat in the game. Each time players simply spawn on the playing field, where they can interact freely with game figures and pieces. All the craziness occurs within the realistic physical model, which the developers have added for greater similarity to the real prototypes. In addition to the insanity that can be arranged in multiplayer along with ten other players, the game engine supports the ability to use preset rules for different board games and thus play them.\n\n###Key features\nThere are several games included. For example, chess, poker, and checkers. The set is small, but the game supports Steam Workshop and the ability to download your own models of figures and game boards. Thus, players added to the standard set of three games three thousand more variations, most of which are variations on games, for the inclusion of which developers will have to purchase a license.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Berserk Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":892,"name":"Dust: An Elysian Tail","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c40/c40f9f0a3d1b4601a7a44d230c95f126.jpg","description":"Dust: an Elysian Tale is an action role-playing game with metroidvania elements set in an imaginary world called Falana. Dust, the main character, with his sentient sword called Blade of Ahrah and guardian Fidget explores the “2D” side-scrolled environments. According to the storyline, Dust wakes up in the forest meadow and finds himself unconscious. Then, after meeting the sentient sword and its keeper, Dust decides to find the keys to his past. Players are offered to assume the role of Dust on his way through the world. Dust can upgrade his characteristics (health, magic, strength, and defense) by spending gained experience points. The gameplay also features metroidvania mechanics, so players have to progress within the game and upgrade Dust’s skills in order to achieve special goals hidden throughout Falana. During Dust’s travel through levels players are able to contact with other characters to trade or to get side quests.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Humble Hearts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":19491,"name":"Burnout Paradise: The Ultimate Box","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7cf/7cf38d2d80267c121c6d0d361e9429ce.jpg","description":"Burnout Paradise: The Ultimate Box is an extended version of the original Burnout Paradise game. The game offers action racing that sometimes resembles the demolition derby in an open-world setting of Paradise City. The game has a remarkable damage system that improves the whole experience and interrupts monotonous moves across the city, which is free-to-explore for the first time in a series. With The Ultimate Box edition, developers added day/night time cycles and dynamic weather system, so graphics became much better. Changes also affected the gameplay. Now players can race and explore the entire map of the city either by car or by bike that were also added. The racing career begins at the dump, where the driver, controlled by players, gets their first car and two new bikes. Players complete races and fill the “driving license” scale to upgrade the level and to open new cars and events. The free roam mode itself is also an integral part of the gameplay: while traveling across the map drivers are able to perform various stunts and unlock special achievements for the “license” experience.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Criterion Games","platforms":[{"id":0,"name":"PC"}]},{"id":4347,"name":"DiRT Showdown","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23d/23d78acedbb5f40c9fb64e73af5af65d.jpg","description":"DiRT Showdown is not a traditional racing simulator of the DiRT series. The only similar thing that relates Showdown to the original games is a high level of graphics: developers added day/night time cycles and dynamic weather system, so the whole picture looks beautiful. This game offers an arcade physics that focus players on their positive emotions. Even the advanced damage system is only a cosmetic feature because damages don’t really affect car running performance. Everything in the game is made for the spectacle. The vehicle range was expanded: imaginary monsters specially prepared for the demolition were added to already existing licensed rally cars. Racing experience covers picturesque landscapes throughout America. All the events can be divided into four main classes (Racing, Demolition, Hoonigan, and Party) and then into numerous types. Gradual completion of the events gives money for buying new vehicles or upgrading existing ones and opens new perspectives for drivers. DiRT Showdown offers both single and multiplayer experience.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":34,"name":"Crash Bandicoot N. Sane Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/444/4440f674e2bcb257e249a9ab595d8ab6.jpg","description":"Your favorite marsupial, Crash Bandicoot™, is back! He’s enhanced, entranced and ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot™, Crash Bandicoot™ 2: Cortex Strikes Back and Crash Bandicoot™ 3: Warped. Relive all your favorite Crash moments in their fully-remastered graphical glory and get ready to put some UMPH in your WUMP!Crash Bandicoot™ N. Sane Trilogy Stormy Ascent Level\nExperience the notorious Stormy Ascent level from the original Crash Bandicoot game. Previously unfinished and unreleased, this level will challenge even the most hardcore of Crash fans! Do you have what it takes to tackle the fast retracting steps, vial throwing lab assistants, flying birds, moving platforms and iron spikes?Crash Bandicoot N. Sane Trilogy Future Tense Level\nPlay the first-ever NEW level built for the original trilogy’s gameplay in almost 20 years. Drawing inspiration from the cut “Waterfall Level” from the first Crash Bandicoot game, Future Tense features several puzzles from the original level set in the futuristic setting from Crash Bandicoot 3: Warped. Discover a whole new level of difficulty for Crash Bandicoot N. Sane Trilogy as you dodge rockets, destroy robots and leaps lasers while ascending a massive futuristic skyscraper.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Activision","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":11279,"name":"Day of Defeat: Source","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bff/bff7d82316cddea9541261a045ba008a.jpg","description":"Day Of Defeat: Source is a multiplayer class-based FPS developed by Valve. The game is a remake of Day Of Defeat which was released on GoldSrc engine.\n\nSet in 1944, the game focuses on the European war theatre and two teams: U.S. Army and Vermacht. Each team has 6 player classes: Rifleman, Assault, Support, Machinegunner, and Rocket.\n\nDoD: Source features two game modes: territorial control and detonation. In territorial control, players fight over several strategic points on the map. In detonation, however, the objective is to detonate two bombs on every checkpoint of the opposing team.\n\nThe game features 8 official maps, but there are a lot of custom maps designed by the community members.\n\nDay Of Defeat: Source served as a testing ground for Valve as it was the first Source-based game that featured in-engine High Dynamic Range. Several post-processing effects were added by Valve after the release of the game in order to make it look more like a 1940s era movie. The effects include film grain, color correction and depth of field.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Valve Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4358,"name":"Assassin's Creed Revelations","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/193/19390fa5e75e9048b22c9a736cf9992f.jpg","description":"When a man has won all his battles and defeated his enemies; what is left for him to achieve? Ezio Auditore must leave his life behind in search of answers, In search of the truth.\nIn Assassin’s Creed® Revelations, master assassin Ezio Auditore walks in the footsteps of the legendary mentor Altair, on a journey of discovery and revelation. It is a perilous path – one that will take Ezio to Constantinople, the heart of the Ottoman Empire, where a growing army of Templars threatens to destabilize the region.\nIn addition to Ezio’s award-winning story, a refined and expanded online multiplayer experience returns with more modes, more maps and more characters, allowing you to test your assassin skills against others from around the world.\nKey Features:BECOME DEADLIER THAN EVER\nWield the lethal skills of a wiser, more efficient and deadlier Ezio. Swiftly eliminate your adversaries by deploying a new arsenal of weapons and abilities, such as enhanced free-running and hook blade combat. Experience new levels of gameplay customization with bomb crafting, and use heightened Eagle Vision to overcome your enemies and the environment.\nTEST YOUR SKILLS AGAINST THE BEST\nA critically acclaimed multiplayer experience gets even better, with   all-new team modes and infinite replay value.\nEXPERIENCE REVOLUTIONARY GAMEPLAY\nExplore the farthest reaches of the Animus as you uncover the mysteries of Desmond’s past while gaining insight into what the future might hold.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":29153,"name":"Max Payne 2: The Fall of Max Payne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6fd/6fd971ffa72faa1758960d25ef6196bc.jpg","description":"Max Payne 2: The Fall of Max Payne is a third-person shooter, serving as a direct sequel to the first game. The player follows the story of an NYPD detective, tasked with resolving crimes and answering many questions of its predecessor’s story. The game is set in noir tones, providing with main character’s monologues and various cutscenes.\nThe titular protagonist, Max Payne, is a traumatized officer of the police. After the first game’s events, Max is once again involved in the bloody conflicts of the mafia, with its drama, romance, and bitterness. The game offers its players various game mechanics for maximum replayability. For instance, the difficulty of each level adapts to how you play overall, with enemies dealing less damage and painkillers being more effective if the player has died too many times. The series’s feature mechanic, Bullet Time, is also present in the game, allowing players to plan their movements and save precious ammunition during the slowed time. \nThe game’s physics engine allows the players to experience the most fearsome battles hand-to-hand, with the realistic destruction of surroundings, cinematographic kills, and dramatic deaths. Max Payne 2 also features a game editor, with user-created modifications serving as a tool to further enhance every playthrough.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"}]},{"id":382,"name":"Sniper Elite 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fe/2feec1ba840f467a2280061b9e665c6e.jpg","description":"\"Sniper Elite 4 is a smart, strategic shooter that empowers you to make your own path\"\nIGN, 8.3/10 \"A riotously entertaining WW2 stealth adventure\"\nEurogamer, Recommended  \"An ambitious stealth game that handily outperforms its predecessors\"\nPC World, 4/5\nDiscover unrivalled sniping freedom in the largest and most advanced World War 2 shooter ever built. Experience tactical third-person combat, gameplay choice and epic longshots across gigantic levels as you liberate wartime Italy from the grip of Fascism.\nSet in the aftermath of its award-winning predecessor, Sniper Elite 4 transports players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to ancient forests, mountain valleys and colossal Nazi megastructures.\nCovert agent and elite marksman Karl Fairburne must fight alongside the brave men and women of the Italian Resistance and defeat a terrifying new threat with the potential to halt the Allied fightback in Europe before it’s even begun.EXPANSIVE CAMPAIGNEncounter hours of gripping gameplay in huge campaign levels with hundreds of enemies, vehicles and high-ranking Nazi officers to hunt. Forge your own path to your objectives, uncover new sniper nests, find secret side missions, collectibles and more!AWARD-WINNING SNIPINGExperience genre-defining rifle ballistics where snipers must take account of wind, gravity and heart rate to land satisfying shots over hundreds of meters.EXTENSIVE ARSENALAdapt seamlessly to any combat situation with an impressive array of iconic World War 2 sniper rifles, pistols, submachine guns, heavy weapons, traps, grenades and explosives.DEEP CUSTOMISATIONHone your combat effectiveness by upgrading skills and tweaking key weapon traits such as scope magnification, muzzle velocity and stability. Create and edit custom loadouts for any encounter.SLICK TRAVERSALS AND TAKEDOWNSClimb, hang, shimmy and leap your way across the game’s vast environments to get the drop on enemies and deliver killing blows from behind cover, hanging over ledges and more!ACCLAIMED X-RAY KILL CAMSSniper Elite’s acclaimed X-ray Kill Camera returns with all-new visuals and features, now framing your most impressive melee attacks and explosive trap kills in bone-cracking detail.TACTICAL CO-OPPlay the entire campaign online with another player or jump into dedicated co-operative game modes for up to 4 players.THRILLING MULTIPLAYERTake Sniper Elite’s trademark sharpshooting into unique competitive play for up to 12 players in 6 modes across 6 custom-designed maps. Even more modes and maps will be released FREE after launch!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Rebellion","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":58764,"name":"Outer Wilds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f4/9f418898f5415668ca47b5f4ab1ecfeb.jpg","description":"Outer Wilds is an open world mystery about a solar system trapped in an endless time loop.\nWelcome to the Space Program!\nYou're the newest recruit of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system.\n\nMysteries of the Solar System...\nWhat lurks in the heart of the ominous Dark Bramble? Who built the alien ruins on the Moon? Can the endless time loop be stopped? Answers await you in the most dangerous reaches of space.\n\nA World That Changes Over Time\nThe planets of Outer Wilds are packed with hidden locations that change with the passage of time. Visit an underground city of before it's swallowed by sand, or explore the surface of a planet as it crumbles beneath your feet. Every secret is guarded by hazardous environments and natural catastrophes.\n\nGrab Your Intergalactic Hiking Gear!\nStrap on your hiking boots, check your oxygen levels, and get ready to venture into space. Use a variety of unique gadgets to probe your surroundings, track down mysterious signals, decipher ancient alien writing, and roast the perfect marshmallow.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mobius Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":5342,"name":"Medal of Honor","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/106/1069e754e7e6012b0cf42b4b04704792.jpg","description":"Medal of Honor is a first-person action shooter providing both single and multiplayer experience. It is the thirteenth game in the Medal of Honor franchise, but in comparison to the previous ones, its plot is unique. The game is set in the historical period of the War in Afghanistan. The single campaign opens up in 2001 during the invasion of Afghanistan. The action gives an opportunity to participate in the military conflict for the U.S. Navy. In the course of the storyline, players alternate between the roles of a Navy SEAL operator codenamed Rabbit, Delta Force sniper Deuce, U.S. Army Ranger specialist Dante Adams, and AH-64 Apache gunner Hawk. The gameplay is based on typical military operations including the completion of in-game objectives (raiding enemies’ checkpoints and rescuing hostages). Medal of Honor multiplayer offers a choice of joining one of the conflict’s forces: the Coalition or the Opposing Forces. Each side has its own weapons, however, comparable in general stats. To start a match, the player should choose a class (Rifleman, Special Ops or Sniper). Classes’ equipment and skills can be upgraded with the experience points earned in combat.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts DICE","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":58952,"name":"Life is Strange 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/883/883bc3050f9a4115d1968ece56bddfc2.jpg","description":"The award winning Life is Strange series continues with a long-awaited sequel from DONTNOD Entertainment.\r\n\r\nTwo brothers Sean and Daniel Diaz, 16 and 9, are forced to run away from home after a tragic incident in Seattle. In fear of the police, Sean & Daniel head to Mexico while attempting to conceal a sudden and mysterious supernatural power.\r\n\r\nLife on the road is tough and now totally responsible for his much younger brother, Sean begins to realise that his decisions will impact their lives forever…\r\n\r\nEpisode 1 will be available on September 27th 2018.  Episodes 2-5 will be available at later dates.  \r\n\r\nComplete Season includes Episode 1 and the Episode 2-5 bundle. Episodes 2-5 available upon release.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":49,"name":"Persona 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ea/3ea0e57ede873970c0f1130e30d88749.jpg","description":"Persona series is a part of Japanese franchise Megami Tensei and is famous for its anime-like visual style. Persona 5 follows the unnamed main character, a high school student who was falsely accused of assault. He joins the Shujin Academy where he becomes the leading member of Phantom Thieves of Hearts. They are a gang of vigilantes who can to control their Personas and use them in a fight. The Personas are manifestations of people’s personalities that look like fictional characters. The Phantom Thieves accompany the main character in his battles as a party.\r\nThe world of Persona consists of two parts. One is the modern Tokyo, in which the main characters live their daily teenagers’ lives. This is the place for most character interactions, including romancing. The other part is Metaverse, a parallel supernatural world that contains Palaces, which are manifestations of people’s malicious thoughts and desires. By day, the main character and his friends attend school and meet friends, and by night, they fight villains in the Metaverse to steal treasures from their Palaces. Battles are turn-based, and characters use a variety of weapons as well as their Personas that provide them with battle magic.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":45970,"name":"The LEGO NINJAGO Movie Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f60/f607e3212c540e3d25c2418c2edb6306.jpg","description":"Find your inner ninja with the all-new LEGO NINJAGO Movie Video Game! Play as your favorite ninjas, Lloyd, Jay, Kai, Cole, Zane, Nya and Master Wu to defend their home island of Ninjago from the evil Lord Garmadon and his Shark Army. Master the art of Ninjagility by wall-running, high-jumping and battling the foes of Ninjago to rank up and upgrade the ninja's combat skills. Only in the LEGO NINJAGO Movie Video Game will you experience the film across 8 action packed locations each with its own unique Challenge Dojo.  And with the Battle Maps, play against friends and family in competitions for up to four players!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":15829,"name":"Pillars of Eternity","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/789/7896837ec22a83e4007018ddd55e8c9a.jpg","description":"In the land of Dyrwood, which suffers from a supernatural and inexplicable misfortune: children in Dyrwood are become \"Hollowborn\",  what means, without a soul. The main character gets into a storm, discovering the talent of the \"Watcher\", which allows him to communicate directly with other people's souls and see other people's lives. During the game, he must reveal his purpose and find a way to solve the problem of \"Hollowborn\" children.\n\nYou will need to travel around the world of Eora, performing tasks for different groups, the relationship with each of which determines a specific reputation system. Reputation is calculated separately for each group and depends on the actions of the player. Fights with opponents occur in real time with the ability to stop the time. Up to five characters-companions can accompany the hero, they not only help in combat but also reveal some important details of the plot.\n\nThis game uses a unique role-playing system. A prominent place in it is given to the skills and abilities of the character, not related to the battles. The feature of this system is that the combat and non-combat skills of the character develop independently.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15566,"name":"Red Faction: Guerrilla","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/94a/94a59c5136a9b90eef5f23fea7bf997c.jpg","description":"Red Faction: Guerrilla is a third-person shooter developed by Volition, Inc. It is the third installment in the Red Faction franchise.\n\nThe game is set 50 years after the first game. After the Earth Defence Force saved the Martians from the oppression of Ultron corporation, a new dictatorship had been established. Alec Mason arrives on Mars to earn money and meet his brother who is later killed. Alec joins the Red Faction to free the people of Mars from the reign of EDF and avenge his brother.\n\nThe singleplayer resembles a large set of missions in which Mason has to bring down the tyrannical regime. The planet is divided into 6 large districts. The player has to get all the districts under control and lower the enemy presence. \n\nThe main feature of the game is total destruction in the game's open world. It is necessary to bring down the buildings in order to complete story missions and gain reputation. A large set of vehicles is available to the player. The main currency of the game is scrap which drops from the destroyed buildings and paid out to the player after completing the missions.\n\nMultiplayer mode is also present in the game. Players have the selection of six game modes.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":1758,"name":"Valiant Hearts: The Great War","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/39a/39a8aa7798b685f9625e857bc394259d.jpg","description":"Valiant Hearts is a sidescroller adventure with a significant amount of attention paid to artwork and historical authenticity. While being not so demanding on a software side, it was released on the mobile platforms as well as on the big consoles. Such variety of platforms, however, limits the gameplay peculiarities that can be featured within a game. \nThe player takes a role of one of four characters on the Belgian, American, French and German side of the Great War conflict — World War I. During the game they need to solve puzzles, watch animated cutscenes, fight enemies and do military races. \nValiant Hearts is thus telling four stories simultaneously and ties them up in the end and throughout a fabula, while being historically correct when it is crucial. The game has received the Best Narrative awards and the Games for Change awards for such a plot-twists.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft Montpellier","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":44525,"name":"Yakuza Kiwami","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fbb/fbbd9fe21317bde9134114e2b1306069.jpg","description":"“Kiwami” means extreme.\r\n1995, Kamurocho… Kazuma Kiryu, the Dragon of Dojima, takes the fall for the murder of a crime boss to protect his sworn brother, Akira Nishikiyama, and his childhood friend, Yumi.\r\n2005… Akira Nishikiyama has become a changed man. Yumi is nowhere to be found. Ten billion yen has gone missing from the Tojo Clan's coffers, putting the organization on the brink of civil war. And Kazuma Kiryu is released from prison to a world he no longer recognizes.\r\nWith enhanced gameplay, an expanded cinematic story, the return of the battle styles from Yakuza 0, more nightlife spots, and re-recorded audio by the series cast, Yakuza Kiwami is the ultimate and most “extreme” version of the original vision of the series, now optimised for PC with 4K resolutions, uncapped framerates, customisable controls and ultra-widescreen support.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":1789,"name":"The Swapper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6fc/6fcb1c529c764700d55f3bbc1b0fbb5b.jpg","description":"The Swapper is a classical platform game with several elements of Metroidvania focused on solving puzzles. The game follows a female astronaut stranded on the abandoned space research station in a science-fictional universe. Completing the game players will be able to learn more about the fate of researches and to restore the sequence of events held aboard the station. Players assume the role of the protagonist, as she tries to clarify the mystery of a unique item, which allows her to clone herself and to transfer the mind to the clone. Therefore, the cloning ability is a basic game mechanic that helps the player to solve puzzles and complete levels. The gameplay features traditional side-scrolling platformers’ elements: players control the 2D action from the third-person perspective. In the course of the completion, players are going to face obstacles of varying degrees of complexity ranging from simple barriers (however inaccessible for clones) to higher platforms or even gravity shutdowns.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Curve Digital","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]}]