[{"id":16183,"name":"Defy Gravity Extended","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/376/376c0927f2ff4c5fd38a95d5ff501bba.jpg","description":"Defy Gravity is an action platformer that is a mix between classic platforming and gravity based puzzle solving.  Kara, our heroine, has access to a unique gameplay mechanic that she uses to manipulate the world around her.  She has a gun that is able to alter the laws of physics through the creation of pockets of gravity and anti-gravity. By mastering the use of these abilities Kara is able to augment her jump in order to almost fly past obstacles. These powers can also be utilized to move objects that block her path and platforms that Kara stands on in order to traverse the levels.\nKey Features:\t\t\t\t\t\t\tUnique physics engine that provides a never before experienced gameplay experience.\nXbox controller and keyboard/mouse support\n24 unique levels\nA second quest mode that radically changes the game and adds an additional 24 levels\nCustom Soundtrack\n8 Steam Achievements\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Paul Fisch","platforms":[{"id":0,"name":"PC"}]},{"id":324994,"name":"Darksiders Genesis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/777/777060c7cc63029dc4d5f5c562d07b4c.jpg","description":"From the dawn of creation, THE COUNCIL has maintained the Balance across existence.  Carrying out their orders are THE HORSEMEN, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.  However, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind.  What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.\nStill reeling from the events on Eden, WAR and STRIFE have been given a new assignment -- LUCIFER, the enigmatic and deceptive demon king, has been plotting to upset the Balance by granting power to master demons throughout Hell.  War and Strife must hunt down these masters, gather information, and ultimately fight their way through a tangled, demonic conspiracy that threatens to forever upset the Balance and unravel all of creation.\nDARKSIDERS: GENESIS is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging.  Genesis gives players their first look at the world of DARKSIDERS before the events of the original game, as well as introduces the horseman STRIFE.Features:Blast angels and demons as the gunslinging Horseman Strife, playable for the first time\nSwap between the powerful swordsman War and Strife instantly in frenetic, single-player gameplay\nExplore the epic world of Darksiders and wreak havoc with a friend in two-player cooperative mode\nExperience a brand new story campaign that takes place before the original Darksiders, exploring the origin of the Seven Seals\nGrow in strength and power as you collect items, abilities, weapon enhancements, creature cores and more","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Airship Syndicate","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":445430,"name":"Mafia III: Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/944/94497cb4d179b652ba8da2a52ab55a3e.jpg","description":"Mafia III: Definitive Edition is here, and it's the best way to live the life of a gangster during the 1960s era of organized crime in America. This is the complete collection of Mafia III content reintroduced in one package, including three sizable DLC storylines, tons of added content, and even new items for owners of the other two games in the Mafia: Trilogy. Mafia III: Definitive Edition is out now on PlayStation®4, Xbox One, and PC via Steam, and will be coming to Stadia and the Epic Games Store at a later date.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hangar 13","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":452635,"name":"Kena: Bridge of Spirits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/91d/91ddeef8d5ebee7f21faa89efa0f2201.jpg","description":"Kena Bridge of Spirits is an upcoming game from Ember Lab, a small studio with a background in animation and film.\r\n\r\nHighly stylised and looking like something out of a Pixar movie, , drops its cute exterior to show a protagonist capable of magic. In gameplay to follow, the heroine seems to use a staff to command elements and guide a band of small creatures.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ember Lab","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":12741,"name":"Empire: Total War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b28/b2813f31d36b83d2e8d4e246a2cfcbe2.jpg","description":"The fifth part in the Total War series, Empire is set in the 18th century. The player controls over one of the powerful empires of the era, such as Great Britain, Spain or Russia. There are more than 50 factions in the game overall, although only the major civilizations are playable, while the rest are campaign-specific minor states and colonies. The factions are not static, as colonies can claim independence, and within empires, the government can change, even in the one controlled by the player. \nUnlike its predecessors, Empire: Total War puts a stronger emphasis on the empire-building in the vein of Civilization series. The game combines turn-based global strategy with an RTS-style warfare. On the strategic map, you control your empire’s diplomacy, economy, religion, colonization, government, and other aspects. The battles, however, are fought as real-time wargames. The warfare is very realistic and includes a variety of units and battle movements based on military history. The units react like real people, shoot orders, and panic if they lose. Empire was also the first game in the series to introduce fully realized naval battles, which allow you to set enemy ships on fire or to board and capture them in real-time.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10579,"name":"Planescape: Torment: Enhanced Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/399/3990e15f219261780b30f20cdc62266b.jpg","description":"The original Planescape: Torment was released in 1999 to widespread critical acclaim. It won RPG of the Year from multiple outlets for its unconventional story, characters, and amazing soundtrack. Since then, millions of Planescape: Torment fans have enjoyed exploring the strange and dangerous city of Sigil and surrounding planes through the Nameless One's eyes.\nDiscover an incredibly rich story and a unique setting unlike anything else in fantasy. Defeat strange and alien creatures, engage in rich dialogue, and explore the dark and dangerous Planescape setting in this 50+ hour RPG classic.\nThis is Planescape: Torment like you’ve never seen before.Story\n\"What can change the nature of a man?\"\nYou are the Nameless One, a hulking figure covered in scars and tattoos collected over the course of countless lives—none of which you can remember, but are now coming back to haunt you. You are prodded awake by Morte, a floating skull and keeper of secrets, to embark on an adventure taking The Nameless One from the dirty streets of Sigil into the mysterious Outer Planes and even into the depths of Hell itself.\nPortals riddle the planar metropolis of Sigil, providing access to anywhere in existence, but only if you have the proper key. Known as the \"City of Doors,\" Sigil is a neutral ground where demons, devas, and races from across the multiverse gather under the watchful shadow of the Lady of Pain, the city's enigmatic ruler. This is a place where the word is mightier than the sword, where thought defines reality, and belief has the power to reshape worlds.\nIn your search for answers, you'll find companions matching the bizarre nature of the planes: a chaste succubus who can kill with a kiss, a confused crossbow-wielding cube, a suit of armor animated by a spirit demanding JUSTICE, and more. With these companions and others at The Nameless One’s side, you will explore worlds in search of answers, all to discover that some destinies cannot be escaped and some memories cost more than an even an immortal can bear.Features\nEnhanced Planescape: Chris Avellone, Lead Designer on Planescape Torment, has partnered with Beamdog to curate gameplay updates, bug fixes, and enhancements to best capture his original vision for the game.\nThe Planes Await: Planescape is a setting you've never experienced before, filled with strange magics, strange adversaries, and Dungeons & Dragons locations from across the multiverse.\nConversations to Remember: Encounter personable items, philosophic undead, and rat hiveminds while walking the planes with the strangest collection of allies ever seen in an RPG.\nPick Your Path: Character creation is just the beginning. The Nameless One can change his class, alignment, and even gain new abilities based on your choices.\nRemastered Music: The full Planescape: Torment soundtrack has been remastered in-game to add more depth to Sigil and the multiverse.\n4K Interface: Sigil has never looked this good! The interface of Planescape: Torment has been rebuilt in high definition with tons of new convenience features.\nA Planescape For Today: The Enhanced Edition includes modern features such as tab highlighting, area zooming, combat log, quickloot, and more!\nPlay It Your Way: Enable Enhanced Edition features as you desire or turn them off to experience Planescape: Torment in its original glory.\nCast Comprehend Languages: Planescape: Torment: Enhanced Edition is available in English, French, Polish, German, and Korean. Note: Korean translations are text only with voice-overs played in English.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":24619,"name":"Broken Sword 1 - Shadow of the Templars (The Director's Cut)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3f/a3fb21a739b6abf7ceee3dead89a73d7.jpg","description":"Broken Sword: Shadow of the Templars - The Director's Cut is a remastered version of the original point-and-click quest released 13 years afterward. \r\n\r\n###Plot\r\nThe original game sets in Paris and tells a story of a Nicole Collard — the protagonist alongside with George Stobbart — the American tourist. The whole narrative centers around Palais Royale where the murdering of the local President candidate — Pierre Carchon. Furthermore, she figures out the Templar order is mixed with the situation. The player is set to follow many arcs: starting from romancing the other characters and ending with the prevention of the global terroristic attacks.\r\n\r\n###Gameplay\r\nTraditionally, the gameplay in the point-and-click varies a little or do not change at all. The player is given some two-dimensional background with clickable items on it and the characters on the screen. The player may interact either with the environment or with the people. The remastered version also brought touch controls for mobile devices and accelerometer Wii Remote pads. \r\n\r\n###Director's Cut features\r\nThe game's graphics were rendered in higher definition, some of the original's scenes were cut out, and the display of the blood spilling in some scenes was evaded entirely. The original game featured only George Stobbart as the protagonist; however, the whole new Collard's story was added. The game has also got easier — the \"help\" section was added.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Revolution Software","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13999,"name":"Penumbra Overture","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1bb/1bb3f78f0fe43b5d5ca2f3da5b638840.jpg","description":"Penumbra Overture is a survival horror game developed by Frictional Games.\n\nIn the year 2001, after his mother's death, Phillip receives a message from his father who left the family and was supposedly dead. The letter leads Phillip to Greenland where he finds a mine his father wrote about. During the descent into the mine, the ladder breaks down. Phillip has to find another way out.\n\nThe game's world is highly interactive thanks to an advanced physics engine. Players are able to move the in-game objects by moving the mouse instead of just clicking on them. For example, in order to pull a door, the player has to click on the handle and pull the mouse towards themselves. There are no firearms in Penumbra, so Phillip has to fight the enemies off using mining equipment. It is better to evade any conflict rather than getting into a fight. Phillip can stick to the shadows to hide from the enemies, barricade doors or trap his enemies in the cages.\n\nDuring gameplay, the player has to find clues on how to complete a certain puzzle. For example, when Phillip has to make a bomb, the players have to consult the explosives manual, find the ingredients and mix them together.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Frictional Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13583,"name":"The Lord of the Rings Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/179/17969ec669130c15b8b480fcc43c53fe.jpg","description":"The Lord of the Rings Online is an MMORPG developed by Turbine, Inc.\n\n###Plot\nThe events of the game take place at the same time as the original novels. Time flows differently in each region of Middle-earth, but it does not differ much.\n\nEach story arc resembles a different part of the plot and is distributed as DLC. In the first part, the players have to fight a fake king of Angmar. After that, the players set out to help the gnomes with freeing Moria from the Darkness. In the King's Allies add-on, the player goes south with Aragorn. The last expansion pack called The Strength of Sauron allows the players to visit Gondor.\n\n###Gameplay\nThe player firstly creates their own character. Five races are available for the players. Each race has its own advantages and disadvantages, so choose wisely. Nine classes are present in the game. Each of them drastically affects the gameplay.\n\nLeveling the character up does not differ much from the other MMORPGs. The players explore the world, kill monsters, complete quests. There is an immense number of quests present in the game. The players gain the majority of experience from them.\n\nThe game features a craftsmanship system. There are seven crafts present in the game, each of which has three professions to choose from. \n\nThe game features only one hobby to take part in, and it is fishing. It is possible to fish in any water body. The fish can be eaten or placed as a trophy in the player's house.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Standing Stone Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":50273,"name":"Warhammer 40,000: Gladius - Relics of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc0/cc0e706908436d395c4b7b6b5651c4b4.jpg","description":"Twitch First Preview\nAbout the Game\nGladius Prime was known to Imperial scholars as a planet of archeological interest. During its colonization ancient relics were found, revealing hints of a shrouded past. But it was more than relics. Something awakened, an unspeakable horror from an ancient past, and the citizens of Gladius found themselves trapped in a terrible war for survival.\nGladius Prime was once a planet of peace. Now there is only war.\nhttps://www.youtube.com/watch?v=KyvxGl_hKf0\nWarhammer 40,000: Gladius – Relics of War brings you to a world of terror and violence. Four factions will engage in a brutal war for dominance over the planet’s resources.\nIn the first 4X turn-based strategy game set in Warhammer 40,000 you will lead one of four factions: Astra Militarum, Space Marines, Orks and Necrons, each with their own unique gameplay, technological tree, units and heroes.\nFace a challenging AI or cooperate or compete with friends and strangers across the globe.\nPlay as one of four iconic Warhammer factions (Astra Militarum, Space Marines, Orks or Necrons), each with their own unique playstyle and technology tree. Explore a randomly generated world filled with special features and threatening wildlife that can crush your troop's morale. Secure control of powerful ancient artefacts to grant you an edge against rival factions.\nConstruct cities, buildings and fortifications to expand your empire and produce an army to vanquish your foes. Harvest resources and research new technologies to fuel and upgrade your machinery of war.\nProgress through a different storyline with each faction as their destiny on Gladius Prime, a world tainted by the warp, unfolds. In the end, when all the dust has settled, only one faction can emerge victorious.\nCommand a wide array of devastating weaponry, issue city edicts and deploy tactical operations. Recruit hero units that possess distinct special abilities and can be equipped with items, ranging from advanced grenades to mighty relics of the past. As they become more and more powerful with each rank, they turn into true champions of your cause.\nFactions previews!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Proxy Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":51,"name":"APB Reloaded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f84/f84ce6dafbd0513b61b13e262dad0f54.jpg","description":"APB or All Points Bulletin is an ambitious MMORPG, which anticipated, and perhaps influenced the appearance of GTA Online. The game shares the title with 1987 arcade, but they are not connected whatsoever. At first, the game costed money to play, then it was shut down, and after the restart, it began to use the format of free-to-play. In the spring of 2017, seven years after the original release, the game was released on the PlayStation 4.\n\nThe player is offered to join one of the factions: Enforcers or Criminals. Inside the factions, players can form subgroups for joint missions. The game takes place in the modern city of San Paro, in the streets of which there is constant fighting between the factions. Missions are a task for two opposing teams, using a full arsenal of weapons, a fleet of cars and other vehicles. The character is controlled from a third person perspective, weapons and equipment are bought in terminals, similar to vending machines. The primary goal of the game is to be the strongest man in the neighborhood.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":20826,"name":"Sacred 2 Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/91c/91c1591ddd37ca1b8c1d3f5cd2fcde72.jpg","description":"Sacred 2 Gold is a complete edition of the role-playing video game Sacred 2 which includes Sacred 2 Fallen Angel and a famous add-on Ice and Blood. The game takes place in the world of Ancaria where the player has to defeat countless dangerous enemies, capture powerful weapons and valuable treasures. The story of Sacred 2 Fallen Angel is about a mysterious energy source which is spreading in the world of Ancaria. The world is on the brink of destruction, there is chaos everywhere, and the mystic energy source leaves nothing behind but mutation and terror. It happened that this energy source became an edge on which everything is balanced. There are powers of Light and Shadow that are destined in a battle that could end the fabric of life. \nSacred 2 Ice and Blood expands the world of Ancaria with two new regions, a new playable character and new items, enemies, weapons and missions. The game differs with its amazing and detailed dungeons to explore, either light or shadow sides to choose, thousands of weapons and armor sets and more than 500 new quests","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":327227,"name":"Outriders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/faa/faa6a4a7a2e57faf2960329630aee211.jpg","description":"Outriders is a 1-3 player, drop-in-drop-out, co-op shooter, set in an original dark and desperate sci-fi universe. This brand new IP is developed by People Can Fly the creators of Gears of War Judgement and Bulletstorm and is published by Square Enix External Studios and is releasing Spring 2021, on Xbox One, PlayStation 4 and PC.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"People Can Fly","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":54718,"name":"Quake III Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2f2/2f2eb93e32d400677b0b27f4686f7b4f.jpg","description":"The third game in the genre of first-person shooter in a series of Quake. Unlike previous games in the series, the game is focused on a multiplayer mode, and does not have a full-fledged single-player campaign.\n\n###Previous and next games of the series\nQuake (1996)\nA first-person shooter, the player controls a nameless fighter, the base of which was attacked by enemies whose common name is Quake.\n\nThe game was a breakthrough in 3D video game technology - implemented a fully three-dimensional world.\n\nThe game has a single player campaign and multiplayer mode. The first Quake is the ancestor of cybersport, the major championships began to be held on the basis of the game.\n\nThe game code was made publicly available, which led to the appearance of a large number of add-ons not related to the creators of the game. There are also official additions.\n\nQuake II (1997)\nQuake II, despite the name, is not a continuation of Quake and its additions. The plot of Quake II tells the story of the confrontation between people and the race Stroggs. The player controls the soldier Bitterman.\n\nDespite the similarities in weapons and objects, the enemies and the storyline have nothing in common.\n\nInitially, the creators did not plan to call the game Quake, but due to the fact that many of the names that came to their mind were already used somewhere, they had to dwell on the old name. In addition, their decision was also influenced by the fact that by the time Quake, as a trademark, was able to ensure commercial success.\n\nQuake IV (2005)\nThe game continues the story of the battle of humanity with the Stroggs. Spaceships and military equipment of earthlings borrowed from the movie \"Star Troopers\", and the overall design of the Stroggs and their equipment (especially living computers with human body parts) is made in the style of Giger's biomechanoids.\n\nThe player acts as a paratrooper of Rhino squad involved in a counterattack on the capital planet of the Stroggs.\n\nAfter Quake IV were created:\nEnemy Territory: Quake Wars (2007) is a game in the world of Quake II and Quake IV, events take place 50 years before the events of Quake II. The game is notable for the use of ground and air vehicles.\n\nQuake Champions (2017)\nThe game introduces a series of champions - characters with unique abilities. There are fourteen Champions in this game.\n\n###Quake III Arena (1999)\nThe game emphasizes the multiplayer mode. There is a single mode in the game, but it is not full-fledged and consists of battles with bots.\n\nQuake III Arena Story\nThe mysterious race Vadrigar built the Arena Eternal, and arranges fights for the best gladiators of the world there - this is the favorite entertainment of this race. Gladiators do not die completely - they are reborn, enriched by the experience of the battle, even if the battle was lost.\n\nQuake III Arena Multiplayer Basic Modes\nFree For All - classic Deathmatch;\nTeam Deathmatch - team battle;\nTournament\nCapture The Flag\n\nAfter the discovery of the code, numerous modifications appeared and gained popularity, including DeFRaG - a modification focused on performing various tricks.\n\nThere is an official addition to the game Quake III: Team Arena, and the updated version of the game called Quake Live (2010).","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"id Software","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"}]},{"id":13777,"name":"Sid Meier's Civilization IV: Colonization","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31d/31d70d348acf9924a218ddcb80c171be.jpg","description":"Sid Meier's Civilization IV: Colonization is a remake of  the famous turn-based strategy game Sid Meier's Colonization which was released in 1994. The game was totally remade with the Civilization IV engine. In the game player controls settlers from four European nations – Spain, England, France and Netherlands. Sid Meier's Civilization IV: Colonization takes place in the period between 1492-1792. The game is mostly about bilding your colonies, army, declare independence from their mother country and defeat enemies who are sent by the king to destroy rebellion. There are four different colonies, four kingdoms and eight different tribes in the game. Player should manage economics, built and expand their cities and manage diplomacy in order to win. Also, there is trade mechanic, which has to be used when player has the required amount of goods which then are sent to Europe or are traded with natives for other goods or gold. Things like silver or ore can be mined in order to make tools which then can be turned into guns.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":52384,"name":"The Messenger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16c/16c1f5e91a061e064f373406164d1e40.jpg","description":"The game moves between 8-bit and 16-bit art styles, allowing the player to move between the two by going forward or backwards in time. As a demon army besieges his village, a young ninja ventures through a cursed world, to deliver a scroll paramount to his clan’s survival. What begins as a classic action platformer soon unravels into an expansive time-traveling adventure full of thrills, surprises, and humor.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sabotage","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":17600,"name":"Sniper: Ghost Warrior 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50e/50e2785bd341c8c3a01b4fdac011b2e0.jpg","description":"A sequel to Sniper: Ghost Warrior is based on CryEngine 3 and is somewhat similar to such tactical shooters as Crysis.\n\n###Plot\nThe protagonist is Cole Anderson, a gruff American ex-Marine, who accompanies a CIA agent on a mission. Their goal is to capture a group of mercenaries who are trying to obtain a biological weapon of mass destruction. The villain, former Russian spy Merinov, is going to sell the weapon to a terrorist organization that plans to provoke a nuclear war. The protagonist will perform a number of stealth military operations in Philippines’ jungle and in the highland of Tibet. There are also playable flashbacks about Anderson’s experiences during the Bosnian conflict that provide more details about his past with Merinov.\n\n###Gameplay\nJust like its name suggests, the game puts a strong emphasis on sniping. There are many mechanics that aim to make the marksmanship realistic. Each bullet’s trajectory strongly depends on the wind and distance to the target. There’s a HUD that displays the intensity and direction of the wind, allowing the player to aim better. A red dot indicates where the bullet will hit, though this can be disabled in a higher difficulty level. The character’s physical state also influences his accuracy, and after running, he has to rest for a while before shooting. Stealth is also a vital component of the gameplay. Anderson has to sneak past enemy soldiers and cannot survive an open encounter against multiple opponents.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"City Interactive","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":14929,"name":"Rome: Total War - Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2c/d2c1101d697afb7a3c7b5b27c104a47d.jpg","description":"Once the Roman Empire is under your command, don't lay down your sword just yet - the Barbarians are coming. With two award-winning titles from the esteemed Total War series, you'll have twice as many obstacles and opportunities to control and conquer the greatest empire ever known to man.\nThe Collection Edition includes:\nRome: Total War Guide one of three noble Roman families on a century spanning quest to seize control of the Roman Empire.\nRome: Total War - Barbarian Invasion\n(official expansion pack to Rome: Total War) Witness the decline of Rome as Barbarian hordes attack, forcing a bitter internal struggle between rival factions.\nVoted 2004 Best Strategy game by IGN, GameSpy and GameSpot.\nFight alongside or against history's greatest leaders such as Julius Caesar, Spartacus, and Hannibal to expand or destroy the Roman Empire.\nLay siege against the Romans as Attila the Hun, fearful Saxons, or other savage factions using signature weapons and abilities.\nCommand warrior-tested legions in cinematic epic battles with thousands of soldiers on-screen at once.\nA century-spanning campaign charges players with strategically managing the economic, civil, religious and military arms of their empire.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Creative Assembly","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":8444,"name":"Halo 5: Guardians","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/77f/77fb27e5b7ec6984f43a70a289376e6a.jpg","description":"Halo 5: Guardians is an FPS game developed by 343 Industries.\n\nSet in 2558, 8 months after Halo 4, the plot revolves around two fireteams. Blue Team with Master Chief acting as a commanding officer and Fireteam Osiris led by Jameson Locke. Blue Team goes AWOL in order to find Master Chief's old comrade while Osiris is sent after the Team on a capture and retrieve mission.\n\nLike in previous titles, the players control a SPARTAN, biologically engineered supersoldiers that use the MJOLNIR battle armor. This armor has energy shields that deplete upon receiving any damage but regenerate after a certain amount of time. The players are capable of carrying two firearms at a time, but it is possible to pick up every weapon dropped by the enemy.\n\nUnlike the previous installments where the player could only be followed by NPCs in singleplayer but had the ability to play in a separate co-op mode, Halo 5 takes the concept further and now every of four fireteam members can be controlled by a player. The game does not feature any autonomous features like split-screen on LAN play.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"343 Industries","platforms":[{"id":0,"name":"Xbox One"}]},{"id":4796,"name":"Stacking","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9db/9db5d5ae17b26e26174d289e2654ed60.jpg","description":"From Tim Schafer’s Double Fine Productions, explore a vintage world inhabited by living Russian stacking dolls as you jump into more than 100 unique dolls and use their special abilities to solve a wide variety of puzzles & challenges. Play as Charlie Blackmore, the world’s tiniest Russian stacking doll,  and embark on an adventure to rescue Charlie’s family from the nefarious industrialist known only as the “Baron.” This imaginative 3rd person puzzle adventure game will take you on a journey from a bustling Royal Train Station to a high-flying Zeppelin as you collect unique dolls and matched stacking sets to display in Charlie’s secret hideout, where you chronicle your adventures.\nContinue the Stacking adventure with The Lost Hobo King DLC pack, included free in the PC version!\nIn the Lost Hobo King, the first downloadable expansion for Double Fine’s Stacking, players once again assume the role of Charlie Blackmore, the world’s smallest Russian stacking doll. Charlie travels with his hobo friend Levi to the mysterious kingdom of Camelfoot, the mythical resting place of lost hobo king and his crown. Charlie must help Levi’s uncle, Rufus Ryken, reclaim his rightful throne by solving three tests of valor and reawakening the hobo blacksmiths of old. Only then can the crown be reforged, enabling Rufus to become king and unite the fractured hobo people under one sardine. The Lost Hobo King features a complete adventure with several new challenges, each with multiple solutions, an all new assortment of unique dolls with engaging abilities, and a new round of hi-jinks to discover and make trouble with. Only the worthy can reclaim the crown of Camelfoot!\nFeatures an all new concept art browser exclusive to the PC version!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":3767,"name":"Assassin's Creed Freedom Cry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2f/d2f925d2c1518d45c45f91cc32afce68.jpg","description":"Assassin’s Creed Freedom Cry is a standalone expansion for Assassin's Creed IV: Black Flag and set 12 years after its events. The game introduces a brand new character - a pirate called Adéwalé who joins the Order of Assassins in order to stop slavery in Haiti. He confronts the local government and starts to sabotage their actions.\n\nFreedom Cry, like the original game, is a pirate-themed title with an accent on sea battles. The story is split into nine missions. You can explore an open-world sea map and attack ships to set slaves free. The ship development system and the amount of weaponry are reduced compared to Black Flag. The game also features land missions and side quests that allow you to upgrade your character and get additional bonuses. You even can recruit unchained slaves to your crew so they will help you in battles.\n\nFreedom Cry follows the traditions of the series and combines stealth elements, used mostly during city missions with open combat. You have several weapon types including swords, guns and throwing knives to distract enemies.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":304953,"name":"Assassin's Creed III: Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c69/c69e0952cdea6baa7cf0739b2e7792fb.jpg","description":"Relive the American Revolution or experience it for the first time in Assassin's Creed® III Remastered, with enhanced graphics and improved gameplay mechanics.  Plus, Assassin's Creed® III Liberation Remastered and all solo DLC content are included.\nIncludes: Assassin's Creed® III Liberation and all original solo DLC, including The Tyranny of King Washington.\nEnhanced graphics, now featuring 4K resolution, new character models, polished environment rendering, and more.\nGameplay mechanics have been revamped as well, improving your experience and your immersion.\nFight for freedom! As the American Colonies are about to revolt, secure liberty for your people and your nation.\n1 player\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2019 Ubisoft Entertainment. All Rights Reserved. Assassin’s Creed, Ubisoft, and the Ubisoft logo are registered or unregistered trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":15604,"name":"Kathy Rain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ca/3ca24180cb8d9780d45f394f685fd9d2.jpg","description":"Set in the 90's, Kathy Rain tells the story of a strong-willed journalism major who has to come to terms with her own troubled past as she investigates the mysterious death of her recently deceased grandfather. Armed with her motorcycle, a pack of cigs, and a notepad, Kathy begins to delve into a local mystery surrounding her hometown that will take her on a harrowing journey full of emotional and personal turmoil.\n\nAs she follows a trail of clues he left behind, questions emerge… What was Joseph Rain really looking for that night all those years ago? What turned him into a mere shell of a man, confined to a wheelchair? What secret did a suicidal young artist take with her to the grave, and why are so many people in Conwell Springs going mad? The truth is dark and sinister…\n\n• 320x240 (4:3) resolution with crisp pixel art graphics\n• 4,000+ lines of dialogue\n• Full English voice acting directed by Wadjet Eye Games' Dave Gilbert\n• Original soundtrack\n• 40+ hand-drawn environments\n• Compelling narrative with eerie plot set in the 90's","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Raw Fury","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":58732,"name":"FIFA 19","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b59/b59560a7277b16b53e4786b4abe45baa.jpg","description":"Powered by Frostbite™*, EA SPORTS™ FIFA 19 delivers a champion's caliber-experience on and off the pitch. Led by the prestigious UEFA Champions League, FIFA 19 offers enhanced gameplay tools that allow you to control the pitch in every moment with unrivaled ways to play. FIFA 19 includes a dramatic finale to the story of Alex Hunter in The Journey: Champions, a new mode in the ever-popular FIFA Ultimate Team™, and more. Champions Rise in FIFA 19.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts Vancouver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3223,"name":"Everybody's Gone to the Rapture","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c64/c6463b164c3eab0c96e1fad70c8793e5.jpg","description":"The world ended 37 minutes ago\r\nIt is time to begin\r\nYaughton, Shropshire. 06:37am 6th June 1984.\r\nDeep within the Shropshire countryside, the village of Yaughton stands empty. Toys lie forgotten in the playground, the wind blows quarantine leaflets around the silent churchyard. Down on Appleton’s farm, crops rustle untended. The birds lie where they have fallen.\r\nStrange voices haunt the radio waves as uncollected washing hangs listlessly on the line. The televisions are tuned to vacant channels. Above it all, the telescopes of the Observatory point out at dead stars and endless darkness. And someone remains behind, to try and unravel the mystery.\r\nImmerse yourself in a rich, deep adventure from award-winning developer The Chinese Room and investigate the last days of Yaughton Valley. Uncover the traces of the vanished community; discover fragments of events and memories to piece together the mystery of the apocalypse.\r\nFeaturing a beautiful, detailed open-world and a haunting soundtrack, Everybody’s Gone to the Rapture is non-linear storytelling at its best.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":50839,"name":"Baba Is You","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0bc/0bca854021e14ffa9005a85c4567d25c.jpg","description":"Baba Is You is a puzzle game where you can change the rules by which you play. In every level, the rules themselves are lying as blocks you can interact with; by manipulating them, you can change how the level works and cause surprising, unexpected interactions! With some simple block-pushing you can turn yourself into a rock, turn patches of grass into dangerously hot obstacles, and even change the goal you need to reach to something entirely different.\nThe game has over 100 levels that experiment with the game's mechanics in a multitude of ways, requiring the player to understand and manipulate the rules of the game and figure out devious ways to make the objects in the game world interact. The game will also feater a level editor for making your own levels and campaigns.\nThe game was originally created for & won the Nordic Game Jam 2017. The event had 142 entries in total. The game was made using Multimedia Fusion 2 by Clickteam.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hempuli","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":700,"name":"Lara Croft GO","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/664/6641c8e3872da0b3e6a853ad7b6a37b0.jpg","description":"Lara Croft GO is a turn-based isometric puzzle game drawn in material design style. This is the fourth spin-off of the enormous Tomb Raider series.\n\n###Gameplay\nThe game ties turn mechanics and adventure game — even though it sounds contradictory, this merger works. So, the game features usual Tomb Raider gameplay which is: raiding tombs, exploring crypts and fighting multiple enemies. \nDuring forty levels divided into five chapters the player must take turns — he can go into one of four directions — left, right, up and down. The time given for turns is unlimited, so it is the move-when-ready type of title.\nGoing through levels namely means learning foes' moving patterns and memorizing the locations of all traps within the level. Lara can climb cliffs and hang down from the ledges to avoid being detected by opponents. The new types of traps and things to avoid are evolving with every next level. \nGO also features “look-for-objects” genre as the player is allowed to collect vases throughout the levels\n\n###Plot\nThe narrative in the title transfers itself via visuals, not dialogues, so it is hard to compose any meaningful story with it. The absence of subsequent storytelling may be explained with the hints mechanics — it is utterly troublesome to translate a story arc if the help may be requested at any time and level would be over in no time.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Square Enix","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":616697,"name":"A Plague Tale: Requiem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd0/cd074f3f6045297cda9ad077273c09b6.jpg","description":"Far across the sea, an island calls…\nEmbark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces.\n\nAfter escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo’s curse.\n\nBut, when Hugo’s powers reawaken, death and destruction return in a flood of devouring rats. Forced to flee once more, the siblings place their hopes in a prophesized island that may hold the key to saving Hugo.\n\nDiscover the cost of saving those you love in a desperate struggle for survival. Strike from the shadows or unleash hell, overcoming foes and challenges with a variety of weapons, tools and unearthly powers.\n\n● Sequel to the award-winning adventure A Plague Tale: Innocence\n● A spectacular grounded tale twisted by supernatural forces\n● Use a variety of tools, sneak, fight, or unleash hell and rats\n● Stunning visuals combine with an enthralling score","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Asobo Studio","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":3437,"name":"Apotheon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e49/e497cca0e21625b8e36614399f0b970e.jpg","description":"The Gods of Olympus have abandoned humanity, leaving you to perish without their benevolence. Take up arms against the Gods, climb Mount Olympus, and take their divine powers for yourself to ensure mankind’s survival!\nApotheon is a fast and brutal 2D action game with a striking art style and heroic narrative based on Ancient Greek Mythology.\nFeatures:\n-Brutal and bloody bronze-aged combat! Slay your enemies with swords, spears, arrows, and other ancient weapons of war.\n-Explore the massive open world of Mount Olympus! Battle mythical beings and search for divine treasure across the Forests of Artemis, the Palaces of Apollo, and other sanctuaries of the Gods.\n-Guide the rise of Nikandreos, humanity’s last hero. Interact with a colourful cast of fully voiced legendary characters throughout a rich single-player experience.\n-Challenge your friends to single combat! In one versus one local multiplayer, pit your skills against other would-be heroes of Greece.\n-Learn a little about Greek Mythology! Apotheon tries to stay true to its source material. Read an excerpt from the Iliad about Diomedes before you stick a Xiphos through his Aspis.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alientrap","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":28195,"name":"Wargroove","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/892/892181b6c1acd9f527e7346137b0e1a3.jpg","description":"Wargroove is a high fantasy game that was strongly inspired by such turn-based tactics games as Advance Wars and Fire Emblem. It features minimalist pixelated visual style and a 2D top-down view. The game is made for Nintendo Switch and aims to recreate the retro atmosphere of the old games from the early 2000s handheld consoles. \n \n###Gameplay\nThe player assumes the role of one of the commanders. There are twelve unique commanders, each of them has a distinct personality, motivation, and a personal set of missions. The player navigates his or her commander on the map and fights the enemies. New commanders can be unlocked as the player progresses in the game. The commanders belong to four different factions: Cherrystone Kingdom, Felheim Legion, Heavensong Empire and Floran Tribes (the latter also featured in Starbound). \n\n###Modes\nWargroove includes a variety of modes, such as single player, cooperative multiplayer and player versus player, in both online and local modes. The multiplayer modes allow up to four players to participate in a game. The game allows the players to customize the rules and other options in this mode.\n\nThe game also includes a map editor that lets the players make their own campaigns. The editor features the option to interlink the various missions to create your own non-linear campaigns.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Chucklefish","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":16922,"name":"RACE 07","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e99/e99eda57f6f7292d53fcf6687362bb41.jpg","description":"Race 07 is a realistic racing simulator from the Swedish studio SimBin. The game is a continuation of Race - The Official WTCC Game, released in 2006. As in the first game, the licensed World Touring Car Championship (WTCC) is also available here. There are almost no changes in the game, in comparison with the previous part. \n\nThe game has more than 300 cars, divided into 9 classes, and 14 tracks placed around the world. The calendar of the game mimics the racing season 2006/2007 and includes two new city routes. The game is available on Steam, for the multiplayer s site account is required.\n\nRace 07 can not boast of detailed physics, popular manufacturers and realistic graphics. The game is trying to compensate for its shortcomings with an exclusive license and the availability of the Formula-3000 fastest in the game. The released DLCs adds new tracks, cars and championships. The game supports user modifications.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SimBin","platforms":[{"id":0,"name":"PC"}]},{"id":13778,"name":"Civilization IV: Beyond the Sword","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/740/7400097027269944f4fd3ee597cb93d8.jpg","description":"Civilization IV: Beyond the Sword is the second expansion of well-known turn-based strategy video game Civilization IV made by Firaxis Games. It includes 11 new scenarios, 10 new civilizations, and 16 new leaders. The game takes place in the times when gunpowder was invented. This expansion offers features like corporations, espionage, random events, advanced starts, expanded space and diplomatic victory. It also includes much more improved AI, more visually detailed units and new, improved behavior of colonies. This expansion is quite famous for its huge amount of various different mods, official and unofficial. Civilization IV: Beyond the Sword offers a broader gameplay, for example now players have option to play as any leader-civilization combination, also now players can only trade away theirs researched technologies. Once player finds specific religion-founding technology he or she has a right to choose any of the religions.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1320,"name":"Dead Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/65d/65d65ee902f66bdc01d8b6c3d2a0a588.jpg","description":"Dead Rising was a specific iteration of an open world action horror game that is considered to be a beat ‘em up. The difference is that it’s a zombie survival with horror elements and crafting mechanics. The protagonist, Frank West, is sneaking into the Willamette to gather information on the reasons why is it being sealed by the National Guard. After landing on the roof of the big shopping mall, Frank asks the pilot to pick him up in 72 hours. Inside Frank learns of a massive zombie outbreak, and a threat of it nationwide infestation.\nIn order to complete missions, the player will have to explore the shopping mall and fend off the zombies. Frank has access to more than 250 items that can be used as weapons, ranging from low to high damage. Some of the weapons might have environmental properties, like being heated on the open fire. All weapons can be used a limited amount of times in order to make the player explore and search for random encounters, with struggling survivors that need saving, or “psychopaths” that act as mini-bosses. The game uses RPG elements, where the player earns Prestige Points that can be spent to improve skills and attributes. As a photographer, Frank has a camera that can be used to take pictures, that are rated and their rating score is converted into the Prestige Points.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":44641,"name":"PC Building Simulator","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfe/cfe992104dbfc755f6ab78fa2fa63f21.jpg","description":"PC Building Simulator puts you in charge of your very own PC Building and Repair shop, where you must complete challenges to build your reputation and progress through your PC Building career.\nExperiment with a large array of detailed and accurately rendered components from motherboards to CPU's that respond just as they would in real life. Learn how to install these components, using tools such as thermal paste, cables and standoffs to prevent short circuits and breakdowns. Fully animated installations let the players see exactly where each part slots into the computer so you can learn to build your very own gaming PC in real life.\nPC Building Simulator has had viral success with over 400,000 demo downloads and is coming to Steam later this year!\nLearn how to build high-end gaming PCs without purchasing costly parts or the risk of electric shocks!\nWe are in discussions with your favourite hardware partners to bring their components into the game so you can build the rig of your dreams.\nRun a PC building and repair business and progress through the career mode. Fix customer’s PCs, perform upgrades and build rigs to strict specifications all while balancing your books and beating the competition!\nThe tutorial guides players step by step through the PC building process and uses detailed instructions to explain each component and its function.\nTake part in challenges – build to specification, overclock your PC and more!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Claudiu Kiss","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":58782,"name":"Wolfenstein: Youngblood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c64/c64d2f63cabeab9126693b7d39539c8d.jpg","description":"Wolfenstein: Youngblood is a spin-off installment of the Wolfenstein series. It fills the gap between Wolfenstein II: The New Colossus and the upcoming Wolfenstein 3. \r\n\r\n###Setting\r\nLike its predecessors, Wolfenstein: Youngblood is set in an alternate reality, in which Nazi Germany won World War II by using anachronistically developed tech. The Third Reich managed to conquer Europe and North America. The spin-off is set in an alternate 1980. Nineteen years have passed since the events of Wolfenstein II: The New Colossus, which are now known as the Second American Revolution. The US is now free from German occupation, but the battle continues as Nazi still control most of Europe. \r\n\r\n###Plot\r\nThe game's main protagonists are Jessica and Sophia, the twin sisters and daughters of the Wolfenstein series' trademark protagonist, war veteran B.J. Blazkowicz. Their father trained them as fighters and shooters, and as they reached adulthood, they joined the Global Resistance to fight against the Nazis. When Blazkowicz goes missing on a secret mission in the Vichy France, the twins set out to search him in the Nazi-occupied Paris. They also assist the French Resistance in fighting the occupants.\r\n\r\n###Multiplayer\r\nThe game allows two players to cooperate online by controlling two sisters at once as they walk through the story campaign.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":257252,"name":"Trine 4: The Nightmare Prince","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2a/b2acbc0c913c91f8d0cd37b8cea09df5.jpg","description":"The Trine series returns to the magic of 2.5D with Trine 4: The Nightmare Prince! The three heroes of the best-selling adventure series are back, sent on a quest to retrieve the troubled young Prince Selius. Amadeus the Wizard, Pontius the Knight, and Zoya the Thief are joined together once again on a thrilling quest through fantastical fairytale landscapes teeming with danger.\n\nTrine 4 reaches new heights in the series, bringing the most complete 2.5D gameplay experience ever to fans and new players alike.\n\nKey Features\n– Gorgeous, 2.5D landscapes. Explore uniquely designed levels in beautiful, 2.5 dimensions, from breathtaking ruins and haunted tombs to tranquil birch groves and blueberry forests.\n– Local and online multiplayer. Play with up to 4 players online or in local co-op.\n– Captivating storytelling. Follow the story of a haunted prince as you journey through magical fairytale landscapes inhabited by friendly creatures, as well as a host of nightmarish foes.\n– Dynamic puzzle-solving. Solve puzzles – solo or with friends – that feature fire, air, light, magnets, electricity and more, with challenges tailored to the number of players.\n– Abundant skill trees. Unlock diverse abilities and amazing new skills.\n– Completely revamped combat system. Experience the heroes’ own bloodcurdling nightmares in boss fights featuring an enriched combat system with fresh challenges and thrilling action!\n– Enchanting soundtrack. Enjoy a wondrous soundtrack with songs that bring life to each new environment.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Frozenbyte","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":9845,"name":"Total War: WARHAMMER","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/599/599b2d9bf7815fe2615d9527cccf7725.jpg","description":"Total War Warhammer is a combination of two franchises, which brings fantasy violence of Warhammer into the combat mechanics of historical Total War series. The turn-based strategy with real-time tactical battles between clashing armies. The story campaign begins with the newly elected Emperor attempting to reunite the shattered kingdom and bring peace under his control.\nOn the release date, Total War Warhammer offered four playable factions at launch, including Empire, Greenskins, Dwarves and Vampire Courts, but eventually, Chaos and Bretonnians were added as DLC. In total, there’s 13 DLC, some of which are free. Unlike other Total War titles, Warhammer includes the ability of special faction agents to participate in battles in order to give your army an advantage, a wider variety of animations and flying units such as dragons. Addition of magic with unique spells for each faction, which sets Total War Warhammer as a different title from any other Total War game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":244722,"name":"Thronebreaker: The Witcher Tales","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/157/157001cc7d47ff89ac3082d4bf0373d0.jpg","description":"Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.\r\nCrafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran queen of two Northern Realms — Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath, and set out on a dark journey of destruction and revenge.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":703,"name":"LET IT DIE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d4a/d4a85e0d7676e4f9bce23f349e44e75e.jpg","description":"###Crazy action\r\nDecember 3, 2016, on PS4, a single-user exclusive games called LET IT DIE was released. It was developed by the Japanese developer Grasshopper Manufacture. The release of the game on the PC is scheduled for the end of 2018. In short, what is waiting the player can be called a crazy incendiary hack and slash with the third person perspective, where the endless action and anime style graphics converged. Some aspects of the game are very reminiscent of Dark Souls.\r\n\r\n###The story\r\nThe story revolves around the corpse, which was suddenly revived. And yes - this is our main character if you can say so. Or the heroine - it depends on who you choose at the start screen. Anyway, if you die, you can just buy yourself a new shell and go on. There are a lot of locations to explore in the game. It depends on the player - exactly how to proceed - constantly using new bodies or to save money and after death to resurrect your favorite body. Note that it is very easy to die in this game. As for the goal - the player has to climb the tower, where at the very top lies the key to saving the whole world. There are more than forty floors in this tower. But this is only part of the story.\r\n\r\n###Change of plans\r\nInitially, the game supposed to be called Lily Bergamo, but at the Electronic Entertainment Expo 2014 conference, the name was changed to LET IT DIE. The development lasted no less than three and a half years. Also, the release date was unknown at some point, but developers managed to deliver. It came out on the model of Free to play, which attracted attention and received a lot of people who wanted to play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":14397,"name":"Sven Co-op","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a3/7a3f1c95facb864c76b975bbf807a7a8.jpg","description":"Sven Co-op is a cooperative multiplayer modification for the first-person shooter Half-Life developed by Daniel Fearon. In 2013, Valve allowed the team to publish the mod on Steam as a standalone modification.\n\n###Gameplay\nThe gameplay of Sven Co-op heavily resembles the same of the original Half-Life, so it is highly recommended to be familiar with its gameplay and to complete its tutorial level. Sven Co-op supports Half-Life's singleplayer but changes it up a bit to improve upon the cooperative aspect of the game.\n\nThe levels of Sven Co-op are divided into missions and are usually separated from each other. Many missions take place on several maps with some of them being fused into one. The objective of most levels is to find an exit or complete a specific task - it is not necessary to kill any enemies whatsoever. The maps are used using a variety of settings, starting with Black Mesa and ending with a modern urban war one.\n\n###Changes in comparison with the original game\nThere are only 12 changes in the original Half-Life gameplay, yet they do not drastically affect the gameplay. Most of the changes were made to the NPCs and the NPC following system. Now you can take any friendly NPC with you, some of the NPCs will even heal you. Several small changes also affect the enemy behavior, for example, the players can no longer free themselves from the barnacles. A teammate is needed to get you out.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sven Co-op Team","platforms":[{"id":0,"name":"PC"}]}]