[{"id":702368,"name":"Jigsaw Puzzle Dreams","genre":"Simulation","price":0.0,"description":"Relax in a sunlit room with soft natural light. Let your troubles drift away as you piece together enchanting vibrant puzzles.\nEvery time a new puzzle is started the pieces are cut from scratch to be a new experience.  No two pieces are alike!\nRandomly generated pieces make it easy to match by shape or colors.\nChoose your difficulty.  Select presets from 100, 200, 600, and 1000 pieces.  Or type in any number you want to test your limits! (bigger tables will be provided)Features:Randomly generated pieces\nPuzzles of any size\nBeautiful Images and Illustrations chosen for Jigsaw Puzzles\nRealistic Cozy Environment\nCustomizable room wallpaper, floor, table, and more","imageUrl":"https://media.rawg.io/media/screenshots/2d7/2d7ce7e2738915b4b3a202ea27e3aebb.jpg","releaseYear":2021,"developer":"That's Nice Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":688869,"name":"Animal Shelter: Prologue","genre":"Adventure","price":0.0,"description":"ADD ANIMAL SHELTER - FULL GAME TO WISHLIST TO GET UPDATES\nhttps://store.steampowered.com/app/1239320/Animal_Shelter/\nhttps://store.steampowered.com/app/1661280/Police_Shootout_Prologue/\nhttps://store.steampowered.com/app/1286880/Ship_Graveyard_Simulator/\nAbout the Gamehttps://store.steampowered.com/app/1286880/Ship_Graveyard_Simulator/\nhttps://store.steampowered.com/app/1108750/Timerunner/\nSave our four-legged friends!\nIn the prologue of the game, you will be able to learn some of the mechanics that will appear in the full version of the game. Animal Shelter Prologue grants you the opportunity to tackle the challenging but also highly rewarding task of running a refuge for strays and rescues. Witness firsthand how much effort goes into helping abandoned and injured animals as you handle a number of tasks necessary for your shelter to operate smoothly.\nClean Them\nIn the Animal Shelter Prologue, you will be able to take care of your proteges, one of the most interesting mechanics that will appear in the prologue as well as in the full version of the game is cleaning and taking care of these pets. There are many steps you will need to take to improve your health, and good hygiene is the first. Get your hands dirty a little so that their paws stay clean and their spirit rises high.\nProtect Them\nIn the prologue of the game, one of your main tasks is to keep your pets safe. Thanks to the prologue, you will get to know each animal from a slightly wild side and it is your job as a responsible guardian to prevent it from exploding in any unpleasant way. Manage the animals well and keep the inhabitants of your refuge calm. This is one of the greater challenges that await you in the prologue of the game!\nTake them for a walk\nOne of the most interesting mechanics in Animal Shelter Prologue are walks with pets! In the prologue of the game, you will be able to take your pets for a walk! What better way to burn off all that excess energy than a good, old-fashioned trot out in the fresh air? Keep your animals stimulated and entertained. You can be sure they'll be starved for attention!\nExtend\nAnimal Shelter Prologue will present many challenges for you. Thanks to the ability to play the prologue, you will be faced with additional challenges. In the prologue of the game, the player will not only face the challenges of caring for animals, but also managing his shelter. Make sure to turn them into opportunities as you invest in your facilities and expand according to your growing needs.\nConvince them\nIn Animal Shelter Prologue you will be able to experience part of the full game. The prologue of the game will be an amazing experience for players, before what awaits them in the full version of the game. Your ultimate goal in prolgou will be for the animal to go to a completely new, loving home. Take care of your rescue operations and make sure that they will be adopted by visitors to the shelter.","imageUrl":"https://media.rawg.io/media/screenshots/372/37226c7573dcc153e11c7fe9c6c292c6.jpg","releaseYear":2021,"developer":"Games Incubator","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":669261,"name":"Voice of Cards: The Isle Dragon Roars","genre":"RPG","price":0.0,"description":"Voice of Cards: The Isle Dragon Roars is an RPG set in a world of swords and sorcery, told entirely through the medium of cards.\nEnjoy an all new, yet appealingly nostalgic gaming experience from YOKO TARO (Creative Director), Keiichi Okabe (Music Director), Kimihiko Fujisaka (Character Designer.)","imageUrl":"https://media.rawg.io/media/screenshots/7e4/7e47049a2cde277670f6fd8d6e9cee32.jpg","releaseYear":2021,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":650955,"name":"There Is No Light 616","genre":"Action","price":0.0,"description":"https://store.steampowered.com/app/1132980/There_Is_No_Light/\nThere Is No Light 616 is a brutal action-adventure game set in a dark Underworld under the auspices of the mystical Church of the Great Hand. Behold the majesty of the Central Station and test your fighting skills in the Arena of Death.\nThe demo contains 3 full-scale locations, a boss fight and an exclusive arena mode.FeaturesAshes of the Old WorldVisit human settlements and unearthly ruins to unveil the secrets of the past.\nFight for Your LifeBlast your way through the hordes of various enemies.\nFilled with RageThe Rage system forces you to play aggressively. You won’t hide from the battle.\nWeapons of the UnderworldCreate your own playstyle with different weapons and upgrades.\nNon-linear NarrativeExplore the story the way you want.\nGood IntentionsThe world around you changes according to your actions.\nDanger in the ShadowsEncounter dangerous and powerful bosses.","imageUrl":"https://media.rawg.io/media/screenshots/08f/08fc67776b24af80465bd6e36dad4904.jpg","releaseYear":-1,"developer":"Zelart","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":586060,"name":"GetsuFumaDen: Undying Moon","genre":"Action","price":0.0,"description":"GetsuFumaDen: Undying Moon combines intense roguelite hack-and-slash action with a stunning dark fantasy world, brought to life through the stroke of traditional Japanese art.\r\n\r\nAs the chosen leader and guardian of the land of the living, wield the otherworldy arsenal and powers of the Getsu clan as you descend deeper into the depths of Hell to eradicate the source of the cataclysm.\r\n\r\nDistinct Ukiyo-e Inspired Visuals\r\nInspired by the Japanese ukiyo-e art style, the world of GetsuFumaDen is as beautiful as it is deadly.\r\nVibrant, dynamic 2D animations bring the artistic world to life.\r\n\r\nBrutal, Larger than Life Boss Battles\r\nA reanimated demon lord, a colossal centipede, and a five-headed hydra are only some of the myriad massive and fearsome monsters and yokai standing in your way.\r\nDefend yourself against their relentless onslaught and emerge victorious to descend deeper into the depths of Hell.\r\n\r\nDynamic, Weapon-Based Combat.\r\nMaster the rythmn of intense sword fighting action: pacing and timings of movements are inspired by Japanese martial arts.\r\nUtilize the unique special moves of a wide range of weapon types including katanas, battle umbrellas and spears to outsmart your enemies.\r\n\r\nAuthentic Roguelite Action\r\nWhile death is not the end, the world of Hell lives and breathes, presenting new map layouts and challenges to overcome with each attempt.\r\nPermanent upgrades, customizable weapons, and variable level progression provide new opportunities and challenges for every run.\r\n\r\nImmersive Weapon Enhancement System\r\nThe crafting process gives you complete control over the ability to collect, enhance and unlock abilities of main and sub weapons.\r\nUnlock enhancements to your favorite weapons at each run, and get back in the action!\r\n\r\nSoul Devour Power-Up System\r\nCollect souls during each descent to power up in real time.\r\nUtilize the unique power-up system to dynamically and strategically select enhancements.","imageUrl":"https://media.rawg.io/media/screenshots/831/8315fd08b57b949c0f50a49cea8d46bb.jpg","releaseYear":2021,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":568863,"name":"Doom Eternal: The Ancient Gods - Part Two","genre":"Action","price":0.0,"description":"The Ancient Gods – Part Two is the epic conclusion to the DOOM Slayer’s Saga and the second campaign expansion to the critically acclaimed DOOM Eternal.\nYou denied the gods and awoke an ancient evil. Now rally the scattered Sentinel armies, lay siege to the last bastion of Hell, break through the fortress walls, and face the Dark Lord himself. The soul of the universe hangs in the balance.\nYour war against Hell ends here.EXPERIENCE THE END OF THE SLAYER’S SAGA\nExperience the epic conclusion to the DOOM Slayer’s saga. From the moment you were activated by Samuel Hayden at the UAC facility on Mars to the destruction of the Icon of Sin, all your battles have led to this. Prepare to siege Immora, the last bastion of the dark realm, challenge the Dark Lord in combat, and seal the demons within Hell for good.FIGHT ACROSS EPIC BATTLEFIELDS\nFrom the ruins of ancient Sentinel settlements and the cosmic wonders of the World Spear, to a devastated and overgrown city on Earth hiding a mysterious gateway, face Hell’s armies in never-before-seen locations as you fight your way to Immora, the last bastion of the Dark Lord protected by towering walls and powered by advanced technology.FACE CHALLENGING ENEMY VARIANTS\nFace new, deadly variants of demons. The Armored Baron wears special armor and uses a charged fist attack. The Stone Imp possesses a nearly impenetrable hide and prefers close combat. The Screecher is a zombie that empowers nearby demons when killed. The Cursed Prowler is a mutation with venomous, cursed claws. Exploit their weaknesses to destroy them.WIELD THE SENTINEL HAMMER\nDeliver more destruction with the Sentinel Hammer, an ancient weapon capable of stopping any demons caught within its shockwave. Use it to stun demons or combine it with the Ice Bomb or Flame Belch to extract much-needed health or armor.\n*The Year One Pass includes two campaign expansions: The Ancient Gods -- Part One and The Ancient Gods -- Part Two.","imageUrl":"https://media.rawg.io/media/games/fc3/fc3aec69b074d533c43a658ca1e90b0f.jpg","releaseYear":2021,"developer":"id Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":523126,"name":"Is It Wrong to Try to Shoot 'em Up Girls in a Dungeon?","genre":"Action","price":0.0,"description":"Take control of Aiz Wallenstein, Loki Familia's first-class swordswoman, and fight through hordes of enemies in this shoot'em up side-scroller based on DanMachi (Is it Wrong to Try to Pick Up Girls in a Dungeon?).\nAiz has powerful 'wind shots'\nChoose from a total of five support characters from the story and utilize their diverse shooting styles to complete the dungeon! You start off with just Tiona and Lefiya, and you unlock the other three once you've cleared the game.\nCollet power-ups that appear as you defeat enemies to gain power-ups, from speed to more lives, and get the best possible score!\nThe game has four stages, each with a boss, so get ready to change tactics and blast them away before trying again!\nThere are four difficulty levels, Easy, Normal, Hard and Death, giving a chance for beginners and experienced shooters alike to enjoy this free shoot'em up!","imageUrl":"https://media.rawg.io/media/screenshots/845/845b1448abc8a18faa262cbe0fed0375.jpg","releaseYear":2020,"developer":"MAGES","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":520354,"name":"My Name is Mayo 2","genre":"Simulation","price":0.0,"description":"To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.\nThis is a clicker game about a mayonnaise jar. It’s also creamy, dreamy and properly sequel-y! Right in the middle of the Next-Gen hurricane, comes the true next-gen game everyone’s been waiting for! ...Not this one; but it’s close! This... is the touching story about a disorganized Mayo jar, who just can’t get its sheets together.\nMayo is back, and it’s all about kicking butts and having an existential crisis. And it’s all out of butts! This second entry into the My Name is Mayo Cinematic Universe (not a thing btw) features the same real-life tapping mechanics and dozens of unlockable achievements as the original game. Be brave, be wise, unveil the stories and maybe... just maybe... you’ll learn from them... again.\nKey Features\n•\tUnlock 10 more random facts!\n•\tTake part in the 4 different, wacky stories. One of them features little minigames!\n•\tUnlock the 50 super-unique achievements!\n•\tFill the Mayo album with the 50 ultra rare, 1950’s inspired, collectable cards!\n•\tPointlessly compete with your friends and the world with the online “clicks” leaderboards!\nFrequently Asked Questions\nQ: Wait a minute... Is this a sequel to My Name is Mayo?\nA: Yes.\nQ: Why would you do such a thing??\nA: Isolation in 2020 has been interesting to say the least. Also we couldn’t resist peer pressure.\nQ: Well, is it a Next-Gen leap for the franchise?\nA: Huh? Franchise? Well, the graphics are 1080p, 60fps. 1950’s graphic-art inspired. Only the best!\nQ: Is it better than the original?\nA: ... Define “better”...\nQ: Good lord, what does the game even have?\nA: More of the stuff from the first game! 4 new stories to follow along; 10 more crazy facts to discover; some weird minigames sprinkled throughout; and one messed-up Mayo.\nQ: Are there at least achievements or something?\nA: Yup! 50 of them in fact, laid out in a nice card album for you to collect!\nQ: What’s the gameplay like? Is it still a clicker?\nA: Yup. Click the Mayo jar and the gameplay will “click” with you right away! “Tap” into the psyche of Mayo and “Mouse-y” along the quirky stories!\nQ: Please no more puns...\nA: I'm afraid I can't do that, Dave... (We hope one of you is named Dave)\nOffline single player\nUses DUALSHOCK 4 vibration function\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","imageUrl":"https://media.rawg.io/media/games/943/94346720f3bbc8f6196e4aedcbca356d.jpg","releaseYear":2020,"developer":"Green Lava Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":427939,"name":"My name is You. And it's the only unusual thing in my life","genre":"Indie","price":0.0,"description":"This is a novel with multiple plot lines, in which you only get to witness only a couple of days of a character who’s name is You. It may seem that except for his name, his life is nothing exceptional. That is if it wasn’t for a chain of events that fluctuate between his daily routine and an existential terror of reiteration. What is the most important part? It’s you and You facing inevitability.\nThis is you, and this – is You. Both of you have something in common – exceptionality in a monotonous moment of time, when meaningless decisions have to be made. Or meaningful, to such an extent, that there is nothing left once they are made. Who knows what awaits you around the corner – will you go to work in a continuous, 'almost-holiday' fever or wander in a labyrinth of crooked mirrors? Except for his name, it seems our character’s life is nothing more than unexceptional – there’s no room for miracles or cobwebs. The room is filled with office papers, some vaguely familiar family members, an ailing story of sensation, a couple of dropped lines and a sharp drop – a circle, inside and outside of which you and You wander. Open the letter, pick up the phone, speak up or step aside – and this story will gain new fractures and reflections.\nFeatures:\nUnique atmosphere and visual art that fully convey the gloomy mood of the novel\nMore than 10 alternative endings\nSpecial soundtrack for each finale\nOffbeat structure of the plot: the full story can be put together, only if a player lives through every possible situation","imageUrl":"https://media.rawg.io/media/screenshots/66c/66cf31bc60e82c6c3dba4a6608862e34.jpg","releaseYear":2020,"developer":"Nikita Kaf","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":367145,"name":"They Can't Stop All Of Us","genre":"Action","price":0.0,"description":"Outwit your enemies and control the battlefield\nTwo game developers are back with a brand new strategy game. The combat defense/attack strategy game They Can't Take Us All gives you control of either building up defenses or crafting clever armies to overwhelm your friends. Counter different playstyles with your own strategy over an objective based battlefield with co-operative play and tactical depth.\nMain Features:Defend the objectives Have free control over placing structures and create a line of defense against the attacker.Create your armyPlace troops to increase income, manage your resources and balance your spending to effectively wipe out the defenders and take the objective.Choose your class Coordinate with your team and create the most efficient loadout to counter the enemy player.Gain more resourcesDestroy enemy troops to gain resources for more advanced buildings and tactics.\nBe a part of the communityJoin us on DiscordBe a part of the discussion whether it be showing off cool screenshots & videos or helping to discuss balancing and new content. You can join us on Discord by clicking the website link to the right of the description.\nMADE FOR YOU!A team of two!This entire game was created & developed by only two people! It's completely free-to-play so everyone can enjoy it. We're working really hard to try and make it the best we can and hope you have as much fun as possible.","imageUrl":"https://media.rawg.io/media/screenshots/dd4/dd4a089cbe51896b90dd4991e9870273.jpg","releaseYear":2019,"developer":"Whiteout Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":367052,"name":"Knights of Honor II – Sovereign","genre":"Strategy","price":0.0,"description":"Become the King and wrestle over control of Europe in this fresh take on medieval real-time grand strategy.\nSovereign includes all the depth players desire while being the gate-way game to the grand strategy genre, presenting the world as a\nliving, breathing miniature, alive and ripe for the taking. Choose your royal court carefully and determine the destiny of your people,\nbe it riches, conquest, intrigue, trade, or defeat! Raise armies to defend your lands or take war to the enemy - even jump into\nbattle directly in action-packed RTS combat. The path is open: become the true Sovereign of your people.\nFeatures\nAccessible Grand Strategy - All the depth of religion, diplomacy, city development, and more, with none of the confusion\nReal-Time Gameplay - Medieval Europe comes alive, no turns needed\nRoyal Court - Appoint Marshalls, Clerics, Merchants, Diplomats, and Spies to exert your will across the land\nRTS Battles - Lead your armies directly in riveting RTS engagements\nRobust Multiplayer - Join with multiple friends to take on the challenges of medieval Europe","imageUrl":"https://media.rawg.io/media/screenshots/2e0/2e02dd621192cdaaaff24176d3d3ffe8.jpg","releaseYear":2022,"developer":"Black Sea Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":328679,"name":"Cathedral","genre":"Action","price":0.0,"description":"Wake up in a world with no recollection of how you got there. A world full of secrets, hidden rooms, dungeons and towns; Cathedral features a vast world, meant for exploring! You control a nameless protagonist, a knight from a different world, who teams up with a spirit known as Soul. Figure out what makes this world tick, and how to get back home.\nUnravel the secrets of your past by finding the five elemental orbs. The orbs, placed in ancient times by the demi-god known only as Ardur, are protected by five fearsome guardians. Make your way through their dungeons, meet them head-on in combat, and see if you can best them!\nAlong the way, you will find magical items that allow you to explore even further, and reach new areas, towns and dungeons.A large world to explore\nCathedral features a large interconnected 2D world, containing more than 600 rooms to explore. Use the handy world map to find new locations, items and backtracking opportunities. The world of Cathedral is completely hand-crafted, and contains many unique areas, secrets and puzzles. Each area of the world is designed to be distinct and unique with its own puzzles and challenges.\nCathedral is not a game that will hold your hand, but rather allow you to set out and explore on your own.Modern, tight controls meet retro-inspired graphics\nCathedral is an homage to games of the past, built using modern technology. The game makes use of the NES color palette and sound capabilities without following the restrictions fully, which allows us to draw inspiration from both the 8-bit and 16-bit era.\nThe game is designed to be played using a game controller, such as an XBox, PS or Switch controller, but works well with keyboard too. Regardless of which you choose, you will play a game with extremely tight and fine-tuned controls.Features\nSingle player adventure game\nA large world to explore, filled with secrets\nChallenging boss fights\nA map system that makes exploring and backtracking the world fun\nTowns, shops, shopkeepers, fortune tellers and other NPCs\nLots of varying puzzles, areas and enemies\nAwesome 8-bit music, made in Famitracker","imageUrl":"https://media.rawg.io/media/screenshots/45c/45c68b0a62fae66e8ff09347bc518dff.jpg","releaseYear":-1,"developer":"Decemberborn Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":297207,"name":"Stellaris: Console Edition","genre":"Strategy","price":0.0,"description":"The universe is getting bigger every day! Paradox Development Studio is bringing the grand strategy genre to consoles for the first time ever with Stellaris: Console Edition. \r\n\r\nFeaturing the same deep strategic gameplay, rich and diverse alien races and emergent storytelling, Stellaris: Console Edition puts the complexity of the galaxy at your thumbsticks.","imageUrl":"https://media.rawg.io/media/games/5c1/5c1bf751ed0db8f26fb9fbaffe8f51c0.jpg","releaseYear":2019,"developer":"Paradox Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":290864,"name":"The Legend of Zelda: Four Swords","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/063/063e24eb22d69c8d4febc5b938a50b57.jpg","releaseYear":2002,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Game Boy Advance"}]},{"id":236808,"name":"The Darkside Detective: Season 2","genre":"Adventure","price":0.0,"description":"Season 2 Kickstarter\nThe Darkside Detective Season 2 Kickstarter I now live. Like, share and tell the world. The Darkside Division needs your help. Lets make Season 2 happen!\nwww.darksidedetective.com/kickstarter\nAbout the GameThe Darkside Detective is a micro-adventure game, consisting of a series of humorous bite-size investigations into the occult and extraordinary. Season 2 picks up from the cliffhanger ending of Season 1 and brings our heroes, Detective McQueen and his sidekick Dooley, through six new investigations into the paranormal and downright bizarre. Join them as they venture to a creepy carnival, explore more of the Darkside and even unwind on a trip to sunny old Ireland...\nSeason 2 will be bigger, better and 100% slimier than before and will be oozing onto Pc, Mac and Linux in Q1 2020","imageUrl":"https://media.rawg.io/media/screenshots/40d/40d0a85a824f8912fdc2cc3d57e49601.jpg","releaseYear":-1,"developer":"Spooky Doorway","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":60729,"name":"Vカツ / V-Katsu","genre":"Desconocido","price":0.0,"description":"Imagine a world where you can get your original avatar very easily. You can make your own avatar anytime you like by using V-Katsu.\nV-Katsu is an avatar making software that has the richest variety of expressions. There are a lot of data we have prepared for you.\nBesides that, you can become your avatar and move your avatar's hands and feet as you like, by using VR devices like Oculus Rift and HTC Vive.\nGive it a try in VR!\nNothing is impossible with V-Katsu!","imageUrl":"https://media.rawg.io/media/screenshots/009/0091eb322877f6b91e7f399c8bf5d005.jpg","releaseYear":2018,"developer":"IVR","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53392,"name":"Mario Kart: Super Circuit (2001)","genre":"Racing","price":0.0,"description":"Mario Kart: Super Circuit, known in Japan as Mario Kart Advance (マリオカートアドバンス, Mario Kāto Adobansu), is a kart racing game developed by Intelligent Systems and published by Nintendo for the Game Boy Advance in 2001. The game is the third installment in the Mario Kart series and the first for handheld consoles, following Mario Kart 64 (1996). It was succeeded by the console game Mario Kart: Double Dash, which was released for the GameCube in 2003. The game retains traditional game elements of Mario Kart set by its predecessors, and upon release, was well received by reviewers.","imageUrl":"https://media.rawg.io/media/games/243/243ffd01d85cf3db7da6bdeea8f17459.jpg","releaseYear":2001,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":49441,"name":"Echoed World","genre":"Action","price":0.0,"description":"Echoed World is a puzzle-based platformer, where mechanics and a story are bound together. The protagonist can no longer create life, but he can still manipulate with what has been already created. This process requires a lot of sacrifices to be made, but is often the only way to traverse through a slowly dying world, where creations are turning against their creator.Features:Use your powers to overcome platforming puzzles and challenges\nExplore the captivating world set in an unfamiliar, exotic universe\nEnjoy traversing the levels with full gamepad support\nFeast your eyes on distinctive hand-painted graphics\nLet your experience be enhanced by atmospheric soundtrackAbout us:The game was created as a student project and thus is not very lengthy. Our team decided to put it out for free to get something every starting developer needs –\nfeedback. Most members of our team had no previous experience with game development and Echoed World was made during a few months of tutored game development classes. Our main goal is to show, what can be achieved with a group of talented, yet inexperienced people in a relatively short amount of time.\nWe hope that you will enjoy this short, yet sweet adventure.\nAll the feedback we get on Echoed World will push our team even further!","imageUrl":"https://media.rawg.io/media/screenshots/0a9/0a94421a1cd30c125b17283806f07d15.jpg","releaseYear":-1,"developer":"Team DOTS","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45032,"name":"Find You","genre":"Casual","price":0.0,"description":"Find You is a puzzle-platformer in which your goal is to unite every character to make it to the next level. But everyone is controlled by the same input, which leads them to move simultaneously. So you have to find a way to stop one, in order for the others to catch up to him. Of course it gets a bit more complex than that after a few levels ;)\nMany different types of characters, objects and mechanics to give you a hard time beating this game.","imageUrl":"https://media.rawg.io/media/screenshots/e13/e13c536739d12ca3f87d99d3e8c2cfaa.jpg","releaseYear":2017,"developer":"Byting Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29162,"name":"The Outfit","genre":"Action","price":0.0,"description":"(Online Interactions Not Rated by the ESRB) This game supports English, French, Italian, German, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". Combining intense squad-based combat with the freedom of total destruction, The Outfit takes players behind enemy lines, battling the Nazi War Machine through a variety of combat missions.            Choose from three playable squad leaders - each with their own skills and abilities, as you lead a squad of battle-forged soldiers on missions ranging from reconnaissance and rescue to search and destroy.  With interactive and fully destructible environments, you have the freedom to shoot, blow up or demolish anything in your path!            Use “Destruction On Demand™” (D.O.D.) to order in everything from tanks, jeeps, halftracks and other combat vehicles to machine gun nests and anti-tank guns, squad reinforcements, even air strikes and artillery!            With 720p HD, 16:9 Widescreen, and 5.1 Dolby Digital Surround Sound you can experience the cinematic intensity of WWII combat through 12 epic single-player missions, or go online for a variety of multiplayer modes, including co-op and versus. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","imageUrl":"https://media.rawg.io/media/games/b36/b360704633a2eaf116c12bb0ebf4f529.jpg","releaseYear":2006,"developer":"Relic Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":29133,"name":"A.R.E.S.","genre":"Action","price":0.0,"description":"A.R.E.S. Extinction Agenda EX, an action-packed side-scrolling game from Extend Studios, takes players on a thrilling sci-fi adventure!  Take control of combat specialist Ares, or the new playable character, Tarus, to battle deadly machines with a variety of powerful weapons and armor. Your goal: Save Minos Space Station’s survivors and uncover the nefarious Zytron’s extinction agenda!","imageUrl":"https://media.rawg.io/media/screenshots/d25/d2584620dedf7bb2d7d0c944f3fb916b_oUEJi59.jpg","releaseYear":2013,"developer":"Extend Studio;Origo Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":29054,"name":"Marathon 2: Durandal","genre":"Action","price":0.0,"description":"If you experience discomfort while playing this game, take a break and consult the healthy gaming guide in your Xbox 360 console manual (also available online at http://www.xbox.com/). Single Player, Xbox LIVE Multiplayer 2-8, Local Multiplayer 2-4, HD (High Definition). Purchase now to unlock the full game, with all the classic Marathon gameplay and shiny new enhanced high-definition graphics! Feeling tough? Take on the universe alone in Single-Player mode. Feeling friendly? Team up with others to fight the Pfhor in Cooperative mode. Spoiling for a fight? Challenge the world to Deathmatch, King of the Hill, Tag, or the ever-popular Kill the Man with the Ball! There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","imageUrl":"https://media.rawg.io/media/screenshots/eb4/eb432612c2980614979e98634fa6d6ec.jpg","releaseYear":1996,"developer":"Bungie","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":29035,"name":"Radiant Silvergun","genre":"Action","price":0.0,"description":"Radiant Silvergun, restored by Treasure, is now available! The shoot ‘em up gameplay that made this a legend remains unchanged, but a hidden \"Ikaruga-style\" shooting mode gives everyone something new. Previously only available in Japan, Radiant Silvergun on Xbox LIVE Arcade also provides leaderboards, co-op play locally or over Xbox LIVE, downloadable replays, and improved visuals making it the version to own. Download Radiant Silvergun now!","imageUrl":"https://media.rawg.io/media/screenshots/082/08204cebaa6276237d4ac940d3aea52d.jpg","releaseYear":1998,"developer":"Treasure","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":22212,"name":"Road Dogs","genre":"RPG","price":0.0,"description":"Road Dogs: A Post Nuclear Privateer/Trader MMO GameWe create a MMORPG in the old \"privateer/trader\" genre, inspired by Elite, Sid Meier's Pirates!, Sea Dogs, Space Rangers, AquaNox and Fallout 1/2 global map trips. In addition we tried to introduce modern trends of recent years using elements of .io-games particularly their minimalism, arcade and causality. At the moment we are at the alpha test phase. Road Dogs is more global than it might seem looking at the graphics. But we are at the finish line.General features:A seamless open world.\nReal time battles with no limits on the number of participants.\nTons of vehicles, motorcycles, armored vehicles, weapons, and gadgets.\nDetailed vehicle styling and tuning. Create a unique vehicle with a unique name, appearance, and weaponry.\nStealth elements and ambushes, there are no levels or maps. Just like in a real battle, only competent intelligence will help you to identify the actual number of battle participants.\nThe game employs a classic role-based character and party system. You can choose not a damage dealer specialization including: scout, artilleryman, party leader, engineer, or ammunition and fuel delivery driver. And you will be in demand in battle party anyway.\nUnpredictable massive PVP battles. Each time you play you will encounter unique game situations in an open world environment.\nParticipate in caravan robberies. The game employs a live economic system in which you must protect trade vehicles as they move between settlements.\nFlexible zoom. You can move the camera's position into the stratosphere with one roll of the mouse wheel.\nKarma and hardcore. Kill anyone you want, from small to large. However, according to the Karma system, what goes around comes around.\nDrones, UAVs, MRLS, mines, and guided missiles.\nDozens of quest generators. Players can trade quests with each other.","imageUrl":"https://media.rawg.io/media/screenshots/581/5811aefe93a2a343de7c3e6c55c38d6d.jpg","releaseYear":2017,"developer":"Teletower Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":22183,"name":"Covert Syndrome","genre":"Action","price":0.0,"description":"Welcome to Covert Syndrome!\nCovert Syndrome is a free to play Coop corridor shooter with a focus on unscripted AI and fast tough combat.\nCreated as a prototyping project we wanted to release it to the community so people can experience Co-op VR for free.\nThe game consists of 6 combat zones with each zone having multiple waves of enemies. Player take possession of a mechanized agent with a mission to eliminate all enemies while minimizing unnecessary usage of energy. (You energy is both your health AND your ammo.. shoot wisely!)\nThere is also a firing range where you can practice acquiring and eliminating targets.\nAfter a round players can travel back to the lobby and check out how many credits they earned for their mission. (Best scores are recorded in steam leaderboard)\nDon't forget to read the instructions board at the entrance! it will make your experience much more enjoyable!","imageUrl":"https://media.rawg.io/media/screenshots/f19/f198fbd8127ec199bf21c36bf39c6570.jpg","releaseYear":2017,"developer":"Offworld Industries","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19876,"name":"Murder","genre":"Adventure","price":0.0,"description":"Murder is a short story about the intersection of morality and sentience, told in the form of a point and click adventure.\nOver its memorable twenty to thirty minute playtime, Murder takes players on a journey through a near-future Tokyo, following the actions of Lieutenant Motomeru Minori of the Tokyo Metropolitan Police on an unusual and dangerous case, in a story that explores the intersection of morality and sentience in a future where both have become commodities.\nFeatures:\nEngaging environmental storytelling and confident cinematic flair, equally inspired by the works of Fullbright and Blendo Games\nSetting that presents fresh ideas while also paying homage to pioneers such as Masumune Shirow, Katsuhiro Otomo and Neal Stephenson\nExperimental point & click style, partway between the classic form and a more minimal, streamlined one\nIncredibly detailed cyberpunk world with expertly-crafted pixel art graphics\nRich and varied cast with full voice acting\nDynamic score by KubrixXx spanning noisehop, neo-classical, and ambient styles\nSupport for mouse, keyboard, and gamepad","imageUrl":"https://media.rawg.io/media/screenshots/cf6/cf6d38996b1013c9f9ecd0fb8325eacf.jpg","releaseYear":2015,"developer":"Peter Moorhead","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19558,"name":"Warhammer 40,000: Deathwatch - Enhanced Edition","genre":"Action","price":0.0,"description":"Command the ultimate team of elite Space Marines.\nWarhammer 40,000: Deathwatch is a turn-based strategy game, set on the edge of Imperial space, where your Space Marines will take on the Tyranids in a series of tactical engagements. From war ravaged cities, to the insides of Tyranid bio-ships, the missions will see your Kill Team rise in strength and skill as you face ever greater threats and peril.\nENHANCED EDITION:  The Enhanced Edition of Deathwatch is a remastered and upgraded release specifically for PC players.\nHigh quality graphics powered by Unreal Engine 4All missions remastered with dynamic lighting and special effectsBrand new Space Marines from the Dark Angels, Imperial Fists and Black Templar chaptersFully re-designed, intuitive UI and customisable controls for keyboard and mouse\nFIGHT: Embark on a journey to save the sector from the alien threat. Smash the alien threat in a bespoke campaign against the Tyranids.\nCOLLECT: Collect unique Deathwatch Space Marines. Customise them with a huge assortment of different weapons and wargear.\nLEVEL UP: Gain experience points on missions and spend them on your Space Marines to unlock powerful skills and abilities.","imageUrl":"https://media.rawg.io/media/games/103/103aed6fb83166dc3467b5c78c780db3.jpg","releaseYear":2015,"developer":"Rodeo Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18060,"name":"Mythic Wonders: The Philosopher's Stone","genre":"Adventure","price":0.0,"description":"Enter the mythical portal and search for your missing uncle in the new hidden object adventure game!\nA new hidden object adventure game from the creators of Enigmatis!\nEmma wakes up from a scary dream: mysterious creature threatens her uncle Alfred. She feels that something bad just happened and it puzzles her…\n60  beautiful hand painted locations!\nUpon arrival she discovers that Alfred is missing and that the mythical portal,  they were both working on, is active. What’s the story? Did her uncle enter the portal and embark on an adventure on his own?\nCaptivating dialogue and immersive soundtrack!\nStrange world on the other side of a mysterious artifact can be the answer, so the young woman dares to step into the unknown. An adventure in the worlds of five elements has just begun.\n48 puzzles and 21 ho scenes that fit the storyline!\nEmma will take on various mini games, puzzles and beautiful, hand drawn scenes with hidden objects to test her skills.\nImmersive gameplay with morphing hidden objects!\nWill Emma prevail over mystery creatures and deadly puzzles? Will she put her detective hat on to find her uncle and the secret Philosopher's Stone from her dream?\nSee the realm of Nether in the Collector’s Edition!\nThe additional content includes a bonus chapter set in a realm of Nether, morphing hidden objects in extra HOs as well as beautifully done immersive soundtrack and hand drawn concept art.\nFeatures60 locations filled with beautiful hand painted graphics await!\nCaptivating dialogues and great soundtrack will keep you immersed in the game!\nProve yourself against 48 puzzles and 21 ho scenes that fit in well with the storyline!\nRewarding gameplay with morphing hidden objects and achievements!","imageUrl":"https://media.rawg.io/media/screenshots/bc1/bc19690e400d412d3773e930fb9da6ed.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17920,"name":"In Case of Emergency, Release Raptor","genre":"Action","price":0.0,"description":"Be a raptor, feel like one, and smash robots to bits.\nProcedurally-assembled 3D environments set in a scenic futuristic dystopia.\nFree release of an aborted Early Access title.  We hope you enjoy it!  Note that this is an AS-IS release, based on popular demand, rather than us taking it down completely.Sell Me The Idea In One Sentence\nIf I have to convince you why being any form of dromaeosaurid is freaking awesome, then I'm not sure we can be friends.  This game is carefully crafted to give you the closest possible feeling of being one of these glorious monsters -- then turning you loose to do fun stuff.What’s The Point?\n1. For the pure fun of the thing.  In 1993, a certain game let you be a raptor.  The controls were iffy.  The levels were short and static.  It's very dated.  Yet many of us still dust it off periodically -- just to be a raptor.  Release Raptor gives you a far more satisfying, modern, dynamic experience.\n2. For a power trip. For speedrunning and finesse, you're on an invincible rampage.  It's not about IF you can do it, but how WELL you do it.  Your performance is evaluated, so mistakes still have consequences without interrupting the flow of the game.\n3. To play with kids.  I want to be able to play this with my 5 year old son, but still have dismemberment (because that's cool).  How to do that without blood or gore?  Robots!  Little robots = pouncing targets; giant mechs = dismemberment targets.Procedural AssemblyWhat on earth do we mean by \"procedurally-assembled?\"  Basically, we're using a very heavy mix of handcrafted content with procedural bits making it fresh each time.\nCreating unique and recognizable areas is a huge focus, because otherwise you get unimaginative \"procgen blandness.\"  Yuck!  But we still wanted that sense of exploration, and so not chunk of level is present in every run, the layouts of the overall level (and where enemies are as well) varies quite a bit.\nNB: Yes, we know that’s not a velociraptor (and there should be feathers).","imageUrl":"https://media.rawg.io/media/screenshots/a9d/a9d80804df8052a38691d14b1a44d28c.jpg","releaseYear":2016,"developer":"Arcen Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17390,"name":"Heileen 3: New Horizons","genre":"Adventure","price":0.0,"description":"Heileen 3 continues the story from the end of the second game and takes place in the Caribbean islands. Traveling side by side with Morgan the pirate, Heileen will search for her missing friends, hoping to reunite with all of them.\nBut that's only the beginning, because the story continues! You'll have a fixed amount of in-game time to unlock a romance or a profession ending! Do you have what it takes to make it?\nThe game plays like a raising/dating sim, in which you can learn several different skills and unlock advanced activities.\nThe Virtues/Sins system of the second game is present as well, making every decision you take in the game shape Heileen's personality.GAME FEATURES\nFeaturing a story much longer than the previous two titles combined together!\nFour male romances: Morgan, John, Jonathan and the new face Sebastian\nFour female romances: Marie, Lora, Ebele and the irascible Juliet!\nDating sim gameplay, with lots of unique skills to learn and \"level up\"\n14 different profession endings to unlock based on your skills and virtues/sins\nGet the bonus content version with OST, wallpapers, chibi, and more","imageUrl":"https://media.rawg.io/media/screenshots/163/163d41ccf83241f1ee696fe2171628d7.jpg","releaseYear":2014,"developer":"Winter Wolves","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17302,"name":"emoj.io","genre":"Action","price":0.0,"description":"Eat gems, get power-ups, and unlock emojis in this fun multiplayer maze game!","imageUrl":"https://media.rawg.io/media/screenshots/bda/bda2faf10c75edf444daf12a91505761.jpg","releaseYear":2016,"developer":"Hassey Enterprises","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16110,"name":"Guards","genre":"Adventure","price":0.0,"description":"Play by the 4-heroes team. Defend against the hordes of monsters, plan your moves, improve your abilities. Defeat all the enemies on each level and join the deadly fight with Boss!\nFeatures An original turn-based battle system\nEight heroes with unique abilities and battle techique\nА lot of additional skills, a variety of magical items\nAn unlimited choice of game tactics\nAdditional difficulty levels, which will become a real challenge even for the most experienced strategistGameplay\nThe main feature of the game is a unique turn-based battle system. You command the team of 4 heroes, 3 of which are fighting on the front line, while the 4th is recovering health behind the backs of his team-mates. To make a move you need to change positions of any two heroes. If the hero moves from the back line to the front, he uses superattack. For example, the knight is thrilling the land, stunning all the enemies on the line, while the huntress is charging a bow with energy, simultaneously firing arrows in all the enemies.","imageUrl":"https://media.rawg.io/media/screenshots/21a/21a8b9490a6732637c1b9a4153bbb19e.jpg","releaseYear":2016,"developer":"Battlecruiser Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15955,"name":"The Promised Land","genre":"Adventure","price":0.0,"description":"Darkestville Castle Coming Soon\nAbout the Game\nBecome a leader of a little group of settlers to create a thriving colony which will envy even the developed nation!\nWho says it would be easy?!\nAn untamed land where you will have to make everything on your own –to provide your people with food and shelter then to give them job and protection. Day by day you will have to remake your production plans, switch your workers to find out the best solution for each industry. But keep in mind, that every citizen has his own temper that one day can be shown off. And that’s not the only difficulty that may will face. Pirates and wild tribes are all around this Promised Land to disturb your presence and development here.\nTo create a developed colony one will not only need to become keen in production, but also in science. Experience points that you earn in the Academy, will be needed to get the access to advanced technologies or your town would be just another village on this land. Think well over what and where you spend your points on, because your choice will depend on the fate of the entire colony!\nThe Promised Land, a brave new world , the hole nation – all this lies in your hands! Become a true leader, a chosen one, a father of nation! Guide your colony to the victory of the modern superpower!\nWe collected all the best that is in games of this genre, arched by exciting mini-games and carefully turned it into the deep and breathtaking adventure!\n•\tComplete freedom of play\n•\tMore than 10 hours of gameplay\n•\tUp to 50 player-controlled characters\n•\tHuge, untamed world to explore\n•\tStep-by-step tutorial","imageUrl":"https://media.rawg.io/media/screenshots/930/9303e7fcd156b9706f6365b0790af2ff.jpg","releaseYear":2014,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15139,"name":"Control Craft 3","genre":"Action","price":0.0,"description":"Control Craft 3\nControl Craft 3 is a fast paced RTS, which brings quick thinking and clever tactics together for some planet conquering action.\nEnhancing everything which made the original a hit, with stylish graphics and addictive game play, Control Craft 3 will keep you coming back for more.\nTake command of your troops and lead them into battle. Send in wave after wave of your soldiers to overthrow the enemy colonies and occupy their bases.\nBattle your way through challenging levels and upgrade your weapons. Combine your different attack units (light, heavy and flying) to out wit the enemy and claim the planet as yours.\nFEATURES :\n*48 Unique Levels\n*Clever 2D Platform Level Design\n*Stylish Graphics and Smooth Animations\n*The Ability to Upgrade Your Firepower\n*Hear the Troops React to Your Orders as You Direct Them\n*Unlock Levels and Choose the Non-linear Path to Victory\nControl Craft 3 adds to the unique style and game play of the original. This game is easy to pick up but hard to put down.Take Control and Smash the Enemy. Your army needs you!","imageUrl":"https://media.rawg.io/media/screenshots/b41/b41fdd925bebbef53b79936fb4e011be.jpg","releaseYear":2016,"developer":"Elite Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14940,"name":"NS2: Combat","genre":"Action","price":0.0,"description":"What is this game?NS2: Combat pits aliens against space marines in a fast paced, action-packed struggle for survival. Part twitch-shooter, part stealth crawler, design your own tech tree, choose your own style of play, and control one of seven different life forms.\nTry unique abilities such as 'Devour', where the largest alien eats her enemies, or pilot the hulking mechanised 'Exo Suit' and punch aliens in the face. NS2: Combat offers ranked servers supporting casual and competitive play.\nChoose your play style\nBuild your dream loadout with a slew of unique abilities and specialisations.\nBecome a jetpack-wielding, grenade-launching marine; or a heavily armored, super-charged alien who enjoys eating marines for breakfast. Whether you're building sneaky teleporters in remote locations or devouring every marine in the room, this game has something for everyone!\nPublic matchmaking\nWith the click of a button, you can play against opponents equal to your skill level. Shoot and claw your way up the public rankings and prove that you have what it takes to become the best of the best!\nModding toolsIf we did it, you can do it too! NS2: Combat ships with all the tools used to create the game, including the map editor, cinematic editor, builder, viewer and documentation, allowing you to create new weapons, skins, models and maps for the game.\nVenture further into customization by creating your own mod! NS2: Combat is fully coded with LUA, a scripting language that can be easily modified, allowing you to do anything your heart desires.\nAbout the Game\nNS2: Combat includes seven different player-controllable lifeforms, a vault full of weapons and abilities, a stats system, full modding support and five original maps. Games last around 15 minutes and players may join and leave at any time without disrupting gameplay.\nFaultline Games is a game developer that started as a mod team. Our indie-publisher, Unknown Worlds, also started as a mod team. NS2: Combat evolved from the modding community of Natural Selection 2 to become a standalone game. It does not require Natural Selection 2 in order to play.","imageUrl":"https://media.rawg.io/media/screenshots/5bb/5bbe0f49083689d482adc291c68b1021.jpg","releaseYear":2014,"developer":"Faultline Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14386,"name":"Spooky Cats","genre":"Action","price":0.0,"description":"Oh no!\nThis cute little kitty cat is alone and lost in a haunted house! Only by collecting pennies, saving a girl named Penny, and defeating monsters can she find the way out! Use your fast fingers to defeat this adorably dark and funny platform game.\nDis game is so scawwwy!\n\nIncludes Xbox gamepad support (if supported by your OS).\nYouTube Let's Play/Reviewers: Feel free to use Spooky Cats gameplay in your online monetized videos.","imageUrl":"https://media.rawg.io/media/screenshots/7d7/7d75ee2580d60bb970c6cb5dd287788e.jpg","releaseYear":2015,"developer":"Russpuppy","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13659,"name":"Say Goodbye","genre":"Adventure","price":0.0,"description":"This visual novel about an ordinary man with his typical problems. Suddenly, you got a report that your distant cousin died in a car crash. Fortunately, her daughter wasn't with her. You take the girl under your wing.\nBut Soon, Something Starts to Go Wrong...","imageUrl":"https://media.rawg.io/media/screenshots/48a/48ad1704db4a38e92e7aafba1c2b8821.jpg","releaseYear":2017,"developer":"morojenoe's empire","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10762,"name":"Think To Die 2","genre":"Strategy","price":0.0,"description":"Introduction\nThinkToDie Episode 2 is a level based puzzle platformer with over 95 levels where your goal is to die. You usually accomplish this by smashing yourself with blocks, jumping into spikes or getting shot. Although it might seem very easy at first, you`ll soon start to realize that as you progress and the more levels you pass, the harder it`ll become. A fun game shaping up the a suicidal puzzler genre.\nThe game was designed to make you constantly think outside the box and find creative and new ways to kill yourself. As you progress you`ll experience harder and harder levels, new items and objects.\nAbout the gameThink To Die -Episode 2 follows the steps of Think To Die Part 1.  Episode 2 however focuses much more on Quality than on Quantity. Every level has its own level design, and every puzzle challenges the player anew. The music from Part 1 was taken over and a few new background music tracks have been added. The game is now fully in 3D and the graphics have been completely changed. The puzzles are way harder to solve and some controls (like the click-teleportation controls) haven been improved and changed.ControllerThe game is NOT meant to be played with a controller, however, it is possible to play most of the levels with it but is not supported.\nFeatures:Over 90 unique levels\nPlayable in an optional cartoon look\nNew graphics\nFunny & Fast gameplay\nAuto Saves after passing a level\nOption to skip any level (By pressing F10) in case you get stuck\nNo paid DLCs (All updates will be free)\nSingle-Player only & playable offline\nAnd much much more...\nControl-Keys:W,A,S,D or arrow keys to move\nF10 skips a level\nF8 flips camera\n\"C\" changes player\n\"R\" restarts level\n\"F1\"enables/disables performance profiler","imageUrl":"https://media.rawg.io/media/screenshots/274/2749c3e6651fd706b1395a6231beab92.jpg","releaseYear":2016,"developer":"Felip Guimerà","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10083,"name":"The Watchmaker","genre":"Action","price":0.0,"description":"In The Watchmaker, a puzzle-adventure game, players take on the role of Alexander. In his steampunk world of giant clock mechanisms, Alexander’s routine involves repairing his precious clock tower every day, adjusting its mechanisms, oiling the gears and polishing everything down to the smallest piece. For years, this is the only life he has known.\nBut one day Alexander is awakened by a mysterious voice. This disembodied voice alerts him that something has gone wrong: someone, some unknown being, has sabotaged his beautiful tower. With the clock not working properly, time has gone mad. Consequently, Alexander starts ageing abnormally quickly, leaving him only a handful of time to repair the damage.\nGuided by the mysterious voice and armed with a magnetic glove and a bag of time bombs, he must search the halls and arcades of the tower in search of the saboteur. Various obstacles, enemies and riddles buried in the clock’s intricate mechanisms stand in his way. But Alexander must push on to save the clock and restore time to its natural rhythm, all while gradually uncovering the mysteries of the tower and its even stranger past.Features\nSteampunk puzzle-adventure set in 5 extensive locations\nDiverse gameplay, with a mix of exploration, puzzles, platforming action and boss fights\nEnvironmental puzzles and special gadgets to solve them, such as magnetic gloves and time bombs\nUnique ageing process that replaces the usual health bar","imageUrl":"https://media.rawg.io/media/screenshots/b63/b631ea7d77074c2d517a29bd24941eb1.jpg","releaseYear":2017,"developer":"Micropsia Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":2494,"name":"Battle Worlds: Kronos","genre":"Strategy","price":0.0,"description":"Digital Deluxe EditionThe Digital Deluxe Edition features:\n- Digital 40 page \"Extended Manual\" with advanced tactics and background info (PDF)\n- Digital 80 page \"Weapon's manual\" with \"tips & tricks\" for every unit (PDF)\n- Digital soundtrack, featuring 10 tracks (all original compositions)\nAbout the GameBattle Worlds: Kronos is a classic turn-based strategy game in the tradition of Battle Isle, Advance Wars and Panzer General. Have you ever wondered what games like that would look like today? Well, we did. As a result, we decided to develope Battle Worlds: Kronos.Key Features:\nTwo Single Player Campaigns (~50 hours of gameplay)\nSingle Player Challenge Maps - Test your skills in different combat scenarios and keep track of your progress.\nLive Multiplayer - Battle your friends live on the internet (cross-platform) or via hot-seat.\nAsynchronous Multiplayer - Take all the time you need and consider your moves. Similar to \"play-by-mail\", your round is stored on our server and turned over to your opponent. The system allows you to continue the match anytime and anywhere you want (cross-platform).\nOnline Features - Leagues, chat and - in early 2014 - tournaments.\nStrong AI - A clever AI that will challenge even experienced commanders.\nMap Editor - A powerful editor to create your own maps and missions (Windows only).\nIncludes \"Trains\" DLC - Additional ~15 hours campaign, new units and new multiplayer maps","imageUrl":"https://media.rawg.io/media/screenshots/aca/acad949f12670c177801ccc317214fa9.jpg","releaseYear":2013,"developer":"THQ Nordic","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]}]