[{"id":10400,"name":"Yet Another Zombie Defense","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6f/a6fe99e55059f65da90663b128d70564.jpg","description":"A game in the genre of tower defense that is popular on mobile devices. The player aims to escape from the advancing hordes of zombies. The main task is to survive as long as possible.\n\nThe player takes control of the nameless survivor, who is to build a base and labyrinths in the daytime and defend it at night. YAZD is a top-down arcade zombie survival strategy game. For construction, there are protective barricades and turrets. The hero himself can shoot the zombies, and weapons for him can be bought and upgraded. The protagonist also has a somewhat complex skill tree.\n\nThe game can be played alone or with friends, using the possibilities of cooperative mode or multiplayer. Lack of content, the game compensates with time-tested gameplay, which will entertain the player for several evenings. And if you go through the game with your friends, even more time will be spent. Problems with the launching of the game will also not here: because of unpretentious graphics YAZD can be run even on a calculator. The game was repeatedly dirt cheap on sales, and developers released HD remaster of the original game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Awesome Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":58820,"name":"Shenmue I & II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbf/cbf8fea101b56c7d383ddf8cc500ff54.jpg","description":"Originally released for the Dreamcast in 2000 and 2001, Shenmue I & II is an open world action adventure combining jujitsu combat, investigative sleuthing, RPG elements, and memorable mini-games. It pioneered many aspects of modern gaming, including open world city exploration, and was the game that coined the Quick Time Event (QTE). It was one of the first games with a persistent open world, where day cycles to night, weather changes, shops open and close and NPCs go about their business all on their own schedules. Its engrossing epic story and living world created a generation of passionate fans, and the game consistently makes the list of “greatest games of all time”.Story\nA tale of revenge.\nIn 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father’s death and sets out tracing Lan Di’s path.\nThe first game in the series, Shenmue begins the tale as Ryo travels around Yokosuka, Japan, gathering clues about his father’s murder and dealing with nefarious gangsters along the way.\nThe sequel Shenmue II continues Ryo’s quest, this time crossing the sea to Hong Kong, China.  Ryo ventures deeper into the criminal underworld, meeting martial arts masters who aid him on his journey and offer insight into his father’s death, and unravels the mysteries of the Dragon Mirror that his father kept hidden.Gameplay\nTake the role of Ryo Hazuki.\nExplore a 3D open world searching for clues, examining objects, and talking to NPCs.\nBattle enemies and bosses making full use of the moves of Hazuki-style jujitsu.\nBeat quick-time events (QTEs) and mini-games.Key features\nThe best Shenmue experience\nPioneering Dreamcast classics available for the first time on PC\nUpdated user interface\nChoice of modern or classic controls\nJapanese audio available for the first time for a global audience\nFully scalable screen resolutions\nAn epic legend\nA tale of revenge on a grand scale\nSolve the mystery of your father’s murder\nAn experience never to be forgotten\nThe world feels alive\nTalk to anyone, scour the world for clues\nNPCs live independent lives on their own schedule\nFaithful recreations of 1980s Japan and Hong Kong, China\nDistract yourself with arcade games, collectibles, duck racing, and more","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":46000,"name":"Donut County","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/035/035b7bd6d015e07e501d2234ec629dc3.jpg","description":"Donut County is a physics adventure game where you control a hole in the ground. Every time you swallow something, the hole grows a little bit bigger.\nYou play as a raccoon named BK, a new hire at a startup that uses remote-controlled holes to steal people's trash - along with everything else. When BK falls into a hole himself, he must answer to his best friend Mira and the residents of Donut County who are now stuck 999 feet below their homes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":9964,"name":"Battle Chasers: Nightwar","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b89/b893db1513e56562a464398b18d1960c.jpg","description":"Battle Chasers: Nightwar is an RPG inspired by the classic console greats, featuring deep dungeon diving, turn-based combat presented in a classic JRPG format, and a rich story driven by exploration of the world.\nPlan for survival. The desolate town of Harm's Way is your only place to prepare. Choose three of the many heroes you've unlocked, fill your travel backpack with items from your stash, make sure you've chosen the best equipment and abilities for each hero... and then strike out\nExplore an overworld presented in classic form (and in real time), peppered with hidden dungeons, rare bosses and randomly appearing friends and foes, as well as a useful arsenal of Dungeon Abilites for every character\nOld-school combat inspired by the console RPG greats, with a unique two-tiered mana system and turn-based initiative, featuring random buffs and debuffs on initiative slots\nAction oriented, randomly-generated dungeons loaded with traps, puzzles and secrets. Use each hero's unique dungeon skills to survive\nNon-linear story driven by the discovery of lore on items, landmarks and secret elements in the world. Discovering these will both provide deeper insight into the mysterious Lost Vale, and also reward lore points, which are used to upgrade the heroes' different abilities\nTruly key story moments will be depicted in gorgeous, traditional 2D animation from Powerhouse Animation Studios (the studio that did the animated Darksiders cutscenes). For these, sit back and enjoy\nThe best-selling comic book Battle Chasers was first released in the late 90s and quickly generated a passionate cult following.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":14237,"name":"Sniper Elite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8a/a8adfa5d6c07c7ee2afbb9535dafec48.jpg","description":"As World War II draws to a close, the first covert battles of the Cold War begin. Caught in the life and death struggle between Soviets and Germans in war-torn Berlin, you control the fate of a lone American OSS Sniper. Disguised as a German and working deep behind enemy lines you must stop Stalin's forces from gaining control of Germany's nuclear secrets. Prepare to alter the course of history.\nAuthentic World War II sniper simulation featuring realistic weapons, bullet ballistics and sniping skills\nMassive single player game with 28 heart-pounding missions\nIntense 8-player LAN sniper battles including Deathmatch, Team Deathmatch and Assassination game modes\n3rd person view for close quarter action and movement - 1st view person for sniping\nOptions to take account of gravity, wind, posture, heart-rate and breathing to execute the perfect shot\nMulti-angle 'Bullet Cam' for kill confirmation\nNon linear game play provides unique action each time a mission is played","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Rebellion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":602224,"name":"V Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bde/bdef96f7782fba0ff62dabc37ff4b1f0.jpg","description":"A Vampire Survival Experience\n\nAwaken as a weakened vampire after centuries of slumber. Hunt for blood in nearby settlements to regain your strength while hiding from the scorching sun to survive. Rebuild your castle and convert humans into your loyal servants in a quest to raise your vampire empire. Make allies online, fend off holy soldiers, and wage war against other players in a world of conflict.\n\nWill you become the next Dracula?\n\n\nA Gothic Open-World\nExplore a vast world teeming with mythical beings and danger. Travel through lush forests, open countryside, and dark dungeons to discover valuable resources, meeting friends and foes alike along the way. Traverse the world with vampire comrades or hunt solo as you pillage villages, raid bandits, and wander into the domains of supernatural beasts.\nFear the light - Rule the night\nStick to the shadows during the daytime, or the burning sunlight will turn you to ashes. Roam the night and prey on your victims in the darkness. As a vampire, you must quench your bloodlust and plan your strategies around the day/night cycle.\nRaise your Castle\nGather resources and discover ancient techniques to gain dark powers. Use your newly acquired knowledge to build a castle where you can store your loot and grow your army of vampires. Personalize your domain, exhibit your vampiric style and make sure to craft coffins for servants and friends. Strengthen your castle while the threat from other players is rising.\nCompete or Cooperate\nTravel alone or explore the world with friends. Fighting side by side with other vampires will give you an advantage in your battle against the strongest creatures and most powerful humans. Raid other players’ castles or play the diplomat in the game of blood, power, and betrayal. Compete or cooperate - the choice is yours.\nMaster your Vampire\nLearn and master an arsenal of deadly weapons and unholy abilities. In V Rising, you aim skill-shots and dodge projectiles using​ precise​​ ​WASD controls ​and cursor-based​ ​aiming - no click to move. Tailor your play-style by combining melee or range weapons with a variety of powerful spell kits. Master your skills and unleash your wicked powers.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Stunlock Studios","platforms":[{"id":0,"name":"PC"}]},{"id":440081,"name":"The Medium","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f5/8f5c25901d96e709ea631599106eda1c.jpg","description":"Become a medium living in two worlds: the real and the spirit one. Haunted by a vision of a child’s murder, you travel to an abandoned hotel resort, which years ago became the stage of an unthinkable tragedy. There you begin your search for difficult answers. The Medium features a “dual” soundtrack by Bloober Team’s Arkadiusz Reikowski and legendary composer Akira Yamaoka of Silent Hill fame.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Bloober Team","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":66817,"name":"That's You!","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e9/9e946d861216ff7801207d795450a0c8.jpg","description":"\"That's You! is the companion app you need to play the hilarious That’s You! game for the PlayStation®4 system. Please note: This app acts as a controller. PlayStation®4 system, That’s You! game, and That’s You! Companion App required to play. PS4™ system and That’s You! game for the PS4™ system sold separately.\nFind out what you and your friends really think about each other in the party game where the questions are all about… YOU!\n\nMake sure your PlayStation®4 system is connected to the same Wi-Fi network as your device and then you're ready to go. Simply follow the in-app instructions to connect.\n\nUse this app to:\n• Swipe, type, snap and draw your answers for the PS4 game\n• Take pictures of yourself and your friends, then doodle on them to answer\n• Create your own word and picture questions to play on PS4\n• Play ‘Pass It On’ using just the app, to get a taste of the full PS4 experience\n• Share your pictures and questions on social media!\n\nThe application can be used in the following languages:\nEnglish, French, German, Italian, Spanish, Dutch, Portuguese, Swedish, Danish, Norwegian, Finnish, Russian, Polish, Turkish, Brazilian Portuguese and Mexican Spanish\n\nPlease note: This app acts as a controller. PlayStation®4 system, That’s You! game, and That’s You! Companion App required to play. PS4™ system and That’s You! game for the PS4™ system sold separately.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PlayStation Mobile","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":16168,"name":"BEEP","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55e/55e5628270e3a9d586c26bb2394801ac.jpg","description":"BEEP is an indie 2D platformer with a heavy reliance on physics laws. Big Fat Alien developed this title, and it is the only one within the IP. The game is considered to be attractive for such titles: not only it has music written primarily for it, but also the game flow feels like the one in \"big\" games. The main reception flaw is that game suits a lot more to the mobile platforms.\nThe core gameplay feature is the ability to alter the laws of the physics. There is an anti-gravity gun to do this — other than that it is just a general side-scroller platforming gameplay: the player needs to eliminate enemies, collect orbs to discover new planets and solve various physics puzzles.\nThe story is about the robot, BEEP, , sent into the Solar System to discover new planets and the possibility of life there. Once the Beep has unraveled the new planet, he checks on its physics and flies over to the next one.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Big Fat Alien","platforms":[{"id":0,"name":"PC"}]},{"id":12074,"name":"Monkey Island 2 Special Edition: LeChuck’s Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89c/89c786468e50fab24d6859b7edaf91c0.jpg","description":"###Golden Age\nA game from the golden age of the studio and publisher LucasArts Entertainment and from the legendary team led by Ron Gilbert and Tim Shafer. The game was the sixth to use the graphics engine SCUMM: it was modified and improved audio capabilities. This allowed smoothly change the music themes of locations and creating a more immersive experience for players. The game was reissued in July 2010. The new version included the classic visuals of the original game: you can simply switch to it via a menu. The original version was completed with new features such as all the dialogues were voiced, developers added achievements and comments from leading developers. In the game, as before, there are two difficulty modes: normal and light, for players who have not played quests before and are not ready for difficult puzzles.\n\n###The story\nThe plot of the second part begins with the story of the main character Guybrush Tripwood telling to two other pirates about the victory over LeChuck in the last game. The pirates noticed that they have heard this story a thousand times already and asked Guybrush to tell something new. The hero shares that the events of the new chapter of his adventures are unfolding right now: he is looking for the legendary pirate treasure of Big Whoop.\n\n###Key features\nThe game is a classic point-and-click adventure. The player moves through the pre-drawn locations, and all the animated actions occur in the pop-up window. A new part of the Guybrush adventures was highly anticipated: the game was even called the most anticipated in 1992. According to Ron Gilbert, although the game sold well, competitors like King Quest still remained far ahead. In 2009, Tim Schafer spoke about 25 thousand copies of the original copies of the original Monkey Island 2: LeChuck's Revenge.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":3775,"name":"Danganronpa: Trigger Happy Havoc","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fb/2fb35e31727f7ebc1f00bf998d0e22a7.jpg","description":"Hope's Peak Academy is home to Japan's best and brightest high school students—the beacons of hope for the future. But that hope suddenly dies when Makoto Naegi and his classmates find themselves imprisoned in the school, cut off from the outside world and subject to the whims of a strange, murderous little bear named Monokuma. He pits the students against each other, promising freedom to anyone who can murder a fellow classmate and get away with it.\nIt's up to you to find out who Monokuma really is, and why you've been taken from the world you once knew. But be careful what you wish for—sometimes there’s nothing more deadly than the truth...\nKey Features\nDaily Life, Deadly Life: Trapped in a school-turned-prison, students are murdering each other one by one. You’ll have to investigate each incident, search for clues, and talk to your classmates to try and get to the bottom of each brutal case!\nMock Trial: The nefarious Monokuma serves as judge, jury, and executioner as you engage in deadly wordplay, going back and forth with suspects, dissecting their statements and firing their words back at them to expose their lies!\nPopularity Contest: Sway classmates to your side in each investigation, squeezing information from them to figure out who did it. And when you do, turn up the heat in a variety of timing and reflex-based game systems to uncover the truth and save your skin!\nSteam Features: Supports Steam Achievements, Steam Cloud and Steam Trading Cards.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":2647,"name":"Manhunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c23/c23b578d6a9dd1c73ee403157184e793.jpg","description":"Manhunt is a third-person stealth-action game developed by Rockstar Games. The game caused a lot of controversy for its violent scenes.\n\n###Plot\nA death sentenced convict James awakens in Carcer City after his supposed execution by lethal injection. The protagonist finds himself equipped with an earpiece, in which he hears the voice of The Director. The Director offers James freedom in turn for helping The Director shoot his violent TV show. It is said that a gang called The Hoods is patrolling the neighborhood killing everyone they spot. James has to survive the night in Carcer City in order to get his freedom.\n\n###Gameplay\nThe players have to traverse multiple locations to complete a specific list of tasks. These tasks come down to getting somewhere, murdering a gang member, and finding items. \n\nThere is a group of special enemies called The Hunters which run to the players as soon as they are spotted. The game features an advanced stealth system. The players can be hidden in the shadows, yet if they step on something, a noise will be made, which can attract The Hunters.\n\nThere are two ways of executing an enemy - a direct confrontation or a stealth kill. It is much harder to kill an enemy using the first way, as the game encourages the players to use stealth kills. These stealth kills are often referred to as Executions. There are three types of executions, with each one varying in their speed and violence.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Rockstar North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":50576,"name":"Atomic Heart","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ee/6ee5cbe30c6b6c299a3288337d40a0f3.jpg","description":"Atomic Heart is an adventure first-person shooter, events of which unfolds in an alternate universe during the high noon of the Soviet Union. The principal character of the game is a special agent P-3, who after an unsuccessful landing on enterprise \"3826\" is trying to figure out what went wrong and to clear up a factory from went mad robots.\nAs of the game P-3 will receive a lot of weapon in his armory, there will be several quests, and he will learn to destroy one robot after another silently in order to clear his way to the event hall, where he will meet a main enemy - a huge robot with tentacles.\nA crazy Soviet setting, a hurricane action and a terrific story will not let you sleep even if you were born in the USSR. Restore peace and order and show us the best you can!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Mundfish","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":43982,"name":"Idle Champions of the Forgotten Realms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/246/246367eab7ccfaaad14ad4507deee067.jpeg","description":"Idle Champions of the Forgotten Realms is an official Dungeons & Dragons idle clicker game.\n\nIdle Champions challenges players to assemble a party of Champions and master the art of Formation Strategy. Players unlock new heroes, upgrade them to reveal special abilities, and collect epic gear. The key to glory is learning how to combine Champion abilities to defeat an onslaught of powerful monsters.\n\nKey Features:\nUnlock Renowned ChampionsCollect renowned Champions from the world of Dungeons & Dragons, including fan-favourites from the Force Grey series. Unlock more Champions and gear to add to your party in limited-time events.\nFormation StrategyMastering the position of each Champion to maximize their special abilities is the key to completing each adventure. Each Champion's abilities and gear requires careful thought to create the best combination. Only the most powerful formations will defeat the waves of Dungeons & Dragons monsters.\nExplore the Forgotten RealmsTake your Champions on a journey through the Sword Coast. Players will be able to explore familiar locations within the Forgotten Realms as they tackle each adventure. After launch, the game will be updated with content inspired by the official Dungeons & Dragons adventures, starting with a trip to Chult with the Tomb of Annihilation.\nRegular EventsThe game is updated regularly with limited-time events. Completing events unlocks new Champions and gear to add to the player's collection.A Note About Premium Purchases:\nYou can download and play Idle Champions for free, however, some premium in-game items can be purchased for real money.\nGems earned for free in-game can be redeemed for Silver Chests and Gold Chests that contain equipment, potions, buffs, and gold.\nSilver Chests contain 3 cards (Common to Uncommon rarity). They have a chance of dropping “Rare” equipment cards, but do not contain “Epic” equipment cards.\nGold Chests contain 5 cards (Uncommon to Rare rarity). They always contain a Rare equipment card and have a chance of dropping an Epic equipment card.\nGold Chests are available to buy in the shop for real money or you can wait and purchase them with gems earned for free during game play.\nBonus “Golden Epic” equipment cards are generally only available as a purchase bonus for real money transactions, though specific Golden Epic cards may become available through free means at Codename Entertainment's discretion.\n\nIn-App purchases range from $5-$50 per item.*Chance of a Rare drop in a Silver Chest is approximately 3.2%.\n**Chance of a Rare drop in a Gold Chest is 100% and an Epic drop is at least 10%.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Codename Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":47204,"name":"Getting Over It with Bennett Foddy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/941/941f173c573feebf92d62fad118d004e.jpg","description":"A game I made\nFor a certain kind of person\nTo hurt them.\nGetting Over It with Bennett Foddy is a punishing climbing game, a homage to Jazzuo's 2002 B-Game classic 'Sexy Hiking'. You move the hammer with the mouse, and that's all there is. With practice, you'll be able to jump, swing, climb and fly. Great mysteries and a wonderful reward await the master hikers who reach the top of the mountain.\nTo quote Jazzuo himself: \"The hiking action is very similar to way you would do it in real life, remember that and you will do well\".\nClimb up an enormous mountain with nothing but a hammer and a pot.\nListen as I make philosophical observations about the problem at hand.\nBetween 2 and ∞ hours of agonizing gameplay, depending. The median time to finish for my playtesters was 5 hours, but the mean was closer to ∞.\nLose all your progress, over and over.\nFeel new types of frustration you didn't know you were capable of.\nMagical reward awaits hikers who reach the top.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4234,"name":"Devil May Cry HD Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13a/13a97b75b6e6b999901f6dd6fda47848.jpg","description":"The popular stylish action games Devil May Cry, Devil May Cry 2, and Devil May Cry 3 Special Edition return in one collection! As Dante, the ultimate devil hunter, you'll join forces with appealing characters such as Trish, Lady, and Lucia and enjoy incredible action for the first time in blistering 60fps.\nDevil May Cry: The first appearance of Dante, the ultimate devil hunter! With the blood of a legendary demon warrior flowing through his veins, Dante takes on the king of the underworld, Mundus.\nDevil May Cry 2: Dance with the devil. Set decades after the first game, this sequel adds moves like the wall run and Rain Storm, bringing Dante's action to the next level of stylishness. The bonus mode Bloody Palace also makes its debut.\nDevil May Cry 3 Special Edition: This prequel to the first Devil May Cry introduces Vergil, Dante's twin brother. Customize your game style by selecting from various styles to level up and gain new moves and abilities.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":3849,"name":"Knack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/99d/99dddca3736b9fbcfa7630054de24a5f.jpg","description":"Knack is a beat 'em up platformer released by SCE Japan. It is the first title in the series, followed by Knack II, released 4 years afterward. The game was fancied to be a new generation Crash Bandicoot, it released simultaneously with the PS4 console and was provided bundled in some regions. \nGameplay centers around its self-titled protagonist whose primary ability is to disintegrate into little pieces called Relics and absorb various materials to be its parts. Thus Knack may turn into ice- iron- and crystal Knack getting bigger and smaller depending on the number of respectable materials within him. Other than that Knack is a usual beat them up: the player will be dodging, jumping, punching and kicking enemies in various fashions. \nThe game tells a story of a high-end world populated with advanced humans who have discovered the powers of Relics to compose Knack-like creatures and goblins who are presented as a lower race continually trying to start a war or rob humans.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":337960,"name":"Showdown Bandit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/845/845c169bc697b1e405ac2fe709a172b6.jpg","description":"Beware! For years kids tuned in to watch the televised puppet world of Showdown Bandit, whose colorful cast performed in front of a live audience of ecstatic children. Then without warning the show was unceremoniously canceled and the studio, props and puppets were left to rot. Yet somehow the show lives again and you're in the spotlight. Take control of the Bandit himself and explore the dilapidated sets of what was once glorious Showdown Valley in this top-down, stealth-action-horror game from the makers of Bendy.\nTry not to lose your wits or your strings as you sneak through the shadowy sets past a menagerie of eerie enemies and helpful inhabitants. Fight ONLY when you must! Don't be afraid to explore the creepiest, darkest corners as even the smallest clues could help you answer the biggest question of all ... who is really pulling the strings?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"naveed321isthebest","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":325094,"name":"SpongeBob SquarePants: Battle for Bikini Bottom — Rehydrated","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/793/79307648580a262f6cac402c3007efe0.jpg","description":"Are you ready, kids?\n The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!\nGAME FEATURES\nPlay as SpongeBob, Patrick and Sandy and use their unique sets of skills\nThwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots\nMeet countless characters from the beloved series\nREMAKE FEATURES\nFaithful remake of one of the best SpongeBob games ever created\nHigh-end visuals, modern resolutions and carefully polished gameplay\nBrand new horde mode multiplayer for up to two players, online and splitscreen\nRestored content that was cut from the original game like the Robo Squidward boss fight and more","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Purple Lamp Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":1451,"name":"Osmos","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b1/3b1855db98916d9d473922795f52a25a.jpeg","description":"Enter the ambient world of Osmos: elegant, physics-based gameplay, dreamlike visuals, and a minimalist, electronic soundtrack.\nYour objective is to grow by absorbing other motes. Propel yourself by ejecting matter behind you. But be wise: ejecting matter also shrinks you. Relax - good things come to those who wait.\nKey features:\nIndependent Games Festival finalist in three categories: Seumas McNally Grand Prize, Excellence in Design and Technical Excellence\nProgress from serenely ambient levels into varied and more challenging worlds. (47 levels, plus bonus content)\nConfront attractors, repulsors and intelligent motes with similar abilities and goals as you\nSelected as one of the 2009 PAX 10\nProcedural content: play random versions of any level\nSublime electronic soundtrack by Loscil, Gas/High Skies, Julien Neto, Biosphere, and more\nDynamic time-warping: slow down the flow of time to outmaneuver agile opponents; speed it up to raise the challenge","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Hemisphere Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18290,"name":"E.Y.E: Divine Cybermancy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c58/c588df86da16bf2f0432721b780cd5dd.jpg","description":"E.Y.E: Divine Cybermancy is an action RPG with shooter elements and a cyberpunk setting. You take on the role of a warrior monk, genetically upgraded and possessing psionic abilities. The in-game world is split by two forces that want to take the control over. You need to choose the side, however, you can’t trust anyone, even your closest friends and teachers. The game has different endings depending on your choices.\n\nThe protagonist is fully customizable. You can upgrade his abilities according to your style during non-linear missions and multiple quests. It’s on you to focus either on stealth or pushing - as the character’s body is mechanically enhanced, you can develop it any way you want. Moreover, you have “nine lives”: after the first nine deaths you will respawn immediately where you were killed, and only the tenth death will throw you back to the checkpoint.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Streum On Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13843,"name":"Dreamfall Chapters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48c/48c7e3e1268467b91b24c7da7c6539df.jpg","description":"Dreamfall Chapters is an episodic game of five chapters. It’s a direct sequel to Dreamfall: The Longest Journey and follows its protagonist Zoe Maya Castillo who has the power to control dreams. The game is set in two world - Stark and its magic clone Arkadia. The story starts with Zoe, captured and comatose, trying to escape from the World of dreams she is trapped in. Instead, she creates another body that doesn’t remember anything and starts a new life.\n\nDreamfall Chapters is heavily focused on dialogues, exploration, and puzzle solving. It intends to be an interactive movie and has no action and combat scenes. The world is only partially open but you can explore some locations beyond the main storyline. The linear plot has the only ending, however, decisions you make throughout the game have a great impact on side arcs. The game warns you about important choices with “The balance has shifted” message.\n\nBeing the final part of The Longest Journey series, Dreamfall Chapters makes a point to all previous titles and storylines.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red Thread Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":881,"name":"Forza Horizon 3","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/30a/30afe3a3cb06849dc032ef3b9295f180.jpg","description":"Forza Horizon 3 is a racing open-world game developed by Playground Games. It is a part of a large Forza series including 11 titles in it with Horizon 3 being the 9th heading in the row. It is, however, uncertain to claim that there is a unified narrative in racing games, so all 11 titles more likely represent one universe, but do not come in specific order.\r\nAs mentioned earlier, the title series does not follow a distinct storyline. Speaking of surroundings, nonetheless, it is safe to say, that the Horizon 3's scene is an Australia. The previous chapters of racing have pushed a narrative about the players being a participator of Horizon Festival. Now the protagonist becomes a host of the event, so they must play organizing roles, too. For example, hire drivers and adjust the racing grounds.\r\nThere are some events players can be a part of.  For example, drifting competition, Bucket List challenges and time trials. All of them utilize the same mechanics of getting to the finish line as fast as possible. There are more than 350 cars available, let alone DLC ones. 4-person co-op included along with multiplatform races between PC and Xbox One.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playground Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19281,"name":"Dustforce DX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7f/f7fb42b2115c3730c00248dafe57e2d0.jpg","description":"Dustforce DX is the updated version of Dustforce, a platformer game where you need to clean up the world of dust. DX update added new maps and music. The tutorial was also redesigned to be friendlier to newcomers. In fact, DX version extends the game’s audience from a very hardcore to the medium one, giving more time to master the gameplay.\n\nAs a part of a four-member team (with AI teammates or in co-op with real players) you go through levels cleaning them and fighting monsters you meet. There are four playable characters in Dustforce, however, they differ only in the appearance with slight stats’ changing. \n\nThe goal of the game is to reach the other side of every level and kill enemies there.  You can perform different moves, featuring jumping, climbing walls, several attacks and so on. The game places a heavy focus on timing so overcoming numerous obstacles become very challenging.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hitbox Team","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":401808,"name":"Half-Life 2: Update","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb7463d103dc40f6f3a3c9ac3b4b11a5.jpg","description":"A completely free and extensive community-developed update for Half-Life 2 featuring beautiful lighting, countless bug fixes, and a brand new Community Commentary Mode. With Half-Life 2: Update, there’s never been a better time to revisit City 17.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"}]},{"id":366083,"name":"Black Book","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d6/1d6f294a27ff1b90d4a4a79d42d3f7b2.jpg","description":"A fusion of card-based RPGs and Adventure games, “Black Book” is a haunting tale of a young sorceress, who gave her life to serve the dark forces. Dive into the cold, yet alluring world of Russian folktales - and uncover the secrets that hide in the darkness.\r\nA young girl named Vasilisa, destined to become a witch, decides to throw her fate away and marry her beloved - but that dream is shattered when her betrothed dies under mysterious circumstances.\r\nAching for her lost love, Vasilisa seeks out Black Book - a demonic artifact, said to be powerful enough to grant any wish to the one who uncovers all 7 of its seals.\r\nJoin Vasilisa in her adventures across Russian countryside, as she solves the woes of common folk by confronting demons and performing exorcisms.\r\nUncover the seals of Black BookUnleash hellish spells on your enemies! Collect spell cards and new skills as you progress.\r\nA Historic AdventureSolve riddles and complete side-quests to learn more about the cold world of early XIXth Century Russia.\r\nLead a Demonic FlockSend demons to do your bidding, but be careful -  idle demons will torture you if you don’t find them something to do!\r\nMyths and legendsExplore a world based on Northern Russian mythology. Learn from an in-game encyclopedia, created with the help of expert anthropologists  - and find all folk tales hidden within the game!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Morteshka","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":13350,"name":"Deponia Doomsday","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d87/d8788f5bdc90c142f60f66f99cfdd97b.jpg","description":"Deponia Doomsday is a point-and-click 2,5D adventure. There is a canonical Deponia trilogy with Doomsday being the spin-off.\n\n###Plot\nThe narrative is centered on the planet of the same name. One day, all of the Deponia's dwellers were ordered out to Elysium. So, the Deponia is currently seen as a dumpster behind all the inhabitants who left — all life forms there are counted to be dead.\nWe follow an arc of Rufus — he is excited to continue the doings of his father and carry on the study of a lifetime. His goal is to get in touch with Deponia. However, unfortunate events come forward, and Rufus' ship crashes, and the protagonist now has to inhabit Organon — the ship incorporated by the company which is liable for dropping toxic waste on Deponia's surface dwells. Rufus is firmly determined to seek authenticity in the events of Deponia's difficulties.\n\n###Gameplay\nAll of the games in the Deponia series are point-and-click adventures which share the settings of Deponia planet. Every title in the series feature\nThe game utilizes a 2,5D point of view meaning there are deepening to the 2D environment. \nThe list of possible actions in the game is limited by interacting with the objects and NPC's, combining objects and using them to aid the player in multiple puzzles throughout the journey.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":338386,"name":"NBA 2K20","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fdb/fdb65025dee2f0edb8c2b587afaff853.jpg","description":"NBA 2K has evolved into much more than a basketball simulation. 2K continues to redefine what’s possible in sports gaming with NBA 2K20, featuring best in class graphics & gameplay, ground breaking game modes, and unparalleled player control and customization. Plus, with its immersive open-world Neighborhood, NBA 2K20 is a platform for gamers and ballers to come together and create what’s next in basketball culture.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1-4 players\nNetwork Players 2-10 - Full game requires PlayStation®Plus membership to access online multiplayer\n60GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2005-2019 Take-Two Interactive Software, Inc. and its subsidiaries. 2K, the 2K logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. The NBA and NBA member team identifications are the intellectual property of NBA Properties, Inc. and the respective NBA member teams. © 2019 NBA Properties, Inc. All Rights Reserved. Officially licensed product of the National Basketball Players Association. All other trademarks are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"2K","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":16254,"name":"A New Beginning - Final Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/943/943d7d9779bc7dc548285889ca5384ff.jpg","description":"A point-and-click adventure from Daedalic Entertainment, A New Beginning is a story of time travel and ecological cataclysms. Presented in-game future is dark, mostly due to the fact that life is possible only deep underground, in caves and crevices. In order to prevent the full extinction of all life forms of the face of the earth, some people invented the time machine that will help to locate the beginning of the chain of events that brought their world to ruin. Fay, one of the few time travelers, has to convince Bent Svenson, that his recent discovery of bacteria based biofuel is the only key to the survival of the planet in the future. \nNew Beginning consists of 11 chapters, where the player will control Fay or Ben. It is not possible to switch between characters interactively, but the story and gameplay are direct and straightforward. Final Cut was brought to the Steam 3 times and met rejection because Valve Corp. considered their target audience not interested in the genre in general, but Daedalic Entertainment succeeded and brought the entire line of their products to the platform.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":274756,"name":"Journey to the Savage Planet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/187/18725d2559e75fdfbe019333682c0ec8.jpg","description":"Journey to the Savage Planet is an upbeat first-person adventure game set in a bright and colorful alien world filled with weird and wonderful creatures. As an employee of Kindred Aerospace, which proudly touts its rating as the “4th Best Interstellar Exploration Company”, players will be dropped onto an uncharted planet deep in a fictitious, far-away corner of the universe. Launched with high hopes but little equipment and no real plan, players are tasked with exploring, cataloging alien flora and fauna and determining if the planet is fit for human habitation.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Typhoon studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":17650,"name":"Painkiller Hell & Damnation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be5/be511151fee6b121d7694b3d875b1835.jpg","description":"Painkiller Hell & Damnation is a first-person shooter, a remake of Painkiller, that continues its events. The game ignores almost all expansions to the original title, except for Battle Out of Hell. The remake got new monsters, changed game balance and a coop mode with a female teammate.\n\nThe game introduces a brand new story. In the beginning Death makes a deal with the protagonist, Daniel Garner that she will return his dead wife in exchange for 7,000 souls. From this moment the action begins, as you get a huge magic gun and start killing hordes of monsters.\n\nIn the core of the gameplay lays classic shooter mechanics; you can use multiple weapons, including brand new ones to defeat demons. The game consists of several chapters and original levels, each set in a unique landscape. Besides the campaign that can be completed alone or in a two-players co-op, there are several PvP modes, for example, survival and deathmatch for up to eight players.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3238,"name":"Fortified","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4df/4dfcdfccc02b4a5bab50d677f038269b.jpg","description":"While the Cold War did not turn into a real war, the Earthmen are invited to fight with the Martians - with all the arsenal of the Cold War and several experimental technologies.\n\n###Synthesis of genres\nThe game achieved a productive blending of several genres - the third-person shooter, real-time strategy, and tower defense.\n\nFrom the genre of strategy into the game came the need to build a network of defensive structures capable of resisting the pressure of mechanical invaders. From the genre of the shooter from the third person the game took a powerful action in the entourage of several visual styles - comics of the 50's, neon lights of the 80's and 90's, cold dynamics of the 00's. Much in the design of locations is a quote or allusions to famous works of science fiction of the fifties.\n\n###Instead of the invasion of the Reds, an invasion from the Red Planet\nMars invades the US with its iconic 50s-styled flying saucers, insectoid drones, various robots in the size of a skyscraper, rolling balls that turn into death machines on stilts, floating bombs, iconic 50's-styled flying saucers. The aliens are rolling in waves, from different directions.\n\n###Sci-Fi archetypes\nCharacters that can be played correspond to the chosen style of pulp-sci-fi, including a jetpack piloting heroine, a shotgun wielding space cowboy, a secret government agent, and a battle hardened Marine captain.\n\nYou can play on behalf of one of the characters, but you can also unite with others, and this will give the most guaranteed victory.\n\n###Gameplay\nYou can fight in different ways - attack the aliens, personally shooting them, or building a network of defensive structures. When building, you can use money, sell unnecessary.\n\nYou can alternate the way of action - to run and shoot, and then to build something and so on. Of course, in this situation, there is no time for deep strategic calculations, so the strategic part of the game is not as elaborate as in the games of the strategic genre itself.\n\nThe canon of the genre tower defense is presented in the game much more fully - there are quite useful tools, a great variety of units. For defense with weapons, the player has the soldiers with rocket-propelled grenades, gun turrets, weapons that freeze and fire the enemies and so forth.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Clapfoot","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":1241,"name":"ClusterTruck","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d02/d02037bd63e30d3634846c4a22af05b7.jpg","description":"Clustertruck is a new kind of platformer on-top of a speeding highway!\nUse agility and acrobatics through insane levels in a game of \"the floor is lava\" on top of unpredictable, speeding trucks!\nThe game only gets harder when dangers such as swinging hammers, lasers and flamethrowers are added!\nFeatures:\nA campaign mode which gradually gets more and more evil\nUnlock new abilities like the Grappling Hook, Truck Cannon and Time-Control!\nAn in-game level editor\nSteam workshop support for sharing player-made levels\nA replay system\nOnline leader boards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"tinyBuild","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":17768,"name":"Firefall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d8/2d8d9d70988fdaab42886dda974d31a6.jpg","description":"Fundamentally built to be a completely Free-to-Play AAA MMO Shooter, Firefall delivers an engaging gameplay experience like no other.  With a constantly changing world, deep narrative, endless customization, and rewarding player progression, Firefall will consistently deliver spectacular content that will please both PvE and PvP players.\nReclaim Earth\n\"I grow tired of watching my friends die in battle day after day.  The Chosen have claimed more of us than we have of them, and the Melding consumes more of our planet by the minute.  This is still our home, our planet, and we want it back.  Join us and help us fight this dreaded war, because as our world falls, we rise together.\"  - Unknown ARES Pilot on the frontlines.\nKey Features\n•\tExplore a vast, evolving open world with dynamic content that responds to player interactions.\n•\tDiscover the lore of Firefall through episodic narrative.\n•\tCombat your enemies in a skill based shooter in either first or third person view.\n•\tEngage dynamic Missions and Events, including epic Titan Battles.\n•\tUpgrade your Battleframe with limitless crafting, loot, and progression.\n•\tOutfit your character with endless customization options.\nDynamic, Living, Open World\nExplore a vast open world from New Eden to Devil’s Tusk.  Become an elite ARES pilot and be prepared to fight an array of creatures as well as confront the Chosen.   Don a variety of Battleframes and destroy your enemies from either a first or third person viewpoint.\nHeroes Will Rise\nCombat the Chosen to reclaim earth and become the best ARES pilot in your class.  With familiar and highly polished shooting mechanics, your skill and dedication will be rewarded.  Firefall is action packed with rewarding content, including massive Titan Battles for PvE and skill-based open world PvP.\nA World without Limits\nFirefall is the first AAA Free-to-Play MMO Shooter.  Outfitted with military-grade battleframes, players will be able to collect equipment and materials to customize and strengthen their arsenal of weapons and abilities, while experiencing Firefall’s rich lore and engaging content.  With epic loot to be unearthed and rewarding level progression to be achieved, the possibilities in Firefall are limitless.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Red 5 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10118,"name":"Legacy of Kain: Defiance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f49/f49f056eb2ca381b739462927250d6fb.jpg","description":"Legacy of Kain: Defiance is an action-adventure with a focus on the puzzles and the battles developed by Eidos. The game is the fifth and the last installment in the LoK series. \n\n###Gameplay\nThe series share a common mechanics — the third-person view, and the abilities mechanics — the protagonist can shapeshift and use various spells. However, Defiance brought new elements into the franchise as it implements the exp system meaning that skills and upgrades for powers can be bought for the points you gain through the progression further. Defiance is also strictly linear — there is no actual open-world and player is forced to complete the stages and chapters one by one in the given order. \nAnother difference is playable characters — this is the part in which player can gain control of Kain and Raziel. The last difference is the weaponry: both Kain and Raziel possess only Soul Reaver in its different iterations — the previous games featured a more extensive variety.\n\n###Plot\nThe title is the direct successor of Soul Reaver 2. The story centers around Kain saving Raziel and encountering Moebius the Time Streamer for the explanation of what is happening after the time paradox in the world of Nosgoth's. The characters are out for a quest of sticking Nosgoth out of the troubles they inflicted on it.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":4521,"name":"Call of Juarez: Bound in Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f43/f43c9742f8e8300e5a4d22ffa2d7ac08.jpg","description":"THE OLD WEST, 1864. In order to save their family, the McCall brothers will kill anyone who stands between them and the legendary Gold of Juarez.  But when the allure of women and money tests their bond as brothers, will the blood they share prove to be thicker?\nBecome a Gunslinger  Harness a variety of weapons from various pistols to heavy-caliber cannons and machine guns. Every accurate shot increases your concentration, which allows you to unleash deadly shooting modes when outnumbered  and even deadlier ones when the brothers work together.\nDual Collaborative Gameplay  Choose to embody Ray or Thomas, each with a distinctive gameplay style (close- or long-range), specific abilities (lasso, dynamite, etc.) and arsenal of deadly weapons (dual guns, long-range carbine, etc.). Take advantage of each of their strengths and you just might survive some of the fiercest fights imaginable.\nNever-Before-Seen Western Experience  Experience iconic settings full of outlaws in the West before it was tamed. The McCall brothers face a renegade Apache Chief, a greedy Mexican bandit, a vindictive colonel  just a few of the underhanded villains standing in the brothers way. Explore the vast natural landscapes of the mythical Wild West and its legendary period on horseback and in wagons and canoes.\nInnovative Online Multiplayer  Unique modes, numerous maps and a variety of classes guarantee endless hours of Wild West action.\n\nPlease note that as of August 2016, the online features for this game are no longer supported. The Multiplayer mode / Co-op mode will no longer be accessible.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":287342,"name":"Subnautica: Below Zero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/437/4377bf00ded8a2ba781aa74d8bff9220.jpg","description":"Below Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe, and is currently in development by Unknown Worlds.Watch out!\nBelow Zero is not finished! It is in active development: Full of bugs, missing features, and performance issues. If you would like to play Below Zero when it is finished, follow our development progress. We'll keep you informed as updates improve the game.Return to planet 4546B\nDive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientist posted to a research station on the planet's surface, you are tasked with studying alien artefacts...\nThe Vesper space station orbits high above you, sending supplies, instructions, and receiving samples you launch from the surface.When disaster strikes the research station, you must improvise to survive: Construct habitats, scavenge for resources, hunt for food, and craft equipment.Explore new biomes\nSwim beneath the blue-lit, arching growth of Twisty Bridges. Navigate treacherous ice floes on the ocean surface. Clamber up snow covered peaks, and venture into icy caves. Maneuver between steaming Thermal Vents. Below Zero presents entirely new environments for you to survive, study, and explore.\nDiscover new lifeforms in the icy depths of 4546B. Swim through the giant Titan Holefish, escape from the aggressive Brute Shark, and visit the adorable Pengwings. Some residents of the frozen ocean will help you, and some might try to harm you.An ocean of intrigue\nWho were the aliens who came here before? Why were they on this planet? Can you trust your commanders? Below Zero extends the story of the Subnautica universe, diving deep into the mystery introduced in the original game. Open up new story elements with every Early Access update.About the development team\nBelow Zero is being created by Unknown Worlds, a small studio that traces its roots back to the 2002 Half-Life mod Natural Selection. It is the same team that created the original Subnautica. The team is scattered around the globe, from the United States to the United Kingdom, France, Russia, Austria, Australia, Germany, New Zealand, Taiwan, and many more places.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Unknown Worlds Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":3121,"name":"Tales of Zestiria","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fa/3faaa0edbc190373d53ade59de1acafe.jpg","description":"Tales of Zestiria is a Japanese role-playing game, the fifteenth installment in Bandai Namco’s Tales series.  \n\n###Story \nThe game takes place on Glenwood – a continent in the middle of the mostly oceanic world. The story follows Sorey, a young man with a rare ability to interact with a powerful and mysterious race of Seraphim. Sorey begins his adventure to cleanse the Glenwood from “malevolence,” a dark power that transforms everything it touches into aggressive monsters.  \n\n###Gameplay \nThe game encourages exploration of its vast open world. Throughout the game, you’ll come across various settlements, dungeons, towns and other points of interest.\nThe combat system in the game is action-based and focuses on combining physical attacks with magical abilities called artes and spells. Additionally, all characters have their unique Mystic Artes that can deal high damage to enemies. During the game, you’ll come across different characters that join your party and assist you in battle. One of the most notable gameplay mechanics on Tales of Zestria is some of your characters can fuse with seraphs to boost your stats and get new powerful abilities. There are various items, pieces of armor and weapons in the game that have different effects and stats. You can fuse certain items to make them more powerful.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9976,"name":"Star Conflict","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b01/b016f8c8cd48b7093004dab596b7382f.jpg","description":"This is a free space MMO action game from the Russian studio Targem Games. The player controls spaceships that perform different roles in combat. Each player can develop abilities, and learn special skills, develop new strategies. Under the control of the player, there is a whole fleet of different ships from formidable frigates to small reconnaissance ships. Players can also unite in alliances and fight for control over the galaxy's sectors. The gameplay of similar in many ways to another famous game in the genre E.V.E, Star Conflict is more action and less economic than its competitor, and an understandable control scheme allows the players to perform crazy maneuvers.\n\nPlayers can participate in session based PvP battles or explore the Open Space, where they complete various quests and missions, fight AI controlled enemies and gather resources. With the 'Journey' update developers redesigned the progression system. Players can now earn experience points and unlock new content by taking part in a story-driven campaign.\n\nAccording to the plot of the game, three thousand years passed after the first shuttles with the settlers left the Earth. Now the universe is divided between militarised star empires and scattered groups of mercenaries. In sector 1337, fragments of the mysterious civilization of aliens are found. For ancient artifacts, hunting begins and from all corners of the galaxy fly amateurs of adventure, hunted to profit.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Star Gem","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":326238,"name":"Microsoft Flight Simulator 2020","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89c/89ceadfd42109aa0d80e9c5dbc86f277.jpg","description":"Microsoft Flight Simulator is the next generation of one of the most beloved simulation franchises. From light planes to wide-body jets, fly highly detailed and stunning aircraft in an incredibly realistic world. Create your flight plan and fly anywhere on the planet. Enjoy flying day or night and face realistic, challenging weather conditions.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Asobo Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]}]