[{"id":442864,"name":"PGA TOUR 2K21","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1ec/1ec1d732eb8befab6e9838926d95f6f8.jpg","description":"Play against the pros. Play with your crew. In PGA TOUR 2K21, you can play by the rules or create your own!\nALL-NEW PGA TOUR CAREER MODE\nProve you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\nPGA TOUR PROS AND NEW COURSES\nPlay against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\nBUILD YOUR MYPLAYER & DREAM COURSE\nCreate and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\nDOMINATE THE GREEN AT ANY SKILL LEVEL\nRookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\nGET THE PARTY STARTED\nHit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\nMAKE YOUR OWN RULES\nCommand your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\nTHE MOST REALISTIC COURSES EVER\nReal-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"HB Studios Multimedia","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1039,"name":"Lichdom: Battlemage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9bd/9bdd4a4a2953666d27e88ff72edfd845.jpg","description":"In the game, you can follow two storylines, depending on whether you choose a male or female character.\n\nBoth versions of the character have their own reasons to hate the leader of evil forces, Shax. If a female character is selected, his sister is abducted by Shax as a result of a dispute over the jewelry that the player was selling. In the case of a man's game, the player refuses to sell the sword to Shax, resulting in Shax killing the character's wife.\n\nEverything else in the game is the same for both female and male characters.\n\nThe character awakens to a new life by the great magician Roth. The great magician reveals to the character that the character was chosen to become the new Dragon - there have already been more than a dozen other Dragons before. The Dragon is given combat magic, the Dragon's task is to protect this world and rid it of lies, corruption and evil spirits.\n\n###Gameplay\nThe main character, male or female, accepts from the great magician Roth the name Dragon and the mission of improving the world. To achieve this, he follows a linear route, between checkpoints and fast travel locations known as Reliquaries. The hero is armed with magic - and it does not require replenishment of any resource, it always is, always works.\n\nThe enemies of the Dragon are diverse and contain a randomized loot, dropping out of them when defeated. The value of loot based on the rarity level of the character has been achieved through reaching checkpoints.\n\nThe magic of the hero, the power of his spells can be greatly increased if the hero performs specific tasks.\nThe main character helps another character, male or female. This character acts as a scout whose name is Gryphon.\n\nAfter the end of the game, the player can continue to play the same character in order to strengthen the power of his spells - for this you should start a New Game Plus.\n\n###Magic\nThe Hero can have 3 Sigils applied at any given time. Sigils - Fire, Ice, Lightning, Corruption, and more - act as elemental schools of magic for the player to cast.\n\nSigils are unlocked as the player moves in the game.\n\nYou can switch between the Sigils you use at a Reliquary.\n\nThe level of each Sigil can be increased by achieving certain goals. The characteristics of magical spells can be improved and customized, by conscious manipulation and using the loot dropping out of enemies.\n\nSpells act not only as weapons of attack, but also as shields.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Maximum Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":9668,"name":"Galactic Civilizations III","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f8a/f8ae83f70a0f2631d7123a5caca19ace.jpg","description":"Galactic Civilizations III is a turn-based strategy with a high focus on explorations, expanding, exploitation, and extermination also called 4X strategy subgenre. This is the third part of the franchise of the same name featuring a lot of DLC's.\n \n###Plot \nThe title features some stories to hold the player's interest during the play session within the story campaigns, but when one creates own campaign, he is not allowed to pursue any storyline from the main game.\n\n###Gameplay \nThe in-game locations are procedurally generated, so every iteration of the game's experience feels different. There are multiple ways to reach to designed goal — political, economic and cultural. One can build the system of ships in various ways thanks to Crusade system: fleet may be composed out of the little amount of small and strong ships or a hive of feeble vessels. \nThe game size varies as well — one can create a little map to test some cultural features brought in the nearest DLC or create a vast 400x400 squares locations with up to 100 enemies and unfold massive space battles.\nAs it is a PC game, the broad category of non-official add-ons is available called mods. One can practically turn the game's visuals and story into every pop-culture universe starting with Star Trek and ending with Pixar cartoons.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":5916,"name":"The Room Two","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce8/ce8e62ef80774d8ac6396372a121bece.jpg","description":"Following the release of The Room in 2014, Fireproof Games are proud to bring the critically acclaimed sequel to PC.\nThe Room Two continues the time-spanning journey of its predecessor while significantly expanding its unique puzzle gameplay. Follow a trail of cryptic letters from an enigmatic scientist known only as “AS” into a compelling world of challenging mystery and tactile exploration.\nDevelopment on this fully-enhanced HD version of The Room Two began shortly after the mobile release of The Room Three late in 2015 and has involved creating more detailed environments for each level as well as rebuilding and re-texturing every asset in the game.\nFireproof Games are a small independent team working in Guildford in the UK. We self-published our first game The Room on iPad in September 2012 and were stunned with both the critical success and our new-found fan-base, not to mention multiple international awards. The Room games have since changed our lives and we hope you enjoy playing them as much as we enjoyed making them.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Fireproof Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":713,"name":"Ultimate Marvel vs. Capcom 3","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/106/10679840f87dba8f493612d9d542d566.jpeg","description":"Marvel and Capcom join forces to deliver the most frenetic 3 vs. 3 tag battles ever with Ultimate Marvel vs. Capcom 3.  This release comes fully loaded, including all previous DLC, and the Marvel vs. Capcom: Official Complete Works.  Select some of the most iconic Marvel and Capcom characters, and customize your team with \"Heroes and Heralds\" mode.  Once you've honed your skills, hop online and go head-to-head against players from around the world to see who is the strongest in the universe.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":3181,"name":"Ascendant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f4/8f4ccefd9849cc0ad08fc151ecc728a6.jpg","description":"Defeat legendary abominations, build-craft unstoppable combinations of enchanted items, investigate an ancient evil, and ascend to freedom!Ascendant is a dungeon crawler with heavy Rogue-like elements. You will encounter 3 challenging biome specific enemies types as well as a new Mini-Boss on every floor! Open soul chests to acquire items with magical attributes. Many of these items synergize with each other to create powerful combinations.Key Features: 3 Unique Biomes  7 Bosses  11 Mini-Bosses  30 Enemy Types  800+ Abilities & Items  Tangia Enabled Tangia Integration:Through the power of Tangia, streamers can allow their audience to directly control their game!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hapa Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":297320,"name":"WARSAW","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/92e/92e1e8dd0b1fd2071d88c91590b72b3b.jpg","description":"OWN THE CITY\nUse everything at your disposal to help a team of accidental heroes survive the onslaught in their home city and overcome tremendous odds stacked against them.\nEmbarking on missions of varying difficulty take on the Nazi oppressors from the confines of your unit’s hideout. Draft heroes from every field of life – young and old, men and women, soldiers and civilians and stand your ground against the enemy that took away their homes and families.MAIN FEATURES\nTurn-based tactical rpg with characters of varying classes, and with skill and resource management in immersive WW2 setting\nA deep tactical combat system with multitude of complementing skills, weapons and character abilities\nCharacter stories and backgrounds delivered through gameplay as well as numerous historical and fictional events happening under specific game’s circumstances\nIncredible replay value due to non-linear gameplayTHIS IS YOUR FIGHT\nCommand squads with recruits of Underground Army, scouts, survived civilians, criminals and accidental allies, in their heroic dash to regain control of the city. As a member of Secret Army stand up to your duty and attempt to fullfill orders by setting out on patrols, combat missions and special assignments. Negotiate with encountered individuals and teams to join your forces. Wipe out enemy patrols, realise orders and attempt to salvage any supplies you can find.\nFight against overwhelming Nazi forces using skills, smarts, and urban warfare tactics as your only means of opposing the ruthless and well-armed units of the enemy. Engage in relentless battles in turn-based combat, using cover, flanking and complementing skills to get the upper hand. Leverage your heroes’ unique attributes in fighting the enemy.\n\nRetrieve weapons, ammunition and collect resources as you explore the ruined streets. Familiarise with a wide range of historically-accurate weapons, uniforms and items, to adequately equip insurgents for their scouts. Manage your unit with required supplies to provide for all of their needs.\nFall back to shelter after the fight, regroup, heal and restock your team members. Keep developing the heroes’ skills and attributes while you plan for the next move.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixelated Milk","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":59306,"name":"Insurgency: Sandstorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a5/0a56d96dd280a5d4141a097629d902e3.jpg","description":"Pre-Purchase Offer\n*Includes 10% Early Adopter discount available until September 26 + 10% Loyalty Discount.\n- To benefit from this offer, make sure you are logged into your Steam account and that Insurgency is available in your library.\n- The loyalty discount offer will remain after the release of the game until the end of 2018.\n- Loyalty discount only applies to the PC version of Insurgency: Sandstorm.\nStream Session\nAbout the GameInsurgency: Sandstorm is a team-based, tactical FPS based on lethal close quarters combat and objective-oriented multiplayer gameplay. Sequel to the indie breakout FPS Insurgency, Sandstorm is reborn, improved, expanded, and bigger in every way. Experience the intensity of modern combat where skill is rewarded, and teamwork wins the fight. Prepare for a hardcore depiction of combat with deadly ballistics, light attack vehicles, destructive artillery, and HDR audio putting the fear back into the genre.An intense atmosphere putting the terror into modern combatMove with speed and caution as you push through the war-torn environments of a fictional contemporary conflict in the Middle East. Death comes fast, ammunition must be carefully managed, and the environment must be tactically navigated at every step toward victory.Insurgency: refined and expandedFor the first time in an Insurgency game, customize your character to show your veterancy with diverse sets of clothing, uniforms, accessories, and character voices. Coordinate fire support with your team, engage enemies with vehicle mounted machine guns, and go head to head in small scale high speed competitive matches. Wield new weapons and new upgrades to outmaneuver, outflank, and outsmart the enemy.War at its realestContinuing Insurgency’s acclaim as the most atmospheric shooter, Sandstorm is built on Unreal 4 to bring its gritty close-quarters combat into a whole new era of realism. Skill is rewarded, and survival is paramount. Feel every bullet, and fear every impact.Key FeaturesSequel to the indie breakout FPS Insurgency, now with 5 million units sold. Sandstorm is reborn, improved, expanded, and bigger in every way.\nCharacter and weapon customisation to show your battle-hardiness.\nUnprecedented audio design with positional voice-chat for realistic teamwork, and heart pounding ambient audio to bring you into the battlefield.\nPeek around corners, tactically breach doorways, use smoke to cover your team’s advance, and call in air support.\nBattle across expansive maps in up to 16-versus-16 player game modes, or 8 player co-operative against AI, now with machine gun mounted drivable vehicles.\nCompetitive multiplayer features including matchmaking, broadcasting UI, and replays.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"New World Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":437042,"name":"WWE 2K Battlegrounds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a4c/a4c1fd4265ac2c1edc87cb9a6a7644e4.jpg","description":"Completely new WWE gaming experience that will feature arcade-style action and over-the-top Superstar designs, environments and moves. We’re focusing on social pick-up-and-play fun, but with plenty of depth for those who want to get way into it.\n\nThe world of WWE is your battleground with over the top, arcade action as your favorite WWE Superstars and Legends battle in interactive environments around the world. Compete using special abilities and power-ups in match types like Steel Cage, Royal Rumble, and more!\n\nBattle Across the Globe! Play through a new story mode told through original comic strips, alongside Paul Heyman and Stone Cold Steve Austin to find the next WWE Superstars while unlocking unique characters and Battlegrounds. It’s Your Battleground! Make WWE 2K Battlegrounds your own with tons of customizable parts as you create and edit your own characters and Battlegrounds! Battle with Friends - Online or on the Couch! Compete in Online Tournaments or stake your claim as King of the Battleground against players from around the world! Plus, battle it out in local multiplayer and dominate your friends.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":499264,"name":"Age of Empires III: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f68/f68f04eeeadaa87cf0d2534306f96850.jpg","description":"Age of Empires III: Definitive Edition completes the celebration of one of the most beloved real-time strategy franchises in definitive form with enhanced features and modernized gameplay.\n\nCommand mighty civilizations from across Europe and the Americas or jump to the battlefields of Asia in stunning 4K Ultra HD graphics and with a fully remastered soundtrack.\n\nNow featuring two new game modes: Historical Battles and The Art of War Challenge Missions, including all previously released expansions and all 14 civilizations, plus two brand new civilizations – the Swedes and Inca.\n\nHead online to challenge other players with updated online multiplayer with cross network play and enjoy modern gaming features including spectator modes and mod support.\n\nComplete your collection with this final chapter in the Age of Empires Definitive Edition journey.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Forgotten Empires","platforms":[{"id":0,"name":"PC"}]},{"id":580972,"name":"Alan Wake 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b9/5b963d7633cd640fa2dbc4069d1c6377.jpg","description":"Alan Wake 2 is a survival horror game with an intense atmosphere and a twisted, layered, psychological story - it is the long awaited sequel to Remedy Entertainment's award-winning 2010 psychological thriller, Alan Wake, and 2021's Alan Wake Remastered.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":29746,"name":"Guild Wars 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/420/4205650e0fd16a5ba7bf4f8524fac1f1.jpg","description":"Guild Wars 2's open world is all about discovery and exploration. Check your content guide for suggestions when you set out on your adventures, consult your compass to find interesting landmarks…or just pick your favorite direction to travel in and let adventure find you. Tyria is full of characters with their own stories and goals, and you'll be rewarded for helping them out—or thwarting their plans—by completing renown hearts and dynamic events. Read our new player guide for more tips!\nWhen you meet other players in the open world, you don't need to join their party to lend a helping hand, investigate a secret jumping puzzle, or team up against a deadly world boss. Don't grind; play the way you want to play! Whether you're reviving defeated players, rescuing soldiers from a Risen onslaught, or gathering herbs, you'll earn experience points.\nArm your character with an arsenal of new weapons as you play. Every profession wields them differently, and each type has its own playstyle, which you can refine and customize by unlocking and equipping hundreds of skills and traits. If you want to jump straight into structured PvP, go for it—every player competes at the same level, with access to the max-level gear and build options you need to make your mark.\nIf you love fashion, express yourself with the perfect character design! When you equip new weapons and armor, you'll unlock their skins in your wardrobe. Make them truly yours with thousands of possible combinations and a massive selection of collectible dyes.\nUpgrade your free account with a Guild Wars 2 expansion and get access to log-in rewards, additional character and bag slots, expanded chat features, and more. Visit the Black Lion Trading Company in the game and use your Steam Wallet to upgrade.\nExpansions and Living World seasons feature unique rewards and new Masteries to expand your character's abilities. Unlock and upgrade your glider in Guild Wars 2: Heart of Thorns, befriend a stable of mounts with powerful movement skills in Guild Wars 2: Path of Fire, and learn to fish and pilot a skiff in Guild Wars 2: End of Dragons. Each expansion grants access to nine elite specializations that unlock new weapon choices, skills, and abilities for your profession. You'll also be able to select the revenant profession at character creation and channel legendary heroes and villains from Tyria's history.\nLiving World seasons continue the Guild Wars 2 story between expansions and must be purchased separately through your Story Journal or in Gem Store bundles. Play Living World episodes to unlock new explorable zones, rewards, and Masteries.\n*Living World episodes become playable at level 80. Players may need to relaunch the game for the upgrade to take effect.\n**Please note that existing Guild Wars 2 player accounts cannot be accessed via Steam","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"ArenaNet","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9850,"name":"Rise of Nations: Extended Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b36/b36e7eef6b9d72c0f1583218e9931004.jpg","description":"Rise of Nations\nRise of Nations is a real-time strategy game that spans all history.\nStart with a single city in the Ancient Age; gather resources; build an infrastructure; research technologies; construct Wonders of the World such as the Pyramids and the Eiffel Tower; and expand your military might across the world, conquering hostile nations with bombers, battleships, and tanks—all over your lunch hour!\nIn Rise of Nations there are:\n18 Nations—each with special abilities and unique military units.\nOver a hundred military units operating on the ground, sea, and air— from Hoplites to Frigates to Helicopters.\nOver two dozen buildings with upgrades and technologies that will take your nation from a small City to an Information Age society.\n14 Wonders of the World—the Terra Cotta Army, the Taj Mahal, the Eiffel Tower. Each gives your nation special bonuses.\nMore than a dozen map types, ranging from the Amazon Rainforest to the Himalayas to the Nile Delta.\nConquer the World campaign—a linked series of dozens of scenarios.The Extended Edition includes:Rise of Nations\nRise of Nations: Thrones and PatriotsNew in the Extended Edition:\tImproved Visuals\nImproved water\nImproved textures\nFull-screen anti-aliasingFull Steamworks Integration\nMultiplayer with ranked matches (ELO)\nAchievements\nTrading Cards\nCloud saves\tExtended Features\nTwitch Integration","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Big Huge Games","platforms":[{"id":0,"name":"PC"}]},{"id":79236,"name":"Odysseus Kosmos - Episode 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c12/c12629168053f6616ea78315eeb11843.jpg","description":"Odysseus Kosmos and his Robot Quest it’s a traditional 2D point’n'click game with retro-pixel style graphics. You are the ship engineer Odysseus Kosmos; you and your service robot Barton Quest are stuck in deep space near a black hole, all by yourselves. Your shipmates are down on the surface of a planet where time moves far, far slower and you, along with your robot, have been waiting for years for them to return to your orbital station. You were used to your comfortable boredom, but then the ship starts acting funny: it looks like this mysterious black hole affect your ship in strange and unexpected ways, cutting off your communications and threatening with de-orbiting the station and sending you stranded into deep space… unless you can do something to stop it!\nOdysseus Kosmos is a family friendly, hand-animated, puzzle-filled point-and-click adventure game with stylized visuals and a brilliant soundtrack that will make you laugh as you solve mind-bending puzzles.\nGame features:\nOld-school 2D point-and-click adventure\nSolve riddles and puzzles to save your ship\nExplore outer space in a cool retro pixel-art style!\nImmerse yourself in a sci-fi story whit a pinch of good-hearted humor\n_____________________________________\nFOLLOW US: twitter.com/Herocraft\nWATCH US: youtube.com/herocraft","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"HeroCraft","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":60841,"name":"The Cycle: Frontier","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/071/071f7506e3b9006a34506e0a2ab0c190.jpg","description":"The Cycle is match based FPS where players complete quests while making and breaking temporary alliances. Anyone can attack anyone, and anyone can ally with anyone.\n\nIn The Cycle the explored galaxy is controlled by massive Factions, but the mysterious outer reaches are still up for grabs. In their race to control these frontier resources, the Factions need contractors to do their dirty work. You are one of these contractors, competing for objectives such as collecting minerals or hunting wildlife while being careful to avoid or take down the competition.\nFeatures:\nA new Frontier: Explore the world of Fortuna III - a hostile, beautiful new world, full of fortune, alien life, and other players looking to take its riches.\nStorm: The cycle leaves only a narrow window of opportunity - stay too long, and you will be trapped on the planet.\nPacting: Players can meet on the surface of Fortuna III and join uneasy alliances with one another as they complete contracts\nBlack Market: Players have a wide arsenal of weapons and gear available to them, all with different playstyles, that can be purchased during a match\nCrafting: Players can spend their precious credits on creating new gear to take into the next match\nQuests: Shooting may give you an edge - but the best prospectors are those who can take on dangerous jobs for factions during a match\nCustomization: A wide selection of gear that players progress through, tailoring their character to their individual playstyle, with more options regularly added","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Yager","platforms":[{"id":0,"name":"PC"}]},{"id":47043,"name":"Ticket to Ride: First Journey","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bfc/bfcdbc0a64ce19da4ce4cac8b7d2d985.jpg","description":"A FANTASTIC WAY TO DISCOVER THE TICKET TO RIDE SERIES\nTicket to Ride: First Journey is part of the famous Ticket to Ride board game series. In this version, players can embark on their very first ride and visit major European and American cities. The game is easy for the whole family to play together. The youngest players can now challenge the most experienced in Ticket to Ride First Journey.\nCONNECT THE CITIES TO GET YOUR 6 TICKETS!\nCollect train cards, claim routes on the map and try to connect the cities shown on tickets. Each player starts with four colored train cards and two tickets. Each ticket shows two cities, and the aim is to connect those two cities with a contiguous path of your trains in order to complete the ticket.\nOn a turn, you either draw two train cards from the deck or discard train cards of matching color to claim a route between two cities. Once you complete a route, you will be given a new one. The first player to complete the six tickets wins. It takes a little risk but it's lots of fun!\nENJOY AN IMMERSIVE JOURNEY\nHave fun through original illustrations and funny animations once you connect the cities. Learn more about the different cities and their iconic monuments.\nShare this adventure until 4 players on the same device thanks to the pass and play mode. If you want to play in solo, you can just play versus the AI.\n\nGET EXCLUSIVE REWARDS TO BUILD A COLLECTION OF CITY PICTURES\nReceive a golden ticket when winning the game and add your reward picture to your collection. In this digital adaptation, challenge yourself against the AI or play with your friends, thanks to the pass and play mode! With its easy rules, beautiful animations and illustrations, it is an ideal game for the whole family when they are ready for an adventure!\nFEATURES:\nFamily friendly game play\nSolo mode\nPass & Play mode to play on the same device with family and friends (4 players max)\nUnlock rewards and build your collection of city pictures\nRediscover the famous Ticket to Ride board game with this simplified version\nLanguages available: English, French, German, Italian, Spanish, Korean","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":28581,"name":"The Orange Box","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/55a/55a685051caa3d478836fa7c1d074694.jpg","description":"The Orange Box is a bundle that includes five titles from Valve: \n\nHalf-Life 2, Half-Life 2 Supplement: Episode One, Half-Life 2 Supplement: Episode Two,\nPortal, the game that blends puzzles, first person action, and adventure gaming to produce an experience like no other,\nTeam fortress 2, the sequel to the game that put class-based, multiplayer team warfare on the map.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Valve Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":12361,"name":"Wargame: Red Dragon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecb/ecb32cf472d803aabd3a18c35866186b.jpg","description":"Wargame: Red Dragon is the second part in Wargame series and a sequel to Wargame: AirLand Battle. Its campaigns are based on alternate history concepts. \n\n###Plot\nThe game is set in the Cold War era. Wargame: Red Dragon follows a series of fictional yet plausible conflicts between the various countries in the Asia-Pacific region. In the campaign mode, its timeline covers the 1970s, 1980s, and up until 1996. The player controls various factions, both from Eastern and Western bloc. The story campaign includes a civil war in Korea, a Chinese invasion of the Russian Far East, a conflict over British-occupied Hong Kong, a Kuril islands border conflict, and a Soviet invasion of Korea.\n\n###Gameplay\nThe player controls his or her units from a top-down view in the real time. At each level, the player and his or her opponent, whether AI or the other human player, start at the different sides of a map and fight to control it. Being a wargame by definition, Wargame: Red Dragon doesn't have much of economic element. The player deploys the already existing units rather than creates them. To receive reinforcements during the battle, the player has to capture and hold specific parts of the map that serve as deployment zones. \n\nBesides the campaign mode, the game offers its players to choose from more than twenty nations, and additional nations are available through DLC. Wargame: Red Dragon also has a competitive multiplayer mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Eugen Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1070,"name":"Hyperdrive Massacre","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1de1f8ba03e87b37a68e289dbd232412.jpg","description":"Hyperdrive Massacre is an 80s inspired local multiplayer fragfest for up to 4 players.  Players take control of a space cadillac and frag their way to victory against friends or can also play against AI.  Both modes allow players to unlock a full crew roster.  Submachine guns, sniper rifles, frag grenades, homing missiles and bullet deflectors are just some of the tools player can use to create havoc.note: This Game Requires A Controller.\nHperdrive Massacre is best played on a couch. Although its content is family-friendly, it also makes for an excellent drinking game.\n3 solo and local multiplayer game modes: Deathmatch, Death Race, Last Man Standing.\nPlus 3 local-multiplayer-only game modes: Team Deathmatch, Space Soccer and Spong\nLocal Multiplayer up to 4 players\n8 Unique battle arenas\n16 space enabled muscle cars, each manned by its own whacky crew\n10 instant power up weapons each allowing a different play style\nViciously challenging AI for when your friends are not around\nRocking original sound track","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"34BigThings","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":29228,"name":"Valfaris","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ce/6ce7b3c02a57f6d21f1009ed3305736e.jpg","description":"After mysteriously vanishing from galactic charts, the fortress of Valfaris has suddenly reappeared in the orbit of a dying sun. Once a self-contained paradise, the grandiose citadel now plays host to an ever-growing darkness.\nTherion, a fearless and proud son of Valfaris, returns to his home to uncover the truth of its doomed fate and to challenge the arcane evil at its very heart.\nKey features\nSkulls in space! Gore in space! Metal in space!\nSavagely reduce foes to piles of gibs with an array of brutal weaponry\nExplore a diverse range of tainted environments as you venture ever deeper into the dark world of Valfaris\nDominate ranks of deadly enemies and bosses, from the weird to the grotesque (and some that are just grotesquely weird)\nGorge your eyes on devastatingly awesome pixel art hand-crafted by Andrew Gilmour\nFeel the power of a seismic soundtrack by extreme metaller and former Celtic Frost guitarist, Curt Victor Bryant\nForged from the ground-up by the team behind cult hit Slain: Back From Hell","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Steel Mantis","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":14974,"name":"Rome: Total War - Alexander","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfc/dfc88887160d34d7c8d3e3acdc2ac491.jpg","description":"The second official expansion to Rome: Total War, a game from the Total War series.\n\nThe Total War series by 2018 includes ten independent games and seven expansions to them.\n\n###Genres\nThe games of the series combine several genres.\n\n4X genre: player control an exploire, expands, exploits, and exterminates.\n\nEXplores - the player sends scouts to explore adjacent territories,\n\nEXpands - the player is trying to assign new territories to himself, establishing settlements or expanding the influence of already existing settlements,\n\nEXploits - the player collects or extracts resources, organizes and develops the industry.\n\nEXterminates - attack on other empires, destruction of enemies. Often this becomes a condition for further expansion.\n\nGames of the 4X genre usually have a very complex, detailed gameplay that takes considerable time to complete each of the four stages listed above.\n\nGrand strategy: the player rules the country or the empire, the actions of individuals or even large teams are usually not emphasized, the player acts by entire industries and armies.\n\nReal-time tactics: in games of this genre, all attention is paid to tactical actions on the battlefield - the location of units on the ground, the use of the terrain. Such games claim to reproduce the logic of real battles.\n\nTurn-Based Strategy: gameplay evolves as an alternation of turns of each player. In one turn in the game world can take many years, many units can make a maneuver, can change a lot.\n\n###Modes\nMode \"campaign\" - the game takes place on some part of the Earth, in a certain historical period.\n\nDuring one turn, the player can perform a number of very diverse actions: build, recruit and re-equip troops, change the location of troops, start negotiations, send a detachment of saboteurs on a mission or take part in a larger battle.\n\nTactical mode - the army fighting in a certain territory, and the battle takes place in real time.\n\n###Rome: Total War\nThis is the third game of the Total War series. The player plays for one of the factions of ancient Rome in the Republic from 270 BC (defeat of the last Apennine enemies of Rome) to the 14th year (death of Octavius ​​Augustus).\n\nTraditional gameplay for the Total War games.\n\nThe strategic part of the game takes place in Europe, West Asia and North Africa. Each turn is half a year. The theme of this game - Rome, - led to a greater emphasis on the military parts of the game.\n\n###Rome: Total War - Alexander\nThis is the second official extension to Rome: Total War. The first extension was the Rome: Total War - Barbarion Invasion game.\n\nUnlike all other games of the Total War series, this game can be played in just one faction - Macedonia, led by Alexander the Great. There are seven factions in the game:\n\nBarbarian Factions: Scythia, Dahae, Illyria.\nMacedonian Faction.\nEastern Factions: Persia, India.\nRebel Faction.\n\nThe number of turns in the game is limited - there are only 100 of them. A series of battles must be won no less than on the “medium” difficulty level in order to gain access to other battles.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":128,"name":"Super Crate Box","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/117/117a10346ff28d4489046dd5ec254083.jpeg","description":"Vlambeer's SUPER CRATE BOX is coming to bring back the glory of the golden arcade age, when all that really mattered was getting on that high score list. Grab your baseball cap and loosen your pants, it's time to fight endless hordes of enemies and collect every weapon crate you can. Prepare for an arcade delight with tight controls, refreshing game mechanics, cracking retro art and a terribly hip chiptune soundtrack.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Vlambeer","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":18479,"name":"Atom Zombie Smasher","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e56/e56621a4d56de3dc8d8d1f26b3b10706.jpg","description":"The game is a real-time strategy from the independent studio Blendo Games. The main task is to save as many people as possible from the advancing horde of zombies. The gameplay is somewhat reminiscent of the famous Lemmings series: zombies appear on the edge of the map, and the whole difficulty lies in controlling the panicking crowd.\n\nThe player has rescue helicopters and military to deploy. At the beginning of each level, the player needs to select the points from which the civilians will be rescued, and arrange the remaining units. The latter can be upgraded.\n\nThe main task is to save as many civilians as possible from the district areas of the fictional city of Nuevos Aires. Challenges and city landscape is procedurally generated, and every playthrough is unique. A destructible environment adds diversity adds and dynamism to the gameplay. Story missions can be played either alone or with a friend in a cooperative mode on one device.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Blendo Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":502241,"name":"Neighbours back From Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f39/f394c09e4760251c58e9ab9f45d7718c.jpg","description":"Did you know that “Schadenfreude” is a German word defined as the concept of finding joy in someone else’s misfortune? It is also the main idea on which Neighbours back From Hell is built. A whole TV show based on playing increasingly outrageous pranks on your grumpy neighbor to keep the audience entertained, and viewership numbers high. It’s good to be bad in this early 2000s trash TV-inspired slapstick extravaganza!\r\nAs Woody, the vengeful star protagonist of Neighbours back From Hell, you will prank your way through Seasons 1 and 2 of the fictitious, but aptly named TV show. Take the mischief from your nasty neighbor’s flat all the way to China, India, and Mexico where you will make sure his holiday is a living hell. While you’re at it, why limit targeting your antics at your neighbor, when you can involve his mother and fellow travelers? Whatever you decide to do, your trusty camera crew will be right there and keep a keen eye on all the action. You can let your crooked creativity flow freely and watch the neighbor rage in desperation. Just be mindful not to get caught by him or his companions, or they will whoop you good and your TV show will be taken off the air. If you perform well on the other hand, by creating more and more disarray and chaos in the neighbor’s life, ratings will increase, and you could win prestigious awards.\r\nFeatures:Neighbours from Hell 1 & 2 Remastered in one package: 25 episodes set in the neighbour’s home, on a cruise liner, and in several different holiday locations around the world\r\nAll graphics newly rendered in Full HD\r\nFramerate of all animations doubled for a smoother experience\r\nUse stealth, skill and style to perform the perfect ambush\r\nEasy to use interface and controls\r\nSuperb cartoon-style graphics\r\nBig band soundtrack","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":14575,"name":"Seven: The Days Long Gone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c0/1c0c32f070ce9e26e1966772b18d3ae1.jpg","description":"“Seven: The Days Long Gone” is a 3D isometric RPG in which players can freely explore the sandbox world of the Vetrall Empire.\nSet in a 'beyond post-apocalyptic' environment, the title will redefine how the isometric RPG genre is played. The climbing system implemented allows you to free-traverse obstacles of any height, both horizontally and vertically.\nOn the prison island of Peh, you will experience rich stories of conspiracy, discovery and betrayal, set within an unforgiving world filled with mysterious technology and dark age superstition. As a master thief possessed by an ancient daemon, you are deported to Peh on a mission that could decide the fate of all humanity.\nEngage with Peh’s fascinating array of inhabitants, many of whom invite you into tales of shattered hopes and desperate struggles for survival. But don’t forget to watch your own back: creatures and people alike won’t think twice about abruptly ending your stay on the island.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"IMGN.PRO","platforms":[{"id":0,"name":"PC"}]},{"id":13902,"name":"Sacred Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/103/10332e2bf8bc1bf59c171d49ad37f382.jpg","description":"A shadow of evil has fallen on the kingdom of Ancaria. It is a time for champions - a time to journey into the perilous world of SACRED. Battle blood-thirsty orcs & lumbering ogres... Destroy undead wizards & rotting mummies... Slay hellish demons & legendary dragons. With blazing magic & sharpened steel, prepare to embark on an epic quest of fantasy adventure & heroism.\nSACRED GOLD is the complete SACRED collection in one box, containing the full version of SACRED, winner of the 'Best Roleplaying Game 2004' award from PC GAMER, Sacred Plus and Sacred Underworld.\nSACRED - The new name in Action-RPGs. SACRED delivers a huge, elaborate world comprising 16 regions beset with heroic quests, battle-hardened warriors and horrific enemies. Ancaria consists of highly detailed landscapes, complete with villages and towns, and also features a day/night cycle with varying weather systems. Regions vary from forests and mountains to deserts, catacombs and ice-covered landmasses. More than three quarters of the world is open to the players from the very start - no unlocks needed.\nSACRED Plus - Incorporates all of the feedback from the player community since the first release of SACRED. This includes  an optimized interface, and many completely new features: two new regions, two additional main quests, new item sets and weapons, and many new creature types which make adventuring in Ancaria even more dangerous.\nSACRED  Underworld - Ancaria is facing a threat far greater than ever before. The now familiar world continues to evolve, with existing SACRED players able to import their old characters into the Underworld.\nChoose from eight heroic characters: Gladiator, Seraphim, Battlemage, Wood Elf, Vampiress, Daemon, and Dwarf.\nHundreds of unique weapons, armors and set items - collect artifacts and forge all-powerful weapons!\nLearn Combat Arts, develop new skills, and customize devastating combo-attacks.\nA huge world open to explore from the outset.\nAn epic RPG and enthralling storyline with over 30 main quests & 200 sub-quests and dynamic quests.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":9218,"name":"Timberman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3b/a3b8325582e81491500fb18292f7f371.jpeg","description":"Timberman is an arcade-style high-score game created by Digital Memory.  \n\n###Plot  \nThe main character is Timberman – a lumberjack with an ax. The player's goal is to cut as many woods as possible for a limited amount of time.   \n\n###Gameplay\nThe character is standing under the trees, so he is always in danger of bumping into branches. While the player is cutting, trees become shorter, and branches appear on both sides of the trunk; the player has to avoid them to play longer.\nWhile playing, you see the health bar at the top of the screen; under that, there is a player’s current score. Each wood brings points which can be used in the game shop. The round ends when the player is out of health or when the time is over. It is possible to either master his skills or to compete with other players. For example, the second option is able if the player is using Steam. After each round, the game shows a scoresheet with the best and current result. If the round is a match between several players, the sheet shows all of the scores.   \n\n###Key Features \nThe game is designed like an old-fashioned arcade. The game features the pixelated and protagonists. Except for the dangerous branches, there are no traditional enemies. It is possible to use four shifting environments: the winter mode, the night mode, the sunset mode, and the daybreak mode. The player can also unlock additional Timbermen: a ninja, a bear, and Santa Claus.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Melody","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":563420,"name":"Hot Wheels Unleashed","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/201/201feb4db3118c1440ebdce03e61e3fb.jpg","description":"To play this game on PS5, your system may need to be updated to the latest system software. Although this game is playable on PS5, some features available on PS4 may be absent. See PlayStation.com/bc for more details.\nCollect the best vehicles in the Hot Wheels™ universe, build spectacular tracks and dive into breathtaking races.\nCOLLECTOR OR ARTIST? BOTH\nThe most iconic and sought after Hot Wheels™ vehicles are waiting for you. Get ready to make them race at full speed!\nStand out in the crowd by setting off your personality with the exclusive livery editor.\nALWAYS RUNNING\nProve your skills by competing in awesome races and get ready for pure fun! Drift, charge the booster and launch yourself into spectacular loops. But be careful! If you're too slow gravity will do its job.\nThe bigger the challenge, the greater the glory.\nRace side by side with your friends in split screen mode for 2 players or face up to 12 opponents in online challenges.\nCREATE THE SHAPE OF YOUR TRACK\nWaiting to host your races are enormous interactive environments with their own distinguishing features, where every object can become an integral part of the track.\nUnleash your creativity with the most exciting track editor ever! Build your track by taking advantage of what surrounds you, and create amazing layouts inside and outside the race course. Bend and stretch the iconic \"orange piece\", add loops, special boosters, obstacles and special elements to make an incredible amusement park for your races.\nShare your craziest creations online and try those of other players.\nRACE IN YOUR WORLD\nFurnish your own personal room with a huge number of elements that you will collect during your adventure and host the most amazing races inside it.\nOffline multiplayer (2 players)\nOnline multiplayer (2-12 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nUses DUALSHOCK 4 vibration function\nRemote Play allows users to connect to and play games on their PlayStation®4 or PlayStation®5 using a mobile device, PC, or another PlayStation®4 or PlayStation®5.\nEnhanced game play on PS4 Pro console\nOptional In-game purchases\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Milestone","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":449160,"name":"Gunfire Reborn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/108/108628a1f93b1bceeaf3a2cb0146f103.jpg","description":"About This Game:\nGunfire Reborn is an Adventure level-based game featured with FPS, Roguelite and RPG. Players can control heros with different abilities to experience diverse Build gameplay, use randomly dropped weapons to adventure in random levels. This game can be played by single player, or Co-op up to four.\nIn this game, players' experience in each level is random. Every restart means brand new experience. You will meet different heroes' talents, weapons and items, different checkpoints and combat rhythms in different levels.\nThe game is still in Early Access. In the following time, we will gradually fix the bug, add more contents, and come up with new gameplays. Thanks all for your support! We will try our best to optimize our game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Duoyi","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":10132,"name":"RPG Maker VX Ace","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18e/18ef77d2a8ed1ddb7f1abf358a3c1ea0.jpg","description":"RPG Maker VX Ace is a computer program to make Role-Playing Games and the variation of the original RPG Maker VX. It is a part of the RPG Maker series and is the seventh game in the set.\n\n###Features\nNamely, the program allows the user to create any RPG he likes. It consists of three main sections: map editor, database and resources. The scheme for creating the game does not vary from title to title — one chooses the required map layout, then places the points of interests, initiates events and fills the map with content. In the later stages of developing, the user may track the behavior of the in-game elements using diverse data sets allowing him to change the variables without cutting open the game. \n\n###Notes and restrictions\nIt is possible to use the game commercially — for instance, sell and organize the IP around it with no copyrights from the Enterbrain attached. The Maker is limited to only single-player 2D games. Multiple paid DLCs are available each bringing new tiles or characters editor into the title. \n\n###Ace updates\nCompared to the original VX, Ace version features minor improvements such as multi-tiles errors fix and new soundtrack options. There was also a problem with the static background in some locations which is also fixed in The Ace.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"KADOKAWA","platforms":[{"id":0,"name":"PC"}]},{"id":554705,"name":"Potion Craft: Alchemist Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18e/18e422ec82ea060e0641cb419faca210.jpg","description":"Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"niceplay games","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":17608,"name":"Half Minute Hero: Super Mega Neo Climax Ultimate Boy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/536/536626b719f824954a475164bb32ea8c.jpg","description":"Half-Minute Hero: Super Mega Neo Climax Ultimate Boy is remastered PC version of an RPG shoot-em-up JRPG developed by Marvelous Entertainment.\n\n###Gameplay\nThe game features four main game modes with each one of them being completely different from the others in gameplay. The game also supports multiplayer.\n\nIn most modes, the player only has 30 seconds to complete their objective. When the time ends, so does the game. The time can be added in Hero mode by buying from the Time Goddess in the cities between the battles with monsters and world exploration. This mode resembles the traditional Japanese RPGs the most. The Princess mode is a side-scrolling shooter game, while the Evil Lord mode is an RTS in which the player summons monsters of three kinds in order to complete specific objectives. In Knight and Wizard mode, the players have to defend the Wizard and eliminate all the monsters. \n\n###Super Mega Neo Climax Ultimate Boy edition features\nThis edition is a remaster of the original PSP game for the PC. The Super Mega Neo Climax mode is featured in the game which adds improved graphics in order to better resemble the anime cartoon style rather than the classic 8-bit JRPG one. \n\nThis edition features every single mode featured in the base game apart from two stages that were cut due to unknown reasons.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Opus","platforms":[{"id":0,"name":"PC"}]},{"id":2686,"name":"Sheltered","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68c/68cb9f0b821f5acfbdf2919856d3afb8.jpg","description":"Panting, scared, the shelter airlock smashes down behind you. You wish you did not have to go outside, but you do. It would be easier to give up.  But you don’t.  The hardship, the hunger, the thirst. The  fear. You keep reminding yourself why you stay alive. Why you do this. Then you hear it.  “Daddy you’re back.”  You wife’s face lights up and you open a bag full of medical supplies. You need not tell her how you got them. You simply enjoy your small victory in this, the harshest of times. In the post-apocalyptic world, you must keep your family alive in your underground bunker in this deep strategy game from Unicube...\nSheltered is a post-apocalyptic disaster management game that gives a whole new meaning to the term “nuclear family”. Given a head-start over the billions lost in a nuclear holocaust, you must gather as many supplies as possible en route to the concrete underground shelter that will soon become your family home for the foreseeable dreary future.\nWith all hope lost, how will you cope in this bleak new world? How you handle the many moral choices you'll encounter on a daily basis could be the difference between your family surviving or dying. Combat claustrophobia, radiation and mental exhaustion as you cling desperately to life in the cramp, cold and scary underground shelter. You’ll have to leave the scant protection the shelter offers behind as you’re forced to venture outside into the dangerous desolate wasteland to scavenge for vital supplies which could ensure your families survival for just one more day.Feature List\nFamily comes first: Keep your family alive and protect them from the ravages of the harsh post-apocalyptic world.Make the shelter a home: Maintain your shelter - keep it secure, habitable and make sure that the family have enough resources to survive. Protect your shelter from hazards and infiltration!\nCustomisation: Your family is unique to you; you decide their gender, names and their appearance.RPG mechanics: As your family develop, their stats will adapt with an evolving experience and trauma system. Attributes, strengths and weaknesses will dynamically change based on your choices.Crafting system: Create comforts for your family’s shelter and weapons for combat.Exploration: Send out your family to explore and gather resources for everyday living and crafting.Recruitment system: Recruit outsiders with different personalities, integrate them into your shelter life and earn their loyalty.Dynamic encounter system: Your family will encounter various threats including roaming factions and feral beasts.Turn-based combat: For those that cannot be reasoned with, violence can be used as a last resort. Your family may depend on it.Pets: Your pet is family too. Choose between the dog, cat, fish, snake or horse.Vehicles: Make exploration quicker and safer.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":568931,"name":"Dorfromantik","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b00/b00b7cc04dd09531b631ea4575696276.jpg","description":"Dorfromantik is a relaxing building strategy and puzzle game in which you place tiles to create ever-growing, idyllic village landscapes. With Dorfromantik, you can immerse yourself in a quiet, peaceful world at any time and take a break from everyday life. At the same time, Dorfromantik offers a challenge for those who are looking for one: To beat the highscore, you need to carefully plan and strategically place your tiles.\nIn Dorfromantik you start with a stack of procedurally generated tiles. One after the other, you draw the top tile of the stack, place it on one available slot and rotate for the best fit. Thereby groups and combinations of landscapes are formed, such as forests, villages or water bodies, and you are rewarded with points depending on how well the tile fits.\nOn some tiles you will also encounter special objects that give you a quest: For example, the windmill wants to border 6 grain fields, the locomotive wants to be connected to 10 tracks or the deer wants to inhabit a forest with at least 50 trees. Fulfill these quests to get more tiles to continue the expansion of your landscape. The game ends when the tile stack is used up.\nAs you expand the landscape, you can advance into new, colorful biomes and discover pre-placed game objects that give you long-term tasks. Through these tasks you can unlock new tiles, new biomes and new quests.\nWhat Dorfromantik offersBuilding endless and beautiful landscapes\nUnique mix of strategy and puzzle mechanics\nRelaxing and calming gameplay\nIdyllic village scenery\nStrategic placement to beat the highscore\nHigh replay value - every session is different\nMany unlockable tiles and biomes\nOriginal Artstyle with handpainted boardgame feelWhat Dorfromantik does not offer4X Strategy\nTrading\nResource Management\nCombat & Violence\nMultiplayer\nDorfromantik was developed by four game design students from Berlin. Together we have founded Toukana Interactive and want to develop many more small, original and high-quality indie games in the future.\nWe are happy about constructive feedback of all kinds, so feel free to contact us! We will do our best to respond to messages quickly and fix any problems that may arise. :)","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Timo Falcke","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":19519,"name":"Unreal 2: The Awakening","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d7/6d73822d481dd302f7a105882f3bf520.jpg","description":"Unreal 2: The Awakening is a first-person shooter game developed by Legend Entertainment. It is the continuation of the first Unreal game.\r\n\r\n###Plot\r\nUnreal 2 takes place 36 years after the events of the first game and its expansion pack. John Dalton, a Terran Colonial Authority Marshall patrols the deep space with his crew. He arrives at the TCA headquarters to get a new mission where he finds indestructible alien artifacts. It is later found out that the Scaarjes hunt these artifacts too with Izanagi and Liandri corporations catching up. Dalton has to fight off his enemies and figure out what to do with the mysterious artifacts.\r\n\r\n###Gameplay\r\nAt its release, Unreal 2 was a singleplayer-only title, but multiplayer modes were later added to the game.\r\n\r\nThe game's singleplayer is not much different from its multiplayer. The players traverse fairly open-ended levels either on foot or using the vehicles spawned on the level. Sometimes it is necessary to solve several puzzles or find some keys to continue further into the game. On several occasions, the players are required to hold a specific area with other non-playable characters and turrets helping them out.\r\n\r\nThe game's multiplayer mode is basically a port of Unreal Tournament 2004 that was embedded into Unreal 2 and features several gameplay changes, such as the addition of the class system.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":16167,"name":"Camera Obscura","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/689/6896e1eb8fa6f1b43a20be65a6b0b986.jpg","description":"Camera Obscura is an indie puzzle platformer game developed by Anteater Games.\n\n###Plot\nMany years ago, a mysterious cult tried to reach the sun by building a tower. Fast forward to the present day, a curious photographer overhears the fact of the tower actually existing and sets out to find it. His goal is to rich it's top.\n\n###Gameplay\nCamera Obscura takes inspiration from Braid, Fez, and Ghosts and Goblins. The game uses the same storytelling principles that are used in these games, and death is not a major setback in the game. It was designed in a way to relax the players and make them feel safe without getting too repetitive or hard.\n\nCamera Obscura introduces an innovative mechanic to its gameplay. The players can take a shot of their surroundings and use these shots to traverse through the levels. This feature is mainly used to reach elevated places or cross a pit. There are 57 levels present in the game, with each one of them introducing a completely new puzzle to solve. These levels are divided into 8 zones which have a unique atmosphere and sound design for them.\n\nThe game also comes bundled with a custom level editor. The players do not need any programming knowledge to create a level. It is possible to place platforms, doors, and enemies by dragging and dropping them to the required spot.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Anteater Games","platforms":[{"id":0,"name":"PC"}]},{"id":3145,"name":"TRANSFORMERS: Devastation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c61/c612691165b2c4ce7782aca7f23a6f3d.jpg","description":"Transformers: Devastation is and hack-and-slash video game based on the Transformers franchise. The game is currently unavailable in digital marketplaces due to the expiration of Activision’s license deal with the franchise owners Hasbro. \n\n###Plot \n The game takes place during the Insecticons attack on New York City. The story follows the Autobots: Optimus Prime, Sideswipe, Bumblebee, Wheeljack, and Grimloc on their fight with Insecticons and Megathron who wants to cyberform the Earth making it a new home planet for Cybertronians. \n\n###Gameplay \nStructurally, Devastation consists of seven chapter with several missions in each. The gameplay shares many similarities with other Platinum Games’ titles, especially with Bayonetta series.\nYou can choose one of three main characters. Each of them has unique characteristics, ranged and melee weapons and abilities. The game incorporates a dodging system similar to that of Bayonetta. Dodge made at the right moment causes time to slow down for enemies, giving the player the ability to relocate or perform a series of attacks without any resistance. Every Autobot can transform into a particular vehicle, which gives new possibilities and moves to the player. \nThe game has many collectibles, unlockable items, weapons, and a crafting system based on loot you get from enemies and chest scattered across the levels.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Platinum Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":14720,"name":"Neighbours from Hell Compilation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/160/1609d2e78bc0a19bdbc38b6f53b28968_hFQ0k8h.jpg","description":"INTRODUCING THE GAME OF NEIGHBOURHOOD NASTINESS AND COMMUNITY COMMOTION! Living next door to you is a real Neighbour From Hell and it's now time to have your revenge! This compilation includes the original Neighbours From Hell and it's sequel Neighbours from Hell 2: On Vacation.Story Neighbours from Hell 1Creep around your neighbour ’s house performing ever more elaborate tricks upon the unsuspecting resident.\nAs the star of a fantastic new TV show, cameras will track your every move as you set your fiendish traps. Your objectives are to create more and more disarray, increase ratings and maybe even winning prestigious awards. But beware of watchful neighbors and alert guard dogs; if they catch you then the show will be taken off air.Key Features Neighbours from Hell 114 hugely varied episodes of anarchy\nUse stealth, skill and style to perform the perfect ambush\nEasy to use interface and controls\nSuperb cartoon-style graphics\nExcellent soundtrackStory Neighbours from Hell 2: On Vacation The reality TV show of neighbourly nastiness and community commotion moves on to the next round.\nThe Neighbour from Hell wants to enjoy an undeserved holiday – reason enough for Woody and the camera team to sneak along onto the cruise liner to make the nasty neighbour's holiday a living hell. This time, the neighbour's mum has joined him, and she is taking good care of her baby.\nGet the Neighbour from Hell into his mum's and fellow travellers' bad books, play tricks on him and give free reign to your vengeance.Key Features Neighbours from Hell 2: On Vacation14 new tricky and highly detailed episodes of anarchy of the popular \"NEIGHBOURS FROM HELL SHOW\"\n6 different locations in China, India, Mexico and on the cruise liner\nMore than 5 new characters and numerous animals\nNew cool soundtrack reflecting the countries our characters visit","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"JoWooD","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2749,"name":"Screencheat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c3/1c305353b224d8196489bbc4792a4c0b.jpg","description":"Screencheat is a rare kind of game that encourages its players to cheat. It is an online multiplayer-only game that allows a sort of second-person view. The players cannot see their opponents, but they can see what their opponents see.\r\n\r\n###Premise\r\nScreencheat is based on the idea of \"screen cheating,\" a form of cheating in local multiplayer in which the cheaters peeks at the other players' monitors to see what they're doing. This kind of behavior is unwelcome in most games, but Screencheat is built around it. \r\n\r\nThe characters in the game are invisible, and the players cannot see each other. However, they have access to other players' views. The screen is divided into four segments, in the vein of Goldeneye 007. Each of them translates a player's view so that everyone can see what the others do. It allows the opponents to track each other by detecting the locations of other players in respect to the environment.\r\n\r\n###Gameplay\r\nBeyond its novel idea, Screencheat is played as a regular 3D shooter. The player controls his or her invisible protagonist from the first person view. The characters have no hit points and die instantly if injured. The game offers a variety of weapons with different stats of accuracy and range, such as a shotgun, a grenade launcher, or a rifle. There are also comical improvised melee weapons such as a hobby horse.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SURPRISE ATTACK","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":22193,"name":"The Search","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/caa/caaee1745f03783068bf510d27d6915a.jpg","description":"Embark on a journey of discovery and inspiration in The Search - a story-driven puzzle-adventure set in a mysterious world where art comes to life!\nIn an unknown world, you'll search for clues about the nature of this place, as well as your own past. Guided only by the letters of a mysterious stranger, you'll find that this universe works differently from our own. It's a world in which obstacles can be overcome by your own creativity - and where art comes to life to create tears in the fabric of reality.\nWho wrote the letters that guide you? What is the nature of this surreal, enchanted universe? And why were you chosen to take this journey?\nKey features:\n- A short, story-driven puzzle-adventure\n- Uncover clues and solve inventive puzzles\n- Gorgeous 3D artwork and a haunting soundtrack\n- Voice acting from Cissy Jones (Firewatch, Life Is Strange)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Jason Godbey","platforms":[{"id":0,"name":"PC"}]}]