[{"id":17842,"name":"My Paper Boat","genre":"Adventure","price":0.0,"description":"In “My Paper Boat”, the player takes over control of an eponymous paper boat and steers it through various waters. In the course of this, some challenges are waiting. It is a small game, ideal for the meantime – and thus, My Paper Boat it is a lot of fun.\nFollowing an optional tutorial, five varied levels are waiting for the player. The treasure cave, summer garden, forest, desert oasis and canyon are all wonderfully designed and grant an impression into what the Unreal Engine is capable of.\nThree different game modes ensure that there is no time for boredom while the player manoeuvres his or her little paper boat as unscathed as possible into the haven. In “Collect”, numerous coins spread all over the waters wait for the player to find and collect them all. Shooters can hunt down targets with a little bow canon in “Aim”. And in “Rallye”, one has to master the ways to the harbour along certain markings on time – passing obstacles that do their best to hamper the advancement…\nA high scoring at the end of each mission does not only unlock new levels, but also new accessories for the boat. Every player can customize the boat with extensions and colours to their individual wishes. Achievements create an additional incentive to perfect each single level.\nAll levels are available in every game mode. A physical damage system takes care of collisions with stones or other obstacles. The game is playable on PC and Mac.Features\n5 wonderful levels\n3 different game modes\nAll levels available in every game mode\nCustomizable materials and colours for the boat\nCustomizable extensions for the boat\nComprehensive, optional tutorial\nAchievements\nMultiplatform","imageUrl":"https://media.rawg.io/media/screenshots/394/3942805d92009cc0e86d5377e90d1406.jpg","releaseYear":2015,"developer":"TML-Studios","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17490,"name":"CAFE 0 ~The Drowned Mermaid~","genre":"Adventure","price":0.0,"description":"CAFE 0 ~The Drowned Mermaid~ is a mystery horror visual novel developed by roseVeRte, which is fully voiced in Japanese with English texts.\n*Only the demo and deluxe versions contain Japanese voices. The full version is unvoiced.STORYA girl’s spirit with no recollection of her past find herself inside Cafe 0, a mysterious Cafe in the middle of nowhere. Served with only a glass of water by the peculiar waiter, Sui--soon she realized that she is about to relive the last seven days before her death.\nSurrounding her are Ami, a girl who claimed to be her best friend, Tooru, a boy who is rumored to be her previous boyfriend, and Shou, the school’s doctor?what are their connection to her past and how are they related to her death?\nWill she be in peace with her past, or will she haunt the living? It is all up to you to decide.CHARACTERS Marin Umino (Name is changeable.)\nThe main character.\nShe can't remember anything from her past.\nSui - Cancer Murakani\nOne of the waiters at Cafe 0.\nHe's calm and looks so mature.\nHe's able to say harsh words without changing his expression.\nShou Takizawa - Yuya Kakitsubata\nThe school's doctor.\nHe seems to know the main character from a long time ago, since her childhood.\nTooru Mizutani - Mato Sarashina\nThe ex-boyfriend.\nAfter finding out she had lost her past memories, he seems to be interested in her once again.\nAmi Kawase - Nanase Watarai\nThe best friend.\nShe's always tuned into the latest fashion, and is famed in the school for her sense of beauty.FEATURES 3 Types of main character depending on your selection, complete with different costumes.\n2 Character Paths and 1 True Path.\n2-3 Hours Play Time.\n1 Secret Bonus when you cleared all routes. OTHER INFO OFFICIAL SITE: http://www.roseverte.net/cafe0/eng\nFACEBOOK PAGE: http://www.facebook.com/roseverte.games\nTWITTER: http://www.twitter.com/rosevertegames","imageUrl":"https://media.rawg.io/media/screenshots/339/339d4012208544da1f909b991da86db7.jpg","releaseYear":2012,"developer":"roseVeRte","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":15982,"name":"Angels & Demigods - SciFi VR Visual Novel","genre":"Adventure","price":0.0,"description":"\nTravel with us into the distant future in which man plays god by creating angels to protect him. Immerse yourself in an alien world and discover why you were woken up after a long slumber. Meet friends and foes, discover their objectives and most importantly try to stay alive. Angels & Demigods is an atmospheric sci-fi visual novel being brought to you in VR. It is a story and dialogue centered game in which you create your own adventure by carefully choosing what you say and do.\nIf you like chapter one and would like to play a continuation of the game than please support our Kickstarter campaign :)\nhttp://7keystudios.com\nhttp://twitter.com/7keystudios\nThe story takes place in the distant future on Saturn's moon Enceladus in the 190th century. You are given a task to bring back Ashley - a genetically engineered warrior \"angel\" who has fled the facility where she was being held in a dormant state. Through the interaction with her and other characters you unravel bits and pieces of a conspiracy.\nThis is a story centered game and you interact with characters by selecting choices that alter how you interact with them. You will also be prompted to interact with the environment at some points to be able to progress further.","imageUrl":"https://media.rawg.io/media/screenshots/90c/90cedd017cd89464332656f809a61c48.jpg","releaseYear":2016,"developer":"7 Keys Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15016,"name":"Time Leap Paradise SUPER LIVE!","genre":"Casual","price":0.0,"description":"Time Leap Paradise SUPER LIVE is a live performance simulator featuring characters from Frontwing's 3D visual novel \"Time Leap Paradise\".\nNot only can you fully customize every element of the performance - from the song and time of day, to the girls and their outfits and accessories! You can also choose from 10 different camera angles mid-performance.\nAdditionally, both English and Japanese lyrics are included on-screen for all songs. The English lyrics have been carefully translated to fit the rhythm of the original Japanese, so you can feel free to sing along in either language!\nThe base game includes the following customization options:\n-Main Vocal Character (Solo and Group Dance): Young Ayumu\n-Backup Dancers (Group Dance only): Ayumu, Yuu\n-Songs: \"It's Show Time\" (Solo Dance only), \"Happy Leap\"\n-Outfits: Casual Dress, Dance Costume\nAdditional main vocal characters, backing dancers, songs, and outfits are all available as DLC as well, to expand your performance options even further!\nFor more details, please visit the store page for the DLC.","imageUrl":"https://media.rawg.io/media/screenshots/84f/84fc58f520b61164ac5a0929f42f2de8.jpg","releaseYear":2016,"developer":"Frontwing","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14840,"name":"Highschool Possession","genre":"Adventure","price":0.0,"description":"Our protagonist, a fairly ordinary, normal, down to earth young man, has his whole world view shattered when a strange force comes to him and causes him to switch bodies with his classmates. But not just any bodies, he leaps into the bodies of his two 'school idols' the girls he has had a crush on for a long time and been unsure who to ask out.\nWhat initially seems great soon takes a darker turn as he realizes his two 'perfect idols' have some secrets of their own.\nWhat is more he has no idea what is happening to his own body or what is causing this supernatural event.\nA casual visual novel to play,\nWith multiple options to choose,\nFeaturing two romance options to explore,\nIn a not so ordinary slice of life adventure.","imageUrl":"https://media.rawg.io/media/screenshots/aa5/aa56c59fb1e915e453a6799c251cd2ee.jpg","releaseYear":2015,"developer":"Dharker Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14268,"name":"12 Labours of Hercules VI: Race for Olympus","genre":"Strategy","price":0.0,"description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other Hercules adventures:http://store.steampowered.com/app/342580\nhttp://store.steampowered.com/app/360640\nTry other Hercules adventures:http://store.steampowered.com/app/360650\nhttp://store.steampowered.com/app/396800/\nhttp://store.steampowered.com/app/491330\nAbout the Game\nThis time, Hercules and Megara are involved in the detective story. Alarm at Olympus is showing the absence of Zeus, who rarely left the peak. A few clues reveal the fact that Zeus has been abducted. Hercules and Megara begin the investigation. The snowy peaks are cold as hell, so the first thing will be to get dressed according to season.\n\nThe game introduces new landscapes, underwater levels, ice skating workers, volcano, funny puzzles, and many more.\nFeatures:\n- Stunning full HD graphics\n- Volcano, winter, tropical, and underwater levels\n- Outstanding detective story based on ancient myths\n- Day/night change!\nP.S.\nFor all game players we'll offer a bunch of adorable collection of collectible items - 7 trading cards, 4 backgrounds and 5 amazing emoticons!","imageUrl":"https://media.rawg.io/media/screenshots/d77/d771b2dca186359fc74b599bb868739f.jpg","releaseYear":2016,"developer":"Plug In Digital","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13618,"name":"Agricola: All Creatures Big and Small","genre":"Strategy","price":0.0,"description":"Includes the first expansion More Buildings Big and Small!\nAgricola: All Creatures Big & Small is a digital adaptation of Uwe Rosenberg's award-winning two-player board game featuring farming and livestock breeding.\nYou’re in charge of growing a farm from its simple beginnings -- just a hut and some fields. Send your workers to the village market to barter for goods and livestock. Breed different animals. Eventually, with your ever-growing animal population and special buildings, you’ll compete against your neighbors to see who has the best farm!\nYou only have three workers in each of the eight rounds, so make your decisions count. Play against AI, or claim your plot on a worldwide leaderboard and become a strategy game legend.\nKEY FEATURES:\n1. Experience another faithful boardgame conversion from the studio behind Le Havre: The Inland Port and Patchwork.\n2. Engage in exciting 1v1 cross-platform multiplayer matches against players from all over the world.\n3. Focus on breeding the largest and most varied livestock.\n4. Use the Playback feature to review your best games and learn new tricks from the pros.\n5. Stay on your toes with challenging AI.","imageUrl":"https://media.rawg.io/media/screenshots/d6d/d6da753bec15c8e7b3ced3772848f5e2.jpg","releaseYear":2017,"developer":"DIGIDICED","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":13411,"name":"Wander No More","genre":"Simulation","price":0.0,"description":"Stats (April 28th 2016)\nWord count: 15,000 words\nNumber of CGs: 3\nNumber of sprites: 2\n4 original music tracks\nSummary/Plot\nWander No More is a Kinetic Novel (a visual novel without any choices) which centers around the life of Kouichirou Nabatame, a renowned samurai, and Chiyo, a young village girl. Wander No More tells the story of how these two met, became a family, and attempted to restore their lives to what they once were.\nWhen Kouichirou Nabatame finally worked up the courage to desert his kingdom, he thought his days of bloodshed were behind him. He believed that if he ran far enough, and for long enough, he could leave it all behind. A normal life would finally be his, and he would be able to spend his days peacefully, helping others and protecting their happiness, rather than destroying them without mercy.\nBut as Kouichirou knew deep inside his heart, peace would not be his so easily.\nAfter weeks on the run, Kouichirou passed through Hotsu Village, and the moment he did, he spelled its demise. The Kodokushi, an elite band of samurai he used to lead, slaughtered the village's residents, then set it ablaze and continued their search.\nPowerless to stop them, Kouichirou emerged after his former subordinates moved on, desperate to put out the flames and find himself food and shelter. He moved from house to house, searching for anything edible, until he at last stumbled upon a storeroom, in which he found... a girl.\nOrphaned, maimed, and robbed of her village, the girl would undoubtedly die a slow, painful death. Kouichirou knew this, and thus asked the girl a simple question.\n\"Do you want to live?\"\nBut as he prepared to put the girl out of her misery, a fire lit in her eyes. Before she could vocalize her response, the girl, Chiyo, had already conveyed her answer.\n\"Then as the one responsible for all of this, it is my duty to make sure that happens. My name is Kouichirou Nabatame, and from this day onward, Chiyo, you are my daughter.\"","imageUrl":"https://media.rawg.io/media/screenshots/5d1/5d12ca73aad120b5f3df32830dbd4622.jpg","releaseYear":2017,"developer":"Zetsubou","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13048,"name":"About Elise","genre":"Adventure","price":0.0,"description":"My name is Owen Scott. Just a few hours ago I was a baker in San Antonio, Texas, who was working hard to give his daughter everything she needed. I am a single father, my wife Rosa died 15 years ago. Those tyrants from the organisation named Kiminster Laboratories killed her. They are the same ones who have kidnapped me and my little child, Elise. They experiment with people like us, who were not born normal. They think we are monsters, but not only we are not... we never decided to be born this way, with this abilities. In my case, I have a special perception that allows me to know where to go when I am in danger. Elise, well, she can...\n(The door of the cell where Owen is starts opening slowly)\nWhat? How is that possible? Whatever, I need to find Elise and get out of here. I hope my perception is beside me once again...","imageUrl":"https://media.rawg.io/media/screenshots/d67/d67a0828f2084dead7730768ad5bc501.jpg","releaseYear":2017,"developer":"Toni Domínguez","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11093,"name":"Near Death","genre":"Action","price":0.0,"description":"After your plane crash-lands in Antarctica, you find yourself stranded and alone at an abandoned research facility in the midst of a deadly blizzard. Plunged into utter darkness, temperatures 100 degrees below zero, and conditions far too harsh to allow for rescue, you must explore Sutro Station and and use the tools at your disposal in hopes of escaping and finding your way home.\nNot a survival game, but instead a game about surviving, Near Death pits you against an incredibly cruel opponent: Antarctica. Never more than a few minutes from freezing to death in the darkness of polar night, you must reclaim the station from the elements and fight for your life in a terrifying environment that’s more like another planet than the world you know.Features\nA fully explorable Antarctic research station with seamless open world navigation over an unforgiving landscape.\nUnique gameplay and innovative player tools suited to the harsh realities of a frigid, dark continent. Mark your way with light trails in zero-visibility storms, melt frozen obstacles to explore the base in search of much-needed supplies, create pockets of warmth with a personal heater, and more.\nA dynamic weather system that utilizes snow, wind, temperature, and lighting to create a multitude of Antarctic conditions ranging from blinding whiteouts to brief moments of calm.\nA real-time temperature simulation that freezes and thaws the environment room by room based on exposure to the elements, building layouts, the base’s power system, and your own ability to establish safe areas with makeshift repairs.\nDiscoverable blueprints and upgrades that enhance your capabilities and increase your ability to withstand the cold.\nAn original score of haunting ambient music that amplifies the isolation of Sutro Station.","imageUrl":"https://media.rawg.io/media/screenshots/6e5/6e5c0688b6d01fa4d015982736e82d5e.jpg","releaseYear":2016,"developer":"Orthogonal Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10882,"name":"GIBZ","genre":"Action","price":0.0,"description":"Shoot, slice and surf on zombies by yourself or with friends. Fight overwhelming amounts of zombies and other monsters summoned by an evil wizard (ooOooOOOo spooky) in an early 1900s London.FeaturesGibs Everywhere!\nCo-op with up to 4 players (online or local)\nOverworld Map: Wander around the overworld map and get into random encounters\n(just want to get somewhere? buy Zombie Repellent!)\nMini-games: Mini-games appear on the overworld map. Try Zombie Surfing, Gatling Gun Defence, Treasure Digging or Mayhem!\nBosses: Fight multiple monstrous zombie bosses\nPerks: Pick up coins and spend them on perks to increase weapon effectiveness, movement speed and the like\nSupa Weapons: Find strong power-up weapons in crates or earn them with killstreaks (if you have the killstreak perk)\nCharacter Customisation: Multiple heads and hair colours to choose from as well as tintable shirts\nHats!: Find hats and face wear (that give you slight buffs) on the heads of zombies or in random encounters (complete challenges to unlock special hats)","imageUrl":"https://media.rawg.io/media/screenshots/050/05061daf46b7706f5337213fc1328ec1.jpg","releaseYear":2016,"developer":"Torrunt","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10795,"name":"UniBall","genre":"Action","price":0.0,"description":"One of the longest running independent games on the Internet, UniBall has evolved from a simple version of space hockey into an online multiplayer e-sport that is uniquely its own.\nThe basics remain simple and easy to learn: you maneuver, you pass and you shoot in order to score goals.\nBut beyond this simple design lies a surprisingly complex game involving teamwork and individual skill that can take a lifetime to master.","imageUrl":"https://media.rawg.io/media/screenshots/14d/14dcdd394a41a6970517fa97a7f4a330.jpg","releaseYear":2017,"developer":"StormBrewers","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10426,"name":"Zombie Ballz","genre":"Action","price":0.0,"description":"The makers of Save Jesus brings you Zombie Ballz, an arcade-style physics puzzle game where you must kill the undead while keeping the friendly villagers alive. Each level presents a series of challenges with a variety of weapons, each with their own physical properties. Choose the best weapon, and interact with the environment by exploding crates, magnetizing metal, burning, slicing, dicing and bouncing your balls to victory.\nGAME FEATURES:\n* 48 Strategically Designed Levels\n* Level Editor allowing you to create and share your own levels\n* 9 Unique Weapons with physical attributes (size, shape, weight, strengths and weaknesses)\n* Hand-drawn art\n* Physics based puzzles\n* Arcade-style gameplay\nIn a peaceful village.. Far, far away.. The undead were awoken.. And ruined the day\nThe frightened peasants.. Looked to the skies.. And prayed to the heavens.. A hero would rise\nArmed with a mouse.. Just a few clicks away.. Use your balls.. To save the day!","imageUrl":"https://media.rawg.io/media/screenshots/244/244c6a1c4ee0eb4cc8a7c52723076e09.jpg","releaseYear":2017,"developer":"Almighty Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":3153,"name":"EA SPORTS NBA LIVE 16","genre":"Sports","price":0.0,"description":"Rooted in self-expression, NBA LIVE 16 takes player customization to another level. Whether it’s how you look or play, your entire journey is all about you.  Put yourself in the action with an all-new, easy-to-use HD face scanning app, GameFaceHD and outfit your player with the freshest gear before you even hit the court. With the all-new physics-based player movement system, LIVE Motion, experience free-flowing movement and unparalleled control on the court.  Add in fast-paced and fun online multiplayer play through the innovative LIVE Pro-Am mode, to progress and compete with your friends and it’s the perfect time to Rise Together.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-10\n25GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Electronic Arts Inc. The NBA and individual NBA member team identifications reproduced on this product are trademarks and copyrighted designs, and/or other forms of intellectual property, that are the exclusive property of NBA Properties, Inc. and the respective NBA member teams and may not be used, in whole or in part, without the prior written consent of NBA Properties, Inc. © 2015 NBA Properties, Inc. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/dc9/dc9352de2198dbf0bdd5881055c54f17_4jLUNyG.jpg","releaseYear":2015,"developer":"Electronic Arts","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":2901,"name":"Star Wars: Jedi Starfighter","genre":"Action","price":0.0,"description":"Experience Star Wars™: Jedi Starfighter™ for PS2™ with full 1080p up-rendering and Trophies. Additional enhanced features include Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with 'PS Vita' or PS App.\nThe Force takes flight!\nThe galaxy is in turmoil as the events of Star Wars: Episode II rapidly approach. Adi Gallia embarks on behalf of the Jedi Council to investigate disturbances in the Karthakk system.\nOver 20 planetary and deep space missions.\nSingle and Dual Player Action. Co-op options for all missions and additional two-player modes.\nUnique mission scenarios. Straight up steep mountains, inside enormous bases, through asteroid fields circling small planets, and more!\nContinuation of Star Wars Starfighter™ series. Graphics, effects and performance enhancements – along with over 40 new craft (capital ships, new flyable fighters and more,)\nForce Powers in Flight. Lightning, Shields, Shock wave, Reflex.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\nAdditional hardware required for Remote Play.\nAdditional hardware required for Interconnectivity.\n1-2 players\n2GB minimum save size\nDUALSHOCK®4\nRemote Play\nInterconnectivity PS4™ • PS Vita\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nLucasArts, the LucasArts logo, STAR WARS and related properties are trademarks in the United States and/or in other countries of Lucasfilm Ltd. and/or its affiliates. © 2002-2015 Lucasfilm Ltd.  All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/839/8399a76a597fc93b43ae3103f041ea9e.jpg","releaseYear":2002,"developer":"Disney Interactive Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":974266,"name":"Snowbreak: Containment Zone","genre":"Action","price":0.0,"description":"Snowbreak: Containment Zone is a 3D sci-fi RPG-shooter powered by the Unreal Engine 4 that offers a next-gen, cross-platform gaming experience, sharing your progress across all of your devices.\nThe Descent of the Titans turned a once-vibrant city into the devastated wasteland of Containment Zone Aleph. As the Adjutant of Heimdall Force, bravely undertake missions alongside Manifestations with the powers of gods and unique personalities, seeking to bring this bitter winter to an end...\n[Enjoy Hybrid Combat]\nSnowbreak's weaponry injects realism into a sci-fi setting, with designs closely simulating future firearms technology. This combines with the otherworldly, RPG-like skill mechanic to create a refreshing combat experience.\n[Take on Titans]\nThe Descent of the Titans completely changed the world, and the battlefield. Feel the thrill of battling giants in this dystopian future!\n[Befriend Operatives]\nSpend time with your Heimdall Force companions in the Base system. Decorate, chat, and give gifts to grow closer!\n[Play Co-Op in Gigalink]\nTired of exploring alone? Join up with friends and fight enemies together!","imageUrl":"https://media.rawg.io/media/screenshots/1dd/1dd343e1556ba787dfd6415d8a03244e.jpg","releaseYear":2023,"developer":"Amazing Seasun Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":898510,"name":"NORCO Goodie Pack","genre":"Desconocido","price":0.0,"description":"Immerse yourself deeper in the world of NORCO with this special, free Digital Goodies Pack, containing concept arts, wallpapers and music!\nNORCO is a text-based point & click adventure that immerses the player in the sinking suburbs and industrial swamplands of an increasingly surreal and distorted South Louisiana.","imageUrl":"null","releaseYear":2022,"developer":"GOG","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":852720,"name":"Tactics Ogre: Reborn","genre":"Adventure","price":0.0,"description":"Digital Premium Edition ContentsThe Digital Premium Edition includes the following content:\n-Tactics Ogre: Reborn Standard Edition (the core game)\n-Tactics Ogre: Reborn Original Soundtrack\nThis soundtrack includes new pieces composed by Hitoshi Sakimoto for Tactics Ogre: Reborn, as well as rerecorded live versions of Tactics Ogre favorites like Fight It Out! and Limitation.\n*The Tactics Ogre: Reborn Original Soundtrack is planned to be sold separately at a later date.\nAbout the GameTactics Ogre, crown jewel of the tactical role-playing genre, is reborn!\nBased on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they've ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before.The StoryThe Valerian Isles, jewels of the Obero Sea. Long a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores.\nFinally there rose a man to put an end to this conflict: Dorgalua Oberyth. But history would know him as the \"Dynast-King.\" King Dorgalua strove to stamp out the hatred among the people of the isles, and for fully half a century, Valeria knew prosperity.\nYet upon the king's death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria's nobility; the Galgastani, whose people made up the majority of the isles' population; and the Walister, who numbered but few.\nThe isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last...Tactics Ogre: Reborn FeaturesYour choices affect how the story unfolds, and even how it ends, with a game system that allows for multiple paths through the game and multiple endings. The story takes place through the eyes of a young man named Denam. The decisions he makes will alter the fate of those around him, and shift the course of Valeria's history.\nFight pitched tactical battles on three-dimensional battlefields. The completely revamped AI enables enemies to adapt their tactics to the situation, providing a battle system that always keeps you thinking and never grows old.\nThe class-wide level management system used in Tactics Ogre (2010) has changed to a unit-by-unit level system. Theorycraft your way through endless combinations of classes, equipment, skills, and magic.\nEnjoy numerous playability improvements, such as a quicker pace of battle, auto save, and a complete overhaul to the controls and UI to make it easier to get into the game than ever.\nThe unparalleled details of the characters and backgrounds from the original Tactics Ogre (1995) have been recreated in high definition, while the detailed pixel art that gives the game its unique feel has been preserved and enhanced.\nThe cutscenes are fully voiced in English and Japanese, and all of the music has been rerecorded with live performances! The voices bring new life to the complex motivations of the characters that make up the factions and shifting political alliances of this epic story.\nWhen you advance far enough in the game you'll unlock the World Tarot, enabling you to travel back in the story with the power of your forces intact; an incredibly useful feature in a game where your choices have such a huge impact on how the story unfolds. If you wonder what a different choice would have led to, now you can find out!\nTraveling back isn't limited to the story; the Chariot Tarot lets you rewind up to a certain number of moves during battle. In a game of tactical battles where a single mistake can mean the difference between victory and defeat, you can play without worrying that you'll back yourself into a corner.\nEnjoy a wealth of endgame content such as the 100-level Palace of the Dead. A world of endless stories and intrigue awaits!","imageUrl":"https://media.rawg.io/media/games/2a5/2a558eb173e355b55765b61738d7b644.jpg","releaseYear":2022,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":437061,"name":"Down the Rabbit Hole","genre":"Adventure","price":0.0,"description":"Down the Rabbit Hole is a VR adventure that takes place in Wonderland prior to Alice's arrival. You will discover a girl in search of her lost pet, Patches, that has wandered into Wonderland. Guide her as she moves through the mysterious world. But which way should she go?\n\nYou control the girl’s fate by plotting her journey through an immersive diorama that wraps around you. Through the game’s many twists and turns, you will find yourself exploring the most wondrous corners of Wonderland, solving puzzles, uncovering secrets and making choices about the story along the way.\n\n• Multiple Playable Characters\n• Rich 360° Diorama\n• Various Unique Puzzles\n• Hidden Collectibles\n• Unique VR Locomotion","imageUrl":"https://media.rawg.io/media/screenshots/492/492004042518bcc4ff307d2bc0c9802a.jpg","releaseYear":2020,"developer":"Cortopia","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":428186,"name":"Bonfire Peaks","genre":"Indie","price":0.0,"description":"Bonfire Peaks is a difficult open world puzzle game about attachment by Corey Martin, creator of Pipe Push Paradise & Hiding Spot.\nThings you do in Bonfire Peaks:\nClimb mysterious ruins\nSet fire to your belongings\nIndulge your feelings\nAttempt to live in the present moment\nCarry things\nThis is a game full of unique and surprising ideas, high-detail voxel art and extreme sentimentality.\nComing in 2020 to PC, Mac & Linux.","imageUrl":"https://media.rawg.io/media/screenshots/1c1/1c159451cb8a23aaa3c8eb35b4010fbc.jpg","releaseYear":2021,"developer":"Draknek & Friends","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":388315,"name":"World of Warcraft: Shadowlands","genre":"RPG","price":0.0,"description":"What lies beyond the world you know? The Shadowlands, resting place for every mortal soul—virtuous or vile—that has ever lived. Pre-purchase the next World of Warcraft expansion now and be ready to discover what awaits in this world between worlds.","imageUrl":"https://media.rawg.io/media/games/1bf/1bff5a69755eaeef9d37b4e0a14e9bca.jpg","releaseYear":2020,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":376150,"name":"Grim Clicker","genre":"RPG","price":0.0,"description":"Grim Clicker is an IDLE/RPG clicker where you will find your own strategy to explore the lost worlds. Inspired by games such as Diablo, Grim Dawn, Dark Souls, etc., the game features a complex character development, many unique items, active and passive playstyle.Key Features:Skills - A large and clever skill tree provides a lot of ways for character development.\nInventory management - You can improve your weapons, enchant them, disassemble them and create new ones. In addition to weapons, there are plenty of other items to help you on your journey.\nRitual - If you feel your combination no longer works, perform the ritual and start over. Every time you will become stronger!\nIdle/Clicker - The character is immortal, so you can safely let him fight on his own, and only manage the general trend. Or, if you like to click, come up with your own strategy in this manner and help the hero on his way to knowledge.\nShop - The shop of shards and black wax will offer you improvements that will sharpen your own style and increase the power of your hero.\nChests - The rich chests contain masters' weapons, materials for crafting, potions, pets - in short, everything that the old masters put there. This is your support in the dark world of Grim Clicker!\nCosmic Scale - The further you go through the game, the more possibilities you have. The new content implies new game strategies.\nSound - Beautiful soundtrack and attention to sound.\nMystery - Who are you? Why are you here? Look for the remains of ancient civilizations, travel through the desecrated shards, find allies!","imageUrl":"https://media.rawg.io/media/screenshots/633/633316d22657e134f9dd42641f6dad56.jpg","releaseYear":-1,"developer":"EvilCharm Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":315985,"name":"Red Bow","genre":"Adventure","price":0.0,"description":"STORY\nIf you were given another chance, would you take it? Or leave it in the hands of a little girl?\nPlay as Roh, a young girl stuck in a bizarre nightmare of dark and eerie creatures.GAMEPLAY\nThis short game will have you entangled with its story-driven narrative and puzzles as you help Roh find an answer to her place in this strange world. Red Bow is designed to play and feel as a modern top down  Gameboy game with roughly 1 - 2 hours of game play with achievement hunting.\nThe game uses an RPG top-down style which consists of finding items, secrets and solving puzzles to progress the story. The game progresses in sequences which are filled with secrets and easter eggs! Find the multiple endings by following clues and your gut!","imageUrl":"https://media.rawg.io/media/screenshots/144/1441fd35e45b3f21cb07549684b4f33a.jpg","releaseYear":2020,"developer":"Stranga Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":254643,"name":"MUSYNX / 同步音律喵赛克","genre":"Simulation","price":0.0,"description":"Indie rhythm game Musynx is now available on Steam\n\nWorldwide Composers Unite\nM2U, Paul Bazooka, Lunatic Sound, MEMME and more!\n\nUnique Visual Themes\nVarious themes are available for each music genre for a unique sensory experience!\n\nClassic Game Play\nGoing back to the roots with classic game play systems and mechanics!\n\nReal \"KEY\" Sound System\nEnhance your playing experience with real Key Sounds!\n\nVocaloid China Official Licensing\nVC idol Stardust is officially licensed, with famous VC music included!\n\nConstant Music Updates\nExciting updates are regularly added. Stay tuned with MUSYNX!","imageUrl":"https://media.rawg.io/media/screenshots/01a/01a6ab9e79249d50202f497874153804.jpg","releaseYear":2017,"developer":"I-Inferno","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"}]},{"id":64345,"name":"Cube - The Jumper","genre":"Adventure","price":0.0,"description":"The main hero of this game became an ordinary cube. \"And the weakest of mortals can change the course of history\" - more precisely, and the simplest of all when - any existing protagonists can turn your idea of ​​platformers!Features:Sandbox: freebuild with all game blocks / textures\nNice background music\nSimple controls\nUpcoming updates\nMinimal graphics\nVarious levels\n\"Monstrous trials!\"\nCool Steam achievements\nIn this, at first glance, unpretentious game you have to overcome many amazing and breathtaking tests, play for the small red cube.\nJump through obstacles, activate buttons and avoid spikes, come across here and there - the collision with them will not bring you anything good. Elementary in its essence, but unusually exciting game. A lot of positive emotions + interesting achievements in the kit.\nThe game has a sandbox mode, in which you can play with blocks and textures!","imageUrl":"https://media.rawg.io/media/screenshots/413/4131ceda1f28cf2a82ad77502f7d2eeb.jpg","releaseYear":2018,"developer":"Online Vision","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62407,"name":"The Waters Above: Prelude","genre":"Casual","price":0.0,"description":"A giant dome called the Vault of Heaven covers the earth, separating it from the vast ocean of the heavens. In this world, sea nymphs care for the stars in the sky, dedicating their lives to it. However, magic is fading, the stars are dying, and no one knows why. No one even speaks of it, carrying on like they have for tens of thousands of years, as if nothing has changed. In these circumstances, three sea nymphs and the living embodiment of a star struggle to find meaning in their lives and their fading world.\nThe Waters Above: Prelude is a free prequel to the upcoming kinetic yuri novel, The Waters Above presenting four short episodes each starring a main character from the game. Maera: A young and well-respected starkeeper. Clio: Maera's girlfriend and the head of maintenance for the Celestial authority. Iris: The assistant archivist and researcher trying desperately to save the stars. Apple: The star in Maera's care, and the first in ten thousand years to have a human form.\nFeatures\n-Stunning character art from Namie and beautiful backgrounds from Loika\n-Original soundtrack by Kris \"Astartus\" Flacke\n-Accessibility options\n-Extra features including a music room, CG viewer, and guest art gallery\nNot included is a handkerchief for your tears.","imageUrl":"https://media.rawg.io/media/screenshots/4ca/4cadb94f3ba50619d55118d9685c8848.jpg","releaseYear":2018,"developer":"Studio Élan","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":57903,"name":"Gal*Gun 2","genre":"Action","price":0.0,"description":"The Craziest Shooter Yet!\nHelp swarms of girls escape their demon possessions by using your Pheromone Shot gadget for euphoric exorcisms.\nA Gorgeous New Cast!\nWoo the girl of your dreams in a twisting, turning story full of surprises. With the aid of alluring angel Risu, become romantically entangled with girl-next-door Chiru and childhood sweetheart Nanako.\nBecome a Knight in Shining Armor!\nManage your schedule to receive quests from the academy's love-struck girls, and satisfy their demands to unlock new missions and story scenes.\nHarness the Power of Vacuuming!\nEquip the awesome Demon Sweeper gadget, capable of sucking up Gal*Gun 2's pesky demon menaces… and perhaps some clothing too!\nFull Motion Controls\nThrow yourself into the middle of the action, and beware approaches from all angles!","imageUrl":"https://media.rawg.io/media/games/79b/79b7ef7b717a536e7a24b64c1cb96a10.jpg","releaseYear":2018,"developer":"Inti Creates","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":51221,"name":"Golden Hornet","genre":"Action","price":0.0,"description":"Golden Hornet is a retro style twin-stick shooter inspired by 'Choplifter', 'Fort Apocalypse', and Stern Electronics' arcade game 'Rescue'. Become a pilot of the multipurpose helicopter 'Golden Hornet' — rescue hostages and destroy enemy outposts.StoryThere was a country called Videl, divided into North and South after their first civil war. And still, there was a lot of conflict between them.\nOn May 26th, 2020, as the North Videl began to invade in the dawn, the Second Videl War broke out. To fight against the North Videl army, the Golden Hornet — the South Videl's most advanced multipurpose helicopter — was put into operation.\nBeing piloted by two elite chopper pilots; the mission of the Golden Hornet is to save the prisoners of war, and destroy the enemy outposts.GamemodesCampaign:\nExplore the level, save the hostages and destroy all enemy targets. There are 8 chapters in total, and each chapter consists of 3 levels.\nArcade:\nEndless rescue misson. Save as many hostages as possible, and get the highest score you can achieve. Supports online leaderboard.","imageUrl":"https://media.rawg.io/media/screenshots/355/3557decc694388d55a81cff69cded881.jpg","releaseYear":2017,"developer":"Hijong Park","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51141,"name":"Hangover","genre":"Casual","price":0.0,"description":"You wake up after a party in a mess and realizing that you need to get to work in an hour. You are also supposed to bring something with you, but you forgot what it was. What will you do before going to the office? That's just up to you.\nAre you a good person or are you hiding villain deep inside? Do you prefer the easy or the harder way? Will you risk getting fired so you save your friends? You are the player. You choose.List of featuresUnique graphics\nSimple controls\nMultiple endings\nLoads of easter eggs\nFunny achievements\nInteresting story\nThe game works on any computer\nHangover is a point and click adventure with elements of telltale games with unique cartoony graphics. There are various items and you can combine a lot of them with other items or with the environment. There are lots of hidden easter eggs which unlock you new achievements as well.","imageUrl":"https://media.rawg.io/media/screenshots/957/9574113d3fb0fec883482532cab7639f.jpg","releaseYear":2018,"developer":"Divertic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50353,"name":"KOLOBOK","genre":"Adventure","price":0.0,"description":"There was an old man with an old woman ...\nNo, it was not so.\nIn the Fairy Forest, in the Internet reality the Programmer from the Designer of the 8-bit Kolobok blinded. And provided it with Artificial Intelligence.\nAnd Kolobok realized in himself a Person, and Kolobok went peddling. And no animals and other debuggers could stop it.\nGo through the epic path of Kolobok, prove to yourself and everyone that he is alive and can think.\nHardcore platformer\nMore than 15 levels\nSuper monster every 5 LVL\nUncomplicated graphics and an excellent soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/b6e/b6e7803f057e5cf363ea959db3eb512a.jpg","releaseYear":-1,"developer":"azimut team","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46803,"name":"Cybercube","genre":"Action","price":0.0,"description":"Cyber Cube is an fast action platformer in which you take control over a cube and have to overcome difficult challenges. You will be tested in 100 levels with mesmerising backgrounds and each offering a different and unique combination of obstacles. From switching layers, changing direction to deadly obstacles, each with a different mechanics. Offering multiple designs for your cube's core which you unlock by finishing higher levels.Why choose Cybercube? Fast-paced and simple core gameplay\nVariety of levels\nCompetitive, challenging and exciting\nPerfectly balanced and fun to play with friends\nAchievements and rewards","imageUrl":"https://media.rawg.io/media/screenshots/5ee/5ee4593536fe57030d53ec4bb46dc66f.jpg","releaseYear":2017,"developer":"Just1337 Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46464,"name":"MSI Electric City: Core Assault","genre":"Action","price":0.0,"description":"MSI Electric City: Core Assault is a sequel to MSI Electric City. Rediscover the magnificent city and experience the action in VR on the HTC Vive.\nThe city is under assault from hostile enemies bent on destroying the main core.  You're in control of a fighter spacecraft with the mission to defend the core and surrounding tower defense structures. Maneuver and blast away the enemy swarm in this VR bullet hell arcade shoot ’em up.\nFeatures:\nVR Bullet Hell Arcade Shoot ’em up action\n2 modes of game play\n3 different enemy types\n4 player ship power ups\nLocal high score leader board\nOriginal music soundtrack\nCaptivating visual & sound effects powered by Unreal Engine 4","imageUrl":"https://media.rawg.io/media/screenshots/0c4/0c4e8341cdb5f8e82721ca9db1e06eac.jpg","releaseYear":2017,"developer":"HyperBot Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44676,"name":"Run Of Mydan","genre":"Action","price":0.0,"description":"SynopsisA VR action-packed adventure in which you take control of a mysterious entity, flustered and perturbed by a deceived past as it struggles to break free from the shackles restraining its path.\nWith only meager power left at your disposal, fight to regain strength, recompose all memories, and unfold the truth. Your hands, layered with sublime potency are capable of forming substance, raising mass and warping gravity.\nConverge focus, sharpen your reflexes, unleash fury and watch your back. Your preys lie under the aegis of their guardians, the entrails of order hinder your merciless vengeance.\nBreak open the gates that have long constrained you in your sleep, unfold the secrecies, bend the bars of your prison, what lies beyond the haze obstructing remembrance is for you to discover.\nGame DescriptionIn Run of Mydan, VR physics interaction is at the core of the gameplay mechanics, requiring players to master accuracy in throwing, aiming and anticipating.\nSwiftness, agility and dexterity are crucial to success, forget standing still, in order to survive it is inevitable to duck, dodge and block.\nEnhance your skill with different weapons/powers. You'll start off by throwing energy spheres, but you'll soon find yourself using javelins, morning stars, boomerangs, etc...\nThe action takes place in all directions, so make sure to watch your back as you master your ability in flying.\nCoordinate and cooperate with friends in your quest for vengeance throughout the story mode, or test your abilities as a team in horde mode.\nConfront other players in multiple game modes, such as classic deathmatch, capture the flag, king of the hill, races, etc...\nFeatures SummarySingleplayer and Multiplayer: Either take on a journey packed with action but mixed with introspection, or challenge other players online in highly competitive gamemodes\nUnique Graphics: You will find yourself absorbed by timeless breathtaking atmospheres as you put your physical abilities to test.\nMultiple Weapons: Choose your weapon of choice depending on your style and abilities, refine your own combat techniques with an arsenal of ranged and melee weapons. So be ready to converge your focus, sharpen your reflexes and unleash fury with your powers.\nPlayer Customization: Customize your character's appearance and get recognized in the field, exhibit your experience by unlocking\nnew armor parts and ornaments (COMING SOON)\nFlight locomotion system: Swiftness, agility and dexterity are crucial to survival, overcome obstacles and flee when in danger!\nYou will have maximum freedom of movement, you will be able to fly!\nFight like a boss: You are the small one! But don't let this stop you from taking on the massive titans obstructing your path.To the CommunityYour feedback is of immense importance to us, and we want to rely extensively on the community to shape the game in the best way possible. We want to make this product for you and with you!","imageUrl":"https://media.rawg.io/media/screenshots/ae8/ae8f6cff9eaf86a2a1f1bcf0b42b700d.jpg","releaseYear":2017,"developer":"Virtew","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44024,"name":"Warsim: The Realm of Aslona","genre":"RPG","price":0.0,"description":"In 'Warsim: The Realm of Aslona' your only goal is to keep the Kingdom of Aslona from destruction, how you do it is entirely up to you, you may be a harsh dictator charging people for walking and breathing air, or a blood-hungry warlord commanding armies and mercenary bands on invasions and raids of enemy lands, or perhaps a charismatic diplomat who arranges trade routes with everyone from goblin tribes to orcish Chiefdoms.\nThe goal of the game since early development has been to allow the player to rule and do what they want, with the relevant consequences.\nFeatures\nRandomly generated mercenary groups you can hire to fight your enemies\nRandomly generated independent kingdoms you can trade with, battle, explore and even vassalise\nRandomly generated goblin tribes you can attack or trade with\nRandomly generated Bandit groups who rob your lands and attack your people\nTons of hidden areas to discover by exploring, such as demon gates and magical wells\nA huge arena that you can arrange tournaments in and bet on fights\nRandomly generated musicians with strange songs\nRandom events at every turn that will keep you on your feet\nKingdom upgrades in everything from guildhalls to harvesting\nChange the laws of your kingdom to suit you best\nOpen a hall of knights dedicated to whatever you wish\nOver 1 quadrillion randomly generated faces\nMillions of randomly generated races\nTons of other randomly generated things like: flags, phrases, currencies, buildings, architectural styles, naming conventions\nAnd so much more...","imageUrl":"https://media.rawg.io/media/screenshots/9fb/9fb7ff10961fc357a6397117b793fe9c.jpg","releaseYear":2017,"developer":"Huw Millward","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":39475,"name":"Marvel vs. Capcom 2: New Age of Heroes","genre":"Arcade","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/a9c/a9cd8452eedbc6a6dd63c20a917ec0c3.jpg","releaseYear":2000,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Dreamcast"}]},{"id":38676,"name":"Atlantica Online","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/660/660266cca299c3e8b0c3ec597f0b8f14.jpg","releaseYear":2008,"developer":"Ndoors","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":32062,"name":"Sid Meier's Civilization","genre":"Strategy","price":0.0,"description":"From Wikipedia: Sid Meier's Civilization is the first in a series of turn-based \"4X\"-type strategy video game created by Sid Meier and Bruce Shelley for MicroProse in 1991.[3][4] The game's objective is to \"Build an empire to stand the test of time\": it begins in 4000 BC and the players attempt to expand and develop their empires through the ages from the ancient era until modern and near-future times.\r\n\r\nCivilization is a turn-based single- or multiplayer strategy game. The player takes on the role of the ruler of a civilization, starting with one (or occasionally two) settler units, and attempts to build an empire in competition with two to seven other civilizations. The game requires a fair amount of micromanagement (although less than other simulation games).[5] Along with the larger tasks of exploration, warfare and diplomacy, the player has to make decisions about where to build new cities, which improvements or units to build in each city, which advances in knowledge should be sought (and at what rate), and how to transform the land surrounding the cities for maximum benefit. From time to time the player's towns may be harassed by barbarians, units with no specific nationality and no named leader. These threats only come from unclaimed land or sea, so that over time there are fewer and fewer places from which barbarians will emanate.","imageUrl":"https://media.rawg.io/media/games/f80/f809fd527c94191fbe32b2617773d728.jpg","releaseYear":1991,"developer":"MPS Labs","libraryGames":null,"platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Atari ST"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"SNES"},{"id":0,"name":"PlayStation"}]},{"id":31193,"name":"Empire Earth","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/977/97740bde3756cf60e9f3b3328f19ae47.jpg","releaseYear":2001,"developer":"Stainless Steel Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23994,"name":"Professor Layton vs. Phoenix Wright: Ace Attorney","genre":"Adventure","price":0.0,"description":"This game made the top 10 in Club Nintendo's Fan Faves 2014 survey! Learn\nmore >\n\nTwo of gaming's biggest sleuths team up to solve the most puzzling\nmystery they have ever encountered. For the first time ever, the\nmind-bending puzzles of the Professor Layton series meet the courtroom\ndrama of Phoenix Wright: Ace Attorney.\n\nFEATURES:\n\nFollow Professor Layton and Phoenix Wright as they are transported\nfrom London to the mystical city of Labyrinthia, where they must help\nEspella Cantabella, a girl accused of being a witch.\n\nTwo different game-play styles work together in unexpected ways. Solve\npuzzles familiar to fans of the Professor Layton series in Adventure\nmode to move the story forward, and then cross-examine witnesses as\nPhoenix Wright in Trial mode.\n\nPhoenix Wright must be on his toes for group cross-examinations. Pit\none person's testimony against another's to get the story straight,\nand then literally rewrite history alongside the city's greatest\npuzzle-solving duo.\n\nListen to the gorgeous musical score by the original composers from\nboth series, combining the vivid sounds of Professor Layton with the\ndramatic themes of the Phoenix Wright games.\n","imageUrl":"https://media.rawg.io/media/screenshots/861/8611a2305de71619925ed4b64621925c.jpg","releaseYear":2012,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":23327,"name":"Skautfold: Usurper","genre":"Action","price":0.0,"description":"Usurper is a Metroidvania Action-RPG that focuses heavily on gameplay - with a unique battle system and significant replayability. With the game inspired by Symphony of the Night, Super Metroid and the Souls series, your duty is to rid London of the Eldritch horrors unleashed by the Citadel.\nGameplay\nUsurper's battle system is built around Focus; allowing anyone to get into the game, yet still providing a high skill ceiling for those players looking for a challenge. With eight different stats to spec into (along with stat reallocation), countless varieties of character builds are possible. Usurper also features over 90 different weapons and spells; from swords, spears, axes, great swords, sycthes, whips, katanas, rapiers, daggers, bows, guns, rifles, canons, spells and summons.\nIf you're looking for even more content, then there are innumerable secrets, additional areas and optional bosses to discover. Or perhaps you'd rather set your own difficulty by activating special conditions such as; no focus mode, 1 HP mode, perma-death, or a built-in speedrunning mode.\nHowever you choose to play, The Citadel is a massive and versatile interconnected world. There are countless shortcuts to uncover, and a variety of diverse areas; from human towns to alien landscapes, grand libraries to ethereal gardens, and from an eldritch engine to a crashed spaceship.\nStory\nUsurper takes place in an alternative timeline of 1898 in London. The outer worldly Citadel has landed in the city causing massive panic and releasing the maddening Fog. Recently re-crowned Empress Eleanor has assembled the royal forces and her four most loyal Knights to enter the Citadel - in the hopes of learning more, and hopefully finding a way to rid London of this terror. Meanwhile, Waltham, the leader of the Veimar, uses his own forces to ascend the Citadel and challenge the Navigator for his own...purposes...\nUsurper is a sequel to Shrouded in Sanity, however, knowledge of the first game is not necessary.","imageUrl":"https://media.rawg.io/media/screenshots/ced/cedf46e741e601031cd1cb61e9e05598.jpg","releaseYear":2018,"developer":"Pugware","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]