[{"id":10820,"name":"WARTILE","genre":"RPG","price":0.0,"description":"A miniature Universe coming to life\nExperience a living, breathing tabletop video game that invites the player into a Viking fantasy universe inspired by Norse mythology.\nFresh and innovative combat system\nWartile is a cool down based game that keeps the action going, but still leaves you just enough time to plan your next move or play a figurine ability or special power card. At its core, this is a game about positioning and tactical decision making.\nDiorama battle boards\nLead your collection of Vikings through a beautiful handcrafted diorama battle board complete different environmental themes all with tiles that allow players to strategically plan their tactical moves.\nCollect figurines and customize their equipment and abilities\nUnlock and collect an array of different figurines, customable with armor pieces and weapons. Level them up and unlock their unique combat abilities to provide a choice of tactical options before they embark on each quest.\nGain the tactical edge by utilizing Godly and tactical cards, that are unlocked by completing objectives. These Cards are assembled before engaging in battle.\nA flirt with Norse mythology\nExplore the mythology and challenge the gods while you make your journey into a world ruled by mythology, lore and old tales.","imageUrl":"https://media.rawg.io/media/screenshots/643/6438208db50529510665804de1e054ac.jpg","releaseYear":2017,"developer":"Deck13 Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10413,"name":"VR Regatta - The Sailing Game","genre":"Simulation","price":0.0,"description":"Virtual reality sailing racing game for HTC Vive.\nLearn basics of sailing, compete in races and relax on your own sailing dinghy.\nGrab the tiller and sheet in the main!  VR Regatta is a virtual reality sailing experience for people of all ages. It's for sailors of all sailing experience levels.\nJoin the VR Regatta community and learn about sailing and hone your sailing skills.\nWith VR Regatta, experience sailing immersion in a way that only virtual realty can provide.  Whether you're racing against other boats and hanging out for a sail with your friends, join the growing community and be part of shaping VR Regatta into your dream seascape.Features  Steer the boat using tracked controllers\nSailing academy and tutorial to get you started\nRelaxing sailing - enjoy the peaceful sail (sunrise, sunset and moonlight sailing)\nEasy race - sail downwind collecting stars - compete with global community of sailors\nRace - make a quick lap around the buoy\nLong Race  - for sailing pros - can you beat others and be the best? Experimental features Multiplayer relaxing sailing\nPirate ship - Light up cannons with a torch and have blast shooting them\nTry our rough sea level - adjust wave size and see if you are seaworthy","imageUrl":"https://media.rawg.io/media/screenshots/144/14481b3622d81b480f2f33cb628b1da2.jpg","releaseYear":2016,"developer":"Olga Dziemidowicz","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9473,"name":"Pain Train","genre":"Action","price":0.0,"description":"The subway has been overrun by an infected population who are lead by cyborg masterminds.  You feed off the pain you inflict and have become known as Pain Train.  This enables you to take on hordes of infected that would otherwise overrun a normal man.   Shoot your way through 12 gore packed levels, complete side missions, unlock new weapons, beat multiple difficulty modes, and defeat all of the cyborg masterminds. Pain Train is entering a subway station near you, \"All Aboard!\"                                                                                                       Steam Features\n578 Steam Achievements\n10 Steam Trading Card Set","imageUrl":"https://media.rawg.io/media/screenshots/bf1/bf1863cd742fc67bec2dc0027d6cb7f0.jpg","releaseYear":2017,"developer":"Virtual Top","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9445,"name":"CHKN","genre":"Adventure","price":0.0,"description":"CHKN is an open-world sandbox game where life itself is your strongest tool!Create life, block by block…Bring living, breathing creatures to life in any size, shape, or combination you can imagine, with genuine personalities and feelings that respond to your actions and the world around them.Give your creatures unique traits and abilities…Life blocks have different stats and abilities built into them. Some are strong, some are fast, some shoot blinding ink, some poison enemies… they can all be used to your advantage to make creatures more effective.Work with your creatures to scavenge, craft, and build…Your creatures will help you gather resources in order to craft a wide array of tools, items, and structures. The better resources you find, the better the things you can craft!Fight for survival as you explore a mysterious island…Work together with your creature companions to survive the many dangers of CHKN, avoid starvation, and defend your thriving homestead.Get Creative…If the risk and survival of Adventure Mode aren’t your thing, you can spend your time in Creative Mode with an unlimited supply of every life block and resource at your fingertips. Create whatever you like with no restrictions.Bring Your Friends…Want to brave the wilds of Foot Island as a group? Or collaborate on a massive creature and see what happens? Invite other players to join you in any mode and see what you can accomplish together.Share Your Ideas with Us…We’re just beginning with CHKN and we’d like to involve you in this journey as much as possible! Our development is completely open, so you can see what we’re working on and share your ideas. We’re also available directly on Twitter, Facebook, or at heychkn@katapultstudio.com to chat. Show us a crazy creature or share any YouTube videos you’ve made (we collect them!).Thank you to all our CHKN fans for your feedback, bug reports, and suggestions so far!","imageUrl":"https://media.rawg.io/media/screenshots/35c/35c1f9fc0fe6a7f5491f40ad01b6d5d8.jpg","releaseYear":2016,"developer":"Katapult","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":892901,"name":"Immortals of Aveum","genre":"Action","price":0.0,"description":"Immortals of Aveum is a single-player first person magic shooter that tells the story of Jak as he joins an elite order of battlemages to save a world on the edge of abyss.\nWith legions of soldiers on both sides of the Everwar, he must uncover the mysteries of Aveum's troubled past, if there's any hope for saving its future.\nMaster three forces of magic and unleash spells with deadly skill in a game that defies FPS conventions.\n\nBe The Battlemage\n\nJoin the order of Immortals, the champion protectors of Lucium, and become Jak, an elite Triarch Magnus.\n\nMaster Your Magic\n\nFast, fluid, first person spell-based combat that’s easy to learn and satisfying to master, where players are rewarded for clever chained attacks and well-timed counters.\n\nUnleash Your Arsenal of Spells\n\nUnlock and upgrade more than 25 spells and 80 talents. Discover, upgrade and craft hundreds of pieces of magical gear to synergize your playstyle across all three forces of magic.\n\nSave a World on the Edge of Abyss\n\nJak and Lucium’s elite Immortals must race to uncover the mysteries of Aveum’s past, if there’s any hope of saving its future.","imageUrl":"https://media.rawg.io/media/games/007/007d56273248aef4295bdab0a0c7d3a4.jpg","releaseYear":2023,"developer":"Ascendant Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":631948,"name":"WRC 10 FIA World Rally Championship","genre":"Simulation","price":0.0,"description":"To celebrate the 50th anniversary of the championship, WRC 10 is offering a brand-new Anniversary edition, packed with new content and sensations. Relive the most intense moments from 1973 to today! WRC 10 History Mode puts your driving talents to the test through 19 historical events that require you to adapt to racing conditions of each time period.\n\nNever-before-seen content for WRC:\n- The 4 new 2021 rallies: Estonia, Croatia, Belgium and Spain\n- 6 historic rallies including Acropolis, San Remo, Germany and Argentina\n- 120 special stages\n- 52 official teams from the 2021 season (WRC, WRC2, WRC3, Junior WRC),\n- 20 legendary cars from Alpine, Audi, Lancia, Subaru, Ford, Mitsubishi, Toyota, and more...\n\nCareer Mode, unanimously hailed as one of the best-developed and most complete in a racing game, has also been comprehensively upgraded and now includes a livery editor, so you can create your own team and add your colours to contemporary cars!\n\nWith a hyper-realistic and ultra-precise physics engine, WRC 10 has made the feeling of driving even better, with better aerodynamic force, turbo and braking management, on all surfaces. The sound design has also been revamped to reinforce the immersion.\n\nA particularly competitive eSport, with daily and weekly challenges, and clubs so you can create your own competitions, drivers can measure themselves against the community at their own levels.","imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbf801dd1c7534eae9bf9ba4bce25200.jpg","releaseYear":2021,"developer":"KT Racing","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":613540,"name":"Desolatium: Prologue","genre":"Adventure","price":0.0,"description":"We have always believed that God sent his son into the world to save us. But, what if that is not what happened? What if the world cannot be saved? The real story is about to be revealed.\nIt all begins in the Massacre of the Innocents by the infamous King Herod. The player will walk in the shoes of Samara, a young woman who has just lost her child. As she wanders around the desert, praying to her God for help, something answers her call… something very ancient. A primal being, the closest thing to a creator that exists in this world.\nThis being has decided to grant her a central role in its return, so that the world finally knows the terrible intentions of their true god. To do this, she will be carried to a strange place where, finally, her fate will be revealed.\nExplore a city outside the limits of time and space; meet mysterious characters who will guide you on your journey; interact with the objects around you to solve complex puzzles in order to get to the terrible presence of a cosmic entity of immense power: Cthulhu.\nThe time has come to answer the call of The Great Dreamer.\nHyper-realistic graphics: All levels have been generated by shooting real locations in 360º and the integration of 3D elements in post-production.\nGraphic point & click adventure full of mystery.\nAmbisonic Audio (8D): It generates an immersive sound effect that seems to come from all around the player. You will only need your headphones to live this experience.\nFull immersion: Desolatium will be available for PC and, if you want to achieve total immersion, you will be able to use a Virtual Reality device (Steam and Oculus).\n\"Thank you very much for this new experience which is really good in terms of atmosphere and visuals and audio. I really like walking around and looking for objects and intersections with the game mechanics\" - Olivier\n\"I really enjoyed playing the Prologue and looking forward to get the full Version\" - Blacky","imageUrl":"https://media.rawg.io/media/screenshots/468/4686732a9048452cf602be52c98bccea.jpg","releaseYear":2021,"developer":"Superlumen","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":560814,"name":"Time Loader","genre":"Action","price":0.0,"description":"Time Loader Prologue is available here.\nTime Loader is a story-driven, physics-based puzzle platformer with a twist. At the helm of a small robot, you’ll travel back to the 90s to prevent a tragic accident. Explore the house of your creator, solve brain-teasing puzzles, acquire unique and powerful upgrades, and see common household items from an entirely new perspective!\nBut remember: meddling with time has serious consequences. You may succeed in changing the past, but can you deal with the result of your actions?\nGameplay Features:\nSubverted perspectives\nEven the most familiar objects look different when you’re the size of a toy car. Will you watch your every move or dive head-first into this dangerous new world?\nAn arsenal to choose from\nBoosters, harpoons, screwdrivers… choose among dozens of upgrades to tackle each level and get the job done!\nDynamic and branching narratives\nDon’t just relive the past: change it! Every choice you make will influence the story and may lead to a different outcome. So do us a favor: change the past responsibly!\nA complimentary dose of nostalgia\nTime Loader features music, references, and items straight out of the ‘90s. Relive your childhood or, if you’re too young for it, just gawk in awe at how primitive humanity used to be back then!","imageUrl":"https://media.rawg.io/media/games/da8/da86a74c94d6516f31dcec888c14488f.jpg","releaseYear":2021,"developer":"flazm","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":535641,"name":"Hello Guest: Hello Neighbor 2 pre-alpha","genre":"Adventure","price":0.0,"description":"Wishlist Hello Neighbor 2https://store.steampowered.com/app/1321680/\nAbout the GameWelcome to Hello Guest, beloved Hello Neighbor 2 pre-alpha, a stealth horror thriller about an advanced, self-learning AI. You take the night shift as a security guard at the abandoned Golden Apple Amusement Park where a creature is hiding in the shadows.\nThe AI-Powered creature learns from your movements. It's afraid of the light and always tries to sneak up from behind.","imageUrl":"https://media.rawg.io/media/screenshots/74f/74f0d984b8cf372db97c348cb11011c0.jpg","releaseYear":2020,"developer":"tinyBuild","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":485095,"name":"Mosaique Neko Waifus 3","genre":"RPG","price":0.0,"description":"Maybe it's the spark in your eye. Maybe it's your composure and wit.\nSomehow you managed to attract all the neko girls from the area and now they all want to meet you.\nDon't let them wait any longer!\n• Use special abilities that help you solve puzzles\n• Also level them up the way you want\n• Navigate the different dialogue choices, show the girls your charm!\n• Collect items that will boost your skills\n• View all the scenes unlocked in the gallery","imageUrl":"https://media.rawg.io/media/screenshots/c56/c565899b5ac5e4390a8166d7c365fc4a.jpg","releaseYear":2020,"developer":"Lil Hentai Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":428237,"name":"TaleSpire","genre":"RPG","price":0.0,"description":"TaleSpire is a beautiful way to play pen and paper RPGs online.\nMarrying the beauty and physicality of miniatures with the expanse of digital worlds, TaleSpire is a place where building and play happen throughout the whole play session.\nWant to destroy a wall to reveal a secret passage? Do it! Want to rain down piles of gold from the heavens? Sure! At any moment the GM (or multiple GMs) can jump into building mode and change the world without interrupting anything else.\nTaleSpire is not tied to a specific game or ruleset so whether it's a tiny one shot to a sprawling campaign, if it's on a square grid then the chances are we have your back.","imageUrl":"https://media.rawg.io/media/screenshots/19d/19d3a2c50aa33c48cae7ee66fb1b9a8d.jpg","releaseYear":2021,"developer":"Bouncyrock Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":374566,"name":"NHL 20","genre":"Sports","price":0.0,"description":"In NHL® 20, your favorite NHL stars now look and feel more authentic with new Signature Shots and over 45 new shot types that make every attack a threat. A new broadcast package celebrates your biggest plays as you take on all-new game modes, including the new winner-take-all Eliminator mode where you play solo or team up with friends to take down the competition.\nCONDITIONS AND RESTRICTIONS APPLY. SEE https://www.ea.com/legal FOR DETAILS.\nNHL, the NHL Shield and the word mark and image of the Stanley Cup are registered trademarks of the National Hockey League. NHL and NHL team marks are the property of the NHL and its teams. © NHL 2019. All Rights Reserved. Officially Licensed Product of the National Hockey League.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\n1-4 players\nNetwork Players 2-12 - Full game requires PlayStation®Plus membership to access online multiplayer\n30GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCONDITIONS AND RESTRICTIONS APPLY. SEE https://www.ea.com/legal FOR DETAILS.\nNHL, the NHL Shield and the word mark and image of the Stanley Cup are registered trademarks of the National Hockey League. NHL and NHL team marks are the property of the NHL and its teams. © NHL 2019. All Rights Reserved. Officially Licensed Product of the National Hockey League.","imageUrl":"https://media.rawg.io/media/screenshots/776/77679a76328b5c8495591794fc7a568e.jpg","releaseYear":2019,"developer":"Electronic Arts","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":335292,"name":"Pikmin 4","genre":"Strategy","price":0.0,"description":"Meet Pikmin, small, plantlike creatures you can grow, pluck, command, and overpower your enemies with! These curious helpers come in different types—fire is no sweat for Red Pikmin and the brand-new Ice Pikmin can freeze enemies and the environment. Use your Pikmin’s miniature might (and a bit of strategy) to explore this mysterious planet.\n\nYou get a dog, too! Oatchi (pronounced oat-chee), resident good boy and dependable partner, can help with things like smashing obstacles and carrying Pikmin throughout your adventure. With the miniscule Pikmin and a capable canine in tow, no challenge is too big!","imageUrl":"https://media.rawg.io/media/games/274/2740b879e28df2ac3cdbc929a553863d.jpg","releaseYear":2023,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":327205,"name":"Unexplored 2 The Wayfarer's Legacy","genre":"Action","price":0.0,"description":"Unexplored 2: The Wayfarer’s Legacy is a completely different beast than its predecessor. With Unexplored we experimented with new ways of generating procedural dungeons. We wanted levels to feel as though they were designed by hand, rather than by an algorithm.\n\nThe experiment succeeded beyond our expectations and we’re extremely proud that our humble indie game has received widespread recognition from critics. Most notably, PC Gamer, Rock Paper Shotgun, and Vice Waypoint all featured Unexplored as part of their respective Game of the Year articles.","imageUrl":"https://media.rawg.io/media/screenshots/a06/a06f44dcd4b563bedda040c17dc1a65c.jpg","releaseYear":2022,"developer":"Ludomotion","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":325020,"name":"Sakura MMO 3","genre":"Simulation","price":0.0,"description":"Sakura MMO #3 is the final part of the Sakura MMO series, which concludes Viola’s adventure.\nOnly a few months ago, Viola was an average woman bored with her life in Japan. Her only method of escape was via the vibrant and colorful MMORPG, Asaph Online. Though Viola poured thousands of hours into Asaph Online, she knew it was little more than a game, and it could never be a suitable substitute for reality. That is, until she found herself transported into the real Asaph!\nIn Asaph, Viola recruits a party of cute girls and decides to fulfil her biggest dream: having a harem! Light-hearted hijinks ensue… but trouble is brewing on the horizon that could spell the end of these peaceful days. The fallen goddess, Iona, has been plotting to bring about an end to Asaph for good – and now Viola must go on a journey across the ocean, alongside her crew, to defeat her. Will Viola emerge triumphant from the skirmish, or will Iona best her?\nFind out in Sakura MMO #3, the longest instalment of the series. Your choices can save Asaph, or doom it to destruction. Will Viola survive her greatest challenge yet – and which girl will she end up with? It’s all up to you!\nViola is the heroine of the story.\nIn Japan, she was an ordinary woman called Kotone. In Asaph Online, however, she’s a powerful dark witch with access to some of the most formidable spells imaginable.\nShe has a bit of a sadistic side, and she loves toying with cute girls… but she’s brave and loyal, and would rather die than see her allies get injured.\nNeve’s is Viola’s loyal, devoted maid, and a member of the maligned darkling race.\nNeve cares for Viola so deeply she often disregards her own health, and it seems very likely she may one day work herself to death.\nThough Neve is a polite, softly-spoken young woman, she has a short temper, and won’t hesitate to attack anybody who speaks ill of her mistress.\nSomewhat neurotic and not entirely stable, Neve has one or two dark secrets that the evil goddess would love to exploit.\nFion is an opportunistic thief girl with a penchant for shiny things.\nFion joined Viola’s team after an attempted robbery went awry. Viola caught Fion and punished her accordingly – much to Fion’s chagrin.\nThough their relationship got off to a rocky start, Fion has grown rather fond of Viola. A cheerful and good-natured young woman, despite her years spent living on the streets, Fion is deft and wily, and a useful ally in any fight.\nEleri is a cool-tempered, serious knight with a firm sense of duty.\nThough Eleri acts as the voice of reason in the party, she isn’t infallible. Eleri gets flustered easily, which makes her a prime target for teasing.\nLike Viola, Eleri is not a native resident of Asaph. Eleri’s real name is Aina, and she used to live in Japan. She met up with Viola quite by chance, and now the two travel together. Though Eleri has grown accustomed to life in Asaph, she’s determined to find her way back home.\nThe mysterious goddess who resides in the underworld.\nIona is one of the oldest goddesses in Asaph. According to Asaphian myth, it was Iona – alongside her husband, Aeron – who created life as we know it. Aeron crafted mankind in his image, while Iona was responsible for creating the darkling race.\nAfter their relationship splintered, Iona turned on her husband and tried to kill him. She was soon punished for her folly, however, and she was condemned to the darkest realm of the underworld.\nIona has waited for hundreds of years, honing her magical powers in secret, so that she can one day escape from the underworld and destroy Asaph for good.\n- finish Viola's adventure in Asaph Online\n- meet a new companion\n- available in Chinese","imageUrl":"https://media.rawg.io/media/screenshots/bb8/bb82e4628e0b7eae6c321a30a03ed0f2.jpg","releaseYear":2019,"developer":"Winged Cloud","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":272060,"name":"Lofi Ping Pong","genre":"Sports","price":0.0,"description":"Lofi Ping Pong is a rhythm game where you have to hit the ball according to song's tempo.\n5 different modes - you can play with one or two balls, or maybe the wind starts to blow?\nShort story mode with lo-fi tracks.\nPlay with your own music, if you get tired from the ones that are in the game.\nSplit Screen to play on one PC with your friend.\nNo-fail mode so you can level up your skill.","imageUrl":"https://media.rawg.io/media/screenshots/ef5/ef5a3f860f312794376c7b61ffb1fa08_7NZKQGl.jpg","releaseYear":2018,"developer":"Calvares","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":241043,"name":"Mortal Kombat: Shaolin Monks","genre":"Action","price":0.0,"description":"Mortal Kombat: Shaolin Monks is an Action/Adventure title driven by both intense single and multi-player action. Similar to \"Mortal Kombat: Deception,\" background interactions (i.e., acid pits, living trees, spiked ceilings, etc.), multiple new fatalities, and action-based puzzles also play an important role in the player's quest for an \"outstanding\" victory. Mortal Kombat: Shaolin Monks features an impressive line-up of Mortal Kombat characters, as well, that make frequent appearances as enemies, in boss battles and during several additional in-game interactions. For the first time ever, Mortal Kombat fanatics can explore all the mythos and rumors of the Mortal Kombat universe from an entirely new perspective. Action/Adventure fans will be blown away by the intuitive kombat system, puzzle solving and epic storyline that can be experienced in either the single player mode or through co-op play. [Midway] Collapse","imageUrl":"https://media.rawg.io/media/games/d2f/d2f391bd107e2b3322789ddedbd90b18.jpg","releaseYear":2005,"developer":"Midway Los Angeles","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"}]},{"id":62536,"name":"Mini World: Block Art","genre":"Adventure","price":0.0,"description":"Just UpdatedSoccer Tournament is coming! For the first time in Mini World, we have a round object with full ball physics. Come play soccer with us!!\nAbout the GameMini World is a 3D free-to-play sandbox game about exploration, creativity, and start an epic adventure with your friends. There are no levels or restrictions, but only the freedom of your creation. The easy-to-join multiplayer settings allow you to connect via PC and phones anywhere at any time. In our game, you can build a house, an apartment, a castle, or even a city. The sky is the limit. You can also explore the underworld and challenge the Dark-Dragon with your friends.\nIn addition to Survival Mode, you can download and play some fun mini-games made by other players. There are various types of mini-games, like parkour, puzzle, FPS, or strategy. Of course, these games are fun if you play with your friends!\nMini World is a great platform. With hundreds of blocks to choose from and over 1000 ingame items to play with, you can express yourself in the world anyway you like!\nKey Features:\n1 Enormous Sandbox World – explore an expansive sandbox world with a variety of unique cute monsters, blocks, materials, and mines.\n2 Unique game - Unique game engine with cute game character design\n3 Single Player and Multiplayer – jump into a friend's game with friendly fire turned on, or start a new world on your own. Share your game with other players, or join other players from all over the world in theirs.\n4 Gallery - You can upload or download the works at the Gallery, have a look at the hottest MOD map，game map or others’ work.\n5 Game mode – Survival mode, Creation mode or mini games created by other players, you can enjoy the charm of this game anywhere at any time.\n6 Powerful game-editor - There are various types of mini-games, spanning from parkour, to puzzle, to FPS, to strategy, etc... all can be made by the ingame-editor\nCS email: MiniworldCustomerService@gmail.com","imageUrl":"https://media.rawg.io/media/screenshots/b50/b50ceafba6fc60509bbc5548026161b6.jpg","releaseYear":2018,"developer":"Miniwan Technology Co.,Limited","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":62452,"name":"Dead End Job","genre":"Action","price":0.0,"description":"Dead End Job sends you into a madcap, Ren & Stimpy-esque world to bust up ghosts. It’s a procedurally generated, couch co-op, twin-stick shooter that straps a vacuum pack to your back, and puts a plasma blaster in your hand. For you, it’s just another day in the office.Familiar HauntsYou take on the role of Hector Plasm, a worker at Ghoul-B-Gone – ‘the Number One experts in paranormal pest control’ – as you’re tasked with heading to haunted offices, hotels, and other everyday buildings before freeing them of unwanted guests. One minute you are sucking up specters, the next you are sucking up to your bosses, chasing that promotion.\nHave you got what it takes to be the best at putting pests to rest?Don’t Suck… Well, Actually DoExercise that fighting spirit, since every specter you snag and every resident you rescue is added to your client’s bill at the end of the job. Haunted by the ghost of your mentor, quite literally, you must learn the ropes and to save her soul before she’s forced to spend eternity as a spook (voted “Least Preferred Fate” in Ghost Hunter Monthly).Kindred SpiritsPlay alone or bust ghosts with a buddy in drop in / drop out co-op that works seamlessly within the main adventure. Plus you can play to an audience with Twitch integration that allows viewers to help or hinder your assault on the afterlife.Ghost WriterDo you love 90's cartoons? Yeah, so do we, and we grew up on their stretchy squishy gross-out laughs. Our love for them spills over into the game like so much ectoplasm. See every nose hair in wacky, vibrant art that brings everyday items to life as screwball spooks to suck up. To top it off, the entire adventure is backed by music from the award-winning Will Morton (Grand Theft Auto series).","imageUrl":"https://media.rawg.io/media/screenshots/cf6/cf6a7d1a1625513444b257c7daeef6e3.jpg","releaseYear":2019,"developer":"Ant Workshop","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":50411,"name":"House of Evil","genre":"Adventure","price":0.0,"description":"House of Evil - atmospheric survival horror with a first-person view, in which you can test your nerves for strength. The events take place in the mansion that exists in reality. The main character is an ordinary philistine, his wife is an exorcist, after an unusual telephone conversation, the protagonist can not call to the spouse, and decides to go in search of her, fate takes him to an old mansion where unimaginable things begin to happen. Four horsemen of the apocalypse moved into the owners of this mansion, if the riders get out on freedom - come the end of the world. The last hope of humanity is our main hero. You will have to solve interesting puzzles, mix herbs, create different potions, consecrate water, study spells in Latin, and use it all against evil spirits, demons and other evil spirits.\nYou will find more than 40 rooms of the mansion where the events unfold games. Two floors of the mansion, a terrible cellar where a psychiatrist conducted his rituals, over mentally ill people, from his hospital. According to the plot, a psychiatrist is the brother of the owner of the mansion. Cemetery on the territory of the mansion, another for the mirror world, in which we get in the middle of the game. Another world, it is a copy of the real world, only everything that is gloomy and evil in it.\nManor Zaklyuchye is located in the Tver region,Russia, if you go on M-10 from Moscow to St. Petersburg, and before the city of Valdai and the Valdai lake turn to Borovichi, and before reaching it 50 km there will be a station Likoshino. Here, in a secret corner, on the shore of the forest lake is this mansion. In the late XIX - early XX century here, in the village of Zaklyuchye, was built a manor of the St. Petersburg architect A.S. Khrenova, probably, on his own project. The main house has a complex asymmetric configuration of the plan and consists of various volumes. Due to its remoteness, beautiful tiled stoves and a spiral staircase of iron are preserved inside the house. And on the territory there were amusing sculptures of the Soviet period, when there was still a tuberculosis sanatorium, during the Soviet period, not one patient perished in this mansion. However, this mansion also became famous for the mysterious disappearance of people. And with its eerie atmosphere from which the blood runs cold. The circle of the mansion encompasses a dense forest. It remains to guess what happened to the disappeared people, whether they got lost in the forest, although no traces were found by search units , whether it is related to the individual reduction.\nThere is a system of using \"first-aid kits\" and potions for \"banishment\" that has a certain complexity. The player can find five types of herbs: wormwood, Yarrow, St. John's wort, Basil, Blagovonia. With a certain mixing of herbs, a potion that restores health, or a potion that weakens the immunity of enemies . Also, in the game will have to consecrate water and much more.","imageUrl":"https://media.rawg.io/media/screenshots/ee6/ee66bd2c22aa80460c84dc6c9ed22f6e.jpg","releaseYear":2017,"developer":"Trokhin Viktor","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":48964,"name":"Ben 10","genre":"Action","price":0.0,"description":"It’s Hero Time!\nBen, Gwen, and Grandpa Max once again have their cross-country road trip in the Rust Bucket cut short by super villains and their evil, world-threatening plans.\nAs Ben Tennyson, it’s up to you to save the world. Take on some of Ben’s most infamous enemies, including Zombozo, Queen Bee, and the Weatherheads. Unlock and transform into all ten of Ben’s incredible alien forms. Use each alien’s powerful combat moves – including Ultimate Attacks - to lay the beat-down on enemies with devastating combos, and solve puzzles with each alien’s unique abilities as you unravel exciting new stories in three all-new playable episodes.\nBeing a hero can be hard work…but it's a whole lot of fun!","imageUrl":"https://media.rawg.io/media/games/f4b/f4b1973b4ef4a2c64029065a99f8d60f.jpg","releaseYear":2017,"developer":"Torus Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":46243,"name":"MONITOR: The Game","genre":"Desconocido","price":0.0,"description":"MONITOR is a narrative based game where you must find out what has happened to the CEO of Dolos Pharmaceuticals through audio bugs in his getaway retreat.\nYou play as the Journalist; a disgraced character who has ended up in a room with six monitors which have audio bugs to a place called the Lynx's Crown. Your \"Client\" has told you to listen, learn but not to act on anything you hear...\n...I hope your conscience is as bad as everyone says it is...because things are going to get a whole lot worse before they get better.\nA point and click style adventure game made entirely in Unreal Engine 4, you must listen to six rooms with their own narratives. Learn the ways of five fully voiced characters. And choose to act on the fate of them all when you're told specifically not to.\nWith ten endings, this is a project for Sheffield Hallam University with a hope to show the skills of those involved.\nLISTEN. LEARN. ACT?\nThe Steam edition includes achievements, new extras and developer commentary! Releasing September 15th!","imageUrl":"https://media.rawg.io/media/screenshots/c0a/c0ab2f55be27611817b4a8398020935f.jpg","releaseYear":-1,"developer":"DNT Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45805,"name":"Muv-Luv Alternative","genre":"Adventure","price":0.0,"description":"Muv-Luv Alternative is a direct sequel to Muv-Luv Unlimited, and is the grand finale of the Muv-Luv trilogy.\nThis page contains spoilers to the first game, so if this is your first time hearing about Muv-Luv series, we recommend playing Muv-Luv first.About Muv-Luv Alternative:\nThis is it. The chips are down, the die’s been cast, and the fate of the multiverse is on the line. Step back into the cockpit and prepare for deployment in Muv-Luv Alternative, the most critically acclaimed visual novel of all time. Just be sure to keep a box of tissues handy, because it’s about to be a bumpy ride.\nThis isn’t a cutesy high school rom-com anymore; it’s an epic tale of political conspiracies, international espionage, an alien menace, quantum causality, bittersweet reunions, genetic modification, and much, much more. Gluttons for punishment, rejoice, because once it gets rolling, there are no brakes on this pain train. It’ll test your limits, challenge your worldview, and by the time it’s all over, you’ll be so emotionally spent that it’ll be weeks before you can fully process the implications of what you’ve just witnessed. Fair warning, though: common side effects include feelings of emptiness, PTSD, and unrealistic expectations for any and all other visual novels.\nThis definitive release comes complete with a brand new translation, all-new CGs, additional voice acting, and dual language/ tablet support, so if you think you’re ready to take the dive, there’s never been a better time to strap in and see for yourself why so many readers consider this the greatest story ever told.The Story So Far\n(PLEASE NOTE: The following section contains major spoilers for the previous installment in the franchise. Muv-Luv Alternative picks up where the events of the original Muv-Luv left off, and certain scenes will play out differently depending on your choices in the first game. To get the most out of the Muv-Luv experience, we highly recommend that you complete the original game before starting Muv-Luv Alternative. Click here to jump to the game’s product page on Steam.)\nThree years have passed since the day Takeru, an unsuspecting Japanese high-schooler, suddenly awoke in a world not his own — a war-torn alternate reality in which mankind was on the brink of extinction, locked in a decades-long struggle against the ruthless extra-terrestrial invaders known only as the BETA. In that time, he’s been through an awful lot — enlisting in the military, meeting parallel-universe versions of his old friends, and even falling in love. But unbeknownst to Takeru, he and his squadmates were being trained to participate in a top-secret UN contingency plan known as Alternative IV — a last-ditch effort to take back the Earth via experimental technology. Unfortunately, however, development screeched to a halt when the project’s chief executive, Professor Kouzuki, hit a wall in her research due to technological constraints. With tensions rising, and pressure to shift gears from governments all across the world, the UN delegation opted to scrap the project in favor of its successor: Alternative V. This was humanity’s last resort — a plan that utilized all of their remaining resources to build a migrant fleet of interstellar craft, allowing a tiny fraction of the population to abandon the Earth in the hopes of finding life anew in another star system. Takeru and his comrades-in-arms were among those left behind, condemned to death by their fellow man.\nBut it seems the hand of fate has bigger plans for Takeru, because it’s at this point that he wakes up to find himself back in his childhood bedroom once again. Not in his own world, mind you — but back where he was first spat out into this hellscape three years prior. This was no dream; this was a recurring nightmare. But then it hits him: this is a second chance. If he’s truly been sent back in time, then he’s the only one who knows of the impending doom that awaits this world. Perhaps he can use this knowledge to warn Professor Kouzuki, and together, they can somehow find a way to prevent Alternative V from ever being enacted. And who knows? If he can change history, then maybe — just maybe — he’ll find the answers to all of his questions. Why has he gone back in time? Why isn’t Sumika here? And most importantly, what IS Alternative IV?Features:Linear Visual Novel - Unlike the first two parts, Muv-Luv Alternative is almost designed  as a straightforward interactive premiere movie, complete with voice acting, subtitles, and intense music, perfectly fitting for a finale.\nOver 50-70 hours reading time.\nAvailable in three languages - Japanese, English and Simplified Chinese.\nThe UI has been reworked, so it's compatible with the newest tablet PCs and touchscreens.\nUser save data are stored in Steam cloud so readers can continue their progress anywhere with ease.Muv-Luv Alternative Reviews (Original AppID)https://steamcommunity.com/app/449840/reviews/?p=1&browsefilter=toprated&filterLanguage=all","imageUrl":"https://media.rawg.io/media/screenshots/767/7675ae7581d5cf73498f3d68e056bb8f.jpg","releaseYear":2017,"developer":"Pqube","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":44888,"name":"Draw Your Game","genre":"Adventure","price":0.0,"description":"“I wish I could make my own video game.” Who among us hasn't thought that at some point? Draw Your Game is a user-friendly application allowing anyone and everyone to create their own video game in a few quick steps:\n▶ Draw your game's world on a piece of paper, using four different colors (black, blue, green and red).\n▶ Use the 'Draw Your Game' app to take a picture of your drawing.\n▶ Wait 10 seconds, while Draw Your Game transforms the drawing into a game.\n▶ Play your game, with a character that you can control.\n▶ Share your creation with other Draw Your Game users.\nFour different colors to create the world of your choosing:\n▶ Black for stationary floors/ground;\n▶ Blue for movable objects that the character can push around;\n▶ Green for elements that the character will bounce off of;\n▶ Red for objects that will destroy the character or the blue objects.\nDraw Your Game allows you to create an infinite number of worlds, either on the same sheet of paper or by adding new sheets, one after the other, to create a real story line.\nThere are two available modes:\n▶ “Create” mode, to create your own worlds;\n▶ “Play” mode, to play in the worlds created by the community, either in “campaign” mode (worlds selected by our team), or in “catalogue” mode, where you can use search criteria to choose a world yourself.\nThere are several ways to play the different worlds, at the creator's choice:\n▶ “Escape”: the character must find a way off the paper to escape and win the game;\n▶ “Destruction”: the character must push blue objects into red ones to destroy them.\nOur teams approve each new world before releasing it to the community, and a rating system is used to rank the top worlds against one another.\n[ Drawing recommendations ]\n▶ Use fairly wide felt-tip pens.\n▶ Choose vivid colors.\n▶ Take pictures under good lighting.","imageUrl":"https://media.rawg.io/media/screenshots/6c8/6c8c97f18e95547cc4e4f7c5b3999daf.jpg","releaseYear":2017,"developer":"Zero One","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":38140,"name":"Soldier of Fortune: Payback","genre":"Action","price":0.0,"description":"Soldier of Fortune® Payback is the long-awaited third installment of the Soldier of Fortune video game series. The saga continues with the organization known as the shop where players take on the role of a hired mercenary. Players will experience all the thrills and dangers of authentic mercenary combat blasting their way through high intensity combat situations in the world's most dangerous hotspots in the Middle East, Africa, Asia and Eastern Europe. Using any means necessary, players will need to uncover a complex plot and defeat an extremist organization determined to throw the world into global conflict. Failure is not an option.","imageUrl":"https://media.rawg.io/media/games/02e/02e47e33c8c9bea3390648703b541f9b.jpg","releaseYear":2007,"developer":"Cauldron","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":35737,"name":"The Political Machine","genre":"Strategy","price":0.0,"description":"Do you have what it takes to be president?\nPlay as more than 20 candidates including Barack Obama, Mitt Romney, Rick Santorum, Ron Paul, Newt Gingrich or create your own candidate from scratch.\nPlayers take to the campaign trail against a computer controlled opponent or a human challenger over the Internet. The goal:  win the hearts and minds of America’s voters to achieve victory in the 2012 presidential election.\nThe Political Machine 2012 features updated political topics from across the United States. Issues such as Afghanistan, the economy, Obamacare, income inequality, gay marriage, and the national debt have been integrated into the game’s election database. Regional issues require the candidate to walk a tight rope between appealing to the widest range of voters and appearing to “flip flop.”Key Features:Make your run for the White House as a famous politician or create your own.\nTake a stance on the issues, stretch the truth, or smear your opponents!\nTravel around the United States in your bid to win electoral votes.\nOutwit interviewers and win the favor of voters.","imageUrl":"https://media.rawg.io/media/screenshots/f4a/f4a74abbf7f25f4d4db0983b77e98bf0.jpg","releaseYear":2004,"developer":"Stardock Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":34950,"name":"Age of Mythology: The Titans","genre":"Strategy","price":0.0,"description":"###THE BATTLE FOR HEAVEN AND EARTH CONTINUES...\n\nThe creators of the classics Age of Empires and Age of Mythology bring you The Titans, rulers of Atlantis, and the latest addition to the Age of Mythology saga. Enter a world of mighty armies and fearsome beasts, where powerful Olympians battle ancient foes and the fate of the Atlantean people is in your hands. Only by cunning command will you earn your place at the feet of the gods!\n\n###ATLANTEAN MYTHOLOGY:\nPromote your human soldiers to heroes, reuse god powers, and deploy new mythological units.\n\n###TITAN CAMPAIGN:\nExplore never before seen battlefields and test your wits in an exciting new single player campaign.\n\n###TITAN MIGHT:\nCreate a Titan, tower over all in battle, and lead an unstoppable force - or clash with equally powerful foes.\n\n###GAMEPLAY DEPTH:\nNew victory conditions, maps, units, god powers, and more change the face of every battle you fight.","imageUrl":"https://media.rawg.io/media/screenshots/bd0/bd0d62de0bc907db7d2750b86dd0afda.jpg","releaseYear":2003,"developer":"Ensemble Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29727,"name":"Baldur's Gate II: Throne of Bhaal","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/02b/02b277e0fe92bb4b609b296b7cc12e88.jpg","releaseYear":2001,"developer":"BioWare","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":29126,"name":"Hexic 2","genre":"Puzzle","price":0.0,"description":"Single Player, Xbox LIVE Multiplayer 1-2, Local Multiplayer 1-2, HD (High Definition). Ready to put your hex-busting skills to the test? The game’s not over until you build a full cluster, flower, or line of black pearls! For an extra layer of challenge, match wits with a friend or the devious computer player in Battle mode. There are no refunds for this item. For more information, see www.xbox.com/Live/accounts.","imageUrl":"https://media.rawg.io/media/games/f40/f40ee9126f2f6e4e9f8bb5ea0a502398.jpg","releaseYear":2010,"developer":"Carbonated Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28722,"name":"50 Cent: BotS","genre":"Action","price":0.0,"description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French, German.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   Play as 50 Cent, the world's biggest hip-hop star, in this fast-paced action shooter! You and the G-Unit will battle across two war-torn countries to collect your payday and exact your revenge on those who have crossed you.","imageUrl":"https://media.rawg.io/media/screenshots/5c9/5c93dc1e3eea5e975f915e90165fc63f.jpg","releaseYear":2009,"developer":"Swordfish Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":21163,"name":"Battle Mages: Sign of Darkness","genre":"RPG","price":0.0,"description":"Darkestville Castle Coming Soon\nA new adventure on Steam!We are glad announce a new adventure \"The Treasures of Montezuma 5\"!\nDon't miss your chance to grab It in your Steam library!\nhttp://store.steampowered.com/app/443370\nAbout the Game\nA thousand years had passed since the great battle between the Lord of Chaos and the forces of the Order. Little by little, life returned back to normal.\nThe story begins, when a young neophyte journeys north, to learn from an eccentric wizard, one of the most ancient and powerful Guild’s members. The apprentice doesn’t know yet, that his teacher-to-be is one of the Keepers, and that his destiny is to become a catalyst for the events, that will make Daenmor shudder…\nBattle Mages: Sign of Darkness is an enthralling journey to the world of original game. It offers four new campaigns, covering dramatic events that took place in Daenmor long before the Shadow of Warlock spread over the land. The player will discover the mysteries of the Order of the Keepers, confront treacherous plans of the elves, lead vengeful Orcs to the battle, oppose the creatures of Chaos, and of course the darkness will raise its flag over the green hills of Daenmor under his command.\nFour new campaigns explaining the conflict between the nations\nA number of single-player maps\nA unique hero with specific traits for each campaign\nNew magic abilities – additional Dark Magic school\nNew units, upgrades, and the addition of two new races -  Dwarves and the Undead\nHero leads his troops through the entire campaign\nImproved inventory system, including trade interface, new artifacts and items\nNew tactic possibilities in troop control\nDay and night conditions, weather simulation","imageUrl":"https://media.rawg.io/media/screenshots/f5a/f5a1cb3163b9f2380d90575bcb6c36b0.jpg","releaseYear":2014,"developer":"Targem Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20371,"name":"Alice's Patchwork","genre":"Casual","price":0.0,"description":"Assemble patchwork mosaics while you travel with Alice and the famous characters of Wonderland and Looking-Glass Land!\nА mad tea-party, unbelievable royal croquet, a merry sea quadrille... What other pictures await you in 6 locations? Assemble all mosaics and help Alice become the queen of this incredible world.\n- 120 unique patchwork mosaics.\n- 6 locations.\n- 6 different materials.\n- Plot and characters from Wonderland and Looking-Glass Land\n- Fairy-tale setting.\n- Special quests for the real pros.\n- More than 10 hours of gameplay with beautiful calming music.\n- Entertaining gameplay for players of all ages.\n- Use bonuses and earn new ranks.\n- Complete levels to get as many keys as you can and unlock new worlds!\n- Complete all the puzzles while traveling through the fantasy world of your childhood.","imageUrl":"https://media.rawg.io/media/screenshots/37b/37b924f95b2c0e3b386efc937db794b3.jpg","releaseYear":2016,"developer":"Creobit","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20278,"name":"ALLTYNEX Second","genre":"Action","price":0.0,"description":"The year is 2192AD. 40 years ago, the Stellar-class All-purpose Administrative Computer ALLTYNEX suddenly attempted to enact genocide upon mankind. Commandeering armies of unmanned weapons, ALLTYNEX enacted a massacre so terrible that within only 72 hours of the start of the incident, approximately 85% of the world's population had perished.\nA small number of people narrowly managed to escape beyond the solar system, but their population steadily declined in the face of brutally harsh living conditions. Now, gambling everything, the remaining survivors rally to begin their first and final attempt to reclaim the Earth. Fight your way through the drone armies and Guardian Soldiers to end the Era of A.I. Dominance!\n5 stages of carefully crafted 2.5D vertical scrolling shooting action!\nPowerful Blade melee mechanic: get up close and personal for maximum destruction!\nTarget enemies from afar with Homing Lasers or lance through enemies and bullets alike with the powerful Buster Rifle!\nAdvanced combo system: smart play and switching between melee and fighter modes is rewarded!\nTutorial, Practice and Replay (featuring normal and cinematic views) modes!","imageUrl":"https://media.rawg.io/media/screenshots/804/8040c99ef89fe6482151f63f2d021e0b.jpg","releaseYear":2014,"developer":"SITER SKAIN","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20144,"name":"RPG Maker 2003","genre":"Desconocido","price":0.0,"description":"UNLEASH YOUR PASSION FOR RETRO RPGs\nFor the first time ever, RPG Maker 2003 is officially available in English! This legendary game development engine is both highly affordable and easy to use, and it remains one of the most popular RPG Maker installments to date. It is the first engine in the series to employ a sideview battle system similar to the classic RPGs of the early-to-mid 90s. If you have always wanted to create a retro RPG with a third-person battle system, or simply are looking for an affordable but reliable game creation engine, then RPG Maker 2003 is for you!\nKEY FEATURES\nSide-view Battle System\nMost titles in the RPG Maker series center on first-person, turn-based combat. RPG Maker 2003 breaks this tradition by offering an engaging sideview battle system that is perfect for fans of classic RPGs. Creating and managing your game’s combat is as easy as filling in a database and playtesting, with no scripting knowledge required! This departure makes RPG Maker 2003 an excellent alternative for game developers who are not particularly fond of front-view battle systems.\nStraightforward Tools\nRPG Maker engines are designed to be as flexible as possible while still being user friendly, and RPG Maker 2003 is no exception. Virtually everything in the engine is managed through a simple point-and-click interface. All of your game’s characters, enemies, skills, animations, and equipment are created and stored in an easy-to-navigate database. An in-depth event system contains dozens of functions to help make your story and world come to life, such as custom messages, character movement, player choices, special effects, and more. Plus, RPG Maker 2003’s powerful map editor is extremely easy to master, allowing you to craft your world tile by tile with unprecedented efficiency!\nRetro Presentation\nRelive the golden age of RPGs with RPG Maker 2003’s diverse selection of 16-bit default graphics. If you’re feeling especially creative, RPG Maker 2003 allows you to import custom 16-bit graphics, including character sprites, tilesets for your environments, battle animations, backgrounds, and more! The engine is also loaded with a variety of catchy midi tracks and sound effects for your game; custom MP3/WAV/MIDI tracks can be added as well.\nShare Your Game!\nWant to share your creation with the world? You can export your creation in a portable file that can be played on ANY Windows system! Plus, games made with RPG Maker 2003 can be sold as long as you have the appropriate rights and have followed the registration procedure. With some hard work you could become the next great indie game developer!","imageUrl":"https://media.rawg.io/media/screenshots/299/29939e32625aa95055929b0efce4d2fa.jpg","releaseYear":2015,"developer":"KADOKAWA","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19033,"name":"Spy Fox In: Hold the Mustard","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the Game101 Levels of Tomato Saving Fun!\nClimb aboard to help SPY Fox save the world's ketchup supply from the evil King Konglomerate! Maneuver SPY Fox's M.E.S.S through water, space and air!\nHelp Spy Fox navigate his M.E.S.S. (Multiple Environment SPY ship) to collect tomato's and destroy King Konglomerate's robots.\nChallenging arcade-style games for kids ages 5 to 10 (and children of all ages)\nBrand-new action with all the quality you'd expect from Humongous Entertainment!\nJunior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/2db/2dbfb1efbf69b7d5ed126f03aba421c9.jpg","releaseYear":2014,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18129,"name":"Anykey Simulator","genre":"Simulation","price":0.0,"description":"SoundtrackThis game includes a soundtrack by Artyom ALTWAVE Yushchenko\nAbout the GameAnykey Simulator allows you to feel the hardship of computer designing.\nIn this game you are faced with solving simple puzzles - you have to move available computer module to appointed place in the field of 5x5 squares, in the way that modules won't suffer, preferably all of them, but your aim is to complete the plan. From the start you have three instruments for solving the tasks - for module building, for it's destroying and for it's improving. You will be given more and more modules to charge, each module has its own unique characteristics that must be taken into account before you set the module, because many of them ignite when they contact with dust and others can't stand the dirty.","imageUrl":"https://media.rawg.io/media/screenshots/229/229c8efe21d53f635738141348a0e0e3.jpg","releaseYear":2016,"developer":"RiDeLy","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16637,"name":"Snik","genre":"Casual","price":0.0,"description":"Snik is an extremely hard game that will test your reflexes, timing, aiming and planning ahead in a simple, minimalist interface.\nYou control a dark blue colored ball. Clicking a position in the screen will make the ball travel to that position in a straight line. You need to collect all golden orbs to win.\nYou lose the game by hitting barriers. They come in red, light blue, purple and green flavors.\nBLUE - Standalone, stationary barriers.\nRED - Rotates around a parent barrier in a circular orbit.\nGREEN - Moves along a defined path in a loop.\nBLACK - Stationary, disappears when a certain orb is collected.\nIn some levels, you have orange colored purple orbiting around you. You need to protect them too!","imageUrl":"https://media.rawg.io/media/screenshots/4b8/4b8e5ab5aa9878b032356909fb4b6e64.jpg","releaseYear":2015,"developer":"Cleverweek","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14944,"name":"Tiki Man","genre":"Action","price":0.0,"description":"Harness the legendary powers of the Tiki Man by chopping down the world's tallest tiki. Chop the tiki faces and avoid the hazardous tiki arms. Sounds easy? Think again my friend. 4 luscious tropical environments and 16 Tiki Men to unlock. Master your tiki chopping skills to earn high scores. Take the axe and chop the tiki as fast a you can!\nCheckout our new game KickAss Commandos!\nhttp://store.steampowered.com/app/359140/\nIf you like Tiki Man, also try Miner Mayhem!\nhttp://store.steampowered.com/app/402850/","imageUrl":"https://media.rawg.io/media/screenshots/70b/70b411feaa95c785e1951e811b54e4fc.jpg","releaseYear":2014,"developer":"Anarchy Enterprises","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":14607,"name":"Cornerstone: The Song of Tyrim","genre":"Action","price":0.0,"description":"Action role-playing, puzzle solving, and crafting combine in this sprawling open-world fantasy epic, which invites you to take on a range of sweeping quests, battle unforgettable adversaries, and experience the adventure of a lifetime. An interactive, physics-based world of wonder bursting with colorful characters and exotic islands filled with tricks, traps, and treasures to explore awaits your conquest as you gather fantastical artifacts and equipment which can be crafted into playable vehicles and more.\nIt's been weeks since anyone last saw the Viking men of the village of Borja, and young Tyrim is determined to set forth and find them. Wielding his crafting and combat skills, you’ll set sail on the Mad Goat across the seas to uncover the world of Nygard’s mysteries, collecting fabulous relics, uncovering forbidden secrets and magic, and ultimately challenging an ancient and unstoppable evil as you quest to bring the Vikings home.\nEpic, open-world blend of action RPG, physics-based puzzle-solving, and combat\nComplete crafting system – build your own weapons, armor, and gear\nExplore 8 exotic islands filled with unique enemies, treasures, and adventures\nPlayable vehicles include ships, windsurfers, and more\nDozens of quirky characters to interact and engage with\nSweeping score includes live musicians and sound effects\nFluid and realistic physics bring the action to life","imageUrl":"https://media.rawg.io/media/screenshots/4a7/4a77453b9c5d1bdd16ac33eaab9f9446_jtjy4fX.jpg","releaseYear":2016,"developer":"Overflow","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14480,"name":"Once Upon an All Hallow's Eve","genre":"Simulation","price":0.0,"description":"A FREE OTOME VISUAL NOVEL with more than four different endings...\nAs one final vacation before their second-to-the-last college semester ends, 20-year-old graduating student Cara Lee and her friends decide to go to a rest house up in the mountains.\nHowever, along the way, a minor landslide knocks her unconscious, and when she wakes up, she finds herself alone in a dark and scary forest.\nLooking for shelter, she finds a strange and haunted-looking mansion looming up ahead. Is there really more to the mansion that it seems, or will Cara Lee uncover something sinister about the house and its inhabitants?","imageUrl":"https://media.rawg.io/media/screenshots/183/1836f6f364c165cba3f3ef66dfeb1ca0.jpg","releaseYear":2017,"developer":"Ran","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]