[{"id":323125,"name":"Still There","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbf/cbff63e84d1911eb7f5960239a285d7c.jpg","description":"Job Opportunity: Brane CO is looking for a dedicated keeper of the Bento Space Lighthouse, located in the mostly uncharted sector D42-W81.\nActivities include but are not limited to:Operational checks\nGeneral maintenance, fixing eventual malfunctions\nPeriodical radio beacon transmissions\nCollection of data from outer space\nLooking after the station's tuatara\nRadio/navigational assistance to nearby spaceships\nExperimental drug trials (it's all good, trust us)\nGeneral requirements:\nGood dexterity in order to use the necessary tools and operate the equipment\nWillingness to live in isolation for very long periods\nAbility to work under pressure\nSome degree of patience mandatory to deal with the ship's advanced AI (Gorky is obnoxious and a loudmouth but he means well)\nCandidates without children/spouses preferred\nAppointment type: One year, renewable every year\nWork schedule: Full-time\nLocation: Deep space, sector D42-W81\nSalary: Yes\nNO TELEWORK","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GhostShark","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13773,"name":"Mitos.is: The Game","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4b/b4b28b21076e2b6fbfb5f99f6c164ed7.jpg","description":"Eat cells or die trying!\nWarning: Incredibly addicting Multiplayer Game !\n** LAG: If you experience high latency, please open the Settings Menu and change your server location **\nYou are a cell, wandering around looking for smaller cells to absorb and grow. Larger cells, likewise, are seeking for smaller cells like you to absorb. Smaller cells move fast, larger cells are very slow! You can split yourself to increase your speed but this will increase the risk of being eaten. Finally, beware of the viruses!\nMitosis allows you to:\n- Four Game Modes: Free to Play, Random Team, Capture The Flag and Guilds War\n- Guild system with chatroom\n- Equipment system\n- Custom skins\n- Eat smaller cells to gain mass and become larger\n- Avoid larger cells because they can absorb you\n- Separate yourself into 2 cells to gain speed\n- Use viruses to hide yourself or hit others\n- Expel mass to decrease in size\n- Have a lot of fun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Freakinware Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5540,"name":"Devil May Cry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c98/c980484ebd10882788fc5e8fbabefbef.jpg","description":"Debuting in 2001, Devil May Cry® is the game that redefined the action genre with its stylish combo system and over-the-top, non-stop action. Wielding twin handguns and a demonic blade, the iconic white-haired devil hunter Dante slashes through legions of monstrous minions in a battle to save humanity from utter damnation.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 4"}]},{"id":591,"name":"Monument Valley","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/158/158e3d88feea5b59bd8c48205a37e341.jpg","description":"** Apple Game of the Year 2014 **\n** Winner of Apple Design Award 2014 **\nIn Monument Valley you will manipulate impossible architecture and guide a silent princess through a stunningly beautiful world.\nMonument Valley is a surreal exploration through fantastical architecture and impossible geometry. Guide the silent princess Ida through mysterious monuments, uncovering hidden paths, unfolding optical illusions and outsmarting the enigmatic Crow People.\nIda's Dream now available.\nForgotten Shores: Eight new chapters of adventure and illusion available now as a separate purchase.\nBuy or download Monument Valley now and you’ll also get our fully animated iMessage sticker pack, including 5 stickers exclusive to players! Only available on iOS10 and above.\n=======\n\"This might be the most beautiful iPad game of 2014\"  - Wired\n\"Brilliant design... stayed with me like a dream I didn't want to forget\"  9/10 - Polygon\n\"The most sublime hour my iPad has ever given me... and the value of such a thing is incalculable\" - Kotaku\n\"Monument Valley stuns with its serenity... each screen is a work of art\" - Huffington Post\n\"Almost impossibly gorgeous... a feast for your senses\" 5/5 - Touch Arcade\n=======\nBEAUTIFUL\nInspired by minimalist 3D design, optical illusions and palaces and temples from around the world, every monument is a unique, hand-crafted world to explore.\nEASY TO USE\nTwist and drag to reshape the world and help Ida to explore. Designed to be easy for everyone to pick up, enjoy and complete.\nSOUND\nAudio reacts to your manipulation of the world to provide a surreal and beautiful soundscape. Best experienced with headphones.\niCloud\nSynchronize your game across all your devices.\n** Monument Valley is designed for iPhone 4 and above. It is NOT compatible with iPod Touch 4th Generation.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"ustwo games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":28510,"name":"Duke Nukem 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e2/4e2270713ba0d59ea1dba61158ff842e.jpg","description":"Xbox LIVE Multiplayer 2-8, HD (High Definition). Unlock the full version for 39 levels of mayhem!  Wreak havoc on your foes with weapons like Pipe Bombs, Shrink Ray, and Freezer.  Impress your friends on the leaderboards, earn achievements, and take advantage of the painless death system – rewind 10 seconds or 10 minutes, the choice is up to you.  All new User Clip recording, sharing and uploading have been added and best of all - online multiplayer with cooperative and DukeMatch for up to 8 players through Xbox LIVE!  What are you waiting for? This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Gearbox Software","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":29826,"name":"Indiana Jones and the Fate of Atlantis: The Graphic Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cce/cce8bebe861f295003f5a9fe5b11233f.jpg","description":"The Man With The Hat Is Back In His Greatest Adventure Yet!\n1939 - The eve of World War II. Nazi agents are about to get their hands on a weapon more dangerous than the atom bomb. Only Indy can stop them before they unleash the deadly secret that sank Atlantis.\nPoint 'n’ click your way through fistfights, puzzles, balloon rides, car chases and Indy one-liners.\nExplore over 200 spectacular locations.\nHear LucasArts' exclusive iMUSE create a musical score that follows your every move.\nPlay and replay - three unique challenging paths to vanquish the Reich.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20282,"name":"Soul Gambler","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba6/ba6b1e6e52e4cad6a59b6a9193853db7.jpg","description":"Special EditionSoul Gambler: Dark Arts Edition includes:\nArtbook (76 pages) featuring making of, character creation, scenarios and unreleased illustrations;\nOriginal Soundtrack on the MP3 Format.\nAbout the GameSOUL GAMBLER is an interactive graphic novel inspired by Goethe’s Faust, a tragic play written in the 19th century. This is a contemporary and engaging adaptation of the masterpiece.\nSoul Gambler puts YOU in the role of Faust, an ordinary young man living in the present day whose DESTINY is about to be change forever.\nWhen Faust was leaving his boring job, a mysterious woman approached him. She made him a tempting proposal: SELL parts of his SOUL in exchange for the fulfillment of his every WISH.\nNOW it is up to you to decide his fate!\nBECOME Faust and transform yourself in a Soul Gambler\nCHOOSE how the story unfolds, and even how it ends\nAMAZE yourself with gorgeous comic book-styled illustrations and environments\nOWN the ability to sell parts of your soul in exchange for many pleasures\nIMMERSE yourself in this shady world while listening to an involving soundtrack\nCOMPLETE more than 20 challenging story-oriented Steam Achievements\nFaust's FATE lies in your hands.\nWhat are you waiting for? Time to GAMBLE your soul!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Tlön Studios","platforms":[{"id":0,"name":"PC"}]},{"id":379453,"name":"The Walking Dead: Saints & Sinners","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/645/645a25441b6559e2850cc5731dbde551.jpg","description":"LIVE The Walking DeadSaints & Sinners is a game unlike any other in The Walking Dead universe. Every challenge you face and decision you make is driven by YOU. Fight the undead, scavenge through the flooded ruins of New Orleans, and face gut-wrenching choices for you and the other survivors. Live The Walking Dead's dark drama in your own skin.​Survive YOUR WayA new way to live survival horror. With the living, dead, disease and famine as constant threats, you have countless ways to tackle these dangers.\nFace the undead guns blazing or learn all the ways to sneak and hide among them. Take on missions from different factions and survivors to earn valuable resources. Risk life and limb to protect those in need or brutally murder anyone who stands in your way. See how your choices affect the people of New Orleans, and learn to live with the consequences. A New, Brutal StoryNew Orleans is at war. The living are not just fighting the dead, but also inflicting pain and brutality upon each other. As bodies pile up between warring factions, whispers spread of a long-lost mystery in the city that could turn the tide of the war. Will you try to court favor with the factions, or play them against each other for personal gain? Can you unravel the mystery that is behind it all? The fate of the city and its survivors rests in your hands.​A Vast World To Explore in VRCrafting, exploration, freedom of choice and visceral combat make this a deep, 15+ hour game built for VR.\nCut down both the dead and the living with an arsenal of melee, ranged and makeshift weapons, all physics-based objects you can realistically wield. Knock walker heads clear off and rip out weapons impaled in their skulls. Creep through ruined streets and creole mansions to scavenge for supplies and secrets. Scale the sides of buildings, cars, and walls to ambush enemies from above or make a quick escape.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Skydance Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":3340,"name":"Ultratron","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/493/493ba0453a13d2a7d0048725849651e7.jpg","description":"Ultratron is a 2D top-down twin-stick shooter set in the fictional universe and inspired by Robotron: 2084 — an arcade video game about robots.\n\n###Gameplay\nThe player controls a robot and explores the locations as he pleases — there is no forcing to go further or backward. Traditionally, the left stick accounts for aiming and the right sticks sets the direction of fire. Not only the robot can utilize the firearms, but the explosives alongside with other throwables are available. The customization takes place between the levels — upgrades may be found on the battlefield and present themselves as score points which may develop one of the robot's characteristics: shields, smart bombs, droid power or so.\nThere are forty levels in total, with every fifth being the assault one — the foes are more aggressive and unwelcoming there, and every tenth is a boss level. The goal of every level is to eliminate all the enemies and get to the end of the location. The title sometimes features the bullet hell elements — there are so many enemies on-screen, they start forming a distinct pattern recognizable as a picture.\n\n###Plot\nThe setting is near post-apocalyptic future, where the brains were taken out of the humans and implanted into the war robots, who fight their way to the humans left to defend them from their dreadful fate.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":5603,"name":"NARUTO: Ultimate Ninja Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89c/89cbbdff281fac41adf04987f4c8a3f2.jpg","description":"NARUTO: Ultimate Ninja STORM allows players to battle in full 3D across massive environments. Players will unleash powerful jutsu attacks, perform acrobatic evasive maneuvers and even run up walls and over water as they pursue their opponent for ninja supremacy. Players will be able to customize their character's fighting style and recruit up to two support characters to put their own stamp on the action. NARUTO: Ultimate Ninja STORM has been remastered in HD.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":995,"name":"80 Days","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27b/27b3a098c6756a80842501fedf61ddc8.jpg","description":"1872, with a steampunk twist. Phileas Fogg has wagered he can circumnavigate the world in just eighty days.\nTIME Magazine's Game of 2014 and winner of the IGF award for narrative; now available on Steam! Choose your own route around a 3D globe, travelling by airship, submarine, mechanical camel, steam-train and more, racing other players and a clock that never stops.\n170 cities to explore. Detailed research and techno-fantasy combine in an 1872 of tensions, inventions and exploration. Climb the Burmese mountains, trek the Zulu Federation, sail up the Amazon and disappear under the Indian Ocean - but don't fall behind the time!\nFour times BAFTA-nominated and TIME's #1 Game of the Year 2014\nWinner IGF \"Excellence in Narrative\" award\n\"We’ve been dreaming about this future for decades. Guess what? It’s here.\" - New York Times\n9/10 -- Edge Magazine\n\"Interactive storytelling as its best\" - The Guardian\nPlaying as Phileas Fogg's loyal valet, Passepartout, you must balance your master's health, your finances, and the time, as you choose your own path from city to city all the way around the world. Bribe your way onto early departures, but don't let yourself go bankrupt or you'll be sleeping rough and begging for aid! Trade items for profit, and collect the equipment for the conditions you'll face: but too much luggage will slow you down...\n80 DAYS is a breakneck race, with an in-game clock that never stops running. Trains, steamers, hot-air balloons, boats, camels, horses and more leave and arrive minute by minute.\nEvery city and journey is narrated via an interactive story where you control every action. Will your choices speed you up - or lead you into disaster? Will you earn Fogg's trust and respect? Will you uncover the secrets and short-cuts that can shave days off your time? Murder, romance, rebellion and intrigue await!The Game:Plan and strategise - can you find the fastest route?\nFlexible interactive narrative with thousands of choices\nMassively replayable - every journey is unique\nExplore an entire 3D globe, with 170 bespoke cities to visit\nRichly imagined, diverse alternative-history steampunk world\nStunning art by Jaume Illustration\nRace real people in real-time: every second counts\nLive multiplayer feed, showing journeys of other players as they happen\nShare your journey with friends","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"inkle","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":968329,"name":"Lethal Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2fa/2faa93b7882a018ac21a1f9cc5176579.jpg","description":"You are a contracted worker for the Company. Your job is to collect scrap from abandoned, industrialized moons to meet the Company's profit quota. You can use the cash you earn to travel to new moons with higher risks and rewards--or you can buy fancy suits and decorations for your ship. Experience nature, scanning any creature you find to add them to your bestiary. Explore the wondrous outdoors and rummage through their derelict, steel and concrete underbellies. Just never miss the quota.\nThese dangers prey upon the vulnerable and lonesome, and the protection of your crew may be your only hope. You can guide your crewmates from your ship, using the radar to call out traps and using the ship's terminal to access remotely locked doors--or you can all go in together. The Company store has many useful tools for the job, including lights, shovels, walkie talkies, stun grenades, or boomboxes.\nThings get dangerous at night. Communicate with your crewmates to carry all valuables to the ship before things get too dangerous, and try not to leave anyone behind.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Zeekerss","platforms":[{"id":0,"name":"PC"}]},{"id":47466,"name":"ELDERBORN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74c/74c39a481cb165b17ed17fadf90b82a7.jpg","description":"ELDERBORN is a First Person Slasher focused on melee combat exclusively. Each enemy whether human or not, has its own behaviour patterns which will require players to adapt to their fighting technique. The levels are created not only horizontally but vertically, so the player will be able to solve every skirmish in a variety of ways. Beware, the enemies aren't the only dangers of this world: deadly traps and chasms await for those not paying attention.\n- Skill Based First Person Melee Combat\nLearn the behaviour of your enemies and slay them with instant weapon swap combos. Remember, melee only, no shooting! Oh, and watch out: everyone dies quickly, and so do you!\n- Environmental Story Telling\nLearn the story through your surroundings however you see fit: no taking control from the player, no forced storytelling.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hyperstrange","platforms":[{"id":0,"name":"PC"}]},{"id":11799,"name":"Audiosurf 2","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/216/21604ad1b0ad028ace5bee1c14e7ee12.jpg","description":"By blending gameplay with music visualization, Audiosurf puts you inside your music in a way nothing else can. Use your own music to create your own experience. The shape, the speed, and the mood of each ride is determined by the song you choose.\nWhat are the biggest improvements from Audiosurf 1?\nEver-expanding new ways to play with over 500 and counting player-created mods and skins on Workshop.. Additional layers of strategy tied to the song’s biggest moments. In-game leaderboards let you compare your score moment to moment against your friends and rivals even when they’re not online. Enhanced graphics quality. Ability to search for music (including online music). Available on Mac and Linux!\nWhat’s new about Mono mode in Audiosurf 2?\nIn Audiosurf 2 your timing in mono mode is more important than ever. You’ve got to strategize to get your grid full at the most intense moments of songs to get the most points. Look ahead in the distance for corkscrew loops with powerups to know when these moments will occur.\nWhat do I get in the demo?\nThe demo allows players to play any song they want, for their first 3 songs. After that, they can play the Song of the Day, everyday, as many times as they want.\nIs there a mode that focuses on dodging blocks?\nYes, there's a new Ninja mode. It has a big bonus for hitting no spikes and creates intense spike fields to weave through. It’s faster than regular Mono and the second-to-second challenge of avoiding spikes is harder. For even more challenge there’s ninja turbo. It’s too fast for you.\nWhat’s new about the Puzzle modes in Audiosurf 2:\nJust as with Mono mode, your timing on Puzzle modes is now more important than ever. Push, Shuffle, Erase, or Scoop blocks at the just the right moments to take full advantage of multiplier powerups that come at the most intense moments of songs.\nCan players make their own mods and skins to share on Steam Workshop?\nYes! There’s detailed documentation on making Audiosurf 2 skins available here: http://steamcommunity.com/sharedfiles/filedetails/?id=413812198\nAlso, every mode and skin in the games comes with the script source code and assets. Players can use any of the official modes/skins as a starting place.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dylan Fitterer","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10166,"name":"Depth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41c/41cb09356a97110b6b7d79f0abcb7699.jpg","description":"Play as a shark or a diver in a dark aquatic world and overcome your enemies by employing cunning, teamwork, and stealth. Depth blends tension and visceral action as you team up against AI or be matched with other players in heart pounding combat.Key features\nPlay as a shark\nAs any one of 7 shark species, speed and senses are your greatest weapons. Stalk your prey from across the ocean and tear them in half with your razor sharp teeth. Be a Great White, Tiger, Mako, Bull , Hammerhead, Thresher ...... or even the legendary Megalodon!\nPlay as a diver\nAs a human diver you must explore the abyss in search of treasure to upgrade your arsenal. Defend yourself with a range of high powered gear, from spearguns and pistols to underwater assault rifles and explosive sea mines.\nHeart pounding atmosphere\nExperience the dread that comes from swimming in the darkness of the ocean. Dynamic lighting and shadows create a unique and gut-wrenching atmosphere that will have you on edge from the moment you dive in.\nEvolve your play style\nUnlock exotic new weapons for your diver, or 'evolutions' for your shark that open up new tactical possibilities as you play the game. Persistent stat tracking and meaningful steam achievements will also give you something to shoot for (in some cases, quite literally!)\nPractice offline with AI bots\nNot feeling quite ready to plunge into online play? Depth allows you to hone your skills against some alarmingly clever AI enemies who can be configured in several modes of difficulty.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Confectioners","platforms":[{"id":0,"name":"PC"}]},{"id":9860,"name":"Anarchy Arcade","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb1/cb1e3651a3b0034f16868d366ba4f981.jpg","description":"Anarcy Arcade is a shortcut launcher, just like your regular desktop. It replaces your 2D wallpaper image with a 3D world, and replaces your 2D shortcut icons with 3D objects.\nIt transforms our PCs into 3D metaverses that we can explore with our friends while still getting work done.  Performance is always put first.  It will not lag your games down.\nUse AArcade as your everyday desktop, or use it to manage your massive game, movie, or image collection and share with your friends.Menu-less BrowsingAArcade is a \"game between games\" where you walk up to what you want and click LAUNCH.  No more down-time between games!CustomizeEasily spawn in new shortcuts or props, modify their properties, and build your dream arcade!Full Version Games & AppsAArcade launches ANYTHING that you can run on your PC and runs them at full quality & speed.  You'll NEVER have to choose between AArcade or running your games well.Addons & ModdingUse the maps & models from over 30 of your favorite Source engine games as your 3D desktops!  Over 50,000 compatible maps and many thousands of compatible props!Steam WorkshopShare your customizations or your creations with the rest of the community with AArcade's BUILT-IN workshop publishing tool!  Well over 1,000 items already shared!ExploreDiscover how deep each rabbit hole goes when exploring the massive creations of other players, past & present.MultiplayerHost any one of your 3D desktops in multiplayer mode.  Watch videos with your friends, give tours of your collection, or just hang out on your desktop! (Note that port 27015 must be open to host a public server.)Virtual Reality (OPTIONAL)Truly experience the metaverse in 3D using your Oculus Rift, HTC Vive, or other VR devices.  The tidal wave of the future is about to hit!Be ProductiveAArcade lets you use your Start menu, alt+tab, use your favorite programs, etc.  The things you launch open right on top of AArcade, just as if it was your desktop wallpaper image.Sleep ModeWhen it needs to, AArcade goes into a deep sleep mode where it releases all of its textures, 3D models, etc. so that your PC is free to run what matters most: the stuff you launch.Steam Stats & AchievementsCompare the size & stats of your collections with your friends.  Earn achievements for reaching milestones, and for ever leave your mark on a map by being the 1st person to load it up in AArcade!Free & IndieAArcade is 100% free and developed by just 1 guy.  It does NOT have built-in ads and is not a corporate attempt to sell you junk.  It is made specifically to enhance your PC experience.FeaturesSupports the Oculus Rift for a virtual reality experience!Works with Steam games, non-Steam games, movies, YouTube videos, pictures, websites, etc.Launches your files & programs. just like normal!Instantly ALT+Tab to switch between programs.Goes into sleep mode while you play other games. (Doesn't lag you down!)Emulators are supported! (But not included.)Automatically finds YouTube trailers and HD boxart to use on 3D shortcuts.Does not interfere with Windows or your normal computer use.Anarchy Arcade does NOT come bundled with any additional games or movies.  It simply is a fun & entertaining way to access your personal media collection and share the experience with your friends.Merging Reality with Virtual RealityAnarchy Arcade lets you spawn real-life games, movies, pictures, and other media (directly from your PC or the internet) into the virtual world.  In the screenshots here on the Steam Store page, we have labeled these real-life media items with a [CENSORED] sticker so you can easily see them.  Just imagine your favorite stuff under those stickers.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Elijah Newman-Gomez","platforms":[{"id":0,"name":"PC"}]},{"id":8098,"name":"Forza Motorsport 6","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bd4/bd4ab8c94e52fb6d2da185ecca8f6c45.jpg","description":"Forza Motorsport 6 is unrelenting action at speed in the most beautiful and comprehensive racing game of this generation. Collect, customize, and race over 450 Forzavista™ cars, all with working cockpits and full damage. Compete in epic 24-player races across 26 world-famous locales. Master wet weather and night racing on your road to victory.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Turn 10 Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":471029,"name":"Warhammer 40,000: Darktide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/63e/63ee51f2fc8c78ff3a4fa8f60d5898b4.jpg","description":"Fight together with your friends against hordes of enemies in this new Warhammer 40,000 experience. From the developers of the best-selling and award-winning co-op action franchise Vermintide, Warhammer 40,000: Darktide is a visceral 4-player co-op action game set in the hive city of Tertium.\r\n\r\nIn the depths of the hive, the seeds of corruption threaten an overwhelming tide of darkness. A heretical cult known as the Admonition seeks to seize control of the planet Atoma Prime and lay waste to its inhabitants. It is up to you and your allies in the Inquisition to root out the enemy before the city succumbs to Chaos.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":58769,"name":"Conqueror's Blade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/535/5357813a2ea1eb7c891b2b38e087e84d.jpg","description":"In the medieval siege battles where over 1000 soldiers are slaying each other, you can chop and slice your enemies as a fearsome warlord in the battlefield, while commanding your armies to charge, shoot, defense, or other tactical options—order English longbowmen to unleash piercing arrows upon opponent’s troops in the long distance; lead a squad of Polish hussars to charge towards enemies’ commander from high ground; devastate fortifications with powerful siege weapons like French culverins and battering rams. In this epic battlefield, two teams of 15 players will be fighting each other until victory is achieved.\nIn Conqueror’s Blade, glorious medieval soldiers like Hungarian cataphract lancers, Swiss Halberdiers, and Gaul Crossbowmen are now all under your command. As a warlord, you can choose from 10 diverse weapons, including Shortsword & Shield striking the balance between offence and defense, Nodachi that slashes through a dozen of enemies with just one sweep, and Dual Blades, the ideal weapon for short range combats. Choose your weapons, amour, and units wisely, and enjoy the unique experience of every battle.\nAs a vast open world that is designed based on Eurasia, the map of Conqueror’s Blade contains castles in European style, city-states in desert, and great city walls from ancient China… Apart from villages and cites, you can also take over the rich natural resources like grain, horses, and minerals in the map to build an even mightier army. Everything in the map is for you to conquer, and joining a House to form a strategic alliance with trustworthy partners can make you stronger. Join us in this war-ridden continent, conquer your enemies’ territories, demonstrate your unrivaled power, and write your own history as the sole ruler.\nPlease note:\nTo help us improve the quality of our services, we may collect your client logs or crash dump files as necessary.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Booming Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":19610,"name":"Kraven Manor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8e/c8e626cde1d7fea7fc435750ec7975a8.jpg","description":"The Journey of a Student GameBeginning as students, our team quickly realized that the Let's Play horror community was taking great interest in Kraven Manor. We decided to venture out, create Demon Wagon Studios, and self-publish so that we may share our game with the world. Thanks for letting us scare you for two wonderful years!\nThe Kraven Manor beta has been enjoyed by hundreds of thousands of gamers worldwide\nKraven Manor has inspired tens of thousands of Let’s Play videos\nBest Gameplay Award, 2014 GDC Intel University Games Showcase\nBest Visual Quality Award, 2014 GDC Intel University Games Showcase\nReviews“Brilliant concoction of white-knuckled tension, puzzles and exploration.” - Bloody-Disgusting\n“Shouldn't be looked over.” - Game Informer\n“A work of distinction.” - Rock, Paper, Shotgun\n“Horrifyingly awesome.” - Alienware\n“You must play this game.” - Gamespot House of Horrors\n\"Best horror game ever.” - Markiplier\nAbout the Game\nTurn out the lights, take a deep breath, and prepare yourself. Explore the depths of the immersive, atmospheric world of Kraven Manor. Uncover its secrets, solve its mystical puzzles, and face the growing threat within.\nKraven Manor challenges you to explore an expansive manor and discover the mysteries that lurk in its dark corners. You have the power to dynamically alter the layout of your environment by interacting with a miniature scale model of the manor, located in its extravagant entryway.\nDynamically build the manor around you. Find miniature room models and carry them back to an increasingly elaborate scale model of the manor. Adjusting the model causes rooms to move and appear in real space, awaiting your arrival.\nEach new room exposes revelations into the troubling past of William Kraven. Face your fears and see if you have what it takes...the doors of Kraven Manor await you.\nFeaturesExperience a hauntingly beautiful first person atmosphere\nHear chilling symphonies and bumps in the night that will have you looking over your shoulder\nBecome the architect of Kraven Manor by constructing a scale model of the house\nPrepare for tension, puzzles, and a mounting threat that avoids the cheap scare\nBeware a unique antagonist that pursues you relentlessly to the final moments\nFind collectible secrets hidden within the Manor and obtain a very special ending\nPlay Nightmare Mode for a scarier challenge and a battery for your flashlight\nEnjoy robust graphical settings and custom key binding options\nFace your fears in 14 Languages","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Demon Wagon Studios","platforms":[{"id":0,"name":"PC"}]},{"id":11778,"name":"Holy Potatoes! A Weapon Shop?!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82c/82c01d6caf4f4ca200a511070ac20507.jpg","description":"Holy Potatoes! A Weapon Shop?! is a wacky simulation game where you manage your very own weapon shop and expand its business across an incredible potato world.\nUse your potato smiths to forge weapons and sell them to questing heroes. You will meet more than 70 potato heroes, forge more than 200 weapons, expand your business into 20 wacky areas, manage 30 zany potato smiths, discover 10 legendary pop culture heroes . . . and even adopt a potato dog!\nInspired by games such as Game Dev Story, Weapon Shop De Omasse and Recettear: An Item Shop's Tale, Holy Potatoes! A Weapon Shop?! is designed to provide an exciting new gameplay experience to fans of this emerging game genre.\nThe game score is composed by the legendary Kimura Masahiko​, who worked on the original score for the Genso Suikoden Series and the Castlevania Series.Features: Research and forge hundreds of weapons\nManage and train 30 potato smiths\nSell weapons to questing heroes and build customer loyalty to learn more about these adorable potato people\nEncounter random events and weather conditions\nExplore the potato world for materials, relics and enchantments\nCustomize and enhance workshop equipment\nForge unique weapons for legendary pop culture heroes","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rising Star Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":8813,"name":"Commando Jack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e07/e07924ded75d710f406d0c4447af3c62.jpeg","description":"Commando Jack is an action-strategy game initially released for mobile devices and later ported for Windows via Steam.  \n \n###Gameplay \nIn Commando Jack you play as a self-titled character on his mission to protect the Earth from alien invaders. The core gameplay is a tower-defense.\nYou have to fight waves of enemies strategically placing turret-like towers. There are several types of towers with different properties. Some of them have splash damage or can slow down enemies, while others deal more damage to certain types of aliens. You can upgrade towers increasing their damage.\nAdditionally, each tower has two elemental variations: fire and ice. You gain money by killing enemies and spend them to upgrade towers, get power-ups, or building points which are necessary to build new towers. The chief gameplay mechanic of Commando Jack is that you can manually control any tower from the first-person perspective and shoot aliens by yourself. This help is killing enemies faster, and some alien can only be defeated this way. Aside from the 45 missions’ campaign, the game offers the Elemental Mode in which you have to defeat fire and ice enemies with different element towers. The mobile version of the game is free-to-play and includes microtransactions, while the PC version has a price and uses only in-game currency.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Colossal Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":670703,"name":"Forgive Me Father","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c7b/c7b853c1a0ffd4f5ea24a263fe895855.jpg","description":"As the only one with full senses, you begin a journey in search for answers and relief in this FPS game that is created in a distinctive retro comic horror style straight from Lovecraft's books.\nBe aware of your madness level which dynamically changes during the gameplay and gives you additional power. Use your active skills which you choose depending on your play style to fight against the internal evil.\nExplore this Lovecraft-inspired world that is full of side areas and secret places, and uncover the entire story to solve the mystery of this crazy place.\nFeeling of classic FPS from the 90s\nTimelapse animations, opponents and elements of 2D in a 3D environment; first aid kits and life points, non-reloading weapons, powerups during dynamic combat with numerous opponents.\nCustom combat experience\nWith scripture in one hand, weapons powered by an unknown substance in the other, the player will face the challenge of maintaining humanity. The evolution of equipment and unpredictable opponents as well as the way to defeat them will be up to the player.\nDynamic level of madness\nInfluencing directly the audio-visual experience and the gameplay itself, which increases depending on its size.\nThe gameplay is represented by a comic book style\nHand-drawn graphics where design is maintained in a distinctive comic book style, where any screenshot from the game can be a part of the new comic book.\nMood straight from Lovecraft's dark novels\nAll of it is kept in a horror mood where truth mixes with madness, and a sense of hopelessness confuses the need to find the answer. Occultism and eternal evil.\nMany climatic levels and varied bestiary\nA diverse world entirely made by hand, full of interesting enemies from possessed inhabitants to monsters from your worst nightmares.\nTwo heroes to choose from\nEach with their own unique development tree. Experience the story from the perspective of a priest or a journalist.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Byte Barrel","platforms":[{"id":0,"name":"PC"}]},{"id":13468,"name":"Total War: ATTILA","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d8/2d864084a72d9e348e8f5663d8f58ac6.jpg","description":"Against a darkening background of famine, disease and war, a new power is rising in the great steppes of the East. With a million horsemen at his back, the ultimate warrior king approaches, and his sights are set on Rome…\nThe next instalment in the multi award-winning PC series that combines turn-based strategy with real-time tactics, Total War: ATTILA casts players back to 395 AD. A time of apocalyptic turmoil at the very dawn of the Dark Ages.\nHow far will you go to survive? Will you sweep oppression from the world and carve out a barbarian or Eastern kingdom of your own? Or will you brace against the coming storm as the last remnants of the Roman Empire, in the ultimate survival-strategy challenge?\nThe Scourge of God is coming. Your world will burn.\nApocalyptic destruction mechanics\nWield the ferocious power of fire in battle to set buildings ablaze and terrify defenders, or wipe entire cities and regions from the face of the campaign map with the new raze mechanic.\nLegendary start position\nPlaying as the Western Roman Empire you will begin with vast territories under your control, but weakened by political in-fighting and threatened on all sides by enemies, your dominance will quickly become a struggle to survive.\nOverhauled game mechanics\nImproved core gameplay and UI through the latest optimised and modified Total War game mechanics, including politics, family tree, civic management and technological progression.\nIncredible period detail\nWith new period-specific technologies, arms and armaments, religion, cultures and social upheaval, Total War: ATTILA delivers an authentic experience of this ominous chapter of our history.\nOutstanding visual fidelity\nImprovements and optimisations to both campaign and battle visuals create a chilling vision of a looming apocalypse and the ruin of the civilized world. With breath-taking scale, atmosphere and improved graphical performance, witness the end of days and the rise of a legend.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Creative Assembly","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4582,"name":"Eufloria","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/354/35415d87481388c8632a299ce2a97bbf.jpeg","description":"In Eufloria, the player controls trees that grow in the outer space. It was inspired by a scientific theory put forward by the famous astronomer Freeman Dyson and was initially called Dyson in his honor. \n\n###Premise\nThe player oversees the breeding of a plant, called Dyson tree, that can grow on comets and asteroids in the vacuum of space. The tree produces seedling that can be used to spread the species to many planetoids. According to the game's backstory, the trees try to make the planets habitable for an ancient extraterrestrial race called Growers who created the trees. They have to fight against a rival species, the greys, who are the evil, mutated version of Dyson trees.\n\n###Gameplay\nThe game is divided into levels. At the beginning of each level, the trees already inhabit an asteroid. The goal is to spread the trees to other asteroids. The seedlings are the units the player directly controls. They can be used to defend the trees from the enemy seedlings. They can explore the space to find new planetoids. It takes ten seedlings to start growing a tree on a planetoid. Larger asteroids take more time to grow a tree on. However, they eventually reward the player with better seedlings that move faster and have a wider range.\n\n###Style\nEufloria is very minimalist in its visuals. All of its elements are composed of simple geometric shapes. The game is set to equally minimalistic ambient music.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Omni Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"}]},{"id":23069,"name":"Warhammer 40,000: Rites of War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8e/a8e7e729420e8b40abf04f7a93ff0e0b.jpg","description":"Inspired by the board and figurine games made popular by Games Workshop, the universe of Warhammer 40,000 is a vast and violent one, rife with strange, alien races, including the Eldar®. The mysterious Eldar are all that remains of a once great and powerful civilization that ruled the galaxy. They travel the stars in enormous spacecraft called Craftworlds, seeking the Maiden Worlds their ancestors created in ancient times.\nOne such world is now inhabited by humans and possesses historical records and artifacts of great power far too valuable to leave in their hands. This once proud race now fights for its very survival, and must protect the secrets and power of their ancestors from both the Imperium of Man and the evil, bio-engineered Tyranids, bent on the destruction of this fertile paradise.\nRites of War features a tightly crafted storyline composed of 24 missions and varied victory conditions as you lead the Eldar in their fight for survival. Additional scenarios allow for control of Tyrannid and Imperial armies and a glory point system lets you build and customize your own army, with 8 distinct troop classes ranging from War Machines to Assault Troops to Devastator Squads. A level-based experience system enhances the game's RPG (Role-Playing Game) element, allowing you to upgrade and customize units, enhance warrior skills and employ \"psyker\" (psychic) abilities. 24 mission campaign features a tightly crafted storyline, detailed atmosphere and varied victory conditions.\nAdditional scenarios let you command Tyrannid and Imperial armies\nGlory point system lets you build and customise armies, with your choice of unit types, wargear and warrior skills","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"DreamForge Intertainment","platforms":[{"id":0,"name":"PC"}]},{"id":2284,"name":"The Technomancer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09f/09feb25e1eb499ea90c2a48aae7dce4d.jpg","description":"The Technomancer is a sci-fi RPG set on Mars, featuring dynamic combat and an epic story line, where your choices will affect the fate of the Red Planet. You are a Technomancer, a formidable warrior harnessing destructive electrical powers. Embark on a perilous journey across a planet torn apart by conflict and infested with mutant creatures.\nTravel with your companions, choosing between diplomacy, combat or trickery to resolve quests. Gain experience to level up your character, and learn new skills or upgrade perks across 4 unique skill trees. Loot, buy and craft more powerful equipment and weaponry for yourself and teammates, to stand a chance of surviving!\nOnly you can forge the destiny of Mars.\nAn adventure set on the terraformed deserts of a post-apocalyptic Red Planet\nThree combat styles with deep character customization\nUnleash powerful Technomancy abilities on your foes\nIn-depth crafting changes the appearance and stats of weapons and armour\nA world that reacts to your decisions\nRelationships with your companions open new pathways and quests","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Spiders","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":275703,"name":"Darksburg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e7/4e7c3ad3f2263c63044ad79bc6f26e30.jpg","description":"Darksburg is a cooperative roguelite action game where you must team up to escape the hordes of Infected that have decided to settle down in the quaint little town of Darksburg.\n\nAssume the role of one of the heroic Survivors each with their own unique skills and personalities, power them up with the numerous perks and skills you will come across throughout your runs and defeat the nefarious revenants and legion of undead that have come to plague this formerly peaceful city.\n\n⯀ Master the arts of cooperative gameplay to survive the relentless hordes of Infected that are terrorising the town of Darksburg.\n\n⯀ Choose among 3 random perks each time you level up and combine them to create the perfect build.\n\n⯀ A procedurally generated adventure. The entire city of Darksburg and the loot it contains changes with every run, so no two games are alike.\n\n⯀ Explore a number of unique zombie infested locales spanning across the entire town with a diverse range of objectives, enemies and items to encounter with each run.\n\n(Please note that the Town of Darksburg, it’s official representatives and affiliates are not responsible and shall have no liability for any instance in which visitors are dismembered, turned, eaten or set on fire)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Shiro Games","platforms":[{"id":0,"name":"PC"}]},{"id":19608,"name":"Primordia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/663/663e4e128123563c12f5050fad763bac.jpg","description":"What Happened to the Humans?\nSet in a post-apocalyptic world strewn with cast-off machines, Primordia tells the story of Horatio Nullbuilt, a stoic robot who values his solitude and independence. Horatio spends his days studying the Book of Man, sparring with his droid companion Crispin, and tinkering with the airship they call home — a peaceful existence that becomes threatened when a rogue robot steals the energy source that the pair needs to survive.\nWhen Horatio and Crispin’s search for energy brings them to the dazzling city of Metropol, the simple quest to recover their stolen power core leads to unexpected discoveries about Horatio’s origins and a new understanding of the legendary humans who walked the earth before him.Key Features\nAn epic storyline about the extinction of the human race\nVoiceover work starring fan favorite Logan Cunningham\nGorgeous post-apocalyptic setting\nOptional puzzles - learn more about the world the more you play","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22228,"name":"Train Valley 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c09/c093b415d44f3e66792c04168028555c.jpg","description":"Drive forward the industrial revolution in our train tycoon management puzzle game. Build an efficient railroad, upgrade your locomotives, and keep trains on track without delays to meet the ever-growing demand of the cities and industries in your tiny valley. Choo-choo!\nEnjoy our original Train Valley micromanagement puzzle gameplay with all-new tycoon game elements.\nBe part of the march of industry, as technology progresses across 50 levels in company mode.\nUpgrade your stock of locomotives and unlock advanced engines as you play, with 18 locomotives from 6 generations in total.\nKeep those trains coming to get a stake in new industries, then produce and ship more sophisticated goods in over 35 types of train car.\nYou want more? Jump into our Level Editor with Steam Workshop integration and create your own valleys - or play levels from other players!\nAnd there's still more! Create and upload your own locomotives, cars, industries and resources. Our aim is to make the game as easy to mod as possible.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Alexey Davydov","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15311,"name":"SpellForce 2: Faith in Destiny","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61d/61df20c0e589b37c94bf5bc28ddfea1e.jpg","description":"In times of war and chaos you will assume the role of a young man, who is supposed to liberate the entire world of Eo from the new, nameless evil. Along with a group of diverse heroes and a dragon as trustful companions, you will fight to gain information about this mysterious new enemy and thereby discover your own true destiny.\nWith daring and courage you will be able to succeed in this brand new, epic, strategic RTS/PRG-Mix that combines the storylines of the previous Spellforce-games and continues further.Key FeaturesClick'n'Fight and Quick-Action-Buttons: perfected control system for Instant-Actions, best overview, and strategic sophistication\nDomination: all new multiplayer mode; you have to keep control of strategic nodes, which are spread over the map, in order to obtain resources to further strengthen your armies\nSingle-Player campaign ensuring a maximum of fun, riveting story progression and countless quests - all refined by the authentic and consistent world of Eo\nChoose your individual path among a plethora of different skills and magic abilites, offering numerous combinations of character development\nFor the first time in the history of SpellForce, you can even ride on a dragon\nCompletely new race with buildings, also playable in multiplayer\nStand-Alone expansion: SpellForce 2 - Shadow Wars & SpellForce 2 - Dragon Storm are not required to play the game","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Mind Over Matter Studios","platforms":[{"id":0,"name":"PC"}]},{"id":372700,"name":"Rebel Cops","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/309/3091c8ba532fd7f6e13a8ce83601a887.jpg","description":"Rebel Cops is a spin-off game from This Is the Police, which exclusively features the series' turn-based tactical operations. Lead a rag-tag squad of cops in rebellion against their town's new criminal power, and see how long you can hold out when you're constantly short on supplies, and a single shot can cost a cop his life.\nYou’re not exactly the police, but you're the only ones on the side of justiceViktor Zuev, a sadistic crime boss new on the scene, has quickly taken the town of Ripton by the throat. The community's leaders and even the local police have surrendered to his will. A master of intimidation and blackmail, Zuev has seized every major business in town, all of which he now controls as his own private fiefdom. But an outlaw band of renegade cops refuse to bow. With little hope of success, they fight on -- for justice, and the soul of their town.\n\nGunfights are thrilling, but stealth is keyYou're fighting a guerilla war, out-manned and out-gunned. Use concealment and cover, approach the enemy quietly, and take them down before they can raise the alarm. You have at your disposal an arsenal of non-lethal weapons and equipment, as well as special tactical perks, which you can unlock as you upgrade your rebels. True, sometimes violence seems inevitable, but when the time comes, don't hesitate: neither you nor the criminals have health bars. When someone is shot, they'll bleed out quickly, and getting a bullet in the head means instant death.\nExplore, scavenge, and watch your backRebel Cops features not only compact operations where you need to fight for every inch of ground, but also large open locations to explore -- the sandbox levels. Search each room, crack open safes and vaults, try to get into inaccessible areas -- and grab everything that looks useful. Stay together and proceed with caution, or accept the risks, fan out, and try to explore every corner.\nTake the high road, or the low roadZuev's mercilessness is the key to his power. Can you defeat him without playing by his rules? Will you answer the needs of the desperate townspeople, even if it means putting the whole operation at risk? Will you spare civilian guards who are only doing their jobs? Some say that in war, you have to do whatever it takes to survive, but remember: reputation is more valuable than money. Bad blood on the street can easily put your good name in the mud. Merchants will refuse to do business with you, and even some of your own people might turn their backs on you.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Handy Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":5606,"name":"LEGO Indiana Jones 2: The Adventure Continues","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d72/d729340faa6c909dc2ce08c8a0fd19f6.jpg","description":"LEGO® Indy is back in his biggest adventure yet. Battle through all four movies, including all-new levels from the original adventures and your favorite new moments from The Kingdom of the Crystal Skull... or in true LEGO® fashion, get creative and build your own levels to play with friends!\nNew modes including two-player drop-in, drop-out split-screen gameplay lets you play together with your friends and family like never before\nFor the first time, create your own levels and play them with friends!\nNew vehicles, characters and abilities in the biggest LEGO environments ever!\nUse a variety of weapons from the environment to fight enemies (e.g., chairs, guns, swords, bottles)\nCollect artifacts through the game to unlock more than 60 playable characters, including villains and supporting characters (Marion Ravenwood, Mutt Williams, Short Round, Rene Belloq, Willie Scott, Marcus Brody, Dr. Henry Jones Sr. and Irina Spalko)\nA complete retelling of Indy’s three original adventures from the first game, for a whole new experience!\nIncludes all your favorite moments from The Kingdom of the Crystal Skull\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":857690,"name":"Brotato","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed8/ed8a780ca2d64dcd38f8ff3bcecf050a.jpg","description":"A spaceship from Potato World crashes onto an alien planet. The sole survivor: Brotato, the only potato capable of handling 6 weapons at the same time. Waiting to be rescued by his mates, Brotato must survive in this hostile environment.FeaturesAuto-firing weapons by default with a manual aiming option\nFast runs (under 30 minutes)\nDozens of characters available to customize your runs (one-handed, crazy, lucky, mage and many more)\nHundreds of items and weapons to choose from (flamethrowers, SMGs, rocket launchers or sticks and stones)\nSurvive waves lasting 20 to 90 seconds each and kill off as many aliens as you can during that time\nCollect materials to gain experience and get items from the shop between waves of enemies\nAccessibility options: tweak the health, damage and speed of enemies so the difficulty is right for you","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Blobfish","platforms":[{"id":0,"name":"PC"}]},{"id":14178,"name":"NEKOPARA Vol. 1","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/048/048044d7135be10f84c887bb0c51a586.jpg","description":"What's NEKOPARA? Why, it's a cat paradise!\nKashou Minaduki, the son of a long line of Japanese confection makers moved out to open his own shop \"La Soleil\" as a patisserie.\nBut upon moving out, hidden amongst his things were two of the catgirls, Chocola and Vanilla, that the family had been raising. When he tried to send them back, they begged and pleaded until he gave in and now they've opened La Soleil together.\nWith two catgirls who really, REALLY love their master trying their very best and occasionally failing -- a heartful comedy opens for business!\nSee the Sayori NEKO WORKs’ mascots Chocola and Vanilla like never before, moving, and in full voice on screen. And now with the E-mote System, the characters smoothly move on screen changing expression and poses in countless ways.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1142,"name":"PlayStation VR Worlds","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/145/145b24b06d213f3519d01d86eb6f20ca.jpg","description":"VR games may cause some players to experience motion sickness.\n•       PlayStation® VR WORLDS takes players on a journey through five high quality VR experiences built exclusively for the launch of PS VR.\n•         PlayStation® VR WORLDS features a breadth of content and game genres that wonderfully showcase inventive VR design, best in class visuals and binaural audio soundscapes.\n•         PlayStation® VR WORLDS demonstrates the diversity of critically renowned VR experiences The London Heist, VR Luge and Ocean Descent  and featuring additional game modes, VR World challenges and more.\n•         Compete with friends in the living room and other gamers around the globe on the VR Worlds Leaderboards.\n•         Something for everyone, from the casual player to the gaming veteran.\nVR Games may cause some players to experience motion sickness.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nPlayStation®VR Required\nPlayStation®Camera Required\nEnhanced play with 2 PS Move controllers\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Sony Interactive Entertainment Europe. PlayStation is registered trademark of Sony Interactive Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":430275,"name":"Vampire: The Masquerade - Shadows of New York","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/107/107181af0b03753dbfc16ec91b37bdd3.jpg","description":"You’re a nobody. An outcast in your own vampiric sect. A political prisoner of no particular value. An immigrant who never found her roots in a city of immigrants. A chainsmoker whose favorite pastime is staring blankly at the streets through the windows of a fast food joint at 4AM. The sinking feeling in the pit of your stomach tells you that you’re doomed, and distorted voices from the shadows seem to agree. The curse of your clan makes interacting with everyday technology difficult. Dissociation is your natural state.\n\nBut when New York’s Anarch leader meets a gruesome end, out of all the bloodsuckers in the metropolis, you’re the one picked to investigate. Make no mistake: this is obviously a trap, yet another move in the horrible game of Jyhad, the eternal struggle for power between warring vampire generations. But you’re Lasombra, and if there’s one thing you know, it’s this: if the Ventrue Prince and her followers underestimate you, they’re going to deeply regret it.\n\nVampire: The Masquerade – Shadows of New York is a visual novel set in the rich universe of Vampire: The Masquerade. It acts as a stand-alone expansion and a companion piece to our previous title, Coteries of New York. While Coteries was a general introduction to the world depicted in the 5th Edition of the hit tabletop role-playing game, Shadows presents a more personal and unique tale.\n\n- A visual novel tackling themes of personal and political horror, suitable for both Vampire: The Masquerade veterans, and fans of narrative-driven games who are newcomers to the setting.\n- A stand-alone expansion to Coteries of New York. See the familiar metropolis through entirely different eyes. Expect new characters, new locations and a fresh original soundtrack.\n- Play as a member of the Lasombra clan. Formerly vicious foes of the Camarilla, the Magisters decided to search for safety in the ranks of their former enemies. Master the shadows and communicate with the inhabitants of the Other Side, but beware – Oblivion is always lurking out there, ready to devour you whole.\n- Explore the streets of the Big Apple. While you search for ways to satiate your bloodthirst, catch glimpses of various fascinating vignettes and forge connections with the eccentric inhabitants of the city. One playthrough won’t be enough to see it all.\n- Shape your mind, shape your fate. You used to avoid defining yourself and tried to stay neutral, but given your situation, you can no longer afford to do so. The choices you make will alter the way you think, and your thinking will alter the paths you take.\n\nQ: If it’s called Vampire: The Masquerade, does that mean you have something in common with World of Darkness, Bloodlines 2, Redemption, the cult tabletop RPG system, or...?\nA: Yes. Shadows of New York is set in the same shared universe, but offers stand-alone experiences and stories. You may spot some connections with the other titles, but Shadows is not a sequel to any existing products. The World of Darkness is a media franchise and shared universe, shaped by various creators and participants, meaning: all stand-alone stories play into a greater whole. Berlin falling to the Anarchs during an official LARP, the Lasombra clan joining forces with the Camarilla in the Vampire: The Masquerade - Chicago By Night 5th Edition sourcebook, Sophie Langley’s plot to take control of New York in Coteries of New York – all of these events subtly influence and interact with each other.\n\nQ: Do I need to play Coteries of New York to understand and enjoy the story of Shadows of New York?\nA: Not at all. Shadows of New York is a stand-alone expansion to Coteries of New York, which means it shares the New York City setting and a large part of the supporting cast with our previous title, but is designed to offer a different experience. Coteries served as an introduction to the basics of Vampire: The Masquerade 5th Edition – it was focused on showcasing different vampire Clans and core concepts of the setting through the point of view of a newly-fledged vampire, a character who did have a defined backstory, but by and large meant to serve as a player avatar.\n\nShadows of New York is a more personal story, told from the perspective of a well-defined character who’s already integrated into the Kindred society and has a developed inner monologue of her own (which means you influence her personality instead of shaping it). Those who are familiar with Coteries will already know a large part of the cast and catch some references that would otherwise go unnoticed, but those who decide to start with Shadows and get back to Coteries later should be able to enjoy both experiences just as much as they would if they played them in their release order. The two stories are essentially separate, different both tonally and thematically.\n\nQ: Which platforms will Shadows of New York be available on? Will there be a simultaneous release date?\nA: Shadows of New York will launch simultaneously on PC (Windows/Mac OS/Linux), PS4, Xbox One and Nintendo Switch in 2020.\n\nQ: Does the game support controllers?\nA: Yes. You’ll be able to play both with mouse and keyboard, as well as with a controller.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Draw Distance","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":244694,"name":"Catherine: Full Body","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f55/f5532538a538a505204fd4f3f2b19c1c.jpg","description":"Our indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord by his own infidelity, he finds solace in the innocent Rin – further complicating matters. Adding to Vincent’s dilemma, he begins having nightmares that force him to climb for his life... Will he survive the trials and tribulations of love, or fall to temptations?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SEGA","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":47379,"name":"A Case of Distrust","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff7/ff7f76ba6afbe575f89a13e7aac4d08e.jpg","description":"A Case of Distrust is a narrative mystery from 1924 San Francisco. Play as private investigator Phyllis Cadence Malone in this historical 2D adventure game. Explore underground speakeasies, smoke-filled billiard halls, classic barber shops, and more. Catch suspects in lies by using evidence, statements, and your wits. Intrinsic challenges face our heroine, as she struggles against a pushback on emancipation, leading to many doubts, both internal and external. Uncover the truth in a mystery full of deception!FeaturesA hardboiled mystery, working past deceptive characters towards the truth\n1924 San Francisco with historically accurate details\nSaul Bass inspired visuals and scene transitions\nFinger-snapping music that gives style to the roaring 20s\nThemes of poverty, racism, and emancipation that tie into contemporary issues","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Serenity Forge","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":30198,"name":"Rune","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f83/f8324f17a0b08015911d878d881a0b71.jpg","description":"It was foretold that during Ragnarok, the gods would fall and the nine realms would be consumed by frost and fire… but it is not what happened. The gods did not perish. Instead, for seven terrible years, giants, beasts, and the undead have ravaged the realms while the gods inexplicably withheld their protection. Immersed in darkness and chaos, mankind’s own world of Midgard lies captive in the cruel grasp of maniacal Loki.\nAs a hardened Viking warrior, Rune players will align with their chosen god as they pillage villages for powerful weapons and armor, complete quests for their deity and receive blessings of strength and magic.  Your quest is simple – destroy Loki, but you needn’t do it alone. Team up with your Viking allies to gain the benefits of shared experience and the strength that only comes in numbers.\nTime is against you.  Loki will reset Ragnarok keeping Midgard in an endless apocalypse.   Rise, Warrior!  Save yourself and all of mankind from the Norse apocalypse.KEY FEATURES\nExplore Vast and Dangerous Lands\nOnce-beautiful Midgard lies in ruins, disfigured and drowned. Braving destruction and death, stalk your ravaged world in search of Loki’s minions…and the Trickster himself. Where Ragnarok has warped the land most, there you may find the most powerful weapons and resources..\nGo Alone or Team Up With Friends\nBrave the end of days alone or invite fellow warriors to accompany you through Ragnarok. Together, sail a fleet of longships to overrun enemy fortresses, battle side by side against giants and enormous monsters, and stand as one to face Loki himself. Add to the madness of Ragnarok in brutal PvP battles to see who may be the most feared Viking in Midgard.\nChoose Your God\nAlign with a Norse god to receive unique abilities and skills to aid you on your quests. Do you align with Thor, who grants you strength?  Or with Hel, who gives you power over the dead? Or perhaps the Allfather himself, Odin, who will grant you additional protection from the dangerous world? Choose wisely.\nThe End of Days\nRagnarok has plagued the land of Midgard for far too long.  Its end is coming but Loki’s twisted plan is to reset it back to the beginning of the end of days.  You and your clan must do whatever it takes to destroy the Trickster god and save Midgard from a perpetual Ragnarok.\nCollect Powerful Equipment and Harness Rune Powers\nComplete quests for your god through mystical runes and harness their powers to improve your combat abilities. Pillage villages and take down powerful enemies to gain  weapons and armor as you transform yourself into a warrior capable of taking down a god.\nProve Yourself\nAs the legends foretold, your dying realm is being torn further apart by war. Huge monsters, giants, feral beasts, living warriors, and the dishonored dead alike, all tear at one another for dominance over what is left of Midgard. Warrior, can you rise above the fray? Can you prove yourself mightiest of all by slaying Loki?","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Human Head Studios","platforms":[{"id":0,"name":"PC"}]}]