[{"id":60704,"name":"God’s Trigger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f9/8f959050840256770063f7bea1ebe0ea.jpg","description":"Plunge into an over-the-top co-op bloodbath starring an unlikely duo of an Angel and a She-Devil. Harry, a soldier of Heaven, and Judy, an escapee from Hell, have to work together to kill the Four Horsemen and stop the Apocalypse.EXTREMELY INTENSE AND VIOLENT\nBask in an intense skill-based action where one shot is enough to kill the enemy or… you. Revel in a wide selection of guns, melee weapons, and unique superpowers that ensure a truly gory bloodbath.DESIGNED FOR 2\nEnjoy stopping the Apocalypse with your friend in the fully-featured co-op campaign. Master the strengths of your characters and surprise the enemies with your impeccable teamwork. Play online or side by side on the couch.INSANE ENEMIES AND MEMORABLE BOSSES\nStand against an army of maniac enemies, including possessed bikers, angelic warriors and more. Meet the unforgettable Horsemen of the Apocalypse face to face and test your cooperative skills against their unique powers.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Techland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":42858,"name":"Crackdown 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/223/2236a6f4f479eed103d2d11addabb235.jpg","description":"Crackdown 3 is the sequel to 2010s Crackdown 2 and the third game in its series. Crackdown 3 uses Microsoft Azure cloud computing service to improve the game's performance.\n\n###Plot\nThe game continues the plot of its predecessor ten years later. It is set in the future in the fictional city of New Providence. A terrorist attack has blacked out the power on all Earth. The main protagonist is a member of an elite force called Agency that is led by the mysterious Agency's Voice and Commander Jaxon. His or her goal is to track down and annihilate the terrorists from the Terra Nova organization that controls New Providence.\n \n###Gameplay\nThe player controls the protagonist from the third person view. He or she navigates the protagonist in the city and completes missions that involve killing the enemy soldiers and bosses, called Kingpins, as well as destroying terrorists' facilities. The enemies may counter-attack, and the user can provoke a terrorist boss to go out of hiding and engage in the battle by destroying certain facilities that activate the “Gangs Bite Back” mechanic. The game features a completely destructible environment. The character's abilities improve with experience using the “Skills for kills” mechanic. \n\n###Multiplayer\nCrackdown 3 has both single player and multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":13339,"name":"They Bleed Pixels","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/316/316f5c1d64b1b73dc1d39b6a6e8ce3f0.jpg","description":"They Bleed Pixels is a 2D hardcore platformer featuring pixel art stylistics borrowed from Lovecraft compositions. This is the only title within the franchise.\n\n###Gameplay\nThe game incorporates the hard elements from the titles like Super Meat Boy — not only the battle sections here are difficult due to the one-button attack system, but the platforming is challenging too as there are a number of regions where the blocks are covered by ice, and the player is required to perform a high-accuracy jumps while sliding. The death is common here as there are numerous ghastly obstacles along the level. Although the game features checkpoints they are only created when enough enemies' blood is accumulated within the heroine. So, the location without encounters means the place without checkpoints as well.\n\n###Plot\nThe story examines the adventures of a little teenager who enters a special school for girls only — Lafcadio Academy for Troubled Young Ladies. The only difference is — the action takes place within her nightmares where she is forced to fight numerous squads of demons. After every level, the girl wakes up and through the course of the plot she begins noticing changes occurring to her real self, which are gained from her nightmares. She is fully transformed at the end of the game and finds out it was all set for the dark ritual.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Spooky Squid Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":261296,"name":"One Step From Eden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/511/511265756e127eb7eaae06f36e24bb6f.jpg","description":"One Step From Eden is a deck-building bullet hell with roguelike elements. Cast powerful spells on the fly, battle evolving enemies, collect game-changing artifacts, make friends or make enemies. Make it one step from Eden, the last shining beacon of hope in a bleak post-war world. Fight alone (or with a friend in co-op) and lead your character down a path of mercy or destruction.\nFree demo here: https://gamejolt.com/games/OSFE/366092Features:Deckbuilding with 200+ spells & 100+ game-changing items\nAction deckbuilding, a blend of bullet hell action and card game strategy\n8+ Playable characters and Bosses\nLife or death choices with alternate runs and endings\nUnique evolving enemies that get ingeniously more difficult\nProcedurally generated worlds and battles\nLocal co-op and PvP\nFull controller and keyboard & mouse support\nSteam Workshop & mod support","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Thomas Moon Kang","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":13434,"name":"The Cat Lady","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/22d/22dffeba4c72db594361d62f6b282c2b.jpg","description":"The Cat Lady follows Susan Ashworth, a lonely 40-year old on the verge of suicide. She has no family, no friends and no hope for a better future. One day she discovers that five strangers will come along and change everything...\nBy author Remigiusz Michalski (Harvester Games) this suspenseful psychological horror game features stylized artwork, a simple keyboard control method and English voice acting, plus a compelling, atmospheric 70 minute soundtrack by micAmic (now included free with every copy in Library > Music) and featured artists Warmer, 5iah and Tears Of Mars.\nThe Cat Lady contains strong adult themes and is recommended only for players over 18.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Harvester Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9920,"name":"War for the Overworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a7/2a780e763065c940130264772725b52a.jpg","description":"Celebrating Two Years of WFTO!\nUnderlord Edition\nPurchase the Underlord Edition to receive these additional features:Sovereign Dungeon Theme\nIn War for the Overworld, each and every Underlord is their own unique being. A dungeon is a direct reflection of an Underlord’s presence and individuality.\nBy purchasing the Underlord Edition you can don the Sovereign Dungeon Theme in all non-Campaign game modes, to demonstrate your dedication to evil!\nThe Sovereign Theme contains unique models and textures for:\nDungeon Core including unique VFX and SFX\nWalls and Tiles\nTile and Door Toppers\nWorkersSoundtrack DownloadWe’ve assembled the complete collection of all 16 music tracks used in the game, all of which can be yours to listen to in the comfort of your own Underground Lair or Torture Chamber.The Dungeoneer’s Guide to the Underworld (English Only)A 48-page PDF that serves as a love letter to the old-style manuals that you used to get with games. Filled to the brim with awesome art and lore about the world of Kairos and its denizens, there's no better way to discover the world you're going to conquer!All That Is Gold - Short Story Compilation (English Only)A PDF collection of three short stories that follow the adventures of a heroic dwarf during the events of the Heart of Gold expansion.\nAbout the GameTired of invading dungeons? It's time you built your own!\nDo you feel you are in a slump? Monotonously disembowelling evil guys in endless quests for gold and a slightly better pair of boots? You are starting to wonder... are heroics really your calling? Welcome to the War for the Overworld!\nWar for the Overworld is a Dungeon Management Game that employs your favourite aspects of the RTS and God Game genres. You play an all-powerful, malevolent Underlord, long banished to the Aether. With unrivalled dark power and an insatiable desire for bloody conquest, you will arise once more, and reclaim your realm!\nIn your absence, the Underworld lost its way. It became feeble and afraid of the Empire of the Overworld, which grew strong and boldly comfortable in its quiet retirement from evil-slaying. Carve out your dungeon from the soil and stones of the Underworld, and build dozens of unique rooms to attract a myriad of creatures to your halls to work and fight for you.\nIn addition to your faithful followers, you have destructive spells and powerful rituals to cast upon any unsuspecting goodly Hero (or rival Underlord) who dares to breach your unhallowed halls. With your unmatched dark powers and mighty army of bloodthirsty minions, you are ready for your War for the Overworld!Key FeaturesBuild Your Dungeon - Excavate and build your dungeon beneath the earth of the Overworld. Design its layout as you see fit, creating an underground fortress filled with a wide variety of rooms, each with a unique use and purpose.\nEvil Is Back - Play as an Underlord who has awakened from a deep slumber after countless years drifting in the Aether. This realm hosts a variety of enemies — both Heroes and Underlords will stand  in your path as you fight for dominance of the Overworld.\nVeins of Evil - Choose from over 60 rooms, spells, potions, rituals, defences and constructs in the Veins of Evil as you progress through the game. There are a plethora of possible Vein combinations you can use to conquer the Overworld. Create your own unique flavour of evil!\nFortify Your Domain - Build a wide variety of defences within your walls to defend against — and destroy — those who seek to invade your domain.\nCast Wicked Spells - Call down  unholy magic to strengthen your dungeon, rout enemy forces, flood corridors with Micropiglets, or simply turn a meddlesome Hero into a geyser of giblets.\nUnleash Devastating Rituals - Punish your foes or empower your own forces with game-changing Rituals that can do anything from raising an undead army, to instantly fortifying your entire dungeon.\nCommand Powerful Minions - Over 20 minions await your call, and will gladly work and fight under your banner... if you provide them with all the creature comforts they demand.\nConquer the Overworld - Play through a feature-length campaign, facing off against the Emperor of the Overworld as you fight for complete supremacy in the Realm of Kairos.\nDestroy Your Rivals - Take the fight to your rival Underlords in Skirmish or Multiplayer matches with up to four players.\nChallenge Ruthless AI - Team up with a friend or fly solo and challenge devastatingly sophisticated AI Opponents in Skirmish or Multiplayer!\nShape the Underworld - Create entirely new levels in the Map Editor and share them with other Underlords via the Steam Workshop!\nTest Your Mettle - Run the gauntlet of the Crucible mode and see if you can top the high score against waves of enemies!\nGameplay Mutators - Tweak every possible setting to create and save custom game types.\nCommunity Translation Support - So you can bring War for the Overworld to other Underlords across the Underworld.\nRichard Ridings - The entire game is supported by narration, tutorials and status updates from the original and best dungeon mentor, Richard Ridings!\nMassively Improved - Tons of improvements, rebalancing, bug fixes and polish since the original launch!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Brightrock Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":52800,"name":"Chrono Trigger","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae4/ae404f4e0f504131199703c09111bb78.jpg","description":"Chrono Trigger is a role-playing video game developed and published by Square for the Super Nintendo Entertainment System in 1995. Chrono Trigger's development team included three designers that Square dubbed the \"Dream Team\": Hironobu Sakaguchi, the creator of Square's Final Fantasy series; Yuji Horii, a freelance designer and creator of Enix's popular Dragon Quest series; and Akira Toriyama, a manga artist famed for his work with Dragon Quest and Dragon Ball. Kazuhiko Aoki produced the game, Masato Kato wrote most of the plot, while composer Yasunori Mitsuda wrote most of the soundtrack before falling ill and deferring the remaining tracks to Final Fantasy series composer Nobuo Uematsu. The game's story follows a group of adventurers who travel through time to prevent a global catastrophe.\nSquare re-released a ported version by Tose in Japan for the PlayStation in 1999, later repackaged with a Final Fantasy IV port as Final Fantasy Chronicles in 2001 for the North American market. A slightly enhanced Chrono Trigger, again ported by Tose, was released for the Nintendo DS in North America and Japan in 2008, and PAL regions in 2009.\nChrono Trigger was a critical and commercial success upon release, and is frequently cited as one of the best video games of all time. Nintendo Power magazine described aspects of Chrono Trigger as revolutionary, including its multiple endings, plot-related sidequests focusing on character development, unique battle system, and detailed graphics. Chrono Trigger was the third best-selling game of 1995, shipping over two million copies by March 2003. The Nintendo DS version sold 790,000 copies by March 2009. Chrono Trigger was also ported to i-mode mobile phones, Virtual Console, the PlayStation Network, iOS devices, Android devices, and Microsoft Windows.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Square Enix","platforms":[{"id":0,"name":"SNES"},{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"}]},{"id":29391,"name":"Eye of the Beholder","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a35/a357dd9b955fd12f9363c6d45fcd4f86.jpg","description":"Step into war-torn enemy territory in this immersive VR game experience based on the Oscar-shortlisted documentary MY ENEMY, MY BROTHER (2015). EYE OF THE BEHOLDER is a 20 beta minute experience that subverts the war-game genre as players must choose to combat or collaborate with others.\nAs a documentarian I am inspired by real life situations and stories and in 2014, I was lucky enough to meet two men whose story changed my life and that of many others. Zahed and Najah are former enemy soldiers who have become blood brothers for life. Zahed was an Iranian child soldier during the Iran-Iraq War when he found Najah, an enemy soldier, injured in a bunker. Zahed made a split-second decision in the heat of the battlefield and instead of shooting Najah, he risked his own life to save him. I was deeply inspired by Zahed's ability to recognize the humanity in his enemy. His act of bravery has had lasting ramifications in both their lives and those of their families.\nI documented their story in a film, MY ENEMY, MY BROTHER, which resonated strongly with audiences across the world. It landed on the Oscar shortlist, was nominated for an Emmy award, and premiered as a NYTimes OpDoc in 2015. The film evolved into a feature documentary, which premiered at Hot Docs Documentary Film Festival in 2017. The strong international response to the films, as well as feedback in the Q and A sessions, led us to explore the film’s core themes further. We wanted to bring the remarkable empathy that Najah and Zahed felt for one another into a unique space, where audiences would be able to step into their shoes and make choices for themselves, that could make them rethink their decisions in real life. We developed what is now the EYE OF THE BEHOLDER VR immersive experience.\nThe EYE OF THE BEHOLDER VR subverts the war-game genre to explore how we judge one another as friend or foe. EYE OF THE BEHOLDER is set in a conflict zone, but in essence each decision reflects the kind of snap judgement made in school yards, street corners and board rooms across the globe. Do I trust this person? Are they friendly or a threat? Should I collaborate with this person or fight them?\nAs the player faces each challenge in the bunker and decides whether or not to collaborate with the other soldiers, their decisions affect how the other soldier responds to them, and ultimately determines who makes it out alive. As the player discovers in the end, their decisions also impact the welfare of nearby communities.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Atari Lynx"},{"id":0,"name":"SNES"},{"id":0,"name":"Commodore / Amiga"}]},{"id":17869,"name":"The Hat Man: Shadow Ward","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f8/1f87d5420bc3b9cf6368a938750a0565.jpg","description":"The Hat Man: Shadow Ward is an indie horror game by Game Mechanics. The developers state that the game is based on the true story.\n\n###Plot\nYour daughter is diagnosed with dementia and is put in the Canton State Insane Asylum. Sometime later, you receive a letter from the asylum staff that she has gone missing from the Asylum. You set out to find her. Upon the protagonist's arrival, everything goes to hell. Electricity and communication with the outside world get cut off, and supernatural events occur. You have to get out of there.\n\n###Gameplay\nThe game's controls are usual for the first-person experience. WASD is used for moving, Q and E for leaning, with spacebar to jump and I bound for your inventory. There are no usable weapons present in the game. The only things the players often use are a flashlight, medkits, and some matches. One time in the game the players can use a fire ax to break a door, yet this event is completely scripted. \n\nThe premise of the gameplay is simple: avoid the mysterious Hat Man and the Shadow People that are encountered on your way out of the asylum. The game puts a heavy emphasis on using light sources to see your enemies. It is impossible to attack the enemies, as the players don't have any weapons at their disposal, so the only thing the players can do is to run away from the creepy creatures.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Game Mechanics","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17509,"name":"Racer 8","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7d/c7d111f0aad385c5687735bd3ade7677.jpg","description":"The game with the \"racing\" name, but combines the race, and a logical puzzle.\n\n###It’s not enough to get to the finish line - you still have to build a route to it\nAt your disposal are fifty different levels of the game and five classic car models (but they are depicted in the game’s own style).\n\nWinter and summer, night and day - all conditions are present among the options of racing.\n\nThe main thing - in addition to racing, you have to build the track yourself right in front of the bumper of your car. And you need to put each next parcel on time - because your car is always in motion.\n\n###Goal of the game\nThe road sections on the map need to be integrated into one and you must do this so that your car can drive to the finish line.\n\nThere are three checkpoints on the way, but it's not so easy to get to them - you need to monitor the presence of gasoline. In addition, in the game you have rivals.\n\n###Pleasant surprises\nDifferent power-ups will help you, allowing you to fill up a tank, slow down the course of time, get extra points, etc. They meet on the way.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"30.06 Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":325034,"name":"Vampire: The Masquerade - Coteries of New York","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/167/1671fd995dca91530c54057eb4dbca32.jpg","description":"Vampire: The Masquerade - Coteries of New York presents the conflict between two vampiric factions: the traditionalist Camarilla and the fiercely independent Anarchs among the iconic landmarks and night lights of The Big Apple. It's a unique, atmospheric, single-player narrative experience, set in a rich, fully licensed, globally recognized universe of Vampire: The Masquerade 5th Edition.\nChoose your character from one of several distinct Clans\nEvery playable character offers unique powers (Disciplines), different ethical approaches to certain issues, and dialogue lines\nCharacter-oriented quests allow you to create your own coterie and shape your relations by reinforcing NPC loyalties\nHighly replayable - choices made in the game are reflected by the game's changing fiction\nVarious endings depending on your actions - which conclusion will you reach?\nSuitable for both Vampire: The Masquerade veterans, and fans of mature narrative-driven games who are newcomers to the setting\nThe game does justice to the mature themes of the World of Darkness, and takes advantage of the excellent atmosphere of the source material. It also creates new stories, which, thanks to the full creative license, will be incorporated as official lore of Vampire: The Masquerade 5th Edition.What is Vampire: The Masquerade – Coteries of New York?\nVampire: The Masquerade - Coteries of New York aims to translate the complex and fascinating world of vampires, their nightly struggles for power and attempts to hold on to their humanity, to a format previously unexplored by the brand - an atmospheric narrative experience. Think interactive story meets choices-that-matter; dark, atmospheric, emotional narration meets Telltale-like way of creating morally challenging dilemmas, answers to which are entirely up to the players, allowing them to reach one of a variety of possible endings.How does Coteries of New York play?\nYou act as a newly-fledged vampire in New York. You have to learn what it means to be one of the Kindred in a huge, vibrant, contemporary metropolis. On your way you’ll meet different NPCs – other vampires, thin-bloods, ghouls, humans... and more. You will perform tasks that will put test your humanity and take part in a complex and often brutal struggle for power between the Camarilla and the Anarchs. You’ll build your Coterie and learn your undead companions’ deepest secrets… or see them abandon you. You’ll feast on the living and will ask yourself about the very nature of humanity and will feel the constant lure of the Beast inside you. You will make choices for the character, including which storylines to pursue and how to approach the different situations presented. You will take part in a narrative experience with branching dialogue choices, memorable characters - all among iconic locales of the Big Apple. You’ll be able to use Disciplines to charm, sneak, intimidate or kill and your choices will determine your path.If it’s called Vampire: The Masquerade, does that mean you have something in common with World of Darkness, Bloodlines 2, the cult tabletop RPG system, or...?\nYes, exactly! Coteries of New York is set in a fully licensed universe of Vampire: The Masquerade 5th Edition! However, even if you know nothing about the setting, don't fret! The game is designed to meet the expectations of both Vampire: The Masquerade veterans, and new players, who never had an opportunity to delve into the World of Darkness.What about replayability and post-launch support?\nYou’ll be able to choose your character from three different vampires, representing three iconic Camarilla Clans (we’ll unveil them at a later date). Every character has access to a different set of Disciplines (unique supernatural skills that are characteristic to that Clan) and different narration. Your initial choice also influences your Coterie members’ approach to you, dialogue lines, possible side quests etc. Hence, it takes hours to experience every piece of content we prepared. You’ll go through the main quest, side quests and loyalty quests (aimed to build closer relations between the protagonist and members of your Coterie). BUT one playthrough is definitely not enough to see every piece of content we’ve prepared.\nAs for post-launch support, you can definitely expect new, standalone stories, enriching the lore, telling different bloody stories from the history of vampiric New York and adding new twists to interpersonal plots.Which platforms will Coteries of New York be available on?\nCoteries of New York will be available on PC (Windows, MAC OS, Linux) and Nintendo Switch. The game will launch on both platforms simultaneously. Other platforms, like PS4 and Xbox One, are not out of the question, but we're taking a \"wait and see\" approach.When will Coteries of New York be released?\nCoteries of New York will be released in Q4 2019! We’ll unveil the final date when we’re closer to launch.Which language versions will be supported?\nThat's a huge and very difficult topic because of localisation costs and time constraints. We understand that Vampire: The Masquerade has fans all over the world and we would like Coteries of New York to be available in many different languages, including English, French, Italian, German, Spanish, Polish, Russian, Turkish, Chinese, Japanese and Brazilian Portuguese. We'll be able to share more information closer to launch.Will the game support controllers?\nYes! As Coteries of New York will launch simultaneously on PC and Switch, you’ll be able to play the PC version both with mouse and keyboard, as well as with a controller. Full list of supported controllers will be revealed closer to launch.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Draw Distance","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16790,"name":"Fallen Earth Free2Play","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/22a/22acb446338b863e5acd6027a86c74c7.jpg","description":"It’s 2156, and the world has been destroyed by both nuclear and bio-chemical means. Your story takes place in one of the few habitable places left in the world, the Grand Canyon. As a clone with an uncertain past, your job is survival in a world now built on destruction, betrayal and fragile factional alliances.\nExplore, harvest and stake your claim to over 1,000 square kilometers of harsh and mysterious terrain. The classless advancement and non-linear gameplay allows you to play the character you want. Join a random dynamic events to capture resources and invade towns, capture and hold a Progress Town, fight through instances,  take part in the rich faction backstory, or make a living by selling what you scavenge and craft on the auction house. Fallen Earth gives you the freedom to do exactly as you want. The world may be a shadow of its former self, but there’s no limit to what’s possible for you to accomplish.\nKey features:\t\t\t\t\t\tScavenge, harvest and craft just about anything you can think of. Over 95% of the in-game items are player crafted.\nThe hybrid real-time combat system gives you the perfect blend of first-person combat and role-playing\nPledge allegiance to one of six factions and take part in the rich backstory that defines the world of Fallen Earth\nCompletely classless, play the way you want to\nOver 1,000 square kilometers to explore\nDynamically occurring events, including invasions and resource cache discoveries mean that there is always something happening\n","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Reloaded Productions","platforms":[{"id":0,"name":"PC"}]},{"id":12879,"name":"Freestyle2: Street Basketball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/020/020f3d458a046361f265fcb85f61bc3b.jpg","description":"3 On 3 Street Basketball Match! Try the Best Mmo Street Basketball Game Now! Experience a superior gameplay of basketball and perform freestyle street basketball moves!\nEnjoy the excitement of street basketball with its distinct killer graphics and incomparable game experience.one Player, One Character  Player is focused on controlling a single character with the position of their choice.\nAn interactive basketball game that enables you to define yourself in the court.\nTest your teamwork with other basketball players around the world and show them what you got!key Features \tPositions: Center, Power Forward, Small Forward, Shooting Guard and Point Guard.\nSkills: Make your own play style with over 30 of moving, shooting and passing skills!\nTournament & Crew: Team up with your crewmates and win the tournament to get a chance to get great prizes!\nCustomization: Customize your character and choose from a wide range of outfits, hairstyles, shoes, accessories to define your own fashion statement!\nTutorial & Training: Exclusive tutorials show how to execute each and every skill in the game. other Features\ndaily Quest and Mission\nachievements\nActive Environment System: AI and environments are responding according to player’s action.\nASA System: it allows user to track very detailed statistics of their play style\nBGM: Original hip-hop sound track that gives users a genuine street basketball feel\nCard System: There are cards that can be obtained in-game and can boost certain attributes of a character. Collect & complete deck of cards to acquire greater attribute boost!\nChallenge Mode: Challenge AI’s in Rebound, Diving Catch, Block and Jump Shot on different levels and make it to the top list!\nFor hardcore basketball fans that can’t get enough action on a mainstream basketball game, the MMORPG game FreeStyle2, the successor of the popular FreeStyle1 is here to kick up your feisty-seeking-meter to maximum.\nFreeStyle2 is best for its unconventional gameplay and graphic effects from the usual basketball games that not only make the game more stimulating and hyped.\nPlayers are set up to a street-style league and are allowed to use flashy, freestyle moves that also intensify game experience that you can never find anywhere.\nThrow away the uniform and come to the playground for some street basketball fun!\nNow, experience the extreme moves of street balling! Every move is a highlight,Only available in FreeStyle2: Street Basketball.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Joycity","platforms":[{"id":0,"name":"PC"}]},{"id":11159,"name":"Shelter 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8a8/8a8889e3cc8dc5c983d749e9b3374ae3.jpg","description":"Shelter 2 is a survival game, set in the tundra. It is a sequel of Shelter. \n\n###Plot \nYou play as a mother lynx. In the beginning, the lynx is pregnant, and she is preparing to den. After the birth of her kittens, she protects and feeds them. When they are strong enough to follow the lynx, they begin exploring the area and hunting. In the end, after becoming a grown-up, they leave their mother. \n \n###Gameplay \nAfter the birth of your cubs, you can name each one. There is a family tree, so the player aims to keep it going.\nYou have to protect the kittens. However, you should be prepared, that the death can chase them anytime. Sometimes the lynx has to fight enemies (wolves, eagles) and suffer from the natural disasters. As for the hunting, while progressing, the prey is becoming more prominent. In the beginning, it can be different critters, but then the mother lynx and her grown-ups kill dears. However, hunting is a bit limited in scope, because it includes only running fast and chomping. To do all these actions, you only need to beat one button. Overall, the mechanism is quite simple.\nThe lynx can bite, roar, sniff the air, break into a sprint, but each action needs only one button to press. Moreover, you can explore the different environments of the Shelter. There is a map, where you can see the terrain as you travel.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Might and Delight","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":62864,"name":"Simple Story - Alex","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b64/b648215b525a2a16b212fa738fc8884e.jpg","description":"Hello, my friends! This is my first game. Why I make it on RPG Maker? Because I`m not a programmer, neither an artist, so in my humble opinion this game constructor is ideal for the first game. It's not necessary to make an epic RPG, then you can make a simple story about an ordinary people.\n\"Simple Story - Alex\" - as you can guess by its name, it is a simple story about Alex the ordinary alcoholic. He lives a boring life, but dreaming to be a hero in a different world and dimension. One day, when he was leaving his house, Alex get teleported in a mystery temple. Is he sleeping? Or did his dreams come true? Or maybe something completely different occurred? You should find an answer. Game features:\n• Short game length. You can complete the game in under half an hour, because in my opinion there is no reason to make such a story longer. You have a spare hour? Then you can enjoy it with this game.\n• Complicated story. During the game you wouldn't understand what's really going on, until the very end of the game.\n• The story is partially based on real events. Alex appearance and larger half of the story, based on my life.\n• Easter eggs. If  you will look carefully, you should find few easter eggs, In this game.\n• There is no battle in this game, neither leveling, nor other attributes of ordinary jRPG. It is a linear story, carefully written by author.\n•Standard art. I decided to use only standart art, and try to focus on story, instead on graphic.\n• Possibility to use all surrounding items. Actually It is not only a possibility, but a necessary steps, to fully understand game story.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"КиКо","platforms":[{"id":0,"name":"PC"}]},{"id":20059,"name":"QUAKE II Mission Pack: The Reckoning","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/732/73215f681f68d6463b78e8ffd6c99927.jpg","description":"You are part of an elite commando force that must infiltrate a hostile alien cite. Once inside, you must scour industrial landscapes, crawl through waterways and air ducts, navigate treacherous canyons teeming with vicious mutants, stow away on an alien spacecraft, and destroy the enemy's secret moon base.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":28412,"name":"Viva Piñata","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/001/001003a4a5f2fd8d2c8c3949592c34cf.jpg","description":"Viva Pinata is a life simulation game developed by Rare in 2006. \n\n###Plot \nThe action unfolds at the Pinata island, which is a deserted garden full of pinata citizens and disruptive interlopers. This game starts the Viva Pinata series with a sequel and a Nintendo version. The original game can be used on Windows and Xbox 360. \n\n###Gameplay \nViva Pinata is a first-person life simulation. The player performs on behalf of a black-and-white pinata horse.\nThe aim is to fulfill requirements such as digging the ground, sewing weeds, harvesting ponds, and sculpting plants. During the game, the player also has to keep the garden from antagonists – sour pinatas. They usually harm plants, eat seeds, drop poisonous candies and destroy various objects. Once the requirements are fulfilled, the player’s pinata becomes a full-colored version. The next goal is to find a couple suitable for mating; this part of the game includes a minigame. The horses are not gendered, so finding a couple does not merely looking for other species. The romance results with a pinata egg delivered by a stork. \n\n###Development \nViva Pinata was meant to be a family video game. A TV-channel made it into a cartoon and handled it into merchandising. The cartoon is tied to the game plot; its animation is based on the game’s 3D character models.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Rare","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":21350,"name":"QUAKE Mission Pack 1: Scourge of Armagon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/453/4534eee85944960d1a13a759a3f3d109.jpg","description":"After defeating Shub-Niggurath, you arrive back at your home base on Earth, but it's not all blue skies and butterflies. Apparently, not all QUAKE forces have been subdued. Chaos ensues as you blast your way through the QUAKE minions and toward the infested gateway. Your only choice is to find the source of evil and shut it down. Without any hesitation, and with more guts than common sense, you leap into a portal of unknown destination.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":21262,"name":"MDK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19c/19ca7f49ab8f11e213de811f260f6786.jpg","description":"ON A GOOD DAY, ONLY 2.5 MILLION PEOPLE WILL DIE.\nAs vast alien mining cities suck the power and minerals from every major metropolis on Earth simultaneously, time is of the essence as millions of civilians are expiring by the second.\nUsing your stealth parachute and the now infamous 'Zooming' head-mounted sniper-weapon, your task is to slip in undetected from the sky, seek out and remove the alien leader by any means.\nMDK gives you awesome super smooth 3D gameplay.\nPlus, with the most advanced weapons ever created in a video game, you can 'take' out an alien's eye from five miles away or just neatly carve your name in his forehead!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Shiny Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1892,"name":"Nihilumbra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dda/dda8007ccdcc71c467cacebba1c0035c.jpg","description":"Nihinlumbra is a video game by BeautiFun Games. It was released in 2012, and the first platform was iOS. The name is a mix of two Latin words, nihil meaning «nothing» and umbra meaning «darkness.» \n\n###Plot \nThe main character, Born, is a black creature soaring above the ground. He was born in absolute emptiness; his goal is to get out of it. Multiple enemies can’t be defeated; the player can only avoid them. \n\n###Gameplay \nNihinlumbra is a classic platform game, so the gameplay includes jumping between hanging platforms and avoiding blocks. During the game, Born explores five different worlds: the Frozen Cliffs, the Living Forest, the Ash Desert, the Volcano, and the City. New platform versions offer alternative control methods. \n\n###Key feature \nThe main feature is the ability to color surroundings. Each level implies getting a new color that can modify the setting.\nThe blue color makes surfaces slippery; the green color lets Born bounce, the brown makes the characters slower when they walk on it; the red burns the monsters, and the yellow conducts electricity. The graphics are performed in dark colors. Monsters are the same color as Born, black, and each of them is deadly. Quiet sound effects support the game.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"BeautiFun Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":375279,"name":"Little Big Workshop","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd9/dd93dd2cd953720ed42d4510cd171302.jpg","description":"Imagine a magical factory, appearing right in your living room. A carefully planned masterpiece, where diligent workers throw together anything customers want. Rubber ducks and dressers, drones and electric guitars, scooters and other wonderful goods can be created from many different materials and sold for hard cash – cash you invest right back into your factory to get more machines, more workers and grow your business. In Little Big Workshop you become a factory tycoon!\nReal factories - made FUNYou are the Big Boss and it’s time to take charge of your very own tabletop factory. Organize the factory floor, manage your workers, purchase machinery, and design efficient production lines - all within the time-limit and to your client's satisfaction!\nAn open-ended sandbox-experienceTake it easy, it’s a sandbox-experience where you think, ponder and poke at things until you get it to work the way you’d like. Supply products to clients and an ever-changing market, as you produce over 50 unique product types, built from multiple parts and pieces - all of which can be created with different materials and production methods. No two factories should ever look the same.\nTiny hands, big dreamsStart out with just a small workshop and expand to a desk-filling factory. Unlock ever fancier machines, add even more production methods, and most of all, more room. Soon enough you’ll be running multiple production lines, producing hundreds of advanced products each day, and watching with joy as your cute workers do the actual work.Features:Varying industries and a wide range of products\nFocus on practical problems, not on values, economics, or logistics\nOrganize all steps of the production on a blueprint\nFactories grow as you unlock more desk space\nFully simulated Day/Night-cycle\nTake care of your workers! Work them too hard and they drop like flies\nCute model-town art-style","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mirage Game Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":14105,"name":"Sakura Spirit","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49d/49dd1acb774d1d182e90b667d61b7155.jpg","description":"Sakura Spirit is an ecchi visual novel with a high focus on linearity — it has second to none choices unlike the standard game of that genre. The game is produced outside of Japan and targeted Western audiences thus the corresponding pop-culture references and post-modern jokes.\n\n###Gameplay\nAs always in visual novels, a player scrolls the image with the text in the bottom of the screen and reads the game's plot like he would read a novel. Namely, visual novels feature branching paths and multiple endings, depending on a player's choices, but Sakura Spirit presents one with the images as he clicks by them. One choice is available at the very end of the narrative which does not affect anything.\n\n###Plot\nWe follow the protagonist called Gushiken Takahiro. He is a powerful Judo fighter who must protect the integrity of Japanese Judo by performing at the martial arts competition. Following the recommendation of his surroundings to pray in the local temple, Gushiken finds himself in another dimensions and time — the prayer transported him in times of feudal Japan dwelled with fox-girls. It is the example of fan service as fox ears and tails exploit the fox fetish within the players. As the fox ladies are currently in a confrontation with people (and foxes are spirits), our hero's quest is centered around bringing peace to both races.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Winged Cloud","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4193,"name":"Planets Under Attack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/292/2926e2e90b4bdc4333b3c4ad79917d6c.jpg","description":"Planets Under Attack is a space-themed strategy game.  \n \n###Gameplay \nThe main single-player mode in the game is a campaign that consists of many missions. The goal of most missions is to capture and develop certain planets on the game map.\nTo do so, you control your spacecraft fleet. Captured planets are not only strategically essential points and means to complete the mission, but they also produce Sollars — the primary currency in the game. You need Sollars for most of the actions that you can do in the game including upgrading your spaceships, planets, or even moving and dispatching your units. While conquering neutral planets is usually no hard task, you continuously encounter opposing forces (AI in single-player or other players in multiplayer) that also try to take over the planets and destroy your forces. The battles occur automatically, so the game’s primary challenge is in proper management and your fleet arrangement. There are several races available in the game, each of which has unique properties. After the end of each match, the fraction you chose would gain points that can be exchanged for ‘techs’ which give you passive upgrades such fleet strength or decreased time to upgrade planets. There are also three difficulty settings, ranging from easy to hard.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":3675,"name":"PixelJunk Shooter Ultimate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf4/cf48c1e7b9d83a3b256b6b137e7b19e5.jpg","description":"PixelJunk Shooter Ultimate edition includes PixelJunk Shooter and PixelJunk Shooter 2. Corresponding to the PixelJunk series, Ultimate covers the forth and the fifth parts of the franchise, consisting of 10 titles overall. \n\n###Remastered version\nThe refreshed version brings out the new mode of the same name: Ultimate, which changes design style of the game. The players can choose between Classic and Ultimate. It is also known that now progress can be transferred between the two parts of the original series and the lighting and fluid physics have been modified. \n\n ###Gameplay\nThe title is a top-down twin-stick shooter with a focus on the exploring the planets'  landscapes and fighting the other explorers. The goal of every level is to find and save trapped scientists out of pits and grooves in the rock. Among the instruments of achieving this goal one may find a wide variety of guns, used to fight enemies and destroy some rocks; as well as fluid controlling abilities of the ship — it can transfer water, magma, and ferrofluid. There is a total of 30 levels (15 in every game) divided into six stages each one of which ends with a boss fight.\n\n ###Online\nThe game yields the second part's multiplayer — any owner of the Ultimate edition may participate in The League Battle matches, which utilize the Capture-The-Flag mechanics and force all players to defend their territory.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Eleven","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":37357,"name":"Marvel Ultimate Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3c8/3c872330c4e9966a5a06c1371525e760.jpg","description":"The Games on Demand version supports English and Italian.  Marvel: Ultimate Alliance lets players create their ultimate team from the largest superhero alliance ever as they engage in an epic quest to determine the fate of the Marvel universe.  Players can control their own completely unique team by selecting from the largest roster of legendary superheroes ever assembled in one game.  Through the epic campaign, the heroes will battle, team-up, and interact with over 140 characters from the Marvel universe and ultimately confront notorious villains. • Use a universal team upgrade system to balance your heroes' powers, or customize each member to maximize their effectiveness.  • In addition to engaging in the epic single-player storyline, you can converge in battle, online or offline, against the world's most evil Super Villains. Switch between cooperative and competitive mode to partner or challenge up to three other players.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Raven Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 4"}]},{"id":16825,"name":"Blocks That Matter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b5/7b504019a81ba84711323fb758729925.jpg","description":"Blocks That Matter is an isometric indie platformer game developed by Swing Swing Submarine.\n\n###Gameplay\nYou play as a robot named Tetrobot. It can drill blocks, recycle them, and produce new blocks of different matter. Every matter has its own behavior and features. Tetrobot can also destroy lines of eight blocks just like in Tetris. \n\nThere are special blocks scattered around the game's story mode levels that cannot be drilled or recycled. Hence why the game is called Blocks That Matter. The only purpose of such blocks is to unlock bonus levels. Each block serves as a pop culture reference to games as Portal or even a Rubik's cube. Such special blocks can be found either on the levels or hidden in random treasure chests.\n\nThe game features 40 levels in its adventure mode and 20 more bonus levels. Every bonus level resembles a game with blocks in it, for example, Portal and its Weighted Companion Cube. Apart from that, the game is bundled with a level editor which allows for creating new levels and sharing them with the community.\n\nThe game is heavily influenced by Minecraft and Tetris, which can be seen while playing through any level. The block mechanics heavily resemble the same in Minecraft. In some levels, the developers use Minecraft-styled blocks of mud, ores, and resources.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Swing Swing Submarine","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12955,"name":"RIVE: Wreck, Hack, Die, Retry!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4e/b4ec455e41034de0dcc6f582ba01d529.jpg","description":"RIVE is the metal wrecking, robot hacking shooter you've been waiting for! This 360-degree shooter/platformer hybrid lets you choreograph a ‘dance of destruction’ in insanely spectacular battles and set-pieces. RIVE feels like the explosive games of yore, pumping megapixels in true 21st century style.\nEndless variety: fight on land, underwater, in zero gravity or on a moving train!\nGather hacks and control your enemies.\nUpgrade your spider tank's special attacks, armor and loot magnet.\nA 6+ hour campaign, voiced by Mark Dodson (Star Wars & Gremlins).\nA deep story featuring our hero Roughshot, robot butlers, space loot and... clean teeth.\nProve your mettle in the extra Speedrun and Single-Credit modes.\nDozens of on-line leaderboards to compete in.\nKeep playing with the daily Challenges and infinite Battle Arenas.About hacking:Ever dreamed of controlling your enemies? In RIVE you can. Find the hacks and get those gun turrets, nurse drones and irritable smashbots on your side. Or kickstart and hitch a ride on top of a bullet train!About the story:When space scavenger Roughshot gets trapped on a mysterious starship, he has to form a surprising alliance. Don't care about the story? Just shoot the messenger. Literally.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Two Tribes","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":59248,"name":"Shadow of the Colossus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ea/8ea1e2850d7568bc9733d546c0ac6ce1.jpg","description":"(Also known as \"Wanda and the Colossus\" or \"Wanda to Kyozou\" in Japan) In Shadow of the Colossus, players take the role of a young man seeking the truth of an ancient tale of power hidden in a mystical land. Shadow of the Colossus is a majestic journey through ancient lands to seek out and destroy gigantic mythical beasts. With a trusty horse at your side, players explore the spacious lands and unearth each Colossi. The uneasy task of defeating a Colossus relies on intelligent puzzle solving and action oriented gameplay. Armed with strong wits, a mystical sword and a sturdy bow, players use cunning and strategy to topple each behemoth.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Team Ico","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":24030,"name":"Super Mario Bros. 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f8/8f848239e24815506ff20eab31c6d6a9.jpg","description":"Remember when no one had ever heard of a Tanooki Suit or knew that\nBowser had a clan of Koopalings? The game that made these things common\nknowledge is also considered by many to be one of the best ever made.\nBowser and the Koopalings are causing chaos yet again, but this time\nthey’re going beyond the Mushroom Kingdom into the seven worlds that\nneighbor it. Now Mario and Luigi must battle new enemies, returning\nfavorites, and a new Koopaling in each unique and distinctive world on\ntheir way to ultimately taking on Bowser himself. Lucky for the\nbrothers, they have more power-ups available than ever before. Fly above\nthe action using the Super Leaf, swim faster by donning the Frog Suit,\nor defeat enemies using the Hammer Bros. Suit. Use the brand-new\noverworld map to take the chance to play a minigame in hopes of gaining\nextra lives or to find a Toad’s House where you can pick up additional\nitems. All this (and more) combines into one of gaming’s most well-known\nand beloved titles—are you ready to experience gaming bliss?\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Wii.","review":"","timePlayed":0.0,"releaseYear":1988,"developer":"Nintendo","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"SNES"},{"id":0,"name":"Nintendo Switch"}]},{"id":21320,"name":"QUAKE Mission Pack 2: Dissolution of Eternity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58da72d37b507d498de66e124c4e266d.jpg","description":"TWO NEW EPISODES. SIXTEEN NEW LEVELS. ONE WAY OUT.\nYour journey has led you down a path of no return. The acrid smell of death fills the air. And you know the road ahead may lead to your grave. But Quake, with his insidious, apocalyptic plans, must be crushed. If you fail, evil will shroud the universe for all eternity.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":16224,"name":"Iron Brigade","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/821/821382933bf3dd44a9c79a5ab04b5881.jpg","description":"Iron Brigade (formerly Trenched) is a third-person tower defense in the setting of the World War I.\n\n###Gameplay\nThe main \"hero\" of the action is Trench — thus the former name — which is a warrior-robotic creature defending the player's base from the upcoming waves of enemies with escalating difficulty. In contrary to the typical games of the genre, there is only one unit modifying itself according to the mission's needs. The trench is highly moveable — the placement can be changed to bent a course of the battle towards the victory. The broken machines can be repaired, and the goal of almost every level is to defend U.S.S. McKinley base.\nThe game does not feature any difficulty settings and playable in cooperative mode. After the primary campaign, there are survival missions available. \n\n###Plot\nThe game swiftly changes its settings from the absurd, dieselpunk variation of the World War I to the anti-Russian campaign set somewhere on Mars with no storyline tying these events whatsoever. The mission giveaway is monotonous, and the whole story centers around the scheme including fighting with the mobs, fighting with the boss of the location, walking down to the headquarters and acquiring new quest with the seemingly little bonds to the previous one — the scheme repeats itself until the end of the story.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Double Fine Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":558984,"name":"Knockout City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/295/295cb3ba936e0c851c326c491b00b978.jpg","description":"Throw, catch, pass, dodge, and tackle your way to glory!\n\"COMING SOON: Team up and duke it out with rival Crews in Knockout City™, where you settle the score with EPIC DODGEBALL BATTLES. Brace yourself for outrageous fun and intense competition in an all-new take on team-based multiplayer games. \n\nCustomize your character and form a Crew with friends to start your Knockout City takeover. Knock out opponents with trick shots and coordinated teamwork while dodging and catching balls flying across the map. No ball? No problem! You can literally ball up, roll into a teammate’s hands, and become the ultimate weapon! \nA variety of outlandish ball types, locations, and game modes keep it exciting. Plus, each season introduces new maps, ball types, rewards, events, and challenges! Throw, catch, pass, dodge, and tackle your way to dodgeball dominance!\n \n\nKEY FEATURES:\n\nFrantic and Fun — Rule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls, or “balling up” at any time to get thrown by teammates! \n\nCrew Up — Assemble an All-Star dodgeball Crew with your friends for multiplayer matches in a seamless cross-play experience! Together, knock out opponents in 3v3, 4v4, or free-for-all matches. Pass, throw, and strategize to dominate as a team and unlock distinctive, Crew-only rewards! \nDefine Your Style — Show off your status and unique look through character and Crew designs with expansive character creation options. Customize your appearance, gear, and attitude, from body type and hairstyle to a custom glider and Crew vehicle to win, lose, and taunt animations. \nTake On Knockout City — Battle it out with other Crews across dynamic maps all over the city. Each map’s special features make every match an intense, unexpected experience. Dodgeball thrives in back alleys with pneumatic tubes, on skyscraper rooftops, across busy streets—and even at the local burger joint and construction sites. While you’re dodging dodgeballs, watch out for moving cars, rooftop drops, and even a wrecking ball or two. \nStrikingly Fresh Yet Familiar — It’s easy to pick up and play thanks to familiar controls, but practice is key to becoming a champion. On a level playing field, only the most skilled ballers stand out from the crowd. Use your knowledge to master the intricacies of the game for spectacular KOs.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Velan studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":424978,"name":"Signalis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/480/480295ba922318bb052d169174ec88aa.jpg","description":"A classic survival horror experience with a unique aesthetic, full of melancholic mystery. Investigate a dark secret, solve puzzles, fight off nightmarish creatures and navigate dystopian, surreal retrotech worlds as Elster, a technician Replika searching for her lost dreams.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"rose-engine","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":9980,"name":"Emily is Away Too","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61a/61a8dcc362c81ee2101f987b49f8397b.jpg","description":"Browse Emily Onlinehttp://emilyisaway.com/online/\nSurf the web like it's 2006!New Emily, New ChoicesEmily is Away Too is the spiritual successor to the critically acclaimed original. Message both Emily and Evelyn as you determine the outcome of your senior year. Extend the story past the chat window with youtube links, facebook profiles and file transfers. And most importantly, change your text color to lime green so everyone knows you're the coolest kid in school.Features Multiple endings triggered by your dialogue decisions.\nBuddy icons, customizable profiles and away messages.\nIndependent IM conversations with branching paths.\nYoutube links, facebook profiles and even file transfers.\nAn interface you thought you'd never use again!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kyle Seeley","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":295123,"name":"Sigma Theory: Global Cold War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9df/9df4944fa944e49b67b21c36aba624ae.jpg","description":"STORYFrom the creators of the award-winning sci-fi game Out There...\nIn the near future, a paradigm-shifting scientific discovery looms over the world, promising radical new technologies. The world’s superpowers realize they could have the power to destroy the global financial system, wipe out entire countries or even gain access to immortality.\nHowever, this discovery — called “The Sigma Theory” — can only be harnessed by a handful of scientists. You are placed at the head of your country’s Sigma division. Your objective is to ensure that it is your nation that reaps the benefits of Sigma Theory before anyone else.\nTo achieve this you will have powerful resources at your disposal: a cadre of the world’s most elite covert agents, advanced tactical drones and, of course, your own skills in diplomacy and subterfuge.\nIt’s a cold war out there, one in which mankind must face up to its future.\nFEATURESA bold new take on the espionage game genre, set during a future global cold war\nRecruit your team from 50 unique spies and field agents\nTurn-based strategical and tactical-level gameplay\nOrder your spies to conduct operations all over the world\nExperience tense and thrilling exfiltration missions where you guide your agents on a covert operation to extract high-value targets from foreign cities\nInfiltrate the enemy’s Sigma programs, abducting, coercing, and seducing scientists to your side\nDeploy your drone fleet to turn operations in your favor\nDeceive or cooperate with your rivals during diplomatic summits\nUse your diplomatic skill to balance the demands of multiple relationships: with your agents, with your superiors, with powerful private lobbies, and with your counterparts around the world\nDiscover 30 world-changing technologies\nHoard Sigma Theory discoveries for yourself to gain an edge in the cold war — or share them for the benefit of all mankind — or sell them to powerful private lobbies bent on preserving the old world order\nExperience a dynamic emergent narrative where every decision matters and the complex web of character relationships means that no two games of Sigma Theory will ever be the same\nMultiple distinct endings that respond to the player’s ethical and practical decisions throughout the game Games that inspired us: XCom, Phantom Doctrine, Plague Inc, Pandemic, Rocket Ranger and so much more","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Plug In Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17211,"name":"RPG Maker XP","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79f/79f119c39a88aa86acd2d79ff7736deb.jpg","description":"RPG MAKER lets you create an original role-playing game without any prior specialized knowledge or training. RPG MAKER XP is full of the functions you've been asking for, including game data encryption and a scripting feature that lets you change the very heart of the RPG MAKER engine.\nBy improving the operating environment, the program can now provide support for a full-colour display and greatly enhanced graphic capabilities. With support for PNG full-color mode and alpha channel, you can adjust the settings for graphic translucency as well as specify the transparent color. RPG Maker XP includes three map layers, allowing you to create complex and layered maps. The program includes a base set of graphics and sounds that you can use and modify at no extra charge. You can also import your own graphics and sounds, making your game truly stand out.\nRPG MAKER XP is equipped with the Ruby Game Scripting System (RGSS1), based on the Ruby language and customized especially for this program. Though mastering RGSS may take some time, it is a powerful tool in fully customizing your game. You can use RGSS to change how your game looks, feels, sounds and plays. If programming is just not your forte, you can turn to a wide variety of user-created scripts that's shared within the RPG Maker community.\nRPG MAKER XP is perfect for beginners and experts alike.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"KADOKAWA","platforms":[{"id":0,"name":"PC"}]},{"id":662316,"name":"Marvel's Spider-Man 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ae/7ae5a14cdb4ab222a134c15f4629e430.jpg","description":"Marvel’s Spider-Man 2 is the next game in PlayStation’s critically acclaimed Marvel’s Spider-Man franchise. Developed by Insomniac Games in collaboration with Marvel Games and PlayStation for the PS5 console.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":720,"name":"The Dwarves","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b28/b282fa7ef64389369121ffb7dccd0478.jpg","description":"The Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages and many more foes, to give them the low-down.\nBased on the bestselling novel “The Dwarves” by Markus Heitz you’ll experience a fascinating tale revolving around the coolest fantasy race ever: The Dwarves!\nTactical real-time battles: You’re fighting hundreds of foes with just a handfull of heroes. You can pause anytime to tactically plan the next smart move.\n\nCrowd Combat: All creatures on the battlefield are rendered with physical complexity – that’s why the battles feel especially dynamic and “real”, and enabling a lot of tactical finesse.\n\nCaptivating story: Join the dwarf Tungdil on his adventurous journey across Girdlegard.\n\nExplore the world: Uncover secrets, learn more about the game world and its inhabitants, and solve optional puzzles.\n\nDelve into the world map: Girdlegard ranges from snow-covered summits to shimmering deserts. You can move freely on the world map, meet numerous characters, and experience adventures. But beware: A lot of your actions on the world map have far-reaching consequences!\nDwarves! Finally the coolest fantasy people are in the spotlight. The NPC days of the bearded axe-wielders are over – the age of the dwarves has come!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":362860,"name":"Cook, Serve, Delicious! 3?!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35e/35e1203fe6afac4e805dafcbf890f638.jpg","description":"Hit the road in this massive sequel to the million-selling Cook, Serve, Delicious! series as you travel across the United States to participate in the Iron Cook National Foodtruck Championships with your trusty robot crew Whisk (voiced by @negaoryx) and Cleaver (voiced by @havanarama).\nSet in the radically-changed war-torn America of 2042, play through an all new story-driven campaign where you cook hundreds of foods—including many brand new to the series—across hundreds of levels in a new gameplay structure that has been completely redesigned to deliver fast-paced action, or take it easy with the all new Zen Campaign that can be toggled on or off at any time!\nPlay through the campaign via single player or with a friend in local co-op (with the ability to change on the fly), upgrade your food truck with dozens of gameplay-affecting modules, expand your food catalog, and race to the nation’s new capital in Nashville, Tennessee, to prove once and for all that you’re still the best chef in the world.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Vertigo Gaming","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16943,"name":"Megabyte Punch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf2/cf2947af6c3ef3793b5c3d5c686ca785.jpg","description":"In Megabyte Punch, the player controls a robot who fights fellow robots for spare parts. It combines elements from various genres, such as beat'em up and platformers.\n\n###Plot\nThe main protagonist is an unnamed robotic creature that lives in a colorful world of robots. The character tries to defend its village from enemies from such factions as Valk Empire and Khoteps. Its goal is to beat multiple robots to reach the enemy leaders and defeat them.\n\n###Gameplay\nThe game is a side-scroller, in which the player leads his or her robot through levels and fights enemies. The protagonist has two types of attacks, one is basic, and the other is special. There are six zones, or \"worlds\" in Megabyte Punch, each divided into three levels. Curiously, the local robots realize that they live in the game's levels and refer to them as such. Each world ends with a boss fight. \n\nThe protagonist's home village serves as a hub. It allows the player to explore the worlds in any order, as well as to buy and use upgrades. The village is also where the character respawns after dying. \n\n###Upgrades\nDefeating powerful enemies grants the protagonist spare parts to upgrade itself. The player is free to customize his or her robot. Some additions improve the character's existing skills, while others give it new options, such as different types of attack. For example, the player can equip his or her robot with additional weapons, such as a gun or a hammer, or enhance its jumps with a rocket booster. The player can save and load the upgrade schemes.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Team Reptile","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]