[{"id":3829,"name":"Ys: Memories of Celceta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5dc/5dc58d9e42bb80411ade0dedc2bc73bf.jpeg","description":"In Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within an all-new tale of conspiracy, deception and mystery. Featuring an updated version of the party-based battle system from Ys Seven, as well as the largest and most varied overworld in series history, Ys: Memories of Celceta brings a greater sense of adventure to the Ys universe than has ever been seen before.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":555,"name":"Onigiri","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c10/c100f84cb626cbc20752dc7a01c5934b.jpg","description":"Onigiri is an MMO Action RPG with a fast weapon changing battle system.\nJoin a party of other players or travel with 8 NPC companions on your journey.\nWith simple controls, you can dive into the thrilling world of Onigiri.\nSwitch between weapons to battle through the Youkai.\nIn a Japan filled with spirits and monsters, ages ago, the land itself was rocked by chaos. From the depths rose the terrible Kamigui who carved a path of destruction  through all.\nThe gods and people struggled for a century. At last, Amaterasu Oomikami, goddess of the Sun, placed three great Seals forcing the Kamigui away and returning peace once again.\nTime has passed, and now, one of the great Seals has shattered. A dark force arises once more. On the far western island of Onigashima, fate brings together a young woman and a child of the Oni. The journey of destiny begins now!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"CyberStep","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":714895,"name":"MSM: The Lost Landscapes","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/860/8608c88ef7f5a9c79fd10645d052b673.jpg","description":"This is a fan-game about My singing Monsters franchise. The game is not endorsed by Big Blue Bubble. Just a fun little project made by a small team.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Raw Zebra","platforms":[{"id":0,"name":"PC"}]},{"id":53205,"name":"Zelda II: The Adventure of Link","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2dc/2dcc5b76de63a99799364f962334525f.jpg","description":"Zelda II: The Adventure of Link is an action role-playing video game with platforming elements. The second installment in The Legend of Zelda series, it was developed and published by Nintendo for the Family Computer Disk System on January 14, 1987, less than a year after the original The Legend of Zelda was released and seven months before North America saw the release of the first Zelda title. The game was released in North America and the PAL region for the Nintendo Entertainment System in late 1988, almost two years after its initial release in Japan.\nThe Adventure of Link is a direct sequel to the original The Legend of Zelda, again involving the protagonist, Link, on a quest to save Princess Zelda, who has fallen under a sleeping spell. The Adventure of Link's emphasis on side-scrolling and role-playing elements, however, was a significant departure from its predecessor. As of 2016, the game remains the only technical sequel to the original title, as all other entries in the series either are prequels or take place in an alternative reality, according to the official Zelda timeline.\nThe game was a critical and financial success, and introduced elements such as Link's \"magic meter\" and the Dark Link character that would become commonplace in future Zelda games, although the role-playing elements, such as experience points, and the platform-style side-scrolling and limited lives have not been used since in canonical games. The Adventure of Link was followed by The Legend of Zelda: A Link to the Past for the Super Nintendo Entertainment System in 1992.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Nintendo","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"GameCube"}]},{"id":43759,"name":"WWE 2K18","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a18/a18daad4b311469be94e4269bead454d.jpg","description":"Pre-Purchase OfferPre-Order WWE 2K18 and receive two playable versions of WWE Hall of Famer Kurt Angle: his WWE “American Hero” persona (2001) or his ECW “Wrestling Machine” persona (2006).\nDigital Deluxe Edition\nThe biggest video game franchise in WWE history is back with WWE 2K18!  The Deluxe Edition grants access to the WWE 2K18 Season Pass, MyPlayer Kick Start, Accelerator, two playable versions of Kurt Angle, Cena (Nuff) content and more!\nAfter more than a decade-long hiatus, your Olympic Hero has returned! Receive two playable versions of WWE Hall of Fame Class of 2017 inductee Kurt Angle!  Play as his WWE “American Hero” persona (2001) or as his ECW “Wrestling Machine” persona (2006).\nCelebrate the 15th anniversary of one of the most beloved, and divisive WWE Superstars in history with exclusive digital content!  Play as two of John Cena’s fiercest rivals over his career, Rob Van Dam and Batista!  You also receive two versions of John Cena (2001 & 2006)!\nAbout the GameThe biggest video game franchise in WWE history is back with WWE 2K18!  Featuring cover Superstar Seth Rollins, WWE 2K18 promises to bring you closer to the ring than ever before with hard-hitting action, stunning graphics, drama, excitement, new game modes, additional match types, deep creation capabilities, and everything you’ve come to love from WWE 2K. Be Like No One.Most Realistic WWE Video Game Ever!The most realistic WWE video game experience just became more intense with the addition of eight man matches, a new grapple carry system, new weight detection, thousands of new animations and a massive backstage area. A brand-new rendering engine also gives WWE 2K18 a visual overhaul and will bring the drama of WWE to life like never before!MyCAREERA new MyCAREER experience puts you on the path to greatness as you journey along on the road to WrestleMania.  Explore WWE like never before through free-roaming, conversing with WWE Superstars, forming alliances, making enemies, seeking out quests, and strategizing for upcoming matches.Road to GloryCan your MyPlayer make it to the WWE Hall of Fame?  Introducing the all-new Road to Glory! Compete with opponents online to improve your MyPlayer by earning unlockables, boosts and upgrades all while securing your entry into Special Events that are held alongside real-life WWE special events, such as pay-per-views.Dynamic Creation Suite Customize WWE like never before with an even deeper set of customization tools and the new Custom Match option! The robust Creation Suite also offers even more detailed features for Create-a-Superstar, Create-a-Video and Create-an-Arena.Seriously, THE BIGGEST ROSTER EVER!Dominate the ring with TONS of your favorite WWE, NXT and legendary Superstars! We’re not kidding, WWE 2K18 offers the most complete roster of the biggest and brightest WWE Superstars to ever grace a WWE ring!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"2K","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":22796,"name":"Icewind Dale 2 Complete","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40c/40c962ea4d9cba93d083043dfe19c152.jpg","description":"The worst fear of the civilized realms has come true. The Goblinoids have united into an army of outcasts and misfits and they want to claim the Ten Towns for themselves. Massive swarms of Orcs and Worg-mounted Goblins are attempting to overrun the town of Targos, and that's just the beginning! A call has gone out to all those willing to face insurmountable odds in defense of the Ten Towns. Will you heed the call to arms and face the greatest threat to the Spine of the World?Includes the original Icewind Dale II and the Adventure Pack\nAn interesting story and well-designed quests that will test both your cunning and your tactical acumen.\nHundreds of unique magical items, from swords to talismans, each with its own, detailed description.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18874,"name":"Fly O'Clock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48f/48f6063b197d5614c4e28c82ae3751f6.jpg","description":"Fly O’Clock is tiny, highly-addictive single & online multiplayer arcade endless jumper with innovative one-touch mechanics and unique pixel-art graphics.\nThe faster you play the more you risk and as you know: no risk no fun.\nCheck how long you will survive on the clock face, avoid the clock hands and jump between 4 points as fast as you can to reach the top of the leaderboards.\nUnlock all the characters, watches and hats! Style your favorite insect with unique hat!\n- online multiplayer exclusively on Steam\n- 16+ characters to unlock\n- 5+ watches to jump on\n- 15+ hats to try on\n- ultimate Rock & Roll soundtrack!\n- one-touch controls\n- brand new jumpy gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digital Melody","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18270,"name":"Zombie Bowl-o-Rama","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/afc/afc91348e19e088624677578845aeef0.jpg","description":"Bowl or Beware!\nFrom the depths of the graveyard…a gruesome gang in search of brains!  When Zombies show up at the town’s lanes, it’s up to you to put ‘em back in the ground!\nThe Zombies have taken over your favorite lanes, and it’s up to you to send ‘em back to the graveyard where they belong! Select a colorful character to take on the attacking Zombies with your favorite ball and a few tricks and treats. Give a whole new meaning to Zombie strike when you set ‘em up and take ‘em down with cool power ups and tricky obstacles.\nSix screamy lanes to battle your way through to the big Showdown!\n10 terrifying balls and 1 Zombie head to choose from\nCrafty  tricks to throw those Zombies for a loop: Werewolves, MiniCorpses, Buzz Saw and Dance Fever\nDelectable treats to help you knock ‘em dead: ZombieNator, Meatball, ZomBees and Brain Balls\nZombies advance if you miss them the first time, so get your aim on!\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":17933,"name":"Doorways: The Underworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52a/52a99a5c4b365a75bea1ed872d5042c1.jpg","description":"Doorways: The Underworld is a first person horror adventure, featuring a complex story and deep atmosphere. It will challenge you with its fast-paced gameplay and breathtaking visuals and sounds, so prepare to immerse yourself in a terrifying psychological experience.\nThe Underworld is the third chapter of Doorways. It is not necessary to have the first chapters in order to play this game. But we recommend to do so for a better understand of the story.\nYou're playing as Thomas Foster, a special agent who must track a missing psychopath. Who is she? What is this place and how did you get here?\nThese are just some of the questions that you must answer during your journey...Key Features\nHorrifying exploration adventure with an immersive atmosphere\nIngenious puzzles as well as challenges that put your reflexes at test\nInspired voice acting by Sam A. Mowry (the voice of Alexander in Amnesia: The Dark Descent)\nReplayability through many secret places\nFull Controller supportNative Oculus Rift support\n----\nDoorways is an episodic game, it's divided in three parts and they can be played separately:\nDoorways: Prelude (Chapter 1 & 2):\nhttp://store.steampowered.com/app/248470/\nDoorways: The Underworld (Chapter 3):\nhttp://store.steampowered.com/app/311250/\nDoorways: Holy Mountains of Flesh (Chapter 4):\nhttp://store.steampowered.com/app/383930/\n----\nIMPORTANT\nAchievements do not work on Linux","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Saibot Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17140,"name":"Blake Stone: Aliens of Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51a/51afb241fb8a34907807a1f26d9ba48a.jpg","description":"You're pitted against Dr. Pyrus Goldfire. He's found a way to replicate pure gold, which he's using to fund his maniacal plan. Goldfire has built six highly-secure, futuristic locations where his creations are being hatched. It's up to you to penetrate his security and stop him at all costs.\n\"Blake Stone...isn't simply Son of Wolfenstein...it's a wish list fulfilled, enhancing the Wolfenstein canon with many sensible tweaks and some new tricks that'll make your jaw drop.\" - Electronic EntertainmentFeatures\nBreak and Take: Crates can be blown apart to reveal weapons and other goodies, such as gold, money, food and ammo.\nBreak a leg. Theirs.: Over 20 unique and adaptive actors, including guards, aliens, mutants and pods.\nInside Intel: Interactive informants give you clues and hints.\nFuture Soldier: Five futuristic weapons - from a silent shotgun to an explosive grenade launcher.\nSee Earth: A stagerring 66 levels, including two secret levels per episode.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Saffire","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17031,"name":"YOU DON'T KNOW JACK SPORTS","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3bd/3bd93c7ee69332279fa3f0e1d417fde9.jpg","description":"Sports nuts, this one’s for you. The classic YDKJ Sports pack is back, featuring sporty host Guy Towers!\nThink you know everything about football, basketball, baseball, or hockey? How about tennis, volleyball, golf, or lawn darts? Then light up the scoreboard with YOU DON’T KNOW JACK Sports – it’s YDKJ all hopped up on 'roids! So put in your mouthguard, adjust your cup, and get ready. Play ball… er, trivia!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":15436,"name":"King's Quest Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf5/cf5e6a64222a0887d41964f86b849b36.jpg","description":"Seven classic games in one collection.  Celebrate the golden age of adventure games all over again with the return of King's Quest.\nThe bravest knight in all of Daventry, Sir Graham, is appointed by the dying king to embark on a Quest for the Crown. By retrieving the three treasures of Daventry, he will not only save the land but become its king.\nNow the ruler of Daventry, King Graham sees a vision of a beautiful woman trapped in a tower. Romancing the Throne won't be easy with mermen and vampires separating him from his imprisoned bride.\nA young apprentice to an evil wizard must escape his captor or be faced with certain death. Upon the discovery that he is the long-lost son of the royal family, young prince Alexander learns that To Heir is Human.\nKing Graham lies on the brink of death and only a magical fruit from a far off land can heal him. The Perils of Rosella pit evil fairies and fearsome foes against the brave princess as she fights to save her father.\nReturning home one day to find the castle missing, King Graham must don his famous adventurer's cap once more to find his family. Absence Makes the Heart Go Yonder and Graham must learn a little magic of his own to rescue his loved ones from an evil spell.\nHaunted by the memory of the kidnapped princess who helped his family escape the malevolent wizard Mordack, Alexander learns of a plot to force the beautiful Cassima to marry an evil Vizier. Sworn to protect the woman who saved his life, Alexander takes to the Green Isles in Heir Today, Gone Tomorrow.\nRebellious Rosella is content to be The Princeless Bride, but her adventurous spirit may lead to a marriage to the King of the Trolls. With the help of her mother, Queen Valanice, Rosella must end a plot to destroy the land of Eldritch and find her own happy ending.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":14813,"name":"Gunmetal Arcadia Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e4/0e48cca3ccf664372db1a9a52d5fc02e.jpg","description":"Unrest brews in the city of Arcadia, and a monstrous enemy approaches. As the young elf Vireo, you will heed the call of adventure: choose a weapon, choose a side, and rise to be the hero your city needs. Gunmetal Arcadia Zero features classic platformer action and world-class CRT simulation technology that evokes the aesthetics of past generations.\nFrom developer J. Kyle Pittman (Super Win the Game) and Minor Key Games (Slayer Shock) comes Gunmetal Arcadia Zero, an all-new action-adventure platformer drenched in glowing retro goodness.\nUse blades, bombs, and a bevy of subweapons\nVisit NPCs, buy and sell gear, and learn the lore of Arcadia\nFight your way through six stages jam-packed with baddies and bosses\nExquisite game feel — that's a thing!\nNEW!! Speedrun mode tracks splits and records best times\nWorld-class CRT simulation\nFully customizable\nNEW!! Now with editable preset slotsAuthentic 8-bit soundtrack\nOver 40 minutes of original music","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Minor Key Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1723,"name":"Hyper Void","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e08/e0844f379d0fafa4b3981dfb4ae51ec4.jpg","description":"Hyper Void is a 3rd-person space-shooter 1-player arcade game that uniquely takes place right inside intergalactic wormholes!\nGameplay is fast-paced and challenging, with many skills required to get through the wide variety of enemies and tough bosses. This is not a blind-shooting game; you will need to master your weapons and maneuvering skills to beat the challenge.Features29 unique levels.\nHyper Mode: Hyper difficulty but with a Hyper fighter to take on the Hyper challenge!\nDynamic psychedelic wormholes as well as deep breath-taking outer-space environments.\nNumerous unique enemies and bosses... lots of big bosses!\nShoot multiple weapons simultaneously and over-charge with a variety of power-ups.\nDifferent missions and challenges, including combat, races, traps and speed tunnels!\nSecret orbs to discover and achievements to unlock!\nNEW PC-exclusive Challenge mode. 3 never-ending levels: the longer you survive the higher you go on the leaderboards!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"IN|FRAMEZ TECHNOLOGY","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22374,"name":"Yonder: The Cloud Catcher Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abc/abc43ccc7f4647691356f8782823a59e.jpg","description":"Yonder is set on the vast island of Gemea, a lush frontier with eight distinct environments ranging from tropical beaches to snow-capped summits. Each location has its own flora and fauna, along with changing seasons and a day-night cycle.  Gemea, once a paradise, still maintains the appearance of one, yet an evil murk has enshrouded the land and its people in despair.\nAs the hero you will explore Gemea, uncovering the island's secrets and the mysteries within yourself as you embark on a journey of self-discovery. On a quest to become the island’s champion, you join forces with Sprites, creatures who are the only thing capable of dispersing the murk, to save Gemea and its people.\nThe towns of Gemea are filled with kind-hearted residents who have faced many difficulties since the murk arrived. By contributing to the island through farming, crafting, cooking, fishing and brewing, relationships can be built with the locals, who offer everything from resources to a new farm as rewards.\nAt the heart of Yonder, is a game that delivers a sense of discovery, wrapped in a familiar yet unique adventure.Features:A vibrant open world full of things to discover and places to explore.\nSet your own pace; trail-blaze across the world or settle down for a spot of quiet fishing and farming.\nExtensive character customization.\nMaster professions like carpenter, chef, tailor and more to help the residents of Gemea.\nCraft and trade items to solve puzzles as you banish the murk from the island.\nBefriend and adopt endearing creatures.\nBuild and harvest multiple farms across 8 diverse biomes, ranging from grasslands through dense forest, Caribbean tropics and more.\nSet in a welcoming world you'll want to visit again and again\nMultiple creative routes to achieve objectives.\nA dynamic living world – seasonal changes affect routes, animals migrate, day/night and evolving weather conditions affect the world.\nSpend time doing what you want: fishing, farming, crafting, questing, picking up rocks.  It’s all up to you!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Prideful Sloth","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":17771,"name":"Bedlam","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14e/14e93e8599bc4489d688578dae0c74af.jpg","description":"BEDLAM - THE GENRE JUMPING SHOOTER\nBedlam is a unique FPS game based on a novel of the same name by cult Scottish author Christopher Brookmyre.\nPitched as a shooter for those who survived online gaming in the 80s and 90s, Bedlam takes a look through an iconic time in online gaming and serves up some authentic gaming nostalgia with up-to-date graphics and gaming features. Bedlam is set entirely in the first-person but will explore other game genres from a first-person perspective.\nIn the game you play Heather Quinn (aka Athena) a colleague of Ross Baker (aka Bedlam). Heather is an overworked and underpaid scientist developing medical technology for corporate giant Neurosphere. One rainy Monday morning Heather volunteers as a test candidate for the new Neurosphere brain scanning tech - anything to get out of the office for a few hours.\nBut when she gets out of the scanner she discovers she's not only escaped the office, but possibly escaped real life for good! Heather finds herself trapped in Starfire - the violent sci-fi game she spent her teenage years playing - with no explanation, no backup and, most terrifyingly, no way out!\nJoin us in Early Access and get ready to unleash BEDLAM.\nThe description below was written by Christopher Brookmyre for the release of the novel in 2013\nHeaven is a prison. Hell is a playground.\nWould it be your ultimate fantasy to enter the world of a video game?\nA realm where you don’t have to go to work or worry about your health; where you can look like a hero or a goddess; where you can fly space-ships, slay dragons, visit any period in history, any realm in fiction, yet all of it feels completely real. A realm where there are no consequences and no responsibilities, to the extent that even if you die, you can just respawn and start again.\nOr would it be your worst nightmare?\nTrapped in a place where every demon ever conjured by the human mind can be made flesh. Cut off from the real world, unable to see your family or friends ever again. Stuck in an endless state of war and chaos where the pain and fear feels real and from which not even death can offer an escape.\nPrison or playground. Heaven or hell.\nThis is where you find out\nCheck out the first hands on preview of Bedlam by Rock, Paper, Shotgun: http://www.rockpapershotgun.com/2014/07/25/bedlam-game/\nOne of the first Bedlam play thru's by Jim Sterling of The Escapist: https://www.youtube.com/watch?v=Jutpej9ZcyM\nAnd coverage about our female lead character Heather Quinn by BBC News: http://www.bbc.co.uk/news/uk-scotland-highlands-islands-27695235","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vision Games Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17396,"name":"Invisible Apartment","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/261/261a4c0362a7ce25d2461584d73074c2.jpg","description":"Cyberpunk Visual Novel about a girl hacker struggling in a modern World. The story revolves around surveillance, hacking, artificial intelligence, cybernetic implants and those who want to lead a normal life in a high-tech society.\nThis is a free part of a series which will comprise of at least another four parts. If you liked Invisible Apartment, than look out for the upcoming releases and feel free to follow us as we produce them on http://invisibleapartment.com\nIf you liked Invisible Apartment 1 and would like to get a continuation of the story, than don't miss out on Invisible Apartment 2 & 3\nhttp://store.steampowered.com/app/543220/\nhttp://store.steampowered.com/app/532060/\nand Invisible Apartment Zero\nhttp://store.steampowered.com/app/543230/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jeroen van Oosten","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16926,"name":"RACE Injection","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48b/48bbb630ff33d155cea17124d5c894b2.jpg","description":"RACE Injection is the final chapter in the RACE 07 series of games, ending the award winning series on a high note.\nRACE Injection contains 23 new unique car models and boasts 9 new tracks from across the globe. RACE Injection collects the most requested content in five distinct classes: Formula RaceRoom class, GT Power class, Retro – historic class and the official STCC and WTCC 2010 classes.\nThis full retail game which includes all that’s needed to get racing in anything from cool historic cars to the latest high-tech GT powerhouses, WTCC racers and even top of the line Formula cars. Injection is the full impact package that has it all.\nWith the release of RACE Injection, the Complete RACE series for PC now offers :\n38 unique car models in 13 distinct car classes with over 450 highly detailed car skins, ready to race on more than 31 tracks worldwide, supporting over 40 different track configurations.\nAll of these cars, classes and tracks can be mixed and matched to create unique and exciting championships and events. This should keep any fan busy for quite a while and ensure that the RACE series will stand as a landmark of the Authentic Racing genre for years to come.KEY FEATURES38 unique car models in 13 different classes\n31 tracks with additional layouts\nVarious real life championships including their accurate regulations\nMultiplayer, up to 25 AI or real players online\nGhost racing against your own lap time or against those of your friendsIncludes these RACE 07 expansions:\nSTCC The Game 2\nFormula RaceRoom\nGT Power Expansion\nRetro Pack\nWTCC 2010 Pack","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"SimBin Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10424,"name":"TumbleSeed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fb/7fb5fd2e70471f3e8e9421b1ee907fd2.jpg","description":"TumbleSeed is a deceptively deep roguelike about balancing a seed up a dangerous and ever-changing mountain.\nAvoid holes and defeat corrupted creatures in this dual-stick action adventure. Along your perilous trek you'll be forced to strategize, grow powerful with upgrades, and master the art of rolling to avoid the mountain's many dangers.\nTumbleSeed features 5 procedurally generated worlds and over 30 unique seed powers. Top your personal best or compete with the world in the daily challenge. The mountain holds many surprises, secrets, and adventures waiting to be explored — see you on the slopes!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Greg Wohlwend","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":619898,"name":"Warhammer 40,000: Chaos Gate - Daemonhunters","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/336/336e70370ffaba298628fb42a588988f.jpg","description":"Lead humanity’s greatest weapon, the Grey Knights, in this fast-paced turn-based tactical RPG. Root out and purge a galaxy-spanning plague in a cinematic, story-driven campaign, using the tactics and talents of your own personalised squad of Daemonhunters.\nForge Your Champions\nGrey Knights are humanity’s greatest weapon. A secretive yet supremely powerful chapter of Space Marines sworn to eradicate corruption, these legendary Daemonhunters are dedicated to combating the minions of Chaos. Lead your own personalised squad against a galaxy-wide plot to infect worlds with a cosmic plague, The Bloom.\nPlan Your Strategy\nMaster a turn-based tactical game full of satisfyingly strategic action. Choose powerful classes, wield incredible weapons, use environments to your advantage, and target specific enemy weak points to hinder the advance of an ever-evolving and mutating threat.\nEnter the 41st Millennium\nPenned by acclaimed Black Library author Aaron Dembski-Bowden, immerse yourself in a compelling story set in the grimdark universe of Warhammer 40,000. Meet famous faces, engage iconic foes, and discover what it takes to lead a squad of elite warriors battling to prevent galaxy-wide destruction in the 41st millennium.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Complex Games","platforms":[{"id":0,"name":"PC"}]},{"id":44460,"name":"Mega Man Legacy Collection 2 / ロックマン クラシックス コレクション 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d4/1d4f7299f285165baa0e21dc3746831f.jpg","description":"The Blue Bomber is back in this second collection of classic Capcom titles! Featuring faithful reproductions of Mega Man 7, 8, 9, & 10, this collection spans the iconic series' evolution and retro revolution. Take on the nefarious Dr. Wily and his diverse Robot Masters in these timeless 8-bit, 16-bit, and 32-bit adventures!\nMega Man Legacy Collection 2 is bursting with additional content, from time trials and remix challenges with online leaderboards, to a music player and an extensive gallery of rare illustrations. Also included are the additional modes originally released as DLC for Mega Man 9 and 10, featuring extra stages and playable characters. For anyone who wants a little extra help with these challenging classic platformers, you now have the option to reduce the amount of damage received.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":23763,"name":"Super Smash Bros. Wii U","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f2a/f2a2fc10c284cb7d6c3bff1d4e01da51.jpg","description":"WINNER: Best Fighting Game\n\n--The Game Awards 2014\n\nMario! Link! Samus! Pikachu! All of your favorite Nintendo characters\nare back, along with plenty of new faces, in Super Smash Bros. for Wii\nU, the next entry in the beloved Super Smash Bros. series. Up to four\nplayers can battle each other locally or online across beautifully\ndesigned stages inspired by classic Nintendo home console games. With a\nvariety of control options and amiibo compatibility, the timeless Super\nSmash Bros. battles come alive.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Wii U"}]},{"id":20320,"name":"The Wonderful End of the World","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/478/47813e848c621de8c2c0113239d33b70.jpg","description":"You can't save the whole world. It's going to be eaten by a mythological demon with the head of a fish. But as a puppet that absorbs all it touches, you can try to rescue as much of Earth's greatness as you can before the end arrives.\nIn the beginning, you roam the Earth, capable of absorbing only the tiniest of objects. A glass marble you collect becomes your head, and a pair of jellybeans becomes your hands. Small creatures overwhelm you, with rats kicking you around and golden retrievers threatening to stomp you to pieces. But with every object you collect, your puppet self grows larger. Eventually, you'll become a towering behemoth with fire engines for arms and the ability to absorb entire buildings.\nThe Wonderful End of the World takes you through 12 unique locations, with over a thousand treasures to gather before the end comes. Steal some sweets from the candy store, where gummi fish swim in a blueberry river; visit a surrealist library to find that the words have literally leapt out of their books; and explore the Megalopolis, where you'll watch a lively end-of-the-world parade and then gobble it up before making your way to grab the tallest skyscraper ever built.\n10 achievements for exploring and unlocking secret areas of the game\n12 unique locations to explore\n3 gameplay modes: Timed, Timeless, and Exploration\n16 bouncy music tracks keep the action rocking. Or bopping.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Dejobaan Games","platforms":[{"id":0,"name":"PC"}]},{"id":19821,"name":"NORTH","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4e/d4ea9bce7ef82222f94a93ed21ddc29b.jpg","description":"In NORTH you play a man who applies for asylum in a city filled with strange creatures and strange customs.\nDealing with the issue of the contemporary refugee crisis while at the same time being deeply rooted in a classical cyberpunk atmosphere à la Blade Runner, NORTH features a dark synthpop soundtrack, a sprawling mega-city and weird monster-like inhabitants.\nThe gameplay  is very straightforward and mostly consists of exploration and simple puzzles. The main difficulty is to understand what you have to do in order to get asylum. You've come from an foreign land in the south and find yourself lost and confused - a confusion you convey through letters to your sister back home. An important part of the gameplay, these letters help you understand your tasks while at the same time moving the narrative of the game forward.\nNORTH is short (20-40 min) and comes with a full soundtrack (8 songs).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Evgeniy Kolpakov t/a Sometimes You","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":18141,"name":"Gateways","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0e/c0e5a6ab3d7b94abfa689eec8dfd6091.jpg","description":"Steam Workshop\nAbout the GameFrom the creative mind behind The Adventures of Shuggy comes an exciting new retro-styled 2D platformer, a winner of Dream Build Play 2012 and a top 50 game of 2012 according to Game Informer.\nGrab the gateway guns and explore a huge lab filled with mysterious puzzles in this classic platforming adventure.  Use gateway technology to leap from one place to another, change size to explore small passages or defeat large enemies, walk on walls and ceilings to reach new areas and even travel in time to work together with past echoes of yourself.\nMove seamlessly between different areas of the vast labyrinthian map with no waiting for loading screens as you explore and discover new power ups.  Use each of your new abilities to progress further, unlock shortcuts and find even more power ups.  Can you escape?Key FeaturesTravel across a room instantly using gateways.\nChange size using the resizing gateway gun.\nInteract with your past echoes using the time travel gateway gun.\nWalk on walls and ceilings using the rotation gateway gun.\nSprawling open-world design.\nUse Gateway's sophisticated help system to discover if you can solve a puzzle and even watch the solution played out in front of you.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Smudged Cat Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15800,"name":"Zoo Park","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a08/a084dce14cadfd4e5f275bc451a2855f.jpg","description":"Care for over 40 different animals from all four corners of the Earth whilst running a professional programme of rescue, rehabilitation, research and conservation.\n\nEach animal type has its own list of requirements in terms of habitat, nutrition and care.  You must construct a well thought out facility to best meet the requirements of both the animals and your customers in order to gain the all-important popularity points from your visitors.\n\nKey Features\nBuild a carefully planned zoo park which keeps all the animals and your customers happy\nMake sure each animal’s habitat is the optimum size\nFeed each animal type correctly and make sure it can exercise comfortably\nHire staff to help you run your zoo park\nMake sure your facility runs like clockwork in order to gain the all-important popularity points from your visitors","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Excalibur","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14853,"name":"The Secret of Tremendous Corporation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b63/b639132b5c819bb5bc38547da6b9588c.jpg","description":"A game about games, secrets and stuff.\nIn the near future, thanks to copyright and patent law abuse, all of the gaming industry became controlled by one corporation, producing low quality but highly profitable casual freemium games and ceasing development of any other more ambitious genres. Any game development outside of the company became outlawed, ending the era of indie games.\nAssist young Max Burton, a mighty gamedev wannabe and enthusiastic fresh intern on his first day at his first job in the only gamedev company out there in this short, (soon to be) award-winning free point-and-click adventure game. Explore the deepest SECRETs™ of the Tremendous Corporation®. Find out what happened to indie devs and save the gaming industry!\nNow on GNU/Linux and Windows, Mac OS X coming soon.\nThe first version of this game has been made during Global Game Jam 2015 under the name \"The Game Jam Game About Games, Secrets and Stuff\".","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DOS","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14697,"name":"Voices from the Sea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/306/30679a33f7896f4570a30a0ee34c1cc4.jpg","description":"Follow the story of a young boy, Cantus as he meets Maris, the mysterious girl by the sea - an experience that will change his life forever. Collect seashells, unlock hidden Wallpapers, Theaters, and Side Stories as you sit back and enjoy this cute relaxing story. The Free Version was funded by Kickstarter.Voices from the Sea is a slice-of-life, supernatural visual novel. The game is available in Free and Plus version.FEATURESFree VersionA slice-of-life Drama & Mystery\nAnimated Backgrounds\nRated EveryonePlus VersionFully Voiced\nCharacter, Image, & Music Gallery\n9 Wallpapers, 3 Theaters & 2 Side Stories\nVoices from the Sea is presented to you by Zeiva Inc","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":10761,"name":"Shardbound","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/811/8110b39ea4e63ea65434c37d46d1e021.jpg","description":"Shardbound is a Tactical Collectible Card Game. As you play, you’ll collect hundreds of units and build armies to compete head-to-head with other players in matches of cunning and skill. Use positioning, the terrain, and your units’ unique abilities to achieve victory.\nIn the world of Shardbound, a great land rush has begun: the shards of an ancient, broken world are falling from the sky. You'll establish a Noble House alone or with friends, then head Shardbound to complete objectives and secure riches and fame.\nIf you’re watching somebody streaming Shardbound on Twitch, their Shardfall will appear in your overworld, giving you access to special Twitch objectives and content generated specifically for their viewers to complete.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spiritwalk Games","platforms":[{"id":0,"name":"PC"}]},{"id":9709,"name":"Shroud of the Avatar: Forsaken Virtues","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/210/21038e23edd9e998357535c93a740c0e.jpg","description":"WARNING: THIS GAME IS IN EARLY ACCESS. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT DEVELOPMENT OF THE GAME VIA CROWD FUNDING, BUG TESTING, AND FEEDBACK. PLEASE ONLY PURCHASE IF YOU ARE ALSO PREPARED TO HANDLE SERIOUS ISSUES AND INCOMPLETE CONTENT. PLEASE READ THE NEGATIVE REVIEWS PRIOR TO PURCHASE, MANY OF WHICH WARN YOU OF THE CURRENT UNFINISHED STATE OF THE GAME.\nSUMMARY:\nShroud of the Avatar: Forsaken Virtues is a new type of third person fantasy RPG that combines a single player narrative with a sandbox MMO. It is being created by a team that includes: Richard \"Lord British\" Garriott the creator of the Ultima series, Starr Long the original Director of Ultima Online, and Tracy Hickman the author of the beloved Dragonlance Novels and Dungeons & Dragons modules.\n\nEpisodic Content: Shroud of the Avatar will consist of five episodes that will tell a series of virtue based stories created by Richard Garriott and Tracy Hickman. All supported by a series of prequel novels starting with Blade of the Avatar. Forsaken Virtues is the first episode (this is what you are purchasing access to).\nSingle Player Offline Mode: Players will adventure through over 40 hours of story in an interactive world where their choices have consequences, ethical paradoxes give them pause, and they play a vital part in weaving their own story into the immersive world and lore surrounding them.\nSelective Multiplayer Modes: If you want to go through the story online you can play with everyone in a single world with three different online modes (Single Player, Friends, and Open). All items available in these multiplayer modes are also available in single player offline via purchase in in-game gold or other resources.\nClassless Character System: Vast customization options with hundreds of skills and spells in over 20 different skill trees.\nSkillful Combat: A new way to prepare and fight in an RPG by building custom decks of skills and dynamically activating them in combat.\nPVP: Consensual with Open PVP flags, zones, and Guild Warfare.\nPlayer Housing: Non instanced, finite, and embedded in the world with multiple group living options.\nPlayer Driven Economy: Deep crafting system where the best items are made by players and player items are the main source of loot found in the game.\nPay Once to Play: No subscription fees. Each episode is a one time fee and everything in the game can be purchased with in game gold that can be earned (except for some exclusive backer rewards).\nSocial: Full Guild System, Highly Active Community and Player Owned Towns.\nCrowd Sourced & Funded: Support the project by purchasing items in the add-on store or participate in telethon stretch goal exclusive item events! These online enabled add-ons and pledge items are also available to all players in offline mode.\nOpen Development: Players help shape the game by giving feedback on monthly early access releases, videos, weekly updates, blog postings, forums, chat, etc.\nDEVELOPMENT ROADMAP\nShroud of the Avatar: Forsaken Virtues is currently in Early Access, so there are a lot of features and content still to be built. Even the current content needs polish and balance. On the last Thursday of every month we release a major update to the game that includes new features, new content, and bug fixes. We update the schedule for these on a quarterly basis with a final update for each release the day before it goes live.Current Version Housing: Purchase property and a wide variety of buildings to place there. These can be customized with hundreds of items (paintings, crafting stations, chairs, tables, food, plants, fountains, statues, lights, etc.). Players can also set permissions that allow them to share this property with other players. Higher level pledges begin the game with property and house deeds. (Find out more at www.shroudoftheavatar.com)\nCrafting: Gather and refine resources to craft a wide variety of objects including weapons, armor, potions, food, and furniture.\nPlayer Trading: Trade with each other for items or gold.\nPVP (Duels and Zones): Fight other players in Open PVP zones of the map or 1 on 1 duels in any location.\nDual Scale Map: Explore the world by walking across a map (aka The Overworld) like old school RPGs with random and roving encounters mixed among named points of interest.\nCombat and Magic Skills: We have over 100 skills in a wide variety of combat and magic schools including Blades, Fire, Water, Life, Polearms, Shields, etc.\nMultiple Online Modes: Play how you want in one of two modes: Single Player Online or Open Multiplayer Online.\nCharacter Customization: Customize your character's facial features, hair style, hair color, facial hair, skin tone, and gender. Also express yourself with a vast array of different gear that when equipped shows on your character. (cloaks, armor, weapons, hats, tools, torches, etc.)\nAI Behaviors: Archers will try to maintain distance, warriors will try to surround you, Liches will summon skeletal allies, and villagers will turn on lights when night falls.\nAdvancement: As you gain experience fighting and questing you gain levels which give you skill points that you can use with a trainer to purchase new skills or to raise your attributes.\nHint System: Each time you attempt something for the first time a hint will appear with basic instructions (this can be disabled in options)\nFully Interactive World: Every attempt is made to make the world respond to you. All the lights you see can be turned on and off, doors can be opened/closed/locked/unlocked, objects can be taken from shelves/tables/etc.\nDynamic Lighting: Time of day changes as you play along with all light sources casting light in a realistic fashion.\nSummoned Allies: Certain schools of magic can summon allies including Ice Elementals, Fire Elementals, Liches, and Skeletons.\nControl Points: Grab control of Vertas Pass and see how long you can hold it against ever increasing waves of Dark Elves.\nEmotes: Express yourself with a wide variety of emotes including dances, bows, laughs, bows, yawns, etc.\nGuilds: You can form or join a guild\nBanks: Store all your gear and loot when it gets too heavy to carry around.\nCharacter tied to Pledge: All versions of the game (aka pledges) come with special rewards (gear, houses, titles, emotes, etc.).\nPlayer Owned Towns: Players can purchase and customize from templates their very own town.\nPlayer Vendors: You will be able to set up NPC vendors to sell the goods you have crafted or found adventuring.\nPlayer Made Books: Write your own book in the game and pay in game gold to have it published widely.\nDye-able Gear: Customize your gear by changing the colors.\nCrowd Sourcing Create content for the game (music, sound effects, and art) and be paid for it.Future Updates Story: A rich narrative that presents you with complex moral choices will come online closer to launch.\nMore Scenes: Many additional scenes will come online including cities, dungeons, deserts, arctic areas, swamps, fortifications, battlegrounds, etc.\nPerformance: Continued optimizations as well as sophisticated fallback routines will greatly improve performance.\nMore Magic & Combat Skills: More skills will be coming including the Chaos Magic School.\nLocalization: Support for multiple languages.\nMore Creatures: More creatures along with multiple variations and new behaviors.\nWe estimate reaching a Beta version with all features and content sometime in late 2017. All features and plans listed here are subject to change. We may modify, add or remove features as we see fit during the development process.\nWebsite for more information: www.shroudoftheavatar.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Portalarium","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":193,"name":"Fruit Ninja Classic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79a/79a6a24a5824584494b972aa4f8cda4e.jpeg","description":"Slice fruit, don’t slice bombs – that is all you need to know to get started with the addictive Fruit Ninja action!\nFrom there, explore the nuances of Classic, Zen and the fan favorite Arcade mode to expand your skills. Slice for a high score, use powerups and special bananas to maximum effect, and go crazy on the multi-slice Pomegranate.\nAll Blades and Dojos now have a unique effect on gameplay. Want a ten-fruit Great Wave? Bouncing clouds to never drop a fruit? Swirling tornados for epic combos? Mix and match your gear, experiment with all the powers and find what works for you!\nThere has never been a better time to play Fruit Ninja, so unsheath your sword and see what’s new in the game that started it all.\nThis is still just the beginning – we can’t wait for everyone to join us!\nIMPORTANT NOTICE\nThis game contains optional in-app purchases. You can disable this feature in the settings menu of your device.\nView our privacy policy at http://halfbrick.com/pp\nViews our terms of service at Http://halfbrick.com/tos","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Halfbrick Studios","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":960873,"name":"Mortal Kombat 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/155/155087d7b9c1225cda0ab9e586b6374d.jpg","description":"Mortal Kombat 1 is the latest title in the acclaimed Mortal Kombat videogame franchise developed by award-winning NetherRealm Studios. The game will introduce a reborn Mortal Kombat Universe that has been created by the Fire God Liu Kang, featuring reimagined versions of iconic characters as they’ve never been seen before, along with a new fighting system, game modes, bone krushing finishing moves, and more.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"NetherRealm Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":24948,"name":"Harry Potter and the Goblet of Fire","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8e/a8e0c12408935ae410a64ceb98a68e19.jpg","description":"Harry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire, a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twisting corridors of a maze. As Harry, Ron, or Hermione, you can cast a variety of spells in both single-player and cooperative modes.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Electronic Arts","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":20103,"name":"eXceed - Gun Bullet Children","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e8/3e8290b0b422c728f1b6c93b7a79a6ec.jpg","description":"Humanity is at war against vampires and deviants. Mankind's last line of defense is a group of children trained to wield powerful magic that can rival the demonic hordes, but at the cost of most of their lifespan. Likened to bullets of a gun, they are known as the ‘Gun Bullet Children’.\nThe time is NOW! A vampire invasion force has been detected in the airspace above Tokyo Portal 5. Preliminary reports indicate over 500 vampires and accompanying Killings Dolls with reinforcing hordes of deviant humans. The first line of defenses has been obliterated and the Gun Bullet Children are scrambled to launch a counter-assault and stop the invasion.Key Features:3 playable characters with individual storylines\n5 stages of bullet hell and boss battles\nSlowdown feature for precise maneuvering\nGraze system that will test your nerve and charge your super-weapon\nOriginal Japanese import version with English language manualNOTE: In-game Japanese text will not be displayed correctly unless the OS language is set to 'Japanese'.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Flat Software","platforms":[{"id":0,"name":"PC"}]},{"id":17779,"name":"Terrian Saga: KR-17","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a75/a753512c37b6b890be11964761888100.jpg","description":"AVAILABLE ON WinPC, MAC & LINUX!\nAbout the GameIn Terrian Saga: KR-17 players take control of a misfit military drone as it gains sentience and grows a conscious after being activated for war. Players will use an assortment of upgradable weapons including a laser, grenades, and flame thrower along with their trusted friend and sidekick, an also sentient guided missile named J1M. Players must fight their way through hordes of varying enemy robots while exploring intricate levels to uncover their mysterious past and discover the true enemy.\nWithin the galaxy on the Carina arm live twin solar systems riddled with conflict: the Terrius system and his brother, the Cyrinus system. These two empires travel so closely together they share multiple planets within their gravitational complex. However, the Cyrians have become embroiled in an interplanetary conflict with the Glortac People’s Resistance. Terrius has begun building military installations in order to better help combat the threat of the GPR. One of these bases, built on the planet Valiant, has been sabotaged. A terrorist has released thousands of killer robots on the Valiant base, destroying all personnel. The Terrius military has determined that this terrorist may have contacts with the GPR. Due to the risk of one of their most powerful military installations and armory falling into the hands of the GPR, Terrius has sent a strike force of 100 advanced KR drones to destroy these evil robots and restore order to the base- all before Valiant makes it’s swing into the Cyrinus system.FeaturesAdventure across 65 boards spread over 9 themed zones\nTest your mettle against 8 deadly bosses\nFire and guide J1M to take out hard to reach enemies, blast open new passages and explore\nReceive important updates and explore the relationship between KR-17 and J1M with in-level dialogue\nCollect Gears, find hidden jetpacks, and race the clock to climb the Steam leaderboards\nExperience varied level design: play through non-linear levels that encourage exploration, along with high intensity action platforming sequences\nEarn Steam Achievements that unlock alterations to your character","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wonderfling","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17430,"name":"Allumette","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9a/e9a797e4eb144fd588652f95a0cce9f7.jpg","description":"* free for a limited time *\nAllumette tells the story of a young orphan girl who lives in a fantastical city in the clouds. After enduring tragedy, she grasps at hope for her future. Loosely inspired by \"The Little Match Girl\" by Hans Christian Andersen, Allumette is an account of the love a mother and daughter have for one another, and the sacrifices they make for the greater good.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Penrose Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16858,"name":"FarSky","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/962/9627dd30aa38b61702727448c881fb36.jpg","description":"With FarSky, you take the role of Nathan who got lost in the Ocean after the crash of his submarine. You need to learn how to survive in the depths of the Ocean.\nUse the environment to gather resources\nBuild a base to refill your oxygen and manage your items\nCraft equipment and weapons to explore and protect yourself in the Ocean depths\nCreate an in-base farm or go fish hunting to feed yourself\nYour ultimate goal is to find all the pieces of your submarine, fix it and reach the surface. You can also choose to play in Sandbox mode to enjoy the game freely.\nAll maps are randomly generated to immerse you in an unknown world.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Farsky Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15652,"name":"Rustbucket Rumble","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4b/e4b75996477d874d4d7297fa5cba49f3.jpg","description":"GAMEPLAY DESCRIPTION\nRustbucket Rumble is a side-scrolling, team-based, arena combat game. Players choose from 6 distinct robot characters of varying personality, ability, and weaponry, forming two teams of 3 robots. Players must work with their teammates to attack enemy robots until they are turned into bins of scrap, then transport the bins back to their base as scraps for recycling. It’s capture-the-flag where the players are the flags!\nOnce a team has collected enough scraps, they can create the mighty giant robot, El Rey Gigante Robo Jr., and unleash him to destroy the enemy base and win!THE STORY\nAfter years of making a mess of things, mankind has finally given up and left Earth to find a new planet to trash.\nLeft behind were the machines that once dutifully served their human masters. Among these were the robots of arch-rival companies Robotic Engineering Depot (RED) and Blucom Discarded Plastics and Metals. With nothing else to do, these now-leaderless robots escalated their competition into fierce combat.\nBoth sides are now desperately collecting materials to create a giant robot powerful enough to destroy the other. The RUSTBUCKET RUMBLE has begun!ROBOT CLASSES\nClancy\nGrunt Model CLN-C has probably taken one too many hits, bullets, and rockets to the head, but he never gives up. Always helpful, Clancy is quick to heal teammates or provide cover fire from his automatic rifle. He doesn’t have any fancy gadgets to carry scraps, because he doesn’t need them. All Clancy needs to retrieve scraps is just some good old fashion determination and his metal robot arms.\nDaisy\nEngineer Model QT-3.14 has a cute and cheerful appearance, but make no mistake — Daisy is a technician of pain and punishment. Small in stature, she commands a powerful mech suit to help her build sentry turrets and carry drones. And she’s happy to get into the fray with her roller bomb launcher.\nKasumi\nNinja Model KA5-M13 was originally built for non-combat purposes. After the humans left, she finally got to pursue her dream of being a ninja assassin, but with a modern twist. Holograms, smoke bombs, and a cyber sword help her quickly dismantle enemies before they even know what happened.\nBjorn\nBrute Model HPM4X has an imposing stature and makes the most of it. Running head first into danger, he uses his powerful flamethrower to decimate enemies. His energy shield keeps him alive even in the worst conditions, and he’s so strong that he can easily toss scraps to his teammates.\nValentina\nSniper Model H0RN3T is as calm as she is deadly. Cold and calculating, she finds that the best place to position herself during combat is just out of sight from her foes. After dropping an enemy, she uses her extending grabber claw to retrieve scraps from afar. Even if her opponents do get the jump on her, she never loses her cool and uses stun grenades and a short range rapid-fire pistol to hold them off.\nMaverick\nBombardier Model DNGR-Z0N is a show-off. Thinking his jetpack puts him above the competition, he’s developed a cocky, prideful demeanor. His jetpack allows him to maneuver in and out of combat with ease and perform bombing runs. If he’s not careful, then Maverick may find himself in dangerous situations. But little do his foes know, that’s right where he wants to be. The danger zone. And when it seems like Maverick has bitten off more than he can chew; he uses his trusty rocket launcher to help even the odds. He can fly, get a burst of speed, and drop a number of bombs to the unfortunate robots below.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Reactor Zero","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12137,"name":"INTERSHELTER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e21/e219b0d40d7316cd1d429b19219ef9a7.jpg","description":"Skydome Inc. was founded in 2022, supported by European venture funds, to ensure the preservation of the human species in an event of cataclysm. The \"Dome\" project consisted of several programs.\nThe most famous projects of the company were InterShelter and InterSpace.\nInterShelter meant to build underground bunkers that could shelter residents from catastrophic events for half a century. Keyvan Morris, one of the most successful construction magnate on the West Coast, was appointed as project manager. The program started in 2024, and has gained wide popularity on the background of the growing threat of military conflict in the Middle East. Company is frequently mentioned in certain medications, developed in conjunction with a program of shelters.\nInterSpace included four projects: removing near-Earth space debris, building a Mars outpost,  system to protect against dangerous celestial bodies, as well as the creation of an autonomous colony in Earth orbit (Dark Sky).\nBright future, space exploration, colonization of new planetary systems - everything Dark Sky promised - faded in the glow of raging star.\nLittle is reported about the orbital colony after the disaster. No much interest on that  from people trying to survive on a dying planet, however,\nScraps of documents and drawings, inventions, prototypes can still be found in shelters, laboratories, bunkers. But no one remembers whether Dark Sky is real or is it just a legend.\nRules of the game:\nThere are 50 players spawned at location. When you're in lobby you can start playing in group of 4 people maximum.\nThere are 7 shelters on location. Every shelter has from 1 to 3 rescuing capsules (randomly).\nYou have 30 minutes to open shelters (find and set up 2 batteries), get into the capsule and become rescued from the storm.\nEveryone starts the game with the same stats. Everyone needs to get/collect the weapons, armors, batteries which are spawned randomly during the process of game.\nThere is just one aim - to survive in capsule but everyone can have their own strategy to achieve this.\nThere is no inventory in the game. The character needs to carry everything. It is allowed to put on two primary weapons (rifles, guns, shotguns) and two secondary weapons (pistols). The other weapon can be put on only if you replace the one that you already have on yourself. Bullets and medical kits do not have weight and can be added to inventory in any quantity.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Skies Technologies","platforms":[{"id":0,"name":"PC"}]},{"id":10084,"name":"Unexplored","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae6/ae6661bc4a9fc4666a227b02a72a445b.jpg","description":"User Reviews\"This game has the best level generator I have ever encountered.\" – PhilipKWeiner\n\"Every run the dungeon feels like a rich story driven experience.\" – Manifest Destiny\n\"Anyone who enjoys Isaac or Gungeon ought to give this a play.\" – Lovecraft Scientist\n\"Really captures the feel of the of Nethack and Moria games.\" – n37runn3r\n\"The game plays like a real-time Brogue. That's great. I love it.\" – Yeoman\n\"I hope that other roguelikes take notice.\" – szarkamichael\nAbout the GameReal-time Roguelite Dungeon Crawling at its Very Best!Unexplored is the roguelite that feels like a roguelike. An accessible yet challenging action rpg, praised for its fantastic level generator, real-time combat and a surprising amount of content and depth. Plus: free dlc which adds even more variety!\nExplore dangerous dungeons, solve mysterious puzzles and engage hundreds of foes, big and small, in intense melee combat.\nEasy to Play, Easy to Die\nFantastic Generated Dungeons (using brand new tech)\nReal Emergent Gameplay with many Tactical Options\nIntense, Real-time, Dual Wielding Melee Combat\nStealth Mechanics (dungeon crawling like a real rogue…)\nOver 50 dangerous bosses\nChallenging, generated puzzles\nAdaptive, original soundtrack\nWatch this video to understand how Unexplored creates its dungeons:\nhttps://www.youtube.com/watch?v=_wvkTT-6P3Q\nIn the Words Of A Player: What Do You Feel Makes the Game Stand Out?\nMisery, one of Unexplored’s Early Access players, thought our description didn’t do the game justice. So, we asked: “What do you feel makes the game stand out?”\nWe really liked what Misery wrote, so here’s a summary:\n1. the Dungeon Generation\n2. It uses a ton of traditional roguelike concepts, but in non-annoying ways\nThe fact that the game FEELS like a traditional one while still being real-time is a pretty major thing as far as I see it.\n3. The combat is pretty fun, yeah\nLots going on there, particularly once things like potions and staves or whatever are thrown into the mix. Feels more tactical than the usual \"shoot everything\" sort.\n4. Pausing the game\nBeing able to pause the game and deal with your inventory, use items, and examine things, without actually leaving the game screen, that's a big one. It all really opens up a lot of options for tactical play.\n5. The Puzzles\n[The puzzles] feel like the sorts that the old Zelda games used to use. That same satisfaction from that is here overall.\n6. The hub floors\nEnded up being a great feature.\n7. The huge variety of enemies\nNot just bosses, but monsters and traps and all sorts of stuff. I've been constantly impressed by this. Even after so much time with the game there's still plenty I haven't even seen yet.\n8. And of course the whole \"lock and key\" concept.\nYou can read the entire comment here:\nhttp://steamcommunity.com/app/506870/discussions/0/135509024342743670#comment_content_135509472113184826\nWe continue with our own, inferior description:\nThe goal of UnexploredThe goal of Unexplored is to find the dragon in the depths of the dungeon of doom, slay it to claim the Amulet of Yendor and bring it back to the surface. Every run, the game will create an intricate map of dungeons, hinting at foes to come and solutions for puzzles you’ll face.Lots Of BossesDuring your adventure through the dungeons, you’ll regularly face off with one of over fifty possible bosses. These range from the Queen Ant, to the Balrog and, yes, several menacing Dragons. Some of these bosses can only be slain with the right weapons, so make sure not to miss those on the previous levels.Uncover Secret ItemsIn the spirit of roguelikes, the game does not tell you which potions will save you, and which will kill you. You’ll have to find out yourself either by taking risk or using the right Magic Scrolls. Same story for the Enchanted Weapons: are they blessed with divine powers or cursed with deadly spells?PuzzlesPitted throughout the dungeons you’ll encounter strange statues. Some of these are part of puzzles and solving those may reap great rewards. So, you may want to pick up and read the books you’ll see lying around. They may feature hints on how to solve a puzzle, even one a few levels deeper.WeaponsYou’ll be able to equip two items and wield them both. In the darkest deeps you might want to hold a burning torch beside your axe. Bats tend to be killed easily from a distance by throwing daggers at them, so why not equip them in both slots? Or wield a whip, no better, the Flaming Whip you just plucked from that Balrog you managed to finally kill. Or… perhaps it’s best you start with a shield. A big, enchanted shield. Yes.ArmorYour starting armor may not seem like much, but that’s only because… well, because it IS not that much. It will keep you safe from the bites of bats, but don’t try your luck with an Orc. Beat the right foes to collect their leather breastplates or chainmail. Or… equip the right cloak on go stealth…Wait, Stealth?Yes, that is an option. You can go unnoticed for a long time and execute surprise attacks for added damage. Like everything in Unexplored, it’s up to you to weigh the rewards versus the risk. Because a surprise attack on a Necromancer may sound like a terrific idea, but it’ll probably survive your first strike, leaving you quite vulnerable in your cloak of cloth.\nProgressionUnexplored features several kinds of progression for you and your character. The most important is simple: experience. Expect to die a lot in the beginning, whilst learning exactly how to play the game. But you will learn and before you know, you reach a deeper level every run. However, there’s more than just experience. Within each run, you’ll find Potions of Strength, drink those and your power increases for as long as your stays alive. A Potion of Life not only completely heals your hero, it increases the amount of Hit Points. Upgrading your equipment by combining it with certain magic items on an anvil will grant you perks for the time being. Offer to the Gods, and you may receive another upgrade.\nHowever, if you die, your powers die with you. Unexplored is a game featuring perma-death.\nNevertheless, some upgrades are permanent. When you unlock achievements, you unlock equipment and items you can purchase before you start a new run. You pay for these items with the other permanent feature: gold. Your hero will inherit all the gold your previous one owned. So it is always an absolutely fabulous idea to try an open as many chests as possible, you might get rich trying.\nOr, just spend it all during your run when you meet one of the vendors. Yes, you heard that correctly: during the game you will be able to spend your gold on new equipment and potions. Obviously, if you subsequently fail, all that gold is lost. Like in forever.Crafting and MixingThe deeper you go, the more dangerous the dungeons will be. So, make sure to pick up the right equipment, potions and scrolls along the way. You can even craft better items and mix healthy or plain deadly drinks.\nForeshadowing…?Part of Unexplored’s allure is the way it generates the dungeons. Not just the levels themselves (see this video about Cyclic Dungeon Generation), but all the dungeons in their entirety. The game knows what you’ll face on the deepest levels even before you start wandering the first one. So, it will provide you with hints, keys and notes about what to expect down the line. Best keep an eye out for those.That’s It?No, of course not. Unexplored is a game filled with content, with lava and water, plants and trees (flammable trees that is), with hidden doors and locked doors (use lockpicks!), with small bosses and big bosses and with so much more. But we won’t spoil everything here. It’s up to you to find out! So, go have yourself an adventure! You’ll love it!\n***************************************communityUnexplored has a fantastic community of players helping each other out. They have been an integral part of the development of this game. So, if you're really stuck, let us know in the Steam forum, and we, or one of the other players, will try and help you out.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ludomotion","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]}]