[{"id":2422,"name":"Homefront: The Revolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6eb/6eb5ed3b286510c6dab3f15e3a975529.jpg","description":"Homefront: The Revolution is an open-world FPS developed by Dambuster Studios. It is the second game in the series.\r\n\r\n###Plot\r\nIn 1972, a technological marvel emerged in North Korea. The APEX corporation was found. Sometime later, the North Korean technologies become more widespread than the US. In 2004 the United States began to buy its weaponry from Korea. By 2016 the United States economy is at an all-time low, the US invade the Middle East. In 2025, the US debt to North Korea grows too immense to be paid out, and the economy crumbles. While being helpful at first, North Korea's military set foot on the American soil. You become a part of the resistance based in Philadelphia in 2029 trying to set the city free from Korean People's Army.\r\n\r\n###Gameplay\r\nThe players have to use the insurgency strategies in order to free the city of Philadelphia from the KPA. A wide set of explosives, jammers, and traps is available to the player. It is possible to modify the weapons the player has on the go. Attach suppressors, scopes or convert your weapon entirely as you see fit. \r\n\r\nPhiladelphia is split into three zones: the Green Zone where the KPA and their collaborators live in comfort with stable electricity supply and clean drinking water; the Yellow Zone which serves as a ghetto for most of the Philadelphia residents; the Red Zone which mostly consists of bombed-out suburbs of Philly. \r\n\r\nA four-player co-op mode is present in the game and is separated from the main campaign.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":34668,"name":"XIII","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/33b/33b8837b3f396612d458414798524897.jpg","description":"The President of the United States of America has been assassinated and you're the world's prime suspect. The FBI, the CIA, and a gang of murderous killers are trying to hunt you down. Stricken with amnesia you remember nothing, not even who you are. You're on your own and there is no one you can trust. All you have is a safe deposit key, a mysterious tattoo, and a gun. Clear your name, solve the mystery, and catch the true assassin before he strikes again.Exciting espionage story and fast paced action\nTop-notch voice acting preformed by actors such as David Duchovny and Adam West\n‘Cel-shaded’ graphics and comic book like narration brings the experience of the acclaimed comic book to life on your computer","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Ubisoft","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox One"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"}]},{"id":3187,"name":"Armello","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d2/3d260e4aaeb88b7ac53c81040ac4b80c.jpg","description":"Armello is a digital role-playing tabletop game developed by an indie Australian studios League of Geeks. It is the debut project of the game.\n\n###Plot\nThe game is set in a “dark fairytale” kingdom of Armello, where the anthropomorphic animals from many clans live. The king has gone crazy and is slowly dying because of the dark force named the Rot. The representatives of several factions come to the kingdom's capital to become the new king. Four characters are present at the beginning of the game: Tane the wolf, Amber the rabbit, Mercurio the rat, and Sanah, the bear. \n\n###Gameplay\nArmello is a digital remake of a traditional fantasy tabletop role-playing game in which there are rolling dice and cards, that allows the players to execute certain actions. The gaming area is divided into hexagonal plates, that contain procedurally generated features like caves, buildings, other characters or pieces of equipment. As the game progresses, the players can buy in-game currency to purchase special abilities using the skill tree, that is unique to every character.\n\nThe game uses a turn-based system, where the players can equip new items or acquire new skills while the other players make their turn. The cards and dice are used only when the players directly interact with the in-game world. The players use cards for casting spells, hiring teammates, treating wounds or using the special items that grant temporary abilities.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"League of Geeks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":249954,"name":"Carrion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c9/5c912b5ea827c2861cff425010a86277.jpg","description":"Carrion is a reverse horror game in which you assume the role of an amorphous alien being. Use your unique otherworldly abilities to your advantage and hunt down your prey!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Phobia Game Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":45745,"name":"FINAL FANTASY XV WINDOWS EDITION","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bf/5bfd0687ade6e8b55ace9c7fbc0991ea.jpg","description":"Get ready to be at the centre of the ultimate fantasy adventure, now for Windows PC.\nJoined by your closest friends on the roadtrip of a lifetime through a breathtaking open world, witness stunning landscapes and encounter larger-than-life beasts on your journey to reclaim your homeland from an unimaginable foe.\nIn an action-packed battle system, channel the power of your ancestors to warp effortlessly through the air in thrilling combat, and together with your comrades, master the skills of weaponry, magic and team-based attacks.\nNow realised with the power of cutting-edge technology for Windows PCs, including support for high-resolution displays and HDR10, the beautiful and carefully-crafted experience of FINAL FANTASY XV can be explored like never before.\nKEY FEATURES:\nEmbark On A Journey Without Limits.\nTake the wheel and drive from the capital to the back roads, or venture out on foot to discover a vast landscape of teeming wildlife, dangerous caverns and living cities full of adventure.\nMade For Windows PC Players.\nSupporting high-resolution options and  compatible with native 4K (3840 x 2160) resolution and HDR 10. Graphical options can also be configured to support up to 8K. Thanks to NVIDIA, you can experience the beautiful and carefully-crafted world of Eos like never before.\nBonus Content.\nFINAL FANTASY XV WINDOWS EDITION boasts a wealth of bonus content, including content contained in free updates to the console versions as well as paid downloadable content originally available through the Season Pass. Players can also explore the world of Eos through Noctis's eyes in an all-new first-person mode.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"}]},{"id":4241,"name":"LEGO Harry Potter: Years 5-7","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ad/6ad0779bd730077eb28aa3a50394ed5c.jpg","description":"LEGO Harry Potter: Years 5-7 is an action-adventure utilizing LEGO thematics and mechanics. The game is the part of the vast LEGO franchise and is released by Traveller's Tales — the studio specializing in LEGO since 2006. This is the second part of the Harry Potter LEGO arc with the first one being Years 1-4 title.\n\n###Gameplay\nThe game features mechanics same for all of the LEGO games — the core characteristic of them is collecting LEGO blocks while proceeding through the levels: the environment can be destroyed to some extent (basic surroundings like grass and walls are indestructible), the crafting part looks like an assembly of a constructor kit. \nThe title implements conditionally open world consisting of various locations reminiscent from the original book. The player can travel between locations after the completing of the main story to mop up the collectibles and find an interaction that was earlier inaccessible due to lack of special powers and moves. Such skills are usually acquired within the first playthrough. The game does not feature an online multiplayer, unlike its predecessor.\n\n###Story\nThe plot of the game generally follows the last three books and four films about the Harry Potter's adventures. The game starts with events depicted in The Order of the Phoenix film and ends with a fight with Lord Voldemort.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PSP"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo DS"}]},{"id":14290,"name":"KnightShift","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/340/3406c6f0f8935880023a06781b4f024a.jpg","description":"KnightShift is an RPG set in a fictional fantasy world. The game features a unique approach to both strategic and role-playing aspects of the game, as each level can be completed with various tactics, from stealthy infiltration to a grand battle of sheer force and steel plates.\nThe game offers two modes to play, the RTS campaigns, where the player takes control of a prince and his loyal knights, set out on different quests, such as defeating wizards and dragons, rescuing princesses and princes alike, and many more. The playable character can hire new units for battle, improve his skills and enhance the capabilities of his allies and support them on the battlefield. The second game mode is an RPG campaign, where the player can choose between 8 character classes, each with their unique skills and capabilities of creating a wholly new and unrivaled hero. The RPG campaign has its, and thus, new options on how to interact with the game world.\nDespite the game being released back in 2003, the graphics of the game are still nice-looking, giving that old school RPG feeling. The soundtrack of the game allows players to completely immerse themselves in the beautiful fantasy world, full of magical creatures and stories about legendary heroes.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3469,"name":"Metal Gear Solid 4: Guns of the Patriots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b27/b27eea9f8df280799b357b320f01211c.jpg","description":"Metal Gear Solid 4: Guns of the Patriots is a stealth-action third-person game developed by Kojima Productions. It is the fourth major installment in the series. It was marketed as the last game in the series. \n\n###Plot\nNine years have passed after the infamous Shadow Moses incident. The world is torn apart by local conflicts. Nations hire private military corporations instead of having their own armies. The  War Economy emerges with the Sons Of the Patriots system controlling the PMCs. Soldiers are infused with nanomachines that control their behavior on the battlefield, and the weapons are ID-locked. Liquid Ocelot sets out to hijack the system to use in his own interests. Solid Snake grows old rapidly and gets ready for his last mission in order to kill Liquid and save the world once again.\n\n###Gameplay\nSnake is proficient in Close quarters combat and stealth infiltration. Players are deployed on the battlefield with a wide arrange of gadgets at their disposal, such as the OctoCamo that allows for replicating any surface the player is close to or a Solid Eye that serves as the game's HUD. It is essential to keep an eye on Snake's stress level. As the protagonist's stress level increases, it gets harder to aim, Snake suffers more damage, and it is easier to get knocked out in hand-to-hand combat.\n\nA VR mode is also present in the game where players can learn about the weapons they can use and master the CQC.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":10119,"name":"Legacy of Kain: Soul Reaver 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/837/8375a78025f2f969743c8f4aaa0e9774.jpg","description":"Soul Reaver 2 is the third installment of the Legacy of Kain franchise. It continues the plot of its predecessor, Legacy of Kain: Soul Reaver.\n\nPlot:\n1500 years ago the vampire overlord Kain conquered the fantasy world of Nosgoth and established a new race of immortal vampires. The Elder God, who sees vampires as an abomination against the circle of life, opposes Kain. When Kain killed his lieutenant Raziel, The Elder God brought the dead man back to life to fight against Kain. \n\nAt the beginning of Soul Reaver 2, both Raziel and Kain travel back in time to the ancient eras of Nosgoth. They both try to alter history in their favor. Raziel discovers he is the only person in Nosgoth who can evade his predefined fate, so he faces a dilemma: should he follow his predetermined past to defeat Kain, or should he break free from the bonds of destiny.\n\nGameplay:\nThe player assumes the role of Raziel, controlling him from the third person view. Raziel travels Nosgoth to fight monsters and other enemies. In the battles, he uses his Soul Reaver sword that allows him to steal the souls of his opponents. Various attacks can be used to form powerful combo movements.\n\nGathered souls allow Raziel to enter the spectral realm. It is a world of ghosts that mirrors the real world. Spiritual realm allows Raziel to regenerate his health and avoid certain obstacles. After dying in the real world, the protagonist has to continue his journey in the spirits' world.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":13764,"name":"Spiral Knights","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04c/04c6ab14ae5f534a72ea712c4a63d4d5.jpg","description":"Spiral Knights is a massive online RPG developed by Three Rings Design.\n\n###Setting\nThe Spiral Knights awaken in an unknown world with their spaceship severely damaged. They take a break in the town of Haven and set out on their new mission. The Knights have to get deeper under the world's surface into a maze known as Clockworks. This giant complex is full of clock-like mechanisms and contains parts of other worlds within it which makes it a haven for terrible monsters. The Clockworks constantly rearranges itself. Those who shall get to the center of the maze unravels the mystery of the maze's creators, and its purpose.\n\n###Gameplay\nSpiral Knights is a top-down game which was heavily influenced by the first installments of The Legend Of Zelda series. You control one knight who has do face groups of enemies, avoid traps and solve puzzles. The option of cooperative play is also available for the players. \n\nWhile resting from battles and exploration, the knights gather in the city known as Haven. The Players can talk to each other there, trade, upgrade their equipment or buy something new. You can also start or join a guild. With the game being entirely free-to-play, the in-game currency can be bought for real money. \n\nTwo currencies are present in the game: Energy and Crowns. Energy can be exchanged for currency or used for the in-game activities, while Crowns are used for loot. Real money is often used to buy promotional costumes or other items.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Grey Havens","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5001,"name":"Sam & Max The Devil's Playhouse Episode 2 The Tomb of Sammun-Mak","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d65/d65af01d7ec14b01c572fb197a8614c7.jpg","description":"Episode 2 of an epic 5 game saga.\nAfter facing a pillaging primate from outer space in the series premiere, Sam & Max cross paths with even stranger characters in this episode -- their own great-grandparents!\nIn Episode 2 of the series, our heroes cross paths with an even more bizarre and dangerous pair of characters—their own great-grandparents!  Join these characters as they embark on their trippiest trip yet, leapfrogging across ten decades and possibly as many continents (we haven’t counted) in search of the mysterious force that’s causing all the trouble.\nWhere did it come from?  Why is it triggering Max's latent psychic powers?  Why is it desired by everyone aboard the Disorient Express?  And what, exactly, is the Secret of the Sphunx?\n* Episode 1: The Penal Zone\n* Episode 2: The Tomb of Sammun-Mak\n* Episode 3: They Stole Max's Brain!\n* Episode 4: Beyond the Alley of the Dolls\n* Episode 5: The City That Dares Not Sleep - Finale\n© 2010-2011 Telltale, Inc. Sam & Max created by Steve Purcell.  Sam & Max copyright and trademark Steve Purcell.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28564,"name":"Hexic HD","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/64a/64a87e7e23b747e98a2246ce8ea59b6e.jpg","description":"Single-player, HD (High Definition) Create clusters of same-colored tiles to clear them from the board. Sounds simple, right? The real fun of Hexic is in creating special patterns to earn special pieces. Create a flower to earn a starflower piece. Use starflower pieces to make another flower and earn the elusive black pearl. Make a cluster or flower out of black pearls to win the game. Are you up for the challenge? There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Carbonated Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":18785,"name":"Sam & Max: The Devil's Playhouse - Episode 3: They stole Max's brain!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/671/6716b656707c65cdf21882ee51b4f2ff.jpg","description":"Sam & Max 303: They Stole Max's Brain! is the third episode of the third season of Sam & Max. It is splitted into two separate scenarios. One of two main characters in the game Sam, a strange human-sized dog does not appear at the beginning of the game as players should wait for him a long time. Now Sam has to stop antagonists of both previous games and find those who took Max’s brain while he was in the bathroom. There are also strange flashbacks into the past, where we can see different versions of well-known characters. \r\nThe gameplay as all the other entries in the series is divided in to small episodes where the player has to solve various different puzzles while controlling interesting and fun characters but this episode features a slightly new gameplay style with Sam searching alone for thieves in noir fashion using only dialogue options. He searches till he finds two villains from previous games General Skun-ka'pe and Monsieur Papierwaite in the museum. They are thieves Sam was searching for. Now, Sam has to defeat them and give back Max’s’ brain with the help of other new characters.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 3"}]},{"id":5383,"name":"Worms","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8fc/8fcc2ff5c7bcdb58199b1a4326817ceb.jpg","description":"Worms is a turn-based strategy game developed by Team17. It is the first installment of the Worms series of games.\n\nWorms is a two-dimensional game. The gameplay is similar to the strategies of the time, such as Scorched Earth. The player controls a team of four worms. The objective of the game is to eliminate the enemy team. The player and the AI take turns on which they control a randomly selected worm from their team. During each turn, the player can use any weapon available to them or change the position of a worm. Upon hitting a worm, it's health points are taken away. The worms die on two occasions: if their health points reach zero or they hit the water. The levels are interactive and their landscapes are destructible, which affects the gameplay.\n\nPlayers have access to a wide variety of weapons. Apart from RPGs, grenades, and UZI, the game features unusual weapons such as banana bombs or explosive sheep. During the game, weapon crates are dropped from the sky. Players also can use tools such as a blowtorch or a drill, that affect the landscape itself.\n\nIt is possible to customize the games settings, such as the available weapons, the time limit of a turn and a round.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Team17 Digital","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"SNES"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Jaguar"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"}]},{"id":2306,"name":"Poker Night 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e40/e40b8c0637de401eb1dec5f5eb05ad33.jpg","description":"Playing poker is good in itself and as an occasion for live communication, a disclosure of communicative talents, a great way to spend time with friends. Especially if these friends know how to play and have fun playing.\n\nThis poker simulator allows you to spend time in a beautiful company. The game lets you play with Sam (Sam & Max franchise), assisted by Max, Brock Samson (The Venture Bros.), Ash Williams (The Evil Dead) and Claptrap (Borderlands). The dealer of the game is GLaDOS (Portal series). Some other popular characters take part as additional characters or cameos. \n\nAll players start the game with the same amount of in-game money, the goal is to win the money of other players. The game can be played in Texas hold 'em style or in Omaha hold' em.\n\nThe game is the sequel to Poker Night at the Inventory.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":2298,"name":"Deadlight: Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a2/4a2c96632d7721304b2856667ee85adf.jpg","description":"StorySet in an apocalyptic 1986, the survivors of a zombie outbreak live on among the remains of human civilization, trying to survive this hell on earth by any means necessary. You play Randall Wayne, an introverted and slightly paranoid survivor searching the destroyed streets of Seattle for his loved ones. Through tense platforming and life-threatening zombie encounters you must decide whether to use scarce ammunition and weapons to decimate the horde, or navigate the environment to sneak past them and hide. There’s more than one way to survive against the walking undead remains of the human race, now known only as ‘shadows’.\nDeadlight: Director’s Cut enhances the original Deadlight in every way. Improved visuals and textures bring even more detail to the remnants of Seattle, plus enhanced controls and new animations make Randall even more agile. Now you must fight for your life and put your survival skills to the test in Deadlight: Director’s Cut new game mode, the ‘Survival Arena’.FeaturesSolve puzzles and overcome environmental hazards in tense 2D platformingDecimate zombies with melee combat and weapons, or sneak past using the environment. Combat isn’t always the answer, especially when ammunition, weapons, and resources are scarceSeparated from his family, search the ruins of a ‘1986’ Seattle and uncover the fate of Randall’s loved onesSurvive endless waves of zombies in the new ‘Survival Arena’ mode! Use Interactive defences to block zombies and access new areas, or fightback using new weapons like the Machine Gun, Molotov Cocktail and Sniper Rifle to rank above the rest in online-leader boardsRunning at 1080p, with superior controls and new animations, this is how survival was meant to look.Watch through the original Developer Diaries and learn more about the Deadlight series!Explore the gorgeous art of Deadlight in the Deadlight: Director’s Cut digital art book accessed in-game!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21558,"name":"Hammerfight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f27/f27c535bab2315d93a13fcdc43b05c3a.jpg","description":"Hammerfight is about 2D battles of flying machines equipped with various slashing, piercing and blunt weaponry.A unique combat system is based on realistic physics simulation, and it ties the movements of the rider to the movements of your mouse. As you wave the mouse, your rider swings his warhammer, smashing the foe into the wall!\nThis creates an unequaled feel of the real strike, a feel of the mass of the weapon in your hands.  Simulated physics and direct mouse control creates a huge variety of possible battle techniques and an unlimited field for perfecting one's fighting skill.\nIntuitive mouse control\nRealistic physics, breakable objects\nGreat storyline\nHigh quality art\nMore that 50 weapons\n3 additional modes, up to 4 players","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Konstantin Koshutin","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16294,"name":"Tom Clancy's Rainbow Six Vegas 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/456/45634240037b12def32e2a603a08e0d0.jpg","description":"After six titles into the series, Tom Clancy’s Rainbow Six polished and tried the formulas to keep the player interested. This installment allows players to insert their own characters in place of Bishop, a squad mate of the previous protagonist, Logan Keller. Story campaign can be played in co-op with another player, and will follow the operatives through the search for the terrorist, that detonated a chemical bomb, taking many innocent lives. In case of a co-op, the Host will take the place of Bishop, with the additional player taking the place of Knight, whose looks are also can be changed by the said player.\nRainbow Six: Vegas 2 is a first-person shooter for the most part, but the camera switches into the third person mode while the characters are taking cover. Players can partake in Terrorist Hunt, which is a quick map with randomly scattered enemies a player has to kill. This mode can be played as a Lone Wolf, or with AI companions and a co-op partner. Regular multiplayer of Vegas 2 has been expanded to add ten more maps, two adversarial modes, and better online matchmaking.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":4901,"name":"Sam & Max The Devil's Playhouse Episode 4: Beyond Alley of Dolls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a2/0a2085ed3bc671519644f71c9d797ebf.jpg","description":"Episode 4 of an epic 5 game saga.\nIn Episode 4, the indescribable forces that have been pulling the Freelance Police’s strings begin revealing themselves, in a tale that will change the way you look at Sam & Max...forever!\nAn onslaught of oversized canine clones akin to a zombie apocalypse has our heroes running for cover in a barricaded ramshackle diner as the episode begins.  And it gets even stranger from there.\nWho’s responsible for this march of flabby dog flesh?  The creepy old sorcerer?  The creepy space ape?  The creepy diner owner?  Or some other creep?\nAnd make sure not to miss the most enormous climax ever in our upcoming finale episode, The City That Dares Not Sleep!\n* Episode 1: The Penal Zone\n* Episode 2: The Tomb of Sammun-Mak\n* Episode 3: They Stole Max's Brain!\n* Episode 4: Beyond the Alley of the Dolls\n* Episode 5: The City That Dares Not Sleep - Finale\n© 2010-2011 Telltale, Inc. Sam & Max created by Steve Purcell.  Sam & Max copyright and trademark Steve Purcell.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16760,"name":"Really Big Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ff/0ff35c01cd3431d51509b323e5e29b2a.jpg","description":"REALLY BIG SKY! A super fast, twin analogue shooter for the modern age!\nWay over in the big void of space live some aliens. They coveted [your planet] and would do anything to live there. So what's [your planet] to do? Yeah, blast through them all! Face off against waves of enemies, bosses, giant laser planets, blackholes, wormholes, massive lasers, planets and asteroids across 12 game modes!\nEverything is procedurally generated from the way YOU play the game! From attack patterns, strength of bosses and enemies, pacing between waves and generosity of bonuses!\nFeatures a comprehensive statistics system to let you hone your mad laser skills.Key Features\nFast, Adaptive and Addictive Gameplay\n12 Juicy, Full-fat Game Modes\nGiant, Dynamic Bosses and 17 Enemy Types\nPowerups, Perk system and the Friendly Mothership to help you out\nUltra Perks and Ultra Weapons for super post-game madness!\nSmash through solid planets and asteroids. Cruise through gas giants\nNarration from a cheeky cockney AI\nXbox 360 controller support\nLibrary and Secret unlocks\nLoads of events including Blackholes, Wormholes, Pandora Box, Panic Crashes, Warp Speed…\nGameplay-altering 'Cascade Events'\nOnline scoreboards - measure your awesomeness!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Boss Baddie","platforms":[{"id":0,"name":"PC"}]},{"id":11591,"name":"CAYNE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b85/b85ff3afb431efce115e0b402e4ec8ee.jpg","description":"Digital Deluxe Edition\nWant to support the devs? Please grab the Deluxe DLC which includes the sound track, art and other goodies.\nAbout the GameIn this grim return to the STASIS universe, expectant protagonist, Hadley, wakes up in a facility. Where is she? Why is she there? And, why do they want her baby?\nHelp panicked and anxious Hadley find her feet and brave stomach-churning situations to break free, by solving puzzles in this FREE horror adventure game.\nCAYNE is a free, point-and-click, isometric adventure game with a modern edge.\nA gritty experience awaits. STASIS was only the beginning of a much larger story.FEATURES\nPoint-and-click adventure game with a modern edge\nBeautifully rendered HD isometric backgrounds\nFully 3D animated characters\nQuality animated FMV\nVoice acted by professional actors\nOpen translation system\nComputer systems that interact with the game world\nIntuitive puzzles to test your deductive skills\nA modern re-telling of the classic adventure game genre\nAn adjunct story set in the world of STASIS\n16:10 monitor support\nPC, MAC & LINUX support","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THE BROTHERHOOD","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":58834,"name":"Guacamelee! 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/843/843499f98a871098e3e365a80b5c8768.jpg","description":"Brawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens to tear apart the very fabric of the Mexiverse!\r\n\r\nExplore a huge, hand-crafted world inspired by Mexican culture and folklore, filled with sassy new villains and weirdos (and a few old friends!). Learn a deep repertoire of bone-crunching wrestling moves to fend off the skeletal hordes and overcome skillful platforming challenges... and who said anything about a Chicken Illuminati? Certainly not us!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":40368,"name":"Sam & Max: The Devil's Playhouse - Episode 5: The City That Dares Not Sleep","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28e/28e807ed5022f3abad262150a648910b.jpg","description":"Wield psychic powers against fearsome foes in this epic comedy saga.\nIn The Devil’s Playhouse, an otherworldly power for controlling matter and space calls to the strongest and strangest who might wield it -- intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane.\nGaming's greatest dog and rabbit sleuths Sam & Max seek the power’s ancient secrets, as manic Max gains shape shifting, teleportation, mind reading and future vision abilities for battling these foes.\nThe saga plays out in a surreal symphony of mayhem that gets deeper and more twisted with each episode.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":4671,"name":"inFAMOUS 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c97/c979baea7e59e0bc857c0836052373dd.jpg","description":"inFAMOUS™ 2 is the 2nd chapter in one of the best selling franchises for the PS3™ system.  Blamed for the destruction of Empire City and haunted by the ghosts of his past, Cole must make a dramatic journey to discover his full super-powered potential and face the final confrontation with a dark and terrifying enemy from his own future.\nTrue Superhero Experience\nDiscover what it means to be a true superhero with epic boss battles and powerful cinematic sequences.\nAdvanced Super Powers\nExperience enhanced electrical attacks, a visceral melee fighting system and new super powers.\nAll-New Open Dynamic World\nExplore a vibrant world of New Marais with increased interactivity and destruction using dynamic parkour moves.\nNew Karma System\nAll new morality system gives players freedom of choice and leads to 2 different endings\nUser Generated Content\nCreate your own inFAMOUS™ levels and share them with the rest of the PSN community.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2011 Sony Computer Entertainment America LLC. inFAMOUS is a trademark of Sony Computer Entertainment America LLC. Developed by Sucker Punch Productions LLC.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sucker Punch Productions","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":27943,"name":"Sonic Forces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e9/0e9d75008321d640e4a14a8b5e322620.jpg","description":"In SONIC FORCES, the evil Dr. Eggman has conquered much of the world with help from a powerful and mysterious new villain named Infinite. Now, you must assist Sonic and build an army to reclaim the world as they fight against chaos and destruction.\nDefeat enemies with blazing speed as Modern Sonic, catapult past perilous platforms as Classic Sonic, and create your very own Custom Hero Character equipped with a variety of powerful gadgets. Experience fast-paced action with these three unique gameplay styles, explore iconic stages, plus, fight across unique added content with Shadow as a playable character!Digital Bonus Edition includes:SONIC FORCES videogame\nEPISODE SHADOW (DLC)\nSEGA PACK (DLC)Pre-Order Bonus:SHADOW COSTUME (DLC)\nThe fate of Sonic the Hedgehog’s world is in your hands – Join the Uprising.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sonic Team","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":19502,"name":"Nosferatu: The Wrath of Malachi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/559/559fb67a9c379630bbb821595e102bee_2EQC8gc.jpg","description":"Nosferatu: The Wrath of Malachi is a first-person shooter with a mix of survival horror elements developed by Idol FX.\n\nThe game is set in the nineteenth century. James Patterson is on his way to the wedding of his sister at the manor of a wealthy Romanian Duke. Upon arriving at the destination, James sees crosses nailed to the doors and meets a holy father who tells the protagonist that this manor is a home for vampires and the Pattersons are held prisoner.\n\nThe objective of the player is to save every one of their family and fight back the vampires. At the beginning of every game, the rooms in the manor are generated randomly using several templates. The players are given some time to find a save a family member. Should the player fail, the game's boss will grow stronger. The more family of yours you save, the easier it will be to fight the final boss.\n\nInitially, the only weapons James has are a sword and bare fists, yet it is possible to find new weapons, such as firearms or classic vampire hunter weaponry later in the game. There are notes scattered around the manor which describe the monsters and how to fight them.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Idol FX","platforms":[{"id":0,"name":"PC"}]},{"id":431,"name":"King's Quest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/058/058a71868ab884d1022023f21f2c6a47.jpg","description":"King's Quest is the ninth part of the eponymous series of games.\n\nKing's Quest follows the story of the royal family ruling in the kingdom of Daventry. This story consists of trials and adventures of the members of this family. The story covers three generations, the action takes place not only in Daventry, but also in neighboring lands.\n\nThe interface of the game combines point-and-click with quick time events. There are also logical puzzles and action sequences. The development of the plot depends on the actions and words of the main character, the same episode can be started and completed in different ways. At the same time, in the end, the choice of the player only affects the actions of the secondary characters - they can either help the protagonist or not.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Odd Gentlemen","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":42064,"name":"ArmA II: DayZ Mod","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43f/43ff0ac9538f82b00fb3b47d186bd46b.jpg","description":"Arma 2: DayZ Mod is a free multiplayer modification for Arma 2 and Arma 2: Operation Arrowhead developed by Dean Hall.\n\nDayZ is an open-world survival horror set in a post-soviet state of Chernarus. The population of a country has turned into zombies due to an unknown cataclysmic event. The players have to survive in a hostile environment evading enemies and searching for supplies, weapons, and ammunition in abandoned buildings. Other players and zombies are not the only dangers in DayZ as the game features a complex player health system. It is crucial to control hunger, thirst, traumas, and illnesses. Death in the game is permanent. If the player dies, one has to create a new character and scavenge for supplies from scratch.\n\nThe modification puts a heavy emphasis on realism as the environment is interactive and has various effects on the player. It is easy to break your character bones and even fracture them. Your character can go into shock after surviving several bullet wounds or getting bitten on by a zombie. Infections can be received from zombies or the bodies of other players. It is also possible to faint due to blood loss.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":40645,"name":"Back to the Future: The Game - Episode 2. Get Tannen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d13/d138c61ddc3b873cd46630d0229ddcc7.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":17728,"name":"Risen 3: Titan Lords","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a5/9a55fdeaee5850b0a9f88b8081750c59.jpg","description":"Risen 3: Titan Lords is the final part of the Risen trilogy, a medieval-themed action RPG set in a fantasy world. The game isn’t directly connected to the events of Risen and Risen 2: Dark Waters but features several characters and locations from them.\n\nYou take on the role of the unnamed protagonist whose soul was stolen by a demon. You can return it with a magician’s help but you need to join one of three in-game factions, like in other Risen games. This leads to multiple quests you complete to gain the respect of your mentors. The story is non-linear; almost all locations are available from the very beginning.\n\nTitan Lords uses the upgraded version of Dark Waters’ combat system that features sword and gunfights and using magic. All skills are upgradeable. The game includes both land and sea missions. A new gameplay feature is karma that affects your relationship with NPCs. The protagonist can become conditionally good or evil depending on his choices. However, his karma won’t define the game’s ending.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":61694,"name":"Noita","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/647/647ddefa82d1e2ddd31d12c1bcb0deb2.jpg","description":"Noita is a magical action roguelite set in a world where every pixel is physically simulated. Fight, explore, melt, burn, freeze and evaporate your way through the procedurally generated world using spells you've created yourself. Explore a variety of environments ranging from coal mines to freezing wastelands while delving deeper in search for unknown mysteries.\r\nPixel-based physics: Every pixel in the world is simulated. Burn, explode or melt anything. Swim in the blood of your foes! Enter a simulated world that is more interactive than anything you've seen before.\r\nYour own magic: Create new spells as you delve deeper into the caverns. Use magic to crush your enemies and manipulate the world around you.\r\nProcedurally generated world: Explore a unique world every time you play. Discover new environments as you adventure deeper.\r\nAction roguelite: Death is permanent and always a looming threat. When you die, don’t despair, use what you’ve learned to get further on your next adventure.\r\nNoita is being developed by Nolla Games, a company set up by 3 indie developers, all of whom have worked on their own projects in the past.\r\nThe three gents in question are:\r\nPetri Purhoыф\r\nPetri is best known as the creator of Crayon Physics Deluxe. In his youth he also made a lot tiny freeware games. He has also made a bunch of board games, but he hasn't told about it to anyone. So please keep it a secret.\r\nOlli Harjola\r\nOlli released his first commercial game The Swapper in 2013. Besides indie games, he also dabbles in music, live visuals and making programming languages.\r\nArvi Teikari\r\nArvi is also known as Hempuli. Over the years he has released a lot of tiny experimental games, so many in fact that he is unaware of all of them. One of the games he remembers making is Environmental Station Alpha. He's currently also working on Baba Is You.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Nolla Games","platforms":[{"id":0,"name":"PC"}]},{"id":427519,"name":"Amnesia: Rebirth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d65/d654fb344f39538728ab0a4d94b22ae9.jpg","description":"You can’t let out a breath. The creature is only inches away. Its sole purpose - to feed off your terror. And so you crouch in the dark, trying to stop the fear rising, trying to silence what lies within you.\r\n“I know you. I know what you're capable of.”\r\nIn Amnesia: Rebirth, you are Tasi Trianon, waking up deep in the desert of Algeria. Days have passed. Where have you been? What did you do? Where are the others? Retrace your journey, pull together the fragments of your shattered past; it is your only chance to survive the pitiless horror that threatens to devour you.\r\n“Do not allow yourself anger, do not allow yourself to fear.”\r\nTime is against you. Step into Tasi’s shoes and guide her through her personal terror and pain. While you struggle to make your way through a desolate landscape, you must also struggle with your own hopes, fears, and bitter regrets. And still you must continue, step by step, knowing that if you fail you will lose everything.\r\nFirst-person narrative horror experience\r\nExplore environments and uncover their histories.\r\nOvercome puzzles that stand in your way.\r\nCarefully manage your limited resources, both physical and mental.\r\nEncounter horrific creatures and use your wits and understanding of the world to escape them.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Frictional Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3363,"name":"Shovel Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0a5/0a5085a3fbe26be9cf9f96ff8c12746d.jpg","description":"Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic! Become Shovel Knight, wielder of the Shovel Blade, as he runs, jumps, and battles in a quest for his lost beloved. Take down the nefarious knights of the Order of No Quarter and their menacing leader, The Enchantress.\nBut that’s not everything! Shovel Knight: Treasure Trove will feature three additional campaigns that are games all unto themselves! Take control of Plague Knight, and Specter Knight on adventures of their own, with King Knight joining later as a free update! Together, they form a grand and sweeping saga!\nWith a fully cooperative campaign, a full-featured challenge mode, body swap mode, and a 4 player battle mode (Coming soon!) you’ll be digging for a long time. With Shovel Knight: Treasure Trove, you get it all. Uphold the virtues of Shovelry, earn relics and riches, and discover the true meaning of shovel justice!Includes:Shovel Knight: Shovel of Hope – Steel your Shovel Blade and start digging through the adventure that started it all! Jump, battle foes, and discover treasures as you quest to defeat the Order of No Quarter and their vile leader, The Enchantress.\nShovel Knight: Plague of Shadows – Prime your potions and become the maniacal alchemist Plague Knight in his adventure to brew the ultimate potion! Combine bomb parts to create custom combinations, discover new items, areas and bosses, and maybe even discover a bubbling romance.\nShovel Knight: Specter of Torment – Summon your scythe in the prequel to Shovel Knight! Take control of Specter Knight to dash through completely redesigned levels by climbing walls, mastering a new arsenal of weapons, and slashing your foes to ribbons. Become the reaper, discover your melancholy past, and recruit the Order of No Quarter!\nShovel Knight: King Knight's Campaign (Coming soon)\nShovel Knight: Battle Mode (Coming soon)Features:Yacht Club Games' beautifully authentic style bridges the gap between yesterday and today. Design, art, and audio hearken back to the days of 8-bit.\nThe systems of today also give Shovel Knight modern touches: detailed animation, multilayered parallax backgrounds, and evolved game design.\nLeap over gaps! Duel with foes! Uncover treasure! Find Secrets! Upgrade! Shovel Knight is simple to learn and play, but challenge lies everywhere.\nMultiple awesome soundtracks by Jake \"Virt\" Kaufman with additional songs by Manami Matsumae!\nAmass riches to upgrade your armor and weapons.\nDetailed, living background and animation! Big, beautiful pixels!\nLovable characters and bosses!\nBalanced gameplay is a warm welcome to newcomers, and an old embrace for experts.\nA light touch to narrative with humor, levity, and heart.\nRetell the adventure and uncover all of the world's secrets with New Game+!\nChallenge Mode - A full featured mode with over 50 challenge levels that up the ante in every way!\nBody Swap - Did you ever wish Shovel Knight was a lady, or Shield Knight was a guy? Well, now you can change them all around however you want, with brand new designs for all of the main characters in Shovel of Hope!\nCo-op! – Grab a friend and play through Shovel of Hope as a fully cooperative adventure!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"8-4","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":52178,"name":"Dishonored Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c7/6c72f1af7c88fa179db80781c014ae28.jpg","description":"Dishonored Definitive Edition is an immersive sim stealth-action game developed by Arkane Studios. \r\n###Plot\r\nReturning from his mission of seeking assistance in combatting the plague that got into the city of Dunwall, the queen's servant Corvo Attano is attacked by the assassins led by Daud who murders the queen and kidnaps her daughter. Corvo is later framed for the murder of Her Majesty but escapes from prison. It is revealed that after six months of his sentence, the tyrannic government was established. He joins the resistance in order to avenge his queen and find her daughter.\r\n\r\n###Gameplay\r\nThe game puts a heavy emphasis on a stealthy mission approach. The players are free to approach quests however they see fit. While free from the main quests, the players return to the game world's hub where they can learn about their next mission, upgrade their equipment or take some side-quests. Every location of the game's world is open-ended and rewards exploration. \r\n\r\nThere are several RPG elements to the game, as the players are able to upgrade their skills and participate in branching dialogue that will later affect the game's narrative. The player's actions are not rendered good or bad, yet they influence the chaos level after the completion of each mission. Chaos affects the in-game world but does not push the players towards a certain playstyle. \r\n\r\n###Definitive Edition features\r\nDefinitive edition features all the  singleplayer DLC packs released for the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Arkane Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":49104,"name":"AER - Memories of Old","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e6/2e6a43949b938f8f34bac7b7d6640fa1.jpg","description":"The gods of old are forgotten, lost in the events that shattered the world, leaving only fragments of islands in the sky. This mystic world of endless skies, colorful islands and ancient ruins is in danger of falling into darkness. As one of the last few shapeshifters, you are sent on a pilgrimage to the Land of Gods. Uncover the secrets that will help save reality itself.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Classic Macintosh"}]},{"id":22344,"name":"Old Man's Journey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8f5/8f51cd193717f03ec820b5caece4f963.jpg","description":"Old Man’s Journey, a soul-searching puzzle adventure, tells a story of life, loss, reconciliation, and hope. Entrenched in a beautifully sunkissed and handcrafted world, embark on a heartfelt journey interwoven with lighthearted and pressure-free puzzle solving.\nA visual narrative about life’s precious moments, broken dreams, and changed plans, uncover stories of the old man’s life told through beautiful vignettes of his memories. Interacting with the serene and whimsical environment, solve playful puzzles by shaping the landscape, growing the hills to create the old man’s path forward.\nDuring this compact gameplay experience, you’ll be transported to a vibrant and wishful world, exploring life’s complexities through the old man’s eyes. Meditatively delightful and reflective, Old Man’s Journey invites you to immerse yourself in quiet and inquisitive puzzles, and experience the old man’s heartache, regret, and hope.\nFeaturesA powerful and emotional narrative told only through imagery\nGorgeously whimsical landscapes with hand-drawn art and frame-by-frame animations\nHandcrafted, pressure-free puzzles\nUnique delightful landscape-shaping mechanic\nA compact game experience perfect for a wanderlust-evoking escape\nOriginal and emotionally compelling soundtrack by SCNTFC\nCrisp drawings rendered in native resolution - even on your 4K monitor","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Broken Rules","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"}]},{"id":3548,"name":"Nidhogg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5f/b5f4e96a5db76ae039b88eefc1370a1b.jpg","description":"###The experiment\nExperimental side-scrolling fighting game for two players developed and published by the Messhof studio. Players compete in fencing in the pixelated game world. Despite the simplicity of the concept and of the controls, the game is very competitive, and many media called the game one of the best multiplayer experience of 2014. The name is consonant with serpent from the Norse mythology Níðhöggr, the snake appears in the game, eating the winner of the duel. The game draws inspiration from the game, which was released in 1984 - Great Swordsman, and for development used software GameMaker: Studio, which is available on Steam. Who wouldn’t want to create a game where you impale a friend, eh? \n\n###Key features\nPlayers get control over two game models that differ only in color. Controls are standard: jump, move, slide and throw the sword at your opponent. You can attack at three different heights: high, medium and low. Hit the opponent's sword to disarm the latter, and he will have to raise the sword again. The main task is to reach the end of the enemy territory. The first player who accomplished this wins. There are four different levels available for solo, local and online multiplayer. Later, the developers added new modes, like a tournament and the ability to use weapons differently.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Messhof","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18844,"name":"Back to the Future: The Game - Episode 4. Double Visions","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdc/fdcb120491b881fe10ce94fde78be1ee.jpeg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":40646,"name":"Back to the Future: The Game - Episode 3. Citizen Brown","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d69e1542ea0d05d6c9327751793288.jpeg","description":"","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"}]},{"id":3194,"name":"Super Time Force Ultra","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b8/2b86c68a911ca1dd4828e22364e077ea.jpg","description":"Mankind has learned to travel in time and uses this knowledge to improve its present. Namely, in every possible way corrects the past in order to be in a better present.\nOf course, fixing the past is not an easy task. This is the responsibility of the military organization - the Super Time Force. Brave Commander Repeatski boldly sends time-traveling fighters to various points in time, including prehistoric times and the Middle Ages. Sometimes to improve the present he has to send fighters to the future - and Commander Repeatski does not stop before that.\nThe matter is not limited to transferring fighters back and forth in time. Manipulate the time can not only Commander Repeatski, but also ordinary soldiers - they, too, can \"rewind\" the time forward or backward - for example, during the fight, \"cancel\" the wrong decision, be five minutes earlier and do everything as needed.\nAnd one more useful thing is the slow motion mode, if at normal speed it is difficult to pass.\nThe player has 30 lives. Levels are sufficiently filled with well-armed opponents, and so many lives - it's not so much. The characters you can play the game are sixteen. Everyone has his own weapon. And everyone can achieve six levels of skill.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Capybara Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]