[{"id":18400,"name":"Starship Annihilator","genre":"Action","price":0.0,"description":"Story\nAs predicted by scientists, the Milky Way collided with the Andromeda Galaxy. However, they were out in their calculations and the collision occurred much earlier. In 3521, during this cataclysm the Solar System was totally thrown out of the Milky Way by gravitation forces and was sucked into a black hole resulted from the Milky Way and the Andromeda collision.\nDescription\nStarship Annihilators! A classic style vertical scrolling-shooter. Includes 10 levels and 10 boss enemies. You will have several power-ups for weapon modification. Within each level, you will face different enemies, among which will vary from low to extreme levels of threat!","imageUrl":"https://media.rawg.io/media/screenshots/32e/32ec7a3b1c5e2a5c37104c4436264476.jpg","releaseYear":2016,"developer":"IR Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18365,"name":"A Blind Legend","genre":"Action","price":0.0,"description":"A Blind Legend is the first-ever action-adventure game without video – where ears replace eyes!\r\nDiscover the original, innovative sensory experience of binaural 3D sound.\r\nHEADPHONES ARE COMPULSORY!\r\nAUDIO GAME FULLY ACCESSIBLE TO BLIND AND VISUALLY IMPAIRED PEOPLE\r\nYour eyes will be of no help.\r\nSo close them, sharpen your hearing and your blade...\r\nAnd embark on an epic, perilous rite of passage.\r\nLive the adventures of Edward Blake, the famous blind knight! Guided by your daughter Louise, you must find your way and avoid the many traps that lie in the High Castle Kingdom, while confronting dangerous enemies!\r\nThis serious game is fully accessible to visually impaired people, and is aimed at anyone who’s eager for an original, immersive sensory experience through a ground-breaking video game. And because the player is the character, it will help raise public awareness of this kind of disability.\r\nThis hack-and-slash game, with a heroic-fantasy flavour, harnesses the innovative technology of binaural sound, which delivers a gripping 3D soundscape and brings characters and actions vividly to life around the player – as if they were actually in the game!\r\nA Blind Legend was co-created thanks to support from a community of fans who helped with the crowdfunding campaign (www.ulule.com/a-blind-legend) and in a co-production with France Culture, a Radio France station.","imageUrl":"https://media.rawg.io/media/screenshots/39d/39dd6044fbdeee1d4b49609fcf512b06.jpg","releaseYear":2016,"developer":"Dowino","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":17649,"name":"Gnomes Garden","genre":"Strategy","price":0.0,"description":"A wonderful garden had always brought joy to all the people of the kingdom and all the residents of the castle. But a dry summer withered the king’s beloved garden and the surrounding gardens of the kingdom alike. The ruler has fallen ill and the kingdom is in danger. Help the princess save the gardens and make the king better again. Construct buildings, remove obstacles, repair damaged bridges and restore the beauty of the royal garden.\nHead out with the gnomes on a journey in this exciting fantasy strategy game, Gnomes Garden!  Over 40 beautiful levels await you, along with a multitude of varied quests, increasing difficulty, an upbeat plot, an extraordinary magical world and exciting gameplay for all ages. Construct buildings and manage resources, use powerful magic and restore ancient magical gardens. Easy-to-learn controls and a well-designed tutorial will help you quickly learn the basics of the game.","imageUrl":"https://media.rawg.io/media/screenshots/17b/17bb0ce7b8c1cb751a5bae49b13f4d17.jpg","releaseYear":2015,"developer":"8Floor","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":17351,"name":"Don't Knock Twice","genre":"Action","price":0.0,"description":"ABOUT THE GAMEDon’t Knock Twice is a highly-immersive first-person horror game with VR support on HTC Vive and Oculus Rift.\nTo save her estranged daughter, a guilt-ridden mother must uncover the frightening truth behind the urban tale of a vengeful, demonic witch. Explore a grand manor house environment and interact with almost every object you see. To find and save your daughter, you will explore all depths of the manor, searching for hidden clues and wield items to fight or escape the terror that surrounds you. Developed alongside the 2017 horror film, Don’t Knock Twice, starring Katee Sackhoff (Battlestar Galactica).\n“One knock to wake her from her bed, twice to raise her from the dead.”\nPlay with our without a VR device.VR FEATURESDon’t Knock Twice is designed to be played with our without a VR device.\nOnly one purchase is necessary, you will be given the option to play in VR or Non VR when starting the game. You are free to switch between modes and carry on where you left off.\nA free VR demo available now on Steam for HTC Vive and Oculus Rift with Touch controls.VR LOCOMOTION- Walking Locomotion\n- TeleportationGAMEPLAY AREA- Seated\n- Standing\n- Room-ScaleSUPPORTED CONTROLSNon VR – Keyboard / Mouse, Standard Controller\nVive VR – Vive Hand Controllers\nOculus VR – Oculus Touch Controllers, Standard ControllerADDITIONAL VR FEATURES- Distance Grabbing or \"Stretchy Hands\" is an available option in Oculus VR Mode.\n- One-Click 90 degree flip buttons are available in Oculus VR Mode.","imageUrl":"https://media.rawg.io/media/screenshots/242/242750093ffd103a5fb56f13a11eda68.jpg","releaseYear":2017,"developer":"Wales Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":16887,"name":"Hidden Object Bundle 4 in 1","genre":"Casual","price":0.0,"description":"This 4-in-1 bundle includes 4 Hidden Object games:\nStray Souls: A Dollhouse Story:\nWelcome to a town where something that should not exist runs free; where a desperate wife will risk her beating heart to find her husband; and where a terrible secret lies buried behind an orphanage. Search for clues, solve puzzles, and unlock new areas as you visit spine-chilling locations, play stimulating mini-games and locate hidden objects. Stray Souls: Dollhouse Story is more than a game; it's a heart-stopping journey of discovery!\nHouse of 1,000 Doors: The Palm of Zoroaster:\nA cursed gem that has left a trail of smoldering bodies in its wake is threatening the residents of the House of 1,000 Doors, prompting the head of the mystical dwelling, Gabriel, to once again summon Kate Reed to its aid. Guide Kate as she searches Tibet, Jerusalem, Madagascar and more for the artifacts that can break the power of the gem, solve a massive array of cleverly designed puzzles and find hundreds of ingeniously hidden objects. Production values that rival the quality of theatrically released animated 3D films and superbly performed voiceovers will draw you into this story of supernatural intrigue, unbounded adventure and sweeping scope. The House needs you. Will you answer its call?\nDark Strokes: Sins of the Fathers:\nWhen Evil comes for the people you love, what will you do? That moment of reckoning has arrived for Ethan Blake, a young man whose bride-to-be was snatched up in the blink of an eye by a terrifying menace known as the Faceless Ones.\nGuide Ethan as he explores a decimated city, interacts with its remaining inhabitants, searches for clues that will lead him to his beloved Clair, and peels back the layers of a chilling supernatural mystery that began with the stroke of a paint brush and will end in a dramatic confrontation near a fiery abyss.\nEternal Journey: New Atlantis:\nTravel from the deepest trenches of the Atlantic Ocean to the awe-inspiring wonders of Mars as you solve the greatest archeological puzzle known to man: the origin of Atlantis. Through stunning production values and cunningly designed puzzles, Eternal Journey: New Atlantis will draw you into an experience unlike any other hidden object adventure.","imageUrl":"https://media.rawg.io/media/screenshots/288/288b894f5ee524426edd74459d4dbc64.jpg","releaseYear":2015,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16427,"name":"Red Johnson's Chronicles - 1+2","genre":"Action","price":0.0,"description":"Steam Exclusive Offer - 2 Games in 1!\nEnjoy both Red Johnson's Chronicles and Red Johnson's Chronicles: One Against All in one exclusive pack!Red Johnson's Chronicles\nTry to stay alive… at least long enough to finish this investigation!\nYou play the role of Red Johnson, a private detective who is trying to find his place in the corrupted city of Metropolis. You are taken on by the police who want you to solve a murder with no corpse.\nDiscover Metropolis, its unique atmosphere and get to know the rules quickly if you want to survive! It's up to you to look for clues, interrogate the witnesses and put the evidence together in order to find the perpetrator.You'll also have to use your logic to solve the different enigmas, and occasionally, you'll have to use your fists.\nSolve various puzzles to advance through the game\nAnalyze the clues and use your logic to complete your investigation successfully\nKnow the right way to speak to witnesses and sort out the truth from the lies\nAn adventure game in a brutal world where you'll need to learn how to fight Red Johnson's Chronicles: One Against All\nDarker, more complex, but especially more personal!\nRed Johnson is a private detective who knows how to make himself popular. When you solved your last case, you got the Mafia's attention… and they put a contract out on you. Your new friends are going to do everything they can to find you!\nWhile you are trying to keep your head down in the role of Red, you learn that your brother has vanished when you receive a finger as proof that he is still alive. If you want to find your brother in one piece, you'll have to go looking for him and lead the investigation into his disappearance.\nSolve various enigmas, interrogate the witnesses you meet and collect the clues that will help you advance the investigation and discover the truth about this kidnapping.\nCollect the clues that will lead you to your brother\nLots of even more varied and original enigmas to solve\nTough characters in a dark world\nCarefully constructed dialogues with a touch of humor","imageUrl":"https://media.rawg.io/media/screenshots/6e5/6e5ad128cfa106a788a94064b0fab228.jpg","releaseYear":2014,"developer":"Lexis Numérique","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16420,"name":"Monument Builders - Alcatraz","genre":"Casual","price":0.0,"description":"In Monument Builders: Alcatraz, oversee the construction of the most famous prison in the United States, while learning many other anecdotes along the way!\nHelp contractor Lloyd Andrews gather the resources needed to complete work on the prison. Manage your workers skillfully to finish the levels in time, while repelling attacks from Call Palone's hired thugs as they try to send your project to the bottom of the bay!\nKey Features:\nUse your skill and cunning to build Alcatraz on time!\nDefend your site against mobsters\nLearn scores of genuine anecdotes about Alcatraz\n50 varied and challenging game levels!","imageUrl":"https://media.rawg.io/media/screenshots/966/9666a8df1109ea58c3d0461ab796c1f4.jpg","releaseYear":2014,"developer":"Little World Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15606,"name":"The Return Home","genre":"Action","price":0.0,"description":"The house of a rabbit is attacked by reptiles from another dimension, and they prepare occupation of the planet by means of portals. The rabbit in panic decides to gather all the carrots, and further to exchange for the weapon for revenge. Whether the rabbit will be able to fight back evil reptiles and to return the house?\nFeatures:\nYou should avoid reptiles and to gather carrots.\nTo pass through enemy portals reducing a way.\nTo win the house using the weapon of a rabbit.","imageUrl":"https://media.rawg.io/media/screenshots/078/07835752e83c9a81ee0b2e803b2cff8b.jpg","releaseYear":2016,"developer":"AL-GAME","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15564,"name":"EeOneGuy Adventure","genre":"Action","price":0.0,"description":"A typical day, Ivan sits on a bench and looks far away...\nIn an instant a strange alien steals our protagonist his favorite thing! Finish this impossible platformer, return the cap back!\n-The Most difficult game of all time and peoples ;\n-You will not be the rights to a mistake. Death means that you will start your adventure again ;\n-Colourful pixel graphic ;\n-Nice music ;\n-A lot of secrets.","imageUrl":"https://media.rawg.io/media/screenshots/116/116aaf2d937ec4654389de21d8c27b93.jpg","releaseYear":2016,"developer":"Akakiy Petrushkin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14951,"name":"SHOCK TROOPERS 2nd Squad","genre":"Action","price":0.0,"description":"“SHOCK TROOPERS 2nd Squad”, the sequel to the NEOGEO fan favorite 2D action shooting game, returns to the missions on the Steam battlefield!\nProgress through the bullet hell, and put a stop to DIO's evil plans! MAIN FEATURES・ARCADE:\nPick up one of the four mercenary characters available, and fight your way through the bullet hell to put a stop to DIO, a terrorist organization who is threatening the world's leaders to submit to their will.\n・MULTIPLAYER:\nConnect to Steam and clear missions with a brother-in-arms far away via the Online Co-Op Play feature.\nEngage with a fellow countryman or foreign ally, and try to eradicate the terrorist threat known as “DIO”!\n・LEADERBOARDS:\nCheck your current rank & score in “SHOCK TROOPERS 2nd Squad”  at any time, as well as those of your friends and other top troopers!\n・SETTINGS:\nConfigure all types of video options, controls and volume sound settings to your preference for the most pleasant “SHOCK TROOPERS 2nd Squad” experience ever.\n*The language display can be chosen and changed at any time from the \"language\" tab in Properties.\n** WILL NOT RUN ON Windows XP **","imageUrl":"https://media.rawg.io/media/screenshots/143/14357484e7aa013b19ed991cd5a1fadf.jpg","releaseYear":1996,"developer":"DotEmu","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":14884,"name":"Dude, Stop","genre":"Adventure","price":0.0,"description":"\"Dude, Stop\" is a puzzle game, where the main goal is to not follow the rules and make everybody hate you. Break it, abuse it, skip the tutorial, ignore tips and tricks in the loading menu and - most importantly! - mute the narrator.\nFor example, stop reading this paragraph and skip to the next one. You're still reading. Still looking here. Annnd... done. You've broken your first rule and annoyed us a little bit. And didn't even buy the game yet! Wow, you're talented. Have you considered quitting your job and doing this fulltime?\nCollect all rewards, unlock all achievements and brag to your buddies that you've enraged some poor developer from a video game and made him scream at you just like in the trailer. Do your best. Or worst. Or both at once.Key features:\nDive into countless* puzzles carefully made by the developers. Some of them relatable, some of them not. Who cares, buy the damn game\nFully voiced narration of both good and bad solutions. You can ignore or mute it all you want, it's still there\nAll kinds of shiny rewards and achievements assembled by a hungry underpaid developer in a basement just so you can feel justified breaking another level and giggling for five seconds\nMany moments where you will be saying \"What?\", \"Why?\" and \"Preordering videogames is good\". Just kidding, you will mostly be just clicking stuff and dragging and throwing it all over the screen\nSelf-aware humor that simply tries waaay too hard. This includes timeless references that only our weird programmer can understand. Like \"42\" and \"You're gonna have a bad time\". What a nerd, haha\n* unless you count them. Please don't count them","imageUrl":"https://media.rawg.io/media/screenshots/a81/a810474052349689022b9bee73a9ad00.jpg","releaseYear":2018,"developer":"Team HalfBeard","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":14660,"name":"The Pit And The Pendulum","genre":"Adventure","price":0.0,"description":"Just Updated\nTrading cards added!\nNow available in game!\nAbout the GameThis is a quest based on Edgar Allan Poe’s “The pit and the pendulum”. A pit and a pendulum await you…\nA story about a man who survived suffering and being tortured by the inquisition in a Spanish prison. The main character was convicted for some crime and underwent torture. The court sentenced him to the death penalty. The convict woke up in complete darkness. He thought that he died and was in the afterlife.. The prisoner gathered all his strength and slowly got up, moved forward, and ran into a wall. He remembered horrible tales of the inquisition’s traps. This was on huge stone cell with traps.\nSpecial features:Beautiful professional graphics.\nThe plot is based on a classic novel.\nQuality sound accompaniment.\nHistorically accurate clothes and architecture.","imageUrl":"https://media.rawg.io/media/screenshots/9d6/9d670a8bfad4a3d0b886b9d958f5ff9c.jpg","releaseYear":2016,"developer":"Paper Pirates","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14176,"name":"Ladykiller in a Bind","genre":"Indie","price":0.0,"description":"My Twin Brother Made Me Crossdress As Him And Now I Have To Deal With A Geeky Stalker And A Domme Beauty Who Want Me In A Bind!! or, Ladykiller in a Bind\nForced to pretend to be her twin brother on a cruise ship full of his classmates and enemies, the Beast finds herself thrown into a game of complex social manipulation, as well as literal bondage. Can you win enough of their votes to get back the Beast's motorcycle? Will you get locked up in cargo for doing too unconvincing an impression of the Beast's brother? Or will you just spend the whole time brazenly getting the Beast's pussy wet?\nAn erotic visual novel by the creators of Analogue: A Hate Story about social manipulation, crossdressing, and girls tying up other girls.FeaturesTwo main romance routes... but don't let that stop you from making out with everyone else.Six nights worth of explicit, consensual, kinky lesbian sex... or live dangerously with four extra sex scenes with your brother's classmates who just want to fuck you up.Unique conversation system—instead of hanging off your every word, dialogue options appear as they occur to you and disappear as they become irrelevant to the conversation.Dynamic soundtrack by Isaac Schankler.Balance gathering votes to win favour with mitigating suspicion. The shy Stalker will help hack votes if you spend the night with her, but the sadistic Beauty will take care of your suspicion... for a price.Fully uncensored, but does include an optional \"safe for work\" Christmas sweater mode.","imageUrl":"https://media.rawg.io/media/screenshots/92d/92db400d3404b67d1cbffa374e16e959.jpg","releaseYear":2017,"developer":"Love Conquers All Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":12529,"name":"VRMultigames","genre":"Action","price":0.0,"description":"Play several diferent minigames designed for VR. This collection of minigames is designed specifically for VR from the start, and provides original games and experiments for people to try.The 3 Starting Minigames Are\nDrone Fight\nA lightsword game with drones, inspired by both lightblade VR and space pirate trainer. You can deflect or destroy enemy projectiles mid air, and return fire with your pistol.\nLast Stand This time, the only thing you have is your bow, use it to survive as much time as possible, as enemies will come to you, if anyone gets near, you lose.\nGoalkeeper Simulator A goofy minigame where you are a goalkeeper and defend the goal with huge telescopic hands. There are machines that will launch balls to the goal, you lose when you let too many pass.\nMore minigames will be added over time, and player feedback will allways be heard for the new minigames. The new minigames will be free too.\nRemember to have fun with it, and be careful, try not to punch a wall or a TV.\nIt works native for both Oculus Rift and HTC Vive.\nIf you like this game, try our VR action game, DWVR : http://store.steampowered.com/app/520750","imageUrl":"https://media.rawg.io/media/screenshots/e60/e602100d0347437c0830e3c3e8ef25bb.jpg","releaseYear":2016,"developer":"Mad Triangles","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12195,"name":"Major\\Minor - Complete Edition","genre":"Adventure","price":0.0,"description":"The Power to Manipulate Reality\nThe Struggle Between Two Worlds and Their Plagued Co-Existence\nA Political Battle On The Verge Of Revolution\nA Mysterious String Of Murders, Claiming Family and Friends\nAt The Heart of It All -- Is You\nA wave of murder and suicide has been hitting the country, all under circumstances more than mysterious. You play as one of the \"Lucky Two\", winners of a contest who have the honor of touring with an international pop idol. But as you arrive in Tokyo for the launch of this world tour, events quickly escalate. You have no choice but to delve deeper into dangerous territory -- all in the name of uncovering the truth of these enigmatic deaths. A truth that involves the dissonant connection to another world; and the inhabitants within who seek salvation. You are The Savior -- and it is your job to deliver a brighter future to this world.\nFeatures:\nLength Of Several Novels\n30 Characters to Interact With\nForge Friendships With An In-Depth Affection System\nSMS System: Send and Receive Text Messages To/From Characters\nMany Choices Leading to Different Experiences\nMultiple Endings\nSteam Trading Cards\nController Support\nSteam Achievements\nSteam Link and Steam Overlay Support","imageUrl":"https://media.rawg.io/media/games/5b6/5b6cc8103be6bede31a26fa3f2d23c6b.jpg","releaseYear":2016,"developer":"Klace","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11753,"name":"Loki","genre":"RPG","price":0.0,"description":"A fantasy voyage through the great mythologies, Loki allows the player to take on the role of one of the four heroes of the game, each drawn from a different mythology: a mighty Norse fighter, a fierce Greek warrior, a powerful Egyptian magician or an Aztec shaman who masters the secrets of the spirit world.\nWhatever hero the player adopts, he must come to the aid of the gods he worships. He will come to realize that behind the chaos that is threatening his world lies Seth, the Egyptian god of darkness and evil, who has returned from the kingdom of the dead.\nThe hero must therefore undertake an epic journey across the various epochs and myths. He will fight a multitude of monsters of all shapes and sizes, and even overthrow a few gods, on his way to preventing Seth establish his wicked reign.\nAn epic adventure across four great mythologies - Aztec, Egyptian, Greek and Norse -  allowing the player to live through many of the key episodes that mark these cultures (the siege of Troy, Ragnarok, ......) and setting him in the path of the most prominent figures within each episode (Achilles, Thor, Akhenaton...)\nChoose from four different heroes with radically different attributes and powers. Each hero has a vast array of spells and skills to help him through his quest.\nMore than 100 monsters of all shapes and sizes.\nDare to take on mythological creatures that struck fear into the hearts of our ancestors (Fenrir the giant wolf, the Minotaur in his labyrinth, ...)\nInnumerable story lines through random generation of decors and items, so that nobody lives the same experience and allowing the game to be played many times without the hero ever having the same set of weapons, armour or spells.\nWeapons, being made of two parts (loosely «handle» + «cutting edge») and from different materials, can be customised at the village forge to change characteristics. Magic runes, found along the way, can multiply a weapon's power.","imageUrl":"https://media.rawg.io/media/screenshots/ae7/ae7c51f4c96b5816e2430a2905e15780.jpg","releaseYear":2007,"developer":"Cyanide Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11478,"name":"Adventures On The Polluted Islands","genre":"Adventure","price":0.0,"description":"Adventures On The Polluted Islands – adventure game with elements of sandbox. You will play a small crab, armed with a boomerang. Help the survivors and go in search of salvation. Tasks, secrets, boss fights, easter eggs and much more are waiting for you!\nThe island, which is only inhabited by crabs, became a target for the storage of radioactive waste. The nature and the inhabitants of the island started to mutate. The only salvation is an escape. In the hope of finding a safe home, Crab hits the road. But whether on other islands safer? Whether radiation is the only danger?\nFeatures:Big islands, open for research\nDifferent quests\nMutated enemies\nA large number of objects that you can pick up\nEvil bosses\nEaster eggs on movies, TV shows, and more\nSecrets and mysteries\nGripping story with an intriguing plot twist\nSandbox elements\nThe atmospheric soundtrack\nThe graphics in the Pixel-Art style\nCut-scenes with animated comics\nAdventures are just beginning...","imageUrl":"https://media.rawg.io/media/screenshots/7a5/7a5de846adb52802398b1436c3a91d9e.jpg","releaseYear":2017,"developer":"Pinkerator","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11221,"name":"Life Beetle","genre":"Action","price":0.0,"description":"Ask yourself a question.. What will you do if you wake up in asylum ward next day? I think you will try to find a reason why you are here. Hmm.. Go ahead and try.. But if you can't do it just ask me. I always there in places like that. Always live over the wall, the next ward.. And I have a Secret.. Please, don't tell anyone.. I put it in the box for new ward tenants under their beds. No matter how you turn that box, the Secret will try to get out. And yes! You still want to know how to escape? I will help you.. But please, in that case don't believe the doctors.. They don't want me to help, they are afraid of our friendship.\nFeatures:\nOriginal gameplay (indirect interaction with one of characters, you can control the beetle by turning the space).\nOldschool graphic stylistic.\nLack of fourth wall (you are the main character, not the guy on the screen or running beetle)\nGravitational puzzles and, of course, your new friend that lives over the wall.. Or it's a trick, and there's nobody there?","imageUrl":"https://media.rawg.io/media/screenshots/3ab/3ab11b8cba7d8e22940d5ec80fb863ac.jpg","releaseYear":2017,"developer":"Grizlikyt","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10584,"name":"Shadows of War","genre":"Strategy","price":0.0,"description":"Feature List\nA 2D RTS Sidescroller Multiplayer game.\nMultiple Modes: Conquest, Rush, Classic Skirmish.\n20 different unit types including: Dropship, MBTs, Helicopters.\nOver 5 support strikes: Artillery, Tomahawk Missile, Harrier strike.\nBig and unique maps.\nA campaign and offline skrimish battles.\nIntense Online multiplayer battles.\nCompetitive (1v1) multiplayer modes.\nAbout the Game\nShadows of War is a 2D Real-Time Strategy sidescroller game.\nThe game combines classical RTS elements with new ideas into a 2D game.\nFight in massive battlefields against your worst foe!\nChallenge your friends in a 1v1 battle, show them who is in control.\nSome maps also have unique elements, that requires you to change your tactics. The bigger the map, the harder it will be. You always need to have an eye on every section of the map. Be fast to take counter measures of the enemy's attacks!\nThe game also offers the Hardcore mode, for old-school gamers that needs a challenge.\nYou are low on money, which means you can order less units onto the battlefield.\nSupport strikes will be rarely used, since they're costing too much.\nKeep track of your tickets, you can't lose a single one!\nYou really need to do everything to prevent the enemy from marching into your land.\nAlways do your best! Else, loosing can't be prevented.\nRemember the good old days, where games hadn't got any XP system?\nYou only played for fun, not for unlocks or that stuff? Like that?\nThen SoW is the perfect game for you, no DLC, no XP, no Micro-Transactions.\n1944, a German Science project, was sealed and hidden.\nIt was never meant to be found. But in 2013, a new Federal Chancellor was elected.\nThen, old research projects were activated again, this is where everything began...\nOne of the projects, were a bomb, not a casual one.\nThey built the bomb after the blueprints they've found.\nThen they tested it, the bomb detonated successfully, with a devastating effect.\nA world was left, that were pushed into the shadows, no hope, no life as it is known.\nNations in despair, began to wage war. The world, at the brink of total destruction.\nNow we are here. No alliances, all fighting for survival.\nRussia, now facing Germany again, on the battlefields of Europe.","imageUrl":"https://media.rawg.io/media/screenshots/cd7/cd7ed1015aa3031cdcc7c8aa24fd2e1f.jpg","releaseYear":2015,"developer":"TRI.G","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9663,"name":"Stationeers","genre":"Action","price":0.0,"description":"Inspired by the beloved Space Station 13, Stationeers puts you in control of the construction and management of a space station either by yourself in singleplayer, or online with your friends. Complex systems around atmospherics, power generation, medical, agriculture, food, and gravity require your thought and management at all times.FeaturesVarious dangerous environments to explore and develop including exotic planets and asteroid belts.\nDetailed construction system including architecture, power, and networking.\nScience-based atmospherics system including temperature, pressure, combustion, gas mixtures, water, and fire.\nGravity simulation. Lose structural integrity in a room and the room loses gravity.\nFull physics on dynamic items in the world, including atmospheric effects such as explosive decompression.\nFarm livestock and grow plants for food in space! Independent and immersive AI implementation for animals.\nConstruct complex factories in space using machines, conveyors, and computers.\nPerform surgeries, cure diseases, and other medical aliments faced by other Stationeers.\nComplex systems noted above are multithreaded for better performance.\nDetailed mining system with fully deformable voxel terrain on worlds and asteroids.This is not a casual game\nEasy to start but hard to master. Well, kind of easy. Maybe not really. This game has been designed for the hardcore players who want games that are very systems oriented. This is a game about complex systems and how you optimize them. The game presents a variety of science-based survival problems that you have to solve yourself, and then try and optimize your solutions over time. For those not seeking a very intensive and hardcore experience, this game is not for you.Make science your ally\nSpace is empty and the planets are unforgiving to human life. You and your friends will need engineer your way around how to meet your needs basic sustenance, and then longer term in managing power, excess heat, and thermal radiation. Utilize machines and computers to develop automated systems, improving them to build the most efficient systems you can.Manage every aspect of your Station\nWhether on a distant lonely planet, or deep inside an asteroid field, you control every aspect of building and running your station. Use a wide range of tools to construct the ultimate station to harvest nearby resources. Everything that your station requires will need to be built and managed by you and your friends.Construct elaborate Factories\nWhat do you do with all that ore you mine? Process it through machines and turn it into goods for more construction of course! Lots of specialist machines to build and configure such as smelters, sorters, centrifuges, stackers, conveyors, and more.","imageUrl":"https://media.rawg.io/media/screenshots/6d8/6d879ce2d4f56cd9c68d607faa78c714.jpg","releaseYear":-1,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5384,"name":"Supersonic Acrobatic Rocket-Powered Battle-Cars","genre":"Action","price":0.0,"description":"Take control of vehicles with incredible physics-based maneuverability, including boosters for launching high into the air or accelerating at break-neck speed on the ground. In the air, cars can roll, flip, jump, dodge and spin. In this team-based soccer inspired game, the vehicles maneuver to perform breathtaking saves, awe-inspiring shots on goal and gruesome demolishes of opponent cars.\n•\tHuge array of multiplayer options including local and online matchmaking!\n•\tExtensive stat tracking, rankings, and trophies!\n•\tRegister a team with your friends and work your way up the online leaderboard!\n•\tSave your game and even edit the footage to upload to YouTube!\n•\tPlay in the single player tournament or unlock new cars in the mini-games!\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\nSupersonic Acrobatic Rocket-Powered Battle-Cars, the logo, and other trademarks are trademarks of Psyonix, Inc and may not be used without permission.","imageUrl":"https://media.rawg.io/media/screenshots/308/3080c14f0ca0296916bbd4e5ecef4003.jpg","releaseYear":2008,"developer":"Psyonix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4429,"name":"Reality Fighters","genre":"Desconocido","price":0.0,"description":"Put yourself in the battle with Reality Fighters™! Use the PlayStation®Vita front and back cameras to scan your face or your friends' faces to create your own personalized fighters with unique visual style. Choose from several distinct (and crazy) fighting styles such as Wrestling, Muay Thai and even Ballet. Compliment your characters with over 400 costume pieces and 40 weapon types. Record original battle cries and victory slogans with the PlayStation®Vita microphone. With augmented reality technology, the world is literally your arena as the stages you brawl in are determined by the environment around you.\nComes with the Reality Fighters™ Online Pass that unlocks this game's full online features.\nDownload the full game today!\nOnline Pass code may be redeemed once and becomes associated with the PlayStation®Network account used to redeem it. Online Pass access rights cannot be transferred once the voucher is redeemed. Online Pass codes cannot be returned for cash or credit.\n1 player(s)\n575KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n©2012 Sony Computer Entertainment Europe. Reality Fighters is a trademark of Sony Computer Entertainment America LLC. Developed by Novarama Technology S.L.","imageUrl":"https://media.rawg.io/media/screenshots/89f/89fdfa0337f5d49bad19e8d3afc3107f.jpg","releaseYear":2012,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":966344,"name":"The Lamplighters League","genre":"Action","price":0.0,"description":"Deluxe Edition\nFight darkness with darkness by adding the mysterious Nocturne to your league. The Deluxe Edition adds this exclusive character to your available roster of agents, capable of traversing the battlefield with teleportation and picking off foes with her shocking attacks. Count yourself lucky that this mysterious skirmisher is on your side - now you see her, now you’re dead!\nThe Deluxe Edition includes the exclusive Nocturne agent, a Digital Art Book highlighting the inspiration and design behind The Lamplighters League, and the full game soundtrack from award-winning composer Jon Everist. Complete your collection and take on the Banished Court in style!The Lamplighters League Deluxe Edition contains:The Lamplighters League Base Game\nThe Nocturne Exclusive Playable Character\nThe Lamplighters League Original Soundtrack\nThe Lamplighters League Digital Art Book\nJoin Our Discord!\nAbout the Game\nSneak, steal, and shoot your way through a world of pulp adventure in The Lamplighters League! Globetrot across a variety of exciting locales around the world and outwit your enemies in strategic turn-based combat - and, if you play your cards right, you might just save the world.\nHarebrained Schemes, the creators of The Shadowrun Trilogy and BATTLETECH, bring you an all-new world set in an alternate 1930s, where a tyrannical cult called the Banished Court stands on the cusp of world domination. For millennia, all that stood between this sinister cabal and their plans were a band of heroic scholars known as the Lamplighters League.\nUnfortunately, the best of the best are all gone, so now it's up to the best of the worst.\nRecruit a team of misfits and scoundrels with unique abilities and unforgettable personalities, and chase the Banished Court to the ends of the earth in a mix of real-time infiltration, turn-based tactical combat, and a character-driven story of adventure and intrigue.\nStrategy Meets Story, in StyleControl a team of unique, dynamic characters and get to know their signature tactical abilities and roles in the team. Learn their stories and the world they inhabit by taking them on missions - every misfit brings their own style to the fight through unique moves that can turn the tide of combat.\nExplore a variety of thrilling locales and survey the battlefield before things heat up: sneak past enemies in real-time infiltration gameplay, pick off the stragglers quickly and quietly, and position your squad to get an edge for the fight.\nUse every advantage and dirty trick your agents have up their sleeves in exciting, turn-based combat. Add advanced abilities, gear, and augmentations to your agents to keep pace with the growing threat of the Banished Court!\nRace Against the Countdown to DoomsdayChase the Banished Court through an alternate-history world of the 1930s, from dockyards and deserts to jungles both urban and wild. Manage your choices at a global level and try to prevent your enemy from advancing their twisted schemes!\nRecruit new allies from the best of the worst: scour the globe for outlaws and outcasts and bring them onto your side before the Banished Court catches them first!\nEvery mission earns your team new resources and grows their abilities - but be careful, stress and injury can take their toll!\nCan you prevent the Banished Court from reshaping the world to their twisted will? Find out in… The Lamplighters League and the Tower at the End of the World!","imageUrl":"https://media.rawg.io/media/games/c7c/c7ccd246724aab1151476607c44ae0e1.jpg","releaseYear":2023,"developer":"Harebrained Schemes","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":856206,"name":"Tiny Rogues","genre":"Action","price":0.0,"description":"Tiny Rogues is a fantasy rogue-lite dungeon crawler with rpg and bullet hell elements.Defeat all enemies in one room after another and choose the next reward you'll gain!At the end of each floor, you have to face a difficult boss encounter!Level up and build a powerful and unique character!Key Features: Fight against rooms filled with enemies! Adventure through 10 uniquely themed dungeon floors with a total of 19 different boss encounters to defeat!\nDodge incoming bullet-hell-like attacks!\nLevel up and chose traits from a selection of over 60 different passive skills to power up your character!\nSpecialize your build in one of 3 core build archetypes, melee, ranged and magic!\nDiscover over 200 different weapons and equipment items that will make each run feel unique!\nUnlock 10 different character classes with unique passive skills!\nBecome permanently stronger by collecting souls to spend at the bonfire to unlock starting gift items and passive blessings which apply to each run!","imageUrl":"https://media.rawg.io/media/screenshots/35f/35f8dc152bc88906515b74c3d9a4ac8a.jpg","releaseYear":2022,"developer":"RubyDev","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":850682,"name":"Fire Emblem Engage","genre":"Strategy","price":0.0,"description":"In a war against the Fell Dragon, four kingdoms worked together with heroes from other worlds to seal away this great evil. One-thousand years later, this seal has weakened and the Fell Dragon is about to reawaken. As a Divine Dragon, use rich strategies and robust customization to meet your destiny—to collect Emblem Rings and bring peace back to the Continent of Elyos.\n\nTeam up with iconic heroes from past Fire Emblem games\n\nSummon valiant heroes like Marth and Celica with the power of Emblem Rings and add their power to yours in this brand-new Fire Emblem story. Aside from merging appearances, Engaging lets you inherit weapons, skills, and more from these battle-tested legends. The turn-based, tactical battle system returns with a fresh cast of characters you can customize and Engage to carefully craft your strategy.","imageUrl":"https://media.rawg.io/media/games/4c4/4c41c96a4ecbbff9ed23f62590e9b720.jpg","releaseYear":2023,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":846358,"name":"FLASHOUT 3D: Enhanced Edition","genre":"Action","price":0.0,"description":"CHECK OUT OUR OTHER GAMES:https://store.steampowered.com/app/1105330\nhttps://store.steampowered.com/app/860620\nhttps://store.steampowered.com/app/990030\nhttps://store.steampowered.com/app/1761870\nOUR STRATEGY GAMES:https://store.steampowered.com/app/1541790\nhttps://store.steampowered.com/app/1287000\nhttps://store.steampowered.com/app/1248060\nAbout the Game\nThe classical AG racer, FLASHOUT 3D, initially released more than 10 years ago, is back, to celebrate the upcoming launch of FLASHOUT 3! But we bring you not only the first installement of the series for FREE, but we have also remastered it and enhanced with upgraded graphics and new features! Check out the details in the description and don't forget to wishlist FLASHOUT 3 now!\nhttps://store.steampowered.com/app/1761870\nGet into one of your ultra fast ships and join the competition! Use rockets and guns to fight your way to victory in all events and become the best racer in the whole galaxy!\nDominate the grid, master your skills, upgrade your ships, listen to the great tunes, unlock all circuits and get hooked by the fun and exhilarating racing experience!\nFeatures and highlights of the Enhanced Edition:\n100% FREE!\nUpgraded graphics;\nShip physics improved;\nGamepad support;\nVibrations support added;\nImproved controls;\nRemastered intro;\nAdditional animations;\nImproved visual effects;\nNew UI during races;\nAnd more!","imageUrl":"https://media.rawg.io/media/screenshots/604/604919adef63472810c7fe76dcf47eb3.jpg","releaseYear":2022,"developer":"Jujubee","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":484529,"name":"Rage of Car Force: Car Crashing Games","genre":"Action","price":0.0,"description":"Rage of Car Force is a multiplayer PvP online game that will not allow you to break away, without a feeling of complete military dominance over the enemy.\nYou can smash cars, ram enemy, shoot and drive ahead, but also take revenge on him! Choose a new battle car without leaving the ride and continue the deadly car battles.\nAll modern legendary cars that can be upgraded!\nTake a look at your favorite car multiplayer shooters in a new way! Improve your steel rage car as you wish: from upgrade armor power to installing a sports body kit or painting in your favorite color.\nA huge arsenal of all modern weapons!\nExperience the classic shotgun, pistol gun, machine gun or rocket launcher, but also ultra-modern laser or plasma guns. Try real car crashing multiplayer games!\nImprove your weapons, upgrade your cars, train your skills to become a more effective shooter on the battlefield! Become a legendary fighter in the Rage of Car Force arena!\nFEATURES:\nImprove your car during the battle!\nTry all modern equipment types for every occasion. Deal max damage to the enemy or to make your armor stronger?\nYou can take everything you need with you or find bonuses directly on the map.\nPlay multiplayer games without limits!\nNo need to worry about running out of gas or ammunition. He came, saw, won - anytime, anywhere.\nExciting gaming features!\nChoose your battle style! Crazy war or planned attacks?\nA variety of battle arenas!\nTake part in various gaming tournaments, win prizes in the ratings!\nUse different types of weapons, select and combine upgrades! Improve combat vehicles! Show your superiority to the enemy.\nGet rewards not only for luck but also for gaming skills.\nChoose your playing style!\nCatching up with gunfights, crushing rams, a test of cunning and perseverance when capturing the flag of opponents, team unity or proof that even one is capable of being the best warrior - all the ways open here. Choose any - and drive ahead!","imageUrl":"https://media.rawg.io/media/screenshots/960/9607faa81ef6732ebd5dc6f82794b223.jpg","releaseYear":2020,"developer":"Extreme Developers","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":428798,"name":"PANZER BALL","genre":"Action","price":0.0,"description":"AboutPanzer Ball is about speed and agility. Complete races in this fast-paced 3D platformer that is inspired by the classic surf maps and bunnyhop modes from games of the past. This game includes both a singleplayer and a multiplayer experience. The online multiplayer is fully real-time so you can invite your friends and see who gets the fastest time. Join our community to get involved in experimental modes, early playtests and be part of the development of Panzer Ball.Features Balls!\nSingle-player races. Complete challenges across different maps and unlock new locations.\nMulti-Player races. Race against or with friends in REAL-TIME multiplayer matches.\nEasy to play, hard to master. It's just a ball that jumps, how hard could it be? Very hard..it can be VERY hard.\nServer Browser. Create a session and tune it the way you want. Search for the exact type of race you want.","imageUrl":"https://media.rawg.io/media/screenshots/b74/b7464eefc41129a08eef62b3049a7544.jpg","releaseYear":2020,"developer":"LODZERO","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":427614,"name":"Atlantica Global","genre":"Action","price":0.0,"description":"Atlantica Online is a free-to-play (F2P) 3D tactical massively multiplayer online role-playing game (MMORPG) developed by NDOORS Corporation. The game's primary setting is a fantasy-themed alternate history Earth composed of a diverse blend of historical, cultural, allegorical, and mythological elements.\nThe game world is primarily modeled after real-world geography with accessible locations on six of the seven continents as well as the mythical floating continent of Atlantis from which the game's name is derived.\nAtlantica, a powerful and magical civilization is the most looked upon producer of the material: Orikarukon. However, due to overwhelming greed, they have exhausted all the sources of Oriharukon and lost control of their magic powers. Atlantis disappeared but the remnants of Oriharukon survived.\nAs the descendant of the Atlantians, you must discover the world and save mankind from the evil influences of Oriharukon, together with the mercenaries you meet on your journeys.\nMercenaries - Collect more than 30+ mercenaries to aid you on your quests and battles! Create the perfect formation!\nStrategic Combat and PVP - Standard or Turn-based, strategize and defeat your opponents!\nHistorical Content - Interact with familiar NPCs from stories of the past along your journey, some of them can also become your ally. Travel places based on real continents and its countries!\nCustomizable 'MyHome' - Decorate, store items, train mercenaries, have a feast! Your home, your rules!\nGuild and Nation Conquest - Be a guild leader or unite a group of guilds and become a king of the nation!\nQuest and Dungeons - Over 20+ Dungeons waiting to be discovered and conquered!\nFull Customization of your Avatar! - Dress your character whatever theme you want, in fact you can dress your mercenaries too!\nCombine and Conquer - Conquer and wage war against other guilds who occupy other towns! Only the strong guild shall survive!\nAtlantica's publisher and developer, NDOORS Interactive, regularly releases new content updates which include, for instance, new dungeons, quests, NPCs, skills, mercenaries, outfits, equipment, mounts, and community features. Now, the game development and management is handled by VALOFE Global LTD and the and being supported by the VALOFE Operation team.","imageUrl":"https://media.rawg.io/media/screenshots/df6/df678aef82bc9f3e41c8409813722ae2.jpg","releaseYear":2020,"developer":"Nexon","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":374542,"name":"Dark Nights with Poe and Munro","genre":"Adventure","price":0.0,"description":"Adventure in the strange town of August with radio host sweethearts Poe and Munro! Guide them as they tackle six different supernatural mysteries together including a talking painting that grants wishes, a nightmare stalker who just won't let go, and a jilted ghost who's looking for everlasting closure. Will you be able to keep Poe and Munro together, and alive?\n* Six simultaneously released, fully interactive episodes\n* Hours of full screen FMV video\n* An intuitive point and click timed hot-spot interface\n* Hundreds of branches and multiple endings\nYou’re listening to Radio August, Dark Nights with Poe and Munro...\n+ From the developers and creators of the award winning and Guinness World Record breaking \"The Infectious Madness of Doctor Dekker\" and \"The Shapeshifting Detective\" (TSD)\n+ Starring Klemens Koehring (TSD, Sniper Elite, Control) and Leah Cunard (TSD) as Poe and Munro, with a special guest appearance from Aislinn De’Ath (Doctor Dekker, TSD) and many guest voiceovers including Justin McElroy (The Adventure Zone, My Brother My Brother and Me), Jesse Cox (Monster Prom, TSD), and Joseph Beacham (My Time in Portia)\nDark Nights with Poe and Munro is a standalone spin-off set before the events of The Shapeshifting Detective, with different gameplay and all new stories.\nCAST\nPOE ... Klemens Koehring\nMUNRO ... Leah Cunard\nVIOLET ... Aislinn De'Ath\nQUENTIN ... Andre Lecointe\nHENRIETTA ... April Moon\nMISS CLAY ... Ashleigh Cole\nMILLICENT ... Ayvianna Snow\nWESMARIE ... Effy Willis\nDALLAS ... Ingrid Evans\nMADAME BARATSKY ... Lara Lemon\nTOOMS ... Peter Revel-Walsh\nROSE ... Rachel Cowles\nJONES ... Rick Romero\nKASPER ... Vincent Gould\nJOE ... Warrick Simon\nGUEST VOICEOVERS\nFRANKIE ... Justin McElroy\nBECK ... Joseph Beacham\nISI ... Joe Maw\nJAZ ... Jessica Kinghorn\nCALLER 2 ... Barry Aldridge\nARVIN ... Jesse Cox\nERIC ... TBC\nEDDI ... TBC\nQUEENIE ... TBC\nHELENA ... TBC\nQ ... TBC","imageUrl":"https://media.rawg.io/media/screenshots/f55/f55dcdab1d2ec19679154e0066238e4f.jpg","releaseYear":2020,"developer":"D'Avekki Studios","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":325101,"name":"Destiny 2: Shadowkeep","genre":"Action","price":0.0,"description":"As heroes turn their attention to the frontiers of our galaxy, new nightmares have emerged. Join Eris Morn on the Moon, arm yourself with new Exotic gear, and brave the Black Garden and Pit of Heresy. You must confront a sinister evil before it reaches out to cast humanity back into an age of darkness.","imageUrl":"https://media.rawg.io/media/games/023/02324a3d36d48a4cc1aab34c8ad6a443.jpg","releaseYear":2019,"developer":"Bungie","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":323148,"name":"Tales of the Black Forest","genre":"Adventure","price":0.0,"description":"Trapped by unknown force, high school student Kihara Kashin was trapped in Kuromori Chou.\nShe accidentally ran into Kiritani Yuki when she was finding a way out.\nShe also found out that to get out of Kuromori Chou, she had to travel to the past.\nAnd so, the adventure begins.\nBut what lies ahead, is not just the enigma hiding behind Kuromori Chou.\nAlso the strange but exciting world of yokai.\nFeature\n·The main story has 3 chapters, each one is so fascinating that you might find yourself drowning in it.\n·The story is based on events happened in the real world. But with the whimsically strange mix of our ideas, the story has become even more attracting.\n·Simple but vivid wording, the game provide a ride of thrill.\n·Finish what we started is one of a few things we always keep in mind. You’ll get to experience all the main story right now, side quests, however, will have to wait until fall of this year.\n·No 2 souls are alike, so do the characters in this game. With all the company you can have in the world, you won’t be alone.\n·One side note, there will be a LOT of cats!!!!\n·Unique pixel anime style, this world will surely rock yours.\n·Puzzles that are just right and riddles with deep thoughts will provide you with a ride so smooth you’ll never get bored in this world.\n·So many Easter Eggs and Bonuses in Kuromori Chou, try your best to find them! They might just make your day.","imageUrl":"https://media.rawg.io/media/screenshots/44c/44c0f58ae5475e69458e13a146b9703b.jpg","releaseYear":-1,"developer":"拾英工作室","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":278016,"name":"Neverinth","genre":"Action","price":0.0,"description":"The gods are dead and the tree of life, Yggdrasill, summons her last hope to the Neverinth. History’s strongest women heed the call and begin the trial but only those who pass will earn the sacred title of Valkyrie.\nExplore the everchanging halls of the Neverinth and uncover the history of the Valkyrie. Do glorious battle against the beasts and monsters of Norse legend and uncover the hidden pasts of each heroic woman. But their trials will not be easy as they face down those that haunt the sacred halls of Valhalla, and face down aftermath of Ragnarok.\nConquer the three-dimensional labyrinth and break through the limits of survival.\nMaster powerful, paced combat that is as punishing as it is rewarding.\nCollect and wield an arsenal of incredible weapons.\nEngage in risk-reward combat by exerting the strength of the Valkyrie.\nImmerse yourself in Norse mythology and battle the enemies of Midgard.\nWitness the danger and horror of boss battles from the depths of the Old World.\nDedicate yourself to the fallen gods and gain their power. Unlock their weapons and skill.\nUnlock content including levels,  new characters, monsters, gear, and skills.\nPlay as five different Valkyrie, each using their unique abilities and discovering their lost memories.","imageUrl":"https://media.rawg.io/media/screenshots/b6d/b6d822312595c5d7077926fd8752d062.jpg","releaseYear":2020,"developer":"CreAct Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":233968,"name":"Steel Division 2","genre":"Strategy","price":0.0,"description":"COMMAND YOUR ARMY. FIGHT YOUR BATTLES.\nSteel Division 2 pushes the limits of the WW2 RTS experience. Set on the Eastern Front in 1944, this sequel of the critically acclaimed Real-Time Tactical game puts you in charge of your entire army during Operation Bagration, the Soviet offensive against Nazi armies in Bielorussia.\nPlay as a General in the 1:1-scale turn-based Dynamic Strategic Campaigns, as a Colonel in the epic Real-Time Tactical Battles, as an Weapon Expert in the brand-new Deck Building System.\nWith more than 600 units, 25 maps, and multiple game modes, Steel Division 2 lets you play as you want and offers hundreds of hours of gameplay in solo, multiplayer and coop.\nMassive 1:1-Scale Dynamic Strategic Campaigns\nRelive history in the huge single player Dynamic Strategic Campaigns: lead thousands of men on up-to 150x100 km maps, plan your batallions' movements, manage supply and execute your strategy in week-long campaigns in this historically accurate turn-based game mode. Every batallion is the same as it was during the Operation Bagration.\nPick your side and relive this massive offensive or rewrite the course of events. Decide which batallion will take part into battle, fight every one of them in real-time tactical combat, or use autoresolve for a pure Strategic experience.\nMore than just another game mode, the Dynamic Strategic Campaigns are an entire new game within the game.\nAuthentic Real-Time Tactical Battles\nField over 600 extremely detailed units, including the iconic T-34 tank, the Katyusha multiple rocket launcher and the IL-2 ground-attack aircraft! Select your division, pick the units you will send to battle, and build the perfect battlegroups in the brand new deck system, allowing more tactical freedom than ever.\nFight in the 25 new available battlefields, analyze the terrain and use your tactical skills to give the right order at the right time and dominate your enemy!\nMain features\nBrand new turn-based Dynamic Strategic Campaigns\nNew setting, the Eastern Front, with the mighty Red Army and Axis powers\nOver 600 historically accurate units across 18 new divisions\nRealistic battlefields spread across 25 different maps\nSubstantial changes to the Deck building mechanics\nNew, realistic art direction to deliver a more immersive visual style\nRevamped combat offering a more refined tactical experience\nTons of game modes, offline and online, including co-op and massive 10v10 multiplayer battles","imageUrl":"https://media.rawg.io/media/games/b56/b5615fa3a6ae9d4ca77996c4c454afc9.jpg","releaseYear":2019,"developer":"Eugen Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":64062,"name":"Mini-Dead","genre":"Action","price":0.0,"description":"A small game about boss fights\nMini-Dead is a short but intense boss fighting game, using a simple but incredibly effective game mechanic that runs at 144 fps which is perfect for those who want to put their 144hz monitors to good use!\nThree bosses stand in your way along with a fourth, secret fight.Simple but effect game mechanic\nThe controls are simple.\nYou move with the mouse to dodge attacks.\nClick and drag to create a piercing beam that damages enemies.\nRelease left mouse button to teleport to the end of the beam.\nWhat better way to fight bosses than to use your mouse! The ultimate hardware for reflex based game play.Why \"Mini-Dead?\"\nBoss fights are cool. The feeling of overcoming a boss is pure bliss. Mini-Dead is a compressed, little brother of meatier game Dead.\nCheck out DEAD on Steam: http://store.steampowered.com/app/527150/Dead/","imageUrl":"https://media.rawg.io/media/screenshots/794/7942a0ec857fc33bde0b4eef14c0c9f8.jpg","releaseYear":2018,"developer":"Alec Smith","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61323,"name":"Bus Simulator 18","genre":"Simulation","price":0.0,"description":"Whether in the industrial or harbour zone, downtown, in the surrounding villages or the business park, in Bus Simulator 18, you experience up-close the exciting everyday life of a bus driver in a vast and freely drivable urban area. Get behind the wheel of your 8 original licensed city buses from the great brands of Mercedes-Benz, Setra, MAN, and IVECO and transport your passengers safely and punctually to their destinations, either solo in single player mode, or with friends in real-time multiplayer mode.\nAs a bus driver in the 12 different districts, you’ll face the challenges of the traffic in a big city and everything that entails. Don’t be deterred by freak weather conditions, potholes, traffic jams, fare evaders, accidents, construction sites, night driving and specific passenger requests. On the contrary, take full control of your bus, earn money, gain a good reputation owing to your safe and punctual driving style and enjoy almost limitless driving pleasure in the authentic urban locations. Use the thousands of miles of virtual roads and streets to gain new districts, new buses and new customisation options.\nWith the extensive modding support of Bus Simulator 18 there are no limits: create routes, build your own buses, create bus liveries, design new maps and share them with the community, or download and install the modding content available from the Steam Workshop to enhance your game experience.\nBut drive carefully with the buses you build! Don’t cause any damage or accidents and watch out for the speed cameras located around the city, or it could have a negative effect on your reputation, not to mention your wallet.\nSo, what are you waiting for? Your shift has already started!Features:8 buses from 4 leading manufacturers are faithfully reproduced in meticulous detail, including the Mercedes-Benz Citaro K, Mercedes-Benz Citaro G, MAN Lion’s City bus, MAN Lion’s City CNG articulated bus, SETRA S 418 LE business, SETRA S 416 LE business, IVECO BUS Urbanway and the IVECO BUS Urbanway CNG articulated bus.\nIn real-time multiplayer mode you can drive around the 12 districts and over 5.8mi² of routes in the freely drivable urban area with up to 3 friends and therefore promote your bus service.\nThe updated progression system and the comprehensive management element, including route planning, the purchase and sale of buses, staff planning and numerous statistics will guarantee long-term game motivation.\nFor novices and pros: you can play in a simplified or a realistic mode.\nModding: let your imagination run wild and create routes, build your own buses, design bus liveries, create new maps and share them with the community. You can also download and install the modding content available from the Steam Workshop to enhance your game experience.\nSupport for popular steering wheels, gamepads, Tobii eye tracking and TrackIR.\nAuthentic bus sounds, extensive tutorial and passenger voiceovers in English and German to provide even more atmosphere.\nControl your bus in different weather conditions, both day and night.\nCustomisation: fully customise your buses with different colours, patterns and advertising panels.\nAuthentically reproduced cockpits of the 4 manufacturers, equipped with numerous individual functions.\nSmart traffic AI and a range of challenging traffic situations await you (bus station, night driving, construction sites, diversions, long-distance journeys, potholes, traffic jams, accidents and speed bumps, etc.).\nFor a complete gaming experience, a variety of incidents in the bus, e.g. interior soiling and debris, special passenger requests, fare dodgers, loud music and cars parked in designated bus bays.\nModern technology: The Unreal® Engine 4 provides a high level of graphic detail and stunning simulation quality.\nCreate your own license plate with the license plate generator","imageUrl":"https://media.rawg.io/media/screenshots/499/4998b1bebd78cdd5d0173d1f91d19263.jpg","releaseYear":2018,"developer":"stillalive studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":53805,"name":"Disney's DuckTales 2","genre":"Desconocido","price":0.0,"description":"DuckTales 2 is a platform video game developed and published by Capcom and is a sequel to the original DuckTales based on the Disney animated series of the same name. Released on the Nintendo Entertainment System in early 1993, the title was ported to the Game Boy handheld system in Japan and North America at the end of the year.\nThe game was included in The Disney Afternoon Collection compilation for PC, PlayStation 4, and Xbox One released in April 2017.","imageUrl":"https://media.rawg.io/media/screenshots/0d8/0d81ddcc198f1590c147cf8390a812c1.jpg","releaseYear":1993,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy"}]},{"id":49451,"name":"Perceptions of the Dead","genre":"Adventure","price":0.0,"description":"The first thing you need to know is that ghosts are real.\nThe rest, you can only learn on your own.\nFollow three stories set in a world where the dead linger, and things far worse wait beyond the veil.\n-----------------\nThe Phantom Ice Cream Truck - Follow a denizen of the border between life and dead as he answers the call to rescue a missing child.\n-----------------\nPerceptions of the Dead - Tyrone has  made it his business to help solve the troubles of those afflicted by the undead, but what seems like a case of a benign haunting may find him risking more than his life, but his very soul.\n-----------------\nJill Count - Jill has had moderate success as a streamer, and to mix things up, this Halloween she is going to life-stream a visit to a haunted hospital. The twist? It's actually haunted.","imageUrl":"https://media.rawg.io/media/screenshots/ff4/ff4711f0013222de4aae994102b538f4.jpg","releaseYear":2017,"developer":"Ithaqua Labs","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":46389,"name":"Bones game online","genre":"Simulation","price":0.0,"description":"This game is a simulator of a board game.  The main target of the game is to get 1000 points. A player rolls 5 bones (dice) and collects points.  Look at screenshots to find out rules of the game.\nThe game provides:\n- playing online  with a bot or a real person\n- regulations of the game are available inside the client\n- mouse control (except login part)\n- check how lucky is your day today\n- balanced rules\nThe history of the Bones Game Online:\nOnce in a cold winter night at the Polar Circle when the electricity was turned off a couple of guys have decided to play a board game. They have decided  to mix different board game regulations to clarify their game rules. As a result of this the game became exciting. In a couple of years the balance of the rules became perfect. Players enjoyed the rules of the game but there was one small problem: it was impossible to play if a player is alone. Therefore,  8-th of April 2016 a board bones game became Bones Game Online.","imageUrl":"https://media.rawg.io/media/screenshots/565/56516f449f995a6c3694285d54698151.jpg","releaseYear":2017,"developer":"Alexander Shvab","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44579,"name":"Solenars Edge REBIRTH","genre":"RPG","price":0.0,"description":"Alcornagia, a damaged world plagued by warfare and engulfed in darkness is dying. The only hope for it's restoration is a legendary gem called the Solenars Edge, created from the heavens. This gem is in the shape of a sword. It has the power to seal away the darkness and revitalize the world or to create an army of the undead at the wielder's beck and call to unleash never ending chaos. The choice is in who ever wields it. There are many who wish to use the gem for selfish desires, but only a select few may have the chance to banish the darkness.\n~Remastered version of the original Solenars Edge series.\n~Embark on a thrilling adventure with a huge cast of ever changing, yet enduring characters!\n~A bunch of fun secrets and mini games.\n~8 character turned based battle system with the ability to swap between many more characters.\n~Several jokes and hidden references.\n~Enduring Soundtrack.\n~Game style similiar to old fashioned FF titles.\n~Over 10+ hours of story based gameplay with optional content to sink your teeth into.\n~Solenars Edge II: Aurora of The Seventh Dawn short story book (Digital) included with purchase.","imageUrl":"https://media.rawg.io/media/screenshots/d55/d55086c6c46c385c5b6fad94a7296bee.jpg","releaseYear":2017,"developer":"Syukino","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]