[{"id":13534,"name":"Sphere III: Enchanted World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ed/0ed1c329dc21a68dec667ca8450c5b93.jpg","description":"Sphere 3: Enchanted World is a brand new MMORPG created for the most hardcore players. Missed the unstoppable PVP-action with non-target system? This game surely will bring you all you want! Take part in epic sieges of huge castles. Use a wide arsenal of siege engines to achieve your goal. Do not focus on the only one strategy — you have thousands ways to be victorious!\nSphere 3: Enchanted World has a strong classic fantasy storyline which currently consists of more than 1000 quests. It will take approximately 600 hours in total to make a complete journey through the story of political deceit, war atrocities and vile treachery.Key features:The world of total PvP: Battles and engagements between individual players, parties, clans, alliances and factions in different modes can occur on the most parts of the game map, sometimes with no exception for stating areas.\nNon-target, no compromises: Sphere 3 combat system provides total freedom of aiming, dynamically calculates the damage and allows a player to quickly pick an optimum attacking ability at a given range with its unique color telltale crosshair.\nPerformance for the masses: Moderate system requirements make Sphere 3 a perfect place for mass PvP action.\nA thrilling story-driven adventure: The game’s storyline comprises more than 1000 quests moving through which a player makes up to 80% of levelling progress.\nEpic, exciting and challenging castle sieges: Conquering a castle is impossible without using an arsenal of siege weapon and demands a whole list of objectives to be completed by attacker (capture the flag points, wipe out NPC defenders, breach the gates etc.).\nIt’s all about castles: Owning a castle is a headache of micromanagement, defensive upgrading and constant state of alarm which pays off in the end by anopportunity to get some of the best items available in the entirety of the game.\nUnforgiving yet fair PK (Player Kill) and Karma system: PK is not persecuted in numerous free PvP zones, while gathering bad karma points causes an offender to lose both gold and items after death.\nWell-balanced PvP team: Characters of 9 different classes with their own unique strengths and weaknesses combined in the way to functionally complement each other on the field of battle.\nDiverse PvE entertainment: Dungeons, world bosses, global cooperative missions on the enemy territory etc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NIKITA ONLINE","platforms":[{"id":0,"name":"PC"}]},{"id":12193,"name":"Bot Vice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76f/76f8bdb885c872883e9682bd1800d71a.jpg","description":"More Games!http://store.steampowered.com/app/643880/Strikey_Sisters/\nhttp://store.steampowered.com/app/375120/Super_Star_Path/.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"DYA Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10619,"name":"Atom Fishing II","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/861/861748895130fc840b75f2c79c31ddfd.jpg","description":"Atom Fishing 2 is a dynamically developed MMO fishing simulator with elements of survival and RPG that takes place in a postapocalyptic world. Here you can not just catch the fish, but also choose what to do next with it - to process it under crafting, sell it or give it as part of daily tasks. You can create new rods and then upgrade and modernize it to catch bigger and rare fish.\nBe also aware! In our post-nuclear ponds there are many different fish - together with ordinary species you can easily catch some mutants!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Woolf","platforms":[{"id":0,"name":"PC"}]},{"id":9597,"name":"Bierzerkers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3c/a3c70e88be008456593ee32aa2401cc8.jpg","description":"You are dead. What happens next? Drinking and fighting, of course! As a reward for your brave deeds in Midgard (or, in the case of the Drunkard, his extreme alcohol tolerance), the gods have let you ascend to Brewhalla, where you get to do your favorite things for eternity: boozing and brawling. Have a brew, grab a weapon, and crush, kill, destroy, DRINK!\nSet in a vivid, stylised, Norse afterlife, Bierzerkers is a multiplayer melee arena combat for all comers. While quick to pick up and get in some killing, the game has a great deal of depth, both individually and as a team.\nCrush your enemies, see them driven before you, and hear the lamentations of their sheep!Key Features\nTeam-based, 5v5 online melee combat\nFast, arcade-style gameplay\nQuick matches\n5 character classes with unique abilities (and more to come!)\nEasy to pick up, but hundreds of different class, ability, and environmental interactions make mastery elusive\nGorgeous mythical environments full of color and majesty\nJoin Early Access to shape the development and future of the game","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Shield Break Studios","platforms":[{"id":0,"name":"PC"}]},{"id":687,"name":"Happy Dungeons","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c97/c97f30034b71e8864127ff221e8e7aca.jpg","description":"Cut loose in the dungeons with up to four friends in Happy Dungeons, the cooperative action RPG that's just made for multiplayer gaming! So grab a pad and enjoy the witty, upbeat storyline that's never short of a surprise, all set within a bizarre world overflowing with comical characters. Vibrant graphics combine with high-speed, stomach-churning action to give you an experience like nothing else! Customize your character to your heart's content and go nuts in your own unique way! Embark on the adventure of a lifetime as you join forces with your friends and family to take out those dastardly villains! Are you ready to embrace the challenge with your own party of little lunatics?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Toylogic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":418471,"name":"Hidden Through Time","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46d/46d510ee5f0073dc9fb19d66e6688948.jpg","description":"Hidden Through Time is a cute game of hide and seek with objects scattered throughout the wonderful history of our world. Use cryptic hints to discover every secret as you explore the colourful hand drawn levels.\nFind enough objects to advance to the next stage, and make your way through all four great ages.\nStill desire more or wish to unleash your creativity? Our map editor is available to anyone, allowing you to create your very own levels and share them on our cloud! Here you can also discover, play and rate levels made by other creators from all around the world!\nSo join Clicky on his wondrous adventure in Hidden Through Time!\n1 player\n500MB minimum save size\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nCopyright Crazy Monkey Studios","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Crazy Monkey Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":299615,"name":"Recompile","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6c/b6c21a9548977e34ea62fde1d6ea5612.jpg","description":"PREPARE FOR SYSTEM RECONFIGURATION\r\nExplore the world of Recompile in this atmospheric, single player adventure game set in the sprawling digital landscape of The Mainframe.\r\nWhether you engage in platforming, intense combat or environmental hacking, your playstyle will determine the dark interwoven narrative that explores machine intelligence, computational logic and disastrous ecological consequences.\r\nFEATURES\r\n3D sci-fi Metroidvania with a branching narrative system.\r\nA range of futuristic weapons and super-powered abilities.\r\nIntense and intelligent combat with a host of deadly NPCs and boss battles.\r\nHack through environmental circuitry, logic gates and even enemies.\r\nMultiple endings depending on play style.\r\nThree difficulty levels: storytelling, default and hardcore.\r\nReactive soundtrack of blistering electro.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Phigames","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":52872,"name":"Dino Crisis 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/463/463f694606f574d6440e22d2c6c5629d.jpg","description":"Dino Crisis 2 (ディノ クライシス2, Dino Kuraishisu Tsū) is an action-adventure video game for the PlayStation developed and published by Capcom. It is the second installment in the Dino Crisis series.\nAfter the events of the previous game, unsafe research into time-distorting Third Energy has resulted in an entire research base, military institution, and fictional metropolis of Edward City to be transported to another time; along with all of its inhabitants. Secret Operations Raid Team operative Regina returns as one of the main playable characters, sent along as an adviser to the rescue team that travels through time to find survivors of the time displacement and recover data on the Third Energy experiments. Dylan Morton, the rescue team leader, is the second playable character. Despite Dylan and Regina initially going their separate ways, they end up joining forces to find a way back to the present. The player switches between controlling Regina and Dylan at specific points during the story.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":41839,"name":"3079","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/25a/25a9bffe55a526d2db42b6122595af98.jpg","description":"3079 is a futuristic, open-world action first-person role playing game. All areas, buildings, items, quests and characters are randomly generated. You will find unique lands & challenges. I hope you enjoy it![/b]\nPlease follow Phr00t's Software for giveaways, updates & more! https://www.facebook.com/phr00ts.software\nYou arrive on a planet experiencing constant war. It is your duty to find out why the warring factions cannot find peace on their own & hopefully restore it yourself.Java RequirementMake sure you have Java 7 Update 45 (or better) installed!\nOn Windows, if you have trouble, you may need to uninstall other versions of Java.\nYou can get Java from: http://www.java.com/getjavaKey FeaturesTrading Cards are here!\nPractically endless, open-world exploration\nFuturistic weapons and items procedurally generated for endless character equipment\nDifficulty that increases as you explore further (don't worry, items get better too!)\nFully functional Multiplayer with Twitter integration\nProcedurally generated quests for rewards and story advancement\nFortress building using a construction tool\nBody-part specific damage calculation and dismemberment: Head Shot!\nSkill system for things like engineering, charisma and camouflage\nDifferent biomes (grassland, mountains, snow, poison, desert, sea etc.)\nComplete storyline that has a start, middle and end\nSloped surfaces and higher polygon models gives the world a new, less \"blocky\" look\nChallenging artificial intelligence -- enemies and allies will dodge, follow, inspect sounds etc.\n3D effects like anti-aliasing, damage & underwater blurring\nSoft ray-traced lighting (makes for nice shadows to hide in)\nA very fast, efficient multithreaded engine for smooth, high FPS gameplay almost completely free of \"lag\"Recommended GuidesCommunity Hub: http://steamcommunity.com/app/259620/guides/Game Serieshttp://store.steampowered.com/app/329770\nhttp://store.steampowered.com/app/263360","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Phr00t's Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":30606,"name":"Need for Speed: High Stakes","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b9/2b9bfacefc4a846a7c0f5fa73987a76c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":28771,"name":"FIFA 07","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b7c/b7ca8e4d772a4b0569a1b52225f18f8f.jpg","description":"Experience the revolution of football gaming. FIFA 07 brings you the most believable recreation of football yet seen for videogames blurring the boundaries between the virtual world and real life. Advanced physics and superlative visuals combine to realise the truest expression of the world's greatest sport.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":21157,"name":"3SwitcheD","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/639/6392165155af1651ac6352e0a2050a8d.jpg","description":"Be careful! This Game is addictive! You won´t find more challenges, more speed, more fun and more treasures anywhere in the known Universe!\n3SwitcheD™ combines classical Gameplay with fascinating new technologies. Find yourself in a new World arcade gaming. The brand-new 3D- and 3D-ET-Technology lifts the whole Game really in a new Dimension. Using the 3D-ET™-technology 3SwitcheD™ not only gives you fantastic real 3D looks, it works 3D. Using any connected camera the game will scan your face and you will be able to turn the view only by looking in the direction you want it to! This brand new Technology will give you a Gaming experience never imagined!\nFor all Players not using this feature the Game still provides fantastic looks and a bunch of challenges! A bunch of challenges is waiting for you, are you ready?Six highly addictive, vastly different and challenging modes set in an innovative 3D environment. Clear clusters and even shift gravity to rearrange gems for an all-new experience in puzzle and strategy gaming. Boost your high scores out of orbit with vertical, horizontal and even diagonal moves to blast those brilliant gems and gain access to the bonus levels!SIX DIFFERENT GAME MODES:Snazzy Swap: Make those rows collapse and try to hit two with one strike.\nClearing Clusters: Kick those clusters cleverly to unlock rewarding bonus levels.\nFalling Stars: Line up incredibly long rows until the core overloads.\nMoving 4-ward: Test your gem swapping strategies and try the quadrature of diamonds, but make certain and form large clusters for a maximum payload of points.\nPathfinder: They just want to play… but those nasty little diamonds are blocking your path into the heaven of high scores! Show them who’s in charge!\nGravity Switch: Up is down, and down is up! Shift gravity as you please to strategize your way into unlocking bonus levels.KEY FEATURES:Unique 3D-ET™ Technology to control the perspective\n3D playing-field and fantastic animations\nSix totally different Game-Modes with unique challenges\nChoose between two music scores and two charming voices\nTrack your score against others online!\n12 different languages","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Reality Pump","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20921,"name":"Curse of Mermos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/399/3993ebc70a4412169d0b14eec35db7b6.jpg","description":"Curse of Mermos features Abdu, an adventurer searching for fame and fortune in the ruins of Ancient Egypt. One of the greatest mysteries still standing is the location of Pharaoh Ebo, once a great ruler of the land. Abdu is on the brink of a great discovery but he will find out that Ebo’s tomb hides more mysteries than he thought.\nCurse of Mermos is a free, lighthearted hack and slash game with fast paced action and challenging combat. Players wield the Hammer of Horus or shoot the Crossbow of Neith to defeat hordes of monsters in the tomb of Ebo. The game features unlockable abilities and skill upgrades for personalized combat. Special game modifiers allow players to customize each playthrough.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"TEAM101","platforms":[{"id":0,"name":"PC"}]},{"id":19824,"name":"Wishmaster","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ca/1ca6759b17a55c846136a659489b2894.jpg","description":"Wishmaster is a game with an interesting and complex history of human desires and about the fact that not everything will go the way you wish. The game includes a part with Visual Novel, where you will learn about the world and the people themselves, and, certainly, about their dreams. The second part of the game is the game Match-3, where you will search for mysterious energy to fulfill all the dreams of mortal creatures. Also you will be able to track your progress in the gallery.\nYou start the game as a magical creature that was born only a few moments ago and doesn’t know anything about itself. Using the advice of the master and the power of Wishboard, you will fulfill the wishes of the living. But do people really want their desires to be fulfilled? And is it possible to trust a new “friend”?\n- More than 30 characters with diverse wishes\n- You can decide which wish to fulfill\n- Company mode for not one playthrough!\n- Mode on time for relaxation\n- Gallery with your progress","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mantis Games","platforms":[{"id":0,"name":"PC"}]},{"id":19241,"name":"Hearts of Iron 2 Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07d/07dad72dd41319d2ea2752b0b4155626.jpeg","description":"Includes Hearts of Iron II plus the two expansions, Doomsday and Armageddon\nWhen Germany is defeated in 1945, the Allies and the new Soviet alliance fight for supremacy. World War III is drawing closer.\nPlay as the ruler of one of 175 countries through World Wars II and III. As the Allies and the Soviet Union clash in Europe, the fate of the world hangs in the balance.\nDetailed diplomacy and production systems with help functions to avoid micromanagement.\nMovement-is-attack combat system making warfare more realistic.\nMission-based Air and Naval system, giving options for logistical strikes and targeted bombing.\nNew political system with possibilities to change the political base of your country during the war.\nFifteen battle scenarios optimized for an evening or two for gaming. Historical scenarios like Case White, Operation Barbarossa and alternative history scenarios like Operation Watchtower and Case Green are included in the game.\nCo-operative multiplayer, enabling players to share the same country while playing.\nDoomsday Expansion Features\nWorld War III scenario with an alternative historical outcome. Play the Soviet alliance, the United States or any country of your choice as new superpowers rise to power on the global stage.\nExpanded tech trees with considerable detail in a new decade of warfare, allowing you to develop tactical nukes and other kinds of nuclear warfare as well as helicopter squads, Escort carriers and much more.\nImproved Diplomatic/Intelligence System reflects the increased political tension of the 1950s.\nArmageddon Expansion Features\nNew attachments for Naval units; do you scrap or upgrade those old ships.\nLand units can now be built with brigades already attached.\nAn Air Naval combat system that radically alters the combat balance.\nNew damage algorithms for the Air combat system, making organization more important and allowing air units to fight longer.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18896,"name":"Dear RED - Extended","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/adaf6e6d1bda8fe63b94b10dbe559378.jpg","description":"Red had grown, she understood what happened, why he always mentioned those words although she couldn't stand watching and being overwhelmed by the old memories all the time. Now that he's dead, it doesn't have to be so anymore...\nDear Red is a game based on two choices: Truth or Lie. Each of your choices will lead to a different result. In the game, you are Red, a girl with a plan to look for her mother's murderer to end his life. You have planned this for a long time, but nothing goes as expected when you're facing the one whose neck you long to stab day and night.\nThere are 16 - 17 endings, and some of them are short, some are long. The playtime will be longer or not, it all depends on you and your choices.\n[Extended Version]\n- Endings changed\n- Graphics changed\n- Bonus content (Digital artbook included)\n- Gameplay changes","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lee Sang","platforms":[{"id":0,"name":"PC"}]},{"id":16416,"name":"eXperience 112","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b1/6b1b66749ee5d3071635a84ef7fb5209.jpg","description":"An abandoned boat. A system of surveillance camera that works. A woman, Lea Nichols, only survivor of a team of researchers. Monitor, manage, search… Behind your camera, guide Lea Nichols to freedom but also to the truth. Be her eyes and ears to help fulfill her destiny! But be careful, remember that things are not always what they seem…Key Features:\nAn innovative gameplay...\nBehind your surveillance camera, monitor, manage, look for everything that could help Lea Nichols to fulfill her destiny.\nAn immersive game...\nUse every tool at your disposal to advance in the adventure.\nMany puzzles to solve.\nA great storyline...\nA scientific experiment, a tanker deserted, only one survivor ... An atmosphere of Survival Horror serving an exciting story.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Lexis Numerique","platforms":[{"id":0,"name":"PC"}]},{"id":15866,"name":"PHAT STACKS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/542/542fdbd5b1809a0c2bd6e08ce2188b00.jpg","description":"Phat Stacks is puzzle platformer, physics based addictive arcade game that is all about collecting crystals by building platforms and controlling an alien lifeform across these platforms\n★ DIFFICULT GAMEPLAY!\nGetting 3 Crystals on each level is going to be difficult, they are all time based and require some quick thinking and sharp reflexes to attain!\n★ PHYSICS BASED!\nRemember to create enough support or your platforms will come crashing down, you need to be careful not to knock the platforms over with your alien as well\n★ ACHIEVEMENTS!\n8 ever increasingly difficult levels that come with 3 achievements for each level!\n★ TRADING CARDS!\nCollect Steam Trading cards and trade them with your friends!\nProgramming & Development: Lee\nMusic: Incompetech (Kevin MacLeod)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ColloseusX","platforms":[{"id":0,"name":"PC"}]},{"id":12939,"name":"Wildlife Park 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17e/17ea440e0e1a89d52ec956ec34155b44.jpg","description":"Wildlife Park 3 – do you have what it takes to be a zoo manager?\nWildlife Park 3 is the latest part of the successful series. As zoo manager, you are responsible for your very own and unique zoo. Choose from numerous types of enclosures, park buildings and plants to design an environment appropriate to each species.\nManage a team of animal keepers, vets, conservationists and maintenance, while keeping an eye on the zoo’s finances.\nExperience realistically animated animals and take care of their specific needs. If your animals are content, you and your park visitors can look forward to some offspring soon!\nTake home a part of wilderness with Wildlife Park 3!Features\nExciting campaigns, taking the player around the world in 20 missions\nPopular “Free Play” mode on over 20 selectable maps with additional mini quests\nUsing terraforming tools, you can create landscapes according to your imagination\nA detailed tutorial to explain the features of the game in a playful manner\nImproved and extended management section\nAnimal shop for trading animals in the game\nRealistic depiction of the 25 different land and water animal species\nIndividual animals and animal species: coat colorings and patterns, tails, manes, tusks, horns, etc. are created randomly\nEncyclopedia with lots of interesting information about the animal and plant species\nExtensive possibilities for customization with countless decorative park elements, fence and enclosure types, plants and extendable visitor facilities Wildlife Park Series:You can vote for the previous games of the Wildlife Park series on Steam Greenlight as well. Find more information here.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"b-Alive","platforms":[{"id":0,"name":"PC"}]},{"id":10787,"name":"Death's Hangover","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/806/806d93e8affe23e5ccb074ec2a858c56.jpg","description":"Death's Hangover is a ball and bat game, featuring mature comedy and themes. (Mainly poop jokes)\n'Old grim has a hangover, and a really bad one.. after discovering bastard dracula has stolen souls, he summons two of the greatest dead warriors to have ever lived, or the first ones he could find...\nOnly these two dead morons can get the souls back and defeat bastard Dracula once and for all. If they fail, Death will kill them again... So no pressure..'\nGame features\n- A Ball,\n- A Bat,\n- Two dead idiots,\n- 96+ levels,\n- Massive boss fights,\n- Unique Bonus stages,\n- Sticky, Spike and ghost power-ups, plus many more,\n- Powerups can be leveled up,\n- Control the speed of the ball, with dash, and slowdown,\n- Puzzle levels, as well as arcade style levels,\n- Multiple routes, and secret areas,\n- Wacky humor throughout,\n- Unique 2ply mode,\n- Includes OST + Bonus tracks,\n- Level editor, make your own levels!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Retro Army","platforms":[{"id":0,"name":"PC"}]},{"id":10718,"name":"Overload Playable Teaser 2.0","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b81/b81dfdd80416ebe186934cdb158c390b.jpg","description":"Overload is a new six-degree-of-freedom shooter from the creators of Descent, currently under development.  This Playable Teaser is an alpha-level demo of the game.  Originally released during our Kickstarter campaign in March 2016, Version 2.0 is a complete overhaul and shows the game as it stands in March 2017.\nOverload is an intense combat game that takes place in a full-3D world.  The full game will feature:\n- Single-player story campaign with 15+ FULL-SIZE atmospheric levels\n- Upgradeable player ship and 12+ weapons with multiple upgrade options\n- More than a dozen unique robots with multiple variants, and 3 massive bosses\n- Story by the writer of FREESPACE 2, plus pulse-pounding soundtrack\n- Includes Multiplayer Expansion (6-8 months after release)\n- Greatly expanded Challenge Mode with lots of levels and online leaderboards\n- Easy-to-use custom Level Editor (post-release) so you can build and share levels\nThis demo contains a training level, a sample single-player \"destroy the reactor\" level, and two Challenge Mode levels that let you test your skills against a horde of enemies.\nOverload will be available via Steam Early Access on March 13, 2017.  If you like the demo, check out the full version!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Revival Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10291,"name":"Runbow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc0/dc04262654df3927821d1ee0a01d8baa.jpg","description":"Runbow, and all its 9-player madness, is now on Steam!\nWith tons of competitive modes for up to 9 players--locally and online--and a massive Single Player Adventure, Runbow is the crazy, colour-based platformer you've been waiting for.\nThe world of Runbow changes with each swipe of the background, so you'll have to stay on your toes as platforms and obstacles disappear--If you can't see something, it doesn't exist. Fast, frantic, and fun for up to 9 players, Runbow is filled with tons of modes and content to keep you running back for more:\nSave Poster District from the evil Satura in Adventure, and choose your own path through a massive map of over 140 single player levels.\nTake on The Bowhemoth, a single, ultra-difficult challenge in the belly of a colossal beast. On your own or with friends, its sure to test the skills of even the toughest platforming veterans.\nGo head to head with your friends, locally or online, in Run, Arena, or King of the Hill, for a colourful, crazy competition. Host a Private Game for you or your friends, or hop into an Open Party and take on the world!\nTons of costumes and Indie Guest Characters are waiting for you to unlock, including Shovel Knight, CommanderVideo, Shantae, Lilac, and many more.\nChallenge yourself with 68 Steam Achievements! Be the first on your friends list to unlock them all!\nHundreds of pieces of unlockable Gallery content await you, from concept art to characters, and even a few hidden secrets...\nWith 9-player madness locally or online, 5 game modes, 19 guest characters, hundreds of levels, and tons more content all in one unforgettable colourful game, you better get ready to Runbow!\nDefault ControlsAll Controls are fully remappable, but if you want to get running quickly, here's everything you need to know:\nPlayer 1\nMovement: WASD\nJump: F\nAttack: G\nTaunt: H\nPlayer 2\nMovement: Up, Down, Left, Right\nJump: Comma\nAttack: Period\nTaunt: /\nRunbow is fully ready to support Xbox One and Playstation 4 controllers. Any similar-style controllers will default to Xbox bindings. But if you can get a controller connected, Runbow will let you remap it in the options menu!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":5381,"name":"Linger in Shadows","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6db/6db3b3408916bdd300ae7d1eaff51c36.jpg","description":"Linger in Shadows™ is not a game, but rather an experiment into the realm of interactive digital art. Created by a collective of talented artists based in Poland known as Plastic, Linger in Shadows™ delivers cutting-edge graphics technology and is the first “demoscene” project to ever hit a home console.  Bringing this underground digital art culture exclusively to the PlayStation®Network, it delivers a truly unique journey that will challenge and entertain you, and change the way you think about games and art forever.\nDive into the world of Linger in Shadows™, where a dark and mysterious creature lingers in the shadows, protecting the ancient Temple on its high perch above the ruined city below.  Use the SIXAXIS™ controller to interact with and manipulate the environment and the very fabric of time and reality.\nKey Features:\n•\tGorgeous Graphics – Real-time oil painting filters and fur shaders create a stunning canvas for this interactive art piece in 1080p High Definition.\n•\tUnique Interactivity – Utilize the SIXAXIS™ controller to navigate through various segments and interact with the environment and the flow of time itself.\n•\tTrophy Support – Earn 16 Trophies by exploring and experimenting to discover the secrets found deep within.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\nLinger in Shadows is a trademark of Sony Computer Entertainment America Inc.  © 2008 Sony Computer Entertainment America Inc.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Plastic Studios","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":5000,"name":"Rocket Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/284/284cb1e737885279fea97df9a9d202f7.jpg","description":"• Sparkster Returns. Featuring gorgeous next-gen graphics and dazzling new environments, blast possuming has never looked so good!• New Levels and Challenges. Play through four exciting new worlds, featuring expansive platform stages and thrilling flight stages.• Thrilling Rocket Action Gameplay. Launch and bounce Sparkster through obstacles and enemies that get in his way. Ricochet off walls, or create a Burst Vortex to repel enemy bombs right back at them. Use Burst Assist and hover in place to maneuver in mid-air, and then shoot Burst Projectiles from Sparkster's sword to attack distant foes. Rocket Drill through weak walls and create new passageways, and hang from and slide down rails with your prehensile tail.• Who's the Best? Show off your high scores and fastest times on the PlayStation®Network leaderboards.© 2010 Konami Digital Entertainment. Inc. Developed by Climax Studios Ltd. KONAMI is a trademark of KONAMI CORPORATION Climax and the Climax logo are trademarks of Climax Studios Ltd. FMOD Sound System, copyright © Firelight Technologies Pty, Ltd., 1994-2010Purchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3633,"name":"Pure Pool","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6af/6af3e9f533f4d966625f0d92faadeef3.jpg","description":"Let the makers of Hustle Kings™ transport you to the slick and exciting world of Pure Pool. Experience a living, breathing, bustling Pool Hall from the convenience of your living room – all wrapped up in VooFoo Studios signature jaw-dropping visuals! Whether you prefer to spend your time playing solo or weighing up against the competition, connect and prepare to be blown away by the next best thing to real life Pool.\nWith 4 game modes from classic American 8 Ball Pool to Killer, 4 challenges from Perfect Potter to Royal Rumble and full live online Multiplayer, rack-up, hone your skills and compete against the best in online tournaments and matches for a place in the Global Leaderboards. Pure Pool also builds a DNA profile as you play creating an AI interpretation of yourself, your friends and your foes – which you can still play against, even when they’re not online.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"VooFoo Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":303,"name":"Berserk and the Band of the Hawk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/458/4584d54896b44e58aca989b6e0d41fad.jpg","description":"Special OfferAs an early purchase bonus, the Exclusive Costumes DLC will be available for free for limited time.\nYou will be able to download Exclusive Costumes DLC from February 21st. Don't miss it!\nExclusive Costumes include;\n- Schierke Costume: Pirate\n- Guts Costume: White Swordsman\n- Griffith Costume: Golden Hawk\n- Shierke Costume: Blue stripe\n- Griffith Costume: Black Hawk\n- Guts Costume: Golden Swordsman\nAbout the GameBehold the fierce blend of \"Warriors\" and \"Berserk\"!\nThe action of cutting through hundreds of enemies, fundamental to the Warriors series, is fused together with the dark and gruesome atmosphere of the world of \"Berserk\", making various heretofore unseen acts possible, such as using a giant man-sized sword to cut enemies in half, as well as smash or send them flying with the \"Slash\" and \"Smash\" actions.\nStory:\nIn addition to the well-known story, \"The Golden Age Arc\", you will also be able to join Guts on his journey of revenge through \"The Hawk of the Millennium Arc\".\nCharacters:\nIn addition to the main hero, Guts, there are a number of characters you can choose to play.\nFurthermore, the same familiar cast of Japanese voice actors from the movie trilogy and the new animation series were invited to take part.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":747505,"name":"Pokémon Scarlet and Violet","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ab/5abb8e4af55eb8c867410c3a740355b9.jpg","description":"The Pokémon Scarlet and Pokémon Violet games, the newest chapters in the Pokémon series, are coming to Nintendo Switch later this year. With these new titles, the Pokémon series takes a new evolutionary step, allowing you to explore freely in a richly expressed open world.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":349458,"name":"New Frontier","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7b/c7b63a3b624950ad5daca7daf2712074.jpg","description":"Go West and Prosper! In the New Frontier your destiny awaits. Build your shelter, grow your home base, hunt animals, craft new guns and gear. Form a posse with your friends and create alliances with other players to conquer the land.SURVIVAL SAND BOX OPEN WORLDThe expansive world of New Frontier with different biomes are open for you to explore and settle. Mine resources, hunt, trade with NPCs and other players. Visit VAINBANK - a safe town in a lawless and hostile world.BUILD & CRAFTDiscover new blueprints to craft and upgrade your gear and weapons, but first begin by settling your Homestead and then work to expand it into impenetrable fortress, filled with trophies of your conquests and adventures. You can also Raid other player’s houses and steal their loot.THUNDERSTORMS, MONSTERSMagic storms rain down on the land of New Frontier. Mystical creatures from another dimension are entering our land to hunt and destroy. Protect the land, protect your home, and protect your friends.CONQUERForm up a Posse with your friends and create Alliances with other players. Fight side by side in a public events, for glory and exceptional loot. Opportunities exist in Seasonal Challenges to unlock unique gear and cosmetic items.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Free Reign Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":277920,"name":"Roombo: First Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/242/24252fd92cefb396c39d0d004ffda0b4.jpg","description":"Roombo: First Blood is a comedic, top-down, stealth-action game about being a robot vacuum cleaner and fending off burglars that have broken into your home. A Samurai Punk Short.\nHack smart-home gadgets like lights, doors and various appliances to set up traps, or improvised weapons from objects around the house. Hide under furniture, set your trajectory and plow into your enemies, knocking them over with such force that they go flying, then munch them up when they’re down.\nBut make sure you don’t leave too much blood on the carpet, because you’ll need to make sure the house is clean before the family gets home. Only you can save Christmas and show these burglars that justice sucks.\nThis is a short experimental game featuring 5 difficulty scenarios set in one house and an unlockable gallery of concept art.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Samurai Punk","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":62615,"name":"Anodyne 2: Return to Dust","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/61e/61e31e5aeadf820f91a61838d9230d1d.jpg","description":"Wishlist Anodyne 2 today! Enter an evocative, surreal, lo-fi 3D and 2D world. The follow up to 2013's Anodyne is finally here!\nPlay as Nova, the Nano Cleaner, who is tasked with collecting dangerous Nano Dust growing throughout New Theland, which then must be returned for recycling to a mysterious entity, only known as the \"Center\".\nWalk or ride across a lush, moody world. Discover strange characters and places. Shrink into characters and collect Nano Dust through 2D vignette-style gameplay, reminiscent of Anodyne's gameplay and more.\nDiscover the true nature of the Nano Dust, Nova, and The Center, in the latest game from Analgesic Productions.\nAnodyne 2: Return to Dust is coming early 2019 for Windows and Mac OSX. Much like Final Fantasy, there's no need to play Anodyne 1 to understand Anodyne 2's story.\nAnalgesic Productions is Joni Kittaka and Sean Han Tani. Be sure to visit our website to join the newsletter. We're also the creators of Even the Ocean, All Our Asias, Bratavism, and more.\nCheck out Anodyne 1 below. http://store.steampowered.com/app/234900/Anodyne/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Joni Kittaka","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":59691,"name":"Icons: Combat Arena","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/584/58498a0b75cbc5741f4e46fd9dfc1052.jpg","description":"North America OnlyIcons: Combat Arena is only available for download in North America. Please visit our forums for more information on our worldwide release.\nAbout the GameIcons: Combat Arena is currently only available for download in North America.  Please visit our forums for more information!\nDesigned to be the most responsive and competitive platform fighting game on Steam, Icons: Combat Arena provides a fully supported multiplayer experience, tight controls, intuitive movement, powerful special attacks, and tons of customization, including gorgeous skins, rousing taunts and emotes, holograms, custom player portraits, and more.\nFeaturing an ever-expanding roster of iconic combatants, each with their own colorful backstory, Icons: Combat Arena is a rich and memorable gaming experience. Our commitment to flawless online play, balanced combat, tournament support and deep competitive gameplay makes Icons the ultimate fighting game.\nWhether it’s for fame, fortune, or fun - those entering the arena share one goal: to win the intergalactic League and become an icon of their homeworld.Key Features:Lightning Fast Gameplay: Movement controls are precise and responsive while unique combinations of mechanics create strategic depth.\nFlawless Online Play: Best of all is the netcode, which is custom-built to prioritize control of your character and combos, as if playing offline.\nIconic Fighters: Some fight for fame, some for fortune, some for the fun of fighting itself, but they all fight for the same reason… to WIN! With seven playable characters at Early Access launch and much more to come, players can explore an endless world of matchups and mechanics.\nExpress Yourself: Want to play a cyberpunk sharpshooter or an elegant swordswoman ninja? Icons features skins, taunts, emotes, player portraits, and other customization items bursting with personality.\nFree to Play: Icons is free to play and shop items do not affect game balance. Almost all purchasable content can be earned through gameplay.\nMultiple Game Modes: Finding a worthy opponent is as easy as hooking up local multiplayer, jumping into our online matchmaking system, or browsing custom matches. Test your skills against multiple opponents with Free For All! Additional game modes coming soon: 2v2 teams, single player modes worthy of speed running, and entirely new team-based modes not yet seen in a platform fighter.\nCustomizable Controls: Icons is compatible with many input devices, including GameCube controller, gamepad, keyboard, or dual shock. Control schemes can be mapped using in-game settings, and input will always feel precise and responsive.\nBuilt for Competition: Icons is designed from the ground up for competitive balance, no matter the matchup. There are no combat items or powerups - just a pure test of skill. Esports Ecosystem: Icons developer Wavedash Games will host open-entry online and offline tournaments. Follow us on social media for updates!\nDesigned with Passion: Icons is created by a group of seasoned experts from every era of platform fighting games.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wavedash Games","platforms":[{"id":0,"name":"PC"}]},{"id":50921,"name":"Project Lucie","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/412/412a108613fe526267e9406240fc113c.jpg","description":"Project Lucie is an experimental VR puzzle game with mouse & keyboard support.\nPlayers take on the role of Lucie, an 8 year old girl with a big imagination, and follow her story by completing puzzles that come to life! Beyond Lucie's story, an Editor mode invites players to explore their own imagination by building their very own puzzles.\nPlayable on PC with a mouse and keyboard, the game supports Oculus Rift© - to fully immerse players in a Virtual Reality environment, and provide a complete gameplay experience: full physical simulation, and complete presence within Lucie's world and imagination.About Bohemia IncubatorProject Lucie is a new title from Bohemia Incubator, a label for experimental games that are made available to the public.\nThis Incubator release enables a small but dedicated team at Bohemia Interactive team to explore new areas of game design, and involve the community along the way.NoticeProject Lucie is not yet part of the Oculus® store. In order to be playable, it is necessary to switch on a specific option in the Oculus settings. Click the gear icon and select 'Settings'. Then, click 'General' and enable 'Unknown Sources', which allows applications that have not yet been reviewed to be played. See the official Oculus website for more information.\nProject Lucie is currently Pre-Alpha. This is not final software; content and technology is subject to change and may still contain errors / lack certain features.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":50324,"name":"Black Mirror (2017)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/101/101a694181f958cd9f58088d3d89e274.jpg","description":"Scotland, 1926. Following the suicide of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him.\r\n\r\nTormented by nightmares and waking dreams for all his life, David fears that it might be his destiny to follow in his father’s footsteps, down a path that leads to madness, and death.\r\nIs there really a Curse that has been haunting his family, like his father believed? It is up to David to uncover the horrible truths, buried under generations of silence and fathoms of stone. Black Mirror Castle demands an offering...\r\n\r\nKEY FEATURES\r\nA modern re-imagining of the acclaimed gothic-horror adventure series\r\nInteractions with vision-like apparitions which help you learn more about the past of your family\r\nEerie atmosphere focusing on the horrors of the mind, in the style of EA Poe and HP Lovecraft\r\nHigh quality voice acting from a compelling ensemble cast","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":46471,"name":"Vaporum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e9/3e97f898dac62a740a63420e64a71f40.jpg","description":"Vaporum is a grid-based, single-player & single-character dungeon crawler RPG seen from the first person perspective in an original steampunk setting. Inspired by old-school games like Dungeon Master I and II, the Eye of the Beholder series, and the most recent Legend of Grimrock I and II. Stranded in the middle of an ocean, in front of a gigantic tower, the hero has to find out what the place is, what happened there, and most importantly, who he is.\nFirst person real-time combat\nPuzzles and level-wide objectives\nGadget-based RPG system\nLots of exploration, loot, and character customization\nMysterious storyline filled with secrets\nFully voiced main characters\nImmersive steampunk setting\nCombat takes place in real time. Each enemy has a distinctive set of strengths and weaknesses so you have to employ different tactics to beat each one. Weapon types have each a set of unique bonuses and behaviors which adds more depth and thought when choosing what weapons to equip.\nYou will find many types of gadgets: direct attacks, area attacks, offensive & defensive buffs... These gadgets are powerful, but some enemies are immune to certain types of attacks, so you will have to figure out the best way to deal with every encounter the game throws at you.\nSolve intriguing puzzles and level-wide objectives where you have to use both your wits and reflexes. While most puzzles and riddles are contained in a single room, progression objectives can span an entire level or even multiple levels.\nInstead of increasing the abilities of your human character, you will improve an exoskeleton rig you wear. The game combines a \"you are what you wear\" aspect with a long-term development of your exo-rig. The gadget-based system allows you change your loadout of gadgets at any time, giving you a great deal of flexibility to deal with various situations. On the other hand, as you progress, you get to unlock useful circuits on your exo-rig, gaining significant permanent attribute bonuses and passive skills.\nStranded on a small islet in the middle of an ocean, you enter a gigantic mechanical tower. Nothing makes sense to you, but it is all strangely familiar...\nIf you want to get into the backstory and uncover the mysteries of the tower, you can delve right into it by reading all the notes you can find. Don't worry, though, you can safely ignore all the text. All major story points are narrated by the main characters and they are fully voiced!\nThere are many optional areas in the game that you can choose to explore. They usually present some form of additional challenge, but come with a reward too! The tower is riddled with secret passages that contain unique items and notes of its inhabitants, giving you an insight into their lives and events that precede your arrival.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Merge Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":43854,"name":"Chicken Labyrinth Puzzles","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24a/24a0f04aa6de7cef84f88aa14e05437d.jpg","description":"Guide the lost chicken through a journey of mazes and puzzles to get home.\nControls:\nMovement: Arrows\nRotate: Q,E\nZoom in/out: C,V\nCamera Angle: R,F\nChange Camera: B","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ZemunBRE","platforms":[{"id":0,"name":"PC"}]},{"id":25116,"name":"Excitebike","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/06b/06b7eb5af472faf07961a9c0e60ed2b7.jpg","description":"Face crazy curves, hairpin turns, and daredevil jumps as you race toward\nthe checkered flag and the Excitebike championship. Race against the\nclock or challenge an opponent. You must keep your bearings as you fly\nthrough the air and avoid getting clipped by other racers. Stay cool\nunder pressure, or your bike will overheat. If you get tired of racing\non the circuit, create your own course in Design mode. There you have\naccess to all the ramps, mounds, bridges, and other obstacles Excitebike\nhas to offer!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1984,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"NES"}]},{"id":24792,"name":"Professor Layton and the Curious Village","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fc/6fc5f9e00777bdc6bc6e1786f2cd65d6.jpg","description":"In the curious village of St. Mystere, townsfolk greet each other with\nriddles, lock their doors with sliding puzzles, and hide their secrets\nwithin brainteasers. When a wealthy baron passes away, his will reveals\nan elusive treasure hidden someplace inside the village. Now it's up to\nProfessor Layton to untangle St. Mystere's riddles and puzzles, find the\nhidden treasure, and crack the case.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Level 5","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":21354,"name":"Reaxxion","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f20/f20b129f9576dc1ed9324e6992244bad.jpg","description":"Celebrating 30 years of breakout games, action-packed Reaxxion is the next generation, letting gamers wield the power to manipulate liquid metal to destroy targets!\nLike no breakout game before it, Reaxxion is a unique entertainment experience that will capture your imagination and excite your senses. Generate and absorb balls into the liquid metal paddle, or transform balls into golden, brick-busting dynamos in the “Reaxxion Chamber”.With nine smashing power-ups and secret challenge levels, this electrifying game features the ultimate in variety and player-controlled action.\n200 hand-crafted levels with animated backgrounds\nAllows for multiple playing styles and strategies, plus rewards for creative play\nThree exciting modes of play\nSuperior quality graphics and 60 minutes of CD quality music","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":20599,"name":"Gundemonium Recollection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/174/1742de736f3bb7171550f3086871c305.jpg","description":"First of the three titles in the Gundemonium Collection, this pixel-style side-scroller brings the intensity of the 'bullet hell' shooter genre to Steam. Choose one of two playable characters, including an unlockable third character! Modify character weaponry to your liking! Dominate 5 levels of frenetic gameplay while being bombarded with high-impact weaponry. Each level culminates with a challenging boss to defeat. Three game play modes will keep the non-stop action going! Experience a new level of game-play: Enjoy Gundemonium Recollection while listening to a brand-new arranged soundtrack.\nKey features:\t\t\t\t\t\t5 levels of intense bullet-flying action\nSweet Old school retro anime-style art\nTwo playable characters to choose from and a third you can unlock\nStory, Practice and Mission modes to take your shooting skills to the max\n32 Steam achievements\nFull online leaderboards\nNew arranged soundtrack by DM Ashura\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Platine Dispositif","platforms":[{"id":0,"name":"PC"}]},{"id":20151,"name":"Absent","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b4/6b4d20633f9054f8d8a9c9ad2b0207ef.jpg","description":"Absent is a story which follows the character of young-adult and college student, Murray Schull. He and his two best friends, Eve and Steve, attend a college in which students are disappearing daily. It’s up to them to find out how this is happening, why this is happening, protect their other friends, and to put a stop to it once and for all.\nThis series of events began when Crystal, a three month girlfriend of Murray’s friend, Steve, disappeared on her way home from college via mysterious means. Over the course of the investigation, however, Murray realizes that the abduction of Steve’s girlfriend was not from anything of this earth. Murray is haunted by visions of the past and future, confronted with puzzles, with friends turning against each other, and all for one reason. The Reaper.\nSpecial Features\n-A point/click, easy to use interface.\n-Approximately twenty NPC's to interact with.\n-Around forty playable rooms in the whole game.\n-A completely original story with original art and characters created by James Fenton.\n-A game so varied, I flipped a three sided coin to choose it's genre!\n-Full Voice Acting, including the talents of Esme Brand, James Fenton, Shannon Hayes, Rebecca Hanssen and Matt Haynes.\n-Full MP3 Soundtrack composed by Adam Haynes.\n-It's completely free!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FNGames","platforms":[{"id":0,"name":"PC"}]}]