[{"id":2334,"name":"SIREN","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22a/22aa9a04a64bcea640d724510a5af169.jpg","description":"Experience SIREN for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay (Active PS Plus membership may be required), Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita system or PS App.\nResist the Call\n0:00. Midnight. A siren calls and a sea of red water mysteriously surrounds the mountain village Hanuda. Slowly, a terrible force transforms the inhabitants into shibito, undead husks of their old selves, fueled by evil and hate.\nPlay as one of ten characters caught in a living nightmare. You have three days to learn how their paths intersect as they try to stay alive. Survival depends on your ability to “sightjack” or the power to see through the eyes of friends and foes. There is no one hero. There is little hope.\nWill you resist the call of the Siren?\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n© 2004 Sony Interactive Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":614960,"name":"They Always Run","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/087/08707a38127967a92e326f3e0712587c.jpg","description":"The galaxy's inhabitants have been swamped by crime since the fall of the empire. Being able to find anyone, anywhere has become a highly prized skill.\r\n\r\nAidan is a three-armed bounty hunter who must hunt down the most dangerous and elusive cutthroats in the galaxy.\r\n\r\n\r\nSome bounties are rewarded with money, others with valuable information that Aidan can use to find the people who set him on this path – all while getting embroiled in a galaxy-wide conspiracy.\r\n\r\nHaving three arms lets you deal with more enemies at once and makes for a persuasive argument in any scuffle. Use your third arm to perform targeted attacks and throws, manipulate the environment, destroy obstacles, and wreck enemies.\r\n\r\n\r\nSome bounties are rewarded with money, others with valuable information that Aidan can use to find the people who set him on this path – all while getting embroiled in a galaxy-wide conspiracy.\r\n\r\nHaving three arms lets you deal with more enemies at once and makes for a persuasive argument in any scuffle. Use your third arm to perform targeted attacks and throws, manipulate the environment, destroy obstacles, and wreck enemies.\r\n\r\n\r\n\r\nHunt criminals across the fringes of the galaxy, the core worlds, and the ruins of long-gone civilizations. Upgrade your equipment, gain new abilities, grow stronger and destroy anything that stands in your way.\r\n\r\nEnjoy a complex story interwoven with high-octane gameplay and full of twists and turns that hit as hard as a bounty hunter's third arm.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Alawar Premium","platforms":[{"id":0,"name":"PC"}]},{"id":383619,"name":"School Wars!!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c1/2c17731f63f80509a905188a1bc93183.jpg","description":"It's the rich kids vs underdogs in a surreal time traveling high school adventure.\nJoin forces with a magical kraken to defeat the spoiled snobs!\nYour goal is clear: make the underdog Armadillo Academy win the annual talent show against the snobbish Hawk High School. Thankfully you have the guidance of a magical kraken that grants you time travel power. If only there wasn't a whole cast of crazy people attending the schools to distract you from your plans.\n​As the new kid in school you figure out the routines of the characters to find a way to change their fate in this Groundhog Day-like adventure. Every student has their uniquely decorated room that you can snoop through to find out their secrets. Make friends and go on dates, like taking Broccoli Girl to the waterpark. Will time travel powers be enough to save the Armadillo Academy students?\nIn this adventure you are free to walk around the school grounds (keyboard and gamepad supported) and find hints to your quests by talking to people. Your calendar will keep track of the events. Be at the right place at the right time to uncover mysteries and receive quest items. Use these items at the right time to change the outcome and prevent disasters from happening.\nYou have the option of spending time with your favourite characters on dates after gaining their favour through presents and giving the right answers in conversations. On these dates you will have to make sure to make the right decisions to make it as enjoyable as possible. On top of this you will play the dating minigame (Dance Dance Revolution-like rhythm game) to determine how successful of a date it will be. Do well to uncover more of the character's backstory.\n3 Quests to solve through Time Travel Mechanics\n20 Characters to befriend\n3 Characters to go on dates with\nFull controller support\nAverage play time: 3 hours","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Happy Broccoli Games","platforms":[{"id":0,"name":"PC"}]},{"id":382765,"name":"Marbles on Stream","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/14b/14b271007ece3ec438524d7c3710ccc3.jpg","description":"Marbles on Stream is a stream interactive game on Twitch.tv. Involve your viewers in fully physics driven Marble races. A mode called Tilted is also available that allows the player to \"tilt\" a procedural track with the goal to get their marbles to the end of the track.\nRace Mode: Physics driven Marble Races through Original Marble Tracks Developed by PbP\nRoyale Mode: Marbles Fight to the Death in a Physics Driven Marble Royale, last marble wins.\nGrand Prix: Select 2 to 16 Tracks to race through and compete for Points at the end present the top 3 Marbles at the end with a Podium\nTilted: Control the tilt of the map and compete to get as many marbles to the finish as possible through procedural tracks and unlimited levels\nMarbles on Stream is integrated with Twitch.tv API and enabled Twitch Streamers to involve their viewers in the game. This game is very community oriented and brings people together in existing communities.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixel by Pixel Studios","platforms":[{"id":0,"name":"PC"}]},{"id":378625,"name":"Call of Duty: Mobile","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08f/08f242250bb76520879f116aa7cf33cf.jpg","description":"Official CALL OF DUTY® designed exclusively for mobile phones. Play iconic multiplayer maps and modes anytime, anywhere. 100 player Battle Royale battleground? Fast 5v5 team deathmatch? Scary Zombies action? Sniper vs sniper battle? Activision’s free-to-play CALL OF DUTY®: MOBILE has it all.\nFREE TO PLAY ON MOBILE\nConsole quality HD gaming on your phone with customizable controls, voice and text chat, and thrilling 3D graphics and sound. Experience the thrill of the world’s most beloved shooter game, now on your phone for easy on-the-go fun.\nBELOVED GAME MODES AND MAPS\nPlay iconic multiplayer maps from Call of Duty®: Black Ops and Call of Duty®: Modern Warfare®, available for the first time for free. Or squad up with friends in a brand new 100-person battle royale survival map. Join the fun with millions of players from all around world!\nCUSTOMIZE YOUR UNIQUE LOADOUT\nAs you play CALL OF DUTY®: MOBILE you will unlock and earn dozens of famous characters, weapons, outfits, scorestreaks and pieces of gear that can be used to customize your loadouts. Bring these loadouts into battle in thrilling PvP multiplayers modes like 5v5 team deathmatch, frontline, free for all, search and destroy, sniper battle, and battle royale.\nCOMPETITIVE AND SOCIAL PLAY\nUse skill and strategy to battle to the top in competitive Ranked Mode or to win the most Clan prizes as you play with friends. Compete and fight against millions of friends and foes in this thrilling free to play multipler shooter.\nCHOICE AND COMPLEXITY\nWhether in gameplay, events, controls, or loadouts, CALL OF DUTY®: MOBILE offers complexity and depth in an ever-changing experience.\nHave what it takes to compete with the best? Download CALL OF DUTY®: MOBILE now!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Tencent Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":248474,"name":"Lost Words: Beyond the Page","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08b/08beb85ebdd1d418ce08863bce0846a5.jpg","description":"Lost Words is an atmospheric narrative adventure that takes place in the personal diary entries belonging to a young girl named Izzy that will unfold as you explore a fantasy land where words hold immense power. Featuring an immersive story crafted by renowned games writer Rhianna Pratchett, Lost Words: Beyond the Page will mesmerize players with its unique blend of gameplay mechanics and striking watercolor aesthetic. Driven by the player’s curiosity, the world of Estoria and the power it holds will serve as the engine that will propel Izzy through this deeply personal narrative, resulting in a truly memorable experience.\r\n\r\nFeatures:\r\n\r\nNavigate 2D worlds set inside a young girl’s diary by walking on the words and using them to solve a variety of puzzles.\r\n\r\nExplore an emotionally moving, fully-voiced narrative developed by renowned games writer Rhianna Pratchett as you make decisions that will alter how the story will unfold, making each playthrough unique.\r\n\r\nDiscover the watercolor world presented in the pages of the diary as well as the vibrant fantasy world of Estoria.\r\n\r\nHarness words to alter the environment around you to create a safe passage for the protagonist in an entirely unique and refreshing style of platforming.\r\nMeaningful Exploration. Gather collectible fireflies scattered across the lands of Estoria for an additional challenge.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Plug In Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":60957,"name":"The friends of Ringo Ishikawa","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/644/644a4b1f4fbca418ae82ad0300847b9c.jpg","description":"A highschool gang leader Ringo Ishikawa trying to live through his last autumn before graduation. With his best friends.\nYou should play it if:\n1) You're fond of good stories with strong dialogues (especially about growing up)\n2) You're a fight games enthusiast (you'll get your hands on some unique brawl mechanic and I promise you'll be satisfied)\n3) You're into some yakuza-delinquent aesthetics\nBasically, the game is an existential open world beat'em up with some school sim elements. It has a little of everything: a town to explore, day-night cycle, npc on their schedule, battle grinding, school grinding, mini-games (ping-pong, billiard, video-poker, video-game console with one game...) and so on.\nBut the main thing is the story I'm trying to tell. And I designed the game to make you feel this story. So it's not about rival gangs, or taking over turfs, or anything. You just live there and feel. And that's all.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"yeo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"}]},{"id":57944,"name":"Tony Hawk's Pro Skater","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd2/fd22fcd8470c96a6cf30051c3d249a6b.jpg","description":"Tony Hawk's Pro Skater, released as Tony Hawk's Skateboarding in the UK, Australia, New Zealand and parts of Europe, is a skateboarding video game developed by Neversoft. Published by Activision in 1999, it is the first entry in the Tony Hawk's series of video games. Development began after Tony Hawk's debut stint at the 1998 X-Games.\nPro Skater was released for the PlayStation on August 31, 1999, and was later ported to the Nintendo 64, Dreamcast, and N-Gage. It also received a Game Boy Color adaptation, and was released for Xbox in 2001 as part of the Tony Hawk's Pro Skater 2x collection. The game was met with critical acclaim from critics, who praised it for its innovative gameplay, level designs and control scheme. It was also commercially successful, selling rapidly upon its opening month. The game resulted in a successful franchise, receiving eight annualized sequels developed by Neversoft from 2000's Pro Skater 2 to 2007's Proving Ground. In 2015, the licensing deal between Hawk and Activision expired after several failed attempts by developer Robomodo to revive the franchise.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Neversoft","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Dreamcast"}]},{"id":43903,"name":"b","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/909/909e246c91ebe8b6ce165fb9549c74f7.jpg","description":"this is a play as you desire game.b freeflight experience: a newly created undulating meadow in spring / summer with a central big tree and day-night-cycle on every start is the playground of b -- a bumblebee of subgenus gaudium formosum, recognizable by their cheeky :p.controlsnon-assignable controls\nESCAPE: open menu\nleft mouse button click (with menu not open): toggle grass density to alternative value\nr: toggle let camera rotate around b\np: toggle land on below place and stick to it\ns: halt when moving only due to inertia\ni: toggle slow down time to a halt\nassignable controls and their default value\nincrease flight speed (accel): w\nslow down flight speed (brake): s\nturn left: a\nturn right: d\nfly up: space\nfly down: left shift\nroll left: q\nroll right: e\nmove wings to forward flight direction: o\nmove wings to upward flight direction: l\njoystick meaning\nthrust: speed\nrudder: up/down\nwings: roll\nyaw: left/right\nheli +/-: forward/upward\nNote: utilizes joystick 1 of Windows. The preferred joystick might have to be set as default within Windows game controller settings.settingslauncher\nGraphics Quality: position in list: top: low quality, low hardware demands; bottom: high quality, high hardware demands (mostly GPU);\nmost bottom is default\ningame\nlandscape setting: 5 is default size. 6 already is demanding. 1 is minimum. 15 is very demanding. (GPU demands scale by the entire range, CPU demands scale from 6 upwards and have a minimum on average around 3 due to number of trees visible.) After change, clouds take time to fill the sky. While their generation isn't complete slider is disabled and frame rate might be unusually low.\ndisable elastic camera: makes camera statically fixed, improves performance on weak CPUs\nnumber of dandelions: a high number of dandelions requires a strong CPU only when all their seeds are in the air (around one location)known issuessome custom mp3 s don't play (due to large values in one of duration / bitrate / filesize),\nsometimes, after having switched resolution, the game doesn't initialize. Alt+Tab ing to Windows Desktop and back to game initializes it then. The menu might not accept input then. In this case, press ESCAPE to play without configuration. A Windows restart cures this issue.Note: no collisions is on purposechangessince media creation: the landscape turning dark for around half a second after sun set and moon rises is fixed, midday peak brightness slightly reduced, morning and evening brightness reduced, night brightness slightly reduced, fog closer in morning and evening, game name logo replaced game name text in menumade with\nGame Engine\nUnity\nThird-Party assets\nShockwave-Sound: Days In the Sun (Full track), From Night to Dawn (60-secs version) (Invoice Nr.: 212765), LYN074: Nature & Environments Set 3, LYN152: Ambient Environments (Invoice Nr.: 212869)\nThird-Party libraries, all from Unity Asset Store\nDirectX 11 Grass Shader\nSimple SSAO\nAzure[Sky] Dynamic Skybox\nUnity UI: OxOD Open/Save File Dialog System\nuAudio: Mp3 Player/Streamer\nNPR Oil Paint Effect\nsystem requirements are a guideline, they are not guaranteed to be the only one or satisfying everyones criteria. The central big tree, when close enough in view, is particularly CPU-intensive and might decrease framerate.\nrecommending a joystick having thrust and yaw control.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"u&i","platforms":[{"id":0,"name":"PC"}]},{"id":24508,"name":"DJ Hero","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96b/96b568d8834c1d11bb40e0806c93e625.jpg","description":"Spin, scratch and mix 93 unique mixes. Featuring hot music from JAY-Z,\nEminem, Queen, Black Eyed Peas, Jackson Five and Daft Punk. DJ Hero lets\nyou show your skills and battle your friends, or go into Auto Play and\nlet players jump in and out.\n\nFeatures\n\nPARTY WITH YOUR FRIENDS: Jump into multiplayer 2-DJ or DJ and Guitar\nModes Switch on autoplay and let the game DJ be your party\n\nUNPRECEDENTED MUSIC VARIETY: Scratch, mix and sample 102 individual\nsongs, highlighted in 93 exclusive new mixes that blend genres of\nmusic, including hip-hop, dance, pop, and rock. DJ Hero brings the\nhottest artists including: Black Eyed Peas, 50 Cent, Justice, Marvin\nGaye, Nirvana, Beastie Boys, N.E.R.D, and more.\n\nRULE THE HOTTEST PARTIES: Where Guitar Hero brought gamers into the\nworld of rock ‘n’ roll, DJ Hero brings you into the hottest scenes\naround. Party in venues reminiscent of real world locales from around\nthe globe including an ultra plush and sexy Hollywood Hills style\nmansion to an open air beach club in Ibiza.\n\nFEATURES DJ HERO TURNTABLE CONTROLLER","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Fireproof Studios","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"}]},{"id":19814,"name":"Time Ramesside (A New Reckoning)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c7/5c7e21e93d5505c830fe9d103920c578.jpg","description":"12/02/2015. Well I'm happy to say this is a true horror survival game. Some bugs to work out, but will have that resolved for the most part by the 20th. We have also uploaded the new footage of the game on here.\n11/30/2015 UPDATE: WE ASK ALL REVIEWERS TO REPLAY THE GAME. THE FOOTAGE ON THE STORE PAGE IS 100 PERCENT IN ACCURATE AT THIS TIME. OVER THE NEXT 48 HOURS WE WILL BE UPDATING THE TRAILER, SCREENSHOTS AND MORE. THE GAME IS NOW A TRUE SURVIVAL HORROR GAME. WE HAVE CHANGED OUT THE MESH, CHANGED THE LEVEL DESIGN, MADE THE GAME MUCH SLOWER. WE COMPLETELY 100 PERCENT RIPPED OUT THE OLD A.I AND REPLACED IT WITH NEW A.I. THE ZOMBIES WILL NOT DAMAGE THE PLAYER AT THIS TIME BUT WITHIN A FEW DAYS THEY WILL. AGAIN THIS GAME IS NOT THE SAME IT ONCE WAS WE ARE TAKEN FULL STRIVE IN CHANGING THE PLAY MECHANICS AND WE HAVE DONE SO WITH GREAT STRIVE THE LAST 72 HOURS. THE GAME DOES NOT REFLECT AND VIDEOS ON YOUTUBE NOR DOES IT REFLECT ANY REVIEWS AT THIS CURRENT TIME UNTIL SUCH REVIEWS ARE UPDATED TO THIS DATE.\nWE DO APOLOGIZE TO EVERYONE, AND WE HAVE LEARNED A LOT AND NOW ARE APPLYING WHAT WE HAVE LEARNED INTO CHANGING THIS GAME AROUND. COMMENTS HAVE ALREADY COME IN FROM YESTERDAYS BUILD WHERE SOMEONE COMMENTED THE GAME IS NOW DECENT, THAT ALONE IS A MAJOR IMPROVEMENT. TODAY WE FIXED A TON OF MORE THINGS AND ADDED QUITE A BIT. WE ASK FOR YOU HONEST FEEDBACK, SO WE CAN REALLY MAKE THIS GAME SOMETHING AND GIVE YOU ALL THAT GAME THAT YOU DESERVE AND CAN PLAY.\nWE APPRECIATE EVERYONES TIME.\n11/28/2015\nWe are under going the Remake of T.R at this time. Over the next couple of weeks you will see massive amounts of updates. We will have a new build up and running within the next 24 hours. The game has already changed drastically and for the better. You now play as a 3rd person/FPS view. We have really slowed down the game play, and really have made this a very creepy survival horror game. Gabby now plays a huge role in the game as well, and will continue to do so throughout the series.\nThe community has spoken, and it is a bout time we got are foot in gear and did something about it.\nT.R Will now offer you dark creepy areas, where only a flashlight tied to your hip and 2 of your weapons will only be able to see the light of day, in most areas. Play as Mark Forah a former scientist who created an Obelisk that could harness energy from organic objects and use that energy into the newest power source for the world! Soon after his discovery Mark was taken along with his daughter to a research faculty, where he was demanded to show them how he created the Obelisk. After his refusal, his daughter was used as a bargaining chip, which they went to far on and injected his daughter from the Obelisk harnest energy.\nNow Mark wakes up in a prison with no memory of what has happened. He must quickly learn that survival is number one on the list, and find his daughter.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Panzer Gaming Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18873,"name":"Through Abandoned","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/184/184aa58365d95ad75a6090b925ba02d0.jpg","description":"The sequel releaseHi.\nThrough Abandoned 2. The Forest is live now.\nYou can buy it here: http://store.steampowered.com/app/513340?beta=0\nOr buy bundle with both parts: http://store.steampowered.com/bundle/1219/\nAbout the GameAbandoned is the first part of big story about parallel worlds. Those worlds are very strange, because people left them forever. So, you should explore those worlds and find your brother who dedicate his life for finding out the way to Abandoned and disappeared there.\nRussian version included.\nThrough Abandoned 2. The Forest is live now.\nYou can buy it here: http://store.steampowered.com/app/513340?beta=0\nOr buy bundle with both parts: http://store.steampowered.com/bundle/1219/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Snapbreak Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":18266,"name":"Bob Came in Pieces","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cec/cecc372dc128cd1d1785467925d2d2f2.jpg","description":"Bob has crashed on a strange planet, lost a bunch of parts for his ship and above all, is late for work!\nFind the lost parts and rebuild your ship along the way to solve challenging, physics-based puzzles. You can build your ship any way you like in the ship builder – try to find the coolest ship-design for the puzzle at hand!\n\nRebuild your ship any way You like\nFind the lost parts and tools for Your ship – You’ll need them to solve puzzles!\n25 Chapters of solid level design and clever puzzles\nMany hours of replayability, with secrets, Achievements, Leaderboards and more\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ludosity","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17889,"name":"Demon Hunter: Chronicles from Beyond","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/119/11941570d55a87596eb3d2c7e40bbd5a.jpg","description":"Demon Hunter: Chronicles from Beyond is a thrilling tale set in 1930s America. The game tells the story of Dawn Harlock, an unusual red-eyed woman, who must return to her family estate on Iowa Island to investigate the mysterious death of her mentor, Professor Ashmore. It’s not long before Dawn discovers traces of horrifying experiments and has to come face to face with an ancient evil from another world.\nDuring the investigation, our protagonist begins to suspect that someone, or something, has crossed over into our world from another dimension and that her own mysterious past plays a large role in these disturbing events.\nDawn will have to unearth the secrets lurking within a gloomy mansion, unravel the mystery of a grotesque experiment and find out what really happened all those years ago, when Professor Ashmore found her wandering aimlessly across the island.\nWill Dawn’s true identity prove to be the key to defeating the ancient evil from another dimension?\nFeatures41 hand-drawn locations scattered throughout a mysterious island!\n29 varied minigames!\n21 engrossing scenes containing hidden objects!\nAn enthralling story that will have your imagination running wild!\n28 exciting achievements to unlock!\nA mesmerizing score and stunning wallpapers!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":16942,"name":"Witch's Pranks: Frog's Fortune Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/759/75952e79b313cd32cd5157cd7f003c74.jpg","description":"Once there was a wicked witch. And then one day she decided to get married, and not to someone, but to a handsome prince.\nThe only problem - all the princes were engaged. All of them were picked up by beautiful princesses. Back then a cunning plan germinated in her dark soul - to destroy a family happiness of all beauties, and to turn the princes into frogs unless and until some of them come to senses and want to become betrothed of the evil witch.\nShe lulled to eternal sleep one of the princesses along with her servants. That’s how the legend about Sleeping Beauty appeared.\nThe young Snow White was poisoned by enchanted apple, and beauty’s body rests in the deep caves in the custody of seven gnomes.\nWitch cut beautiful long hair of Princess Rapunzel and imprisoned her in an inaccessible cave among waterfalls. And a lovely Miss World was imprisoned in Witch’s basement. Just in order to teach others not to do so.\nYou will have to set free the frog-princes from Witch’s captivity, to help them to get on to the beautiful brides to remove the witchcraft by kiss of love.\nBut will you be able to discover all the secrets of Witch and restore the happy endings in fairy tales?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16830,"name":"\"Glow Ball\" - The billiard puzzle game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/074/074f11b1a07a8da9480128a0f27bbd81.jpg","description":"Physics based puzzle game type of billiards.\nIf you like billiard games or love pool then this game is for you!\nFeatures:\n- New view on the game of billiards\n- Unusual and challenging levels\n- Each level is unique in its design\n- Each level has its own innovations\n- Beautiful dynamic lighting\n- The leisurely meditative gameplay\n- Atmospheric soundtrack\nMusic in video:  \"Cool Vibes\" Kevin MacLeod (incompetech com)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"WTFOMGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16731,"name":"You Have 10 Seconds 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24c/24c1e33ad903dc78cda5bae9fcdbc982.jpg","description":"You Have 10 Seconds 2 is the sequel to the popular Free to Play game \"You Have 10 Seconds\".\nYou Have 10 Seconds 2 is a fast paced, Free to Play platformer game where you have 10 seconds to get from the start of each level to the end before time runs out and without dying. Each area consists of 10 levels and you unlock new areas by completing them, as-well as getting new items.\nGame Features:\n- Over 100 NEW levels\n- Character Customisation\n- In Game Level Editor\n- 13 New original tracks\n- Gamepad Support\n- Improved physics and gameplay\n- New mechanics, gimmicks and items","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":16609,"name":"Just Deserts","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b7/1b73504b9f48bac2474a8e38b4b70df2.jpg","description":"Just Deserts is a sci-fi action dating sim where you play as a soldier who must protect a city from mysterious alien attack, while at the same time need to capture the heart of your dream girl(s)!Features5 unique heroines with different personalities and interests.\nFull English voice act for each heroine!\nEnglish subtitle, with Indonesian and Japanese planned for update.\n7 different endings, based on your status with the heroines. Approximately 7 hours to reach 1 ending.\nList of activities which can be done alone or together with your favorite heroine.\nEnergy, health, money, day/night time and love status system.\nMini battle with the aliens.\nHundreds of items which you can use as a gift, food, or support in battle.\nTravel across the desert area and the city.\nTheme song by Vesuvia [Ecky], vocal track by iMochi","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vifth Floor","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16544,"name":"Super Win the Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a6/0a61e1573a94ecb816edb4dad142650c.jpg","description":"Throw on your nostalgia goggles and travel back in time with Super Win the Game, a retro-core explosion of exploration and platforming action!!\nSequel to the 2012 freeware hit You Have to Win the Game\nOpen-ended exploration platforming: Explore a massive world, find hidden treasures, collect powerups and gain new abilities, and uncover mysterious secrets!\nAdjustable CRT television simulator: Tune the retro-ness to your liking!\nSpeedrun courses with Steam leaderboard support! Race your friends' ghosts to the finish line!\nDo the Thing!!\nGet the Stuff!!\nWin the Game!!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Minor Key Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":13543,"name":"Mystic Destinies: Serendipity of Aeons","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79e/79e1bd6b69b51362d8e7e8d293a42f8f.jpg","description":"MDSOA is now 100% complete! You can purchase the entire game at a discount with the bundle.Note:To read the entire main story (5+ hours of story!) of the character of your choice, you'll need to purchase their DLC. The Prologue and the first three chapters of each character - except for Hikaru who has one - are free-to-play. Story: This original English language visual novel tackles romance in an urban fantasy setting, with the aim of blending genres and deconstructing common tropes.\nAfter a ritual forces immense magical powers onto you, you're thrown into a new world with new threats and challenges that you'd never dreamed of. Play as twenty-year-old university student Tsubasa Fujimoto as she learns to balance her daily life with her new supernatural one - all while falling in love.\nWill you survive the perilous journey and become a legendary sorceress?Features:Experience a different kind of love story with a balance between dark and light themes, and a strong emphasis on fantasy and action.\nAround 30+ hours of story for all content.\nLearn about a world with deep lore and its own unique universe.\nFive guys, five completely different stories to experience. The story changes with every route!\nDetailed sprites and backgrounds.\nFive gorgeous painted CG images per route.\nEnjoy atmospheric high-quality music, hand-picked for every scene.\nThree distinct canon endings per character - depending on your choices.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Aeon Dream Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13078,"name":"Double Kick Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/168/168bd5b11539427bca86cc01802b0ee0.jpg","description":"Five badasses and a Gundillac in a zombie hell.Double Kick Heroes is an explosive METAL rhythm game set in an apocalyptic world.\nLead your band on a roadtrip through the wasteland! Blast zombies with your Gundillac and crush them with the power of METAL.\nComing on Steam, PC, Mac & Linux in 2017.\nDrive’n’ShootShoot zombies by beating the keyboard or your pad the way you’d beat a drumset. Double Kicking is the name of a drumming technique to speed up the music. But it's also the name of a deadly weapon you will have to master to survive. Grab your gear and let's beat it to death!\nMeet the crazy band powered by METAL : Lincoln, Snake, Derek, Randie and James. They love METAL and can't spend a day without it. Each one of them is a unique, cunning, METAL player. They live in an apocalyptic world where their favourite Rock stars are scattered all around the world. Discover their story and their hidden truths.\nStoryYou must survive on the highway to hell by killing monsters with your gundillac!\nStruggle through the 30 levels of total madness and escape from this nightmare! Only the power of METAL can save your band!\nEditorYou think Elmobo’s soundtrack sucks? Go to Hell! Or... pick your boring rap music and play monotonous beats.\nYou can also try some Tenacious D and feel the power of METAL. Import whatever track you want and design your own level! Share it with your friend and be the first in the leaderboard!\nObviously, we don’t promote piracy, buy your own albums.\nFeaturesDouble kick zombies in the face with insane METAL music!\n30 tremendously f****king awesome quality METAL songs by a legendary video game AND METAL composer.\nImport your own music, play community designed tracks, edit your favorite songs and share challenges!\nUnlock new gear and pimp your Gundillac.\nRodriguez infused background story about being weird guys and gals who live for Sex, Drugs and Heavy METAL .\nExplosions, rebels, militias, undeads, road-rage, madness, apocalypse. Ready to hit the fury road?\nThe only f****king awesome rock and METAL rhythm game for Steam, what more!?\nMay the METAL be with you!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Headbang Club","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12804,"name":"XSplit","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0d/d0df39ffb147e09aef7ad20977a70a62.jpg","description":"Everything you need to broadcast for freeWith an XSplit Free License, Live Stream and Record your gameplay in 720p at 30fps or in 1080p and above with an unobtrusive watermark. Easily share and manage your recordings, get access to a wealth of useful tutorials and always have the latest version with forever free updates.\nXSplit Free, is the best way for new broadcasters to get started letting you add your webcam and show your game face, to green screen background removal (Chroma Key) and access to the most popular plugins and extensions to help you personalize your content.with An Xsplit Free License Get:\nXSplit Broadcaster A revolutionary audio/video mixing application that allows anyone to create professional quality live broadcasts and video recordings using a simple and intuitive interface that anyone can master.\nXSplit Gamecaster Easily stream and record your greatest gaming moments at the click of a button. It’s simple, easy to use, and perfect for sharing your gameplay with the world.\nLevel up your broadcast and get access to the full XSplit experience, by purchasing an XSplit Premium license on Steam!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SplitmediaLabs","platforms":[{"id":0,"name":"PC"}]},{"id":9839,"name":"Out of the Park Baseball 18","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b39/b391578253709e1c8b3a8285981708aa.jpg","description":"Out of the Park Baseball 18 - the follow-up to Metacritic's PC Game of the Year 2016 and officially licensed through MLB.com and the MLBPA - is a baseball fan's dream come true!\n\"OOTP is an astonishing accomplishment!\" - Boston Red Sox Principal Owner John W. Henry\nStep into the shoes of a GM and/or field manager to own the future or rewrite the past of your favorite real-world baseball franchise. Build the team the way you want to. Start a new career with your favorite 2017 MLB team or span through almost 150 years of baseball history and run any team from the past! You can even set up your own fictional baseball universe or compete in online leagues against other OOTP players. The possibilities in OOTP 18 are endless.\nThe brand new 2017 MLB roster set will include all projected Opening Day MLB rosters as well as the complete minor league system down to the rookie leagues and even future draft classes. Can the Chicago Cubs repeat as World Series winners, despite the loss of Aroldis Chapman and Dexter Fowler? Or did the Cleveland Indians' successful offseason set them up for at taking the World Series trophy home this year? Will the Boston Red Sox's rotation, anchored by Chris Sale and David Price, dominate in the AL East, or are the rebuilding Yankees already a contender? Which team will win the tight National League West Division, the powerhouse LA Dodgers, led by the best pitcher in baseball, Clayton Kershaw?\nOn top of this, 8 international leagues (Japan, South Korea, Taiwan, Australia, Italy, The Netherlands, Mexico and Cuba) and several international and US independent leagues return to OOTP 18 with accurate and projected 2017 rosters.\nDive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch. OOTP players progress realistically over time. Build a team through the draft, or sign big free agents to put you over the top!\n\nNew Features in OOTP 18 include:\nExperience a new game mode in OOTP 18: Challenge! This mode is available for newly created leagues (standard / historical / fictional) and adds a unique twist, along with new rewards, while playing OOTP. Your achievements are tracked in an (optional) online profile. Are you the best OOTP manager on the planet?\nImproved 3D Mode & Game Highlight Reels. With even more ballpark detail than before and enhanced player animations, the 3D game mode in OOTP has taken another leap forward.\nNew Tournamanets & Fall Leagues. Set up your own national or international tournaments, choose from different tournament modes, and manage your favorite nation to international glory.\nHistorical Negro Leagues. With the help of Seamheads.com, our historical database experts have been able to add most Negro leagues seasons to the historical minor league feature of Out of the Park Baseball 18, including accurate rosters and player statistics.\nRedesigned Injury System. Injuries in OOTP 18 has been reworked to be more realistic and interesting. A detailed injury history is tracked for players, the injury database has been enhanced, there are now nagging little long-term injuries, injuries to different body types have different long-term effects, and much more.\nTeam Promotion & Relegation Support. Create a challenging new league setup where teams fight for promotion and try to defend against relegation to a lower league level.\nThe ability to retain player salaries in trades.\nImproved AI throughout the game, for a more challenging experience than ever.\nBeautiful new interface design with three different skins.\nMany 2017 CBA rule changes are incorporated in modern MLB games\nImproved player morale / team chemistry system\nImproved player creation & development system\nImproved game recaps, enhanced play-by-play text and league news\nAnd much more...\nOut of the Park Baseball 18 is here. Greatness has no boundaries!\nVisit us on www.ootpdevelopments.com\nFacebook: http://www.facebook.com/ootpbaseball\nTwitter: http://twitter.com/ootpbaseball","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Out of the Park Developments","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":7712,"name":"Zoo Tycoon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5db/5dbf8a9f7e1c166e010b7685b27ce13b.jpg","description":"Let your imagination run wild with Zoo Tycoon on Xbox One! Choose from over 100 visually stunning animals and the largest, most detailed selection of environments ever, then build, manage and maintain your dream zoo alone or with up to four players on Xbox LIVE. For added fun, upload your creation to the cloud and work together with other Tycoons to care for and share your animals. With intuitive, easy-to-use controls and Kinect-enabled features that allow your animals to recognize your voice and react to your movements, this zoo simulation will charm animal lovers of all ages.\nThe downloadable version of this game supports English, French, Italian, German, Spanish, Portuguese, Danish, Dutch, Russian, Polish, Swedish","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"}]},{"id":2740,"name":"DIGIMON STORY CYBER SLEUTH","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/692/692b1f6ce7d6701883fdce88051a32b7.jpg","description":"Celebrating its 15th Anniversary, the Digimon franchise makes its faithful return to PlayStation® in true RPG form in Digimon Story Cyber Sleuth.\nIn Digimon Story Cyber Sleuth, scan, raise, and train your faithful Digimon companions to battle by your side in classic, turn-based battles! Become a detective and gather clues to solve a strange phenomenon infecting the real & digital worlds.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-2 players\nNetwork Players 2-2\n13GB minimum save size\nRemote Play\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©Akiyoshi Hongo, Toei Animation.\n©2016 BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":2718,"name":"Don't Die, Mr. Robot!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c38/c3847230450aed7bbbdf5f41341e8b47.jpg","description":"It's Don't Die, Mr. Robot! The cute, colorful and blissfully frantic action game that arcade fans have been waiting for all their lives.\nMr. Robot loves fruit! But whenever he tries to eat one it explodes.\nIt’s not all bad though! Those explosions destroy the endless horde of robotic machines trying to squish, zap, stomp and bite him.\n** Features **\n- Remix Mode: Battle through 50 unique missions in Remix Mode which mess up the rules and push your skills to the limits\n- Arcade Mode: A never ending, different every time arena based fun machine! Hit the global leaderboards and try and become the world’s best.\n- Time Attack: Two and a half minutes of hyper-charged frantic action.\n- Chill Out Mode: A more sedate and strategic but equally intense mode for when your nerves are just too fried to take on the game at full pace.\nSome functions and features may not be available on PlayStation TV.\nPurchasing this content entitles you to both the PS4™ system and “PS Vita” system versions!\n1 player(s)\nNetwork Features\n1024KB Minimum\nTouchscreen\nRear Touch Pad\nDual Analog Sticks\nMotion Sensor\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\n© Infinite State Games 2014","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Infinite State Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":812168,"name":"Escape the Backrooms","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cf/3cf2ed3757c1b83ac47e2391d390164c.jpg","description":"Explore the backrooms in this horror game.Features\nExplore procedurally generated backrooms based on internet folklore.\nTraverse through multiple levels in the backrooms with different nostalgic scenery.\nHide from the evil entities that exist in the backrooms.\nEscape from the infinite cycle of levels.\n\"If you're not careful and noclip out of reality in the wrong areas, you'll end up in the Backrooms, where it's nothing but the stink of old moist carpet, the madness of mono-yellow, the endless background noise of fluorescent lights at maximum hum-buzz, and approximately six hundred million square miles of randomly segmented empty rooms to be trapped in.\nGod save you if you hear something wandering around nearby, because it sure as hell has heard you.\"","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Fancy Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":810294,"name":"SCP: Secret Files","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e2/4e2c50430529360b3eac6c3596cd9cf9.jpg","description":"What if we told you that there is another side to this world? That the established order of our existence is under constant threat from an unknowable number of horrifying abominations. Most of humanity has never encountered these anomalies - a creature that kills anyone who sees its face, a cult capable of causing worldwide disasters, everyday objects that take on otherworldly powers, and other monstrosities beyond our comprehension. Standing between them and us mere mortals lies humanity's last line of defense - a mysterious global organization committed to \"secure, contain, and protect\". Meet the SCP Foundation.\nYour Roles\n\nRookie researcher Carl, a new employee at the SCP Foundation, is assigned to help organize some of the Foundation's top-secret files. However, something inexplicable happens while he is browsing the archives. Carl's perception of the world gradually changes, and even his psyche becomes seriously affected. Can you retain your grasp on sanity after experiencing these anomalies?\nUnique Experiences\n\nSCP: Secret Files offers a diverse range of gameplay experiences – investigate a mysterious hydroelectric power plant, immerse yourself in an uplifting fable, or delve into a bizarre, retro-inspired world. Each story introduces its own tone, mechanics, and cast of characters.\nSCP Lore\n\nThe world of the SCP Foundation covers a wide variety of ideas, encompassing people and creatures, objects and phenomena, abstract concepts, and even supreme beings such as SCP-3999. Likewise, these stories examine a wide range of themes, including horror, science fiction, comedy, mythology, and more. We have designed our game to be an SCP-fan's dream experience, as well as the perfect primer for those unfamiliar with the weird and wonderful lore of the SCP Foundation.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"GameZoo Studio","platforms":[{"id":0,"name":"PC"}]},{"id":743389,"name":"Soul Hackers 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92a/92a9eed76b459f7769fb8cc2bf7e76a0.jpg","description":"In a war between devil summoners, it's up to Ringo and her team to decrypt destiny and save the world from apocalypse!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":699114,"name":"Archvale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70d/70d59d4c32d3c7f925bf5e7502f5bfe9.jpg","description":"A malicious and cruel king once ruled the land and terrorized all who faced him. He along with the fabled arch to Archvale have become the fodder for ghost stories and passed down myths. All that remains of him are the Undying; beings whom the king cursed with immortality to live out their eternity in his prisons.\nYou and you alone can defeat the Undying and rid the world from the dark shadow the king has left. Journey across diverse regions, looting and crafting your way to better weapons and equipment. Through these upgrades you will be able to succeed against the host of enemies that await you and stand between you and the truth about the said-to-be-mythic arch to Archvale.\nKey Features:\nPlay Your Way. Augment your character via badges, allowing you to create a build that suits your playstyle.\nMastery is Key. Skill-based bullet hell combat will put your weapons of choice to the test and require precision and speed to succeed.\nBuild Your Arsenal. Craft over 200 weapons and armor using items gathered from the environment and from slaying enemies.\nExplore the World. A host of enemies across diverse environments and classic-inspired dungeons will take you across an ever changing map where you will find unique resources needed to complete your journey.\nDiscover the Truth. Uncover the dark lore of the world on your quest to unearth the arch to the fabled world of Archvale.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"idoz","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":379536,"name":"Trepang2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e93/e93e3742c03c6825243c456308e9ff0b.jpg","description":"Dodge bullets, sneak in the shadows and unleash your deadly gun-fu skills on the bad guys who took everything from you.\nFree demo coming Dec 2019, wishlist and follow to stay updated!\nA mysterious group breaks you out from a heavily guarded blacksite. Your memories gone but your combat abilities enhanced far beyond human limits, it's time to fight back, find the truth and save the world.\nFree demo coming Dec 2019!\nFeaturesImmersive single player story campaign\nInstant action mode: horde defense, time attack and other fun challenges\nBrutal close quarters gunfights with tons of gore\nSlow down time and dodge bullets\nSneak in the shadows, cloak to become invisible\nKinetic melee combat: Punch, kick, slide combos while shooting\nAdvanced enemy AI who react to your every move, fully unscripted combatFollow, join the community and chat with the devs!Look in the external links to join our Twitter, Youtube and Discord. We're always listening!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Trepang Studios","platforms":[{"id":0,"name":"PC"}]},{"id":57794,"name":"Spider-Man 2: Enter Electro","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c84/c8492b7730fbcce76ff501adb9c49428.jpg","description":"Spider-Man 2: Enter Electro is an action-adventure video game developed by Vicarious Visions and published by Activision for the PlayStation in 2001. It is the sequel to Neversoft's Spider-Man title, which was released the previous year. The game follows Spider-Man as he attempts to stop another old nemesis Electro from obtaining a source of power known as the Bio-Nexus Device. Game bosses include Shocker, Hammerhead, Lizard, Sandman and the charged-up Hyper-Electro.\nThe game is notable for having its final level drastically changed after the September 11 attacks.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"PlayStation"}]},{"id":51374,"name":"Sos i Pie Sos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/155/15571d763a33c79472826b724896a025.jpg","description":"In this runner game, you play as a mouse who has stolen so much cheese that there is 10000$ bounty on his head! So there are many bounty hunters after you, but none is able to track you down except the most talented one, the Cat! He has found you when you were eating your lunch and starts chasing you. So you have to run as fast as you can if you want to survive. But he is smart and has planted many traps on your way that you have to jump over them. There are also cactuses in this desert that can kill you if you hit them! Also remember that you have a limited stamina and if you run out of it, you can’t run anymore and the Cat will catch you. So you have to gather cheese as you run to fill your stamina. Note that you can double jump and using this skill is essential for progressing through the game.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Easy game","platforms":[{"id":0,"name":"PC"}]},{"id":35385,"name":"Worms 3D","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/227/227aade0fc723b0284e0e5443a90a168.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":26055,"name":"Mario and Luigi: Bowser's Inside Story","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57a/57a1551d54b04f08962a11c5a8f9083d.jpg","description":"In his evil plot to take over the Mushroom Kingdom, Fawful tricks\nBowser™ into eating a magic mushroom. The mushroom causes Bowser to\nbegin inhaling everything around him, including Mario™, Luigi™ and\nPrincess Peach™! Do the Mario Bros. have the guts to rescue Peach and\nescape?\n\nPlayers are in control of two separate storylines. One features Bowser\nand his efforts to stop an arch-villain from taking over his castle.\nMeanwhile, inside Bowser, the microbe-sized Mario & Luigi must muscle\ntheir way through challenges and keep their nerve if they want to find\na way out. They take action to control Bowser from the inside – but\nwithout his knowledge.\n\nPlayers can switch between storylines at will. What happens inside\nBowser affects what he’s doing on the outside. Sometimes Mario & Luigi\nmust solve puzzles and challenges behind the scenes to help Bowser\novercome various obstacles and advance the plot.\n\nPlayers must make well-timed button presses to enhance their\nperformance during battles and challenges. In some battles, Bowser\ngrows so large that players must turn their Nintendo DS or Nintendo\nDSi™ system sideways, blow into the microphone or tap on the touch\nscreen with the stylus to keep up with the action.\n\nThe game features the same hilarious dialogue that has been the\nhallmark of the Mario & Luigi series.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":22985,"name":"Silver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/961/961c9daeb658384eeca3be41fd37f428.jpg","description":"Silver, a corrupt and sinister sorcerer, rules the land of Jarrah with an iron fist. He and his henchmen have abducted the village women as part of a pact with the almighty god, Apocalypse.\nNow, only one man can put a stop to Silver and his minions. That man is you, David, a promising young knight whose wife is among the captured. In order to succeed you'll need to recruit allies, master your swordplay, learn the art of magic, and venture through hostile worlds teeming with Silver's corrupt followers to find 8 lost artifacts. Begin your quest, and become a hero!\nKey Features:\nIntuitive Swordplay: Silver's unique control method allows quick and intuitive handling of action, which is especially helpful in the heat of battle. In effect, the mouse becomes the player's \"sword arm\". Sweep the mouse to your left and your hero will slash to the left, sweep the mouse forward and your hero will lunge. Magical effects, throwing knives, arrow, and even catapults are also controlled through the mouse system.\nInteract with more than 50 characters. Be wary, not all are friendly\nRecruit allies, all with special abilities-Sekune is a master of archery, Cagen is a skilled martial artist, Jug's strength makes him a force to be reckoned with, and more\nTravel through hundreds of beautiful locations, rich in detail…and packed with danger\nImmerse yourself in battle with real-time combat\nMarvel at vivid special effects, powerful magical spells, and mighty weaponry that you'll acquire on your journey\nUse your mouse as your sword-vanquish your foes, including demons, dragons, and other insidious creatures","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":22476,"name":"Cooking Academy Fire and Knives","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f93/f93e016147ef4f5466040ea110a9eca8.jpg","description":"A mouth-watering collection of 3 exciting and entertaining Cooking Academy games:Cooking Academy Grab your oven mitts and don your chef's hat! Cooking Academy is the game that places you in the kitchens of a prestigious culinary school! From eggrolls to pancakes, to crème brulee, it`s up to you to prepare over 50 different recipes! Learn interesting trivia about food while mastering the skills of chopping, kneading, mashing, flipping, frying, and much more! Unlock new recipes and trophies by passing your cooking courses and exams. Are you ready to be a Master Chef?\nUnique recipes\nLoads of Challenging Mini-Games\nExciting courses to master\nSpecial Achievement Trophies\nBecome a Master Chef!\nCooking Academy 2 World Cuisine Whip up a world of fun in Cooking Academy 2, the sequel to the hit game, Cooking Academy! Join the instructors at the World Culinary Workshop for a whirlwind adventure in a global kitchen. Make your way through 60 different recipes including Chinese BBQ Pork Buns, Mexican Tamales, Japanese Sushi, American Hot Dogs, and more. Master new skills and mini-games like food processors, mixers, and raiding the fridge. Maybe you'll learn a few new secrets to try in your own kitchen! There's a whole world of dishes for you to prepare in Cooking Academy 2 World Cuisine!  Enroll today!\nUnique Recipes\nExciting cooking games\nMaster international cuisine\nCooking Academy 3 Recipe for Success\nWelcome back to the Cooking Academy! After winning a million dollars and starting your own restaurant, you are now writing your very own cookbook! And who better to help your research than your old professor Henri Formage and his friends! Learn interesting trivia about food while mastering all new skills and mini-games including Refrigerate, Seasoning, Find Food, and much more! Cook croissants, tapioca pudding, chicken & waffles, and many more new, exciting recipes! Get ready for a culinary adventure with Cooking Academy 3: Recipe for Success!\nOver 60 recipes and exams\n50 Unique Cooking Games\nWrite your own cookbook!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fugazo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":20226,"name":"Return NULL - Episode 1","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/473/473915fe7079c004022147ffac6dd40d.jpg","description":"In a distant dystopian society under a heavy and oppressive militaristic force you find yourself in the shoes of Jack Drebin. Long time Local Security Force member. Husband. Soon to be father. You go about your business day-in and day-out working hard to keep the city streets safe. Then as fate would have it, your day to day life is thrown into chaos during a routine search and seizure on a suspected terrorist...\nReturn NULL: Episode 1 is the first in a 3 part Point-and-Click Adventure series. Done in an indie European comic art style, players will examine their environments for clues, carry on dynamic conversations, collect items and solve logical environmental puzzles to advance through the twisting narrative. When the action gets hot, Return NULL incorporates a real-time duck and cover shoot out mechanic that elevates the tension and puts the player in immediate danger.\nFEATURES\n10 unique characters, each with different emotional dialogue portraits\n14 interactive hand drawn locations\nUnique indie European comic art style\n7 original composed music tracks that set the mood and tone of each scene\nInnovative, Real-Time Gunplay mechanic","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Michael Lückgen","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18558,"name":"Enigmatis 3: The Shadow of Karkhala","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79f/79feba7266d1fa5543fbaf4bda1ee3ca.jpg","description":"What secrets does the ancient monastery hold, high on its snow-covered mountain slope? What has brought the demonic Preacher here, and can anyone stop him now that he is more powerful than ever?\nPlay the enthralling hidden object puzzle adventure game from the creators of Grim Legends!\nEnigmatis 3: The Shadow of Karkhala is the final chapter in the blockbuster trilogy: an exciting detective story rife with adventure, puzzles, and ancient mystery.\nThe ultimate hidden object adventure begins!\nThe demonic preacher has escaped to the remotest mountains in pursuit of a grim secret that could give him ultimate power. He has already eluded the investigation of the protagonist detective and her partner Hamilton twice: once in Maple Creek, and again in Ravenwood. It’s no mystery that this time it’s personal.\n43 hand-drawn locations full of HO scenes!\nAfter returning to Maple Creek and uncovering new evidence about the preacher’s enigmatic plan, the two detectives set out in search of a centuries-old monastery hidden high in the breathtaking mountains where the immortal preacher’s lifelong quest for world domination could finally meet its sinister end.\nExciting 25 mini games and puzzles set in the Karakorum Mountains!\nWhat is hiding in the ancient monastery that clings to upper reaches of the snow-covered mountain? What nightmarish secret is the preacher looking for there?\nFantastic detective story rich in eerie mysteries!\nDrawn into this ancient struggle between the forces of light and darkness, the detective must defeat the ominous preacher at any cost. Will they even be able to stop him now that he’s more powerful than ever before?\nMore mini games and puzzles in the bonus adventure!\nPlay the Blood on the Snow prequel to the main game for more storylines and even more mysteries and hidden object scenes!\nFeaturesThe ultimate hidden object adventure begins!\n43 hand drawn locations full of Ho scenes!\nExciting 25 mini games and puzzles set in Karakorum Mountains!\nFantastic detective story rich in eerie mysteries!\nMore mini games and puzzles in bonus adventure!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":17958,"name":"Lethal RPG: War","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e9/6e9c3f03d7b3ed1019a6fdfe801994b0.jpg","description":"Journey on an epic quest with Lethal and his elite party of warriors through a huge fantasy land. Play as Lethal and his companions in exciting turn based battles against a variety of fantasy creatures.\n8 playable characters, all with unique abilities, armor and weapons.\nTurn-based combat featuring a diverse and engaging battle system.\nA huge world with 13 areas to explore, all with unique enemies and quests.\nCraft powerful armor and weapons from materials gathered from intense boss monster encounters throughout the kingdom.\nOver 50 story quests to complete.\nAn arena that lets you put your abilities to the test, where you face off against more difficult versions of past encounters.\nLoads of pets to find that have special abilities to help you face your enemies in battle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"EyeSpyda Games","platforms":[{"id":0,"name":"PC"}]}]