[{"id":327216,"name":"Roller Champions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/049/049282a6d9dc2fbf830af7c1bfccd915.jpg","description":"Skate, tackle, and roll your way up to glory in Roller Champions™. Discover a free-to-play, team PvP sports game like no other!\nWelcome to 2032. Arenas are built all over the world and fans rush to the stands to admire their modern-day heroes, the Roller Champions. They roll up to 100 miles an hour, tackle opponents, wall-skate, and dunk while thousands of fans scream their names.\nAs a Roller Champion, compete in a team of three against three. The rules are simple: take the ball, make a lap while maintaining team possession, dodge opponents, and score. Go for more points by completing additional laps before attempting a goal. After each match, gain fans to compete in bigger arenas. Customize characters and create a unique destiny.\nGATHER YOUR TEAM AND COMPETE Team up with two players and dive into Roller Champions’ gameplay, which combines fun competitive action and collaborative team play.\nGo head-to-head against the opposing team through speed, wit, crushing tackles, and daring dodges to lap around the arena and be the first team to reach 5 points by throwing the ball through the hoop.\nFeel the thrill of riding up and down the wall of the arena as you gain speed, quickly stop, pivot, and re-position as your teammates race towards the goal, just one pass away from winning or one interception away from having to start all over again.\nFROM ZERO TO HERO – BUILD A LIFE OF A WORLD-RENOWNED ATHLETEWrite your own legend. Start your sports career as the underdog and roll up to glory as you win matches.\nObtain more fans in arena bleachers as you complete spectacular actions and progress to bigger stadiums.\nWrite your name in Roller Champions’ history books as you climb up the leaderboards.\nProgress through Roller Champions’ ranked mode from Garage league all the way to the Elite Champions’ league.\nCompete in thrilling time-limited special game mode to gain fans or special lootballs.\nCREATE AND FULLY CUSTOMIZE YOUR SPORT LEGENDCreate your own character and customize your outfit as you progress.\nUnlock new items, including skates, helmets, fresh attires, gloves, goal effects, emotes, air poses, player titles and banners.\nProgress through the Roller Pass to gain season-exclusive items, spectacular goal FX and emotes, lootballs and in-game currency (wheels).\nCOME HANG IN THE SKATEPARKRoller Champions’ social hub is THE place to be to meet up and learn the ropes with your friends!\nRoll around, practice scoring and learn new tricks.\nParticipate to time-limited minigames.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":52879,"name":"Disney's Tarzan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27d/27d2a0d9be67b1bb77f9b1cf038776f1.jpg","description":"Disney's Tarzan (also known as Tarzan Action Game) is an action platformer video game developed by Eurocom and published by Sony Computer Entertainment for the PlayStation in 1999 based on the Disney animated film Tarzan. Konami published the game for its Japanese release. It was also released for PC systems in 1999 and for the Nintendo 64 in 2000. A variant of the game for the Game Boy Color was developed by Digital Eclipse and released in 1999.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Digital Eclipse","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":46930,"name":"Tactical Monsters Rumble Arena","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/898/898e70f9cd2b189ca8c8b31184e1f496.jpg","description":"Do you have what it takes to be #1 in the world? Enter the fun world of TACTICAL MULTIPLAYER ARENA!\nExperience the rush of 3-5 minute strategy battles in the world of Tactical Monsters comprised of monsters from all corners of the world.  Whether you are competitive in real life or virtual reality, this is the ultimate competition game for you!\nGAMEPLAY GENRE\nForm the most monstrous team and conquer the real-time multiplayer gameplay. Outsmart and destroy your opponents by strategically positioning your monsters before battle and tactically controlling their actions in battle.\nThis is a turn-based, hex grid tactics gameplay with monsters from all time and space. From Franky the Frankenstein, to fantasy monsters like Medusa and Griffin, to culturally established creatures like WuKong and the Mummy, to monsters you’ve never seen before such as Frosty the bigfoot and Nobu the ghost samurai. Each monster have their own unique background and jobs. Each monsters have unique skills such as magic skills, physical skills, or even world-ending skills like the nuclear warhead from Dr. Walter’s Meca Machine.\nGAMEPLAY MODES\nThis game has a variety of single player mode levels that allows you to train and upgrade your monsters. Once you are ready, you will then enter into real time PVP battles with players from around the world to fight for the #1 spot. Fight for your country and your clan by tactically being the best and smartest in the game.  Unleash your monsters and let them rumble in the world’s biggest brawl!\nSOCIAL INTERACTIONS\nPlay with your friends in 1 on 1 virtual battles, form a clan to trade cards. Exchange tactical knowledge with players worldwide in the world chat and clan chat. Build your own clan defenses to fend off the enemy raiders and be the #1 clan in the world!\nPLEASE NOTE!\nTactical Monsters is strategy game that is completely free to download and play. However, some optional game items can also be purchased for real money. You can disable in-app purchases in your device’s settings. An internet connection is also required.\nFEATURES\n- Easy gameplay with no annoying  hand-holding tutorials.\n- Battle through Adventure Mode to recruit unique monsters.\n- Upgrade the monsters to unlock ridiculous monstrous and destructive skills\n- Endure through the Guerrilla Warfare Mode (Survival Mode) to defeat the never-ending BOSSES.\n- Sharpen your tactics by visiting Training Grounds.\n- Duel players in real time live PVP to take their thrones and claim the world treasure chest.\n- Set your optimal defense formations and layouts. Be #1 defensively in the Defense Arena.\n- Ally with your clan mates and be the #1 clan in your country by building maps and layouts together that are almost impossible for other clans to raid. Set obstacles, towers, traps to defend your kingdom.\n- Form a clan to share cards and build your own battle community.\n- Play and chat with players worldwide .\n- Talk & strategize with your clan-mates in clan chat and world chat.\n- Discover free items, rewards and monsters from daily check-ins and store bonuses.\n- You might like this game if you like to like turn-based games, strategy games, hero growth and heroes collection games, RPG games, TRPG games, games similar to western chess, Chinese chess, war chess. This game is also similar to other turn-based hex grid or hexagonal games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Camex Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":34801,"name":"Enter the Matrix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/294/294efb25e20de0485201511c585f3ec2.jpg","description":"In the war to save Zion, what part will you play?\n\nEnter The Matrix casts the player as Niobe or Ghost, captain and first mate of the rebel ship Logos, respectively. Niobe is a master combatant, capable of beating up everyone in her way. She is an excellent pilot, both in the real world and in the Matrix. Ghost is very adept at firearms, and his marksmanship is a mastery. Both characters are very athletic, and throughout the game the player will have to walk, run, jump, strafe, peek, run on walls, climb ladders and pipes, and fight various enemies.\n\nAvailable weapons include a security pistol, an automatic pistol, a submachine gun, a machine gun, a shotgun, and grenades. Besides weapons, a variety of hand-to-hand moves are available, from punches, throws, and grabs to kicks and chokes. Throughout the game, the player will be called upon to utilize Focus moves, which is basically bullet time from the films. When Focused, time slows to a crawl, allowing the player to zoom around enemies, dodge bullets, and jump to avoid oncoming obstacles.\n\nThe game was written and directed by the Wachowski brothers, and its plot is intertwined with that of the second movie, The Matrix Reloaded.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Shiny Entertainment","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":28696,"name":"Wheelman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c47/c47f05d0a4a5ad5f6121368ec2d2f398.jpg","description":"Combining spectacular Hollywood-style stunts with a gripping storyline, Wheelman provides an adrenaline-fueled, cinematic thrill ride guaranteed to leave you breathless. Vin Diesel stars as an undercover agent and highly skilled driver who must infiltrate the Barcelona underworld to gather intelligence surrounding a covert heist. Posing as a driver-for-hire, he ends up caught in a crossfire of corruption and chaos while trying to stay one step ahead of local law enforcement and rival gangs.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Tigon Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":16690,"name":"Vox Populi Vox Dei 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a52/a52a2eb787fa2bbeb8d2aa92529097b2.jpg","description":"The story of Vox Populi Vox Dei: Episode 2 continues where the original left off: Dr. Wolf has taken the lovely girl and tried to kill our hero, but he doesn't know just how hard that that is to accomplish.\nThe adventure begins with the ninja waking up inside a cave, with no clue as to what happened to his girl. When he started his mission, a long time ago, he didn't realize how big the problem was: the wolves had created an empire, the enemy is stronger that ever.\nThrough his path he discovers a new world that forces him to expand his journey and fight not just on the ground. Dr. Wolf's army is waiting for him, the ninja must pass different challenges without hesitation, but little does he know of what awaits him next.\nGame Features\nNew improved graphics\nBoss fights\nOriginal soundtrack\nIngame/Not Ingame Cinematics\nMore blood that ever\nMultiple ways of dying\n+50 Levels\nDifferent game mechanics\nSteam achievements\nXbox-360 Gamepad Support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Great Cogs","platforms":[{"id":0,"name":"PC"}]},{"id":13486,"name":"Desolate Wastes: Vendor Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/078/078514dbe37cbb6966c109fe00ed34fb.jpg","description":"Vendor Chronicles puts you in the shoes of a Vendor in post-apocalyptia!\nManage your trade, set your defences, deal with locals and fight hordes of mutants in this new perspective on post-apocalyptic survival!\nFeatures:\nBuy and sell goods from apocayptic wanderers!\nUse your skills to barter a better deal from each transaction - buy low, sell high!\nRepair broken gear for profit!\nHire mercenaries and buy base defences to fight off angry hordes of both monsters and brigands!\nAwesome retro artwork!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rotatipyra","platforms":[{"id":0,"name":"PC"}]},{"id":9766,"name":"Unearned Bounty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c4c/c4c5c8b43ed32af275a4b015be6684c9.jpg","description":"Ahoy maties! Get ready to steal and plunder your way to victory in Unearned Bounty, a pirate-packed Free-For-All multiplayer naval combat game.InfamyThe most infamous pirate comes out ahead in Unearned Bounty! Target the 1st place ship who has the golden skull for more bounty and gain recognition for your great feats while avoiding those bilge rats in last place who have little to their names.Social Skill based combatMe drunk mother shoots better. Knowing how to aim straight is as important as who and when to target others. Pick from the current selection of four ships with their own unique ability and style of play.Wrapping Map SystemPirates know no bounds! Sail indefinitely and you'll always be close to the action Pac-Man style without being pushed up against the edge or scallywags hiding in a corner.Developers are passionate about feedback and are part of the communityWe have an active discord where we listen to our community for feedback and suggestions, integrating chat directly into the game. We'll have constant updates to the game, adding more ships, maps, modes, and flags as we progress through Early Access and beyond.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Extrokold Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":1287,"name":"Zenith","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fba/fba84b23d7750e7871472edf331e6635.jpg","description":"Wizards and adventurers have one thing in common: they'll happily start messing with any ominous glowing artifact they find in a ruin if they think they can gain something for it, be it knowledge on the arcane powers that forged the world, some shiny new sword or, god forbid, the power of friendship. No matter how many skulls are engraved on the thing.\nSure, mages may be more prepared and do it for the right reasons... sometimes. But that doesn't change the fact that they're toying with dangerous powers, and when they fail, they fail big. And most times those failures reshape the world around them. Generaly in the form of a smoking crater. Or something with a lot of tentacles.\nWell, Argus windell was a pretty good wizard, an Arcanologyst to be precise. He knows everything there is to know about ancient artifacts, but I guess an apocalypse unleashed in the middle of a war has a way to change your views on the whole “unveiling the mysteries of the universe” thing. So he retired, looking for peace and quiet.\nBut that’s not easy to get in a world full of spike-haired buffoons who drag their giant swords around and mess things up with their chosen one complex. Specially when you’re trying to keep one of those dangerous devices out of the reach of their greasy heroic hands.Key Features\nExplore a world of possibilities in a fully-realized fantasy realm. And one of those world map things we used to love.\nFace huge bosses, dangerous foes, and angsty teenagers.\nFind tons of parodies and pop culture references. Let's see if you can recognise them all.\nSave the world. Sorta. Granted, it's a bit of a cliché. But hey, it works.\nUnlock special abilities and upgrade basic combo movements with an all-powerful “final blow”-type move.\nEvade the cruel and overrated real world with a long single player campaign. Well, not as long as that one with the guy with the white hair, SURE, but we're an indie studio, dammit!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Badland Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":836798,"name":"The Entropy Centre","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/668/6687d4bbe621fadf8a29c57bb381f93c.jpg","description":"The Entropy Centre is a mind-bending puzzle adventure where you reverse objects through time to overcome seemingly impossible obstacles and conundrums.\r\n\r\nManipulate time to your will and solve ingeniously challenging puzzle rooms, each one taking you closer to the heart of a colossal space station in orbit of Earth.\r\n\r\nAn extinction level event has set the world ablaze. You appear to be the last remaining person alive. Mankind’s only hope lies at the core of the Entropy Centre.\r\n\r\nMeet ASTRA, The Entropy Centre’s most advanced technical marvel. ASTRA is an AI-powered device that can scan an object’s spacetime chronology and move it through the past. Powers include rebuilding collapsing pillars to reheating cups of tea. She’s pretty chill.\r\n\r\nThe truth behind The Entropy Centre’s imminent collapse, and the Earth’s demise, can be found at the heart of this sprawling dangerous facility. But will you accept the unfortunate truth that awaits?\r\n\r\nDeviously challenging with razor-sharp witty writing and outstanding voice acting performances, The Entropy Centre merges a brilliant puzzle game with an epic adventure.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Stubby Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":576532,"name":"Cozy Grove","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea586b50b2cfe7ffa946488a91275dd1.jpg","description":"Welcome to Cozy Grove, a life-sim game about camping on a haunted, ever-changing island. As a Spirit Scout, you'll wander the island's forest each day, finding new hidden secrets and helping soothe the local ghosts. With a little time and a lot of crafting, you'll bring color and joy back to Cozy Grove!\nFeatures:\n• Beautiful, dynamic, hand-drawn landscapes that come alive when you help a spirit in need.\n• Dozens of memorable characters and spirits for you to find and befriend. Each spirit has a unique, extensive story for you to unravel over time.\n• Collect spirit animals, craft decorations, go fishing and more!\n• 40+ hour campaign filled with side quests, designed to span months of playtime.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Spry Fox","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":51335,"name":"Omensight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f1c/f1c41f3bd938c2c533c671c1552c4f99.jpg","description":"You are the Harbinger, a skilled warrior who exists outside of time. You have foreseen the annihilation of the land known as Urralia and have been summoned to rewrite its fate. Serve as the eyes and the sword of Urralia as you identify characters who may have played a part in the story of its destruction, like a war general or a powerful sorcerer. Appear alongside these characters to discover how they chose to spend their final moments. Will you fight with them or against them?\r\n\r\nBy participating in fateful events from different perspectives, you’ll learn valuable information about how specific decisions unfold. When those situations call for battle, make use of the Harbinger’s sword techniques and creatively combine time-slowing spells or other abilities to eliminate threats. Use the power of Omensight to weave a new narrative, pave the way to a brighter future, and give the land of Urralia a second chance.\r\n\r\n**Key features:**\r\n\r\n* Manipulate time to witness the outcome of events from different perspectives\r\n* Join a diverse cast of characters with mysterious roles to play in Urralia's story - and each other's\r\n* Learn key information about specific characters, then help or hinder them to prevent the end of the world\r\n* Fight using fluid, stylish combat that combines swordplay and magical abilities","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Spearhead Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":28430,"name":"Magic 2013","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7e/d7e06c46780bfac0b34a5ddd4f87f65e.jpg","description":"(Online Interactions Not Rated by the ESRB)  Face a greater challenge in the latest version of this hit franchise. Play with friends or the AI, take on new encounters and opponents, and face up to three other players in the Planechase multiplayer format.    Featuring ten customizable decks, Magic 2013 offers new game items to unlock and introduces the option to choose what lands to tap when you cast your spells.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wizards of the Coast LLC/Stainless Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22402,"name":"Victoria I Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e1/1e19fe1c121313853c7cad5b6e590000.jpg","description":"Carefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion, colonization and social upheaval, to emerge as one of the great world powers by the dawn of the 20th century in Victoria Complete. Gather the wealth and strength required to stay ahead of your enemies, gain invaluable prestige and honor, and reform the nation into a free democracy. Or, drive your people down the grim road of tyranny, corruption, and anarchy...\nExperience an in-depth political simulation where every action you take will have various consequences all over the world. The collection focuses on six different aspects of governing a nation: Diplomacy, Warfare, Economy & Industrialization, Colonization, Technological Research and Politics. The main game is hailed as the ultimate World Domination and Empire-Building simulation and allows continuation of the game in “Hearts of Iron 2: Doomsday”.\nFeatures:\nHistorical and Dynamic missions guiding your country through history\nAdvanced tech tree covering the entire period including the Interwar period\nExperience a global map with more than 2800 provinces\nA military system linked with the player's policy decisions\nDeep engrossing political simulation and detailed economic system\nMultiplayer with up to 32 players\nA Doomsday converter with possibility to export a save game at the end of the game into Hearts of Iron 2: Doomsday VICTORIA is all about recreating world history according to your wishes. While the game strives to simulate the unique conditions and prerequisites of the time period as closely as possible, it leave all the decision-making to you, the player.\nDeveloped by the team behind Europa Universalis and Hearts of Iron.\nPlay any country from the time period.\nPlay multiplayer with up to 32 players in LAN or over the Internet.\nMore than 2 hours of quality recordings of music from the period.\nThis real-time game can be set to pause at any given point or event, allowing players to plan and strategize in a \"semi real-time\" environment.\nSet on a global map with more than 2800 provinces and sea zones","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":21159,"name":"Stonerid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/449/4494f9e994bf7ea9de8c3252380e1e39.jpg","description":"Stonerid is a challenging 2D platformer, which the most important feature are two parallel, different worlds. To finish each of 32 different levels, one must deftly use differences between alternative dimensions. Unconventional game style and lots of dangerous traps and monsters make it extremely difficult to rise to the challenge. The main task is to solve the mystery of toxic substances that have appeared unexpectedly on Atronast Mountain.Main Features: 32 extensive levels with 2 parallel, differently designed worlds\n31 bonus levels especially for players who like new challenges\n5 diverse lands\n3 difficulty levels\nunique gameplay mechanisms\nwonderful artwork\nbeautiful, moody soundtrack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Enitvare","platforms":[{"id":0,"name":"PC"}]},{"id":19517,"name":"Bloody Good Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/008/00831f105cd0b029d2ed77a1fd2697d7.jpg","description":"Congratulations, you’ve just been cast in your first slasher movie!  You’ve been given your big break by the notorious Director X. His methods have produced some of the finest grindhouse films ever committed to celluloid. Famous faces and big names are not what this director is looking for. Fresh faces are all Director X casts, and with your embarrassingly empty resume you’re as fresh as they come!\nBut seven other hopefuls are also in the running, so you’re going to need to prove your worth if you’re to hit the leading credits. You’re going to have to scratch, claw and strike to slash your way to the top. This job’s going to be murder!\nDeveloped by Outerlight, Bloody Good Time takes a new and irreverent approach to multiplayer shooters. The game runs on the Valve’s Source engine, known for classic multiplayer shooters such as Half-Life and Team Fortress.\nKey Features:\n\nBe a deceitful bastard! Flush your enemies in the toilet, crash their heads on their plates when they eat, do whatever it takes to maim and kill other competitors in nasty and unexpected ways!\nUse a full arsenal of wacky weapons including guns, a baseball bat, a frying pan, and even an exploding remote-controlled rat to transform the movie set into real mayhem!\nClash with up to 8 players online in a zany, first-person shooter, multiplayer experience like no other.\nChoose from a variety of stereotypical B- movie characters, including the bikini beach babe, the stoner, the creepy clown and the super jock.\nFrom Spring Break Beach to the Horror House to the Vegas Hotel, discover what’s behind the Hollywood set in these unique multiplayer maps.\nDeveloped by Outerlight, best known for their work on The Ship and the Half-Life mod of the Ship. This Scottish-based developer brings a great combination of humor and quality game play to Bloody Good Time.\nRunning on the Valve’s Source engine, Bloody Good Time comes from the same pedigree of classic, online multiplayer shooters such as Half-Life, Team Fortress and Counter-Strike.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Outerlight","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":19170,"name":"Tex Murphy: Overseer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/787/78733a0a1858428c58162534a166a249.jpg","description":"The Adventure Game of the 21st Century\nThe client is drop-dead gorgeous. Her father is just plain dead—of an apparent suicide. She's certain he was murdered and is willing to do anything to prove it. Tex Murphy, the P.I., is willing to do almost anything to make rent. The investigation leads Tex into the heart of a dark secret. An elite team of specialists have created something unspeakable. Now each of them are marked for death, and so begins the reign of the Overseer...\nFirst product designed specifically for DVD. Featuring Dolby AC-3 5-channel surround sound.\nAward-winning 3-D Virtual World Engine put you in the 21st Century.\nFrom the creators of \"Adventure Games of the Year,\" Under a Killing Moon, and The Pandora Directive.\nDazzling graphics - Travel through Anasazi ruins, hidden passages and urban landscapes - explore the deadly secrets of the Rock - Alcatraz Island.\nA fast - paced chase through double-crosses, fistfights, ambushes and gun battles, where wits and ingenuity are the only way to survive.\nTwo levels of play, over 60 unique puzzles and a complete on-line hint system.\nAn excellent cast, including Michael York, Rebecca Broussard, Henry Darrow, and martial arts expert Richard Norton. Edited and directed by Adrian Carr.\nOverseer is a retelling of the story from Mean Streets, and contradicts many of the events and character descriptions in the original story. Since Overseer is part of the \"modern era\" of Tex adventures, it is safe to consider the new, retold story as \"canon.\"","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Access Software","platforms":[{"id":0,"name":"PC"}]},{"id":16327,"name":"Puzzles Under The Hill","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1f/e1f817cc7a69b8796694aaf18e0e5cbd.jpg","description":"Puzzles Under The Hill features Pamela Possum taking a stroll to visit her best friend Sammy Squirrel. Along the way, Pamela collects shiny jewels unveiling wonderful jigsaw challenges, featuring beautiful imagery from the National Gallery of Art. Your task is to join the adventure through the forest, passing sweet little cottages, putting together increasingly complex jigsaw puzzles. To complete the quest, each puzzle must be completed, and only by reaching the end will the two friends come together.Key Features:Solve jigsaw puzzles of varying complexity\n40 images from the National Gallery of Art\nCute, cherry, and beautiful 3D graphics\nFun, casual gameplay for everyone!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":16139,"name":"Noitu Love 2: Devolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a37/a37b41162ea21be5c0dcb4a07f5457ca.jpg","description":"A century after the legendary boy Noitu Love saved the world from the evil Darns, they rise again, but in a chaos of time-bending mayhem! Now it's up to the new hero of the Peacekeepers, Xoda Rap, to save the world.\nFight the massive hordes of the Darns as Xoda Rap in this time-bending retro arcade adventure, a main category finalist at IGF 2008. Noitu Love 2 Devolution makes original use of mouse input to further streamline the flow of classic gameplay. Fight your way through seven different stages and unlock more, different ways to play them again. Every stage features new tactics and several boss battles. The game is made to appeal to old fans and also new players in the genre as it offers challenges for all levels.Key featuresUnique mouse controlled gameplay\nSuper fast action made possible through controls\nHuge and inventive bosses\nAll 7 levels are packed with unique challenges and situations\nInspired by classic arcade action games\n3 different difficulty settings\n3 unlockable modes that significantly change the game","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Joakim Sandberg","platforms":[{"id":0,"name":"PC"}]},{"id":15843,"name":"FORCED SHOWDOWN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21a/21a338613c0ad1dec5673e4cf9d31ec5.jpg","description":"\"Extremely fun game with constant action and virtually limitless replayability. Every new battle you start is different, there are endless possibilities of deck building with all 4 characters.\" - Jyren\n\"I love this game! I have played many hours of The Binding of Isaac, Terraria, Ziggarut, Rouge Legacy, Risk of Rain and other rouge-likes you probably havent heard of. I have to say this game is among my favorites and its brand new.\" - Mîchæl\nGET FREE DLC FOR ALL OUR GAMES\n\"I wish I knew how to eloquently express how excellent this game is. It just taps so many buttons for me with the nicely balanced rogue-like, the achievable-yet-challenging unlockables, the genuinely interesting deckbuilding, and satisfying combat.\" - John\n\"It plays like I always felt ARPGs and MOBAs should - skillshots, accuracy, timing and evasion; button mashing and brute-force will get you nowhere in this game.\" - Radical \"Venom\" Max\n\"FORCED SHOWDOWN combines everything I like in video games.\nThe combat is skill based and offers on the fly strategy solving skills. It has a great difficulty curve that makes me want to hone my skills to become better as time goes. The card system takes some beats from Hearthstone in how decks are created. Playing cards and combos at the start of each round offers a great way to shake up the rounds.\" - It's High Noon\n\"Gameplay: Amazing\nGraphics: Godlike\nVarity: Great\" - Carlolz\n\"There are tons of cards to collect that, besides all the different characters, companions, monsters, arenas, modifiers and whatnot, add to the enormous variety that makes every playthrough feel completely fresh.\" - Nachtfischer\nMay you die gloriously and to great applause!Greetings Human and welcome to FORCED SHOWDOWN: \"The only show in the galaxy with lives on the line!\" Pick one of the 4 contestants from across the FORCED universe - each a master of their own style of combat - and try to become a superstar of my show, as you battle through worlds of monstrous enemies and face off against epic arena bosses. You may die horribly and repeatedly, but think of your fans and smile for the cameras!Cards boost your action abilities!In my show, you will unlock cards that let you boost your stats and upgrade your abilities differently each battle. Use clever deckbuilding and show off your epic combos! In the end though, it's all up to your own action skills, on the arena floor, to carry you through both times of luck and misfortune.\nFeaturesIntense singleplayer action gameplay with deckbuilding to upgrade your stats and abilities in new ways each battle.\n4 characters with unique attacks and ability sets + unique cards to mutate and upgrade their abilities. (+1 with the Drone Invasion expansion)\n150+ cards to unlock and use in your deckbuilding. (all in-game; no microtransactions!)\n60+ quests unlock content and achievements.\nDinosaur and dragon companions to unlock and have fight by your side.\nFight in 8 different worlds.\nEncounter 70+ different enemies.\n10 bosses for raid-like finales.\nIn higher difficulties, each boss also plays cards against you in arenas.\nPuffs???\nFrom Roguelike-learner to Super Hardcore: The first game show makes sure new players get a chance to learn. Less than 3% of players are skilled enough to beat the endboss of the third show.\n40+ special rules make sure each battle is unique. Discover what they do and learn to handle the challenges.\nBonus levels (added in free content update 43)\nEmblem System: Unlock mastery emblems for each game show that let you play it with added special challenges. The best players in the world can manage 12 mastery points in the toughest game show. The maximum is 30. (added in free content update 42)\nDaily modes and monthly seasons to test your skills and strategies against the rest of the world, and win awesome prizes!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BetaDwarf","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15512,"name":"Alone in the Dark 1","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b16/b16dfd37d8ca39cb83a9824d59229f74.jpg","description":"A suspicious suicide. A chilling curse. A malevolent power. Finally, a wicked dark secret. This is Derceto, a legendary Louisiana mansion where, against your better judgment, you're drawn into a world of shadows to explore the darker side of Jeremy Hartwood's imagination.\nDespite a paralyzing sense of personal danger, your quest for truth drives you to investigate the old house. But, you didn't know that, by entering Derceto, you'll be plunged into the daily nightmare that was Jeremy Hartwood's life. You weren't prepared for the torturous howls that resound from deep within its halls. You didn’t foresee the shadowy corridors that seemingly have no end. You couldn't anticipate the brooding, gloom-filled rooms, the pervasive weight of dread, the heavy sense of evil that gills the atmosphere and the very house itself.\nHad you known, you might have refused this task. But alas, you accepted, and now you must make your way through this spine-tingling adventure alone... and in the dark.\n- The grand-daddy of survival horror genre\n- A memorable soundtrack, excellent voice acting, and a thrilling story will keep you hooked for hours\n- Inspired by H.P. Lovecraft's universe, where ancient evils of unimaginary power play with human lives\n- Includes Jack in the Dark bonus adventure","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Infogrames","platforms":[{"id":0,"name":"3DO"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":13545,"name":"Exanima","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c77/c777c26a675235dfba09fe657b971ab9.jpg","description":"Explore, fight, survive and unravel mysteries in this unique and unforgiving 3D isometric RPG set in an original dark, low fantasy world. Exanima's exceptional attention to detail and realistic simulation of all things aim to provide a deeply immersive and dynamic gameplay experience.\nFeatures include a deep skill based combat system, complex and smart AI, fully interactive environments, an advanced damage model with accurate collisions and locational protection, roguelike elements and an arena mode to hone your combat skills.\n\"Those who would enter the underworld shall not only forfeit their lives...\n...but bring oblivion to all mankind.\"\nWARNING: THIS GAME IS ACTUALLY DIFFERENT!This game features a very deep, truly physics based combat system. This is not just some animation feature, it is a fundamental difference that is central to gameplay. Real momentum, forces and collisions are always at play here, every nuance of your inputs is crucial to the outcome. This will likely be unlike anything you've played before and may take some practice, but can be hugely rewarding and the skill cap is virtually infinite. It is not particularly fast paced or difficult but it does require you to pay attention, it is very tactical and just casually pressing buttons won't get you very far!\nOur goal is to create a deep and immersive RPG world based on a more advanced simulation supporting an unprecedented level of dynamic and emergent gameplay. All of the technology we use including the game engine is our own, developed from the ground up to realise this vision.\nExanima is born as a prelude to Sui Generis (SG), our ambitious open world RPG that has been in development for over two years following a successful Kickstarter campaign. Exanima is a smaller yet complete game in its own right, a dungeon crawler that takes place in SG's Underworld some twenty years prior to its events. Both games are being developed in concert, many of SG's more ambitious features will make an appearance in Exanima as development continues.\nExanima provides a reasonably complete and meaningful game experience, but many more features are on their way! We have met our most challenging and significant development goals, now we are ready to bring new features to light and make an even more fun and compelling adventure. Here are some of the planned features, with many already being close to completion:\nPer session and global character skill progression\nLarge non-linear main game following early content\nBuild and permanently save characters by completing early content\nNew encounters, items and environments\nRanged combat and new close quarter manoeuvres\nNumerous moddable thaumaturgic powers\nMore complete arena game modes featuring outdoor arenas\nComplex NPC interactions and dialogue\nCooperative and competitive LAN multiplayer","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bare Mettle Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13473,"name":"Defunct","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc3/bc3056f584dc81d853ba7d718e18f18d.jpg","description":"Defunct is an indie adventure game with a focus on flow, speed and an engaging world. You are a broken robot that accidentally falls out of a giant cargo ship onto a post-human Earth, now inhabited by robots. You have to get back to your ship before it’s too late!\nYou are equipped with a Gravitize engine. It is used to create a separate gravity around yourself; this is the main source of your speed. Use this in downhills to accelerate. But be careful, using it uphill will slow you down. In addition to this the world is full of different speed boosts such as Enerjuice, which you can pick up and use to go faster.\nThese tools enable you to drive through the world, meet strange robots, fly through junkyards and boost your way back to your ship.\nFeatures\nHigh speed gameplay with unique ‘gravitation’ engine.\nTraverse 11 varied levels full of different climates, biomes and challenges.\nUnlock skins for the main character.\nSchool everyone with special (unlockable) tricks.\nCompete for the best completion times in time trial mode (which features 5 extra levels).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SOEDESCO Publishing","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":13006,"name":"Disturbed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/606/60652097989bf16f6c9e4c1e62512866.jpg","description":"Disturbed is an adventure/horror visual adventure, inspired by experiences of depression and addiction. All visuals are hand-drawn to express personality and a sense of horror.\nPlay as a farmer who struggles to manage a failing farm. You come to a point where there is no more hope, and you must do something. You figure that you will die and it is just a matter of how and where. What difference is there to make? What can a simple farmer do? Only you can answer these questions.\nDisturbed is powered by the Ren'py Engine, using default settings which help aid the game's atmosphere. Visuals are 800x600 resolution by default, something that may not happen again for future games.\nDisturbed includes various puzzles in which the player needs to obtain items and use them at specific places. There is no inventory system however, which makes this experience unique. Because of this, areas and objects react differently depending on whether the player has a specific item or not. This also happens for some of the conversations in the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Brad Moore","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4802,"name":"Dead Space: Extraction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/13b/13bc586540d4edc9087ce4c540657a9f.jpg","description":"Dead Space™ Extraction tells the untold story of the Aegis VII Colony through a handful of survivors battling to reach the orbiting USG Ishimura amidst a horrific infection. As their allies mysteriously fall victim to dementia, it becomes clear that protecting a young girl granting them a bizarre immunity may be their only hope for survival. In every shadow, behind every corner, terror hides—so you can't. Fight the alien scourge alone or with a friend to blast apart oncoming Necromorphs, solve mind-bending puzzles, and defy all odds to reach safety. Feel the terror like never before in the most cinematic horror experience on the PlayStation®3 Move motion controller.\n© 2011 Electronic Arts Inc. PlayStation®Move features require PlayStation®Move motion controller and PlayStation®Eye (sold separately).\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© 2011 Electronic Arts Inc. PlayStation®Move features require PlayStation®Move motion controller and PlayStation®Eye (sold separately).","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"}]},{"id":481889,"name":"The Riftbreaker: Prologue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04c/04c66209fc301932b9ba37e80dacbe6b.jpg","description":"WHAT IS INCLUDED IN THE PROLOGUE?\nThe Riftbreaker Prologue allows you to experience the events taking place before the story campaign of the main game. Explore an entirely new world. Gather resources. Build up a base. Defend yourself from thousands of alien creatures. Or just take the scenic route and do whatever you want - the choice is yours.\nSTORY\nYou play the role of captain Ashley S. Nowak - you are the Riftbreaker, an elite scientist/commando inside a powerful Mecha-Suit. Enter a one-way portal to Galatea 37, a distant planet at the far reaches of the Milky Way Galaxy, with the purpose of building up a base that will allow travel back to Earth and further colonization. Ashley's Mecha-suit, which she calls \"Mr. Riggs\", can withstand the harshest environmental conditions and has a full range of equipment for base construction, resource extraction, gathering specimens, and of course - combat. It is capable of traveling through rifts that connect space across vast distances.\nBASE BUILDING\n\nYour task is to construct a two-way rift back to Earth. It is a very complex invention and requires enormous amounts of energy. Simple solar collectors and a few tons of steel will not be enough. You will need to build up a complex chain of mines, refineries, powerplants, and research facilities to complete this mission.\nEXPLORATION\n\nGalatea 37 is an unknown planet in the Sycorax belt of the Milky Way galaxy. Long-distance surveys detected that it is inhabitable and perfect for colonization. The planet is full of rare minerals and substances that can be found in various locations around the globe. Varied biomes can surprise you with unknown fauna and flora as well as harsh weather conditions. Construct local outposts in resource-rich locations that will transport the required resources using rift technology.\nDEFENSE\n\nYour presence on this planet will not go unnoticed. As you build up your industry and disrupt the natural order, the world will start seeing you as a threat. Build up your defenses. Construct walls, barriers, and defense towers as the attacks get stronger with every passing day. You will face thousands of hostile creatures trying to eliminate your presence.\nHACK, SLASH, SHOOT\n\nMr. Riggs can be equipped with powerful weapons and abilities that will allow you to take on the largest of beasts. You will need to be ready to face lots of hostile alien creatures as you scout the planet.\nGATHER SAMPLES AND STRANGE ARTIFACTS\nFallen beasts will drop valuable research specimens as well as rare resources. Use everything that you can gather to research and craft new technologies, buildings, weapons, and equipment. You can also scout the terrain using your sensors and dig for treasure buried underground.\nRESEARCH\nUse the samples that you've gathered to research new technologies that will help you build up your base, improve your defenses, develop new blueprints for your Mecha-suit, or improve existing technologies.\nCRAFT\nMr. Riggs is fully customizable and upgradeable. Use the blueprints that you've researched to craft new parts and weapons. Utilizing better materials for the crafting process results in developing gear with improved properties. Each crafted item has unique properties.\nINTERACTIVE STREAMING\nThe Riftbreaker™ has built-in integration with the most popular streaming services out there. The stream's audience can actively participate in the game through multiple options, e.g. by voting to send waves of new enemies, spawn environmental disasters like a tornado, or by donating resources.\nTHE SCHMETTERLING ENGINE\nThis game is built using the latest iteration of EXOR Studio's in-house developed Schmetterling 2.0 engine which was previously used to create X-Morph: Defense and Zombie Driver. We pride ourselves in delivering fluid gameplay and utilizing all of your hardware's capabilities - uncapped frame rate, support for widescreen monitors, customizable controls, and more.\nCOMMUNITY DRIVEN DEVELOPMENT\nIf you've read everything and arrived all the way down here, then you might be interested in helping us shape the game. Please come and talk to us on the forums, our official Discord server, or through any other of our social media. We'll be sharing inside info about our development progress, and we'd love to hear your feedback. Please come and help us make Riftbreaker the game You want to play!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Exor Studios","platforms":[{"id":0,"name":"PC"}]},{"id":383623,"name":"Digimon Story Cyber Sleuth: Complete Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e59/e597f1f5c98805e1f2e76e2436257b48.jpg","description":"With engaging storylines, classic turn-based battles, and tons of Digimon to collect, Digimon Story Cyber Sleuth: Complete Edition delivers everything fans loved about Digimon Story: Cyber Sleuth and Digimon Story: Cyber Sleuth – Hacker’s Memory.\nGet the full experience with the Complete Edition which includes both titles in one!\nMYSTERIOUS EVENTS\n• Become a cyber detective or powerful hacker to solve diabolical digi-mysteries.\nVIVID & IMMERSIVE WORLDS\n• Embark on a thrilling adventure where the line between the real and digital worlds is blurred.\nENDLESSLY ADDICTING\n• Featuring more than 300 Digimon to collect, raise, and Digivolve!\nSOLID GAMEPLAY\n• Build an all-star Digimon team to take on opponents in classic turn-based battles.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"h.a.n.d.","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":53460,"name":"Phoenix Wright: Ace Attorney − Justice for All","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/862/86283a28784f6a24d35b5bbb3ab3b4a8.jpg","description":"Phoenix Wright: Ace Attorney − Justice for All is a visual novel adventure video game developed and published by Capcom. It was originally released for the Game Boy Advance in 2002 in Japan, and has since been released on multiple platforms. The Nintendo DS version, initially released in 2006 in Japan, was released in English in the West in 2007. The game is the second entry in the Ace Attorney series, following Phoenix Wright: Ace Attorney.\nThe story follows Phoenix Wright, a defense attorney who defends his clients in four episodes. Among other characters are his partner Maya Fey, her cousin Pearl, and the rival prosecutor Franziska von Karma. The game is divided into two types of sections: courtroom sessions, where the player cross-examines witnesses and tries to uncover contradictions in their testimonies; and investigations, where the player gathers evidence and talks to witnesses.\nThe game was directed and written by Shu Takumi, as the second entry in a planned Ace Attorney trilogy. It was originally intended to feature the first game's prosecutor, Miles Edgeworth, in all episodes; Franziska was created when the development team learned that Edgeworth had become popular among players, and Takumi wanted to use the character more carefully and sparingly. They only introduced one new gameplay mechanic in the game; Takumi wanted to keep the game focused on the core concept of finding lies, and to keep it simple enough for his mother to play. The game was positively received by critics, who generally liked the writing, but criticized the game's short length and the lack of the Nintendo DS-exclusive gameplay mechanics that appeared in the previous game.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Capcom Production Studio 4","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Android"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"}]},{"id":37212,"name":"Europa Universalis III","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc9/bc9cf8d960c31553b8c16df8ce886c05.jpg","description":"The game is part of an extensive series of games originating from the 2000 Europa Universalis game. The game, the ancestor of the series was distinguished by strategic depth and historical accuracy.\n\nThe action of the games of the series takes place in real time, however, this does not require a quick action from the player, because at any time you can enable a pause in the game.\n\nThe genre of global strategy involves the management of all components of the life of the whole state or empire. In the Europa Universalis series, this canonical requirement is implemented as fully as possible. Due to this saturation of the game, many players ignore the actual gain or scoring in the game and play the game of the game itself.\n\n###Advantages or disadvantages\nAll of these features are inherent in almost all games of the series, and for a long time were considered the undoubted advantages of this series of games. However, over time, it was found that these advantages sometimes turn out to be disadvantages.\n\nFor example, historical authenticity, compliance with historical events that actually took place sometimes led to the fact that a player who knows history can derive “undeserved” advantages from this knowledge.\nFor example, knowing about the coming period of unrest and resilience in any state, you can make corresponding moves in the game - although the game as such is largely based on the ability to act strategically, without “prompts”.\n\n###Europa Universalis III - a step from the canon\nEuropa Universalis III contains a certain number of “digressions” from the canon series, designed to compensate for the shortcomings described above. For example, in Europa Universalis III, the game can be started not at a strictly specific, but on any day of a historical period. In the game there are not only historical figures, but also random, fictitious characters. In addition to real events in the game, unpredictable events also occur.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Paradox Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":23570,"name":"Confess My Love","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b04/b044f01273b22301b031fe07d46db5a2.jpg","description":"The story took place after school when Willie decided to confess his love to his favorite girl, Liza. He was afraid of being refused so he hesitated for quite a while.\nShould he summon up all his courage to confess his love to her?\nWhy Julie is still here？\nDon't forget to put away his diary from others, it ought to be never read by anyone.\nNow the only problem is, Willie felt something weird in this classroom, which he should feel so familiar with.\n——————————————————————————\n【Character introduction】\nWillie: The hero who just can't make up his mind to confess his love to Liza.\nLiza: The girl Willie liked, always finishes her assignments at school before her part-time job at night.\nJulie: She insisted to stay in the classroom for some untold reasons.\n——————————————————————————\nThis is a mini game with 20 endings.\nEach of them is short and no longer than five minutes.\nThe story will has subtle changes once you obtained a new ending each time.\nThis game is quite boring, the main content is to explore and dialogue. Maybe it will take three hours. If you can not find what to do next, please tend to the tips page.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"LR Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18496,"name":"Dragomon Hunter","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/457/45734394c9291e8313867e2ee148e7a3.jpg","description":"Prepare for the hunt! Dragomon Hunter is a thrilling, vibrant anime-style MMORPG for adventure seekers everywhere! Gather your friends and travel across a huge world to track down and defeat over 100 exclusive Dragomon. Master hunters will be rewarded with glory and power: conquer Dragomon and add them to your stable of mounts, or harvest materials from them to upgrade your gear.\nA true hunter utilizes strategy as well as strength. Observe your prey, determine their weaknesses, and use the most effective weapons and traps to bring them down. Play as one of four classes and customize your abilities for the greatest chance of success. Join a party of fellow hunters to vanquish the most dangerous Dragomon!FEATURES: Hunt over 100 species of Dragomon\nRide defeated Dragomon as mounts\nUpgrade your gear with materials gathered from defeated prey\nChoose from four playable classes: Scout, Mercenary, Mage, and Cleric\nTeam up with friends to tackle the strongest enemies in Co-Op mode\nPlay with the original Japanese voice-over featuring actors from world-famous anime series\nPlay with a controller as an alternative to keyboard and mouse controls\nEnjoy a beautiful world brought to life with a vivid anime art style","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"X-Legend","platforms":[{"id":0,"name":"PC"}]},{"id":18273,"name":"Pickers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/394/39451aeca248d17dc5c3733b8763e5aa.jpg","description":"Get ready for the ultimate treasure hunt!  Your shop, Rusted Gold, has shelves to fill, auctions to run, and money to make—and you can only do that with the best finds.\nCheck out the dozens of locations from run-down farms to back road antique shops to abandoned storage units to see if you can stumble upon your next great treasure.  What do you do once you’ve found something?  Shine it up or sell it as is to see if you can turn a profit, or if you hit bust.  Haggle with crazy characters as you try to build your reputation for having the best picks around and learn more about what makes each person tick.  Consult with an expert to avoid being hoodwinked!  Combine items to increase their values and learn how to increase your odds along the way.\nPrice your picks to sell them in your shop, or take your chances on the auction block to see if you can make an even bigger profit!\nKey Features:\n\nFill the shelves of Rusted Gold to try to turn a profit\nCheck out 12 cool locations and the nooks and crannies of each one to find your next great pick!\nMeet America’s quirkiest characters and try to haggle them down\nBuild up your reputation for being the best Picker around\nCombine items you find to turn an even bigger profit!\nDon’t be fooled—consult an expert to appraise your items\nUnique combination of Adventure (Midnight Mysteries), Resource Management (Build-a-lot), and Hidden Object (Samantha Swift) game play\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MumboJumbo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17872,"name":"Fight The Dragon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd5/fd54738b25949a3b6af6133f1049be59.jpg","description":"Build, Explore, Battle & Loot in this GAUNTLET inspired USER CREATED hack’n slashCreate & share Adventures like a true Dungeon Master of old!\nFight The Dragon is a COMMUNITY CREATED Hack'n Slash RPG where players can team up and tackle exciting adventures made by other community members in our in-game Adventure Construction Kit (ACK).It's DIABLO meets LITTLE BIG PLANET\nFollow us on twitter - http://twitter.com/3sprockets\nOur Latest Dev Let's Play 9  Video... 18th December 2014\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=357821583\nSee all of our Dev Let's Play videos here...\nhttp://steamcommunity.com/app/250560/discussions/0/540743757658485898/\nPlayers can play single player, local split-screen couch co-op (2 players) or online multiplayer (4 players) to complete 10-15 minute adventures in a non-linear order, which allows players to jump in for a quick fix or play multiple adventures over longer play sessions. Collect loot, level up, conquer enemies and become a master adventurer! Become the ultimate Dungeon Master you always dreamed of being!\nFight The Dragon ships with a highly flexible in-game Adventure Construction Kit (ACK) that allows players to design, play and share their own adventures with other players on all platforms around the world.\nThe ACK (as is the gameplay) is designed to be as intuitive to use via a gamepad as it is via mouse and keyboard. Creators are able to sculpt and paint environments, place props, enemies, NPCs, Traps, checkpoints and other key game elements including hooking up basic logic systems for switches/gates and traps.\nThe Fight The Dragon community have already published over 1600 fantastic adventures, which means we have hundreds of hours of gameplay already created.\nACK FEATURES\nGreat assortment of Melee, Ranged and Mini-Boss Enemies\nLarge selection of textures to paint environments with\nStatic & Dynamic props including realtime lights, traps, bridges & more\nSuper intuitive editor allowing rapid design\nIn editor play testing at any time Dragon Battle Arena\nAs heroes complete adventures and reach milestones, they earn tickets that allow them to go “Fight The Dragon” in the ultimate dragon battle arena.\nEvery player has their own dragon to fight, and each dragon has MEGA HP, so killing your dragon will require many encounters and a lot of skill. The damage you do to your dragon is persistent between play sessions, so collect as many tickets as you can and go battle it out! Each ticket grants the player 3 lives, but be warned, there are more ways to die in the dragon arena than just the dragon, so stay alert! Key Game FeaturesIn-Game Adventure Construction Kit – Create and share Adventures!\nOver 300 hours of unique gameplay created by our community so far!\nAction packed Hack-and-Slash Adventuring in your own creations\nFemale and Male versions of all of our classes\nLocal Drop-In Split-Screen Couch Co-Op\nUp to 4 player online Co-Op (cross platform)\nLAN server for local 4 player Co-Op\nIntense Dragon Fights with special dragon loot\nFull gamepad & Big Picture support","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"3 Sprockets","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16418,"name":"Haegemonia: The Solon Heritage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae2/ae24f1eac85aa3d5f22dea9f0c58ada9.jpg","description":"As a stand-alone expansion pack to Legions of Iron, discover new innovations and even more stunning visuals that launch the Haegemonia experience into light speed.  The Solon Heritage is a multiplayer-only package with over 70 new inventions, all new skills and heroes, new spaceships and strategy options with an all-improved AI. Colonize, conquer, conduct research, trade, spy and battle it out … but be diplomatic or extinction of your race is inevitable.\n15 new maps in solo and multiplayer modes\n10 new ships including diplomatic ships, race-specific ships and probes\nSimultaneous Invention Research\nNew Spy Missions\nNew special FX created by the unique Walker engine\nNew Hero and Mercenary Units specifically created to diversify the tactical actions\nRebalanced gameplay for Inventions and Ships","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Digital Reality","platforms":[{"id":0,"name":"PC"}]},{"id":758571,"name":"The Planet Crafter","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dee/deecd9b5f79eda1df92b333bcdfc16d6.jpg","description":"From Hostile to Habitable\nYou are sent on an hostile planet with one mission: Make it habitable for Humans. You'll have to survive, collect resources, build your base and machines in order to heat the planet, create an atmosphere with enough oxygen and eventually geo-engineer an entire planet!\nSurvive, Collect, CraftGather minerals and resources to survive. Craft all the tools you'll need in order to fulfill your mission. Explore old crashed ships and ruins and discover a planet full of mystery. Build you own base You'll need a base and all sorts of machines to make yourself at home, and be able to bring life on this planet!\nKey Features: Character Thirst, Oxygen, Temperature, Health Mechanics  Base Building  Crafting  Mining ores  Build machines to create atmospheric pressure  Build machines to heat the planet  Create a biosphere with oxygen  Create life on a planet !","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Miju Games","platforms":[{"id":0,"name":"PC"}]},{"id":313802,"name":"Unsighted","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25d/25d487c4f86a18b1bfca322148957634.jpg","description":"The few androids that remains in Arcadia, a once populous metropolis, are running out of Anima, the energy that gives all robots consciousness.\nExplore this forgotten city and save the remaining androids from turning into Unsighteds.\n- Large, interconnected world, filled with shortcuts and secrets.\n- Time is always ticking, don't let your (or other's) Anima run out.\n- Solve puzzles and gather abilities to get past obstacles.\n- Many different weapons, from melee to ranged ones, to suit your play style.\n- Highly replayable and non-linear, try to find the faster route to your objectives.\n- Cooperative gameplay available","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Studio Pixel Punk","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":18829,"name":"Gumboy - Crazy Adventures","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cd/2cdb19bb5a71c68c79e4cbe87bc69b26.jpg","description":"Gumboy has fun and novel gameplay set in a richly imagined world.   With simple game controls, Gumboy lets the player bounce, roll, float, and fly through the world.  Additionally, Gumboy can change size, shape and material.  Moving through the world with different physical properties and gameplay:  spheres, cubes or stars filled with rubber, air or water...  Combine these elements with objectives centered on particle effects and control and Gumboy is refreshing, challenging, and original fun for everyone for all types of gamers.\nInnovative game based on ball physics in various environments\nOver 50 levels within a fairy-tale atmosphere\nInteractive environments: water, wind, rain, teleports, boosts, sticky and slippery surfaces\nOriginal artistic depiction of 6 various worlds (forest, field, cave, magical world...)\nFantastic lighting and dynamic effects\nDetailed graphics with acceleration and fascinating particle effects\nVarious ball shapes: sphere, cube, star\nVarious ball fillings with an influence on its characteristics: rubber, air, water\nSaves games in progress and the results achieved for several players\nGame supports widescreen displays (16:9)","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"CINEMAX","platforms":[{"id":0,"name":"PC"}]},{"id":17489,"name":"Higurashi When They Cry Hou - Ch.4 Himatsubushi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddd/dddab1505364b1dda4127bd8154bb671.jpg","description":"The 58th year of Shouwa, early summer.\nIt’s June, and the summer heat has arrived earlier than it does most years.\nBy day there are crickets, and by night there are cicadas.\nWe’re in Hinamizawa, a small village in the countryside.\nThere are fewer than two thousand people here. But every year, there is an event.\nThis event is a mysterious death.\nOn a certain day in June, someone dies, and someone else goes missing.\nThe series of deaths is connected to the upheaval surrounding the dam construction project.\nA murder case that was covered up is being reenacted.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there isn’t.\nSomeone who wasn’t supposed to be there is.\nSomeone who was alive last night is dead now.\nAnd someone who is here right now isn’t alive.\nSo, there is no way to avert tragedy. There is no choice but to give up.\nBut don’t give up.\nOnly you can stand up to this.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"07th Expansion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10541,"name":"Lost Lands: A Hidden Object Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f7/7f7d7ee647b5e43dc0166127a0e4f2a4.jpg","description":"With their kingdom in ruins the elves were forced to set off overseas to search for a new home. By fate's will, a storm crushed their ships on the shores of a lost island. High mountains, fragrant valleys and shimmering rivers - what else might the children of nature need? But their beautiful new world is filled with danger. When attempting to leave, the elves learn that the island is surrounded by an impenetrable magic storm. The survivors recall a legend about the last of the ancient elves, who shall awake from a thousand year's sleep to help them overcome hardship.\n• Help the elf people survive on a lost island!\n• Complete quests and puzzles to advance an exciting story!\n• Examine locations and learn more about the Lost Lands!\n• Defeat dangerous opponents!\n• Wield your mind as a weapon!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"FIVE-BN GAMES","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9848,"name":"Medieval Engineers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b62/b628098a688e9242f51ba55211982804.jpg","description":"Deluxe EditionSupport the developers by getting bonus digital content. The Deluxe edition includes the standard Medieval Engineers Early Access game plus the game’s Digital Soundtrack and a special bonus banner layer!\nAbout the GameMedieval Engineers is a sandbox game about engineering, construction and the maintenance of architectural works and mechanical equipment using medieval technology. Players build cities, castles and fortifications; construct mechanical devices and engines; perform landscaping and underground mining. There is an entire planet to explore!\nThe game is inspired by real medieval technology and the way people built architectural works and mechanical equipment using medieval technology. Medieval Engineers strives to follow the laws of physics and history and doesn't use any technologies that were not available in the 5th to 15th centuries.\nMedieval Engineers concentrates on construction aspects, but can be played as an action game too. We expect players to avoid engaging in direct man-to-man combat and instead use their creativity and engineering skills to build war machines and fortifications. Medieval Engineers shouldn’t be about troops; it should be about the machinery you build.\nMedieval Engineers is the second “engineering” game developed by Keen Software House. The first one is Space Engineers, which sold over 2 million copies in its first year and is still a bestseller.Early Access FeaturesBUILDING WITH STRUCTURAL INTEGRITY AND DESTRUCTION\nMedieval Engineers is all about building and the options are unlimited. Build anything from houses and castles to wagons and catapults.\nFULLY INTERACTABLE WORLD\nChange, pick up and interact with everything includes plants, bushes, trees, animals, and the ground itself. Everything is interactable and destructible!\nVOXEL TERRAFORMING\nMake the ground into any shape you want. Use a pickaxe to dig and mine in the ground or use the special voxel tools to reshape the land.\nLIMITLESS EXPLORATION\nPlay in a volumetric open world environment and explore a whole planet. Find valuable defensible areas or go to battle alongside your allies to take enemy lands and secure resources. The planet is full life including trees, plants, animals, and savage barbarian warriors.\nINTEGRITY AND DESTRUCTION\nBuild with structural integrity. Make buildings too tall and they will collapse! Design your structures carefully keeping in mind the differences between wood and stone. Use Structural Integrity View to find weak points in real-time. When the supports fail buildings come crashing down in glorious real-time destruction!\nMore to be added later\nPlease be sure to read the list of current features before you buy the game. It will give you an insight on what is or isn't actually working: http://www.medievalengineers.com/featuresPerformance NotesMedieval Engineers is in development and undergoing frequent optimizations. The performance will get better.  The performance depends on the complexity of your world and the configuration of your computer. Simple worlds run smoothly even on low-end computers, but a more complex world with rich object interactions could overload even high-end computers.\nMinimum requirements represent the bare minimum to run simple scenes and don’t guarantee a perfect experience.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Keen Software House","platforms":[{"id":0,"name":"PC"}]}]