[{"id":18849,"name":"Hector: Episode 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Hector Episode 2, subtitled Senseless Acts of Justice, is the second chapter of a three-part episodic adventure game. It was released as a standalone title, and directly follows the events of its predecessor, Episode 1 - We Negotiate With Terrorists. You take on the role of Detective Hector - a constantly drunk police officer that investigates the case other cops can’t solve. The game features tough humor and adult language.\n\nThe game starts as Hector survives the sniper’s shot and the explosion of the building. Together with his assistant Lambert Hector starts the investigation that must lead him to the crime’s mastermind. You need to collect the evidence and punish the organization responsible for the explosion.\n\nAs a classic point-and-click graphic adventure, Hector is heavily focused on dialogues with NPCs and puzzle solving. However, in this game talk is more significant than your ability to match things together collecting the clues. Some issues can be solved if you convince your opponent to perform a certain action by choosing the right lines in dialogues.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Straandlooper","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10581,"name":"Secret World Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7af/7afb1ab50d1d6ef55ece4ab804f505ea.jpg","description":"Secret World Legends is a reboot of the 2012 MMO game The Secret World. Unlike the original game, the reboot is free-to-play.\n\n###Setting\nThe game is set in a low fantasy world that was inspired by the works of horror authors like Stephen King and Howard Lovecraft, as well as Indiana Jones movie series. The setting combines the background of our real world with elements of mythology, urban legends and conspiracy theories that became true. The locations in the game include real-world cities as well as fictional places. They are mostly set in the big urban areas, depicted as dark, gloomy places fit for gothic stories.\n\n###Plot\nThe players' characters receive magical powers and learn that the End of Days is at hand. They have to participate in a war against evil and fight demons, vampires, and other monsters, as well as dark cultists who worship evil gods. They are forced to join one of the three main factions in the game: the Illuminati, the Templars, or the Dragon. They will have to travel to many places, such as Transylvania and Egypt, and even back in time.\n\n###Gameplay\nThe player can choose the first person or third person view. There are no character classes, and the player can freely change the character's abilities during the game. The player can also obtain a new weapon, but it costs either a microtransaction or an amount of in-game money.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Funcom","platforms":[{"id":0,"name":"PC"}]},{"id":454544,"name":"Metal: Hellsinger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/34e/34eb79862b32835924d999d575e08202.jpg","description":"Part human, part demon, and obsessed with vengeance. Become The Unknown, and fight through the fiercest domains of Hell. Destroy the demon hordes and their leaders to set yourself up for an epic showdown with The Red Judge herself.\n\nEvery legend has a song. And yours is one of metal, vengeance, and destruction.\n\n\nMetal: Hellsinger is a rhythm FPS, where your ability to shoot on the beat will enhance your gameplay experience. The more in sync you are with the rhythm, the more intense the music will become and the more destruction you will cause.\n\n\nDefeat the demon hordes with a skull-clad blade or a wide range of murderous guns. Each weapon has its own ultimate ability, such as Murder of Crows or The Big Goodbye.\n\n\n\n\nPlay through an epic storyline, narrated by award-winning actor Troy Baker. Then conquer the leaderboards or challenge your friends to beat your score in Challenge Mode.\n\n\nAlthough commonly known as Hell, The Infernal Planes is in reality a union of a thousand Hells, all of which are terrifying and diabolical in their own way. In order to dethrone The Red Judge, you must fight your way through the fiercest corners, from the icy world of Voke to the maddening world of Stygia.\n\n\n\n\nMetal: Hellsinger is created by an experienced FPS team at The Outsiders and is the passion project of David Goldfarb, Game Director on Payday 2 and Lead Designer on Battlefield 3 and Battlefield: Bad Company 2.\n\n\nEvery track is created specifically for the game with vocals by metal icons, such as Matt Heafy (Trivium), Mikael Stanne (Dark Tranquillity), Björn Strid (Soilwork), and Alissa White-Gluz (Arch Enemy).","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"The Outsiders","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":20000,"name":"PAC-MAN Championship Edition DX+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c9/7c9cc67546859e02d2d9cd815407b468.jpeg","description":"PAC-MAN Championship Edition DX is an arcade game; a part of the Namco Bandai’s long-running PAC-MAN series and a follow-up to the 2007 title PAC-MAN Championship Edition. \n\n###Gameplay \nThe core gameplay is similar to most other PAC-MAN games. The player controls Pac-Man through the maze where he must eat dots and avoid hostile ghosts. Besides dots, the player can collect bonus items that give additional points, and power pellets that allow Pac-Man to eat ghosts. Eating several ghosts in a row triggers a combo that gives the player a huge amount of extra points. \nThough the base gameplay is similar to that of the original arcade game, there are numerous new mechanics and gameplay differences in Championship Edition DX. The mazes consist of two halves. Eating all the dots on one of them makes a bonus item appear on the other half and eating an item makes a new dots layout appear on the other side. If a ghost is about to catch Pac-Man, a slow-motion effect kicks in giving the player an opportunity to avoid it. \nThere are three main game modes in the game: Score Attack, Time Attack, and Ghost Combo. The game features nine different courses and several visual style options. \n\n###DX+ version \nIn 2013, the game was renamed as PAC-MAN Championship Edition DX+ and received a free update. It featured an upgrade to the online component of the game and new paid downloadable content such as new skins and courses.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"}]},{"id":9981,"name":"Total War: WARHAMMER II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a20/a20d2e07179b4a71dd5276a5c4cc0f61.jpg","description":"Millennia ago, besieged by a Chaos invasion, a conclave of High Elf mages forged a vast, arcane vortex. Its purpose was to draw the Winds of Magic from the world as a sinkhole drains an ocean, and blast the Daemonic hordes back to the Realm of Chaos. Now the Great Vortex falters, and the world again stands at the brink of ruin.\nPowerful forces move to heal the maelstrom and avert catastrophe. Yet others seek to harness its terrible energies for their own bitter purpose. The race is on, and the very fate of the world will lie in the hands of the victor.\nPrince Tyrion, Defender of Ulthuan, guides the High Elves in their desperate efforts to stabilise the vortex as it roils above their home continent.\nAtop his palanquin-throne, the Slann Mage-Priest Mazdamundi directs his Lizardmen war-hosts as they surge northward from Lustria. He, too, is intent on preventing cataclysm, though the methods of The Old Ones must prevail.\nThe Witch King Malekith and his sadistic Dark Elf hordes spew forth from Naggaroth and their labyrinthine Black Arks. He tastes great weakness in the vortex – and great opportunity in its demise.\nMeanwhile a fourth, secretive race stirs, their motives obscured by sinister plots and machinations. The time for revelation is nigh…\nFour races, four outcomes, a single goal: control of the Great Vortex, for good or ill.\nAbout Total War™: WARHAMMER® II:\nThe second in a trilogy and sequel to the award-winning Total War: WARHAMMER, Total War: WARHAMMER II brings players a breathtaking new narrative campaign, set across the vast continents of Lustria, Ulthuan, Naggaroth and the Southlands. The Great Vortex Campaign builds pace to culminate in a definitive and climactic endgame, an experience unlike any other Total War title to date.\nPlaying as one of 8 Legendary Lords across 4 iconic races from the world of Warhammer Fantasy Battles, players must succeed in performing a series of powerful arcane rituals in order to stabilise or disrupt The Great Vortex, while foiling the progress of the other races. Each Legendary Lord has a unique geographical starting position, and each race offers a distinctive new playstyle with unique campaign mechanics, narrative, methods of war, armies, monsters, Lores of Magic, legendary characters, and staggering new battlefield bombardment abilities.\nShortly after launch, owners of both the original game and Total War™ WARHAMMER II will gain access to the colossal new combined campaign. Merging the landmasses of The Old World plus Naggaroth, Lustria, Ulthuan and the Southlands into a single epic map, players may embark on monumental campaigns as any owned Race from both titles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Creative Assembly","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":46284,"name":"HIVESWAP: Act 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b68/b683ea15a87b7a4c98e914bb0e84aeb3.jpg","description":"Monsters in the yard. Monsters in the house. Monsters in the hall, beating on your door. Your brother's trapped in his treehouse, so he’s not gonna be much help. You're going to have to get yourself out of this. But where did they come from? How are you supposed to deal with this? Well, certainly not by cowering in your room. That's for, uh, cowards.\nFirst things first. You need to open the door.\nA LOVE LETTER TO '90s ADVENTURE GAMES\n...without the accompanying frustration. As fun and well-paced as you generously remember them being. No dream-logic solutions, no hearing the same “those items don’t work together” message over and over. HIVESWAP has unique responses for everything you can try. Spend hours trying everything on everything, if you want to -- but not because you have to. Learn about the characters by exploring their homes! But like, in a good way! No audio logs split up and scattered around -- GUARANTEED.\nHAND-ANIMATED IN TWO DIMENSIONS\nStrange homes to explore, every room brimming with secrets. The world of HIVESWAP is beautiful and alive, from its hyper-detailed environments to its gorgeous fully-rendered animations. Come take a look!\nMUSIC TO MAKE YOU WEEP\nAn eclectic, ambitious, genre-spanning soundtrack, featuring contributions from Undertale’s Toby Fox and, regrettably, at least one third-wave ska song. Also featuring at least one pseudo-revolutionary garage rock duo, with regrets of their own.\nWORLDS TO SEE, TEENS TO BE\nPlay as JOEY CLAIRE, EXTRAORDINAIRE, a teen trapped in her room *and* in 1994. Play as JUDE HARLEY, BIZARRELY, her kid brother, trapped in his treehouse. Play as XEFROS TRITOH, ALIEN REBEL, wait. Aliens?\nJUST GETTING STARTED\nHIVESWAP: Act 1 is the first of a four-part series set in Andrew Hussie’s Homestuck universe, with a companion series, Hauntswitch, to follow. Continue your save from chapter to chapter, then from game to game, to carry your story, choices, friendships and frenemies across them all--then do it again! Once released, HIVESWAP and Hauntswitch will be playable in either order. Haven’t read Homestuck? That’s fine! This game is set in 1994! Homestuck hasn’t even been invented yet!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"What Pumpkin Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17978,"name":"Vertiginous Golf","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/042/04230bf070ecd8085e6f3829335da291.jpg","description":"Vertiginous Golf is a mini golf adventure game developed by Kinelco & Lone Elk Creative.\n\n###Setting\nThe game is set in a dystopian steampunk world where a massive lottery once took place. Half of the society was lucky enough to relocate to a floating city of New Lun-Donne, forgetting about the people left below them, living in smog and pollution. The commoners can temporarily escape the harsh reality by using a Verti-Sphere which serves as an analog of virtual reality. Yet something seems to be a bit off. A mysterious voice tries to break the illusion of peace and create resistance.\n\n###Gameplay\nThe game features 54 mini golf courses set in a dark city of the society's best. After every course, the players complete, a bit of a story is revealed.\n\nThe players will encounter courses with hazardous environments or contraptions on them. You will have to carefully estimate where will the golf ball land, but don't be afraid to fail as the game features a time rewind function. However, be careful using it, as it's amount is limited.\n\nThe game also features two competitive multiplayer modes which can be played either online or locally. Choose from racing with other players to the finish or fight over the holes in the unique arenas.\n\nAn advanced level editor is also bundled with the game. The players are free to share their creations with the community.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kinelco & Lone Elk Creative","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17620,"name":"Heroes of Might & Magic III - HD Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/921/9214ad73a4387f0b94474fdcd439468c.jpeg","description":"Heroes of Might and Magic III is a part of Might & Magic franchise and the third installment in its series. It is one of the most popular turn-based strategies ever created.\n\n###Plot\nThe game takes place in the fantasy world of Enroth. The story mode follows a large-scale war for the country of Erathia. Its queen Catherine defends her homeland from invading dark forces. The game's seven campaigns allow the player to participate in this war on various sides.\n\n###Gameplay\nAI and human players take turns, each turn representing an in-game day. Each player controls cities, heroes, and units. The default victory condition is to eliminate rival players by capturing their cities. The story mode, though, has missions with specific plot-related conditions.\n\nThere are eight types of cities. Each type has a set of units and a unique style, based on a fantasy culture such as elves, orcs, demons or the undead. Any player can conquer and control any city. A player who loses all his or her cities is eliminated.\n\nA hero leads an army of units. Heroes explore the map, capture resources, fight enemies and neutral monsters. As they gain experience, heroes level up and obtain new skills and spells. Each hero has eight unit slots. Units of the same type stack and act as a single, stronger unit. During combat, units take turns on a hexagonal grid. \n\n###HD Edition\nA new edition, released in 2015, includes slightly improved graphics redesigned for modern monitors and tablets. Otherwise, the game is identical to its original version.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":13768,"name":"Go! Go! Nippon! ~My First Trip to Japan~","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/efa/efa8003f31a514d34fb0d0f0e39b5e7d.jpg","description":"The week you spend in Japan will certainly be memorable!!!\nGet a taste of the foreign travel offered by printed guidebooks.\nEnjoy a tour around Japan from the comfort of your own home!\nAs the game's protagonist, you'll travel to famous Japanese sightseeing spots in the company of a pair of beautiful young sisters.  The girls will describe the spots, take you out to dinner, and grow closer to you throughout your travels.\nThe thrill of taking a trip through Japan with pretty girls is the experience offered by this \"Guide Game\" -- a guidebook in game format!\nBeautiful Tour Guides!!\nFamous Japanese Sightseeing Spots!!\nDelicious Japanese Dishes!!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"OVERDRIVE","platforms":[{"id":0,"name":"PC"}]},{"id":19412,"name":"Gish","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/104/104413cef7cf98852df62616becacca6.jpg","description":"In Gish, the player can assume the role of a piece of tar. The game is similar to physics-based platformers like LocoRoco.\n\n###Plot\nThe backstory of Gish is a parody of the video game cliches. Gish is a jelly yet sentient black creature who lives underground. Gish's love interest Brea, a human female, was kidnapped by his jealous ex-classmate. Gish goes on a quest to rescue Brea. Defeating the final boss does not automatically save Brea. The player can fail, and the game will end nonetheless, leading to a darker ending.\n\n###Gameplay\nThe player controls Gish and navigates him through the levels. Gish has no legs or other organs besides a mouth and two eyes, but he has several useful abilities. He can change his shape and physical state to suit the player's needs. Gish can become amorphous to slip down the slopes and squeeze through the thinnest gaps and holes. He can stick to the walls, ceilings, and other surfaces to climb and hold on. Gish can also become a solid ball which allows him to push other objects from his way, break the obstacles and crush opponents with his weight. Puzzle-like level design often requires Gish to use a complex combination of his powers.\n\n###Style\nThe game is made in a simple and cartoonish visual style and has occasional glimpses of black humor. It is mostly set underground, in the dark tunnels and caverns. Gish is accompanied by a rock soundtrack that suits the game's quirky and creepy atmosphere.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Cryptic Sea","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":270653,"name":"Hell Let Loose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80c/80c6e3792daeddef2bdfb68c06ad2892.jpg","description":"You've never played World War 2 the way it was meant to be played... with lumbering tanks dominating the battlefield, crucial supply chains fuelling the frontlines, being a cog in the machine of colossal combined arms warfare. Hell Let Loose puts you in the chaos of war, complete with deep player-controlled vehicles, a dynamically evolving front line, and crucial unit-focused gameplay that commands the tide of battle.\nFeaturing sweeping maps modelled on real reconnaissance images and satellite data, the entire battlefield is divided up into large capture sectors - allowing for emergent and constantly unique gameplay that pits two forces of fifty players in a fight to the death across fields, bridges, forests and towns on an ever-evolving front line. When a sector is captured, it will generate one of three resources for your team, creating a complex meta-game that will influence your team’s march to victory.\nAn Epic Theatre of War\nTake to the battlefield in 50 vs 50 multiplayer across huge maps. Choose one of 14 playable roles within infantry, recon and armour unit types, each equipped with different weapons, vehicles and equipment. Play as an Officer, Scout, Machine Gunner, Medic, Engineer, Tank Commander and more to experience every aspect of World War II combat.\nUnprecedented Realism\nPlacing you on real-scale iconic battlefields of World War II is at the heart of the Hell Let Loose experience. Historical vehicles, weapons, uniforms are intricately detailed, and the combat is as brutal and bloody as it was on the day. Combat takes place on huge, to-scale maps from real battle locations, recreated using archival aerial photography and satellite imagery in stunning detail using Unreal Engine 4.\nFight Together - Win Together\nHell Let Loose is not about kill to death ratios and unlocks - teamwork is central to gameplay. Communication is essential. Players work together beneath the leadership of officers and their commander to take strategic targets on the battlefield and dominate the opposition. Hell Let Loose is a game that demands teamwork and communication not only to win, but to survive.\nUnique Meta game\nFight for victory by breaking through the enemy lines on a large, evolving battlefield. The unique sector capture metagame require teams to make continual large scale tactical decisions as to where to attack or defend. Manage resources and supplies to call in support, re-inforce strong-points or flank enemies. Strategy is key to success.\nKey Features:\n•\tFight in epic 50 vs 50 multiplayer battles\n•\tSelect one of 14 unique roles\n•\tTake control of the full spectrum of vehicles - from the fearsome Panther tank to the humble Jeep\n•\tBombard and wipe the enemy from the field by taking control of heavy weapons - such as anti-tank guns and artillery\n•\tBuild defenses on the battlefield to fortify your position\n•\tUse teamwork to smash through the enemy front line and push through to victory\n•\tPlay the game as the Commander and lead your team to victory using different abilities as you orchestrate your forces via the tactical map","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Black Matter","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":22991,"name":"Akalabeth: World of Doom","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/510/510ad66178757fcafc467d6d01c3b425.jpeg","description":"'Tis said that long ago peace and tranquility covered the lands. Food and drink flowed freely, man and beast lived in peace, gold and silver abounded – it was the Golden Age of Akalabeth.\nMondain, second born of Wolfgang, a great king of old, wished to gain his brother's inheritance and so he used his great powers for evil, creating deep dungeons guarded by daemons and Balrogs. Now blood flowed freely in Akalabeth, and foul creatures soon came to roam near the surface. Mondain cast such sickness and pestilence upon Akalabeth, that both man and beast lived in constant fear. Thus was the Dark Age of Akalabeth.\nThere arose from the land a man, pure and just, to battle the Dark Lord. British, Champion of the White Light, did battle with Mondain deep within the labyrinth of dungeons, eventually driving him from Akalabeth forever. British of the White Light was proclaimed Lord British, Protector of Akalabeth. Alas, much damage had been suffered unto the lands. The Revival of Akalabest has begun.\n'Tis thy duty to rid Akalabeth of the foul creatures which infest it, whilst trying to stay alive!Developed in 1979, Akalabeth is the first game made by the legendary creator of the Ultima Series, Richard Garriot.\nDesigned by the teenage Garriot in Applesoft BASIC for the Apple II, Akalabeth is one of the earliest known examples of a computer role-playing game, and is considered by many to be \"Ultima 0.\"\nFeaturing 10 different monsters, procedurally generated dungeon crawling, and wire frame 3D graphics, Akalabeth was highly advanced for its time and is still widely regarded as one of the most historically significant RPGs ever created.","review":"","timePlayed":0.0,"releaseYear":1979,"developer":"Quantum Toast","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Apple II"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":29231,"name":"Tropico 6","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d5/5d5da5167163cc75f77b4c6b15ae865b.jpg","description":"El Presidente is back!Features: Play on large archipelagos for the first time in the series. Manage multiple islands at the same time and adapt to various new challenges.\r\nSend your agents on raids to foreign lands to steal world wonders and monuments, to add them to your collection.\r\nBuild bridges, construct tunnels and transport your citizens and tourists in taxis, buses and aerial cable cars. Tropico 6 offers completely new transportation and infrastructure possibilities.\r\nCustomize the looks of your palace at will and choose from various extras.\r\nTropico 6 features a revised research system focusing on the political aspects of being the world’s greatest dictator.\r\nElection speeches are back! Address the people and make promises that you can’t possibly keep.\r\nIn times of political turmoil and social unrest, the people are calling for visionary leaders, who will steer the fate of their country with foresight and ingenuity. Prove yourself once again as a feared dictator or peace-loving statesman on the island state of Tropico and shape the fate of your very own banana republic through four distinctive eras. Face new challenges on the international stage and always keep the needs of your people in mind.\r\nFor the first time in the series, manage extensive archipelagos, build bridges to connect your islands and use new means of transportation and infrastructure. Send your Tropicans on raids to steal the wonders of the world, including the Statue of Liberty and the Eiffel Tower. Customize your palace at will and give election speeches from your balcony, to win the favor of your subjects.\r\nhttps://www.facebook.com/WorldOfTropico/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Limbic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":17913,"name":"Batman: Arkham Origins Blackgate - Deluxe Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df2/df2b1c6b36ca94b50ce81b9f5e6c4eb7.jpg","description":"Batman: Arkham Origins Blackgate - Deluxe Edition is an action-adventure game developed by Armature Studios. It is the direct continuation of Batman: Arkham Origins and is a canon installment of the Batman: Arkham series.\n\n###Plot\nThree months after his first encounter with Joker, Bruce Wayne comes across the Catwoman who stole documents from a secret government organization. She is put in the Blackgate prison with the help of Batman. Two weeks later, the prisoners attempt an escape. The prison's staff is taken hostage, and the security detail is dead. Catwoman agrees to help Batman save the hostages.\n\n###Gameplay\nUnlike the Arkham game series, Blackgate is a 2.5-dimensional game, like Metroid and Castlevania. However, the game does not use any features of such dimension and plays out like a usual 2D title. \n\nThe Protagonist walks from right to left clearing the prison out, saving the staff, and completing side-quests like finding items. Items can be detected using Batman's Detective Vision. \n\nWhen Batman walks into a new area of the prison, there a chance of encountering a group of prisoners, which will attack him. All the enemies, apart from bosses, require two or three hits to be knocked out. Most of the game's fights can be avoided by using stealth. When the player clears a certain area of the prison out, it will remain clear of enemies until the end of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Armature Studio","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"}]},{"id":409575,"name":"Pathfinder: Wrath of the Righteous","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a20/a203f3f5d667e04ce4a2c482c7be3a47.jpg","description":"Embark on a journey to a realm overrun by demons in a new epic RPG from the creators of the critically acclaimed Pathfinder: Kingmaker. Explore the nature of good and evil, learn the true cost of power, and rise as a Mythic Hero capable of deeds beyond mortal expectations.\r\nYour path will take you to the Worldwound, where the opening of a rift to the Abyss has unleashed all-consuming terror across the land. For over a century, the neighboring nations have tried to withstand the threat coming from the portal and drive the enemy back, but to little avail. Now you have the chance to put an end to this conflict, but the path to salvation is far from clear-cut. Will you become a shining angel backed by worthy paladins? Or a powerful necromancer with hordes of immortal undead in your thrall? Or something else? Lead your army and challenge the mighty demon lords. Your crusade will set in motion a chain of events that will change the world – and you – forever.\r\nCreate any character imaginable with the flexibility, richness, and depth of the Pathfinder First Edition ruleset. Choose from 25 classes, 12 character races, and more than a thousand spells, feats, and abilities to suit your personal playstyle.\r\nEnjoy two combat modes to slay your enemies – real-time with pause or turn-based. Switch between them on the fly!\r\nA cast of more than 10 unique companions is ready to join your cause. Earn their trust and respect, and they will have your back no matter what dangers lie ahead.\r\nBut you will need much more than a party of adventurers to cleanse the land of the demonic scourge. Take command of the crusaders and lead them to victory – either as a strategist controlling the battle from above, or as a field commander in a new tactical combat mode.\r\nA gift of tremendous power has been given to you, and you must choose where this power will lead you. Take a step on one of eight Mythic Paths to obtain extraordinary abilities and shape everything that comes next. Your decisions might transform you into a celestial Angel, a ravaging Demon, a powerful Lich, a cunning Trickster, a lawful Aeon, a rebellious Azata, a wise Gold Dragon, or an ever-ravenous Swarm That Walks. The world will never be the same again.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Owlcat Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":17661,"name":"Portal 2 Sixense Perceptual Pack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/102/1029c3f73786499a8ebaba437a78ed13.jpg","description":"Portal 2 Sixense Perceptual Pack is a standalone expansion pack for Portal 2 developed by Valve. It is mainly focused on the developers that are using the Intel Perceptual Computing SDK and a Senz3D depth camera. The camera is required to play the title.\n\nThe game features no plot whatsoever as it was developed as testing grounds for Intel's technology.\n\n###Gameplay\nThe core gameplay is the same as in the vanilla Portal 2 game. The players pass testing chambers using an Aperture Science Portal Device. This device creates two portals: blue and orange, which can be passed through by the players freely. The Portal Gun can also lift objects with its integrated gravity module.\n\nThe objective of the player is to reach the exit of the testing chamber by solving an environmental puzzle. For example, the door must be opened with a button that is triggered by a heavy crate. The players have to reach the crate first and somehow get in on the button for the door to open. \n\nWith each level, the difficulty of the environmental puzzles rises a bit with the addition of new elements and the increasing size of the chambers.\n\nThere are seven maps present in this map pack, specifically made for the use of the Senz3D camera.\n\n###Sixense technology\nSixense is a technology, that is developed by Intel. It allows the players to interact with the in-game objects using a special depth and gesture camera that is communicating with the game through a special API.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":387328,"name":"Curse of the Dead Gods","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c8c/c8c156591d6e88bb685177c1c44c945a.jpg","description":"You seek untold riches, eternal life, divine powers - it leads to this accursed temple, a seemingly-infinite labyrinth of bottomless pits, deadly traps, and monsters.\nYour greed will lead you to death, but that is not an escape. Rise to fight again. Delve deeper again. Defy the malignant deities that linger in this place. Battle through hordes of enemies in dark, cavernous passages filled with traps and secrets of all sorts - fire-spewing statues, explosives, hidden spikes, and worse.\nCollect mystical Relics and an arsenal of weapons to make yourself unstoppable. Corruption builds in you with every step - encourage or ignore it, but each powerful curse can be a double-edged sword.\n- A skill-based roguelike exploring a cruel, dark temple made of endless rooms and corridors\n- Swords, spears, bows, guns - wield these and many more\n- Unique curses influence each attempt, putting a twist on every action\n- Dozens of enemies, with powerful champions and deadly bosses to face off against","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Passtech Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":28160,"name":"Laser League","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/30d/30dd8b149224b828cb0942d0addbb37a.jpg","description":"Brace yourself for Laser League, the new last-word in high-speed, futuresports team action. Blink and you’re dead!\nBattle against the opposition for control of nodes that bathe the arena in deadly light. Evade rival coloured beams, and fry your opponents with speed, strength and strategy. Activate special offensive and defensive abilities to give yourself an edge at the crucial moment. Always be on the lookout for game-changing power ups on the arena floor. LASER LEAGUE is the exhilarating, high-octane contact sport of the future.\nKnown for the award-winning OlliOlli series and NOT A HERO, Roll7 bring their trademark addictive gameplay to an original vision of near-future competition. Like all great sports it is immediately understandable, but rewards dedication with deceptively complex strategic possibilities. Find the perfect blend of classes for your team, and wage neon war online or with up to eight players around a single screen.\nLASER LEAGUE enters Steam Early Access fully-featured in the summer of 2017.\nOver 60 characters from 5 Unique brands\nSelect from 6 unique and spectacular classes; SMASH, THIEF, GHOST, SHOCK, SNIPE and BLADE.\nPlay up to 4v4 intense offline or online matches\nCompete on 3 packed international Stadiums and master up to 10 laser maps.\n16 available power ups drastically change gameplay momentum.\nLevel up to unlock over 250 character customizations.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17417,"name":"Cook, Serve, Delicious! 2!!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e93/e9347d3bd708e5bca858f25cc60d109b.jpg","description":"Cook, Serve, Delicious! 2!! is the massive sequel to the surprise best selling original, one of the few games that gives players complete control on how they want to build their restaurant.\n\nThe game starts like any other morning at SherriSoda Tower as you take the elevator up to open Cook, Serve, Delicious!, a platinum star restaurant that was surging in popularity thanks to your amazing chef and management skills. Just then, a swarm of police surround SherriSoda Tower. It seems the SherriSoda head executives were secretly stealing funds from the company at the same time they were incurring a staggering amount of debt, draining the accounts of the tower and several of the businesses inside of it, including CSD. Just like that, the tower was closed and put up for federal auction, including everything inside of it. It was all over… the Cook, Serve, Delicious! restaurant was no more.\n\nAngry but determined to rebuild, you’ve scrounged up all of your personal life’s savings and bought commercial space inside the Teragon Supertower, the largest skyscraper in the city. It’s here that you will start a brand new Cook, Serve, Delicious! restaurant, build it back to its former glory, and rebuild your legacy as the best chef in the world.\n\nFeatures include:\n- A 60+ hour experience as you build your restaurant from a roach infested eatery to a World Class Platinum Star experience by either running your own restaurant or branching out as a chef for hire, where you take jobs within the tower and various restaurants as you gain experience with the large array of foods, which spans 400 levels across 33 restaurants!\n- Several modes including Classic Mode that brings back the classic gameplay of the original, Stress mode that instantly rockets the difficulty to the highest setting, and Zen mode, which allows you to take it easy and relaxes many of the stressful elements to provide an easy day of cooking. \n- All new gameplay features and additions, with a greater flexibility of difficulty for those who like it casual or **_insanely difficult_**.\n- Over 200 foods, sides, drinks and desserts to choose from, a staggering increase from the 30 foods in the original game.\n- New local co-op mode! The all new split screen co-op feature allows you to play through the entire game with two players, with the ability for players to drop in and out during your progress within the game.\n- Tons of lore including an email system with over 600 emails, unlockable secrets, and tons more!\n- Unlock over 1,200 restaurant objects and design your restaurant however you'd like with the Designer mode.\n- All new 1080p native/60fps code.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Vertigo Gaming","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4348,"name":"Gravity Rush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/086/086a471ca4fe42cf1002707caefa5e7a.jpg","description":"Gravity Rush a.k.a. Gravity Daze in Japan is a first installment in the Gravity Rush series published exclusively for PS Vita, followed by the second part released only on PS4 as well as remaster released on the same platform. The game is centered around an ability to change the gravity on the player's fancy. \nAmong the other gameplay features one may point out \"gravity field\" allowing the protagonist to grab and throw objects near her.  There are also a certain amount of collectibles: ones that fill up your gravity gauge and gems used to power up abilities. The structure of a game represents an open-world which may be explored at once and many mission together with sidequests with the latter allowing you to complete them at any time.\nThe story follows Kat — a girl with superhuman abilities. Those she acquired by having a cat — Dusty, along with her. All of the missions are supposed to help Kat recover her memory and find out how did she end up in Hekseville.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Japan Studio","platforms":[{"id":0,"name":"PS Vita"}]},{"id":3897,"name":"Flashback (2013)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ea/0ea86d90ac2e5591b31c516c2dc72e07.jpg","description":"20 years after the original game’s launch, Conrad is enlisted back to active service for the triumphant return of one of the most acclaimed franchises in gaming history.\nIt’s not a reboot. It’s Flashback re-imagined. The original Core-Team revamped their own creation, leveraging the best of today’s technology while remaining true to the classic side-scroller that set the standards of the genre in the 90’s.Key Features\nOne of the best adventure-action games ever created re-imagined by its creators. It’s the same team. It’s the same passion. Only this time, they have had much more firepower at their disposal to recreate the legendary classic!\nGorgeous graphics, amazing animations. It’s the Flashback you’ve always dreamed of. True to the original spirit but made a million times better by using modern engines such as Unreal and Havok. The makeover is completely stunning.\nIt’s all about Gameplay. The team modernized gameplay mechanics, making the game more reactive, offering new features, like gadgets and an experience progression system. But the developers kept the original formula in mind: a fine balance between rolling and shooting, exploring remote space stations and obliterating hostile alien planets.\nBringing back new memories. The story was revamped to speak to 21st century gamers. Most of the cast of the original game is still here – Conrad, the Morphs – but you can expect new characters and a few twists you’re definitely not going to forget… this time.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Renka","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":49428,"name":"The Red Strings Club","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d3/1d36765d65a9916aa519c93a8a60bd7c.jpg","description":"The Red Strings Club is a cyberpunk narrative experience about fate and happiness featuring the extensive use of pottery, bartending and impersonating people on the phone to take down a corporate conspiracy.\nThe professed altruistic corporation Supercontinent Ltd is on the verge of releasing Social Psyche Welfare: a system that will eliminate depression, anger and fear from society. However, the bartender of a clandestine club and a freelance hacker don't regard this evolution as an improvement but as brainwashing. Alongside unwitting company employees and a rogue empathy android, the duo will pull all the strings they can to bring down this scheme.Cyberpunk Thriller NarrativeUncover a mysterious corporate program that promises a blissful existence while debating what does happiness means and what lengths are permissible to obtain it.Psychological BartendingRead your customer's’ mood and mix the perfect cocktail to manipulate the client's emotions in order to gather the information you want and progress your agenda of stopping Supercontinent's plans.Genetic Implant PotteryDesign genetic implants at a high-tech lathe to change the attitude and direction of the corporation’s most influential executives.Vocal Corporate EspionageAssume the voice of important figures in the Social Psyche Welfare project and play their own motivations against each other over the phone to uncloak their plans.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Deconstructeam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":16999,"name":"DUSK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/613/6131ede941efcfbb0858e80b2f4ec6bc.jpg","description":"Pre-Purchase OfferPLAY EPISODE 1 AS SOON AS YOU PRE-PURCHASE DUSK!\nhttps://youtu.be/Flduv46BT78\nAbout the GameDUSK reintroduces you to a world where butchery and bloodshed must be mastered if you're to make it to dawn. Inspired by Quake, Blood, Heretic, Hexen, Half-Life and Redneck Rampage, and featuring a soundtrack by metal music mastermind Andrew Hulshult (Brutal DOOM, Rise of the Triad), DUSK unfolds in the eerie backwoods of the American Northeast where, gaining consciousness hanging on a meat hook, you must fight to survive.\nIn three distinct campaign episodes hand-crafted from straight outta the 90’s, players battle through an onslaught of mystical backwater cultists, possessed militants and even darker forces and attempt to discover just what lurks beneath the earth. Featuring a vast arsenal of badass weaponry including saw blades, dual-wielded shotguns from 1887 and an incredibly necessary grenade launcher, DUSK is unapologetic retro action from start to finish.\nIn addition to the main campaign, DUSK features an Endless Survival Mode, putting you front and center of wave after wave of enemies. For those looking for an extra challenge, DUSK offers the chance to go head to head online to battle your friends in arena multiplayer, where darkness hosts the worst of humanity in surprising new ways.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"David Szymanski","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":581104,"name":"PowerWash Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/659/65959a07c4e6dc7a9034993bbb3ba232.jpg","description":"POWERWASH SIMULATORHunt down dirt wherever it’s hiding, respond to calls from across the world, build your own power-washing business and unlock new tools, upgrades and more – all with the soothing satisfaction of power-washing to a sparkling finish!RELEASE THE PRESSUREAbsorb the relaxing atmosphere and stress-free pace as you strip dirt from patios and pavements, vehicles and public parks. Stress gets to us all, so here you can channel all your tension and wash your worries down the drain!CLEANING WITH MEANINGDo you like cleaning in circles or stripes? Are you methodical or chaotic? Here you are free to express yourself by cleaning the way you want.RELAX TO THE MAXIn the campaign mode there's no right or wrong; no time pressure or final score. Just you and the tools you need to soak away your stress with relaxation and satisfaction. We truly believe this is the most satisfying and relaxing game you’ll ever play!OH, YOU’VE GOT SKILLS TOO?Of course, if you think you’ve got what it takes to be the best in the business, there are challenge modes and a leaderboard with multiplayer coming too, but that is only for people who seek it.EXERCISE YOUR CREATIVITY(Coming during Early Access)\r\nYour nozzles are your brushes, the neighbourhood is your personal canvas. Unleash your creative instinct and transform ordinary dirt into exceptional artwork. Share your artwork and spread the relaxing power of power-washing - take photos, share your techniques and showcase your power-washing prowess and mud-caked masterpieces!MULTIPLAYER WASH TEAMS(Coming during Early Access)\r\nInvite a friend to join you on career jobs, or create multiplayer hangouts for up to six friends. Here you’ll be able to chat whilst washing larger spaces, helping to turn your neighbourhood into the brightest place on Earth!\r\nRelease the pressure, with PowerWash Simulator!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"FuturLab","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":17056,"name":"Gratuitous Space Battles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/033/0337cfc5238f94dfc643966568a84670.jpg","description":"Gratuitous Space Battles is a mix of real-time strategy and tactics of Tower Defense, altogether featuring a science-fiction setting of space warfare. \nThe players find themselves taking the role of the high command of the space fleet, where your strategic placement of each ship and carefully prepared tactics ensures victory in the upcoming battle. The battles, as the name implies, lack any backstory whatsoever, as the game presents them as different skirmish maps. Different surroundings and different fleet compositions help achieve victory, but the enemy also uses environmental hazards as the means of preventing the player from winning. The battlefield is non-interactable, which means the player has to plan each movement.\nThe game features a multiplayer mode, where players can battle each other using their customized ships, with different upgrades allowing to gain an edge over the enemy. The stunning 2D graphics ensure that the look of each ship type is unique and memorable, and the battle itself shines with colorful explosions, laser beams everywhere and almost realistic crashes of defeated spacecraft.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Positech Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":366892,"name":"Erica","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4a0/4a0c82a355ccf7c9d192de0c4f983af8.jpg","description":"Immerse yourself in an interactive live-action thriller which puts you at the heart of the mystery.\n\n•        Delve into Erica’s past as you piece together the shocking truth behind her father’s death. \n•        Face the consequences of your actions as you influence how the narrative unfolds and arrive at multiple alternative endings.\n•        Reach into the world by interacting with clues using your DUALSHOCK®4 wireless controller or the Erica app for iOS and Android*.\n\n*App download, Wi-Fi connection and compatible iOS or Android smartphone required.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Flavourworks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":19355,"name":"Call of Cthulhu: Dark Corners of the Earth","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/69a/69ac3aa05502fd854b73e55443e7f7ba.jpg","description":"Call of Cthulhu: Dark Corners of the Earth is a first-person horror game that combines intense action and adventure elements. You will draw upon your skills in exploration, investigation, and combat while faced with the seemingly impossible task of battling evil incarnate.Key features: Diverse array of levels from quaint towns to alien locations, including Deep One City\nDynamic Sanity system resulting in hallucinations, panic attacks, vertigo, paranoia, and more!\nIncredibly detailed real-time graphics with atmospheric lighting and dynamic shadows\nIntelligent gameplay involving puzzle solving as well as combat and exploration\n1920s weaponry and vehicles as well as evil artifacts and alien technology\nLovecraft's famous monsters and locations","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Headfirst Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":14251,"name":"SPINTIRES","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6bd/6bd2862420402fa45d690295ed308cc6.jpg","description":"SPINTIRES is an indie auto simulator game developed by Oovee Game Studios.\n\n###Gameplay\nSPINTIRES is an offroading simulator. The players have to deliver cargo using the post-Soviet machinery deep in the Russian woods, where there are no solid roads and a lot of fallen trees.\n\nThe main feature of the game is dynamic terrain. That is achieved with Havok physics engine. Trucks leave marks on the road, get stuck in the terrain, which makes the further advancement harder.  Thanks to Havok, the terrain is procedurally generated every time the player loads a map. That adds a high replayability value to the game. This feature also makes the races against other players much harder, as you can't just win a race by going as fast as you can.\n\nIn SPINTIRES, the game focuses a lot on simulating the physics and behavior of the vehicles. Every machine has a limited amount of gas, can be damaged beyond any repair. The players can turn the differential lock on or off, activate the 4X4 mode, which will influence the amount of used gas. It is also possible to drag the car out of the mud by using a rope and attaching it to a tree or another car.\n\nThe players can also modify the cars using different attachments. It is possible to attach fuel tanks, repair kits, and so on.\n\n###Multiplayer\nThe game features a 4-player multiplayer mode, where the players can choose the time of day, and the environment. The objective of the mode is to reach the finish first without getting stuck in the mud.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Oovee® Game Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9623,"name":"Heavy Metal Machines","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/014/014ae85f986cd956574d8904da227907.jpg","description":"Heavy Metal Machines is a free-to-play multiplayer action racing game developed by Hoplon. The game is heavily influenced by the classic Rock n' Roll Racing and more modern titles, such as Rocket League, Twisted Metal and the whole genre of MOBAs.\n\n###Plot\nThe players are free to choose from several characters to play the game. Each one of them has their own backstory and reasons behind their decision to participate in the event.\n\n###Gameplay\nThe players control the heavily modified vehicles with guns installed on them. The objective of the game is to steal a bomb, that is located in the center of the arena and get it to the enemies base to destroy it. \n\nUpon picking up the bomb, the player holding it has to ride around the whole perimeter of the arena and avoid destruction by the enemy forces. The player can be assisted in his efforts of bringing the bomb to the enemy base by their teammates that can cover the bomb carrier. \n\nEach character present in the game (there are more than ten characters in the game's roster) has not only their own backstory, but a specific vehicle that differs in handling, gameplay, and most importantly, its role. Like in most MOBAs, there are several player roles: a tank, who pushes through the enemies front lines; a support, who heals and buffs the team; a defender, who stays behind and defends their base by any means necessary.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hoplon","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":57797,"name":"Spyro the Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/243/2434639122ce19d4811048cd11ab5ba0.jpg","description":"Spyro the Dragon is a platform video game developed by Insomniac Games and published by Sony Computer Entertainment. The game was released for the PlayStation in September 1998. The first game in the Spyro the Dragon series, it stars the title character, a young purple dragon named Spyro, and his dragonfly friend, Sparx, who venture through the dragon kingdom to rescue the other dragons from a spell placed by the antagonist, Gnasty Gnorc.\nSpyro the Dragon received positive reviews from critics, who praised the game for its graphics and high replay value. The game was also a commercial success, selling nearly 5 million copies worldwide. Two sequels, titled Spyro 2: Ripto's Rage! and Spyro: Year of the Dragon, were later released for the PlayStation in 1999 and 2000, respectively.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":16159,"name":"The Longest Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/944/944933ddfb27a6ebc1c3e4c3ee250503.jpg","description":"The Longest Journey is an amazing graphical adventure, where the player controls the protagonist, April Ryan, on her journey between parallel universes. Embark on an exciting and original journey of discovery, where you will explore, solve puzzles, meet new people, face terrifying monsters, learn, grow, and live the adventure of a lifetime!\nOver 150 locations spanning two distinct and detailed worlds\nMore than 70 speaking characters\n40+ hours of gameplay\n20+ minutes of high-resolution pre-rendered video footage\nCinematic musical score","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Funcom","platforms":[{"id":0,"name":"PC"}]},{"id":216275,"name":"Transpose","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3c/c3c3a0c9c3ad7698ab87351841ff08ae.jpg","description":"The universe renews, refreshes and repeats, infinitely folding in on itself. I am made of its energy. My past and future selves are always with me. We work together to generate the infinite cycle of creation and destruction. I exist within and without time, I am inevitable, I am eternal. Time and gravity are my tools to manipulate the world. I don't recognize this world, but I know I have been here before.\nTranspose is a dreamlike VR puzzle game set in a universe where time and gravity are used as tools to manipulate the world. By creating and working with looped recordings of their actions, players must solve increasingly complex physics puzzles in a mysterious setting where notions of space and time no longer apply.\nPlayer Echoes\nTranspose features real time player recording, allowing you to play back your actions one to one in real time while interacting with your past selves. You must create echoes of your self, rewind time, and work with these echoes to solve puzzles. Go ahead, give yourself a high five.\nTime and Gravity\nSet in a mesmerizingly surreal world, Transpose allows players to control time and gravity. Rotate the environment around you to walk on walls and ceilings, experience perspective shifts and multifaceted puzzles in ways only possible in VR.\nWorlds\nTravel across 3 distinct worlds solving gravity defying physics puzzles in over 35 unique levels featuring impossible, otherworldly architecture.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Secret Location","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":11009,"name":"State of Mind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d75/d75b6636526da53fada8a2b49910e41d.jpg","description":"State of Mind is a futuristic thriller game delving into transhumanism. The game explores themes of separation, disjuncture and reunification, in a world that is torn between a dystopian material reality and a utopian virtual future.\nEmploying multiple playable characters and two separate game worlds, State of Mind explores the existential drama that develops in a society on the brink of post-material existence.\n\nYou are Richard Nolan, a father and journalist from Berlin who discovers that he has been subject to an accident.  As a result, he is still living with incomplete memories.\nUpon realizing that he is literally a torn man, Richard sets out on a dramatic and dangerous search for salvation. He aims to reunite with his family, as well as with his own lost memories. On his way, he soon realizes that this journey isn’t only about him, but about the future of mankind.Key Features3rd Person Adventure\nStory-driven gameplay experience\nSwitching between two game worlds\nMultiple story layers\nMultiple playable characters\nUnique artstyle","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2860,"name":"This War of Mine: The Little Ones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/711/711a4f90f16e2a07c5e731922ea27ca8.jpeg","description":"This War of Mine is a game about civilians who are trying to survive during a military conflict. The game was inspired by the real-life Bosnian War.\n\n###Gameplay\nThis War of Mine is set in a fictional country Graznavia during an ethnic conflict similar to the siege of Sarajevo. The player controls a group of one to four characters caught in the middle of a war. Each protagonist has a unique set of abilities and weaknesses, some of which are hidden. Their goal is to simply stay alive. It requires them to scavenge food, meds, and other necessary supplies, keep their house warm during the winter and avoid the military. \n\nBy day, the city of Pogoren is filled with snipers who shoot at everyone indiscriminately. The player can explore the city only by night, though it is not safe either, as the characters can encounter hostile looters and marauders. Survival also requires crafting new items from the scavenged junk. One of the most useful items to build is the radio that allows the player to keep track of the events outside. To win the game, the characters have to survive until peacetime which may come at random times.\n\n###Expansion features\nThe Little Ones expansion pack allows the player to include a child in the group of survivors. It adds a new layer of complexity to the gameplay. The child is helpless and needs an adult to take care of him or her. However, the kid can eventually learn to perform simple tasks, such as cooking. To avoid depression, the child has to assemble new toys from the junk the adults have scavenged and meet other kids to play.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":61415,"name":"Pummel Party","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c96/c968a71ce3529528065cc27385c1e0a9.jpg","description":"Pummel Party is a 4-player online and local-multiplayer party game. Pummel friends or AI using a wide array of absurd items in the board mode and compete to destroy friendships in the entertaining collection of minigames.ONLINE AND LOCAL MULTIPLAYERPlay how you want. Pummel Party allows 1 to 4 players to compete both online or locally on the same screen. Whether its online, or in person, it's all the same friendship ruining fun.\nBOARD MODEThere can only be one winner here, and you know it has to be you! Battle through hazardous terrain to acquire an arsenal of weapons and items and employ them however you can to make sure that you reign victorious over your friends.\nITEMSIt's all out war! Use an array of absurd weapons and objects to claw your way to victory.\nFrom the simple 'Punching Glove' to the ridiculous 'Remote Controlled Eggplant' the items in Pummel Party will lead to many funny and rage enducing moments. It's never been easier or more satisfying to crush your friends aspirations of winning!MINIGAMESFrom simple nostalgic fun to unique and evolutionary Pummel Party contains a wide array of exciting minigames. Knock your friends in to the abyss in 'Snowy Spin', dig three dimensionally in 'Sandy Search' to be the first to find the treasure and make sure you're not holding the bomb when it goes off in 'Explosive Exchange'.MINIGAME MODEJust want to jump in to the action? Pummel Party includes a minigame mode so that you can get straight to the games!BOTSAlready destroyed all your friendships or just need to fill out your roster? Pummel Party includes full bot integration meaning you can still play or practice Pummel Party with any number of real players.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rebuilt Games","platforms":[{"id":0,"name":"PC"}]},{"id":58913,"name":"Muse Dash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73f/73fec7fb82e7e1b7a5e12ce5f5065689.jpg","description":"Come and fix the world movement tampered with by a mirror image code with three beauties!\nThis is a world of the perfect combination of a cool parkour game and a traditional music game——Muse Dash!!\nYes.\nYou’re destined to be our Master!\nWhat? You don’t have nimble fingers? Meow~ Don’t be too modest!\nSo, don’t worry! If you do not excel in playing action games,\nyou can still overcome the difficulties by dancing to the music!\nChoose your favorite beauty to go through the romantic backdrop. Now let’s get started with our journey to wipe out all the adorkable monsters!!!\n【Gameplay】\nDance to the music and beat enemies from above and ahead with simple left-and-right operations. Be careful of the barriers! Although it’s not difficult to operate, but it’s definitely an interesting game! There are abundant songs to select and meticulously designed beats! Just wait to be stunned!\n【Game Features】\nYou will go through an unprecedented experience of the perfect visual effects of a parkour game and the traditional gameplay of a music game.\n◆ Unique and fashionable art design.\nThere are 30 popular songs initially. Stay tuned for continuous updates!\n◆ Different music styles are matched to different scenes, enemies and Bosses.\nWe have beauties, adorable pets and even adorkable enemies! Believe me, you will even be impressed by the Boss!\nWhat? You’ve had enough?? Alright, that’s the most I can do for you...\n◆ Well-designed scripts and Japanese VO.\nTwitter： @MuseDashtheGame\nFacebook： @MuseDashtheGame\nPublisher Facebook： @XDNetworkInc","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"X.D. Network","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":41461,"name":"Hitman: Sniper Challenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/949/94983507a9ef5869910bd19cf9059ae9.jpg","description":"Hitman: Sniper Challenge is a stealth-action mini-game which is a spin-off of Hitman: Absolution developed by IO Interactive.\n\nThe game takes place not so long before Hitman: Absolution. You play as a deadly assassin, Agent 47, overlooking the roof of the next building. Your goal is to eliminate Richard Strong Jr. and his security detail in no longer than fifteen minutes using a sniper rifle. It is also possible to fake out an accident thanks to the location scenery. \n\nThe game features a ranking system which estimates player's performance and puts the result on the public leaderboard. Players can complete special assignments or go on a headshot streak apart from killing in order to get points. It is also possible to earn new sniper rifle upgrades such as extended magazine capacity or fire rate increase.\n\nThe game was initially released as a pre-order bonus but as of 2018, it comes bundled with an Elite edition of Hitman: Absolution.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"IO Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":65969,"name":"RISK: Global Domination","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c0/7c0f76f1b0f983312b1bcfe116e8296d.jpg","description":"Everybody wants to rule the world! Now you can play the classic game of Hasbro's RISK online.\nThis fully licensed version of RISK is coming to Steam for the first time.\nCross-platform multiplayer lets you take on the millions of players playing on mobile from your PC or Mac.\nFEATURES\n• Multiple game modes available: Global Domination online, Play Friends online, Single Player, and Pass & Play\n• Authentic rules – it’s the RISK you know and love\n• Join or host battles against opponents online\n• Use Automatch mode to be pitted up against players of similar rank online\n• Up to 6 players/AIs\n• Start with 7 classic and unique maps (Classic, Advanced Classic, Asia 1800s, France, Central America and Frozen Classic)\n• 30+ more maps and counting to buy as additional DLC packs\n• 10+ of single player scenarios to tune your skills with across a variety of maps\n• Custom rules and game modes available: Capitals, blizzards, fog of war, limited turns, 70% control.\n• 5 difficulty AI settings for rookies and veterans\n• Guided tutorial mode and in-game help\n• Critical game stats and achievements\nYou must be 13 or older to play online.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SMG Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":37194,"name":"Devil May Cry 3: Dante's Awakening Special Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/db4/db49a4d8759e7c0fb16d7b3ea35ea64d.jpg","description":"Dante's past is now revealed as Devil May Cry returns to its roots.  Master Dante's multiple fighting styles while battling never before seen demons and new characters as you fight your way towards a brutal confrontation with Dante's mysterious twin brother, Vergil.\r\nChoose Dante's fighting style - maximize the impact of close-up blade attacks, or blow enemies away from a distance.\r\nHuge arsenal of weapons - handguns, shotguns, swords, and more.\r\nA horde of demonic enemies - more ferocious than ever - with powerful weapons and abilities to transform and fly.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 2"}]},{"id":24899,"name":"Super Mario World","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3bb/3bb2c8d774c3a83eb2c17d0d3d51f020.jpg","description":"Mario's off on his biggest adventure ever, and this time he's brought along a friend. Yoshi the dinosaur teams up with Mario to battle Bowser, who has kidnapped Princess Toadstool once again. Guide Mario and Yoshi through nine peril-filled worlds to the final showdown in Bowser's castle. Use Mario's new powers and Yoshi's voracious monster-gobbling appetite as you explore 96 levels filled with dangerous new monsters and traps. Climb mountains and cross rivers, and descend into subterranean depths. Destroy the seven Koopa castles and find keys to gain entrance to hidden levels. Discover more warps and thrilling bonus worlds than ever before!","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Nintendo","platforms":[{"id":0,"name":"SNES"}]}]