[{"id":627562,"name":"Sun Haven","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24d/24d59b7600e96ab4a69a81d9a3b5b795.jpg","description":"Sun Haven is a multiplayer fantasy farming sim with dragons, magic, a main questline, RPG-style skill progression, and even a final boss.\nGreetings, Adventurer!\nYou’ve just arrived in Sun Haven, a medieval town full of people from all walks of life doing their best to make their beloved town thrive as it once did. As a farmer, miner, fisher, warrior, craftsman, and even a mage, you’ll find that adventure awaits you here. Your hard work will let you upgrade your farm, restore shops in Sun Haven, and even bring in new neighbors! As you bring the hustle and bustle back to town, the EXP you earn from each quest will help you level up to advance through a main questline journey. The main quest itself takes you through two captivating towns outside of Sun Haven. The mythical Elven town of Nel’Vari rests deep in the forest where the Elves live in balance with nature. The rumored monster city of Withergate features a bustling nightlife that never ends - literally - since the city is covered in neverending darkness. Your experience in these places will grow your skills dramatically, but how you focus that growth is entirely up to you. If you prefer a sword in hand, then slash away by all means. But if a watering can is more your style, then there are nonviolent alternatives to overcome dangerous encounters - even with the final boss! Either way, it’s up to you to wield your abilities and become the hero of your own story.Features:Farm, Fish, Fight, Mine, Smith, Cook, and Craft to revitalize Sun Haven\nTHREE Worlds to Explore: The Cozy Human Town of Sun Haven, The Beautiful Elven Village of Nel’ Vari, and Urban Monster City Withergate\nSEVEN different player races: Human, Demon, Elf, Angel, Elemental, Naga, and Amari (animal race, including cats, dogs, fish, birds, and reptiles)\nTons of Player Customization: 200+ different race and clothing options\n8 Player Multiplayer: Play with up to EIGHT total people in one game, make your own farm and story in online multiplayer\nFIFTEEN romance-able characters: (humans, elves, demons, and multiple animal races) or woo your own partner in multiplayer! Romance your character of choice regardless of gender or race and get married\nUnique Monsters throughout the world to fight past on your way to becoming the hero of Sun Haven\nHome Decorating with more than 100 pieces of furniture. From your living room to your farm, design and decorate to your heart’s content!\nDozens of RPG-styled Quests to keep you engaged while you relax and farm\nA Skill Tree  with over 100 options. Make your own play style and unlock a plethora of spells to help you along your journey, Farming Spells, Combat Spells, even Mining Spells!\nPets and Mounts to collect and keep on your farm or to join you as you discover what lies beyond the forests of Sun Haven","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pixel Sprout Studios","platforms":[{"id":0,"name":"PC"}]},{"id":581147,"name":"UNBEATABLE [white label]","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/740/740a7243831374938d902b062acfea82.jpg","description":"A young girl learns a song.\nUNBEATABLE [white label] is a special episode set in the world of UNBEATABLE. Every week during the length of UNBEATABLE's crowdfunding campaign (from April 6 to May 7), [white label] will be updated featuring new story content and beatmaps, eventually finishing a complete stand-alone narrative.\nFEATURES: Visually stunning, heart-pumping, anime-inspired combat.\nBattle to the beat however and whenever you want in the ARCADE MODE.\nNew story and songs releasing every week from April 6th-May 7th, including a couple of special surprises!\nNot feeling the rhythm? Try out an early version of our ASSIST MODE for some help!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"D-CELL GAMES","platforms":[{"id":0,"name":"PC"}]},{"id":306089,"name":"Trials of Fire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b61/b619b63d8c95623fb22f19ffd1f1f3d4.jpg","description":"Trials of Fire is a single player, turn-based strategy game set in a post-cataclysmic fantasy realm.\nThe threat of starvation and conflict are never far away as Trials of Fire combines free-form exploration of an expansive open world, multi-character, card-driven combat and an innovative new fusion of loot, load-out and deck-building systems delivering massive depth of play and unique strategic opportunities for the player on every run.\nTrials of Fire also features an extensive range of narrative ‘judgement’ encounters where the player is challenged to weigh moral dilemmas in a lawless world, assuming the roles of judge, jury and (often) executioner.\nThe tactical rogue-like design, procedurally generated game events and expanding gallery of playable characters and abilities challenges the player make every decision count as they journey across a dying world… in search of hope.\nThe hope that will save your forsaken people, the hope to survive in the desolate and dangerous wastelands, the hope that you and your party of heroes will live to fight again and to see the dawn of a new day.\nKey FeaturesMulti-Character Deck-Driven Combat\nDuring combat encounters, the player is able to issue commands to each Hero based on their draw cards. The random draw of cards presents new and interesting challenges at every turn and it is up to the player to consider their best immediate tactical choices via positional play and to optimize their offensive and defensive capacities while taking advantage of any available card synergies that may have arisen in the draw by combining the unique abilities of their three heroes.Recurrent Tactical Optimisation\nAt any time between combat encounters, the player can tweak their character’s loadout of weapons, items and gear and in so doing alter their card-defined abilities. The player has the option of assigning resources across their heroes and interchanging items in order to maximise the effectiveness of the triad. New items and weapons are acquired when scavenging in ancient ruins, or looting an encampment after an ambush and so the player is constantly challenged to consider the optimal state of their party’s load-out. Discovering one new Epic weapon could cause the player to rethink their entire strategy!Vast Procedural Overworld Adventure\nPlayers will traverse an immense overworld map, choosing their heading and defining their own adventure as they embark upon a journey across a vast and varied wasteland in a perilous hunt for resources critical to the survival of their home settlement. The threat of ambush and skirmish are never far away as the player’s triad of heroes do battle with the roaming denizens of the wild, monsters of lore and legend and the unforgiving lands of the realm of Ashe.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Whatboy Games","platforms":[{"id":0,"name":"PC"}]},{"id":302935,"name":"War Selection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8aa/8aac8c998378ddb404577d981b9cb4c8.jpg","description":"This is a pseudo-historical military strategy game with a battle royale mode.\n62 players on the same map fight for victory, passing a way from a stone hatchet to a modern tank.\nA campaign and different game modes are waiting for you:\n- Confronting hordes;\n- Free-for-all match;\n- Team match;\n- Battle Royale;\n- Team Battle Royale.\nDuring historical development you will have to choose your culture, and then a country.\nIf you wish - follow the Aisan way: train machine gunners on war elephants.\nOr become a European with their unique antique war machines.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Glyph Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":285666,"name":"Barn Finders","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3d050020f321459beb9cf1ced65e760.jpg","description":"Search for valuables stashed in abandoned barns ranging from old clocks, musical instruments, antiques, gold, weaponry or even vintage cars and motorcycles and sell them with profit.Take part in storage auctionsTake part in storage auctions, bid high and buy yourself a chance to find exclusive items hidden in the past.Investigate special locations.Discover new places and learn their history. Find unique items, not all of them legal.Consult with experts from various fields.If you suspect that an item you've found is worth more than the general market price call an expert to learn more about it. Maybe it's more than meets the eye, or maybe it's connected to some fascinating story? Or maybe it's just a cheap reproduction.In need of some easy money?Clean someone else's garage for them in return for the opportunity to search it through. People sometimes forget what incredible stuff they've stashed there. If you manage to clean it fast enough you might even get paid.Build your own empireHire a shop or a warehouse in which you will store, present and sell your findings. Keep those items that might come in handy when trying to build something exceptional.Features:Over 100 of valuable items to find\r\nDifferent conditions in which you find items\r\nOver 10 places to search through and over 20 garages and magazines\r\nExperts to consult\r\nYour own shop and magazine","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Duality Games","platforms":[{"id":0,"name":"PC"}]},{"id":238783,"name":"Merchant","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ed/7edb8d4a36e279f8f2fb5d144017c070.jpg","description":"TAKE REIGN OF YOUR MARKET\n- Send Heroes out on epic adventures!\n- Pay Crafters to create gear!\n- Earn gold and dictate the direction of your economy!\n- Grow your inventory and profit from your trade empire!\nVICTORY THROUGH CONQUEST\n- Choose your cast of characters from multiple Hero classes!\n- Ride out to battle to bring back items and loot!\n- Customize your champions with weapons and armor!\n- Band together to raid powerful bosses as a party!\n- Better performance leads to greater rewards!\nCRAFT YOUR LEGACY\n- Utilize the unique Crafters to create items and gear to use and sell!\n- Train the Crafters to create better items, allowing them to master their trade!\n- Ensure the victory of your Heroes by outfitting them with superior items!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Retora Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":60567,"name":"Circle Empires","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a00/a00efea9b4497096d497a604d83b733d.jpg","description":"The Circle Empires universe is made of interconnected circles, each containing loot to plunder and foes to defeat. You are the god-like leader of your tiny kingdom, hungry for power. Use your skills to hunt down increasingly powerful enemies and expand your empire. The game world changes every time you play - no two games are the same. And... you can grow pumpkins!\nOriginally released as a small demo, Circle Empires was avidly played by 160.000+ gamers worldwide.\n“Since we got all this love from thousands Circle Empires demo players, we decided to make it into a fully-fledged RTS. Now, after two years of work, this little gem is ready to be enjoyed.” – the Luminous Team.KEY FEATURES\nFast-paced real-time strategic gameplay with large-scale battles\nExpand your empire, circle by circle\nUnits can gain XP and level up\nProcedurally generated worlds containing unique flora and fauna\n150+ different creatures, buildings and resources\n18 Different faction leaders, a variety of bonuses\n12 enemy boss monsters\nA magnificent treasury that grows with each battle","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Luminous","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":59329,"name":"Space Hulk: Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/469/469a1315f41f52da2d5b744e9cc9c189.jpg","description":"Space Hulk: Tactics is a faithful adaptation of the board game Space Hulk, set in the Warhammer 40,000 universe, bringing a unique twist to the cult classic formula. Engage in bloody battles through an immense Space Hulk - a twisted mass of asteroids, wrecked star ships, and debris – as either a squad of Terminator Space Marines or the deadly alien Genestealers. Which side will you choose?  \n\nBattle through two distinct, narrative-driven campaigns: lead a Blood Angels squad, which you will customise and upgrade as you progress, or take control of the Genestealers for the first time in a Space Hulk game!\n\nSpace Hulk: Tactics is based on the rules of the popular board game, given a fresh new spin in the form of the unique Card system. Cards provide more ways to customize your squad and allow you to turn the tide of battle with powerful abilities that trigger game-changing effects when used at the right moment.\n\nTest your skills against other players in the expansive online competitive multiplayer. Command a swarm of Genestealers or a custom squad of different unit types from one of four Space Marine Chapters available – the Blood Angels, the Space Wolves, the Ultramarines, and the Dark Angels. The game includes a built-in intuitive map creation tool, to design your own original maps with custom objectives, and share them with other players!\n\nA faithful adaptation of the Warhammer 40,000 board game Space Hulk, with a fresh twist to the classic rules\nEngage in bloody tactical battles aboard a gigantic Space Hulk\nPlay through two campaigns from the point of view of the Blood Angels, and for the first time in a Space Hulk game, the deadly Genestealers!\nCustomize your units of Dark Angels, Ultramarines, Blood Angels, Space Wolves, and even Genestealers with hundreds of cosmetic items, cards, and equipment.\nChallenge players online, playing either Genestealers or one of four Space Marines Chapters\nCreate and share your own missions with an intuitive map creation tool","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":58115,"name":"Masters of Anima","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b6/2b6675d9433aa8ff682170bbf60d7849.jpg","description":"Twitch Dev Session\nAbout the Game\nMasters of Anima is an original adventure game that takes you deep into the magical world of Spark. Battle against the forces of evil in strategic, action-packed battles, where making tactical decisions quickly is vital. Summon and control large armies of up to 100 Guardians, thanks to intuitive and innovative gameplay made from the ground up for controller play, as well as keyboard and mouse.\nPLAY AS OTTO, AN APPRENTICE OF ANIMA...\n...gifted with incredible powers and covet the rank of Master to finally marry your betrothed Ana - captive of the terrible Zahr and his fearsome Golems!\nUSE THE POWERS OF ANIMA...\n...to summon an army of magical Guardians. During your adventure, learn to control new types of Guardians, each with their own unique abilities useful for exploring the world of Spark, as well as for taking down formidable bosses on your way. Acquire new powers for both yourself and your Guardians, and become a true Master of Anima.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Focus Home Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":51290,"name":"Harvest Seasons","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbe/fbe17c6c5a66ddc57662108412582d56.jpg","description":"Start a new city with the basics, amass your resources, spend them on buildings and upgrades, get more resources, build a bigger city! Soon you'll be unlocking auto-run buildings to generate resources while you're gone, earning skillpoints to permanently upgrade your stats, and prestiging into new seasons. How many seasons can you reach?\n5 Different Resources to Farm\nGather wood, produce, ore, skins, and fish.\nOver 25 Buildings\nBuild out your city with your resources. Then fulfill building requests to start leveling the buildings up to earn more.\nBuy Hundreds of Upgrades\nUpgrade your resources and your city to get more. Start unlocking Skillpoints to permanently boost your game. Collect blueprints for buildings to permanently boost their stats too.\nManage your Resources\nDo you spend everything you own on upgrades, fulfill some building requests, or maybe save up to afford the next new building?\nExplore the City\nUnlock things like a Port to take out-of-town requests, auto-run buildings to auto-generate different resources, and even a dungeon to send expeditions for treasure.\nFree to Play, NOT Free to Gouge\nNo loot crates! Instead, we're much more into bundles (check the DLC!), and the gem store is more like Animal Crossing where the inventory changes every day. Other than some one-time purchase bundles, there are NO gems for sale! No repeat gems to keep buying. Earn them in-game.\nLovingly hand-crafted by a husband and wife team!\nEach 420 and 69 in the spreadsheets celebrated with a high-five.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Bearded Bunnies","platforms":[{"id":0,"name":"PC"}]},{"id":51134,"name":"Joggernauts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38e/38ef45661d39304294fc278bfe40aa2e.jpg","description":"Joggernauts is a cooperative auto-runner party game for 2-4 players where you try not to kill your friends. Take turns (probably failing) to lead your team through deceptively difficult color-coded platforming levels. Help the alien athletics team find all of their missing trophies. Yell colors at your friends.\n2 to 4 player couch co-op local multiplayer\nShouting colors at your friends\nUnique switch-to-front teleportation mechanic\nColor-coded cooperative puzzles\nArcade autorunner-style action platforming\nDeceptively difficult level designs (not procedural or endless)\n100% completion challenges\nUnlockable characters\nAlien worlds","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Space Mace","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":50679,"name":"Dragon Sin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edf/edf743a6c6a417079db2b3b7f21fd08a.jpg","description":"We are a development team from Taiwan called Fate-Dragon Studio. We hope you enjoy the fruit of our labor—a medieval-style fantasy action game themed around dragons.\n\nTwo highly intelligent races exist in the world of Dragon's Sin—the Dragon Clan and humans. Dragons possess overwhelming physical advantages, while humans rely on magic powers.\n\nIn the beginning, the two races co-existed peacefully, until some members of the Dragon Clan found out that they could increase their power by devouring magic-wielding humans. This discovery broke the balance of power, and the Dragon Clan was split in half. Those who desire power and search for humans to eat are called Dark Dragons. They have consumed too much magic and become twisted. To sustain themselves, they must continue consuming magic.\n\n\nThe story line follows a handsome mercenary, Greer, who is a child of the Dragon Lord. He returns home one day to find that the stronghold he lives in has been completely destroyed, and the townspeople are nowhere to be found. The place is empty, save for wandering Dark Dragons.\n\nTo find out what had happened, Greer sets off toward the magical ancient tower occupied by the Dark Dragons, in hopes that he might find some answers.\n\nOur goal is to give players a positive experience in which even the small can defeat the large, and endurance and responsibility will result in victory. The players will enjoy getting revenge on the Dark Dragons by destroying their protective barriers, stunning them, and dealing the fatal blow during their short period of vulnerability.\n\nGreer, the hero of the story, can perform amazing combo strikes and charge attacks. A charge attack is one of the ways to stop a charging Dark Dragon. While in battle, The hero must dodge to avoid the Dark Dragon's relentless attacks, looking for the dragon's weak points and striking back.\n\n\nGreer's Dragon Prince form: Greer can transform into a powerful fire dragon to turn the tide of battle, switching between human and dragon forms to perform different attacks and combos to brutally annihilate enemies. While in this form, each attack will heal Greer’s health and allow for more powerful attacks. Greer can also jump in the air to strike a Dark Dragon’s head.\n\nGo on a fantastic adventure to experience the thrill of killing dragons.\nFace gigantic evil dragons and their relentless attacks. Find their weak points and strike back.\nTransform your character into a powerful dragon form to brutally slay the evil dragons.\nSupports Chinese and English.\nSupports keyboard + mouse and Xbox controller.THANK YOU！！\nFor the best game experience, please make sure that your hardware meets these requirements.\n","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fate Dragon Studio","platforms":[{"id":0,"name":"PC"}]},{"id":44736,"name":"Alien Arena: Warriors Of Mars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a7e/a7e70bbadaf40e801f3f3eaaeec455e7.jpg","description":"Do you like old school deathmatch with modern features but none of the frills that have ruined the raw purity of the genre? How about rich, colorful, arcadelike atmospheres? How about...retro Sci Fi? Then you're going to love what Alien Arena has in store for you! This game combines some of the very best aspects of classic deathmatch, and wraps them up with a retro alien theme, while adding tons of original ideas to make the game quite unique.\nAlien Arena is a furious frag fest with arenas ranging from the small, to the massive. With game modes such as Capture The Flag and Tactical, there are terrific team-based experiences to be had as well as 1v1 duels, free-for-all, and dozens of mutators to alter the game play to your liking. The community is friendly, as well as prolific. Dozens of maps, models, and various accessories have been created by community members to add on to the game experience.\nWhether playing online against others or offline against the built in AI, the fun is practically endless.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"COR Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":38567,"name":"Mabinogi","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16e/16e339249af2c002b1bbec6280fa0536.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"devCAT","platforms":[{"id":0,"name":"PC"}]},{"id":22152,"name":"The Dishwasher: Vampire Smile","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1da/1da5db2c7c5cba2ec3fcbe09281177f2.jpg","description":"Three marks remain.\nEmbark on a blood soaked quest of vengeance as either Yuki, a machine-armed, mentally unraveling prisoner, or The Dishwasher, a relentless, reanimated samurai, against the corrupted leaders of society: the Banker, the General, and the Judge.\nThe followup to 2009's Dead Samurai, The Dishwasher: Vampire Smile is a combo-fueled, fast-paced, stylistic 2D action platformer that features the series' staple gritty, graphic novel-inspired art style, built on a new engine that allows for an even more visually gruesome experience.\nOriginally released in 2011 on Xbox360.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ska Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":21841,"name":"Trailer Park Boys: Greasy Money","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83e/83e2357298f58644e637ee21ea9320ac.jpeg","description":"Trailer Park Boys: Greasy Money is an idle clicker game, rebuilt from mobile to PC.\nPlay with Bubbles, Ricky and Julian along with all the Trailer Park Boys characters. Let’s go boys!\nMAKE GREASY MONEY\nManage and collect greasy cash from your businesses. Collect liquor and cards to upgrade buildings in the trailer park. Too lazy to work? Hire workers to run your businesses when you can’t play.\nCOLLECT CHARACTERS\nOver 30 character cards to collect! Unlock new characters from bustin’ open trunks or beating bosses. Upgrade characters to make more money and increase profits!\nDECENT!\nUse crowbars to bust open car trunks for rare items and cards. Follow along with the story through comedic cutscenes. Play your way through all of the seasons, think you beat them all?\nBOSS FIGHTS\nKnock knock… guess what!? Throw down with resident Trailer Park supervisors including Randy and Mr. Lahey in boss fights. Use your middle-finger strength to battle your way through boss fights! The faster your click, the faster you fight!\nJAIL IS AWESOME\nGetting busted is part of the job! Lose your cash, but keep your upgrades. After each season ends, you get to start running your park with more profits, faster upgrades and even greasier money!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Eastside Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":21041,"name":"Dark Years","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ec/3ec637ec022f5e01ae5f9a9c49c92e44.jpg","description":"Update NotesUpdate #1\nImprovements and fixed problems Listed Below :Major :The safe puzzle quit system fixed ,it  didn’t restart the game anymore .\nFixed crash problem during first level.\nPeople of AI system improved for problems like running into walls\nFace motion of Amir after talking didn’t go weird any more.\nCar navigation system improved. No more two slow after starting the car and to fast speed after moving, just one stable speed.\nFoot step sound synced more precisely with character movements\nRun Animation movement of Afshar and amir begin exactly with holding the shift key (no more delay)\nFixing collider of afshar in some level that caused him to partially go to the walls\nSpelling problems fixed and removed and all Persian subtitle fixed.\nMouse cursor locked and hided always during gameplay\nY Invert of mouse added\nStairs in two levels fixed\nSelf Defending mini games removed because of it's  damaging to gamplay. Minor :green bar removed from some cutscenes\ngrafiti on the wall of first cutscene is in English now\nmotion blur removed from first level that caused problem\nDetective clips through the couch a lot during home cutscene.fixed\nAmir didn't spawn in the air & fall after prison level.\nMini map lines now are more precise with Level environments\nThe hotel attendant changed to proper model\nMany other minor fixes or polish things in sound effects , collision , etc.\nAbout the GameInspired by true events, Dark Years is set in 1953 Tehran, Iran.\nTehran is in the grip of fear following a series of grisly murders. Major Afshar has been tasked with finding those responsible. Meanwhile, some 3,300 miles away in London, an Iranian journalist is handed documents that uncover a conspiracy of seismic proportions. As both the Major and the journalist delve deeper, their paths will cross, plans for a coup will be uncovered and Western government involvement will be exposed.\nDark Years is an action-adventure game based on the real events surrounding ‘Operation Ajax ‘. In an attempt to secure the rights to Iran’s oil, the British and American governments secretly backed a coup that over-threw the democratically elected government of Mohammad Mosaddegh. The result was a period of great instability and violence.Key Game FeaturesOpen-world gameplay\nshooting and driving\nOver 25 characters with nearly 3000 lines of dialogue\nCompelling narrative\nOver 8 hours of gameplay","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"RSK Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20807,"name":"Pulstar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a97/a97e2f8c69473c216d9f28f12e6724ce.jpg","description":"Pulstar is a fast paced arcade game that brings back the basic of its genre. No nonsense, just kill as long as you can to gain the highest score as possible! This concept gives Pulstar the challenge and high replay value real fans of this genre need!\nPulstar also has a local co-op multiplayer, which means you can team up with your buddy to dominate the world rankings!\nKey features:\n- easy to play, hard to master concept\n- build up audio and visual experience as you kill more\n- activate Pulsetime to slow down the time around you\n- local co-op multiplayer\n- battle against the world with online leaderboards (single and multiplayer)\n- dual analogue control support\n- including Steam achievements and Steam gamecards\n- available for Windows, Mac and Linux","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Concave Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20094,"name":"Warehouse and Logistics Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb8/fb8b205815c81e6d6cb0fe5305dd244f.jpg","description":"Are you ready for your new challenge? Get ready to take over the control of your original \"Jungheinrich\" Forklift! Just the best drivers will level up in the Highscore list. The fastest drivers will receive a special bonus.\nEnjoy the game in full 3D and feel the realistic driving experience. Varied scenarios like the warehouse, construction zone or port zone guarantee variety.FeaturesOriginal \"Jungheinrich\" Forklifts\nHuge variety of quests\nDifferent game modes\nRealistic physics\nDifferent detailed 3D Scenarios like supermarket, port or construction zone","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"app2fun","platforms":[{"id":0,"name":"PC"}]},{"id":19832,"name":"Full Tilt Poker","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b2/7b21b40865b0eed9636a3d04c0e3584a.jpg","description":"A world of competitive poker awaits at Full Tilt Poker .net\nPrepare to join eighty thousand players each week at our FREE-to-PLAY Texas Hold’em poker tables. With the 5,000 free chips you’re credited with every day as a Full Tilt player, you can experience the very best in online poker absolutely free.\nCard-players can discover a new favorite pastime among our wide variety of poker game types and our play money games help new players learn and hone their skills in one of most legendary card games ever played.\nAs one of the world’s leading online poker rooms, we pride ourselves on delivering multiple gaming opportunities for players who enjoy every aspect of poker. Use your chips to play a wide range of poker variants including:\nTexas Hold’em\nPL Omaha\n6 Card Omaha\nRazz Poker\nStud Poker\nDraw Poker\nWhen you hit our tables you can try any of the following, and more:\nHigh-speed Rush Poker\nJackpot Sit & Go Tournaments\nMulti-Table Tournaments\nDeep Stack and Super Stack Tournaments\nRebuy Tournaments\nShootout Tournaments\nFull Tilt Poker .net’s dedicated Support team works 24/7 to assist you with any issues you have. It takes just few minutes to set up your free account and get into the great games on offer. Simply select one of our fun avatars, join a table and prepare to play.\nSo, what are you waiting for?\nNote: This is a play-money game and whilst you can make in app purchases to top up chips, real-money gambling is not facilitated.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rational Social Projects","platforms":[{"id":0,"name":"PC"}]},{"id":18593,"name":"Poly Runner VR","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/418/4183b3462714d39e8ddfc504f538e47b.jpg","description":"Try your hand at the VR spaceflight challenge reviewers have dubbed “not a hurl fest!” Enter a world full of immersive alien landscapes through which you must navigate at high speeds, using lightning-fast reflexes to score points and earn your rep as the ultimate starfighter pilot. How long can you survive?\nPolyRunner VR is an addictive, high-quality experience that tests your skills against an other-worldly, ever-changing landscape rather than testing your ability to maintain control of your stomach. This engaging virtual world offers more interesting, challenging terrain the further you progress. All the while, you can collect bonus points for your precision by navigating through checkpoints and utilizing boosts to give you an extra edge. The intuitive controls make it easy for anyone to compete in this spaceship runner, but mastering flight skills is a feat that will earn you a place among the top guns and make you worthy of a personal theme song that would inspire jealousy in any maverick pilot. Will you accept the challenge?\nFeatures:\nA spaceflight runner designed to put your skills to the test\nIntriguing, immersive landscapes that change as you progress\nCheckpoints and boosts that help you earn even higher scores\nAn incredibly comfortable VR experience\nMultiple control options to suit your preference\nIntuitive and easy to learn, but challenging to achieve top scores","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lucid Sight","platforms":[{"id":0,"name":"PC"}]},{"id":18321,"name":"Sierra Ops","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27f/27f2a58992ddc8a15815e1f0a2c36408.jpg","description":"Set in the distant future of 2406, Earth and the colonies of Mars are at the brink of war. Play as Lieutenant-Commander Junius Fahrenheit onboard the Sierra as him and his crew are forced into a fight that will define the future of mankind altogether.\nHumans outgrew Earth. After nearly decimating the planet over two hundred years ago, mankind has taken to expanding into space itself. With the invention of efficient, terraforming technology, self-sustaining, man-made ecosystems and reliable space travel, large off-planet colonies and mining posts were soon established to feed the ever-growing human population. The power of the human race grew. However, with power comes corruption. With corruption comes imbalance. With imbalance comes unrest.\nWith unrest comes war.\nPlay as Lieutenant-Commander Junius Fahrenheit, a soldier of the United Terran Vanguard onboard the state-of-the-art mining ship, the Sierra, as him and his crew are thrown into humanity’s first interplanetary war. Tasked in protecting Earth and freeing its colonies from under the Ares Confederacy of Mars’ grasp, there’s no question that he must fight to protect everything he stands for…\nBut what exactly is it he stands for? Who is right? Who is wrong? Does it even matter?\nPerhaps there’s more to this than meets the eye.\nGame Features:\nReal time strategic gameplay controlling up to five units.\nOver 20+ units to collect\nAnimated sprites during Visual Novel sections\nEarly branching story\nUnlockable content\nSix characters to befriend and get to know\nThree romance options\nMedium-Sized Open Overworld to explore","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Innomen Productions","platforms":[{"id":0,"name":"PC"}]},{"id":16565,"name":"Gods vs Humans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f4/3f4092e37ee06f362a358a0135f56222.jpg","description":"Humans are building a tower to reach the Kingdom of the Gods! Embody one of these divinities to foil their attempts. But, be careful not to kill them with your special powers, because your survival depends on their devotion!\nDiscover a fun universe and loveable characters from great Nordic, Egyptian, Greco-Roman and Japanese civilizations. Embody 20 ancient Gods and show your followers that you're more than just a myth.\nYou'll need brains, a sense of humor and quick reflexes if you want to become a legend!\"\nKey Features:\nPlay 96 different levels full of challenges with 5 legendary mythologies to discover\nFor each level, select one of the 20 epic Gods (Hades, Thor, etc.) and master his powers!\nA fantastic travel through a beautiful cartoon world (Egypt, Scandinavia, Japan, etc.)\nBe careful: Humans are loveable and hilarious characters but they want to enter your kingdom!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":15470,"name":"Overland","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7bf/7bfa86577bbae84c0ba92e5f07937dcc.jpg","description":"Overland is squad-based survival strategy game with procedurally generated levels set in post-apocalyptic North America. Every random level is full of close calls and hard choices, even though the interface is approachable and easy to learn. Manage fuel supplies, weapons, and other items by making the right choices on the procedural roadmaps. A road trip straight into the heart of the cataclysmic event that changed the Earth forever.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Finji","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":14656,"name":"Sig.NULL","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f94/f947714c90ff884ed1bca96ceca8ff9f.jpg","description":"Steam Exclusive OfferATTENTION:\nSteam version of the game has several significant differences from the freeware version. In this version of the game was made a lot of fixes, added some new extra levels and a lot of new gameplay features. By purchasing this version of the game, you will support the developer and it is allow us in the future to release new interesting projects!\nAbout the GameThis is a remake and expansion of an earlier PuzzleScript game, Signal. What I thought was so brilliant about the original is that while the rules never change, the level design is such that your ability to fully comprehend and exploit those rules shifts radically over time. The early levels are trivial to figure out — it looks at first like a standard block-pushing game — but it turns out that even the basic mechanism through which you were interacting with those puzzles works differently than you could have intuited. There are at least five revelatory moments and each delivers a nice little jolt of discovery and recontextualization.\nFeatures:\nPuzzle Exploration\nNon-linear narrative\nDark and mysterious cybernetic atmosphere","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SaintHeiser","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13336,"name":"Ahnayro: The Dream World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7b562c9470a73b95a6e64262b139913.jpg","description":"50 (challenging) puzzles to explore\nDeep Alternate Reality Game\nImmersive audio narrative\nExplore the twisted and troubling world of Ahnayro, where your dreams are haunted by mysterious figures.\nFrom the creators of The Black Watchmen and the team behind The Secret World Alternate Reality Games comes Ahnayro, a narrative-driven immersive puzzle game which draws you into the dream world and surrounds you within an ethereal reality.\nDigging deep into fascinating historical events, mysterious figures and bizarre subjects\nResearching the hidden connections that lie beneath the surface\nExploring immersive, transmedia narratives\nAdvancing beyond the typical gaming experience\nMeandering into unexplored and little understood areas of the human experience\nImmersing yourself in strange, terrifying, and beautiful worlds\nNegotiating the boundaries of what is real and what could be real\nGathering real-world facts and information to guide your way\nYou are gifted with the ability to look beyond the veil of reality, investigating a universe that opens up to you every night, haunting you, beckoning you to solve the mysteries within.\nThe life of the dreamer is in your hands, yet neither you nor she are in control of this magical world; you are at the mercy of mysterious entities flowing in and out of the darkness. Her only hope of salvation is to understand the symbolism of her fragmented visions and confront the evil that plagues her mind.\nAs in any dream, however, this new reality draws from the waking world, and understanding one necessitates understanding the other.\nDiscover the meaning of this obscured reality, unlocked only at night. Discover Ahnayro.\n\nThe dream world reveals itself in fragments. It is up to you to piece together information and discover the hidden meaning behind them. Through a series of research and logic-based puzzles that challenge your knowledge of real-world historical events, figures, art and mythology, you will slowly uncover the identities of those who haunt the dream world.\nExplore the troubled life of the dreamer by day, and uncover the effects of her dark visions through a transmedia storytelling experience deeply rooted in Alternate Reality Game mechanics. Investigate a remote sleep clinic, their mysterious methods and the hidden world of oneironautic research.\nDelve into the twisted logic of dreams through an engaging narrative integrated within the puzzles themselves.\nEthereal visual style, captivating narration and atmospheric original soundtrack from the composer of The Black Watchmen usher you into the unique world of Ahnayro.\nEmploy your knowledge of the real world—historical figures and events, science, established mythology, etc.—or seek it out on the web to discover the meaning behind the dreams.\nMultilayered transmedia storytelling including fake websites, audio messages and bizarre videos hidden across the web","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alice & Smith","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12596,"name":"Vrideo","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/570/5705c9dd0864bfae51c463672110c1e4.jpg","description":"Vrideo is the world's premier platform for immersive video, also known as \"360° video\" or \"VR video.\"  Stream videos, see trending and recommended videos, browse content categories, search for videos and channels, and explore channels.  Create your own account to subscribe to other channels, like and dislike videos, and add videos to your playlists.  Download videos for playback when offline.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vrideo","platforms":[{"id":0,"name":"PC"}]},{"id":11586,"name":"Nevrosa: Prelude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c53/c53b40c7a8d1b9716e0653aeb2d53df5.jpg","description":"Support Nervosa: Escape\nWe prepared three awesome DLCs with different bonuses to the owners.\nIf you want to say \"Thank you\" or \"Great job!\" — here is the best way to do it:\nSupport DLC will keep Nevrosa: Prelude in your library even if you delete the game files.\nWallpaper DLC includes beautiful images from Nevrosa world for your desktop. Plan to update it regularly.\n3D Print Collectable DLC includes Support DLC, one Wallpaper set, and files to create a unique artifact from Nevrosa world — the Cube.We are happy that you like Nevrosa: Prelude; your feedback and videos — that gives us great motivation while making an interesting and unique experience for you.\nThank you all again.\nGexagonVR team.\nNo teleport or other tricksHi, this game doesn't use any locomotion system except one — your own feet.\nYou'll need at least 1.5x2 m. area to play though.\nRedirect walking means we are adapting the scene or your real-world path to a current game situation.\nThat adds a whole new immersion level and takes you deeper into the game process. Just try!\nAnd please, leave your feedback! That's very important for us!\nAbout the GameYou woke up in a strange place — is it a dream or reality? What do you need to do? Are you alone here?\nA sneak peak into Nevrosa world that brings new gameplay mechanics to VR games:\nRedirect walking — we don't use teleport or any other locomotion system. You'll have to do it on your own but don't go beyond your chaperone! You can get on youtube!\nNo jumpscares.\nYou just take things with your hands and only one button is used — press a trigger on your controller to interact.\nOh and you can die. And probably will.\nOriginal puzzles, dark atmosphere and creepy creature and a creepy creature that follows you will help you to prepare for the upcoming full-time escape-horror experience that will finish the story you have started.\nSome more things you'll probably find in Nevrosa: Prelude\nArt deco-inspired environment filled with creepy puzzle machines is waiting to share it’s secrets.\nSurvival horror elements: strange creatures hide in this room… What will happen when you meet?\nAn evil artifact in your hands: why does it follow you? Does it whisper something or is it just in your head?\nDark soundtrack with position sound system.\nDifferent endings: you decide how this nightmare ends.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"GexagonVR","platforms":[{"id":0,"name":"PC"}]},{"id":9686,"name":"A Step Into Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/015/0150d0c4d7a4694932c12c4c7b43a6c2.jpg","description":"A Step Into Darkness is an indie horror game in which you play as a journalist desperate to redeem himself after he made the biggest mistake of his life.\nYour boss sends you to a mission to the woodlands, for you to find and document the most mysterious creature ever witnessed by human eyes, the “Darkness”. Your reward: the life of the only person you have ever loved. This is the first episode of three. It immerses you into the story without throwing you into any intense gameplay.\nA Step Into Darkness - Episode One is a free game that features approximately an hour of gameplay.Story\nMartin Preston is a journalist who made the biggest mistake of his life. In a dark night, he heard noises coming from his garage. He held his pistol tight and investigated. He shot a shadow in the dark, believing to be taking down a burglar. He was mistaken.\nNow, his loved one is in a coma and he will soon run out of money to pay for her treatment.\nHe is contacted by his boss, Adrian Woods, who offers him a chance of redemption. If Martin uncovers the origins of the \"Darkness\", as the grand finale of the \"Earth's Untold Horrors\" series of documentaries, Adrian will cover the hospital expenses of Martin's love, in full.\nArmed with nothing but a camera, Martin must enter the woods and delve into the mysteries surrounding the monster 'Darkness' and its murderous activities. It may seem a suicidal mission, but desperate times call for desperate measures.Key features:\nFull length cutscenes\nExtensive story-line\nFully voice acted characters\nApproximately 1 hour worth of gameplay (Episode 1)\nAn original soundtrack composed by composer Brett James.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"GameOrchard Productions","platforms":[{"id":0,"name":"PC"}]},{"id":9140,"name":"Fort Meow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b78/b7814fea7f5d968ea2924e9a8c52788c.jpeg","description":"Fort Meow is a pillow fort physics-based puzzle adventure involving cats, destruction and a dusty old manor. Upon finding her grandfather’s journal in the attic, Nia is attacked by a barrage of feline assailants. It seems that her grandmother has become a crazy cat lady since last time she visited, so you will need to defend Nia by building a protective fort out of furniture to keep the cats at bay, while deciphering the mysterious tales hidden within the journal.\n\nBuild your own custom pillow fort out of household items to protect you from an onslaught of feline assailants as they tumble and claw their way through. Just be careful that your carefully constructed walls don’t tumble down with them.\nEach item costs you some of your limited window of time before the next onslaught so choose wisely. As you unlock more time you can build more elaborate forts to deal with the increasingly challenging cat-assault.\nBuild and layer your forts with pillows, grandfather clocks, toasters and more. Collect items from around the house using your Grandfather's Move-It-Bot and transport them up to the attic.\nThere are over twenty items to discover, each with a unique property that will help you build the ultimate fortress of protection from the oncoming cat-aclysm.\n\nWhere are your grandparents and why are there so many cats in the attic? Only by reading the pages of your grandfather's journal can you unravel the clues to this mystery - if only those cats would let you read it.\nIt's up to Nia to follow the clues and save the day. Something cat-astrophic could be afoot.\n\nOrange tabbies, majestic chinchillas, dreaded black cats, they are all invading the house and causing mischief. Each type of cat has unique properties and challenges to discover and strategise against. Some are even wearing watermelon stack hats!\nTo succeed you'll need to learn the secrets of every feline assailant and become a master of the kittypedia.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Upper Class Walrus","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":3177,"name":"Overruled!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f988c3507acd138235bb71349658f22.jpg","description":"Overruled is a multiplayer brawler like no other - players change the rules and objectives as they play, directly influencing the dynamics of the game. No two games are ever the same!\nChallenge your friends or take on strangers in both local and online battles with up to 4 people in frantic fights to the finish. The end goal is simple - most points wins - but getting there is where the madness lies! Use over 30 different change ‘em-up cards to completely change the game as you’re playing.\nYou could be playing Swag Bag now, but one of your enemies might change it to King of the Hill… or Fire Tag… Or Smash ‘n Grab…\nEveryone dead? Double the respawn timer! Not doing so well by yourself? Turn teams on! Got the Swag Bag? Double the points you’re earning!\nChange the rules in your favour as you fight, cheat and steal your way to victory with a diverse cast of characters.Features\n9 Mayhem-filled multiplayer maps\n9 Characters each with their own unique VO\n7 Game Types from Invasion to Race to Headhunter\nOver 30 different rules to change with thousands of ways to play\n54 Single Player Challenge Maps\nLocal Multiplayer\nOnline Multiplayer\nSteam Achievements & Leaderboards\nTweakable pre-game options\nOST - Digital version of soundtrack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":981624,"name":"The Witcher 3 REDkit","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cec/cec3bfdf1bcd8e9d49eaece1b8239cf3.jpg","description":"Please note that you are required to own The Witcher 3: Wild Hunt or The Witcher 3: Wild Hunt - Complete Edition on GOG.com in order to purchase and use this product.\nA NEW REALM OF POSSIBILITIES IS WAITING FOR YOU\nAbout The Witcher 3 REDkit:\nThe Witcher 3 REDkit is a modding tool from CD PROJEKT RED and Yigsoft that allows you to customize and expand The Witcher 3: Wild Hunt in ways never seen before. This powerful tool offers advanced features and unparalleled flexibility, enabling you to unleash your creativity by crafting new quests, characters, animations, and more.\nUnleash your creative spirit to bring your own unique Witcher experience to life and share it with the world. Whether you're a seasoned developer or just starting out, The Witcher 3 REDkit offers exciting opportunities for creation — the only limit is your imagination.\nPlease note that The Witcher 3 REDkit is currently only available for PC users, both for creation and installing the created mods. It is free for download by owners of The Witcher 3: Wild Hunt.\nIt's important to note that achieving the full scope of development akin to the original creators may require access to external tools.\nTHE WORLD IS YOURS\nImmerse yourself in the world of The Witcher 3: Wild Hunt like never before. With a plethora of advanced features at your fingertips, you can unleash your creativity and craft an experience that's truly your own — with The Witcher 3 REDkit, you have the freedom to edit almost anything in the game!\nLEVEL UP THE GAME\nThe Witcher 3 REDkit offers you the same powerful tools as the CD PROJEKT RED developers, giving you the freedom to take your ideas to the next level and transform The Witcher 3: Wild Hunt into a playground for your imagination. From crafting new quests, items, weapons, and characters to developing animations, entire storylines, and new territories, this tool empowers you to shape your adventure precisely how you envision it.\nPOWERED BY THE COMMUNITY\nThe Witcher 3 REDkit is more than just a game development tool — it's a love letter to our community! With The Witcher 3 REDkit, you can share your ideas, and inspire others to create a unique gaming experience that is truly your own. We can't wait to see the amazing things you'll do with it, so let's come together and make The Witcher 3: Wild Hunt even more exciting and enjoyable for everyone!","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PC"}]},{"id":850708,"name":"Rise of the Ronin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc9/cc9f5f8f72f386c193dad449f40257c2.jpg","description":"Japan, 1863.\nAfter three centuries of the Tokugawa Shogunate’s oppressive rule, the Black Ships of the West descend upon the nation’s borders and the country falls into a state of turmoil. Amidst the chaos of war, disease and political unrest, a nameless warrior forges their own path, holding the very fate of Japan in their hands.\n\nShape a dynamic story\nAs a masterless warrior – a Ronin, your destiny is your own. See the story unfold in different ways depending on the choices you make and the characters you ally with along the way. Face critical mission decisions – like whether to assassinate or protect key figures, and shape the course of history through a rich multi-choice system.\n\nEngage in deep accessible combat\nFrom the veteran developers of Nioh and Ninja Gaiden – Rise of the Ronin offers deeply engaging yet accessible combat, with layers of complexity suitable for any playstyle. Face your foes with a selection of close-quarters weaponry or engage from afar with authentic period firearms.\n\nExplore a historically-inspired world\nThe “Bakumatsu” period heralds the end of the Shogunate as a new era begins and East and West collide. Experience this cultural revolution across an open world where you’ll meet the key figures who’ll shape the course of history, and the ordinary citizens seeking a guiding light in the darkness.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Team NINJA","platforms":[{"id":0,"name":"PlayStation 5"}]},{"id":816323,"name":"Deadlink","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb2/eb2c07b427bbf3de0b33742a7c1c47ad.jpg","description":"Get ready to put a sizable dent in the profits of megacorporations in Deadlink, a guns-blazing cyberpunk FPS with roguelite elements. Your mission is to conduct covert ops while piloting a humanoid combat shell. And no, \"covert\" doesn’t mean \"quiet.\"","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Gruby Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":753932,"name":"JoJo's Bizarre Adventure: All-Star Battle R","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6f3/6f34131554c961f0ff37ed476e939252.jpg","description":"All JOJOs Unite! Fight for Your Destiny!\r\n\r\nWell known for its charismatic heroes, striking art style, and unforgettable catch phrases (“Yare yare daze…”), another installment of JoJo’s Bizarre Adventure is coming! JoJo's Bizarre Adventure: All Star Battle R!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":651320,"name":"MELTY BLOOD: TYPE LUMINA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f5/5f5823e3eba2d204ad0500e24e9e6dbf.jpeg","description":"* This set contains both the MELTY BLOOD: TYPE LUMINA game as well as the MELTY BLOOD ARCHIVES content. Please be careful not to purchase multiple copies of the same item.\r\n\r\nEarly Purchase Bonuses:\r\n- Additional Content: Arcueid Round Announcements\r\nThese bonuses will be available to download for free until October 27.\r\nCustomers who purchase the game after October 27 will be able to get the bonus content as paid DLC.\r\n\r\nGame Details\r\nMelty Blood is reborn.\r\nThis is the latest addition to the series of 2D fighting games based on TYPE-MOON's visual romance novel, Tsukihime.\r\nThe curtain rises once more on dramatic battles played out with familiar characters from Tsukihime -A piece of blue glass moon-.\r\n\r\n◆ All-New Stories, Visuals, & Characters\r\nExplore an all-new MELTY BLOOD world from scenario writer Kinoko Nasu, based on the events of Tsukihime -A piece of blue glass moon-.\r\nUnique story events for each character give each playthrough its own feel, adding to the overall experience.\r\nVisuals have been updated with HD graphics, and include animation sequences by A-1 Pictures for special attacks.\r\nDialog is fully voiced and will change depending on which characters are brought into battle, giving more insight into the characters' interpersonal relationships.\r\n\r\n◆ Iconic Battle Systems\r\nUse characteristic Melty Blood mechanics such as Aerial Combos, Shields, Magic Circuits, Arc Drives, and Last Arcs, as well as a few new powerful techniques under the Moon Skill system. On top of that, an all-new simple control system has been implemented to make the intense battles a little more manageable, while also maintaining a balance which will allow both seasoned veterans and new players alike to fully enjoy the world of Melty Blood.\r\n\r\n◆ Rich Customization & Gallery Feature\r\nCustomize your title, profile icon, and character outfits for battle. They can even be used in online matches!\r\nCollect visuals, opening cinematics, music tracks, voices, pixel art, and more in the gallery. You’ll even be able to take a look at guest illustrations created by artists connected to TYPE-MOON titles.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Tamsoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":459020,"name":"Hylics 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be7/be711015819e7fc402c502c3ec26f4c7.jpg","description":"Hylics 2 is a recreational program with a unique graphic style and droll scenario.\nThe tyrant Gibby’s minions seek to reconstitute their long-presumed-annihilated master. It’s up to our crescent headed protagonist Wayne to assemble a crew and put a stop to that sort of thing.\nFeatures:\n-A mesmerizing visual style incorporating stop-motion animation, 3D-scanned clay models, and pixel art.\n-Engage in turn-based RPG combat against over 25 adversaries, each with unique capabilities and behaviors.\n-Gather Wayne's crew and explore 3D environments. Use air-dashing, rolling, and gliding to find hidden treasures or evade enemies. Consult the world's inhabitants for hints, lore, and musings.\n-Find TVs throughout the world to learn exciting new battle abilities like Poromer Bleb and Soul Crisper.\n-Optional side content including a diverting platformer minigame and a first-person-view dungeon-crawler.\n-The followup to 2015's Hylics. Hylics 2 uses motifs from its predecessor, but players unfamiliar with Hylics may still fully enjoy Hylics 2.\nRequirements\n- 8GB of RAM is required.\n- 4GB HD space.\n-Processor capable of 2Ghz or better.\n-Minimum Resolution 1280x720. 16:9 aspect ratio needed for fullscreen.\n-Tested in Windows 7, 10, OS X Mojave, and OS X High Sierra.\n-Not currently compatible with OS X Catalina, because I do not yet have an Apple Developer ID. Soon.\n-Please note: Steam keys for Hylics 2 are available here only to those who purchased it during the beta period.\n-Support is available via...\n-the semi-official Hylics Discord, at https://discord.com/invite/vBgbSxt\n-The Hylics 2 Steam forum, at\nhttps://steamcommunity.com/app/1286710/discussions/2/","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Mason Lindroth","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":370240,"name":"Hot Brass","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/947/947a8ab17f739a1b274540a41a6ba3a8.jpg","description":"Think before you shoot; all shots are fatal.\nExperience the gritty, high-risk world of the elite SWAT operator. When SWAT gets the call, everything else has failed: you and your team are the last line of defense.\nFeel the pressure of every split second decision with up to four players in local and online co-op. Work together to coordinate your tactics and learn from your mistakes. With a range of weapons and equipment to unlock, a non-lethal resolution is always the goal, but not always easy.\nUtilise the destructible environment to determine the best approach to a confrontation: should you pick the lock, blast the wall, or try and lure them out? Only expert tactics and use of equipment can resolve each unique scenario ideally: with zero casualties and a slew of apprehended hostiles to process (but the police will handle that).\nThe job is tense, and every choice has consequences. But if you can keep a cool head, you have what it takes. Remember: slow is smooth, and smooth is fast.\nNow let's see your Special Weapons and Tactics.Stop those who stop at nothingThe city is bursting with dangerous criminals. Missions range from the suburbs to hardened criminal nests in seedy casinos. Adrenaline runs high as you plan out each mission, and you’ll have to make split-second decisions as the action unfolds.\nRespond to a wide range of scenariosYou’ll be assigned hostage rescues, bomb defusals, raiding criminal nests, serving warrants, and more. Each mission plays out in real time, challenging you and your team to plan, deploy, hone and reflect.\nWeapons and gadgets for every situationYou'll have a range of unlockable equipment to protect yourself and your team. But utilising non-lethal weapons, gadgets and tactics should be your go-to strategy. Saving civilians and detaining the enemies is always the goal.\nProceed with caution, as a team or a solo officerPlay as a team with up to 4 players in online and local co-op, or hone your skills as a solo player.\nCommunication is keyWorking with your teammates may just save your life. Cover each other and confront enemies as a squad to make swift arrests and avoid loss of life.\nMaster or destroy each levelSneak around the level without raising the alarm. Infiltrate by picking locks or blowing up entire walls. Your environment is fully destructible but you’ll need to choose your approach wisely.\nhttps://store.steampowered.com/app/892860/Hot_Brass","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Walk With Kings","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":59026,"name":"The Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a84/a84ee67699f244beb26c25bb9123ee03.jpg","description":"There is only you, the abandoned remains of a former life and the flourishing nature that feels great in the absence of man. This world is both gloomy and empty, but so incredibly beautiful.\nLight is an atmospheric author’s parable about our life, death and loneliness. Explore a mysterious territory filled with a variety of details that reveal the story. Solve logic puzzles and explore text messages.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Носков Сергей","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":53940,"name":"Mega Man 3 (1990)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/adf/adf585204e6bae74797121a9d7345b7a.jpg","description":"Mega Man 3, known as Rockman 3: Dr. Wily no Saigo!? (ロックマン3 Dr.ワイリーの最期!?, \"Rockman 3: The End of Dr. Wily!?\") in Japan and Mega Man III in game, is an action-platform video game developed and published by Capcom for the Nintendo Entertainment System. It is the third game of the original Mega Man series and was originally released in Japan on September 28, 1990. The game localized in North America later in 1990 and in European regions in 1992. Taking place after the events of Mega Man 2, the plot follows the titular hero as he helps his creator, Dr. Light, and a former villain, Dr. Wily, collect parts for a peace-keeping robot by defeating several Robot Masters that have gone haywire.\nA platform-action game, Mega Man 3 follows the same format set forth by its two predecessors. The player, as Mega Man, must complete a series of stages in any order. Defeating a stage's boss will earn the player its special weapon, which can be selected and used at will throughout the rest of the game. Mega Man 3 introduces new gameplay elements such as Mega Man's canine sidekick Rush and the ability to slide along the ground. Unlike with the first two installments of the series, artist and designer Keiji Inafune has considered the creation of Mega Man 3 to be very stressful due to time constraints and his own increased responsibilities during its development.\nFollowing the success of Mega Man 2 released two years earlier, Mega Man 3 has sold 1.17 million copies and has been positively received in critical reviews. Its presentation and gameplay has been especially praised, although many sources found the game to be too difficult. Like other titles in the series, Mega Man 3 has been re-released several times on other gaming platforms, on mobile phones, and as part of various Mega Man franchise compilations.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Capcom","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation"},{"id":0,"name":"NES"}]}]