[{"id":20369,"name":"Legena: Union Tides","genre":"RPG","price":0.0,"description":"IndieGames - \"A solid game with good writing and a lot of hooks to snag the player's attention\"\nTwo Dash Stash - \"Legena: Union Tides definitely feels right at home among the other RPGS of the era that it pays homage to.\"\nHardcore Gamer - \"Legena: Union Tides' charming visuals, catchy soundtrack, classic battle system and fully realized world leaves you wanting more.\"\nGenGAME - \"The game hearkens back to the 16-bit days which is evident by it's style. If you're a JRPG fan it's definitely worth a look.\"\nRetro Gaming Magazine - \"The game will progress based on choices made by you while playing and encounters on the overhead map are readily visible. Those two design choices definitely put Legena in the newer age of role playing games.\"OverviewLegena: noun: A legend that spans an era: the legend of the Narrator\nSolve the mystery of the Narrator! A new take on the classic RPG featuring morale choices, ability equipping and harnessing the weather.\nLegena: Union Tides is the first game of 2D Turn-Based RPG trilogy that takes turn-based combat and adds new ideas and designs to bring a fresh feel to the formula with the blood of the 16-Bit classics coursing through every design.GameplayChoices - While your fate always remains the same, who says you cannot help to change the fates of others for the better? Your choices will affect your allies and foes. Make the right choice and it will motivate your friends. And who knows. You may change the future...\nCarry Your Choices - By importing your saves from one game to the next, you can carry the choices you make and see how it changes the course of history. There is no right or wrong. You must carry the results of your actions with you as you unravel the mystery of the Narrator...\nDynamic Combat - Take part in a dynamic turn-based combat system that tells you who strikes next. Be prepared for fatal attacks and use your enemies attack pattern to your advantage.\nWeather - Harness the power of the weather! Empower your fire spells by making the weather hot. Become shrouded in fog to reduce your foes accuracy. But be warned, they too can use the weather against you.\nSkill Equipping - Made from the Channelling itself. Equip Feathers to use a range of spells in combat and unleash more powerful spells by equipping feathers of the same type!\nDifficulty Grid - Need a meatier challenge? Too hard? Why not use the Difficulty Grid to find your difficulty? You can use the grid to modify Enemies, Rewards and your own SP and CP consumption. Dare you try the Insanity Mode?\nReplayability - With the Difficulty Grid and Choices comes an increase in replay value. And not just because you have more modes and choices to play with. Unlock hidden codes and secrets each time you play a new difficulty mode to discover new content ranging from new weapons to characters and dungeons...StoryHave you seen the Red Sky? And the Green Lightning? Rumour has it that whenever the sky turns red and the land is struck by green, the Narrator appears. A time traveller I hear. You best be a good boy. You best be a good girl. Otherwise the Legena will come true. The Narrator will get you.\nLong thought to be just a childhood monster under the bed, the children of the world sleep quietly and scared of him. Keeping in line and never stepping a foot out of line. But throughout history, records show the Narrator has claimed his victims. His kill tally out-shines any criminal or army.\nOn their way to Dynol and Vesira to bring peace between all lands, Tetiro Aceus runs into a man named Scholar who holds the secrets to the Narrator's downfall. Every question you have he knows. And the Narrator knows it. The Narrator is coming for Scholar. Running from the Narrator, Tetiro Aceus and Atesan Turwin are hired to protect Scholar from the Narrator.\nMeanwhile, other heroes are making a move. An old friend of Tetiro and Atesan's is heading to Dynol to solve a mystery of missing people. A Pirate Lord and his trusty companion are planning to steal a ship. And a toy animal comes to life, not knowing who she is or where she came from. Together, they will solve the rumours that surround Dynol and Vesira.\nLetter from Grandpa Pixel","imageUrl":"https://media.rawg.io/media/screenshots/a26/a2653eaff8f85c618d3215818d106fc7.jpg","releaseYear":2015,"developer":"Grandpa Pixel","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18057,"name":"Demon Hunter 2: New Chapter","genre":"Adventure","price":0.0,"description":"Twenty years ago, in a frightening battle Dawn Harlock stopped the Archdemon Ragnar from descending upon the world. Turns out this was not the end of all the grim mysteries and adventures.\nPLAY THE SEQUEL OF  THE CAPTIVATING \"\"DEMON HUNTER: CHRONICLES FROM BEYOND\"\" HIDDEN OBJECT GAME!\nDawn’s foster father professor Ashmore died when trying to prevent the demon from breaking into this world. She realized than that she is the last remaining member of the mysterious ancient order of demon hunters and the last one standing in the fight against evil  threatening to unravel this world.\nTRAVEL THROUGH 31 HAND PAINTED LOCATIONS FULL OF PUZZLES AND SECRETS!\nHer biggest concern was always to prepare for Ragnar’s return as it was already foretold. But Dawn kept herself busy as a detective, solving paranormal cases around the world and  visiting mysterious places where the dark forces are hiding.\nA  CAPTIVATING STORY PACKED WITH MYSTERIES AND RIDDLES!\nOne day she receives a call from a mysterious doctor Stuart Williams,  who claims to be Dawns foster father’s long-time friend. He promises valuable information about Dawns biological parents that may shed some light on her eerie past shrouded in mystery.\nNEW MINI GAMES AND NOT-SO-EASY HO SCENES!\nDawns put on her detective hat to investigate the  information that threatens to shake the core of her  very existence.  She will embark on a mystery adventure that will change everything forever.\nFeaturesPlay the sequel of  the captivating \"Demon Hunter: Chronicles from Beyond\" hidden object game!\nTravel through 31 hand painted locations full of puzzles and secrets!\nA  captivating story packed with mysteries and riddles!\nNew mini games and not-so-easy ho scenes!\nImmersive gameplay with plenty of hidden objects!","imageUrl":"https://media.rawg.io/media/screenshots/f85/f8509bb64c60edf4b8c1828c728c3330.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17075,"name":"Sky Mercenaries","genre":"Action","price":0.0,"description":"An epic sky battle awaits you! Choose your pilot and fighter to join the ultimate 2D S.H.M.U.P action ! Fight over 50 enemy types on 8 worlds in over 32 story missions and\nunlimited random content. Be prepared for the overpowering enemy fleet and challenging bossfights. Upgrade your fighters, drones and pilots the way you like to play them. Get powerful and permanent visible upgrades, armor and different types of weapons. Level up your pilots and assign skill points in 3 different skill trees to unlock a variety of abilities like auto-shield, critical buffs and more. Join the Mercenaries now!","imageUrl":"https://media.rawg.io/media/screenshots/66b/66bb98d977413cdbdfe171156e58e997.jpg","releaseYear":2014,"developer":"PolarityFlow","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15403,"name":"Alteil: Horizons","genre":"Strategy","price":0.0,"description":"Alteil: Horizons has the structure of a CCG and the flow of a unit tactics game.\nCollectible Card Game Structure -- collect cards, build decks and duel either PvP for ELO ranking or in single player adventure mode.\nUnit Tactics Game Flow -- Field units with resources, no randomly drawn hands. Units have HP, AT, DF, AGI, RNG and take turns, highest agility first. Pick from the unit’s Action Menu -- Attack, Move, Rest, or use special abilities!\nHybrid Tactical RPG / Card Dueling Game mechanics\nCollectible cards with full RPG-style stats, alternate art and story\nStory and Art contributions from famous names in the Japanese game industry\nOver 2000 pieces of gorgeous card art, with more added each month\nPVP dueling / ELO ranking\nSingle player story mode with 20 adventures at launch -- more added every other month\nDuel replays and spectator system\nCore tournament-legal set ensures tight balance\nCard crafting and player marketplace\nWith a little help from our very supportive friends in the Japanese\ngames industry, Alteil Horizons sports creative contributions from\nsome old pros and big names:Story and direction byTAKUJI ASANUMA, director of Star Ocean and Valkyrie Profile.Art and design by...KATSUYA TERADA, concept artist of “The Legend of Zelda”\nHITOSHI YONEDA, lead artist of “The Secret of Mana”\nSHUNYA YAMASHITA, designer of “Final Fantasy X”\nYUJI KAIDA, franchise artist for Transformers, Godzilla and Macross\nFour Gods sleep under the Kingdoms of Men…harness their power!\nIt is you who know the truth of this world. You are one of the chosen few who know of the four Ancient Gods – infinite beings forgotten by history. Each god’s Sphere of Influence still permeates this world -- all living things are subconsciously bound to one of them. Tapping into the Spheres of Influence, you summon and command the might of enormous monsters, epic heroes and arcane dragons to defeat your enemies!\nEach duel brings new challenges, with the huge amount of cards available, you’ll always be up against strategies that push the limits of Alteil’s various gameplay mechanics – such as the day/night cycle and its effects on undead and lycanthropes, the Soul Card system that lets each player fine tune their Life Point total to better compliment rush or combo play styles, and the Revival system that turns extra copies of a unit in the deck into ‘extra lives’ for that unit on the field. Every match also yields exciting treasure drops, to help you build a vast card collection or just fine-tune and perfect your favorite decks!\nIn addition to completing a successful Kickstarter and presenting at the Indie Megabooth at PAX East 2014, we’ve been lucky enough to get some great press for Alteil: Horizons. Here’s what they’re saying:\nKotaku praised the team of artists, saying “Alteil: Horizons is actually an all-stars kind of ensemble title.”\nMMO Attack focused on the game, saying “Horizons combines what players love from their favorite trading card games with RPG elements”\nMassively.joystiq names Alteil a “contender in the ring” in the card combat genre against HEX and Hearthstone.\nThey also put Alteil at the top of their 2013 summer list of crowd-funding projects to watch!\nThe Examiner noted, what “sets this game apart from its rivals is the amount and quality of the game’s art.”\nJStationX calls Alteil Horizons “the next best card-based RPG.”You can also read about us on:\nTen Ton Hammer, BioGamerGirl, ComicBuzz, Gamasutra, Gamer’s Temple, Review the Tech, 2P, AnimeNewsNetwork, MMO Site, and On RPG.","imageUrl":"https://media.rawg.io/media/screenshots/62c/62ca47bdebb8d8c8271885b53bb89a90.jpg","releaseYear":2016,"developer":"Ludeme Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14711,"name":"Racecar.io","genre":"Racing","price":0.0,"description":"Play with other people online! Can you become the fastest racecar?\nYour racecar turns in sharp angles. It creates a trail which follows you and can be used to destroy other cars. Collect fuel to increase your score and speed.\nDownload now and start racing!","imageUrl":"https://media.rawg.io/media/screenshots/b4e/b4e2e42594fd37253016e86d2affabd0.jpg","releaseYear":2016,"developer":"Kastriot Sulejmani","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":13493,"name":"A Sirius Game","genre":"Action","price":0.0,"description":"A Sirius Game is the latest game published by Aldorlea Games (Millennium, Asguaard, Moonchild, Girlfriend Rescue etc.) on Steam and developed by Overcloud9 and Phantasm Games.\nA Sirius Game is a 3D, action-adventure game with RPG elements. It requires the player’s ship to escort other merchant ships to different ports unharmed by the pirates and also trade different items for money. The game is set in a medieval environment with quirky humour and a lot of side quests and fantasy based pirate ships.\nStory - Siriusly, how many games have bored you with a ‘happily-ever-after’ ending? Not anymore! Now you can play the role of the bad guy with bad intentions! It’s siriusly all about Sirius, the rotten apple of our game.\nIt all started on a nice, bright and sunny day. Sirius, the arrogant brat, gets thrown out of his house by his father after a squabble.\nNow he gets set to take revenge of this petty disgrace. Does life finally teach Sirius a lesson? Or is it all lost in his thirst for petty vengeance?\nBest-selling Games Published by Aldorlea and Available on Steam\nMillennium\nAsguaard\nMoonchild\nGirlfriend Rescue\nVagrant Hearts\nUndefeated","imageUrl":"https://media.rawg.io/media/screenshots/ce3/ce3c9853600bc0d14e712a5875298f16.jpg","releaseYear":2012,"developer":"Phantasm Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10183,"name":"Euro Fishing","genre":"Simulation","price":0.0,"description":"Now With Basic Cast Control and Float Fishing\nEuro Fishing immerses you deep into the adrenaline-packed action, fun and beauty of Europe’s most famous lakes. Master your rod, line and tactics, and refine your technique to become a top angler. This is the closest you can get to real fishing from the comfort of your own sofa. Welcome to the Great Indoors!\nWhether you’re a fishing beginner or angling pro, Euro Fishing accurately and authentically replicates the feeling of actual fishing using our unique physics-based casting and reeling system, ‘Total Cast Control’.\nStart by learning the basics of casting with in-game tutorials, or dive straight into one of the five unique European locations included, such as Digger Lakes and the famous St John’s Lake at Linear Fisheries, each posing their own unique challenge to land the big catch.\nUsing advanced AI and customisable environment effects, fish respond to water temperature, time of day, weather conditions and baits as they do in real life. Spot fish ‘shows’ before casting into the right area from a pre-set peg or the lake bank, and customise your angling equipment for the best chance of landing a catch.\nIn Euro Fishing, you can fish by yourself, or compete against friends and opponents in single player or hosted multiplayer tournaments, tracking and comparing catches in real time.\nEuro Fishing – Cast, Catch, Compete!\nBasic Cast Control\nAn entry level (power bar style) casting system for new users to experience the game before trying to master \"Total Cast Control\"\nTotal Cast Control\nA full physics based casting system. For the first time in a fishing game, experience the feeling of casting with real fishing rods from your own PC.\nIntelligent Fish AI\nThe battle of wits between fish and angler come to life with intelligent AI\nCompetition and Tournaments\nChallenge your friends in a multiplayer tournament and compare catches in real time, or compete against AI in our hosted tournaments\nStunning Locations\nFive unique European venues await every fisherman, including real venues such as Digger Lakes and the famous St John’s Lake at Linear Fisheries, all recreated in magnificent detail\nDynamic Weather and Time of Day\nSet weather conditions to reflect real world settings or create your own preferences to affect how fish behave\nTackle Box\nSelect the right angling equipment for the best chance of landing the big catch; choose from a wide range of rods, reels, rigs and bait in thousands of possible combinations\nWatercraft\nRead the water and its features, predict what the fish are going to be doing and cast from the bank or a peg for the best chance of a catch\nFull Steam Controller Support\nImmerse yourself in Euro Fishing with the new Steam Controller, now with full integration\nCutting Edge Technology\nUsing the latest Unreal Engine 4 graphics technology, Euro Fishing looks and feels as close to the real thing\nCreated by Experts\nWorking with carp angling experts, including Korda and Simon Scott, Euro Fishing replicates the experience of real fishing","imageUrl":"https://media.rawg.io/media/screenshots/13b/13bc58f642143c97c3d0a5c1c0f4314b.jpg","releaseYear":2015,"developer":"Dovetail Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10018,"name":"Gravity Sketch VR","genre":"Desconocido","price":0.0,"description":"Gravity Sketch is an intuitive 3D creation tool. Users can create amazing 3D models, scenes, and art work in a fun and intuitive way! For years 3D design tools have been difficult to learn and a nightmare to use. The Gravity sketch user experience makes sense for EVERYONE, in turn lowering the barriers to 3D literacy. You can take your models out of the scene and import them directly into a game or another 3D creation tool. You can also upload your creations directly from the app to SketchFab to share with others in a matter of seconds. Gravity Sketch will change the way we create and share 3D content for years to come.\nCore Features:\n- Create free 3D strokes and straight-line strokes\n- Create revolved surfaces\n- Create planar surfaces\n- Sketch on surfaces\n- Copy and Paste an existing stroke or group of strokes\n- Change color of existing stroke or group of strokes\n- Symmetry\n- Scale up and down the entire sketch as well as individual strokes or group of strokes.\n- Import 3D models and manipulate\n- Take your creations out of our app as an .OBJ","imageUrl":"https://media.rawg.io/media/screenshots/43c/43c304f6eb38acef11b330d1aa763703.jpg","releaseYear":-1,"developer":"Gravity Sketch","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":5412,"name":"Crash Commando","genre":"Shooter","price":0.0,"description":"Crash Commando™ is a fast-paced, over-the-top action game that combines the thrill of multiplayer shooters with classic side-scrolling platform gameplay. Blast your way through expansive, multi-tiered stages on foot or behind the wheel of a tank, or use the all-important jetpack to rain down destruction from the skies. With a host of online and offline gameplay modes, it's always time for action with Crash Commando™!\nDownload the game today!\nKey Features:\n•  Weapons and Explosives Galore – Master an array of weapons, from machine guns, and shotguns to rocket and grenade launchers. Or take control of tanks or deadly turrets to deal even more damage\n•  Fun and Frenzied Multiplayer Action – The intense yet hilarious action never slows with 12 players battling online\n•  Single Player and Multiplayer Modes – Multiplayer modes like Death Match and team-based game modes as well as single player modes like Boot Camp and custom games versus AI-controlled bots\n•  Player Profiles and Trophy Support – A Duty Records Award system, along with Player Rankings, Trophy Support and online Leaderboards, will track player stats and accomplishments\nCrash Commando™ ©2008 Entertainment Products of Sweden AB.  Developed by Entertainment Products of Sweden AB.\nUse of this item is subject to the PlayStation®Network Terms of Service.  If you do not wish to accept all these terms, do not use this item.","imageUrl":"null","releaseYear":2008,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":1369,"name":"Mimic Arena","genre":"Action","price":0.0,"description":"Mimic Arena is a local couch multiplayer platform shooter that focuses on high energy and quick reflexes. Up to four buddies are pitted against one another, but only those who have mastered the arts of jump and shoot dare hope to stand a chance, thankfully you will have some backup. Everything the player does, wherever they go, and wherever they fire; is recorded and then played back again as a Mimic. These clones will be an integrate part of any players arsenal. Providing distractions and supporting fire for new players and enabling more advanced strategy such as zoning and coordinated attacks for veterans.\nThroughout the battle players and Mimics alike will be able to equip themselves with an assortment of weapons such as the reflective disk that travels like a boomerang and reflects projectiles or the Phase Beam that instantly pierces through terrain and all attempting to use it as cover. With the right weapon and these clones can prove to be a dependable ally or a troublesome enemy. Control your shots for precision and efficiency or let them fly wild and embrace the bullet storm that is bound to ensue, just be sure to watch your back.","imageUrl":"https://media.rawg.io/media/screenshots/5b5/5b5a0a0fddb9c85f2a3ccd748be092e1.jpg","releaseYear":2016,"developer":"Tiny Horse Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":420,"name":"Adventure Pop","genre":"Desconocido","price":0.0,"description":"Embark on an epic adventure in this all-new, super-explosive bubble shooter! Ready your cannon, aim the bubbles, and fire away to burst through Adventure Pop!\nA group of adventurers has come together to find new treasures, but not before running into trouble. Help Penelope find her friends but watch out for the pesky pirates!\nWhether you choose to embark on a single-player journey or engage in a multiplayer bubble battle, Adventure Pop introduces an explosive experience that’s easy to learn yet difficult to master.\n• Unique single-player campaign that is full of adventure and bubble-bursting fun\n• Explosively fun multiplayer matches with friends or competitors\n• Eye-popping visuals that combines classic bubble shooter gameplay with HD graphics\n• Collect special boosters and super abilities that help you on your journey\n• Unlock characters that wield unique magical powers\n1 player\nNetwork Players 2-2\n14MB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n505 Games and the 505 Games logo are registered trademarks of 505 Games S.p.A. All other marks and trademarks are the property of their respective owners. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/8a1/8a1d8cb1d53f723795150e580c0c3c6b.jpg","releaseYear":2017,"developer":"505 Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":972077,"name":"Gatekeeper: Infinity","genre":"Action","price":0.0,"description":"Add to Wishlisthttps://store.steampowered.com/app/2106670/Gatekeeper/\nAbout the Game\nhttps://store.steampowered.com/app/2106670/Gatekeeper\nGet ready to embark on an epic quest to recover the stolen Heart of the Universe on two different planets across twelve challenging locations.With 4 unique and playable characters to choose from, you can customize your gameplay experience and play to your strengths. Each character offers a unique set of skills that can be upgraded through 45 different upgrades to help you on your journey.But beware! You will face fierce resistance from 20 different types of enemies, each with its own unique abilities and weapons that will challenge you at every turn.Join forces with friends to fight against the machines in co-op mode.\nJoin the battle to recover the Heart of the Universe and become the ultimate Gatekeeper!","imageUrl":"https://media.rawg.io/media/screenshots/b3f/b3f9b2e55ef52a1c2afdb7038a279d39.jpg","releaseYear":2023,"developer":"Gravity Lagoon","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":881223,"name":"ZERO Sievert","genre":"Action","price":0.0,"description":"JOIN THE DISCORD\nAbout the Game\nThe world has ended. ZERO Sievert charges you with scavenging equipment across multiple areas, all set in an atmospheric fictitious post-apocalyptic Eastern Europe setting. Your base of operations, the bunker, is filled with traders, modding stations, and areas to make your own, providing you with progression across your excursions into the wild.\nOnce you’re out in the wilds of the wasteland, however, the situation becomes a lot less secure. Across the five biomes of the game, you’ll initially be armed with little more than a gun and a bottle of water, after which point it’s up to you to recover items, take out bandits, and most importantly, get back alive.\nAnd be warned; the nuclear fallout may have impacted some of the local wildlife…\nA wasteland to exploreProcedurally generated maps make every journey to the Forest, Mall, or Makeshift Camp different, with ever-changing hiding spots, loot locations, and layouts. Adapt and learn the secrets of each map to get in, get out, and get better.\nFull weapon modificationHunt in a way that suits your playstyle, with over 30 unique guns and 150 mods that can be combined to make you the biggest threat in the wastes of ZERO Sievert. Create a weapon that suits your style or focus on stats to become the ultimate hunter.\nLooting and questingMultiple questlines guide you through the world of ZERO Sievert. Through talking with a range of characters you’ll slowly unravel information and lore about the world that’s been left behind. Alongside this, there are more than 100 different items to loot which can be used to craft new items, upgrade your own base, and trade.","imageUrl":"https://media.rawg.io/media/screenshots/914/914c55502794511f49728d015ffe1e16.jpg","releaseYear":2022,"developer":"CABO Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":839131,"name":"FreshWomen - Season 1","genre":"Adventure","price":0.0,"description":"You’re a young man trying to find out what happened to your father. But in doing so, you ended up having an accident that erased some of your memories. Now, with a clean slate, you moved to another town to start college. In your freshman life, you will meet several girls in a new world filled with fun, mystery, and sex.\nFreshWomen is a choice-driven adult Visual Novel featuring:\nOver 7 000 static images and more than 150 animated scenes\n8-10 hours of game\nAn engaging mystery\n145 songs\nPlenty of lewd scenes with various girls\nEpisodes 1 - 5Uncover the secrets from your past\nUnravel a deep and mysterious conspiracy about your past, with twists and turns, and lots of memorable characters.Date the girl (or girls) of your dreams\nMeet up to 8 love interests in an interactive dating environment, where every choice matters in building your relationships! Each girl has a unique personality, taste and style!Build your harem\nIf you’re up to the ultimate challenge, you can try and build the ultimate harem! Different girls, each with their own body, likes and dislikes, and, of course, fetishes...\nFreshWomen: Season 2, and future seasons, will continue the story and be released and sold separately as DLC.","imageUrl":"https://media.rawg.io/media/screenshots/348/348920cdd2904fd5dd1261efdfcf76ef.jpg","releaseYear":2022,"developer":"Oppai-Man","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":825360,"name":"Incremental Epic Hero 2","genre":"Adventure","price":0.0,"description":"Incremental Epic Hero 2 is a reimagining of the original Incremental Epic Hero. A mixture of incremental/idle and roleplaying game set in a fantasy world filled with monsters and things to explore.Real Time CombatWhile playing as one of the six available characters, the battle continues on non-stop! Venture further into the world to encounter new monsters, better equipment, and complete quests to continually grow stronger.World MapThere are whole new regions to explore and an expanded variety of monsters to face. Fight your way through armies of slimes, spiders, foxes and more! Each region grows more difficult than the last, and with the power to prestige the areas you've already visited, you can keep all content relevant no matter where you are at in the game!\nNew Town SystemBeginning with the Statue of Heroes, grow and expand the buildings in your town to unlock access to new features and expanded content!\nFeatures6 characters each with their own set of upgradable skills that can even be shared and used by other characters\nNearly every monster in the game is capturable. Level them up to improve their unique special abilities\nCraft dozens of different potions with Alchemy as well as dozens more various enchantment scrolls to power-up your equipment\nHundreds of various upgrades that allow you to progress harder and faster\nPrestige your characters to gain powerful boosts to allow them to grow back even stronger\nPrestige even the whole world with World Ascension to unlock even more content and new even more powerful boosts\nArea and Dungeon Prestige to keep those older areas relevant and meaningful\nOver an hundred different pieces of equipment to collect and improve\nChallenges Bosses return along with an entirely new set of engaging set of challenge battles\nCarefully crafted and balanced with the aid of our beloved Discord community\nWe'd love to welcome you to our Discord community to discuss the game, get tips/tricks, and maybe find your soulmate?\n- Discord Server\n- Hapiwaku Website (Bonus Code is here!)","imageUrl":"https://media.rawg.io/media/screenshots/de0/de05bd809aa3d6aa7c73819bfc8715d2.jpg","releaseYear":2022,"developer":"Hapiwaku","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":782296,"name":"Jack Move: I.C.E Breaker","genre":"Adventure","price":0.0,"description":"https://store.steampowered.com/app/1099640/Jack_Move/\nJack Move is a JRPG that features a unique blend of gritty cyberpunk story telling, turn based battles, and beautiful modern pixel art. Coming to Steam in 2021.\nTake on the role of Noa: A young vigilante hacker from Bright Town. As the overreaching mega-corporation, Monomind, kidnaps her estranged father, Noa has no choice but to get him back, before it's too late. Help her find her dad, as she finds herself on the way.\nNoa won't be alone on her journey. She'll be helped out by her best friend and tactical planner, Ryder, as well as her Martini drinking uncle and ex-corporate spy, Guin Blakely.\nJack Move features beautifully animated, exciting and tactical turn based battles.\nCustomise the software of your Cyber Deck to switch roles mid battle, balancing offence, defence and buffs. Choosing which software you load during  battle is the key to victory! Hardware upgrades can help boost your stats, increase the amount of software you can install or give Noa extra abilities.\nGorgeous “Hi-Bit” pixel art inspired by retro RPG’s and enhanced with modern techniques.\nBattle your foes in cyberspace. Take them down using a multitude of sweet hacking software.\nExplore the dangerous world of Monocity-1 and take down Monomind, the evil mega corporation that controls it.\nPlay as Noa Solares, a sassy hacker out to save her father and the world.\nFight your way through a bunch of dungeons filled with allsorts of cyberpunk villany. Street punks, gangsters, corporate militia, secret service agents, and horrific cyber-experiments-gone-wrong will all be battling against you!","imageUrl":"https://media.rawg.io/media/screenshots/bf9/bf9cf45c0eef1f8fe7921e9ec4766e39.jpg","releaseYear":2022,"developer":"So Romantic","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":579517,"name":"Total War: ROME REMASTERED","genre":"Strategy","price":0.0,"description":"Total War: ROME REMASTERED lets you relive the legacy that defined the award-winning strategy game series. Remastered to 4K with multiple improvements to visuals as well as refinements to gameplay, it’s time to revisit a true classic. Not everyone gets a second chance to conquer the Roman Empire.\n\nROME REMASTERED includes the Alexander and Barbarian Invasion DLCs, as well as a copy of the original ROME: Total War Collection*, if you don’t already own it.  \n\n\n\nImproved Visuals\nROME REMASTERED brings the classic Rome visuals up to date, with 4K optimization, ultra-widescreen and native UHD resolution support. This visual upgrade extends across a multitude of features, including re-modeled buildings and objects, and environment effects like dust clouds and heat haze. The refreshed campaign maps also boasts new high-resolution models, and units have been remodelled and retextured to look their very best on the battlefield. \n\nModern Features\nROME REMASTERED includes a host of modern features and improvements to existing mechanics. The in-game camera has been enhanced, including map rotation and wider zoom level in Campaign mode. Heat maps and new icon overlays have been added for gameplay mechanics such as diplomacy and security. In Battle, the new tactical map, unit displays and range markers give you greater command over Rome’s battlefields.\n\nEnhanced Game Mechanics\nPlayers can now expand their armies and experience 16 additional factions that were previously locked, giving a grand total of 38 playable factions. In a first for Total War, you can now take your favourite faction to battle against friends in cross-platform multiplayer between Windows, macOS and Linux. A whole new agent type has also been added to the fray; Merchants can be sent all over the world to create trade links, access resources and buy out rivals to increase your income and assert your faction’s economic power.\n\nHalf-Price Offer\nTo celebrate the return of Rome, we have an offer for those loyal fans that already own the original game on Steam. If you already own ROME: Total War, you can purchase ROME REMASTERED for half-price until May 31st, 16:00 PDT.\n\n*Please note, ROME: Total War Collection is only playable on Windows and will not be available to play until the release of ROME REMASTERED.","imageUrl":"https://media.rawg.io/media/games/b5f/b5ffd063f3398b7718fcf3c407d257ea.jpg","releaseYear":2021,"developer":"Feral Interactive","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":551148,"name":"Tavern Master","genre":"Strategy","price":0.0,"description":"Design and build your own medieval tavern!\r\nBuild a tavern from the ground up in any way you imagine it! It can be a classy place meant to serve kings or a restaurant which specializes in great food.\r\nOptimize your seating arrangement to allow your staff to be as fast as possible, upgrade and expand to attract even more patrons and spread your business to include a hotel, a weapon shop and maybe even a medieval food delivery service!\r\nIn order to keep your customers happy you will need to have enough food and drinks at all times, efficient staff, great decorations and proper lights. Combine all of that with your imagination and your tavern might be the best in the kingdom!","imageUrl":"https://media.rawg.io/media/screenshots/a1f/a1f908b6da443daca7ec7c51434815c3.jpg","releaseYear":2021,"developer":"Untitled Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":505816,"name":"Cats Organized Neatly","genre":"Casual","price":0.0,"description":"Welcome to Cats Organized Neatly!\nSo, you have decided to become a crazy cat person.\nOr you just like cats?\nIf that’s the case you are definitely at the right place! Because we have cats! 32 of them to be exact. They come in all shapes and sizes and… we’ve kinda lost track of all of them.\nIf you could take some time and just help us organize the little ones. Just pick them up and place them on the grid over there.\nAnd don’t worry, they won’t bite even if you rotate them a bit.\nKEY FEATURES\nCats\n32 unique hand drawn cats for you to befriend, collect and organize (neatly).\nHandcrafted Levels\nThe games come with 80 handcrafted levels which will hopefully tickle your brain.\nSimple Controls\nThe game can be played by just clicking the left and right mouse buttons, which makes it very accessible for newcomers or seasoned puzzlers of any age.\nRelaxing Music\nCats Organized Neatly has relaxing background music, resembling the atmosphere of a Cat Café. Sit down and pet some cats.","imageUrl":"https://media.rawg.io/media/screenshots/e84/e84c9c64c748a5a0402b312510d91dc1.jpg","releaseYear":2020,"developer":"DU&I","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":354716,"name":"WGT Golf","genre":"Simulation","price":0.0,"description":"The most realistic free golf game loved by millions of players all over the world. WGT Golf features iconic courses like Wolf Creek, Pebble Beach, St Andrews and more. Proud to be part of the Topgolf family! This sports game is a full game simulation built with the best GPS and 3D technology. World Golf Tour players can use their existing web accounts and virtual golf equipment.Golf Courses Over a dozen championship golf courses, including: Pebble Beach (2010 USGA U.S. Open), Chambers Bay (2015 USGA U.S. Open), Bandon Dunes (Golf Digest #1 rated resort), Bethpage Black (2009 USGA U.S. Open), Celtic Manor (2010 Ryder Cup), Congressional (2011 USGA US Open), Harbour Town (PGA RBC Heritage), Kiawah (2012 PGA Championship), Merion (2013 USGA US Open), Olympic Club (2012 USGA U.S. Open), Pinehurst (2014 USGA U.S. Open), St Andrews (2015 British Open) and Valhalla (2014 PGA Championship)Golf SimulationUse different golf shots to swing, drive, chip and putt from various lies on the tee, fairway, greens, rough and bunkers in this realistic 3D golf simulationGame FormatsFull 18-hole stroke play with putting, 9-hole closest-to-the hole and 3-hole stroke play golf game formatsHead-to-Head Multiplayer ModeCompete in real-time stroke play golf games against other players, invite friends to play, chat live and learn how to playTopgolf ModeGet the Topgolf experience wherever you are with the Topgolf multiplayer game mode, competing with up to six players to score points for hitting targets in the outfield based on a unique scoring systemCountry ClubsJoin a private country club community, play in club tournaments and events, and earn special rewardsGolf TournamentsSpecial tournaments with prizes including the Virtual U.S. Open, WGT Virtual Tour on Golf Channel and paid Ready-Go tournamentsGolf EquipmentPlay with upgraded virtual golf clubs and golf balls from Titleist, Callaway, Ping, TaylorMade and other top sports equipment brandsGolf AccessoriesPopular options like Putter Pal, Shot Pal, XP Boost, Level-Up Boost, in-game Hole-in-One Challenges and more","imageUrl":"https://media.rawg.io/media/screenshots/e65/e65486857c9521f677a4b27a2600b75a.jpg","releaseYear":2013,"developer":"WGT","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":251514,"name":"Inkulinati","genre":"Strategy","price":0.0,"description":"Inkulinati is a turn-based strategy game about illuminated animal battles full of eccentric humour.\nIn Inkulinati you take on the role of a medieval illuminator, who uses the Living Ink to paint and command an army of creatures in order to defeat numerous opponents and become the Master Illuminator.Key features\nUnique setting. Medieval marginalia are the source of endless inspiration, amazing creativity and a tint of madness.\nTurn-based strategy bursting with eccentric humour. Besides attacking you can sing, bark, purr or play a trumpet with your bum - all to take advantage of your opponent.\nSpecial actions performed by the illuminator. Use your fists to smash your opponent's troops, draw obstacles or relocate your units.\nLiving Ink. The most important resource in the game, left by defeated troops. Collect it and be sure to paint reinforcements for your army.\nCampaign. In the campaign mode, the player will face AI-controlled adepts of illumination, who stand in the way of becoming the Master Illuminator and entering the final duel with Death herself.\nCharacter development. Earn experience points with each duel to upgrade your workshop, unlock new units and actions for the illuminator’s hands.\nCreating a story. With each battle, a story is written to celebrate all epic deeds that happened on the battlefield. You can see the story coming to life and filling the empty spaces of the manuscript.\nTurn-based battles in hot-seat, singleplayer or online multiplayer modes.","imageUrl":"https://media.rawg.io/media/screenshots/bbd/bbd491368a1ae4bd5681c824ef872e82.jpg","releaseYear":-1,"developer":"Yaza Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":99004,"name":"NUTS (itch)","genre":"Adventure","price":0.0,"description":"Find out where the squirrel keeps their stash!\nYou have 3 cameras, wired up to three TVs at your hideout. Each night, the squirrel leaves its home, goes to its stash, and returns home. You can place the cameras during daytime, and at night you can watch it run around. Can you find the tree that has the stash?\nInstructions\nWASD: MoveClick: InteractE (at night): End the night earlyE (near camera): Aim <-- this one's not obvious ⚠F: Speed up time <-- use sparingly, you could miss the squirrel!\nWhat we know about the squirrel\nit lives in the orange treeit takes the same route every nightit visits one other tree, this is where the stash is\nHints\nstart by putting your cameras around the orange treeif you wait around near the stash tree, you can shake it be nice to the squirrelyou can leave the night-time early, by pressing [E]\n⚠ absolutely no jumpscares ⚠\nThis game was made for GGJ 2018, at the Reykjavik University site in Iceland. All development and design done by me, Jonatan Van Hove, with help from Marín Björt Valtýsdóttir, Torfi Ásgeirsson and Jóhannes Sigurðsson.\nExternal assets: Unity 2017.3, First Person Drifter, Outline shader, Squirrel model, Clock model, Chair model, Camera model (modified), Lato Font\n🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️\nUpdate history\nv0.6 - Apr 20 - 2018\nFixed a lot of weird squirrel behavior edge-casesAdded rewind/fast forward feature for night time\nv0.5 - Apr 19 - 2018\nImproved tooltips (you can choose if you want to see Keyboard or Gamepad tooltips)Fixed flicker bug when spinning 360 degreesTweaked zoom, walk speedAdded small environment improvementsAdded French translation (Thanks Tyu)Added mouse/gamepad sensitivity optionsAdded menu (press ESC, mouse only)\nv0.4 - Feb 1 - 2018\nImproved tooltipsFixed overlapping trees in one of the scenariosAdded fast forward key (hold F)Added Linux version\nv0.3 - Jan 29 - 2018\nSquirrel picks one of 10 random pathsCamera previews (when near)Camera aim (hold E)Lots of tiny fixes, and pacing tweaks\nv0.2 - Jan 28 - 2018\nFixed fences (can no longer get over them)Fixed squirrel going out of bounsdSlightly increased mapFixed broken TV A on OSXAdded controller support\n🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️🐿️\nKnown issues\nThe game has no audio You can't set mouse sensitivity, sorry :(Use ALT+F4 to quit, also when you win The squirrel behavior is a bit wonky (fixed in 0.3)Player sits inside chair (instead of on) (fixed in 0.2)The squirrel exits the fence briefly, but re-enters (fixed in 0.2)You can exit the fence by trying hard but really shouldn't (fixed in 0.2)","imageUrl":"https://media.rawg.io/media/screenshots/ee4/ee4a77278a15ad93439f964d7c24f98a.jpg","releaseYear":2021,"developer":"Joon","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":61011,"name":"The Light Keeps Us Safe","genre":"Action","price":0.0,"description":"The sky has flickered and gone out. Only The Light can keep us safe.\nAnd you can't stay down there in the depths of the bunker. The food is gone and the power can't last much longer, either. Those things out there in the dark will only take so long to find their way in... It's time to go outside and face what's waiting for you out there. Maybe then you can go into The Light, like the others.\nTHE LIGHT KEEPS US SAFE is a procedurally-generated apocalypse in which only The Light can save us. Use stealth and evasion to avoid terrifying machines that patrol the desolate world, and employ the powers of Light to unpick their deadly traps.\nFeaturing these terrifying and entertainingly bleak things:\nUnique light-based interactions and challenges!\nA sprawling world of stealth, survival, and exploration from the makers of SIR, YOU ARE BEING HUNTED and THE SIGNAL FROM TÖLVA.\nHorrifying and aggressive alien-machine enemies!\nFiendish traps and disturbing hostile environments.\nA procedurally-generated environment, different for each playthrough.\nA grim sense of existential threat (because we're good at that sort of thing...)\nNo crafting though, because we find that a bit dull tbh. Sorry!\nA tremendous sense of satisfaction in overcoming certain doom. You want that feeling, don't you? It's a good feeling.","imageUrl":"https://media.rawg.io/media/screenshots/4a4/4a4cd660c9264bd6882cfba0d217cd85.jpg","releaseYear":2018,"developer":"Big Robot","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":58181,"name":"Starlit Adventures","genre":"Action","price":0.0,"description":"Meet Bo and Kikki the Starlit keepers on Starlit Adventures!  Play 64 amazing levels on Story mode! Infinite Tower, +144 challenges and incredible characters and the mighty Nuru!\n1-4 players\n500MB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nRockhead Games 2018","imageUrl":"https://media.rawg.io/media/screenshots/91d/91d94866a1c6f09851bb30dfca053be6.jpg","releaseYear":2015,"developer":"Rockhead Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":53742,"name":"Castlevania II: Simon's Quest (1987)","genre":"Action","price":0.0,"description":"Castlevania II: Simon's Quest is a platform-adventure video game produced by Konami. It was originally released for the Famicom Disk System in Japan in 1987 and for the Nintendo Entertainment System in North America in 1988. It is the second Castlevania title released for the NES, following the original Castlevania. Set sometime after the events of the first installment, the player once again assumes the role of vampire hunter Simon Belmont, who is on a journey to undo a curse placed on him by Dracula at the end of their previous encounter. With Dracula's body split into five parts after his defeat, Simon must find and bring them to the ruins of his castle to seal and defeat him.","imageUrl":"https://media.rawg.io/media/screenshots/4f9/4f93ab4b7677c626a07f3e5bcb214337.jpg","releaseYear":1987,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"}]},{"id":52594,"name":"Star Fox","genre":"Shooter","price":0.0,"description":"After being banished from planet Corneria, the evil scientist Andross declares war on the entire Lylat System. The commanding officer of Corneria's defence force, summons the elite mercenary team Star Fox to defeat Andross.","imageUrl":"https://media.rawg.io/media/games/618/61863759abf17a7f94fa6ededb6f178b.jpg","releaseYear":1993,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"SNES"}]},{"id":52049,"name":"Coffee Crisis","genre":"Action","price":0.0,"description":"Coffee Crisis is an arcade-style beat 'em up that pays homage to the nineties era of classic arcade and 16-bit brawlers. Play solo or join up with a friend to fight across eight unique locations ranging from your Coffee House HQ to the far reaches of outer space. Go up against an army of wild alien enemies, and the humans that have been taken over by them using weapons, special moves, suplexes, and coffee!\nThe Smurglian race has come to Earth and they're not leaving until they steal our four most prized commodities: our metal music, the best coffee, cat videos, and all of the WiFi. Challenge them through unique and innovative levels inspired by real-life areas. Originally released on a retro platform that needs new games like Earthlings need WiFi, you can now take the fight to your PC. Join Black Forge Coffeehouse baristas Nick and Ashley, two galaxy gladiators called to arms to stop this madness and remove the Smurglian threat from Earth.\nThe Smurgliens can have all of the Rap Metal and Country Pop that they want… but if you don’t help our heroes fend off against the alien-assimilated elderly, bros, cowgirls, and meat head bouncers, they might end up going after good music!\nThis game features:\n- Single or Local Co-Op Play\n- Controller Support\n- Achievements\n- Steam Trading Cards and Badges (Coming soon!)\n- Heavy Metal\n- Possessed Grannies\n- Dangerous amounts of caffeine\nSo grab a hot mug and save the world!","imageUrl":"https://media.rawg.io/media/screenshots/20d/20db0c35e38014ce1960bce757a1e397.jpg","releaseYear":2018,"developer":"Mega Cat Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":50659,"name":"Population: One","genre":"Action","price":0.0,"description":"CLIMB, FLY, BUILD. Battle Royale only possible in VR.\nDrop into a colorful, near future world with limitless combat possibilities. Welcome to POPULATION: ONE, where you and your squad must fight together to survive until the end.\n\nPOPULATION: ONE delivers unparalleled vertical freedom and mobility with its unique Vertical combat System.\nFly through the map to rain down bullets from above.\nClimb anything you see to gain the high ground advantage.\nBuild strategic cover to protect your squad.\nUse your environment to FIGHT ANYWHERE.\nIn POPULATION: ONE, the action never stops with ongoing live in-game events and fresh content to explore.","imageUrl":"https://media.rawg.io/media/screenshots/276/276c0b308c17c6946163a8f324b1b709.jpg","releaseYear":2017,"developer":"Kaan Bukusoglu","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44345,"name":"Star Vikings Forever","genre":"RPG","price":0.0,"description":"Build Your Strategy. Squash Space Snails. Be a Star Viking.\n\nIn Star Vikings Forever you will build your team of spacefaring Vikings to take on the evil scourge of intergalactic snails in a fun and nearly endless stream of challenging puzzles.\n\nWinner for \"Best Game Design\" at the Brazilian Independent Games Festival and “Most Offensive Game Ever” at the Space Snails Game Conference. Star Vikings Forever is a humorous Puzzle/RPG developed by the award-winning creators of Chroma Squad, Dungeonland, and Relic Hunters Zero.\n\nFeatures:\n• Unique Puzzle/RPG Gameplay - Based on teamwork and chain reactions\n• Procedurally-Generated Puzzles - For endless replayability\n• 8+ Hours of Story Mode - Packed with colorful characters and humorous dialog\n• New Game Plus Mode - Brings additional puzzles and gameplay\n• Six Classes - Each with unique, upgradeable skills\n• HATS!!! - Craft special hats and use special items to gain additional boosts\n• Facebook Leaderboard Integration - Compete with your friends for the high score!","imageUrl":"https://media.rawg.io/media/screenshots/ad9/ad9eea67ace9cfee1303ae04ce0b2ac9.jpeg","releaseYear":2016,"developer":"Akupara Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":44220,"name":"Formless Adventure","genre":"Adventure","price":0.0,"description":"Formless Adventure - A platformer that will allow you to spend a few hardcore hours emerged alongside your hero - Mr. Blubstache - a shapeless mass, who can change shape at will. He has a variety of forms, which all have different characteristics and abilities.\nThere are 5 shapes:\nSpeed\nSticky\nSlippery\nFire\nStoneMr. Blubstache has to go through 40 challenging levels to find his clumsy grandmother. But can he?\nFeatures:\nA formless hero, which can change his shape.\nLow poly graphics.\nFunny music.\n40 challenging levels with secret rooms.\nCustomization of the main hero.\nFun comics.\nHours of hardcore gameplay.","imageUrl":"https://media.rawg.io/media/screenshots/696/6964d5eac1b36de1f129a48c1e89031e.jpg","releaseYear":2017,"developer":"Joyous Raccoon","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":36527,"name":"Worms 4: Mayhem","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/735/735ce9b48e4eb119c4d894d8037554ff.jpg","releaseYear":2005,"developer":"Team17 Digital","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":28529,"name":"Dance Central 3","genre":"Simulation","price":0.0,"description":"The Games on Demand version supports English, French, Italian, German, Spanish, Norwegian, Polish, Portuguese, Russian, Swedish, Japanese, Korean, Chinese. This game requires a Kinect™ Sensor. The #1-selling dance franchise for Kinect™ is back with new features and an electrifying soundtrack featuring 40+ new tracks! From ‘70s disco grooves to current chart-topping dance hits, Dance Central™ 3 will have you mastering the biggest dance crazes of the past and the hottest moves of today. With brand-new, party-ready multiplayer modes, “Beginner” difficulty, and an epic Story mode, it’s the biggest dance game yet. Get ready to own the dance floor with Dance Central 3 -- only on Kinect for Xbox 360.","imageUrl":"https://media.rawg.io/media/games/7a2/7a21d9df9ade62663e08d95b8bd05be5.jpg","releaseYear":2012,"developer":"Harmonix Music Systems","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22657,"name":"Blood 2: The Blood Group","genre":"Shooter","price":0.0,"description":"In a time of turmoil and decay, a dark organization with a sinister agenda casts its shadow over the world. But as their plot\nunfolds, an even greater evil pushes its twisted being at the very bindings of reality... Filled with hate and vengeance, Caleb has returned to face the Cabal and its minions once again - and this time he's not alone. Can\nhe hold the Chosen together long enough to reclaim the Cabal and the heart of his one true love? Or will his actions destroy them\nall?Includes original Blood II: The Chosen and add-on package The Nightmare Levels\nAn immersive atmosphere full of dark humor and exciting action\nFour playable characters and wide variety of weapons","imageUrl":"https://media.rawg.io/media/screenshots/02d/02d5df1a78c1b8b19e2db8786befba7b.jpg","releaseYear":1998,"developer":"Monolith Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22467,"name":"Smooth Operators","genre":"Strategy","price":0.0,"description":"Smooth Operators is an advanced simulation where you take control of a call center company and lead it to financial success! Hire employees and customize your buildings with several types of offices, facilities and accessories! Watch your company become alive and grow while your building reach the highest skyline.\nThis won’t be an easy task! Employees will get upset if you don’t consider their well-being. Send them some coaches to cheer them up or arrange their working hours and vacations with Human resources employees.\nEverything is upgradable! Hire projects managers to unlock new technologies, and improve your offices and employees. If your account managers bring you new contracts, pressure your employees with managers to increase their productivity.\nWhat type of CEO will you be?\nFeatures:\n- A highly addictive game with numerous hours of gameplay.\n- Customize your company by placing offices and furnitures where you see fit\n- Upgrade everything! Improve employees, offices, elevators…\n- Killable birds =)","imageUrl":"https://media.rawg.io/media/screenshots/1cf/1cf47078eb79273525496725dff1daff.jpg","releaseYear":2014,"developer":"Heydeck Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21115,"name":"The Shopkeeper","genre":"Adventure","price":0.0,"description":"The Shopkeeper – An Interactive Short\nA desperate man needs to find the right antique to impress a rich relative, but his choice will have dreadful consequences. The Shopkeeper is a point-and-click narrative game set in a space between the Twilight Zone, classic Lucasarts adventures, and Antiques Roadshow.FeaturesFully voiced (starring Jeff Ricketts (Buffy, Angel, Firefly, ST:Enterprise))\nGraphic novel style graphics\nInteractive short co-written by James Wallis (The Extraordinary Adventures of Baron Munchausen & Once Upon A Time game)","imageUrl":"https://media.rawg.io/media/screenshots/0b1/0b1bb5e6bfcfb983af4b57fdce736940.jpg","releaseYear":2014,"developer":"Verse Publications","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20340,"name":"Butsbal","genre":"Action","price":0.0,"description":"Butsbal is a fast paced multiplayer shooter game inspired by pong. Play the four different game modes with or against friends in the local multiplayer or play against strangers in the online multiplayer. The clean and minimalist design puts the focus on the gameplay.\nPlayers will carry up to 5 bullets and will receive a new bullet every 3 seconds or kill. Bullets fired by the players will travel at a constant velocity and will bounce against the borders. Which makes it a hectic but fun shooter. You always have to watch your back!\nFeatures\n- 2 to 8 players local multiplayer\n- Online multiplayer up to 8 players\n- 4 game modes: DM, TDM, CTF and Last Man Standing\n- 8 different levels\n- Xbox 360 controller supported","imageUrl":"https://media.rawg.io/media/screenshots/92f/92ff281a91e0d47f4326681a49c232ce.jpg","releaseYear":2015,"developer":"Xtase Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19573,"name":"The Sun at Night","genre":"Action","price":0.0,"description":"The tide of Soviet power washing across the face of the Earth could possibly have been turned back at various stages of history. But the new energy sources they discovered lit a fire under the Russian war machine. So when Stalin rolled into Paris, the resulting flare-up of global conflict left little more than smoking ash heaps where America and Great Britain had been.\nNow, Stalin is dead. Though resistance movements have emerged, the Soviets still stand supreme as rulers of the globe. Only a force from beyond the earth could possibly tip the balance.\nAbram Krupin, leader of a resistance cell, knows this. When he sees a dog fall from the stars, then, he takes it as an omen. This dog speaks, wears silver armor, and has an arsenal of mysterious weapons. Abram calls her Laika.\nLaika believes that, despite all odds, she can protect the countless lives crushed by the Soviets.\nThe Sun at Night is a 2D action platformer to be released in three parts. All episodes will feature:\n- Massive, nonlinear levels that model the layouts of real locations in a way not yet seen in other platformers\n- Large, choice-rich skill trees that let players approach the game the way they want to\n- A novel defensive mechanic that lets players turn the firepower of Laika's enemies against them\n- Smoothly flowing, fast-paced shooting action\n- A story of struggle and hope, full of twists and revelations\n- Rich, evocative art depicting a world dominated by a technologically ascendant Soviet empire\n- Secrets and rewards hidden in every corner for the determined player","imageUrl":"https://media.rawg.io/media/screenshots/63a/63a10bae6bc83f0e1c8db55d476bb050.jpg","releaseYear":2014,"developer":"Minicore Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19302,"name":"Oscura: Lost Light","genre":"Adventure","price":0.0,"description":"Oscura, the apprentice lighthouse keeper, has accidentally destroyed the Aurora Stone, sending shards across the Driftlands and plunging them into darkness and danger. It’s now up to Oscura to find the shards of the stone and restore light to the Driftlands before the creatures of the dark can destroy it. Fortunately, the accident has fused Oscura’s hand with glowing fire, enabling him to wield powers altering anything the light touches. Each level challenges your puzzle-solving skills and reactions in this modern adventure built upon the time-honoured mechanics of classic platformers.FeaturesMaster the Light: Along your dark journey you’ll find four different powers, each designed to help you through the Driftlands. Destruction, Construction, Gravity and Time are yours to command. Master each unique light power in your dark journey through the Driftlands.\nDiscover the origin of our accidental hero: Oscura wasn’t always the Driftland’s trusty lighthouse keeper. And he didn’t always have his flaming hand. Taking place before the previous Oscura games, Lost Light reveals where our hero’s journey began and the fate of the original light house keeper.\nOld school platformer meets new school design: Taking inspiration from classic platformers such as Super Mario Bros, Oscura Lost Light combines these elements with a modern design aesthetic.\nUse your wits: The Driftlands aren’t for the feint hearted and Oscura’s not a fighter. You’ll need to out-think and outwit creatures such as the Lost Ones, Shagrims, Bewinged, Grymfus, Cursed Skulls and more. Just as challenging are the puzzles you must solve if you wish to survive.\nConfront Evil: Just when you think you’ve succeeded by collecting the shards of the Aurora Stone, you’ll need to face the ultimate challenge and restore the Lost Light … but beware … Mavro the Lord of Shadows awaits. Only by defeating Mavro can you save the Driftlands.","imageUrl":"https://media.rawg.io/media/screenshots/5d1/5d1829a4fecf6cbbc3f921382c1a3642.jpg","releaseYear":2015,"developer":"Chocolate Liberation Front","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":18517,"name":"GunGirl 2","genre":"Action","price":0.0,"description":"Main FeaturesPut Some G-Power In Your Weapons\nGG2 offers 6 main weapons, each has a unique feel, ammunition, an alternate fire mode, a variety of unique power-ups and you can even level them up. Every time you kill enemies, they will drop small G letters. Collect them to power up your weapons to make them more and more deadly over time. But be aware! Each time an enemy hits you, you will lose a certain amount of G-Power.\nExplore New Worlds\nThe game starts off in a small building, from which you have to escape. The more you explore, the more will the world open up. Get more and more items and power-ups that will give you the necessary abilities to reach new places. Find abandoned subway-stations to travel to far-away new places or go through portals and travel across the hellish parallel-dimension!\nPower-Up Your Character\nAnother feature is the Power-Up system. Whenever you obtain special Power-Orbs in the game, you can use them in your status screen to upgrade ascpects, weapons or items of your character. You decide if a weapon should have more power, bigger clip size, faster fire rate etc, or if you need more protection, or better health supplies. Spend your Power-Orbs wisely to become more versatile or focus them to become a specialized killing machine.\nAdvanced Blood & Gore FX\nWhen I go see a zombie movie and there are no bucketloads of blood in it, I would say “Hey mister, cool flick, but where’s the damn blood?”. To avoid such emails from angry players, GunGirl 2 offers a whole ton of high-quality blood effects to please all zombie fans!\nLots of Quests\nThere are several main- and sub-quests in the game. You can get them from surviving npcs or even from unholy items and they have smaller or bigger impacts on the story. They are NOT grind-quests to cheat a longer playtime! That’s a no-go\nHigh Replayability Value\nIf the 4-8 hours of playtime (on normal mode) aren’t enough for your zombiekilling-desire, the game offers a total of 3 difficulty settings (from Normal to Iron Maiden), unlockable playmodes and even a secret character!\nMusic by Josh Whelchel\nThis guy is pure gold. He made some of the most memorable soundtracks for indie-games such as Bonesaw or The Spirit Engine 2 and now he has blessed this game with another awesome soundtrack :)","imageUrl":"https://media.rawg.io/media/screenshots/6a5/6a5c41eaef97cf552bee18204da35277.jpg","releaseYear":2016,"developer":"BlueEagle Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18214,"name":"Cranium Conundrum","genre":"Adventure","price":0.0,"description":"Cranium Conundrum is a physics-based puzzle platformer taking place in the dream worlds that you create!Current Features:An Extensive Level Editor with many gameplay features and physics-enabled blocks/materials\nAn (Early) Save/Load so you can show off your currently in-progress levels to your friends to play and enjoy or for you to finish creating at a later date.\nAn (Early) multiplayer enabled in the level editor for you to create and collaborate level creation with up to 8 players!\nPlayer customization including changing character skin color (and upcoming clothings options such as head-wear and different shirts and pants)\nLogic System that allows you to enable certain events and items based on triggers you place in your level!Planned Features:Publishing finished levels so user don't have access to the level editor content and can only play in the play mode.\nA central hub to upload your published levels filled with screenshots, comments, and ratings for you to share your awesome creative levels!\nFully realized multiplayer with different level types for multiplayer-centric levels such as Capture The Flag, Deathmatch, and Races.\nA story mode where you will play through to get the backstory of the Glia and they're purpose for creating dream worlds. It will include collectibles that you will use to either customize your player or to create in your levels.\nThank you!","imageUrl":"https://media.rawg.io/media/screenshots/3ba/3ba20342206b1c5b2ab3d8897b1e7372.jpg","releaseYear":2016,"developer":"Falling Star Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]