[{"id":10611,"name":"Full Metal Furies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/97d/97d6fdf98d19a05a42df7f6478b658b6.jpg","description":"From the creators of Rogue Legacy comes a \"true-cooperative\" action RPG.  FULL METAL FURIES puts an emphasis on team play with a unique combat system where everyone is important.  Work together to defeat special enemies, string organics combos to deal massive damage, and save a wartorn world that is battling itself to extinction.  Play on the couch or online with friends, and make it a party for up to four players!  Or go solo in single-player, and show off your skills through a Pick 2 quick-switch system that retains all the nuances of multi-play.\nGAME FEATURESWant to play with friends? Get friends first.Up to 4 players can join in on the adventure, both ONLINE and OFFLINE.\nFull couch and on-line co-op supported, and every variation in between. Want to play alone? Expected.The Pick 2 system lets you choose two party members to enter the battlefield.\nUse the Quick-Switching to create dynamic combos, and air-crit enemies.\nAll nuances of co-op are retained.  Everything you do in multiplayer, you can do alone.  There’s no I in Team.  And there’s no I in Full Metal... Furees.True coordination is needed to take down your foes.  Enemies enter the battlefield with coloured barriers, and only allies of a similar colour can shatter them.\nYou must revive your fallen allies.  Barriers won’t break themselves!  Revive bars naturally raise over time, but a helping hand never hurts.\nCooperation, not competition.  No more fighting for last hits, battling for gold, or trolling for health drops.  Everything is shared, so you can focus on working together.Four classes, four different styles of play.Alex the Friendly Fighter – Engages up close with counters and combos.\nMeg the Near-sighted Sniper – Plant mines, shoot from afar, and juggle your enemies.\nTriss the Boxy Tank – Save allies with your shield, or send enemies flying.\nErin the Ovally Engineer – Control the battlefield with her turrets.  She also has a gun!A new take on combat.Experiment with a combat system full of counters, combos, and oval-shaped engineers.\nEvery class has their own unique skill tree.  How many skills?  So many skills!\nDon’t change equipment, change abilities.  Give the Tank a FREEZING SHOUT.  Turn the Fighter’s Leap into a POWER DIVE.  Or just give the Engineer a machine gun.A new take on enemies.The Furies are tough, but the enemies are tougher.  Encounter over 70 different enemies, each with their own unique tells and counters.  No more cannon fodder!\nEnemies come at you at a furious pace, and there’s no rest for the weary.  New threats are introduced in every single stage you play.\nBattle massive Titans in multi-phasic matches that will keep you on your toes.An adventure full of intrigue, twists, and one liners.Travel through the ruined snow-capped town of Thessaly, brave your way through the Foloi Forest, enter the tombs of the Stygian Well, and more.\nBut keep an eye out; there’s more to the world than what is on the surface.  Secrets, clues, and hidden dimensions are scattered throughout!\nDiscover a story spanning over 20,000 words in 6 different languages.\nDiscover 20,000 one liners.AddendumAn abstruse allegorical action adventure about atonement, allusions, and alliteration awaits all at an alternate age around Athens’ ashes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cellar Door Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":3666,"name":"Tales From Space: Mutant Blobs Attack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/76b/76b1760b03a011c015feeac9572ad22d.jpg","description":"Tales from Space: Mutant Blobs Attack is a side-scrolling platformer developed by DrinkBox Studios. The game serves as a prequel to another game by the studio, Tales From Space: About a Blob.\n\n###Plot\nThe game tells the story of the blob who is named Blob. Blob escapes from his own homeworld and ends up on Earth, where he begins consuming everything he finds while exploring the planet.\n\n###Gameplay\nThe players control Blob. At the beginning of the level, Blob is tiny, but when he eats something, he gets a bit bigger. This allows the players to grom Blob to enormous sizes by eating the loosely-placed items in the in-game world. The main objective of the player is to pass a specific obstacle located at every level of the game to complete it. \n\nThe players can use Blob's multiple mutant abilities. For example, he can transform into a rocket for a limited amount of time, stick to walls or even use telekinesis to manipulate the in-game items. \n\nThe game heavily relies on its advanced physics simulation system. The levels are highly interactive, so the question of how to approach a specific level is completely up to the player.\n\n###Style\nThe 1950s heavily inspire the game's art style. Architecture, music, and even this era-specific humor can be found in the game. The game features a distinct animation style which can also be found in the old Batman or Spider-man TV shows.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"DrinkBox Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9962,"name":"Duelyst","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c1/2c1685229a455d3a0affb8cbc78e2d09.jpg","description":"Duelyst is a digital collectible card game and turn-based strategy hybrid. The game has four expansions: Denizens of Shim'zar, Rise of the Bloodborn, Ancient Bonds, and Unearthed Prophecy. \n\n###Gameplay\nIn each round, two players must fight across a tactical battlefield. They take turns in which they play, changing position minions and spells represented by cards.\nThe players aim to build a card deck and move across the field, gaining points and eliminating enemies. The winner is the player who reduces the enemy General's health to zero before they can do so to you. The cards are drawn from a custom built deck. The round continues until one of the players kills the biggest enemy. The game offers a practice mode, puzzle-like challenges, a ranked season ladder, and a draft-style tournament mode. Each match lasts less than 10 minutes, so the game is quite fast-paced. \n\n###Key features\nThere are six factions, each with its characteristics. The factions' appearance and special abilities affect the strategy and gameplay of the decks. There are also more than 700 cards for spells, minions, and artifacts. The Duelyst offers several arenas with various features and design. Every month the game media pages provide lists of power ranking depicting the best custom decks.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Counterplay Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":309190,"name":"Black Survival: Eternal Return","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/199/199b1769522219bb7a20089606a4291b.jpg","description":"What is Black Survival?https://store.steampowered.com/app/690510/Black_Survival/Released in 2015, Black Survival is a real-time PvP Battle Royale game played by 10 players on the Black Island, Lumia. It is loved by its beautiful artwork and various characters, and it is constantly updated introducing new stories and characters.\nIn Lumia Island, which is made up of 22 areas, players try to survive as the Test Subjects been kept in there.\nThere are over 200 items on the island, and you can combine them to create over 400 survival items.\nAvoiding the narrowed-down prohibited areas, the players must craft items with a quick decision to become the last survivor in a competition against the other nine players.\nAll characters have unique skills and main weapons. It is important to choose a weapon suitable for your character to increase its mastery.\nBlack Survival is a game that you can easily enjoy just with a few buttons without any difficult control. BS:ER inherits the merits of this Black Survival and is a new game in a 3D parallel world.\nAbout the Game- Eternal Return -First Victim or Last One...\nThe test subjects eventually will return once more to the survival game.\nExperience the Black Survival in a completely new way!\nThe new 3D Lumia island will let you live through the survival to its fullest.\nExplore Lumia Island where abandoned cities and pure nature coexist.\nThere are various materials needed for survival in the entire island. Find them!\nBe careful, there are many things on this island that might kill you.\nOver 400 different items await you, but you will have to hurry to find it on time.\nCombine hatchet and leather to create a battle axe. and combine motor for Bone Crusher.\nAll items are limited, so you must use them efficiently.\nA variety of Test subjects await you, including the Serial Killer, Jackie, and the clumsy cop, Aya.\nAll Test subjects have their own abilities and masteries. Use them carefully..\nDepending on the experiment subject you choose, you will have a completely different experience.\nKeep moving, and you will move much faster due to increased moving masteries.\nKeep fighting, and you will become stronger than others due to increased fighting masteries.\nWhat masteries will you raise first? Make your choice.\nRemember, only one test subject can become the winner.\nThe stronger does not necessarily win, so take advantage of the situation.\nLet there be glory to the pawns, who reached the end of despair!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"O'olBlue","platforms":[{"id":0,"name":"PC"}]},{"id":51690,"name":"Popup Dungeon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2a/d2a835c5981e7a4541f755a818e44191.jpg","description":"Key FeaturesInsane Customization: Create your favorite heroes, toss a sphere of annihilation at a politician, or turn your cat into a heavy-ordinance hairball launcher, the only limit is your imagination.\nEndless Content: Many games boast procedural content, but Popup Dungeon’s easy-to-use creation systems allow for inexhaustible handcrafted content.\nMultiplayer: Crawl alone or with friends through online or local multiplayer.\nPersistent Gains: Collect charms to power up your party and delve further than before.\nPremiseA strange being, referring to itself as “The Wizard,” has issued humanity a challenge in the form of this game. It is accompanied by a single letter which reads:\nTo the able minds of Earth,\nWhat I am is not important; what I do is important. I challenge beings in contests that play to their greatest strength, and now I’ve come for you.\n\nPut down your wearisome weapons, cast off your boorish bodies, and draw humanity’s sharpest blade: creativity. Wield it against mine, if you dare.\nYou will learn that the difference between fact and fiction is the power to decide which is which. This power I freely grant to you, so that you may pit the mightiest heroes, the most powerful legends, or anything else you can wring from that skull-stuffing you call a brain against me. I await you atop my tower.\nYou may lose as often as you’ll tolerate. But worry not, I threaten no violence; however when I win – and I will win – your creativity shall be my trophy. Without it, humanity is surely doomed to a dim end. But no pressure… after all, it’s just a game.\n-\tThe Wizard\nAdditional Information\nDungeon Master Mode: Try on The Wizard’s hat, and take control of the dungeon.\nFlexible Party Size: The dungeon can be challenged with 1 to 5 characters at a time.\nSandbox Mode: Choose from a myriad of options to create unique dungeon crawling experiences.\nAdditional Tile Sets: Go beyond the dungeon; explore Star Ships, Haunted Houses, Japanese Villages and Castles, Steampunk Airships, Post-Apocalyptic landscapes, and more...\nAccessible Game Play: Very easy to play, deviously hard to master. Designed to be played with a single finger.\nInteractable Props: From Treasure Chests to Vendi-Machines, discover props and secrets that will help shape the course of your crawl.\nCreation Systems: Not just a modding tool; Popup turns game design into a game. In addition to integrated systems that let you automatically turn your 2D pictures into 3D cutouts, clip and fade sound directly from your videos, and position your favorite pictures on ability cards, everything you create is balanced and incorporated by the AI behind the scenes.\nCurrent State of Development\nThe game is in closed Pre-Alpha. The gameplay is working and all of the characters, enemies, equipment, and abilities have been made using the same tools that will be offered to players, though their interfaces are temporary. Our current goal is to develop the remaining elements of a dungeon run such as persistent gains and interactable props before tackling the creation UIs.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Triple-B-Titles","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5445,"name":"PixelJunk Eden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ce/8cea9e18b2ca4453ec5ed36b18466c97.jpg","description":"PixelJunk Eden is a 2D casual platformer as well as the part of the vast series divided into the two periods: Eden takes place within the first period and occupies the third position in it. \n\n###Gameplay\nThe player controls the protagonist, Grimp, on its journey through the meditative worlds. The core gameplay mechanic is traveling by sticking to the objects. Locations called gardens to unlock when a certain amount of Spectra is met. The only enemies in the game are guardians — they can cut the protagonist's web which forces him to fall from the above. \n\n###Story\nThe game does not feature any prolonged narrative whatsoever. The absence of a wholesome storyline is compensated by the sound design, which creates the associations needed for the right attitude towards the game. The in-game mechanics also allow the title to have non-zero replayability.\n\n###Interesting features\nPixelJunk Eden is the first game to support the PS3 trophy system natively — the other titles needed the appropriate patch. It is also the very musical game which is to be experienced through the artwork and sound design, not actual gameplay — Baiyon, the artist from Japan created all of the in-game backgrounds. The soundtrack and design have been largely contributed in by Dylan Cuthbert who has also created the sounds to the other PixelJunk titles.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":428564,"name":"Crysis Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e4/3e42278fa5e9a85f4cd3d3ed4355a9f2.jpg","description":"Crytek’s ground-breaking, critically acclaimed first person shooter is back! Crysis Remastered is coming to PC, PlayStation 4, Xbox One, and Nintendo Switch – the game's debut on a Nintendo platform.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Crytek","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":64491,"name":"Tales of the Neon Sea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5a/f5a3608ff733c22ce719c235fd855a2a.jpg","description":"Welcome to a world of intrigue and suspicion. Where humans and robots contend with escalating tensions and mutual distrust. And where gangster felines scheme their way to the top of the food chain. Welcome to the Tales of the Neon Sea!\n\nBoasting stunningly detailed pixel art, and featuring a twisting story of mystery and suspense, Tales of the Neon Sea is an exciting new adventure from Chinese indie studio Palm Pioneer. Set in a fully realized cyberpunk cityscape, use your wits and puzzle-solving skills to determine the course of this unique tale.\nFollow us on Twitter","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Zodiac Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":4588,"name":"SHIFT 2 UNLEASHED","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e1/4e17decb011b8650d91f208924ad03b3.jpg","description":"Shift 2: Unleashed (Unleashed) Need for Speed: Shift. The sequel expands on many aspects that were introduced in the original.\n\nThe game offers 148 cars from 36 manufacturers and 35 different tracks on which players can compete in several types of races.\n\nThe game is not overloaded with plot details, not directly related to car racing. The main character is a novice racer who wants to become a champion - and that’s it!\n\nThe same approach is seen in many other characteristics of the game. In particular, in the organization of management and in the system of admission to the following levels. Much has been done in these things easier than one might have expected. You need to control different cars in different ways, in full dependence on engine power, front or rear wheel drive, as well as on tuned systems installed on the car, parts and corresponding settings. Even one detail can significantly change the ride.\n\nThe racetracks in the game do not always repeat their real prototypes. However, all changes in the configuration of the tracks are undertaken in order to make the game more interesting.\n\n###Innovations\nAmong the main innovations of the game are: an in-helmet camera, a hot dog.\n\n'Helmet-camera' - allowing you to observe the game through the eyes of a car pilot. The image of this camera, respectively, is completely dependent on the movement of the pilot's head during the race. The camera shakes, tilts when cornering, jerks forward in collisions. And if the car goes at high speeds, the image of the camera simulates the blurring of the field of view, typical of the human vision in similar situations. Finally, if the car and the pilot get into such an accident, in which the camera should break, it breaks and the player’s point of view returns to normal observation.\n\n###Training\nHey, it’s not a bad idea. champion.\n\nIn the career mode, players learn driving skills from reputable teachers, with a total of about ten world-class instructors in the game.\n\nFor example, Vaughn Gittin, a Formula D Champion talks about the career of a pilot in general, how to customize the car, Autolog, teaches how to drift.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":10004,"name":"Mages of Mystralia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d11/d11d56d1bb5c8241ad8723e2af0fbc81.jpg","description":"In the kingdom of Mystralia, it takes more brains than brawn to succeed. You will face down giant, powerful creatures and navigate treacherous terrain. You will encounter puzzles that confound even the wisest of the old sages. And you must overcome obstacles put in place by people who do not want you to succeed.\nYour path will not be easy. In Mages of Mystralia, you play as Zia, a young girl who discovers that she has been born with an innate sense of magic. Unfortunately, magic has been banned, so she strikes off to train on her own to gain some control over her powers. On her journey, she meets other exiled mages and, discovers runes with magical properties and realizes that she can combine these runes in millions of different ways to come up with completely new spells.\nThe story was written by bestselling author Ed Greenwood, creator of the Forgotten Realms fantasy world for Dungeons and Dragons, which served as the basis for games like Baldur’s Gate and Neverwinter Nights, as well as about 170 fantasy books.\nDesign spells to fight enemies, solve environmental puzzles and battle epic bosses\nPowerful yet simple spell crafting system\nClassic action-adventure with over a dozen of distinct regions to explore\nOriginal orchestral score conducted by Shota Nakama and performed by the Video Game Orchestra at SoundtRec Boston of Final Fantasy XV and Kingdom Hearts fame","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Borealys Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":12246,"name":"One Way Heroics","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93f/93fd408badb90ecfb28094c9ea966455.jpg","description":"One Way Heroics Plus DLC - adding double the content!Taking One Way Heroics to a new level, Plus adds almost double the content with new classes, enemies, features and more. Defeat the Demon Lord in a whole different dimension with this unmissable addition.\nhttp://store.steampowered.com/app/352840/\nAbout the Game\nIn One Way Heroics, you take on the role of an intrepid adventurer who must travel across the land and face the Demon Lord before a mysterious shadow engulfs everything.\nDarkness always approaches from the left, and with each movement or action you take, the void creeps ever closer. Forced to run right, you'll encounter any number of monsters, allies, thieves and shops on your desperate journey to stop the end of everything.\nThe good news is that you don't just have access to one world. You have access to all of them.\nA nearly infinite number of worlds to save and explore!\nMultiple classes to unlock, each with different skills and advantages.\nDimensional Vault: Don't waste extra valuables! Lock away your inventory and save it for your next run!\nTime control: when the going gets tough, the tough freeze time and work out a new strategy.\nSteam goodies: trading cards, emoticons and wallpapers that proudly broadcast your OWH finesse!\nEvery world is different and unique. Lust forests or corrupted hellscapes, adorable animals or cunning thieves, each departure is a roll of the die. You might find likeminded heroes willing to journey with you, or you might meet no one and be forced to venture into the unknown alone.\nLike a dimension you previously visited? Simply input the name at the Dimensional selection screen before you begin your journey. Want to try your luck with a random reality? Type any word that pops into your head, and watch as One Way Heroics builds you a world based on the name you chose.\nInfinite permutations. Infinite worlds. Infinite adventure.\n*This game supports Cloud Saves for most system data including clear data and unlockables, however mid-game saves do not carry over.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Smoking WOLF","platforms":[{"id":0,"name":"PC"}]},{"id":13504,"name":"Eldritch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/54f/54f8eb14ce51250a30bc4ee10a40e859.jpg","description":"Eldritch is a 2013 FPS indie game developed by Minor Key Games. Its source code was released to the public by the developers in December 2013.\n\n###Plot\nThe game's story is revealed through various books scattered across the levels. The game's protagonist is a librarian, who explores the worlds of these books as they drag him in. The game is heavily inspired by the myths of Cthulhu and the works of Howard Phillips Lovecraft.\n\n###Gameplay\nThe game features numerous roguelike elements, as the world is procedurally generated and the permanent death is implemented as well. This adds to the game's replay value. If the player dies, they lose all the items they had on them as well as their money. Money can be stored in the bank, that is located in the game's hub environment called the Library. \n\nThe game's protagonist can use both firearms and magic spells. It is essential to mix all kinds of such weaponry to succeed in the game. Daggers, pickaxes, hatchets, revolvers, and even rocks can be used in the game's combat.\n\nUpon completing all the books, the New Game+ mode is unlocked. In this mode, the number of enemies on the level grows drastically, the amount of damage the players can sustain is dropped severely, and several weapons change their behavior. For example, the dagger can deal only a single damage point, and it cannot be used to break doors, rendering it completely useless.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Minor Key Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10992,"name":"OneShot","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7f/d7f630befee17f8d263a5d5396839c5a.jpg","description":"Localization Incoming!Great news! OneShot is about to receive a localization into several new languages. We look forward to sharing the additional languages with players new and old!\nsteamcommunity.com/games/420530/announcements/detail/1255787772106545794\nAbout the Gamewww.oneshot-game.com\nA surreal puzzle adventure game with unique mechanics / capabilities.\nYou are to guide a child through a mysterious world on a mission to restore its long-dead sun.\n...Of course, things are never that simple.\nThe world knows you exist.\nThe consequences are real.\nSaving the world may be impossible.\nYou only have one shot.FEATURESGameplay mechanics that go beyond the game window.\nA haunting original soundtrack and artwork designed to match.\nA unique relationship between a game and its player.\nA lingering feeling that you're not getting the full story unless you know where to look.CONTENT WARNINGAlthough OneShot is not a horror game in the traditional sense, parts the game may induce some paranoia. Please proceed with caution.CLOSING THE GAME WINDOWDo not worry, it is safe to do so. It only saves your progress.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Little Cat Feet","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10446,"name":"Turok 2: Seeds of Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4cf/4cf1e2b4cd701605225fb443d5e84f77.jpg","description":"Turok 2: Seeds of Evil returns to the PC! The sequel to the hit game Turok is now available, featuring a host of enemies, weapons, missions, locations and a new multiplayer mode. Remastered for today’s computers using a new engine with improved graphics, Turok 2 will transport players into sprawling environments with vicious enemies lurking behind every corner.\nThe Dinosaur Hunter Returns\nFight your way through 35 different types of enemies with bouncing bellies, blinking eyes, stretching tentacles and snapping jaws. From Prehistoric Raptors, to evolved Flesh Eaters, to your final battle with the Mother of all beasts— you’ll want to defeat all of them!\nEnemies are intelligent! They’re smart enough to attack in groups, to flee when they are outgunned, and to take cover during a firefight.\nEnemies flinch and spasm differently depending on which body part you hit.\nRemastered Locations\nConquer 6 engrossing Quest Levels including the Port of Adia, the Death Marshes and the Lair of the Blind Ones.\nOver 20 Weapons\nUnload multiple ricocheting shotgun shells with the Shredder.\nSend brains flying with the skull-drilling Cerebral Bore, a fan favorite.\nStomp enemies flat while riding an artillery-mounted Triceratops!\nNew Multiplayer\nThe new Multiplayer mode lets you battle with your friends. Using the best levels, weapons, and visuals from both the PC and Nintendo 64 versions, players will encounter a fun and visceral multiplayer experience.\nPlayers can also choose between a few skins for their character in combat. Network multiplayer is available through Steam, GOG Galaxy, LAN and direct IP with cross play capabilities.\nSplit-screen mode is also available in network multiplayer. Lastly, a new multiplayer game mode called “Last Turok Standing” has been added.\nNew Game Engine\nPorted to the Kex Engine 3.4.\nFull 64-bit compatibility.\nBrand new UI system.\nNew Graphics System\nModernized deferred renderer.\nShadow maps and compiled light maps.\nScreen-space reflections on textures and materials.\nDynamic and fixed-resolution sub/super-sampling.\nNew decals and effects.\nEnhanced Gameplay\nImproved character speed and manoeuvrability, including the ability to grapple ledges.\nUpdated maps.\nImproved AI.\n\"Quick warp\" feature allows instant travel to any previously visited portal.\nSave and load anywhere.\nAlso available from Nightdive Studios:\nhttp://store.steampowered.com/app/405820/","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Nightdive Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":12241,"name":"Oceanhorn: Monster of Uncharted Seas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f9/7f965ca1406c356249ec32b081a896f6.jpg","description":"You wake up and find a letter from your father. He is gone… The only lead is his old notebook and a mysterious necklace. What happened?\nOceanhorn: Monster of Uncharted Seas combines captivating storytelling, breathtaking 3D visuals and exciting gameplay into one epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with many dangers, puzzles and secrets. You must fight monsters, learn to use magic and discover ancient treasures, which will help you on your quest. Use all of your wits and skill to unravel the mysteries of the ancient kingdom of Arcadia and the sea monster, Oceanhorn.\nFEATURE OVERVIEW:\n- 15+ hours of story driven gameplay\n- Master magic and swordfight\n- Find ancient items to help you on your quest\n- Steam Achievements and Leaderboards\n- Steam Cloud\n- Steam Trading Cards\n- Full controller support\n- Enchanting original soundtrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cornfox & Bros.","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":5542,"name":"Devil May Cry 3: Dante's Awakening","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/912/9128672600b6f23f28c438fc4963e042.jpg","description":"Dante returns in Devil May Cry® 3 Special Edition with all new stylish ways to eradicate demons.  In this hellish prequel to the genre-defining hit, Dante battles his twin brother Vergil to prevent the dark resurrection of their father’s demonic power. Dante tears through his enemies with deadly styles, a new arsenal of demonic weaponry, and the craziest combos, proving DMC3 to be the quintessential action game of the series and the genre.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":3941,"name":"Dragon's Crown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a26/a263a344e214e30f0d3e7cc5950fc6fd.jpg","description":"2D fantasy action / RPG game takes place in the dungeons and labyrinths in a fantasy Middle Ages.\n\n###Plot\nThe Kingdom of Hydeland is rich in vast labyrinths and catacombs deep underground, and monsters dwell on the surface in dark forests and wastelands.\n\nAn ancient artifact of the kingdom called \"The Crown of the Dragon\" was stolen. The king went to look for him, but did not return - now the inhabitants of the kingdom are looking for someone who can return the crown and find the King.\n\nYou can choose one of six characters to be those who will entrust this important matter.\n\n###Characters\nThe Fighter is a melee connoisseur, his armor and shield provide him with the most reliable protection of all classes.\n\nThe Amazon can inflict damage to several enemies at the same time, wielding a two-handed sword or just hands.\n\nThe Wizard is a spell master.\n\nThe Elf is a master of bows and arrows, deadly in long-distance combat.\n\nThe Dwarf is very strong, carries one weapon in each hand, can pick up and throw various objects, even enemies.\n\nThe Sorceress is weak physically, but she can create food with magic, control skeletons, and turn enemies into harmless frogs.\n\n###Gameplay, beat ‘em up and trophies\nThe combat system allows you to add simple movements in crushing combinations. The role of high-quality equipment in the game is also very large, the search for opportunities to improve it is no less important than the battle with enemies.\n\nTo get as many trophies as possible, the hero is accompanied by two satellites cracker Ranni and Tiki the fairy.\n\nRanni helps to open chests in which various treasures lie: swords, axes, bows, belts, armor, amulets and much more. You can’t put them on right away - first they need to be identified in the city, or immediately sold.\n\nTiki the fairy allows you to activate the glyphs engraved on the walls. With proper activation of the glyphs, the player receives bonuses - a temporary invulnerability or a healing ring.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":3197,"name":"Xeodrifter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d1f/d1f2a143401250de5938f6fee61e5d03.jpg","description":"Xeodrifter is a Metroid-like action game developed by Renegade Kid.\n\n###Plot\nThe Xeodrifter flies his ship in deep space. Unexpectedly, his ship gets hit by an asteroid and he has to crash-land on a nearby planet to repair the ship. He travels from planet to planet to acquire new parts required for the repair of the ship and going off the star system Xeodrifter got trapped in.\n\n###Gameplay\nXeodrifter is a typical Metroidvania game. It is a two-dimensional platforming game that features immense interconnected maps which feature distinctive rooms and sections. The players cannot travel the whole map at first, as some sections of it require a specific ability or equipment to be opened. Sometimes, such items are protected by a unique and powerful enemy that has to be defeated by the players. \n\nIn the case of Xeodrifter, the players travel from planet to planet to find the necessary replacement parts. Several planets will be closed off for the players at the beginning of the game as they will need specific items to unlock the ability to land on them. \n\n###Art style\nXeodrifter features a completely flat two-dimensional graphics with a heavy use of shadows and parallax effects. The game uses the same color palette as the original Metroid games. Several Retrowave elements were added to the game in the form of music.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gambitious","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":19624,"name":"Soulbringer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d3c/d3cc314ed782d6abe502f91cce0487ad.jpg","description":"Soulbringer is a fantasy role-playing game developed by Gremlin Interactive.\n\n###Plot\nThe protagonist arrives in a small town to find his long-lost uncle who is the last member of the protagonists family. The main character gets caught in the middle of the war for power of the two bandit groups in which it is revealed that the playable character is a reincarnation of an old powerful being who is to save the world as described in an ancient prophecy.\n\n###Gameplay\nSoulbringer is set in a three-dimensional world with a helicopter-like perspective offered to the players. The game features a sophisticated combat system, in which every weapon present in the game has a specific set of moves, which can later be expanded as the player levels up. A magic system is also present in the game. All the game's elements can counter each other and some time must be spent planning the most suitable usage strategy.\n\nThe gameplay takes place in a fantasy kingdom of Ratenna, and its outskirts, such as the country of the elves. It is possible to visit different parts of the in-game world, such as the towns, dungeons and the so-called Well of Souls.\n\nThe game is not linear with all the game's quests offering a set of tasks which can be completed in whichever order the player sees fit. There are also multiple ways of completing such tasks.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Infogrames Europe","platforms":[{"id":0,"name":"PC"}]},{"id":14885,"name":"ShipLord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51f/51f5e927c57e139f5d7d3ee8d0757c6b.jpg","description":"ShipLord as an indie space shoot-em-up survival game developed by Just1337 Studio.\n\nThere is not much plot present in the game, apart from several dialogue lines on several levels, that are not connected with each other.\n\n###Gameplay\nShipLord resembles a typical bullet hell shoot-em-up game. The players fly on their ship on the screen from left to right, avoiding fire from the enemy vessels that go in similar patterns, and firing back as much as they can.\n\nShipLord tries to expand upon this concept, as there is a bit of player customization present in the game. The players have access to several space vessels and over 100 upgrades for them, such as decreased shield cooldown, increased shield duration, force field improvements, reduced energy collection time.\n\nThe players can use three special abilities to get them out of trouble: a shield that lasts a little while and saves you from the enemy fire; an energy tractor, that drains energy from the opposing force ships; a force field that merely destroys enemy ships and deflects any projectiles fired at you.\n\nTo unlock a boss level, the players have to complete four asteroid levels. Such levels differ in their environment, enemy types, and difficulty. There are fifteen levels total in the game.\n\nThe game also tracks the player's performance with its built-in medal system. The better you play - the more you get.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":647552,"name":"Call of Duty: Vanguard","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa8/fa870a46d5e3e8cb1fa0a5e4f798ff2a.jpg","description":"Rise on every front: Dogfight over the Pacific, airdrop over France, defend Stalingrad with a sniper’s precision and blast through enemies in North Africa.\r\n\r\nExperience influential battles of World War II as you fight for victory across multiple theaters of war. The Call of Duty®: Vanguard campaign will immerse you in a deeply engaging and gripping character-driven narrative experience featuring combat on an unparalleled global scale, while also telling the harrowing stories of those who turned the tides of war and changed history forever.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Raven Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":13054,"name":"Bit Blaster XL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90c/90c570040ed094e61b2306955e52870a.jpg","description":"I have been learning to make games in my free time and love making small-yet-solid arcade games with simple mechanics. Please expect 'Bit Blaster XL' to be a small, re-playable, arcade score-chaser game where the only goals are to constantly beat your previous score and unlock some extra ships. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter, My Website, or the forums if you encounter something wrong with the game, something misleading on the store page, or you just want to say hello.\nThank you for taking a moment to read this; I really hope you enjoy playing my game.\nAdam Nickerson - Nickervision Studios\nYour ship can not stop moving; so you must turn it left and right and use your boost/brake to keep from crashing into an ever increasing amount of enemies.\nYour ship is always shooting, so make sure to pick up more ammo and the wide variety of awesome power ups and pick ups to help you survive longer.\nGet the highest score you can while collecting coins to buy more ships that are faster, shoot faster, or have more shields.\nA throwback to the classic quarter eating arcade games of the 80's. Bit Blaster XL is a retro styled, addictive, and fast paced arcade shoot 'em up!\nEasy to learn, simple arcade style Controls to turn your ship, boost, and brake. Keyboard + Gamepad Support. (not a twin stick shooter)\nA variety of wicked Power ups like Split Shot, Heat seekers, Lasers, and much more to assist your survival.\nScreen clearing Bombs, Ship Shields and Boost Pickups to help you survive longer.\nCollect coins to unlock new ships with unique attributes to give you an edge in the Leader board.\nEndless survival (infinite) score chasing game play with a classic 'bullet hell'-like arcade style.\nSteam achievements, leader board & Trading cards! (with emoticons & profile wallpapers)\nTotally rad and ridiculously basic retro pixel Graphics.\nFeaturing gameplay directly inspired by some of my favorites, such as; Luftrausers, Asteroids, Space Invaders, Galaxian and Geometry Wars.\nUnique chip tune songs for each ship by Spiff Tune. (Soundtrack available as free DLC)\nAn alternate Manual Fire mode for those that want a different experience.\nThe in game audio/SFX was provided by my mouth and some royalty free SFX from FreeSFX.\nThe soundtrack is by the artist \"Spiff Tune\" and is available as FREE DLC.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nickervision Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":451,"name":"EARTHLOCK: Festival of Magic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/658/6586c268962d5a53f6f785d9728d0d40.jpg","description":"Don’t let the cute cartoonish art style fool you. This game is challenging. True fans of the JRPG genre will love it, casual players may want to look elsewhere. Invest the time, and EARTHLOCK: Festival of Magic will reward you with a depth in gameplay that will test the most strategic of players.\n\n# Discover Your Hero Within\n\nEmbark on a journey to save the beautiful world of Umbra, a harsh planet that stopped spinning thousands of cycles ago. What started as a mission to rescue Amon’s uncle from the clutches of an ancient cult, soon spirals into an adventure that was centuries in the making. You must bring together this group of unlikely heroes to stop the ruinous past from repeating itself.\n\n# The World\n\nExplore the magical world of Umbra and discover places lost in the past to uncover the secrets of the Earthlock Artifact.\n\n# The Heroes\n\nUnite this band of heroes, all with their own journeys of self discovery and venture into the world to save the planet from the growing evil within. Mix up your strategy to beat your enemies using two different stances per character, and build your characters' battle bond to unleash powerful abilities or unique perks.\n\n# Your Own Secret Island\n\nTake a break from adventure and escape to your own home island. Here you can harvest magical ingredients and craft helpful items and perks.\n\n# The Talent Table\n\nEARTHLOCK: Festival of Magic features a unique talent board system; a refreshing take on the classic skill tree. This board gives you complete control over your player's strengths and weaknesses. You can swap talents on and off the board, allowing you to finely tune each character to your desired playing style. The talent board also features “Perk Talents” which you can craft and collect in the world, giving you special combat skills and abilities.\n\nFor the best EARTHLOCK: Festival of Magic experience, we recommend using a game controller.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Snowcastle Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"}]},{"id":309738,"name":"Partisans 1941","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/389/389355994024b6b2a2becd960e13b5b1.jpg","description":"Partisans is a real-time tactical strategy with non-linear type of storytelling. This game is about soviet partisans and their activity during World war II. It’s focused on harsh reality in those times, when many people became reluctant heroes, and every feat required its price, and sometimes this price was extremely high.\nThe game shows the war from a new, poorly explored angle. However, it is not a historical simulator, Partisans offers a unique interpretation of those times’ events. The game shows partisans’ everyday life, which is full of cold, hunger and wounds. Still there is a room for joy as well. Players would have to make tough choices, for example, they’ll have to decide whether to help civilians and betray their position or to walk past and stay unnoticed. The game give opportunities to prove oneself in a fight, to overcome the superior forces of the enemy using cunning and mother wit , and to leave the field when the situation is really bad.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Alter Games","platforms":[{"id":0,"name":"PC"}]},{"id":6321,"name":"Lumino City","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ee/3eeda27c87b928e34e3aed574cce1b58.jpeg","description":"Lumino City is a puzzle-adventure video game developed by State of Play Games and a sequel to 2011 title Lume. \n\n###Art style and plot \nThe game follows Lumi, a simple girl that lives with her grandad. One day the grandad gets kidnaped, and now she must go to the nearby Lumino City to find him. \nThe game is notable for its paper cut-out art style. While the main character is CGI, all of the environments are crafted by developers using cardboard, paper, wood, and other crafts materials. \n\n###Gameplay \nLumino City is a point-and-click adventure game with heavy emphasis on puzzle solving. The game uses a mouse to control Lumi and interact with objects. Her backpack serves the role of in-game inventory and fits many items required to solve in-game puzzles. \nThe game consists of several levels, each of them usually takes two-to-three screens. Some of them revolve around interacting with Lumino City’s townsfolks that asks Lumi for help in exchange for opening her way to the next level. Most of the game takes place in the city, so houses and streets are natural environments in the game. Aside from solving puzzles, some of which incorporate minigames in the vein of Machinarium or Samorost, some swinging and climbing sections require clicking certain objects at the right time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":20270,"name":"AaaaaAAaaaAAAaaAAAAaAAAAA!!! for the Awesome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac8/ac8e4bf022bd80e778f05064a48cdb3a.jpg","description":"AaaaaAAaaaAAAaaAAAAaAAAAA!!! for the Awesome is an indie BASE jumping simulation game developed by Dejobaan Games.\n\n###Gameplay\nFor the Awesome is a remaster of the original game AaAaAA!!! - A Reckless Disregard for Gravity. No gameplay was changed whatsoever.\n\nThe main objective of the player is to jump off a high building, avoid obstacles, smash through the colored windows, and successfully land in a designated area using a parachute. The players gain points by flying very close to other buildings, which is referred to as “kissing” and by staying close to them which is called “hugging.” The players are also able to gain bonus points by spray painting the buildings, interacting with fans, or insulting the protestors. Even hitting a bird awards players a small number of points.\n\nThe game features a rating system, which evaluates the player's performance. The better the player performance is - the more in-game currency called “Teeth” they are awarded. Teeth are used for unlocking new levels and modes, new graffiti, items, and gestures. The game also features leaderboards, where the players can compete with each other.\n\nThe remastered version of the game features refined graphics, a new “Expert” difficulty level with new levels as well as all the other levels from the original game. This version also supports the virtual reality headsets.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":55445,"name":"Eye of the Beholder II: The Legend of Darkmoon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ae/9ae2ece52d0099180ad3a0b8a49c57a6.jpg","description":"Eye of the Beholder II: The Legend of Darkmoon is a 1991 computer role-playing game and the sequel to Eye of the Beholder. It used a modified version of the first game's engine, added outdoor areas and greatly increased the amount of interaction the player had with their environment, along with substantially more role-playing aspects to the game.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Westwood Studios","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"}]},{"id":5131,"name":"PixelJunk Shooter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d1/0d180a9847a3876837b21d00b3f53515.jpg","description":"PixelJunk Shooter is the fourth installment of the PixelJunk franchise, in which each game is based on another genre. Unlike the previous PixelJunk games, Shooter does not feature the series' trademark hardcore difficulty.\n\n###Plot\nAnother departure from the PixelJunk traditions is that Shooter has a backstory. The game is set on a faraway planet Apoxus Prime. The scientists explore its enormous caves to mine resources. The player controls a starship called Ers Pinita Colada. Its captain answers to a distress signal from Apoxus Prime and tries to rescue the scientists lost in the caves.\n\n###Gameplay\nThe player flies the ship in the underground tunnels. The goal is to locate and save the scientists. The ship uses its gun to destroy enemies or to clear the way from ice and rocks. The ship has no hit points. Instead, a thermometer measures the ship's temperature. The player has to avoid overheating and remember to cool the ship, for example, by diving into water.\n\nThe underground features monsters, villains and other dangers. There are many environmental puzzles that require the player to manipulate water, lava, stones, and other elements to access the scientists and unlock doors. PixelJunk Shooter has three episodes comprised of five levels each, and levels consist of short stages. The player can only progress by saving the scientists, and if five or more of them die, he or she has to restart. A secondary objective is to gather the collectibles such as diamonds.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17753,"name":"Death Rally (Classic)","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a10/a10f2659a3307e32c7e3499b949e2eb1.jpg","description":"Shoot your way through screaming bystanders, pick up more ammo and turbo from the side of the track, and floor the pedal while performing some shady deals for The Dealer. No trick is too dirty when you're preparing for The Final Confrontation. Only the hardest armor, the most powerful engine and the biggest guns will see you through the ultimate battle against The Adversary.\nAnd when you feel you can't take it anymore, you can check out the underground market: Spiked bumpers, landmines, rocket fuel or sabotage can provide a way to create some nasty accidents for the competition.\nPlay alone or with friends, Death Rally supports network multiplayer for up to 4 players and serial or modem connection for two players.Features\nDrive Crazy: Death and diversity with 19 different race tracks and 6 different cars.\nEquipped to Kill: Each car is equipped with different weapons.\nPimp Your Ride: Upgradable engines, tires and armor.\nKeep Your Friends Closer: Mutliplayer support for up to 4 players.\nCar Nut: Over 20 megs of action-packed animation.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1303,"name":"NBA 2K17","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ee/5eec6d58cd7a4dde9c6486359c7e6842.jpg","description":"Legend Gold Edition\nThe NBA 2K17 Legend Edition Gold includes-\nDigital Content:\n100,000 VC\n‘92 Dream Team playable in Quick Game\nKobe #8 Mitchell & Ness Jersey\nKobe USA Basketball Jersey\nKobe hoodie\nNike Kobe shoe collection – 24 shoes in all\nMyTEAM Gold Bundle (includes 5 packs w/guaranteed Kobe Free Agent card)\nNote: Only one Legends Gold Edition Locker Code may be redeemed per MyNBA Account\nLegend Edition\nThe NBA 2K17 Legend Edition includes-\nDigital Content:\n30,000 VC\n‘92 Dream Team playable in Quick Game\nKobe #8 Mitchell & Ness Jersey\nKobe USA Basketball Jersey\nKobe hoodie\n2K Kobe XI shoe\nMyTEAM Legend Bundle (3 packs w/guaranteed Kobe Free Agent card)\nNote: Only one Legends Edition Locker Code may be redeemed per MyNBA Account\nAbout the GameFollowing the record-breaking launch of NBA 2K16, the NBA 2K franchise continues to stake its claim as the most authentic sports video game with NBA 2K17. As the franchise that “all sports video games should aspire to be” (GamesRadar), NBA 2K17 will take the game to new heights and continue to blur the lines between video game and reality.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":58878,"name":"Team Sonic Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/069/069ac576aa3cc90a2b720ed15c31b0c9.jpg","description":"Team Sonic Racing combines the best elements of arcade and fast-paced competitive style racing as you face-off with friends in intense multiplayer racing. Race together and work together as a team by sharing power-ups and speed boosts. Take control of your racing style - Choose from 3 distinct character types and unlock game changing vehicle customization options to suit your racing style.\r\nGear Up. Speed Up. – Team Racing at Sonic Speed!Key Features:\r\nOnline Multiplayer & Local Co-Op Modes – 12 players per race, 4 player split screen, and various offline / online race modes including Grand Prix Mode, Exhibition Mode, Time-Trial and Team Adventure Mode.\r\nTeam Racing – Race as a team, win as a team. Use various team moves to assist your teammates, knock out opponents and unleash your Team Ultimate.\r\nPerformance & Skin Customization – Alter the appearance and handling of your vehicle\r\nWisps - 14 spectacular offensive and defensive items to help overcome rival teams and get ahead!\r\nAdventure Mode – Unique story experience where players are introduced to basic game features and characters.\r\nVarious Characters and Types –  15 playable characters from across the Sonic Universe and 3 distinct character types including Speed, Technique, and Power.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":16073,"name":"Confrontation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fe/6fe930b0bb9505fbc5039ed47893608e.jpg","description":"Confrontation is the TRPG and the video game adaptation of the tabletop title of the same name by Rackham. That is the only title in the IP, and the game is developed by Cyanide. This studio is also famous for the Pro Cycling Manager series.\n\n###Plot\nThe narrative in the game is presented via short briefings given to the player before the missions. The events depicted in the game cannot vary — the game is highly linear. The whole story circles around the constant fights of the protagonist team with no motivation for them provided whatsoever. All of the playable characters remain silent most of the time during the gameplay process.\n\n###Gameplay\nThe video game adopts a plot from the tabletop wargaming. The setting is shared between two titles — it is the stylized medieval world called Aarklash which is constantly torn down by some races typical of role-playing games: wizards, knights, and priests. There are many outcomes to the game while it is unknown which fraction prevails. \nThe video game adaptation inherits the world and builds an adventure around the team of heroes composed out of 4 characters chosen by the player. This team travels through levels, guiding each other through the enemies, traps, and puzzles along the way. The game does not feature any NPC's to talk with and complex puzzles to solve — any riddle works according to mechanics \"pull the lever — open the door.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":3905,"name":"URBAN TRIAL FREESTYLE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02f/02fd24f02555f6e4c419b3d02d926bb4.jpg","description":"URBAN TRIAL FREESTYLE is a racing platformer game developed by Tate Multimedia. It does not have any relation to the Trials game series.\n\n###Gameplay\nThe players take control of a freestyle bike rider. The objective of the game is too complete the level using the most tricks possible.\n\nThe game features two types of stages: the players are required to finish the level in a certain amount of time or to complete a given list of tricks.\n\nThe levels for the first type of stages do not require anything else other than completing the stage while avoiding obstacles. If the player's character touches anything with any body part, they have to restart from the nearest checkpoint. The environments in the game differ drastically from each other. The players may even ride through a city where a riot takes place. \n\nThe trick-oriented stages do not feature a time limit. The players have to complete a certain trick and follow the directions that are placed on the level. There are five tricks present in the game. For each successful trick, the player is awarded points based on how spectacular the trick was. For every fall, 50 points are taken away from you. These points are used to unlock new levels and to compete with other players using the in-game leaderboard.\n\nA player customization system is also present in the game. While the players are free to dress their rider however they like, it is also possible to upgrade the bike, which will affect the gameplay.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Tate Multimedia","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":49353,"name":"FRAMED Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c68/c689b61ea646f219c4609073eb41626f.jpg","description":"The FRAMED Collection is a double-issue dosage of the groundbreaking noir-puzzle games that uniquely play like a comic book, FRAMED and FRAMED 2.\nChange the Order, Change the Outcome\nRather than take direct control of a character, the FRAMED Collection has you re-arranging the panels of a comic book and altering the sequence of events, in order to change the outcome of each page in the story.\nElegant mechanics based around re-arranging panels of a comic book to change the outcome of each scene\nUnique hand-drawn aesthetic with silhouetted characters\nFully-scored with smooth live jazz\nIncredibly fluid and lifelike animation\nBeautiful and mysterious settings\nCats and dogs for those bored with just humans\nCompletely overhauled experience for Steam players\nCigarettes and Defenestration\nThanks to our previous success we are now able to bring the collected compilation of the classic panel-switching games, along with some new, unique features to Steam! The games have been completely overhauled and redesigned for Steam, and given that extra love and care needed that we know connoisseurs of great taste demand.\nSo sit back, pour out a glass of your favourite tipple, and settle into the smooth jazzy tones of the multi-award winning games in the FRAMED Collection.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Loveshack Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4936,"name":"Dead Nation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/624/62471dff88da6234fcf19013ead5b3ba.jpg","description":"###Breakdown bonus\nDead Nation is a top-down shoot-em-up game for PlayStation3 from the studio Housemarque. It was released on November 30, 2010, on PlayStation Network. The game was one of the bonuses that Sony gave away as a compensation for a PlayStation network breakdown. n February 2014, a version of the PlayStation 4 game called Apocalypse Edition was released, along with the PlayStation Vita version\n\n###Key Features\nThe game takes place in a world engulfed by a zombie apocalypse. The player can choose between the male and female models of the game character. The main goal of the game is to score as many points as possible for killing zombies. For the murder, the player also receives money that can be spent on buying and upgrading weapons and getting multipliers to improve the score. The game world cannot be called a peaceful - the zombies react to loud sounds and player movement. Players can use a melee and rush attack against zombies. Zombies also have several kinds.\n\n###Story\nThe game has a story. It tells about the fall of society, and much of the world's population turned into a zombie. A year later after the original calamity, the main characters (either Jack McReady, Scarlett Blake) are preparing to leave their shelter in search of food and water. The game can be completed in co-op mode.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":283973,"name":"Doritos Crash Course","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a47/a47026f950f034c949a777b20e52ed32.jpg","description":"A 2.5D sidescrolling platforming advergame developed by Wanako Games for the Xbox 360's Xbox Live Arcade service. It was released on December 8, 2010 for free as one of the finalists of the Doritos-sponsored \"Unlock Xbox\" competition for 2010, alongside Harms Way","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Wanako Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":19374,"name":"Ghost Master","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b6/0b681d3fffa7ddf68dcb0e4b56fe8131.jpg","description":"Classic mode    The traditional 1V5 asymmetric competition mode. Players can choose Psychic Detectives, cooperate with other 4 teammates, use the skills of different characters and the props in the map to disperse the Residful Spirits in different maps;\nYou can also choose Resentful Spirits and combine your powerful skills with a portable trickery to chase 5 Psychic Detectives to death, gain the souls of all agents, and win the game.\nWerewolf kill mode    In the special training mode of the Psychic system, there are 2 Psychic Detectives incarnations of Resentful Spirits among 10 players. The real 8 Psychic Detectives need to use the items scattered on the map and the information communication between the teams to complete the sealed array eyes, while finding the Resentful Spirits players hidden in them;\nResentful Spirits players need to hide in Psychic Detectives, use trickery and lies to prevent the exchange of information between Psychic Detectives, Seal the Array Eye, and collect all the souls of Psychic Detectives.\nThe Psychic Detectives of the Psychic Bureau have this unique Major Star skill and two configurable Minor Star skills. Since the attributes of the five elements of each Psychic Detectives are different, the positioning of Psychic Detectives in the game is also different. According to their attributes, they are divided into: gold-escape, water-function, wood-assistance, fire-confrontation, soil-defense.\n\nIn the game, Psychic Detectives can pick up Paper doves floating around in the scene, opening up many props with different functions.\nTalisman of Soul Calming—After use, it can resist only one attack of Resentful Spirits\nTalisman of immobilization—After hitting the Resentful Spirits, the Resentful Spirits can be restrained in place for a period of time\nSmoke Bomb—A mist appears after use, and Psychic Detectives will not be found by Residentful Spirits in the mist\nIn the game, not only can you use traditional magical tools to expel the Resentful Spirits, but with the support of science and technology, Psychic Detectives can also use unique and fun-filled modern equipment.\nStun Gun—Resentful Spirits that are hit will receive an electric shock and will be unable to move for a short period of time\nNight-vision Device—After use, you can see the Resentful Spirits in the invisible state around you\nFlexible use of the props in the game and the Major Star skill of the character will enable you to survive the chase of the Resentful Spirits.\nThe top Resentful Spirits players are not only because of their powerful and superb skills, but also because they are also masters of using Trickery.\nFaced with different Psychic Detectives lineups, choose the most targeted Trickery to make it easier for you to achieve victory.Curse TrickeryDirectly negatively affect Psychic Detectives itself, and capture Psychic Detectives more efficiently.\nExhaustion：Psychic Detectives will continue to lose HPs while Sealing the Array Eye.Seal series TrickeryProtect the Array Eye in the map, and make Psychic Detectives fall into your trap unknowingly.\nMaze Array：Fake Array Eye will appear in the map, and it will disappear after Psychic Detectives is sealedExclusive TrickerySome Resentful Spirits have their own Exclusive Trickery to improve the functionality of their own skills.\nSpider Cocoon on Command：Resentful Spirit-Xiao Zhu can manipulate the behavior of the spider on its own.\nBefore the start of the game, choose a Trickery with a powerful effect and let Psychic Detectives scatter and run away.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Sick Puppies","platforms":[{"id":0,"name":"PC"}]},{"id":12039,"name":"Niche - a genetics survival game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb0/cb0c8c4d8b91ebd7f74ec6054ab66105.jpg","description":"Niche - a genetics survival game is a fresh blend of turn-based strategy and simulation combined with roguelike elements. Shape your own species of cat/fox/bear/dog-like animals based on real genetics. Keep your animals alive against all odds, such as hungry predators, climate change and spreading sickness. If your species goes exstinct the game is lost and your evolution needs to start anew.Key Features:Real genetics for breeding system\nOver 100 genes to shape your species\nProcedurally generated worlds and animals\n4 biomes featuring different predators, prey and flora to explore\nGame mechanics inspired on population geneticsGames that inspired us:Spore\nDon’t Starve\nThe Creatures series\nWarrior CatsEducational aspects:While playing Niche, the player is introduced to the scientific mechanics of genetics (featuring dominant-recessive, co-dominant inheritance, etc). The game also features the five pillars of population genetics (genetic drift, genetic flow, mutation, natural selection, sexual selection). All knowledge is interwoven with the game-mechanics. This creates the effect of learning by playing.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stray Fawn Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":20804,"name":"Enemy Mind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/973/973a0d79ffb799e10e2fa92d4f584f41.jpg","description":"Enemy Mind is an indie side-scrolling space shooter developed by Schell Games.\n\n###Plot\nYou play as a parasite that comes from the deep space. You can take over the minds of humans on distance and control their actions. The players use this ability to take over spaceships and eliminate human fleets.\n\n###Gameplay\nEnemy Mind resembles a classical horizontal side-scrolling shooter. The players control a spaceship on the left side of the screen, dodge enemy fire, and attack in return. The developers put a spin on a classic side-scrolling shooter which also serves as a narrational device. \n\nThe parasite that is controlled by the player can take over the minds of the ships' captains and turn them on the friendly ships. This mechanics allows for multiple strategies and puts a new layer to the gameplay. \n\nMore than 20 types of ships are present in the game with each ship differing in its armor, armament, and speed. \n\nThe game features multiple endings that depend on the types of ships you use and the faction these ships belong to. There are no voiced lines in the game, and the glimpses of the story revealed through the comms chatter the players read through between the game's levels.\n\n###Art style\nThe game is heavily inspired by old space sidescrollers, such as Galaga and Space Invaders. It boasts hand-drawn pixel objects and a soundtrack written by a psychoactive retro wave artist Rainbow Kitten.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Schell Games","platforms":[{"id":0,"name":"PC"}]},{"id":17177,"name":"Umbrella Corps /Biohazard Umbrella Corps","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c0/4c009bf276a9d046d7dcc7601b5b0b9f.jpg","description":"Umbrella Corps /Biohazard Umbrella Corps is a shooter game, a spin-off of the Capcom’s Resident Evil series.  \n\n###Gameplay \nIn Umbrella Corps you take a role of mercenary working for Umbrella Co.\nThe player can switch between first-person and third-person perspectives. The game features both multiplayer and single-player modes although the game was primarily marketed as a multiplayer title. The single-player part consists of than 24 missions most of which task you with collecting DNA samples from killed zombies.\nThe key feature of Umbrella Corps’ multiplayer is that alongside players, the maps are filled with aggressive zombies. They attack any mercenary they see, and can be a real threat when in large numbers. The players possess “Zombie Jammer,” a device that makes zombies ignore them. However, opposite players can disrupt. The combat system in the game is cover based meaning it allows one to hide behind walls or other large objects. The multiplayer also has a progression system which allows the player to unlock new weapons and cosmetic items. There are several types of weapons in the game including pistols, rifles, explosives, shotguns and melee weapons. The most notable melee weapons are ax-like Brainer which one-shot almost any enemy with a charged attack. The multiplayer features several game modes most of which are typical for this type of game. The most notable mode is DNA hunter in which you have to collect more DNA samples from killed zombies than your opponents.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]