[{"id":21658,"name":"Gunspell","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63d/63d61f849a602bfe42b09868f82a9e88.jpg","description":"Gunspell is cross-genre game, where RPG meets Puzzle.\nBecome a member of powerful Order that protects the Earth from creatures from the dark-side. Travel across worlds, fight monsters, complete different quests, up-grade your weapons and magic. Combine guns and magic to take on vampires and demons, heroes and monsters in this epic adventure!\n•\tMatch 3 battles with a lot of features\n•\tMultiple strange new worlds to explore\n•\tHordes of enemies to fight\n•\tTons of different weapons, items and spells!\n•\tNo need to wait! Replenish stamina with a mini-game any time!\n•\tAwesome graphics!\nGame Awards\n★ DevGAMM 2014 Award\n★ MS Windows Store Staff Pick\nGame Website\nhttps://www.facebook.com/gunspell\nAbout Ino-Сo Plus\nBased in Russia, Ino-Co Plus develops games for multiple platforms, from PC and web, to modern mobile devices. The core team consists of professionals with over 15 years of game development experience. Ino-Co aspires to make games which we would like to play ourselves. Therefore, our games are made with the soul and the attention to detail we expect of the games we play.\nCompany website - http://ino-co.com/\nFacebook - https://www.facebook.com/inocoplus\nYouTube - http://bit.ly/1suwcrA\nTwitter - https://twitter.com/inocoplus\nVK http://vk.com/inocoplus\nVK http://vk.com/gunspell","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ino-Co Plus","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16847,"name":"Super Trench Attack!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b20/b2099033a312423e9b33412e2da4257b.jpg","description":"Super Trench Attack™ is a goofball comedy twitch-shooter based in a World War setting.\nSTORYLINE\nThe Dastardly Black Army has invaded your beloved homeland! The only thing between them and victory stands one man. A crazy recruit with an eye for headshots and a boot for kicking the enemy up the....well you get the picture. Enter the crazy world of Super Trench Attack.\nGAME FEATURES\nUnique targeting system, there's even footshots!\nSmooth as glass 60FPS shooting action,\nFull Xbox® 360 Controller support, for 'blasting action',\n4 huge open areas to explore, with many secret areas,\n16 varied missions, including giant bosses and shooting galleries,\nCrazy Buddy AI character to watch your back,\n4 shops offering unique items, weapons and traps, for a variety of ways to play,\n33+ Resolutions, including 8:5 and 16:9 widescreen,\nQwerty, Azerty and left hand controls,\nGoofball bonkers humor.\nSTEAM FEATURES\n24 achievements,\nFull 360 Controller support,\nLeaderboards,\nNew Latest version 3.4,\nFully optimized code.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Retro Army","platforms":[{"id":0,"name":"PC"}]},{"id":3985,"name":"Dungeons & Dragons: Chronicles of Mystara","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f58/f58cd86eb0ce28d0b8d50c226a81d5b6.jpg","description":"Dungeons & Dragons: Chronicles of Mystara brings reworkings of two of Capcom’s classic arcade hits - Dungeons & Dragons: Tower of Doom and Dungeons & Dragons: Shadow over Mystara – together in one definitive digital package.\nJust as in the arcades, up to four players will select their character class before doing battle against the mythical beasts from the Dungeons and Dragons’ universe with a mix of melee, range and magic attacks.Key FeaturesGGPO Enhanced Online With Drop-in/Drop-out Co-Op Play: Community-trusted GGPO powers a smooth online experience that allows up to four players to drop in or out of games in progress at will.\nClassic Arcade Gameplay with a New Twist: Players can enjoy the original arcade modes or mix up the gameplay with House Rules that can completely alter the experience.\nSome examples of House Rules:\nUnbreakable - Equipable items have infinite durability. Never worry about breakage again!\nEnemy Rush - Fight against time in this special Time Attack Mode. Start the game clock with 30 seconds and increase the clock with each enemy you kill!\nMake it Rain – Get rich quick! Enemies and chests drop tons of gold!\nChallenge System: A newly introduced RPG-like system that fits on top of the existing games and provides a myriad of challenges for players to complete. Players can level up and obtain Vault Coins to be used in the Vault.\nThe Vault: A treasure trove of unlockables and gameplay loot can be purchased with Vault Coins earned via the Challenge System.\nCharacter Visualizer: This UI visualizer tracks which characters the players and their friends most often use. Players can utilize the tool to create a more balanced multiplayer dungeon crew, or to see which under-used characters they should try out next.\nLeaderboards & Connected Arcade: Players can track how they stack up against their friends through leaderboards, as well as view a full breakdown of gameplay related stats.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":801638,"name":"Wo Long: Fallen Dynasty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e1/1e1b965459d5cf69cf51e5d6fe7da959.jpg","description":"Wo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. \n\nPlayers fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Team NINJA","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":309763,"name":"Seen","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/306/306388d29cab7583f4e70cbecd11f2b0.jpg","description":"In a wild, dark and unforgivable world, you will try again and again to follow the light, struggling to overcome the obstacles trying to reach your only hope. but how could you and heart diseases didn't left anyone but infected him, people will try to stop you and the more you insist the more they hurt you.\nGame features\n- A Runner game with story events keep happen the more you advance in game.\n- Challenging gameplay with responsive and fun to play controls.\n- Tolerant health system, unlike what runner gamestyle used to be, in this game you will get several chances before you start over.\n- Beautiful atmospheric music.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mem34","platforms":[{"id":0,"name":"PC"}]},{"id":49300,"name":"A.D. 2044","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f85/f856c14f8c8d7cb72085723960f5c8d5.jpg","description":"When you buy A.D. 2044, Sołtys (PL) and Skaut Kwatermaster (PL) will be included as bonus goodies for free!\nThe future is now, the year 2044 to be exact and the world has changed dramatically. Male civilisation is on the verge of extinction. Genetic engineering has made human reproduction possible without the need for man's involvement. Women have decided to fight their final battle and to shape the world the way they want it.\n\nBut if that's not enough, women have a new laser weapon which kills only men, and the few remaining men are being turned into \"she clones\" in the bionic clinics. And there's more, a rebel feminist has stolen a supply of warheads and intents to start a global nuclear war.\nWait though, there's a glimmer of hope. You are the last remaining normal male and if you can avoid these female superpowers, you can reverse their domination.\n\nBut hurry, you don't have much time, the clock is ticking, your fate seems sealed, unless...Encapsulating futuristic story\nSuperbly detailed 3D locations\nLoads of Brain Busting Puzzles\nDigitised Speech & Atmospheric music","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"L.K. Avalon","platforms":[{"id":0,"name":"PC"}]},{"id":21925,"name":"Hot Shots Golf (2017)","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/525/5250efd42bb4e2730814baba0f7a5db3.jpeg","description":"Everybody's Golf is a new game for PS4! Anybody can play golf with basically only three button clicks. Now you can experience golf with a variety of character customizations, fishing, and karting across the courses. You can develop your skills with the challenge mode and compete with other players globally through the online mode.\nEnjoy golf your way!\nOnline multiplayer requires a PlayStation®Plus membership.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2017 Sony Interactive Entertainment Inc. Everybody’s Golf is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":20930,"name":"404Sight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55c/55cdeecaff4043ad40870e0df264b784.jpg","description":"Soundtracks!We know how hard it is to wait for release day, so in the meantime we thought we'd share our Soundtrack with you!\nOur incredibly talented composers have created some great music for 404Sight. Check out 404Sight Soundtrack Part 1 http://gabecastro.bandcamp.com/album/404sight-soundtrack and 404Sight Soundtrack Part 2!http://keatonanderson.bandcamp.com/album/404sight\nAbout the Game404Sight is a free game made in support of net neutrality. It’s a 3D playground runner influenced by parkour running with the addition of a special ping ability that reveals areas that can speed the player up or slow them down. Hidden fast and slow lanes become visible, so it takes a bit of planning to plot a course through a world full of hazards – especially when the internet service providers themselves are actively trying to impede the player’s progress.\nIn 404sight, the player attempts to traverse a level as quickly as possible without getting throttled by the ISPs, who actively throws slow tiles and inhibitors in their way.\nThis game was made by Retro Yeti Games, a team of graduate students currently enrolled in the Entertainment Arts and Engineering program at the University of Utah. More information can be found at http://eae.utah.edu/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Retro Yeti Games","platforms":[{"id":0,"name":"PC"}]},{"id":18286,"name":"inMomentum","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/861/8617382f49235ef782ead21478964b53.jpg","description":"InMomentum is a minimalistic sci-fi platform racing game that challenges the players to think in both horizontal and vertical perspectives while racing against each other or against the clock in a puzzle-like environment.\nInMomentum gives the players the possibility to explore a visually unique world by having minimized object detail and a special focus on visual stimulation by the use of colors and shapes. The game’s style forges a strong bond between the visuals and the player, thus provides a very unique experience.\nKey Features:\n\nGame Modes: Free run & Time trial for Single player\nMultiplayer Powerup Race & Race mode – Compete with your friends!\n12 Levels which can be solved in many different ways\n4 difficulty modes for each map and game mode\nDiscover and use level modifiers and power-ups to get more momentum!\nAchievements to brag with at your friends\nOnline Highscore list – Be the first in the worldwide rankings!\nUnreal® Engine 3 Powered Game\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Digital Arrow","platforms":[{"id":0,"name":"PC"}]},{"id":14285,"name":"Neon Space 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ae/0ae47272f4bffb1911ede09c221289d1.jpg","description":"Neon Space 2 is a highly anticipated sequel to Neon Space. The game kept all the elements from his predecessor, but at the same time the visuals received a mayor improvement. Goal of the game remains the same, you still have to guide your ship through numerous checkpoints to finish the level, while dodging obstacles, timing your abilities, solving puzzles to advance through the game, while trying to beat your previous high-score to obtain the gold medal. You have 2 abilities on your disposal, both cool down based.\n**Slow ability- allows for the player to slow down everything except for the player itself.\n**Blink ability- allows you to jump a short distance. If you manage to time it right, you can even jump through some of the obstacles in the game.\nEnjoy the uplifting music, breath taking visuals, solve puzzles, don't be afraid to fail, the game might be a bit tricky towards the end, but everyone can master it, and become the NEON KING.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5541,"name":"Devil May Cry 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f68/f68ff2380793ac8e20e15b211c5d0201.jpg","description":"The sequel to Devil May Cry®, Devil May Cry® 2 introduces Dante’s devilishly agile partner Lucia. Together, she and Dante join forces to take on a horde of demons led by an evil man hell-bent on achieving supreme power. With dazzling aerials and intuitive control mechanics, Devil May Cry® 2 broke new barriers of stylish combat.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":52181,"name":"DYNASTY WARRIORS 9","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f3/5f32837b17b42552f63874428163e53d.jpg","description":"Experience the thrill of one versus thousands in an all new open world setting with DYNASTY WARRIORS 9, the latest installment in the series!\nAncient China is depicted on a single, vast, open-world map. Also, while maintaining the series' intuitive controls, we have included a new Musou Action system where you can experience the thrill of 'one versus thousands' like never before on an ever-changing battlefield. In addition, the captivating lives of our eclectic cast of officers intermingle in an expansive 'Romance of the Three Kingdoms' world that will allow you to feel completely immersed in the tides of history with our latest DYNASTY WARRIORS title!\n【Early Purchase Bonus】\nPurchase before March 12, 2018 and receive 7 bonus costumes.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1 player\n13MB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nDYNASTY WARRIORS 9 ©2018 KOEI TECMO GAMES CO., LTD. Published by KOEI TECMO AMERICA CORP.\nDeveloped by KOEI TECMO GAMES CO., LTD. DYNASTY WARRIORS is a registered trademark of KOEI TECMO GAMES CO., LTD. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":39465,"name":"Blur","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f45/f454179c3da178c785761db9e593949b.jpg","description":"Powered Up Racing! Go beyond just racing and enter the world of Blur. Take on the best as you battle through New York to Barcelona, Tokyo, L.A. and beyond. Power-Ups: Utilize an arsenal of Power-ups like Nitro speed boosts, Shock attacks, defensive Shields, and Mines.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Fireproof Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":28159,"name":"HUNTDOWN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5cb/5cb897cd1000906d2467ea4d0bdf1af4.jpg","description":"Huntdown. In the mayhem-filled streets of the future where gangs rule and cops fear to tread, only the bounty hunters can free the city from corruption. Lay waste to the criminal underworld and make a killing in this hard boiled action comedy arcade shooter.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Coffee Stain Publishing","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":21357,"name":"Jagged Alliance 2 Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0de/0defee61ebe38390fd3750b32213796d.jpg","description":"The small country of Arulco has been taken over by a merciless dictator - and only you can loosen the iron grip! Jagged Alliance 2 Gold Pack immerses you into an elaborate role-playing universe where you will interact with more than 150 characters, recruit your own band of soldiers and create your own custom mercenary to win back Arulco - not once, but twice! The perfect blend of strategy, role playing and tactical combat!","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Strategy First","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15019,"name":"Neon Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a9/4a926a445ff55fe936b458526e3ed53f.jpg","description":"Neon Space is a fun and simple but at the same time highly addictive game.\nThe goal of the game is to drive your little space ship from one end to another, dodging numerous obstacles, solving puzzles, opening new passages with checkpoints and discovering unique game mechanics by yourself. There are 50 levels, and there is also a cool medal system so you can always try your best for that shiny gold medal. If the game becomes too hard you can make it easier with your two in-game abilities slow and blink.\nSlow ability- allows for the player to slow down everything except for the player itself.\nBlink ability- allows you to jump a short distance. If you manage to time it right, you can even jump through some of the obstacles in the game.\nThese cool little tricks will have to be used on some levels to push you a bit closer to that medal. To make sure the game doesn't become too boring, new mechanics and tricks are being added to some levels, just to keep it spiced up through the entire play time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19391,"name":"Speedball 2 HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/436/43678d0a01da2d6b7cbaee7d06fb0b8e.jpg","description":"Speedball 2 HD is a modern reincarnation on the classic, futuristic cyberpunk sports game Speedball, originally developed by the Bitmap Brothers and first released for the Atari ST in 1990. A brutal mix of handball and ice hockey placed at break-neck pace. Now Tower Studios, Vivid Games and The Bitmap Brothers have created a glorious fusion of classic gameplay and modern technology to launch this game into the 21st century.\nGame DescriptionIn 2326, rival gangs formed an ultra-violent street sports league called Speedball to settle their deadly disputes. Two teams face each other in bloody battles for a steel ball: Nine on nine – in an all-out rush on the opponents’ goal. Almost any malicious move is permitted. The winner of the matches secures supremacy over the city.\nThe highly anticipated PC revival to the legendary Amiga classic transforms the futuristic game setting with state-of-the-art technology into a high-speed sports spectacle.\nThere are a huge variety of game modes and options - quick matches, single player tournaments, one-on-one multiplayer and full career mode. Your ultimate mission is to assemble your own Speedball team to win the Speedball Intergalactic Champions League and bring the greatest prize in Speedball back to Earth.\nChoose from 28 teams across 6 new Speedball Arenas, Speedball 2 HD includes all the intense gameplay of the original with new teams, more formations and in particular the new Fire, Ice and Cyber teams.\nKey FeaturesHD Graphics in classic Speedball style\n6 brand new Speedball Arenas\nChoose from 336 unique players and 28 Teams across 4 Planets\nFull Player Transfer Market and Player Upgrade System\nAbility to create and customise your own ultimate Speedball team\n5 different Formations allowing strategy changes during play\nScore with Goals, Bonus shots and Brutal Knockouts\nA host of Steam Badges, Cards and Wallpapers to collect\nOver 20 power-ups and special effects\nMultiple game modes including 10 Season Career Mode and 10 Single-Player Game Modes\nSupports game pad and keyboard controls for 2 players at once\nLocal multiplayer mode includes customisable tournaments for up to 8 player teams\nPlenty of Trophies and Achievements to collect\nThe World famous “Ice Cream... Ice Cream!!” sample","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Bitmap Brothers","platforms":[{"id":0,"name":"PC"}]},{"id":14406,"name":"LOVE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1da/1dae2a2131797f98ca6f21d39910df04.jpg","description":"Love is a reductive platforming game with a retro aesthetic and a focus on a challenging difficulty. It has an custom respawn system, 16 levels, 12 track soundtrack, competitive scoring, and a simple-to-use level creation feature.\nThe challenging levels are balanced with the inclusion of a simple yet unique respawn system wherein the player can leave a checkpoint at any location at any point, as long as they are on solid ground. Players have a number of gameplay modes to choose from, whether they want it easy, normal, or they want to try their hand at a mode designed specifically for Speed Running.\nBeyond the visual aesthetic, the challenging level design, and the abundance of features, there is the fantastic soundtrack composed by James Bennett, which brings the simple 3-color atmospheres to life.\nFeatures\n16 Levels\n7-Level Remix Mode\nOnline Leaderboards\nSpeedrun Mode for intense competition\n19 Achievements\nMulti-faceted scoring system for competitive play\nUnique Respawn Mechanic\nXinput-based Gamepad Support\nLevel Editor\nExtra 10 Level Remix Campaign, with Source Files","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fred Wood","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":530503,"name":"South of the Circle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68f/68f71ece009b9a4a5737ac8f9a3f87c4.jpg","description":"Antarctica, 1964.\nA crashed aircraft, tail to the sky.\n\nCambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.\n\nA love story between colleagues Peter and Clara, set against the backdrop of the Cold War, South of the Circle is a narrative adventure game about memory, survival, and the consequences of not dealing with the past.\n\n• Compelling and immersive narrative with a unique sense of time and place\n• Fully motion captured performances to achieve emotional realism, from a cast including Gwilym Lee (Bohemian Rhapsody), Olivia Vinall (The Woman in White), Richard Goulding (Belgravia), Anton Lesser (Game of Thrones), Adrian Rawlins (Chernobyl), and Michael Fox (Downton Abbey)\n• Nuanced emotional choices with a unique symbol-based mechanic\n• Rich, authentic environments\n• Deeply researched 1960s setting\n• Exploration, discovery, and environmental storytelling woven through the narrative","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"State of Play Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"iOS"}]},{"id":20192,"name":"Fairy Bloom Freesia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/888/888db7b7c66cd5faf53b3d31aed5f472.jpg","description":"Once upon a time, in a forest called Lita, there lived a fairy whose role it was to protect the trees of the forest from the monsters and humans who would try to steal the spirit stones that provide the forest’s life energy. Her name was Freesia and her kung fu was very, very strong…\nTake control of Freesia as she protects Lita Forest by beating the living daylights out of enemies invading the forest!\nUse Mana that builds up during battles to learn new skills. As Freesia progresses through the stages, she will pick up many powerful new techniques and abilities. Chain together combos and send enemies flying into other enemies to take out whole groups at a time & cause massive damage!\nBeat monsters, human and boss battles and survive long enough to progress to the next day. The more days you survive, the more varied and stronger the enemies will become, and the story of how the humans came to live in harmony with the forest unveils.\nUnleash the fairy fists of fury!Key Features:Beautiful 3D graphics and stunning effects!\nA huge repertoires of techniques, special moves and magic to obtain and use!\nHugely satisfying freestyle combinations, enemy juggling and attack chaining!\nFun cast of characters and story!\nFully-featured achievements system with 101 awards to achieve!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Edelweiss","platforms":[{"id":0,"name":"PC"}]},{"id":13163,"name":"Deus Ex: Breach","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e7d/e7da643ccd0f6ee387092218fa92f259.jpg","description":"Originally released as a Deus Ex: Mankind Divided game mode, Deus Ex: Breach is an innovative game that offers an arcade approach on the gameplay of the Deus Ex series, providing players with a unique connected puzzle shooter experience. As a Ripper in the year 2029, your objective is to obtain and sell classified corporate data by hacking into some of the world’s most secure servers, using the funds you acquire to upgrade both your skills and arsenal. By obtaining this data, you will be able to unveil and expose the deepest, darkest secrets of the corporations in the Deus Ex Universe, with your efforts potentially unmasking some of the most dangerous individuals in the world. Extract the data. Expose the truth.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Eidos Montreal","platforms":[{"id":0,"name":"PC"}]},{"id":11713,"name":"UNLOVED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/061/061fd6fc4f3f13a491bdd0d170bb8b28.jpg","description":"UNLOVED is based on the community award-winning mod for Doom2 with the same name by the same creator. UNLOVED is a strange place. A twisted reality. A nightmare that comes to life. A place where demons and abhorrent monsters manifest and possess the living with only one goal: to end you. Nothing wants you here. And there is no way out. Only the elevator that leads further and further down into the darkness of your insanity.\nPlay alone or in a group of up to 4 players and explore the endless amount of basement levels that are procedurally arranged every time you enter. Work as a team, open new areas, find weapon-mods, solve personal challenges, complete level objectives and unlock new skills to survive this trip into the unknown.Main FeaturesFast Paced Shooter Gameplay + Coop Features\nThe game resurrects the old-school fast paced action shooter gameplay. Combined with deadly monsters and modern coop-features that encourage playing in a team to stay alive in a harsh and deadly environment. Find and join other players online or play via LAN. If you don't feel like playing in a team, you can play alone just as well.\nRandomly arranged Levels\nEvery basement area is generated from hand crafted level chunks that are randomly arranged. After that, certain areas get locked by the “Architect” and you have to find certain key items to access them. Every level has final rooms with objectives the player has to complete in order to leave the level.\nCreate your own unique Play-Style\nBesides customizing your appearance, you can also create your own unique play-style. Equip magic trinkets with unearthly powers that can completely change the way you experience the game. Want to become super tough, or do you prefer to run super fast? Do you want to deal lots of damage, or have the highest chances of survival? The right combination of trinkets makes it possible and sets you apart from other players.\nPlay in 4 different Game Modes\nIf you want a different experience besides the Ultra Violence, you can also select alternative Game Modes that may suit your style a bit more. Classic Horror gets your blood pumping while you are desperately looking for enough ammunition to survive the next enemy. Arcade Style increases the already fast paced action to the max, giving you the ultimate killing frenzy experience. And then there is the HOT Mode - the most innovative game mode in years...\nFind Weapon-Mods to be more efficient\nEvery weapon can be upgraded with special mods. These can alter the way a weapon functions in dramatic ways. They may change the way the weapon operates, increase fire rate or give boosts like speed reloading.\nGain Karma by completing personal Challenges\nYou don’t just get experience points for killing monsters. Each time you play, certain challenges are given to you. If you fulfill your personal objectives, you get Karma points that you can spend to upgrade your Persona.\nUnlock new Items and the Mysteries that UNLOVED holds\nWithin the levels are different mysterious objects scattered. By collecting them, you can later unlock new player colors, ranks, trinkets and pieces of information that may or may not have clues about this unearthly realm of insanity.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BlueEagle Productions","platforms":[{"id":0,"name":"PC"}]},{"id":1414,"name":"Livelock","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/654/65469e340a8098a20be55b0fded5c7cf.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tuque Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":521,"name":"Quest of Dungeons","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a48/a48a3379fa3aa41fdae967c7d17a89c2.jpg","description":"Quest of Dungeons is a turn based dungeon crawler game featuring a good old 16-bit retro artistic look.\nThat thing people usually skip\nAn unspecific evil Dark Lord has stolen all the light, so your mission is to enter his lair and defeat him. That's it, now go get him.\nDescription\nBy playing as either a Warrior, a Wizard, a Assassin or a Shaman you have to traverse dungeons, defeat enemies and loot everything you can in order to survive. You can learn new skills in Tomes you find along the way and buy/sell items at shops.\nThe entire game is procedural so you won't find items/enemies in the same place each time you play.\nFeatures\nProcedural dungeons\nProcedural weapons\nBoss encounters\nQuests\n4 Difficulty levels\nPermadeath - Once you die, game over man, game over!\nShop - buy and sell items/weapons\nLeaderboards - compare your Adventure points with the community","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"David Amador","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":762618,"name":"Return to Monkey Island","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/db8/db86188577f4b61dfd2a960e18f660a5.jpg","description":"Return to Monkey Island is an unexpected, thrilling return of series creator Ron Gilbert that continues the story of the legendary adventure games The Secret of Monkey Island and Monkey Island 2: LeChuck’s Revenge developed in collaboration with Lucasfilm Games.\r\n\r\nIt’s been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of Monkey Island. Hip, young pirate leaders led by Captain Madison have shuffled the old guard from power, Melee Island has taken a turn for the worse, and famed businessman Stan has been imprisoned for ‘marketing-related crimes’.\r\n\r\nBanter with old friends and new faces on familiar islands now under dangerous new leadership. Then, take to the high seas and explore the new and unknown as you work your way out of tough predicaments. Clever puzzles, bizarre situations, and devastating ripostes are all that stand between Guybrush and glory.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Lucasfilm","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":485019,"name":"Craftopia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b01/b01271e8e2190b0e9a8d641c904c71c2.jpg","description":"Craftopia is the brand new multiplayer open-world survival action game.\nWe have imagined what would happen when we combine our favorite video games altogether.\nChop trees and mine stones as in Sandbox,\nExplore the world as in Open-world,\nFight the hunger as in Survival,\nCultivate and harvest as in Farming,\nCollect loots in dungeons as in Hack-and-slash,\nAutomate activities as in Factory management,\nHunt monsters and creatures as in Hunting action,\nCast magical spells as in Fantasy RPG.\nNow we have a utopia for all of us. That is Craftopia.Farming20+ crops are available for you to grow. Of course, you can grow crops one by one, but there are more you can do. With the power of agricultural machines, you can have large scale fields.\nWhile enjoying your self-sufficient life, why not make your colorful orchards?\nIndustrialization and AutomationYou can automate every single item gathering. When you get tired of cutting woods and mining stones? Let's automate!\n...Tired of automation of simple activities? Then let's start using belt-conveyers to build huge factories.\nBreedingBy throwing Monster Prism at creatures, you can catch them as a pet. Not only animals like cows and deer, but most of the monsters are also tamable. Monsters, Gotta Catch 'Em All!\nExploring DungeonsWhen the detector starts beeping, it's the sign that you're getting close to a dangerous dungeon. Back to the town to equip yourself, then enter the dungeon in the hope of finding treasures. It changes its shape every time you enter. At the end of the dungeon, you will encounter bosses to fight.\nYou will gain new abilities when you unleash the power of the world.\nFishingIn Craftopia, you can enjoy fishing too. Taste some fresh fish, and craft a shield from turtle shells! Once you get used to fishing on the coastline, it's time to build a ship to sail! Let's catch a whale!\nVehiclesHoverboards, motorbikes, helicopters, automobiles, biplanes, tanks, air balloons, and machinery... Gather materials to craft what you want to ride! You can share a ride with your friends to explore the world together!\nSkill Tree100+ skills to learn in Craftopia. You can create your character by learning various skills. Some are good at crafting; some are skilled at broad swords; some might do better in automation. Your job will vary throughout the adventure, depending on your play styles!Character CreationGender/sex, race, hairstyle, eyes, faces, skin tones, facial hairs, face painting, you can customize all of them!MultiplayerMultiplayer is available. You can build factories, explore dungeons, catch fish with your friends. The choice is yours! You can be an assassin if you want to.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"POCKET PAIR","platforms":[{"id":0,"name":"PC"}]},{"id":244698,"name":"Sky: Children of the Light","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb1/cb14d42b58bdb6cf5948d0eed778c2f0.jpg","description":"From the award-winning creators behind Journey (2013 Game of The Year) and the highly-acclaimed Flower, comes a ground-breaking social adventure that is set to warm your hearts.\n\nWelcome to the enchanting world of Sky, a beautifully-animated kingdom waiting to be explored by you and your loved ones.\n\nIn Sky, we arrive as the Children of the Light, spreading hope through the desolate kingdom to return fallen Stars to their constellations.\n\nIn the kingdom of Sky, you can...\n- Soar and explore 7 dreamlike realms to uncover the mystery\n- Encounter and socialize with like-minded players from around the world\n- Feel free to express yourself with a delightful selection of character customizations\n- Team up with others to adventure into darker realms, save spirits and uncover ancient treasures\n- Gift candles of light to share appreciation and grow friendships\n- Enjoy a unique musical experience and create harmonies together\n- Join an ever-expanding world with new upcoming attractions, including seasonal events and expansion of realms","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"thatgamecompany","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":20298,"name":"My Lands: Black Gem Hunting","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/603/603d91ff96c6df0176accb390a614309.jpg","description":"My Lands is a free online RTS where dark and light forces fight for Black Gem and dominion in a vast fantasy world.\nCooperation between players, joint economy development, creation of clans and alliances and elaboration of a team strategy serve as the very foundation of the game. Player chooses one of four races to lead it to the victory through ruthless wars over dominion in the universe of My Lands.Main FeaturesNo to \"grind\": a unique system of skills allows players to develop cities and heroes even while being offline.\nVast game world: infinite expanses of land to be explored and conquered by thousands of players in one universe.\nAdvanced quest system: even the most experienced gamers will be struck by the great number and variety of quests which encourage faster development and help in making out your own game strategy.\nDiplomacy, intelligence and trade: a well thought-out team strategy leads to victories in the world of My Lands.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Forbes  Consult","platforms":[{"id":0,"name":"PC"}]},{"id":16739,"name":"Delta Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d4/2d4f55023e48b7eb5e861aac6e9b417b.jpg","description":"As a member of Delta Force — The Army's Elite, top secret special forces unit — the word 'impossible' is not in your vocabulary. In Delta Force, you will conduct missions swiftly and silently, in every possible terrain, under every imaginable condition and through unconventional means.\nFeatures\nImmersive environment consists of real-world effects, such as bridges that creak, insects that buzz, flocks of birds that form and re-form, and fish that bite.\nWatch your enemy's every move, listen for their approach then strike with brutal precision over the most heartbreaking pieces of terrain the world has ever seen.\nPlay in either 1st or 3rd person across miles and miles of vast outdoor environments. Engage the enemy over unprecedented distances.\nPlay over 40 gut-wrenching missions across five continents ranging from airfield takedowns in Central Asia to clearing out S. American cartels to stopping Nuclear terrorism in Northern Russia.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"NovaLogic","platforms":[{"id":0,"name":"PC"}]},{"id":13496,"name":"Lost Ember","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/107/10719fa9fdfbaa66ea321b69d5d4c6b9.jpg","description":"Lost Ember is a storydriven 3rd person exploration adventure for PC and consoles. With a wolf as your main character and a determined companion on your side, you will unveil a story of loyalty, despair and betrayal that led to the fall of a whole world.\nOn your journey you are guided by a companion that used to be part of the old Inrahsi culture and witnessed the fall of his world. For thousands of years he was seeking and finally found you. Through his memories you will see what happened to the old world, what he has to do with it, and why he now needs your help.\nYour ability to possess every animal in the world enables you to explore the world in a lot of different perspectives to find hidden secrets and places that played a role in the fall of the Inrahsi and hold important memories.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mooneye Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":5873,"name":"The 7th Guest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46a/46afd3f0208633c58126d694bb95b933.jpg","description":"Henry Stauf's mansion has been abandoned for as long as anyone dare remember. Stauf was a master toy maker, a maker of amazing puzzles and this strange house was his greatest creation. Now the mansion stands empty, rotting ever since the children started dying, ever since the six guests came. Now there are only the eerie lights and the terrible sing-song rhymes of the children.\nAnd suddenly, you are in the house. You move from room to room, step-by-terrifying-step, as scenes from that night of horror come to life. Because Stauf's game isn't over. There were six guests the world knew about - and there was one other. Stauf's mad mansion lives again. And only you can end the nightmare and learn the secret of The 7th Guest.\nThis Award-Winning Game Features:\nGroundbreaking use of full-motion video and dialogue recorded by live actors in a terrifyingly real virtual environment.\nOld Man Stauf's bizarre puzzles to solve and games to play.\n22 Stunningly rendered, devilishly surprising, 3-D rooms await you in this fully explorable haunted mansion.\n2 CDs of extensive gameplay with an original musical score.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Trilobyte Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":50198,"name":"Tokyo Xanadu eX+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ba/0ba41547074a5c88cc63bafbb6ea6127.jpg","description":"Tokyo Xanadu eX+; a massive action RPG from the masters of the genre, Nihon Falcom! When high school student Kou Tokisaka encounters the nightmare realm known as the Eclipse, his world is forever changed.\nIn this definitive version of Tokyo Xanadu, experience the game in 60 FPS along with new scenarios, new playable characters, new modes and more!\nKey Features\n40+ hours of Action RPG gameplay!\nQuest through Morimiya City and battle hordes of nightmarish monsters!\nExplore a Brave New World\nTalk to characters, build relationships and forge alliances as you navigate the expansive cityscape of Morimiya City. Upgrade your equipment, play mini games and train in dungeons!\nNew Scenarios!\nEnjoy unique tales of the Wielders that weren’t depicted in the main story. Once you’ve completed the game, get access to an all new quest and carry on the adventure!\nNew Playable Characters, New Monsters, Dungeons and Bosses!\nPlay as the mysterious knight, White Shroud. Brandish unrivaled strength and the powers of light to take down vile monsters and vicious bosses! Plus, new dungeons filled with fierce new monster types and giant bosses to battle!\nNew Modes: “Time Attack” and “Boss Rush”\nIn Time Attack, defeat various bosses that appear in the main story as quickly as possible. In Boss Rush mode, you can battle each boss one after the other.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Aksys Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":24673,"name":"Quantum of Solace","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/858/8588039ed3ddb3eae2311c26a95d3980.jpg","description":"BOND IS BACK. Blending first person shooting and third person cover combat, Quantum of Solace the Game puts you in control of Bond's greatest weapon — his mind. Based on both the Quantum of Solace and Casino Royale films, Quantum of Solace the Game puts you in the midst of the high-octane world of international espionage and intrigue.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Treyarch","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":14274,"name":"LostWinds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ea/1ea365fb68c572f77025524a26a3ab6b.jpg","description":"LostWinds is an enchanting adventure bursting with unique gameplay ideas that puts “the power of the wind in the palm of your hand”.\nYou wield the awesome powers of Enril the wind spirit - from raging tornados to the gentlest breeze – to guide and protect Toku, a young boy who is the only one who can help you release the curse placed upon the world of Mistralis by the evil spirit Balasar.\nThe game’s novel and playful control mechanism lets you use Enril’s elemental powers to help Toku in your quest to overcome Balasar – powering his jumps and glides through Mistralis’ different regions, buffeting and smashing enemies, and solving puzzles.\nExperience all of the magic of Mistralis, a land full of wonder and intrigue that bursts to life with your every action and exploration.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":14022,"name":"DUNGEONS","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7b/f7b1cf81632880407321f8e3385c5ee6.jpg","description":"A mighty hero stalks through a dark, dank dungeon making life miserable for hordes of pitiable monsters as he steals anything and everything not bolted to the floor. Been there, done that - about a thousand times? Then it is definitely time to switch sides and show that hero just who's who in the dungeon!\nAssume the role of a mighty (and mighty evil) Dungeon Lord and create your own diabolical demesnes underground. Dim-witted goblin workers tremble as they await your orders and dig corridors and rooms into the rock at your command.\nHeroes will visit your dungeon in search of battle and treasure.\nNaturally, you could always just annihilate them with a snap of your fingers. But isn't it more entertaining and deliciously evil to watch them attain their heart's desire - and then take take it ALL away?\nSo throw them a few treasures and some equipment, give them a couple of fights for entertainment and cherish and look after them. And once they are finally happy enough - it's time for the \"harvest\". For happy heroes have more valuable soul energy for you to gleefully extract from them in your prison or torture chamber!\nBut even though these self-proclaimed warriors for the good are not much more than an excellent source of resources for you, you still should not underestimate them. If you've beaten up too many of their friends, the powerful and vindictive Champions will occasionally make their way to your Dungeon. Perhaps a small sum could persuade them to forget their moral and ethical principles for once?\nIn addition to the heroes, you should also always keep an wary eye on the underground. For the competition never sleeps, and other Dungeon Lords would like to claim your territory for themselves. As if that were not enough, another Dungeon Lord lives one level below you who, to top it all off, is also your boss and bombards you with useless tasks! Of course, it goes without saying that malicious and sneaky beings such as yourself are already hard at work trying to take his place!\nStory\nThe game revolves around Deimos, foremost of all Dungeon Lords. He falls victim to a devious plot hatched by his vile, nasty, thoroughly vicious ex-girlfriend Calypso, and suddenly finds himself at the bottom of the hierarchy and the top of the dungeon once again.\nAs the story proceeds Deimos tries to regain his old place and have his well-deserved revenge on Calypso. First, however, he will have to deal with his new bosses. On the one hand , there's the Zombie King, who is about as intelligent as your average undead zombie is likely to be, and on the other there's hot-blooded Minos, who likes to solve problems using violence or, alternatively, more violence.\nKey features:\t\t\t\t\t\tBe insidious! Three different Boss Monsters await in order to give you a real hard time. Get rid of them to become the one and only Dungeon Lord!\nGet ready for a fight! 10 different classes of heroes dare to enter your dungeon where 15 different monsters lurk in the dark\nThe 17 campaign missions demand your whole cunningness as evil dungeon lord. If you manage to survive them there's still the custom game waiting for you.\nIn a dungeons there's only one way: going down. 3 different levels wait to be conquered by you.\nPrison cells and torture chambers are ready for your command and await “customers”\nCreate the dungeon of your dreams with 50 different objects\nWimpy goblin workers await your commands and create the dungeon after your wishes.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Realmforge Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9643,"name":"Miscreated","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/020/020b0318037bfe3a030607c0d4d2ff4f.jpg","description":"This is an early ALPHA release of MISCREATED. The current feature set is limited, but will be increased as development continues. You will experience issues during gameplay - incomplete features, bugs, game crashes, performance issues, and even complete character wipes.\nNobody knows what started the Final War — it was over too fast, fought with the last of the belligerent nations’ nuclear stockpiles, and the ones who pulled the triggers didn’t survive. It was the Final War because after that there was really nobody left who wanted to fight; we were all too busy surviving. Half a century of wars using nukes, bioweapons, nanoweapons, and even kinetic-kill weapons, gave us the Empty World: population 100 million and falling fast.\n\nWho’s to blame? Depends on who you are, but you could just as easily blame the weapons industry; by the end, virtually every arms dealer in the world was owned by Amalgamated Corporation; while everyone was fighting they’d been buying up what Karl Marx used to call “the means of production,” and in the end missiles on both sides proudly wore the AC label.\n\nHell, in the end AC made just about everything, AC Sportsdrinks, AC Icecream, AC Battlegear, even AC Happytabs. I miss those. AC even gave us our wonderful mutant problem; the “vaccine” they developed when radiation sickness became as common as seasonal pneumonia from all those dirty battlefields — all the weapons-grade isotopes getting into the water table, or the fish, or the air — reacted with some of the leftover bioweapons and made lots of people go as squirrely as tab-pumped cannibals. You can ignore a neighbor developing neo-elephantitis or novuleprosy, but when he tries to eat you, you’ve got to take an interest.\n\nSo that’s it, we’re done, civilization is taking a breather. In 2089, anyone left alive and unmutated is just focused on staying that way. There are stories of enclaves here and there, where they’re lucky enough to have plenty of food stockpiled and mutants are thin on the ground or there’s lots of ammunition to throw at them. My advice is find one. Or make one. The Earth abides, all this too shall pass away, and if Darwin blesses you then you or your kids will inherit what’s left. For now, it’s one day at a time.Current Features in the Early Access Release\nOnly a portion of the current map is available to play on.  We will expand it as fast as we can.\nBase Building:\nCompletely freeform basebuilding system - the Miscreated basebuilding system is different from all of the other existing survival games available and it gives you total control to make as complex and pretty of a base as you want. This is not the typical, snap-together Lego style system other games have.\nOver 100 different parts are currently available for your base, with more coming soon.\nSeveral different categories (with many subcategories and types) of parts available - wood, sand, tires, powered. Metal to be added in a future patch.\nAnyone can interact with your base - repair parts, turn lights on/off, open/close unlocked doors, turn generators on/off.  Non-clan members cannot alter the structure of your base - add/remove parts, attach/detach parts to power.\nFind crafting guides to learn more advanced basebuilding recipes.  You can also find someone that knows a part's recipe you don't and politely ask them to make the part for you.\nJoin a clan to have fellow clan members help you build your base.\nBasebuilding restrictions - bases cannot be placed in towns or some other key areas to prevent griefing in those areas.  Other players also cannot build bases very close to your base.\nPack up and move undamaged parts - if damaged, you can repair them first, or you can dismantle damaged parts to get one of the crafting materials back.\nDamaged states for parts - at each 25% damage the color of a damaged part will darken more.\n\nClans are persistent (remembered between server restarts and logging in/out) and per server.\nClans can be created, disbanded, and you can invite other players to your clan by targeting them and using the mouse wheel option.\nInvited players can decline an invite or accept it.\nClan owner can promote other clan members to be a clan captain, so they can invite new, or remove existing, clan members.\nFor this release, all clan members can alter the structure of any clan owned bases.  In a future release there will be more specific permission controls added.\n\nIn-game VoIP with distance attenuation.\n\nFive vehicles are currently fully functional in the game.  Scavenge for parts to get them running!\n\nA basic crafting system is implemented allowing you to make more powerful melee weapons and items such as advanced bandages.  The crafting system is being expanded as the game progresses.\n\nBullet trajectory will change based on gravity, air resistance, and wind.\n\nEncounters can be spawned dynamically and located anywhere on the map.\n\nWeapons and items will usually be found in logical places, but can also be found anywhere in the world. Be sure to check everywhere for items – lockers, stoves, cupboards, and many more. Some appliances can be opened to look inside.\n\nYour character’s stats and items will be saved when you exit the game. When you log back in, you will have your health, items and location all restored.\n\nStore items on your character and collect weapons, ammo and other useful items.  You can also find additional items to increase the amount of storage space your character has – like backpacks, shirts, and pants.\n\nKeep your hunger and water levels up in order for your character to function at maximum efficiency. Low levels of food and hunger have a negative impact on your character’s performance.\nWhen you die all of the items you were carrying stay with your character’s corpse.  Other player’s can take them, or you can retrieve them yourself if they are still there when you get back to the corpse.\n\nKill anyone at anytime and steal their loot. There are no safe zones.  However, it will be very beneficial in the long run to make a few friends.\n\nRain, fog, wind, and other weather patterns are all dynamically generated and will create unique game play opportunities.  The intensity of weather patterns will also be supported – from light fog to dense fog, for example.\nFull Day/Night Cycles\nCharge in during the day or wait until night time for a sneaky approach. The game features a real 24 hour clock based on the location of the server you are playing on.\nFirst and Third Person Camera Views\nSwitch views based on personal preference","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Entrada Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":638655,"name":"GRID Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8cb/8cbf9a1735ae48b70b9aba5f82ab56da.jpg","description":"Welcome to GRID Legends: a high-stakes driving experience that combines thrilling unpredictable motorsport, incredible race variety, and an immersive driving story that puts you at the heart of the action.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":290066,"name":"Coloring Game","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a4/0a4699617ac587b23c9afcc95d04779e.jpg","description":"Coloring Game is a fantastic anti-stress game. Color pixels without any hurry while listening to beautiful background music.\nThere are three playing modes: Fill, Pencil, and Free Drawing. Each playing mode has a gradation of difficulty which will help you adjust the game according to your current mood.\n1. Fill.\nThe easiest playing mode. You have the whole bucket of paint at your disposal. You are going to color not just single pixels but areas with adjoining pixels which share a horizontal o a vertical border.\n2. Pencil.\nThe classical playing mode and the moderate level of difficulty. Your coloring tool in this playing mode is a pencil. You can color only the pixels at which the cursor points in the moment of pressing or holding down the left button of the mouse.\n3. Free Drawing.\nThe most challenging playing mode. The coloring in this mode is very similar to working in a raster graphics editor. The following tools are available: Pencil, Fill, Dropper, and Eraser.\nThe playing screen is divided into two parts:\n1. Drawing area. Unlike in other playing modes, pixels are not numbered.\n2. Reference image.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]},{"id":23768,"name":"The Legend of Zelda: Majora's Mask 3D","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a7/5a776ec17c5e6247e0c3f61ee1ade097.jpg","description":"In three days, the moon will fall and the land of Termina will meet with\na terrible fate. Can you save it in time? Relive the world’s final 72\nhours, solve elaborate puzzles, conquer dungeons, battle giant bosses,\nand befriend the doomed people of Termina in one of Nintendo’s most\nsuspenseful apocalyptic adventures ever.\n\nThe Legend of Zelda™: Majora’s Mask 3D is a remastered and enhanced\nversion of the Nintendo classic that’s unlike any other Legend of Zelda\nadventure. In this shadowy tale, a masked Skull Kid drags Link™ into the\nworld of Termina, where the moon is falling from the sky. Lucky for\nTermina, Link can reverse time and relive his last 72 hours in limitless\nways. Each time, he’ll don any of his 20+ masks, help different\ncitizens, battle different bosses, and ultimately change the fate of a\nworld. This is the definitive version of a dark classic.\n\nAn ancient evil has doomed the world of Termina. Can you save it in\njust three days?\n\nTogether, the land of Termina and its citizens form one massive puzzle\nfor Link™ to solve\n\n20+ powerful masks make this one of the most varied Legend of Zelda™\ngames ever\n\nRelive Termina’s final three days from multiple perspectives\n\nCharacters live out their final days independently on separate but\nintertwining paths","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":1111,"name":"METAL GEAR SOLID V: THE DEFINITIVE EXPERIENCE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/72b/72bfec99eb3127c4e01fd60f79133965.jpg","description":"METAL GEAR SOLID V: THE DEFINITIVE EXPERIENCE is the ultimate collection of the MGSV story which includes the critically acclaimed MGSV: THE PHANTOM PAIN, its prologue MGSV: GROUND ZEROES,  multiplayer METAL GEAR ONLINE, and all their DLC content.\n• MGSV: GZ lets the players experience thrilling stealth action as never seen before, surrounded by enemies in a photorealistic world.\n• MGSV: TPP, which has claimed more than 60 industry accolades including a 10/10 from IGN  and Gamespot, offers limitless possibilities for the players to infiltrate enemy outposts in a vast open world. The player to decide the route, tactics and timing that can lead to the success of the mission.\n• METAL GEAR ONLINE is built around a dedicated squad-based competitive multiplayer structure, which has been fully redesigned with the familiar gameplay and aesthetic styling of the MGS series\n• 36 DLC ITEMS AND ADDITIONAL CONTENT including 2 extra missions, additional weapons, and items used for customization.\nOnce you have installed MGSV:TDE on your PlayStation®4 system and have imported your saved game data from the original MGSV:TPP, we recommend you only use the MGSV:TDE application to continue your Metal Gear journey.  While the original MGSV:TPP is still playable,  the saved game data will be overwritten by MGSV:TDE. This may cause problems when playing online.\n*Please note, when switching from MGSV:TPP to MGSV:GZ, the game will ask if you want to quit MGSV:TPP and launch MGSV:GZ. This process will happen while in the MGSV:TDE application.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1-4 players\nNetwork Players 2-16\n35GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2015 Konami Digital Entertainment. “Metal Gear Solid” is a registered trademark of Konami Digital Entertainment Co., Ltd. Published by Konami Digital Entertainment. Developed by Konami Digital Entertainment Co., Ltd.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]}]