[{"id":16438,"name":"Ground Control II: Operation Exodus","genre":"Strategy","price":0.0,"description":"Command an Army. Fight for Freedom.\nGround Control II: Operation Exodus delivers real-time strategy with the flair of an action game.\nIt’s 2741 and the universe is at war. The savage Terran Empire is laying siege to the Northern Star Alliance, a treaty of colonies that upholds freedom and democracy. After losing the battle in space, the NSA is forced to retreat to its last stronghold. The situation is desperate, but for the NSA, destiny is at hand. Its only hope now lies in an ancient legend...Ground Control II: Operation Exodus includes\nThe original Ground Control IIKey Features\nA singleplayer campaign spread across 2 factions and 24 squad-based missions.\nPlay through the campaign in co-op with up to 2 other players.\nDrop-in competitive multiplayer* for up to 8 players across 10 different maps (LAN ONLY).\nLead your squad of infantry, tanks, artillery and aircraft to freedom.\nCommand the alien Viron army and meld your troops into more powerful units.\nEnjoy a fascinating, futuristic story with thrilling plot twists.\nTop-quality graphics that look great – even by today’s standards!\n*Multiplayer notice: Because Massgate is no longer operating, playing over the Internet is no longer possible. Playing through a LAN is still available.","imageUrl":"https://media.rawg.io/media/screenshots/115/1158663e08dbbc5125253c60e881b976.jpg","releaseYear":2004,"developer":"Massive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16261,"name":"Honey Rose: Underdog Fighter Extraordinaire","genre":"Action","price":0.0,"description":"IMPORTANT NOTE: For all information regarding DLC and the \"Pay-what-you-like\" remuneration model, please read the information below!\nWhat the game is about:\nHoney Rose: UFE tells the story of Red, a young university student with dreams of making it big at the masked fighting tournament.\nShe looks up to Big Blue, the current champion, and aims to meet her idol in the ring! However, she has a history of poor class attendance, and has repeatedly failed her latest classes.\nThis year, she made a deal with her parents: she’d either graduate, or they’d change towns. Unfortunately, the masked fighting tournament also takes place for the first time in the very town Red lives in... making it her one and only chance to make her dream come true!\nThankfully, that’s where you come in!\nWith your guidance, she needs to balance her studies with her training so she can bring home both the champion's belt, and her graduation.\nThe game is a life-management simulation, presented as a visual novel, with beat'em-up elements.\nIn short: some reading, a little fighting... and lots of planning!\nFeatures:\nA visual novel based around choice and reactivity! See how events unfold based on your decisions... or lack of commitment!\nA sizeable cast of characters to encounter in dynamic events, with individual subplots to pursue!\nFight for your dreams in the ring, or to get back your suit from dastardly thugs in the street!\nPlan ahead to make the most of the 6 months you have left until graduation!\nBring home the champion's belt if you can, but make sure to ace your tests as well! Can you really do both?\nPricing\nThe game uses a \"pay-what-you-liked\" remuneration model.\n\"Pay-what-you-liked\" is a system designed after \"pay-what-you-want\", except you choose to support the game *after* having played it for yourself, and determined its personal value based on your own experience. It is designed to offer each player the most choice possible in how, when and why when considering whether to support the game or not.\nSince Steam doesn't support \"pay-what-you-liked\" or \"pay-what-you-want\" remuneration systems, the DLC acts as a stand-in to offer multiple suggested tiers of support.\nIMPORTANT NOTE: buying DLC stands in for supporting the game at the value of the suggested tier. It will NOT enhance or change your ingame experience, you will not be getting additional content other players can't access, as the aim for this system is for the game to be the same for everyone: ie, its most complete state right off the bat! That also means the game is NOT F2P/P2W: there is NO in-game economy that allows you to pay for additional content. The game is fully available for free from the minute you start playing it!","imageUrl":"https://media.rawg.io/media/screenshots/979/979988e73ca4dbd7a69a136d53782236.jpg","releaseYear":2016,"developer":"Pehesse","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15177,"name":"Wooden Floor 2 - Resurrection","genre":"Adventure","price":0.0,"description":"\"Wooden Floor 2 - Resurrection\" is a first person horror/mystery adventure game. Just like the prequel this game is pretty much an one man project by me (Pheenix93).\nThe game is telling the story of Andrew Winter, an alcoholic living in a small cabin near the woods. He keeps having nightmares about an abandoned place that seems familiar to him. You have to reveal the dark secrets that are hiding in the abandoned mansion on top of the hill in Blackdust Field.\nAre you able to find out the truth hiding in the deepest insides of the house?\n\"Wooden Floor 2 - Resurrection\" is the sequel to Wooden Floor, telling the other side of the story and completing the puzzle.\nFeatures of Wooden Floor 2:\nMultiple endings!\nDifferent playthroughs as the game changes upon choices you make, your behaviour and at certain points randomly\nMore interaction with the world\nSecret riddles in game that may open up new possibilities for you (if you are able to reveal them)\nImproved story telling in comparison to Wooden Floor\nDifferent locations\nUseable items\nBig improvements to graphics and gameplay!\nBesides all this there is still potential to add more content to the game once i feel like its about time. So there may be more to come...","imageUrl":"https://media.rawg.io/media/screenshots/2f7/2f7bcf78f4fe4448bf2f811299e8e3da.jpg","releaseYear":2016,"developer":"Pheenix93","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14771,"name":"Wolf Simulator","genre":"Action","price":0.0,"description":"Just UpdatedWolf Simulator v1.1\nWhat's new:\n- Completely redesigned night vision;\n- Added an indicator showing how much you explore the game world;\n- Redesigned interface;\n- Fixed a bug with the selection of wool;\n- Fixed bugs in the selection of the wolf class;\n- In a resolution of 1920 X 1080 fixed some bugs in the display of HUD and text;\n- Added the sound of the lakes;\n- Added more lakes, it is possible to drink a Coke;\n- HP is now displayed in your pack of wolves;\n- Has reduced the rate of movement of people, they were almost impossible to catch up;\n- The opportunity to eat the wolves (the achievement of \"cannibalism\");\n- A note telling about the witch in the forest Central;\n- Simplified the passage of quests (it was difficult to find a bush with berries, etc);\n- Balanced recovery of stamina and HP;\n- Added a new menu;\n- Cold autumn nights were even more severe (by reducing the minimum temperature at night);\n- Fixed bug pumping speed and strength at high levels;\n- Now when entering enemy territory shows the distance to the opponents;\n- Is working on the optimization;\n- Added a couple of Achievement;\n- Fixed some syntax errors;\nAbout the GameWolf Simulator is a simulator of a wolf with elements of survival. Before you start the game you will need to choose the class of a wolf. At the moment there are two of them : \"the Warrior\" and \"Scout\". Class wolf depend on various characteristics such as speed, stamina, attack power, etc. as the game progresses, your wolf will grow, participating in battles between packs over territory, to hunt a variety of wild animals ,increasing their strength. In the battles for territory will earn points lead ,which in turn will be used for base and expanding your own pack ,which will be under your authority .\nThe game world is completely open and is divided into three main areas : the city, wildlife, reserve, in addition, it consists of territories that can belong to the enemy swarms, or to be free, at the moment more than 30.\nThe city is filled with real people who live their lives, and often choose to rest in the forest or strolling around the Park . But be careful, poachers often set traps or you can run into a disgruntled woodsman with an axe . The forest is filled with various wild animals, which are mostly unfriendly, so be ready.\nThe game is fully simulated survival in the wild, you will need to satisfy the hunger, thirst, to warm up cold nights or rainy days .\nAs the game progresses you will encounter a variety of interesting places for exploration, puzzles, and picturesque places, ruins, abandoned houses, caves, etc.\nGame features:\nDynamic change the time of day and weather conditions (clear sky, partially cloudy, cloudy and thunderstorms, light rain, heavy rain, snow) .\nAdvanced artificial intelligence of wild animals and people.\nThe elements of horror.\nA large number of areas that need either to capture or to defend against enemy swarms.\nSimulated survival in wild environment with all the factors(health, fatigue, thirst, hunger, the influence of ambient temperature on the body ).\nBig game world to explore.\nAnd a lot more.","imageUrl":"https://media.rawg.io/media/screenshots/6f7/6f7286e9b652801d047d82ba17e6914f.jpg","releaseYear":2014,"developer":"Second Reality","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":14227,"name":"League Of Guessing","genre":"Casual","price":0.0,"description":"How much do you know about League Of Legends ? Guess , Solve , Rank UP.\nLeague of Guessing is a fan-made guessing game. The objective of the game is to discover the name of the League Of Legends’ Champion based on their abilities.\nThe game has two modes, a single player mode where the player gain IP for guessing Champions, IP can be changed for keys. Each Champion starts with 1 unlocked skill. You can unlock the other 3 skills with keys. There are daily key prizes and free keys in our Facebook page, so stay tuned! You also obtain free keys every 3 minutes of play.\nThe second mode is 3x3 Multiplayer mode, where the player joins a team with two other players and play against three others. The game lasts for two minutes and the wining team receives IP and LP. LP is the points system used for ranking, with the ultimate goal of reaching the CHALLENGER League.\nLeague Of Guessing isn't endorsed by Riot Games and doesn't reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League Of Legends. League Of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League Of Legends © Riot Games, Inc.","imageUrl":"https://media.rawg.io/media/screenshots/288/288adc91d648b0dc278e1dec7b86f4d6.jpg","releaseYear":2016,"developer":"PinchPoint","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13850,"name":"Millennium 3 - Cry Wolf","genre":"Adventure","price":0.0,"description":"Backstory\nMarine and her friends are back!\nTime is running out for the showdown and the Lords of Mystrock are nastier than ever - but Marine has other priorities!\nShe has to explore the Eastern part of the world with the hope to find new warriors! But little does she know that she is going to be sidetracked in order to help some of her friends!\nWhat will happen next? Will Jeanne be back? Is Bokden still as elusive as ever? Play and find out!\nMillennium 3 features 40 quests, 32 secret rooms, up to 11 animals kings and a whooping 20-30 hours of gameplay!\nDetails\nMillennium 3 is the third episode of Aldorlea's flagship series (the makers behind The Book of Legends, Moonchild, Dreamscape, 3 Stars of Destiny, Asguaard, Undefeated etc.).\nFeaturing an immersive story, this game is a fantastic chapter to a series greenlighted by the Steam community that spans over 5 episodes and features more than 20 characters in total. Key Features\n40+ achievements to unlock - can you get them all?\n4 levels of difficulty - choose your difficulty and enjoy replaying the game at its most challenging\nChoose visible or invisible monsters - cater to the encounter style you prefer\nOptional guiding arrows - enjoy the game without the worry of having to look up a walkthrough or guide\nDozens of secret rooms - for those who like to explore and discover every secret\n40 quests - easy request from a villager or very tricky riddle to solve, help people as you progress in your adventure\nBattle superb monsters including 11 Animal Kings - they are the most dangerous and feared creatures out there, so beware\nGorgeous retro graphics and musics - Millennium features high production values in its genre, all for your enjoyment\nRPG Fan's Indie RPG of the Year 2009\nBest-Selling Games by Aldorlea\nhttp://store.steampowered.com/app/277470\nhttp://store.steampowered.com/app/332380\nhttp://store.steampowered.com/app/370670 Aldorlea Useful Links\nOfficial Website (contains 100+ games including all 15+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)\nMillennium Help Forum (tons of info to be found there for the aspiring adventurer)","imageUrl":"https://media.rawg.io/media/screenshots/afd/afdeec67bfaa88978f75937a2796590a.jpg","releaseYear":2014,"developer":"Aldorlea Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13338,"name":"Cat Goes Fishing","genre":"Simulation","price":0.0,"description":"Start out on an island with nothing more than a basic rod. Progress into a radar-wielding master fisher-cat scouring the sea for the biggest and baddest fish. Each fish has unique behaviors that you will learn to exploit as you tailor your arsenal of fishing rods to suit your style of play.Key FeaturesComplete quests to earn cash.\nUnlock better rods to catch more valuable fish.\nCustomize your rod with upgrades to suit your play style.\nUnlock boats to travel out onto the sea.\nFind and equip rare hats that dramatically change the dynamic of the game.\nFill your catalog with the fish you catch.\nDiscover what lurks in the dark depths.","imageUrl":"https://media.rawg.io/media/screenshots/09a/09a1b3474816797d205de00badcc94fb.jpg","releaseYear":2015,"developer":"Cat5Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11327,"name":"Fantastic Contraption","genre":"Simulation","price":0.0,"description":"Fantastic Contraption is surreal building game for virtual reality. Create life-sized machines as tall as you can reach, then send them whirling, flinging, and trundling off to solve puzzles on the other side of a floating island. Your task is simple: get the squishy purple ball to that goal off in the distance, or above you, or on the other side of that gap. And your tools are elegantly minimalist: spinning wheels and stretchable rods. But the solutions are endless, and there are no right or wrong ones.\nWe've designed this game from the ground up for room-scale VR. Come immerse yourself in a strange skybound archipelago and befriend Neko the photosynthesizing cat. Build contraptions with your own two hands, life sized and as big as horses, right there in front of you. Play with the physics, juggle pieces, throw darts, and feel another world all around you.Features:\nChallenging puzzles. 50 official levels that range from cakewalk to what-the-hell-this-is-impossible-right-tell-me-this-is-impossible. But guess what, it IS possible. I think.\nInfinite solutions. Working cars, tanks, catapults, conveyor belts, walking creatures or minimalist structures that use only gravity. Design for elegant simplicity, or build a rattling pile of junk that just barely makes it to the goal. Whatever.\nBuilding with your own hands. Movement so simple and natural you'll forget you're holding controllers. Need a wheel? Just pick it up. Want a longer rod? Just grab an end and stretch. It's like playing with children's blocks, except they're bigger than you are.\nNoble ancestry. Fantastic Contraption is the VR evolution of Colin Northway's 2008 2d browser game, played by millions and still playable  for free. But don't be fooled, this new game is WAY different.\nFull 3d audio and music. Actually, this game has no music. What it does have is musical instruments. Except you have to build them. Well... you'll figure it out.\nSurreal and beautiful landscape. Hey guy, chill here awhile, why don't you just lie down in the grass and just listen to the sky whales singing? You'll totally forget the dystopian present and the 300 sqft windowless cube you now live in. Who needs sunlight? VR.\nNeko the toolbox. Yes, your toolbox is alive, and he's kind of a green cat blimp thing powered by pink farts. He doesn't seem to mind when you pull off one of his tails or yank a pin out of his head. They grow back pretty fast, so I guess it's okay...\nOnline sharing. Venture bravely into the dark world-within-a-world to load contraptions made by your friends and also some random people. Marvel at the crazy crap they came up with. Then narrow your eyes and say: I can beat this. I can do better.\nLevel Editor. Make your own puzzles to share with your friends and the community.","imageUrl":"https://media.rawg.io/media/screenshots/8f6/8f631eeec1f7e2a7b7a7174b3fa1c2e2.jpg","releaseYear":2016,"developer":"Radial Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":10975,"name":"Boundel: The Second Era","genre":"RPG","price":0.0,"description":"GAME REQUIRES A DIRECTX 11 CARD\nThe time has come. This is the time of guilds, wizards, warriors, blacksmiths, tailors, scribes, alchemists, woodworkers, animal tamers, brewers, traders, traitors and murderers.\nThe Second Era begins!FeaturesCompletely Open World: Go anywhere and live anywhere.\nReal Massive Multiplayer: The game has one world carries the everyone.\nCrafting: Make armors, weapons, shields, dresses, potions & foods with a legendariness modifier, each crafted item is unique.\nGlobal Trading Market: Buy/Sell items on the market.\nTaming: Tame everything in the world. They will fight on your side. Also you can shrink them & store or sell on the global trading market.\nCreate your class: Use your ability & skill points to develop your character as you like. Be the master of one skill or use all of them.\nGuilds: Create your guild and collabrate with your friends. Items have been crafted by ranked guild members will carry the name of the guild.\nRunebook: Mark locations and travel anywhere alone or with your friends by opening a moongate!\nNon-target Combat: Your attacks & spells are a dynamic physical object, so aiming is important, dodging is possible.\nNo registration required, login via Steam\nNo in-app purchases, all updates will be free. Pay once play forever.\nFrequently updating","imageUrl":"https://media.rawg.io/media/screenshots/e19/e19ea0db301d9d6d18ba53db3d3d7b2e.jpg","releaseYear":2016,"developer":"Eren Aydın","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10822,"name":"Battlezone 98 Redux","genre":"Action","price":0.0,"description":"One of the greatest sci-fi strategy games of all time returns Spring 2016 with remastered visuals, online multiplayer, and near unlimited mod content from Steam Workshop.\nEnter an alternate vision of the 1960s where the “space race” is nothing more than a cover for an interplanetary war between the US and Soviet Russia over mysterious alien bio-metal.\nTake command of an army of sleek heavy assault tanks, strike cruisers, APCs and more, and wreak havoc with super-heated projectiles in your mission to blast your enemy from the face of the Moon, Mars, Venus, Titan, Io and Europa.\n\nScavenge the battlefields for crucial bio-metal, deploy powerful defenses, construct advanced facilities and escalate each battle to an epic confrontation.\nRevolutionary, revitalised and remastered, Battlezone 98 Redux’s blend of thrilling first person action and tense RTS gameplay is as essential now as it ever was.FEATURES\nCritically Acclaimed RTS:\nCommand the battlefield and fight vehicle-to-vehicle from the immersive first person cockpit view.\nUnleash mechanized devastation with a huge tactical arsenal including Howitzers, MAG Cannons, Cold Fusion Lasers, Day Wrecker Artillery, and more.\nCustomise and fortify your bases from the ground-up with production factories, power plants, barracks, armouries, command towers and deadly defensive turrets.\nTwo Explosive Campaigns:\nPlay as American or Soviet forces in two separate singleplayer campaigns, with 29 missions across 7 different planetary environments.\n\nSleek Remastered Visuals:\nPlay Battlezone 98 as it should have been, in HD with completely remodelled vehicles and buildings, enhanced lighting and shadows, improved particle effects, upgraded animations, upscaled terrain, and more.\n\nOnline Multiplayer for 2-8 players:\nExperience the classic rush of \"Deathmatch\", or test your skills in a pulse-pounding battle of wits in \"Strategy\" mode.\n\nSteam Workshop Mods:\nTap into a community nearly two decades in the making, and enjoy near limitless new content with support for mods, such as new singleplayer and multiplayer maps, new vehicles, new HUDs, custom scripts and much more.\n\nMap Editor:\nNot a modder yet? Create your own custom multiplayer arenas with the in-built map editing tool.","imageUrl":"https://media.rawg.io/media/screenshots/e42/e42e419343786fcb048019422115e3f4.jpg","releaseYear":1998,"developer":"Big Boat Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10000,"name":"Gods and Idols","genre":"RPG","price":0.0,"description":"The Father of all Gods, Oberon, has become a myth even to the immortals of the universe, to those willful spirits that have ascended beyond the form of humanity and now flit through the tides of the universe as naturally as walking occurs to mortal men. You are one of these immortal beings, once human but now a divinity that seeks power through worship, seeking to guide your faithful in this darkness from the dangers of all sides.\nThere is much ruin and destruction - wrecks in the battlefield of the gods, but you are yet capable of sculpting planets into hospitable, even lush, wonderlands for your followers. Their temples will exalt you, and in your name, they will launch great fleets to expand your divine empire. You will shield them from the stellar radiation, the envy of their rivals, and much darker entities that lurk between the space of the cosmos.\nBut mere benevolence is not always enough.\nThere will be enemies, but you need not rely only upon your posthuman followers to deal with them; the primal forces of the universe are at your disposal. Disrupt the asteroid belts, plunging a hail of destruction upon the entire stellar system of your foes. Kidnap their planets into a pocket universe of our holding, their populations ready to be dealt with at your will. Or simply destroy their suns in artificial supernovas, leaving nothing alive in their wake.\nThere was a time when such acts would have been thought horrific. But now, as the end of the universe approaches, as the forces of entropy threaten to extinguish all life, light and hope, you must gather what power you can to brace against the incoming horrors of the Black Sun.\nCommand the power to destroy entire star systemsCreate raw planets and their moons from asteroid beltsDevelop an intricate economy with dozens of resourcesUpgrade and develop your planets with gleaming citiesConstruct powerful fortresses to crush your foesErect monumental temples in your own honorCommand vast fleets faithful to your godlinessDuel ancient monsters in the depths of space\nGods and Idols is free to download, and free to play. If you want to support us there will be an ingame shop where you can purchase Essence, a resource used for many things in the game. Essence is also gained by just playing the game. We'd love to hear your feedback on this, please let us know if we screw up!","imageUrl":"https://media.rawg.io/media/screenshots/f30/f30343dea17fa44a2d18dd6375079135.jpg","releaseYear":2016,"developer":"Viking Tao","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9536,"name":"Novus Inceptio","genre":"Adventure","price":0.0,"description":"Warning!This is an Early Access game, please read the game specification before purchasing it. Buy the game only if you understand and agree with the game specification and if you are willing to accept eventual flaws/bugs and all the changes that may occur as a result of the game development. This could also mean removing all user data. When purchasing the game you also agree to participate on tuning and testing it.\nInformation mentioned below  does not have to be valid in the current version of the game. Specifications and HW requirements may vary during further game development.\nThank you for your understanding!PROLOGUENovus Inceptio is a survival RPG set to our planet, but far in the future. Despite of the fact that the game is  labeled as a survival game, it is not a typical survival challenge type of a game. This is mainly because survival elements create just the background of the game and the main aim is shifted to very complex craft system and building values in the game. Novus Inceptio is about calm playing experiece which is similar to strategic and relaxing style of playing. The game contains a unique system of resources heredity and offers interaction with every game object. The objects serve not as just the background of the game.\nNovus Inceptio unusually blends sci-fi and fantasy themes with a hint of post apocalyptical ideas. The story is set on the planet Earth in distant future, but not the Earth as we know it nowadays. And one of the most important topic during playing the game is to reveal the truth about those who stand at the background of everything from ancient times...MAIN ELEMENTS OF THE GAME\nDIFFERENT POINT OF VIEW ON A SURVIVAL GAME\nDo not expect a typical survival challenge game, because survival elements are slightly at the background. On one hand, it is necessary to cover basic needs to survive, but these activities are not to bother you a lot, they rather intensify the world atmosphere. On the other hand, it is not difficult to get killed or to die as a result of some kind of injury.\nTHE WORLD IS NOT JUST A DEAD BACKGROUND\nYou can interact with nearly everything from the surface of the ground, bushes, trees, to your own buildings. In the game, no plant serves just as a decoration – would you like to pick up mushroom and eat it? Go ahead, nothing stops you. Even ordinary tree does not serve only as a source of wood, but offers other materials, too (bark, leaves, branches, resin etc.).\nLIVELY RELAXING ENVIRONMENT\nThe game contains environment with natural time flow, following daily cycle and being affected by weather changes. If you stop for a moment and listen to the sounds of the nature you would recognize in which direction a wolf is hunting, you could feel the wind taking off, or you could just let yourself go while listening to atmospheric music and you could calmly relax listening to the whisper of leaves and the wind.\nCOMPLEX CRAFT SYSTEM\nThe game craft system is based on very difficult internal logic which requires individual production of every single part of the final product. As a reward for such game mechanics you get unique items, spiced with material bonuses, e.g. it is really important whether you craft from oak or pine wood. The game also offers an option of the craft system for those who don´t want to dive in tables and calculations.\nMATERIAL BONUSES\nThe game contains a unique system of resources heredity which is used during crafting. Therefore it is possible to craft unique items with specific characteristics which happens because of the craft complexity.\nUNLIMITED CHARACTER OPTIONS\nThe game allows natural character development. Only personal attributes, which you use, are enhanced. You have free hands to create a mix of specialization which you truly enjoy. You don´t have to think even before the beginning of the game about choosing a proper race or profession – character attributes are automatically adjusted according to frequent character activities.\nCHARACTER AGEING\nYes, during playing your character gets older and can eventually die of age and therefore can move one generation further. The ageing system is our specific system of character level up. The age are experience points and a generation is a level. You dont´t have to be afraid of ageing, because it is natural way to level up, which brigs you bonuses and even better attributes.\nBUILDING SYSTEM\nThanks to modular system, while building your new home, the only limiting factor is your creativity (and if not, you can always use ready-made houses). The difference in our system is in the builning process. First, you take your time and plan, only when you are ready, you start gathering material and finally build your dream house.\nFARMING\nYou can build a farm around your house and grow plants needed for cooking a good quality meal or plant your own wood and bring some exotic plants from different biomes to your home.\nANOMALIES\nIn the world, there are many portals to different dimensions or times. In anomalies you can come across some unique rewards, but primarily you can learn new craft recipes which are essential for any crafting. But it is vital to pay attention to any danger hidden in those portals.\nSURVIVE!\nAt the beginning of the game you find your character in the middle of wild nature. And your equipment? Only a knife and basic tools. Luckily, you're not alone! Your small personal robot A2-A is your valuable companion, but it is not there to do all the work instead of you.  And because the nature does not give things for free you need to find sources of food, heat and prepare for danger, which hides in the deep wood. Disease, injury or death is your daily bread. Over some time, when you learn the laws of the world, you will be ready for your next trip.\nBUILD!\nHome is a foundation of survival and developing attributes. You can build your own house or farm and focus on one of many craft specializations. The building system works using modular elements where you can plan first, and then gather required resources for final construction (which, wouldn´t be an easy task to do). The only limiting factors are knowledge of recipes for components, your own creativity, sufficient resources and skills.\nAlso, you can learn to craft new components by finding specific blueprints which could be found in boxes all over the world or in the anomalies.\nCREATE!\nDo you like crafting stuff? Then you will love Novus Inceptio! Each and every item in the game is unique and created by the player himself. Crafting of any item is a complex process based on many attributes, from a level of skill to material used. Crafting system does not dictate to the player what exact material has to be used to craft something, instead it reveals what type of a resource is needed, e.g. if you use stone to create an axe you create a stone axe, but if you use iron you manufacture an iron axe. You can use different type of material for any component, e.g. when you craft with wood, the system takes in consideration hardness of the wood.\nNovus Inceptio supports crafting items by players themselves. Therefore, item quality and technology are going to improve over time together with character attributes.\nEXPLORE!\nIt is not only about settling the world, but also about surviving and creating prosperous economy. There is the whole new world of life, danger and mystery that awaits you. There are dense forests, dry deserts, tropical jungles or busy underwater life.\nYou can get on a long journey to discover valuable materials or to find out the truth and real purpose of the restored planet.BACKGROUND STORY\nThe dawn of gods\nThe Galaxy is a cold and hostile place and the creators are aware of this. They have spent billions of years searching for intelligent form of life but they have never succeeded. They started  protecting several planets with more developed organisms by all means available. They say: \"Life must not die out.\" But at the same time, they understand all the great risks awaiting for every civilization. Therefore, the creators try to prevent destructive genocides by discreet DNA manipulation and information adding.\nRebellious believers\nFrom the dawn of human civilization the creators stood beside human race. As gods, they secretly influenced physical and technological evolution or even psychological maturing of the civilization.  But nobody is perfect, not even gods. Instead of maintaining peace and prosperity, humans tended to worship war and they forgot everything about their gods.\nThe creators realized that their experiment failed and they no longer possess the powers to stop this fanatic madness among humans. When their last messenger died they returned through a portal to where they came from. To a different planet? Or to another reality? Nobody knows for sure. But what we do know is that they have never stopped collecting data through the portal.\nThe end of the world\nThe next important step of the human civilization took place nearly 2000 years later. During this era the nuclear fission was discovered and the whole planet became full of atomic blasts. The war was frightfully quick and effective. Those who could not hide into underground bunkers were hit by radiation and died. From billions of humans barely a few hundred thousand people survived. Without people knowing the creators received  information about the end of human world, they became furious that people are so irresponsible and they returned to the Earth to wipe-out the entire human race of the planet.\nHuman 2.0\nThe desolated planet kept orbiting the sun. Slowly throughout millennia it was getting rid of the deadly radiation. Finally, the creators decided to launch a new experiment. With samples of human DNA and with the help of infinite information database they returned life back to the planet. Also, they created new humans - Homo Novus to inhabit the recovering planet. And in order not to make the same mistake as before, the creators decided to accompany each and every new human clone with a personal robot A2-A.\nDiscover worlds!\nA2-A is something like a guardian angel. It helps and protects people and it gradually offers complicated knowledge to them. In addition to this, it monitors behavior of each clone to prevent aggressive behaviour which caused the collapse of the previous civilization.\nAnd yet the monitoring and controling system is not reliable enough for the creators to trust it and that is why the creators installed some anomalies on the planet so the clones can travel back in time and learn from the mistakes of the past civilizations. And who knows? Maybe this would be the beginning of a new civilization which finally devotes its time to discover and learn, rather than kill and destroy.\nAnd the Creators? This time they are not leaving. They are analyzing the data from thousands of A2-As and waiting for the right moment to introduce themselves to their children personally .","imageUrl":"https://media.rawg.io/media/screenshots/04e/04e45be2b4a4985af25b0e3c08e22e1b.jpg","releaseYear":2015,"developer":"McMagic Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":7295,"name":"Manyland","genre":"Action","price":0.0,"description":"Welcome to Manyland, an open universe we invent and live together! In an infinite world of abundance, we create new things by drawing them, build new places, hang out and chat, collect, make music, party, script objects, go on adventures... and have fun together in ways none of us can predict.\n\"WONDERFUL ... so fun to explore, build, interact, and create ART. Such a variety of things in this world to do\" -Joshua C.\n\"Exploring the world is a blast\" -Massively\n\"The most exciting game I've played so far mainly because of its freedom to shape your world.\" -Cosmin\n\"i love this game!!\" -Carie Corman\nDraw, build, make music, party, go swim, script interacting objects and adventures, do sports, come up with puzzles, play, explore... Manyland is an open universe with no predefined story, theme or goal... it becomes what we will make of it!\nEvery pixel you see in Manyland is created by all of us together as community. We're two indie developers and this is our labor of love. Our top priority always is all of your happiness! We'll refuse to go compromised \"pay to win\" routes... let us show the world we can have a universe that's both sustainable, and makes all of us proud! Over 100 million blocks have been placed by all of us already, but we're waiting for one more person: you. If there's anything, please email us at we@manyland.com (a note on service availability)\nA press kit is available.\n\"Sometimes a new online environment can feel very much like being born into the the world again.\" -Zach Austin","imageUrl":"https://media.rawg.io/media/screenshots/bf5/bf5fea3498aa5766348399130d8fd5ed_bmXdPsO.jpeg","releaseYear":2013,"developer":"Outer Court","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":5431,"name":"Ratchet & Clank Future: Quest for Booty","genre":"Action","price":0.0,"description":"The swashbuckling action in Ratchet & Clank® Future: Quest for Booty begins one year following the intense ending in Ratchet & Clank® Future: Tools of Destruction®.\nRatchet’s desperate search for Clank resumes with a bang as he finds himself engulfed in ship-board combat – only to be cast adrift and washed up on the shores of a remote island on the planet Merdegraw. Our Lombax hero must overcome life-threatening challenges, encounter hostile new alien races and even form an allegiance with dreaded Captain Slag’s first mate, Rusty Pete. All in the pursuit of clues that lead Ratchet to the treasure of Captain Angstrom Darkwater, Slag's former commander and keeper of the only known link to the mysterious Zoni: the Fulcrum Star.\nRatchet and Clank is a registered trademark of Sony Computer Entertainment America Inc.  Developed by Insomniac Games. © 2008 Sony Computer Entertainment America Inc.","imageUrl":"https://media.rawg.io/media/games/098/098ea9d97a8d1a7cc3eb7b9044096294.jpg","releaseYear":2008,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3502,"name":"Monopoly Family Fun Pack","genre":"Board Games","price":0.0,"description":"A new era of Monopoly for home consoles! The Monopoly Family Fun Pack gathers the 3 Monopoly Games:\n- Monopoly PLUS: the classic Monopoly with a 3D animated board!\n- My Monopoly, to create your very own board\n- Monopoly Deal, a fast-paced and addictive Monopoly card-game\n- The Monopoly Rabbids DLC is offered !\nEnjoy the classic Monopoly in new fun ways, with your friends and people all around the world!\nVideo output in Full HD 1080p requires 1080p native display.\n1080p HD Video Output\nOffline Play Enabled\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\nHASBRO GAMING and its logo, The MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character, as well as each of the distinctive elements of board and playing pieces are trademarks of Hasbro for its property trading game and game equipment and are used with permission. © 2014 Hasbro.  TM & ® denote U.S. Trademarks.  All Rights Reserved. Licensed by Hasbro to Ubisoft Entertainment. Uplay, the Uplay logo, Ubi.com, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries. Games software © 2014 Ubisoft Entertainment. All Rights Reserved.","imageUrl":"https://media.rawg.io/media/screenshots/cd4/cd49a6f060ac50433f3b1d36a1116059_PclZQ8d.jpg","releaseYear":2014,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":3337,"name":"Schrödinger’s Cat and the Raiders of the Lost Quark","genre":"Action","price":0.0,"description":"Schrödinger’s Cat is a fun, frantic, wacky and colourful puzzle-laden platform game, set in a unique and quirky quantum physics world.\nThere’s chaos at the Particle Zoo! What used to be a cheery theme-park environment is now overrun with hungry leptons, sticky-fingered gluons and massive, stubborn bosons. The Zoo is put on lockdown, and the emergency services are called in to sort everything out. Those emergency services? Schrödinger’s Cat, of course!\nCombine and create useful bits of temporary matter - copters, drills, bubbles and grenades - to combat and subdue all the subatomic critters running amok, and help Schrödinger’s Cat work out how they all got out of their cages in the first place.\nFeaturing:\n7 frustrating environments\n9 overly chatty and annoying characters\n11 Particle-Based Baddies\n14 Quark Combos\nNonsensical task-based gameplay\nA satisfying climax that only clever people will be able to enjoy properly!","imageUrl":"https://media.rawg.io/media/screenshots/eba/ebaf08874abfb42a4c9167962ab7df40.jpg","releaseYear":2014,"developer":"Team17 Digital","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":914781,"name":"WWE 2K23","genre":"Simulation","price":0.0,"description":"WWE 2K23 is Even Stronger with expanded features, gorgeous graphics and a deep roster of WWE Superstars and Legends. 2K Showcase returns as an interactive sports documentary focusing on the 20-year career of John Cena and WarGames is finally here!","imageUrl":"https://media.rawg.io/media/games/ffd/ffd13289910597ae6efdf0d01e899cf1.jpg","releaseYear":2023,"developer":"Visual Concepts","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":871245,"name":"Sandwalkers: The Fourteenth Caravan","genre":"RPG","price":0.0,"description":"Wishlist the full game!https://store.steampowered.com/app/1639080/Sandwalkers/\nAbout the GameSandwalkers: The Fourteenth Caravan is the free prologue of the full game Sandwalkers.\nIntroduction:\nPlay as the Fourteenth Caravan and discover one of your ancestors' secrets, which will rekindle the hope of ending the Phithi era someday.\nEvery decade, the tree city of Lecwasi sends a caravan of merchants and diplomats into the Phithi, the meteorological chaos ravaging the world of Uwando.\nConvoy goods to neighboring tribes, build relationships, survive the creatures that roam around the Phithi, and collect memories of your journey to send to your successors.\nFeatures:\nGuide a caravan of adventurers through ever-changing landscapes.\nFight and survive in the face of acid rain, sandstorms and heat waves.\nTame hostile creatures, rescue refugees, seek allies for mutual aid, or follow the blood path and loot everything you can.\nSeek rich arable soil to plant a new tree city for your people.\nProgress by passing on your knowledge to a new caravan.\nRepair the broken climate, and put an end to centuries of wandering.Games/Series that inspired us:HeroQuest (Board Game), La Horde du Contrevent (Windwalkers, a french book), Kaamelott (the best French series), Monty Python (English series), Dune\nVideo games: Curious Expedition, Renowned Explorers, Trials of Fire, Darkest Dungeon, Slay the Spire, Final Fantasy, Divinity, For the King, Chroma Squad, Battle Brothers, West of Loathing and so many more...","imageUrl":"https://media.rawg.io/media/games/ee6/ee68eb3993bbb10dc2b99e5805bef3a0.jpg","releaseYear":2022,"developer":"Goblinz Studio","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":638790,"name":"Patron","genre":"Strategy","price":0.0,"description":"Patron Demo is available here\nPatron builds upon the foundations laid out by the staples of the survival city builder genre and enhances the experience with a large research tree and by introducing intricate social dynamics into the game and the genre in general. Happiness, the standard simple feature of all such games, in the case of Patron is a complete gameplay system in its own right.\nPatron starts off similarly to other games in the genre, but then veers off exploring social intricacies and what it means to truly run a society and not just a city filled with automatons.\nEach individual citizen in the town has his needs, desires and issues troubling him or making him happy. Some citizens are more concerned with immigration, while others are more aggravated by tax-related issues. If the citizen’s view on the subject is in line with what the town government (YOU, the player) is doing, he’ll be happy. Works the other way around as well.CONSTRUCT AND UPGRADE\n\nTo make the best of the opportunities in this new land, you will need to construct residential houses, farms, production plants, manufacturing buildings and dozens of other buildings needed to harvest the riches of the land.BALANCE SENSITIVE SOCIAL ISSUES\n\nEvery decision you make as Patron will be met with different reactions from different social groups. You'll need real political talent to balance sensitive matters as religion, immigration, loyalty, poverty... Whatever you choose to do can lead to unforeseen consequences years later.ADAPT TO WEATHER AND SEASONS\n\nManaging your tasks and citizens in a timely and efficient manner allows you to prepare and adapt to external variables like harsh weather or different seasons.RESEARCH AND DEVELOP FOR THE FUTURE\n\nThe world is changing and you must make sure you're advancing at the proper pace. Only by constant advancing and research will your society be able to stand the test of time.TRAGEDY ALWAYS LURKS\n\nNo matter what you do, unexpected tragedies can always strike your people. They will look to you for protection and help.ENJOY THE GOOD SIDE OF LIFE\n\nPeople also need external signs of their success. Build and arrange numerous beautification elements of your city, and make sure everyone is rewarded for their hard work.KEY FEATURESA survival city builder with a unique social dynamics system\nGather and produce resources\nEstablish sustainable production chains\nBuild your fledgling village into a prosperous city as you construct and upgrade buildings\nManage your people and steer your citizens towards needed professions\nBalance social issues: Class strife, Immigration, Religion, Health, Safety, Loyalty...\nPlan growth through an extensive Research Tree and unlock technology, policies and upgrades\nPlan production and overseas trade to support your economy through difficult times","imageUrl":"https://media.rawg.io/media/screenshots/2ce/2ce562d8a0cc10c9079567f519be5a48.jpg","releaseYear":2021,"developer":"Overseer Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":510215,"name":"Badlanders","genre":"Action","price":0.0,"description":"ESCAPING IS ALL THAT MATTERS\n25 badlanders, each with their own objective enter the battlefield. Take enemies head-on to strip them of their loot or slowly build up an arsenal from chests scattered across the map. But don't get too distracted, finding valuable loot and getting it out in one piece is what you came here for!\nLOOT, SHOOT, AND GAMBLE ON LIFE AND DEATH\nEnjoy the adrenaline rush of intense encounters? This battlefield is for you! Whether you're armed to the teeth enjoying a battle advantage, or just relying on a knife in the hopes of catching someone off guard and stealing their gear, war is always the fastest way to wealth. Here, some become rich overnight while others lose it all.\nENHANCE GEAR, BUILD UP AN ARSENAL\nHow to increase your chances of survival to obtain more loot? Enhancing your gear may be a good idea. Weapons, armor, grenades... All enhancements can be brought into the battlefield. But beware, the greater your gear, the more you’ll attract the attention of other badlanders eager to take it off your hands.\nREAL WEAPONS, ASSEMBLED YOUR WAY\nThere are hundreds of unique options for gun accessories and attachments, some of which even support customizations. The rich attribute choices allow you to explore the unlimited possibilities of tactics. Additionally, the camouflage system enables you to make guns your style icons. Come and create your ultimate weapons!\nOPEN MARKET, OPEN ECONOMY\nAs a seller, you are free to sell loot you got from the battlefield, you could even choose to play the role of a merchant, reselling items for a profit. As a buyer, you can purchase more powerful gear to give you an advantage in the battlefield, allowing you in turn to get even more loot. Even microtransaction items can be resold for the marked price.","imageUrl":"https://media.rawg.io/media/screenshots/d91/d91c0091ab39c4a649e89e5f62cb087a.jpg","releaseYear":2020,"developer":"NetEase Games","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":484618,"name":"Lords & Villeins","genre":"Strategy","price":0.0,"description":"Build your SettlementUse the toolset to create and decorate the houses for your villagers. Expand your manor, build churches, warehouses and all kinds of buildings your civilization needs to prosper. Thanks to your input, no settlement is ever the same.\nSplit the LandTake advantage of the procedurally generated world, understand where certain lands are best to be and set your village up in the most efficient way. Or just experiment and go wild!\nManage FamiliesThe family profession is passed between generations and their members are tied to your service. Your production depends on who is living in your settlement so be sure to get to know them well.\nProvide Land to the PeopleYour villagers are tied with their life to your land and will work as long as they are given the opportunity but they can also be the source of problems and may disobey your orders.\nExpand your Production ChainThe production chain involves over 100 different resources and 40 professions. Every game is different and so are the industries you end up adopting in your economy.\nPrepare for the WinterCollect production and control the economy. Take too much and your villagers may starve. Take too little and you might be in trouble with the king. Are you willing to risk some lives?\nBe Part of the CommunityLords & Villeins has been in development for over two years and everything from the art, code, and music has been done by a single game developer. It still has a long way to go and it would not exist without the support of my friends and the community. I encourage you to be part of it and would love to welcome you on our journey to see this game where it can ultimately be.","imageUrl":"https://media.rawg.io/media/screenshots/cb1/cb1138f696549db6e7735d71eb4b79cd.jpg","releaseYear":-1,"developer":"Honestly Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":392113,"name":"Yu-Gi-Oh! Legacy of the Duelist: Link Evolution","genre":"Simulation","price":0.0,"description":"It’s Time to Duel!\nExperience over 20 years of Yu-Gi-Oh! history with Yu-Gi-Oh! Legacy of the Duelist: Link Evolution!\nBuild your Deck from over 10,000 cards and take on the most iconic Duelists from the Yu-Gi-Oh! universe. Relive the stories from the original animated Yu-Gi-Oh! series through Yu-Gi-Oh! ARC-V and challenge the newest generation of Duelists from the virtual world of Yu-Gi-Oh! VRAINS!\n• New Link Monster cards, not only changing the way how seasoned Duelists play their cards, but where they play them\n• Faithful to the TV show, relive moments and Duels from every version of the animated series\n• New Duelists can learn the Yu-Gi-Oh! TRADING CARD GAME with the beginner’s tutorial\n• Take on the roles of the animated series villains with Reverse Duels\n• Compete in Battle Pack Sealed Pack and Draft play!\n• Includes all the downloadable content from the previously released Yu-Gi-Oh! Legacy of the Duelist","imageUrl":"https://media.rawg.io/media/screenshots/cff/cff64c6baa2eb6b51857ab03a825e009.jpg","releaseYear":2019,"developer":"Other Ocean Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":282876,"name":"Mirror Maker","genre":"RPG","price":0.0,"description":"The reason we made Mirror Maker is to give the players the freedom to create. Make your own version of Mirror and share it with the world.\nAfter installing Mirror Maker, you can:\n1. Re-create by your will on the basis of Mirror, and the original everything is at your disposal.\n2. Download MODs that other gamers made.\nAbout Mirror Maker:\nIn Mirror Maker, you can see clearly how the who game is structured, and you'll be able to edit scripts and CGs with ease. First download the script from the Workshop, and edit it as you want. Afte you finish making the MOD, you can upload it to Workshop directly from Mirror Maker. We now have unlocked the storyline part of the game for you to edit, and for sure, we'll definitely unlock more parts of the game later on.","imageUrl":"https://media.rawg.io/media/screenshots/f12/f12f5a10c587e693bf7d7ab3d4044414.jpg","releaseYear":2019,"developer":"KAGAMI WORKs","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":251494,"name":"3D Girl Custom Evolution","genre":"Simulation","price":0.0,"description":"I love the sex","imageUrl":"https://media.rawg.io/media/screenshots/53d/53d57cbd135807d5b9945b3076bd2c9a.jpg","releaseYear":2013,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"Apple II"},{"id":0,"name":"PC"}]},{"id":244732,"name":"Tony Hawk's Project 8","genre":"Sports","price":0.0,"description":"Tony Hawk's Project 8 is a skateboarding video game, the eighth installment in the Tony Hawk's series. It was released on PlayStation 2, Xbox, Xbox 360, PlayStation 3, and PlayStation Portable.","imageUrl":"https://media.rawg.io/media/games/87a/87ad527f4bca9fd0a745f83d8a0792ed.jpg","releaseYear":2006,"developer":"Neversoft","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"}]},{"id":64774,"name":"WIN THE GAME: DO IT!","genre":"Action","price":0.0,"description":"WIN THE GAME: DO IT! - is a hardcore game. Try to finish the game without spending your nerves.Features: Simple controls\nPleasant music.\nOver 25+ levels.\nHardcore gameplay.\nMore than 2 hours of gameplay","imageUrl":"https://media.rawg.io/media/screenshots/045/0458a1573c0e85d5f94dbec47bb935ac.jpg","releaseYear":2018,"developer":"AFBIK Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61157,"name":"The Golf Club 2019 featuring PGA TOUR","genre":"Strategy","price":0.0,"description":"Do you have what it takes to win the FedExCup on the PGA TOUR? Compete in the all new officially licensed PGA TOUR Career mode. Play on famous courses like TPC Boston, TPC Sawgrass and more. Show off your skills as you take part in PGA TOUR events such as the Shriners Hospitals for Children Open, the John Deere Classic and the Waste Management Phoenix Open. Take on Career Rivals throughout the season for that extra challenge and promise of reward.\nThe Golf Club 2019 Featuring the PGA TOUR is the sequel to the highly rated The Golf Club 2 and comes with a whole host of new and improved content and features across all aspects of the game, from a restructured Career mode experience, sponsors who challenge you and set you goals for a chance to earn rewards from licensed brand Under Armour. An improved character editor, new and improved online and solo societies, new game modes such as Skins and ALT-SHOT as well as much, much more!PGA TOUR CareerExplore the new and officially licensed PGA TOUR Career mode including Q-School, Web﮳com Tour, PGA TOUR, and the FedExCup Playoffs.Online MultiplayerCompete online against friends or the world in Match Play, Alt-Shot, Skins and more.Online SocietiesCreate or join Online Societies and compete in custom tournaments to earn currency and climb the ranks.Course DesignerDesign, build and share your own course creations online or play the creations of others.","imageUrl":"https://media.rawg.io/media/games/fbb/fbb551471136ba42f9eeb627180b7ca0.jpg","releaseYear":2018,"developer":"HB Studios Multimedia","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":57196,"name":"Sunset Riders","genre":"Action","price":0.0,"description":"Sunset Riders (サンセットライダーズ, Sansetto Raidāzu) is a side-scrolling run and gun video game developed and released by Konami as a coin-operated video game on the JAMMA arcade platform in 1991. The game is set in the American Old West, where the player takes control of a bounty hunter who is seeking the rewards offered for various criminals.\nThe coin-op version was released in two variants: a two-player version and a four-player version. Home console versions of Sunset Riders were released for the Sega Mega Drive (Genesis) in 1992 and for the Super Nintendo Entertainment System in 1993, to a positive reception.","imageUrl":"https://media.rawg.io/media/screenshots/dc9/dc991555bf9bfab348633c4e5308f06e.jpg","releaseYear":1991,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Genesis"},{"id":0,"name":"SNES"}]},{"id":51615,"name":"Hostage: Rescue Mission","genre":"Action","price":0.0,"description":"Special Alert: Terrorists have invaded our embassy and seized an undetermined number of hostages...Lives hang in the balance as high ranking diplomats are held at gunpoint...Their safety requires immediate action... prepare to infiltrate the embassy, neutralize the terrorists, and rescue the hostages, or die trying.\nSTAGE 1 - Set up strategic positions across from the Embassy. Be prepared to dive for cover if the terrorists spotlights turn your way.\nSTAGE 2 - Gain access to the Embassy. Rappel from the roof and crash through unguarded windows, keeping out of terrorist gun-sights.\nSTAGE 3 - Locate the hostages. Heavily armed terrorists control all three floors and must be neutralized before they can open fire.\nSTAGE 4 - Bring the hostages to safety. Their families - and the nation - are counting on you to succeed in this life-or-death operation.\nFEATURES:\n• Control of six Assault Force team members\n• Three difficulty levels, plus a training mission without hostages\n• Superb graphics and sound effects\n• Action, strategy, and suspense","imageUrl":"https://media.rawg.io/media/screenshots/6a7/6a7d5c0a7488449a78d05d4cf9aa794b.jpg","releaseYear":2018,"developer":"Infogrames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":51101,"name":"Heart of the Emberstone: Coliseum","genre":"Adventure","price":0.0,"description":"Continue with the full adventure\nAbout the GameFrom the Devs\nWe hope you enjoy this special sandbox version of the Coliseum level from The Gallery: Heart of the Emberstone, built for you to easily try and share a piece of the experience.\nContinue the adventure in the full game, The Gallery: Heart of the Emberstone; and in Call of the Starseed, the groundbreaking prequel that started it all!About Coliseum\nTaken straight from the heart of adventure, Coliseum is a sandbox version of a level found in The Gallery: Heart of the Emberstone, made available free for virtual reality. Delve into the mystery, master the Gauntlet, and get a taste of the world of fantasy and adventure found in award-winning VR series The Gallery.\nTry for free an area from the top-rated sequel to classic VR adventure game Call of the Starseed\nPeek into the dark past of a forgotten world inspired by classic 80’s fantasy, including Labyrinth and The Dark Crystal\nStack, throw, and destroy with telekinesis, fined-tuned for play with precision hand-tracking in VR\nBlast aliens and corpses with the Arbalest, an energy slingshot with powerful physics\nExperiment and explore with different locomotion modes to tailor your experienceAbout The Gallery: Heart of the Emberstone\nAfter following your sister through the ancient Starseed, you discover the remnants of a destroyed civilization, torn apart by two siblings and their individual quests for power. Along the way you meet a mountainous ally who, like you, is looking for their other half. Using the Gauntlet, a mysterious new power capable of manipulating energy, you must unravel the history of this forgotten place, and reveal the true intentions of the dark figure who sent you here.\nEmbark on an epic VR journey in the full version of the The Gallery: Heart of the Emberstone and its prequel Call of the Starseed.","imageUrl":"https://media.rawg.io/media/screenshots/ddb/ddb2e3b6f8a2ff154a6cc4d93fe86057.jpg","releaseYear":2017,"developer":"Cloudhead Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50950,"name":"The Last Guardian VR Demo","genre":"Desconocido","price":0.0,"description":"In The Last Guardian, players discover a fantastical beast named Trico, who acts as companion and protector as the two traverse a mysterious fantasy world. Step inside the world from The Last Guardian with PlayStation VR to interact with Trico in a whole new way.\nPlayStation®VR Required\nPlayStation®Camera Required\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n©2017 Sony Interactive Entertainment Inc. The Last Guardian is a trademark of Sony Interactive Entertainment LLC.","imageUrl":"https://media.rawg.io/media/screenshots/fc0/fc09d7f29523597ac86191006e602210.jpg","releaseYear":2017,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":47596,"name":"ШП","genre":"Simulation","price":0.0,"description":"Incomprehensible interface errative puzzle game. No instructions!\nThis product includes 3 different puzzles.\nFeatures:\n- Native Windows Forms interface.\n- The goal of each of these errative puzzle games is to set all the flags and then perform the final control activation, typically a scrollbar movement.\n- All the flags are hinted in a message box which is shown by pressing a certain button in a previously unknown place. In ШП-10, they are hinted just in the main window.\n- Every game has a way to close itself unexpectedly - this is a gameover and you have to restart it manually.\n- Some controls reset your progress, but sometimes it is necessary to advance.\n- In the end, the game also closes itself. There is only one way to finish each puzzle.ШП-7: ГАМЕБОЕ ПЕРЕЛЬНИЦА\nRelease: sometime around 2008\nRe-release: 15.07.2011 22:33\nClicks to solve:\n1 for the first window, 54 for the second, 14 for the third.ШП-8 и ШП-87\nRelease: 26.07.2011 13:43\nClicks to solve:\nШП-8: 41\nШП-87: 9\nШП-87 is available when you launch ШП-8 with ШП-7 already launched.ШП-9\nRelease: 28.07.2011 0:00 / 17.06.2011 21:31 (some kind of a time paradox)\nClicks to solve: ???","imageUrl":"https://media.rawg.io/media/screenshots/b3e/b3eef1a79dee1498649f530523ecf10b.jpg","releaseYear":2017,"developer":"Xitilon","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":47343,"name":"SORE","genre":"Indie","price":0.0,"description":"\"Sometimes I remember things that didn’t happen, does it happen to you?\"\nMystical puzzle quest game in a gloomy minimalism style will tell you a story of a person who's got himself into a camera, and from which there is no way out it seems. Experimental gameplay diluted with a pinch of a philosophy, that's what SORE is.The game gives the following opportunities:To think over objectivity of player's actions aiming at achieving the desired.\nTo live through the pain of accepting the inevitable reality which finally will grant freedom.\nTo understand an importance of inner human freedom in common life.\nTo try a chaotic cocktail of an experimental gameplay, a quest and a gloomy atmosphere which provides a fake chance.\nTo feel the \"five steps of acceptance\" by yourself.\nTo fail with seeking out the ending you want but find it's brother which has to be accepted.\nTo find a symbolism there where it is not.\nNot to find a symbolism there where it is.\nTo dive into melancholy.\nTo imagine your plotting in which you will believe.\nTo recall that what was forgotten.","imageUrl":"https://media.rawg.io/media/screenshots/dce/dce73332f81dc158fcf5c48b7782a81d.jpg","releaseYear":2017,"developer":"Bazitov Mikhail","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40300,"name":"Battlefield: Bad Company 2 - Vietnam","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/470/4707876db7a725b2502fa9def1e17d9f.jpg","releaseYear":2010,"developer":"Electronic Arts DICE","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":39109,"name":"Fallout 3: The Pitt","genre":"Action","price":0.0,"description":"The Pitt opens with a desperate radio message, and a meeting with its sender, an escaped slave who claims that the leader of \"The Pitt\" has created a cure for mutations... and he needs you to go in and retrieve it. Do you fight your way in, or disguise yourself as a slave? Ally with the slaves, or join their Raider overlords? There’s no real right or wrong, just choices to be made, sides to be chosen and a mystery that could send shockwaves throughout the entire Wasteland.","imageUrl":"https://media.rawg.io/media/screenshots/5a6/5a63022f15130f18ac58621070e375cd.jpg","releaseYear":2009,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":30411,"name":"Return of the Phantom","genre":"Adventure","price":0.0,"description":"The legendary Phantom of the Opera has returned! As Inspector Raoul Montand, you are the only one who can pursue the Red Death into the past and prevent him from terrorizing the present. This point and click adventure originally released by MicroProse in 1993 features a fully voiced cast of characters with fluid animations, a tense and thrilling story penned by James Bond novelist Raymond Benson, and an atmospheric soundtrack that sets the perfect mood for this new take on a classic story.\nWitness the tragedy that befalls the audience inside the famed Paris Opera House\nSearch for clues along the catwalks, through the wings, and into the many backstage rooms of the opera house\nStep back in time as you explore the opera's labyrinth of catacombs","imageUrl":"https://media.rawg.io/media/screenshots/fa1/fa1fffbbabd7318f1ce7b20c7fbd7878.jpg","releaseYear":1992,"developer":"MPS Labs","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28760,"name":"Virtua Tennis 3","genre":"Sports","price":0.0,"description":"Based on the spectacularly successful arcade version, Virtua Tennis 3 adds dazzling power to the renowned series for next-gen consoles while retaining that easy to play, difficult to master gameplay loved around the world.","imageUrl":"https://media.rawg.io/media/screenshots/748/74857df33b87630bc5edec82febfa430.jpg","releaseYear":2007,"developer":"Sumo Digital","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"}]},{"id":28476,"name":"Sonic & SEGA Racing","genre":"Racing","price":0.0,"description":"(Online Interactions Not Rated by the ESRB)  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   Join Sonic and friends in a frantic battle race to the chequered flag. Select from your favourite Sonic and SEGA characters such as Dr. Eggman, Tails, AiAi, Amigo and many more each in their custom built vehicles and personalised All-Star move to get back into the race! Winning is only part of the fun in Sonic & SEGA All-Stars Racing!","imageUrl":"https://media.rawg.io/media/screenshots/f1a/f1aeac0066742fb9bb63bf3af9121e51.jpg","releaseYear":2010,"developer":"Sumo Digital","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"}]},{"id":23863,"name":"Pokémon Ranger","genre":"Desconocido","price":0.0,"description":"In the Fiore Region there are those sworn to serve people, Pokémon, and\nnature--the Pokémon Rangers. In their frequently challenging line of\nwork, the Rangers rely on their Capture Stylers--special devices that\nonly they are allowed to use. Using their Catupture Stylers, the Rangers\nborrow the abilities of Pokémon to uphold Fiore's peace. But look out\nfor the Go-Rock Squad--they want to use Pokémon for a more sinister\npurpose, and it's up to the Pokémon Rangers to help stop them. It's an\nadventure that gets you into the Pokémon action like never before!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","imageUrl":"https://media.rawg.io/media/screenshots/4e7/4e7e725b8d1beabb82f6a1ebe3bce9f2.jpg","releaseYear":2006,"developer":"HAL Laboratory","libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":23635,"name":"IKEA VR Pancake Kitchen","genre":"Desconocido","price":0.0,"description":"You can expect to spend about 15 minutes in this VR experience, which we'll support and update until December 2017.\nWelcome to the IKEA Virtual Reality kitchen experience, where you can make some virtual pancakes. Before you start, you can choose between bright or dark cabinet fronts.\nOur IKEA kitchen specialist will guide you through some of the key apsects of a well-planned kitchen. And look out for the instructions that will help you to prepare those perfect pancakes.\nAt the end, you can see how the kitchen feels from a child's perspective while you set the table.\nReady for a pancake party? As you master the art of perfect pancakes, why not try to cook pancakes using four pans at the same time?\nPress release here: http://newsroom.inter.ikea.com/news/all/ikea-invites-people-to-make-virtual-pancakes---releases-a-virtual-reality-app-on-steam/s/a5702517-ee4d-4a2f-a9a8-7f311b43cd84\nFeedback\nWe'd love to hear your ideas on how we might improve this experience. Or what tips would you give on how to plan a kitchen?\nTips for the best experience\nThe virtual floor should match your physical floor. If not, the room will feel either too small or too big. Please see below for how to calibrate the floor. You should also set the IPD (distance between the centre of your eyes in millimetres) on the headset to your personal values.\nHow to calibrate the floor height\n1. Place one of the hand controllers or the HMD on the floor\n2. To auto-calibrate, press the Home button on your keyboard. To manually adjust floor height, use PageUp/PageDown to move floor up or down one centimetre so the HMD/controllers rest on the virtual floor.","imageUrl":"https://media.rawg.io/media/screenshots/d6a/d6a435b8792937fc28729cd7b65a620f.jpg","releaseYear":2017,"developer":"IKEA Communications","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]