[{"id":56198,"name":"Shadow the Hedgehog","genre":"Action","price":0.0,"description":"Shadow the Hedgehog is a platform video game developed by Sega Studio USA, the former United States division of Sega's Sonic Team, and published by Sega. A spin-off to the Sonic the Hedgehog series, the game features Shadow the Hedgehog as the main character, and was revealed at the March 2005 Walk of Game event. It was released for the GameCube, PlayStation 2, and Xbox video game consoles in November 2005.\nFollowing the trend of contemporary Sonic games such as Sonic Adventure and Sonic Heroes, Shadow the Hedgehog is a 3D platform game; however, it also features third-person shooter elements. Most levels have three possible missions—\"Hero,\" \"Dark,\" or \"Normal\"—that the player may choose to complete, while some have only two of the three. The missions completed determine the game's plot and subsequently playable levels, a feature referenced by the game's tagline. The plot centers on the attempt of Shadow, a creation of Doctor Eggman's grandfather, Professor Gerald Robotnik, to learn about his past while suffering from amnesia. To defeat enemies, Shadow can use various weapons and special attacks.\nShadow the Hedgehog received generally unfavorable reviews from critics. The game was criticized for its controls and dark themes, especially the addition of guns and other weapons to traditional Sonic gameplay. However, some reviewers praised its replay value. The game was a commercial success, selling more than 2 million copies by March 2007.","imageUrl":"https://media.rawg.io/media/games/c69/c699b91a5431e95abe0b79203bd96455.jpg","releaseYear":2005,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":54424,"name":"Kirby 64: The Crystal Shards","genre":"Action","price":0.0,"description":"Dart past enemies, soar the skies and swim the depths of the ocean as Kirby takes on Dark Matter in an all-new adventure. Inhale, exhale and swallow your enemies, then copy and combine their abilities and use them as your own! Team up with familiar friends and foes - like Waddle Dee and King Dedede - as you travel through dreamy worlds in search of the lost Crystal Shards.","imageUrl":"https://media.rawg.io/media/games/d45/d452cba755f2798e338d6b728a40c331.jpg","releaseYear":2000,"developer":"HAL Laboratory","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Nintendo Switch"}]},{"id":46919,"name":"Run Zeus Run","genre":"Adventure","price":0.0,"description":"\nAbout\n\"Run Zeus Run\" is an endless runner with modern mechanics of a platformer, funky music, incremental challenge needing a little bit of strategy and addictive game. Try to get the highest score, the highest amount of coins, the highest monster kills and play until you are the best Zeus in the world!\nFeatures:\nEndless Platformer - Run, Jump, Dodge and Attack with thunderbolts. Keep running and increasing your score, collect coins and kill monsters for more score.\nChallenging Gameplay - This is not just an endless runner. this is not just a platformer either. The game needs strategy, patience and focus. With multitudes of game elements like Jump, Double Jump, Holding Jump and Thunder Attacks, you not only need to keep running on the platform but dodge different kinds of monsters too. Oh, and the game speeds up as you play. How far can you run with the progressive speed change?\nLeaderboards - You cannot call yourself the best unless you are on top of the Leaderboards. Your high score is instantly updated on the Steam Leaderboards where you can check your score and rank and compare it with other players.\nCoin Patterns - Even though coins are randomly generated on platforms, we have put time and effort to create some amazing coin patterns and designs. We will even allow our players to submit new coin patterns and add them to the game each week/month. How about sending a message to your special someone through the coins?\nMultiple Music Tracks - Background Music that keeps changing every time you play. Different types of music tracks for everyone, try to go through the end, where there is no more darkness.\nAchievements - There are 150+ quality achievements of different types to be unlocked, from Greek Letters and Numerals to specially hand crafted icons, emoticons and even emojis, all of which can be used on your Steam profile. Unlike other achievement hunter games, unlocking all the achievements won't be that easy due to various scenarios and community challenges set as conditions to unlock them.","imageUrl":"https://media.rawg.io/media/screenshots/85e/85e3927aea9081b27a261dd4d34f2d0e.jpg","releaseYear":2017,"developer":"GamerzDan","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46884,"name":"Just Fishing","genre":"Action","price":0.0,"description":"Game with stunning graphics, realistic physics and system behavior of the fish, a wide selection of fishing gear, change the time of day, weather conditions affecting the nibble fish, and many others. Tournaments and competitions, teams and ratings, everything you need for this PVP.\nJoin the ranks of fans of the game on Steam and fight within a single game universe where you are waiting for players from other platforms: Win and Mac OS X.\nDozens of beautiful locations.\nHundreds of different species of fish.\nComplete interesting quests.\nVisit the many stunning lakes and rivers.\nCompete in tournaments and matches.\nCreate or join a team.\nAnd fight with other players for the best places and prizes","imageUrl":"https://media.rawg.io/media/screenshots/bb1/bb10be1539018824428f2bb343f70673.jpg","releaseYear":-1,"developer":"Just Fishing","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":45030,"name":"Gun-Running War Dogs","genre":"Simulation","price":0.0,"description":"Unique spreadsheet-simulator with chaotic firefights and hookers!\nTake role of a wardog. Buy from gangs and black market, sell to the PMC's. Ez pz.\nWhat's the catch? Some goofs just wanna shoot you in the face and get away with your money.\n== Features: ==\nOvercomplicated tutorial!\nUnique spreadsheeting fun!\nExciting \"buy-sell-buy more\" simulator!\nDecorate your office with bongs and weapon crates!\nLevel up your bodyguards and forget about paying your bills!\nLose all cash on gambling!\nStart all over again!\n20+ achievements!\n20+ items\n1 global leaderboard","imageUrl":"https://media.rawg.io/media/screenshots/33a/33a1750eaedecc9a5dec6b29424adabc.jpg","releaseYear":2017,"developer":"Rotatipyra","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44819,"name":"Cube Link","genre":"Casual","price":0.0,"description":"CubeLink is a flow puzzle game with a twist.\nBy spinning the cube around you can connect colours in every direction.\nUnlock more challenging levels as you progress.\n\"i straight up think that level 22 is impossible\" - Zedia\n\"Its a really fun solid game! It's surprisingly more difficult that I had anticipated :) \" - Saran09\n\"Amazing game, possibly the hardest puzzle-type game i've seen\" - JohnYT\n- please note the current game might be not suited for people with color blindness","imageUrl":"https://media.rawg.io/media/screenshots/7b2/7b20315cec287f549967b767273ce3f6.jpg","releaseYear":2017,"developer":"Hannes Delbeke","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44703,"name":"Super Fancy Pants Adventure","genre":"Action","price":0.0,"description":"Super Fancy Pants Adventure is the culmination of a decade of perfecting the Fancy Pants adventures.  For the first time on PC, here comes Fancy Pants man!\nSuper Fancy FeaturesSo many levels!  - 56 brand new levels of parkour platforming\nCollections! - Over 20 pants and hats to collect in brand new challenge stages\nIncredible Hand-drawn Style - Frame-by-frame animated worlds, enemies, and friends\nHack-and-slash - Wield your mighty ink pen to take down new threats!\nNew Moves! - Take control of Fancy Pants man with brand new combos and moves\nArena Mode - Want to beat up enemies, like a lot?  Take on arena mode and combat wave-upon-wave of enemies!\nSecret Challenge Stages - Scattered throughout the world are secret doors to incredibly challenging bonus stages, awarding awesome prizes\n60fps gameplay - Perfectly smooth running for a perfectly smooth platformerA Decade In the MakingThe Fancy Pants Adventures series started over ten years ago by Brad Borne, an indie developer who wanted to redefine video game platforming by making speed and tight controls feel compatible.  Over the years he has honed his craft, turning his Fancy Pants games into a worldwide phenomenon with over 100 million plays and becoming one of the top games of all time on Kongregate.  This newest version, Super Fancy Pants Adventure, is a culmination and a reimagining of the series into a full-fledged title.\nWhether its your first time playing Fancy Pants or your hundredth, Super Fancy Pants Adventure is a wild run!","imageUrl":"https://media.rawg.io/media/screenshots/3dc/3dc2c0a50220eafd5bf2b4f954e70060.jpg","releaseYear":2018,"developer":"Kongregate","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":44251,"name":"Pure Farming 2018","genre":"Simulation","price":0.0,"description":"Digital Deluxe Edition\nDigital Deluxe Edition includes:\n- Germany Map DLC\n- Landini Rex F DLC\n- Lindner Geotrac 134ep DLC\n- Gomselmash Palesse CS-200 DLC\n- Special Outfit Pack\nExperience the global nature of modern farming in its entirety with Pure Farming 2018: Digital Deluxe Edition. Expand your game with the Germany Map featuring unique, region-specific activities: growing rapeseed and raising sheep. Get access to three additional, highly specialized machines and receive 4 special outfits for your in-game character. Go global and expand your farming empire across four continents!\nPre-Purchase Offer\nPre-order the game and receive the following bonuses:\n- Germany Map\n- Landini Rex F\nPre-order Pure Farming 2018 to receive a brand-new map located in Germany and the Landini Rex F DLC.\nFARMING GOES GLOBAL\nUse licensed machines to manage all aspects of modern farming, from cultivating land and growing crops, to breeding livestock and producing green energy. Travel between continents to plant region-specific crops such as hemp, cherries, and olives using dedicated vehicles. Farm your way with three modes tailored to both simulation veterans and newcomers to farming games.\nAbout the GameFARMING GOES GLOBAL!\nUse the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming. Travel between Europe, Asia, and both Americas to plant region-specific crops such as hemp, coffee beans, and olives. Farm your way thanks to three unique game modes tailored to both simulation veterans and newcomers to farming games.\nAll-In-One - Try your hand at almost every imaginable aspect of modern farming, such as animal husbandry, orchards, greenhouses, field cultivation, green energy and more.\n100% Licensed Machines - Drive faithfully recreated farming vehicles from such industry leaders as Zetor, Landini, McCormick, Gregoire, DAF, Mitsubishi, and many more. Reproduced down to the smallest detail, including their weight and physics, the machines will offer a realistic, in-depth experience of running a modern farm.\nGlobal Farming – Travel between your farms located in Italy, Colombia, Japan and Montana, USA. Grow unique region-specific crops and use dedicated machines never before seen in farming simulators, including the rice planter, hemp harvester and more.\nFarming For Everyone – Three different games modes for different playstyles. Enjoy the freedom and challenge of running your own farm in Free Farming, learn the ins and outs of agriculture in My First Farm, or test your farming skills in objective-focused Farming Challenges.\nNature Is Beautiful  – Admire the breath-taking landscapes of four continents and enjoy realistic, high-quality graphics.","imageUrl":"https://media.rawg.io/media/screenshots/4cb/4cbba470810746a576c7c2e1d33121ba.jpg","releaseYear":2018,"developer":"Techland","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":41594,"name":"Mass Effect 3: Leviathan","genre":"RPG","price":0.0,"description":"Something lurks in the dark corners of space, something powerful enough to kill a Reaper. Shepard must discover the most closely guarded secret in the galaxy before the Reapers silence it forever. Discover more about the origins of the Reapers as you race across the galaxy to find the Leviathan. Unravel the dark history of the Reaper Race before it is too late.","imageUrl":"https://media.rawg.io/media/screenshots/6e6/6e6ec8d91be7625f5edc1fc7de7caf5d.jpg","releaseYear":2012,"developer":"BioWare","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":39503,"name":"Fallout 3: Mothership Zeta","genre":"Action","price":0.0,"description":"A strange Alien signal is being broadcast throughout the Capital Wasteland, originating from a crashed UFO. Is it a distress call, or something far more sinister? That question is answered when you find yourself beamed aboard an enormous Alien spacecraft, with only one alternative – to fight your way to the bridge of the ship and secure your escape.","imageUrl":"https://media.rawg.io/media/games/2f5/2f5d6ebaa61bd3a12ad40780d5d0b1c6.jpg","releaseYear":2009,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":39439,"name":"MAG","genre":"Action","price":0.0,"description":"The year is 2025. The optimism and harmony of the 2010s were completely eradicated by 2020. A global crisis loomed. Food shortages sparked riots, currencies plummeted, fuel reserves dwindled, and oil-producing nations began to ration what remained. It is a dark future. Governments earmarked money for humanitarian efforts, overseas security, and intelligence services which, over time, found its way the coffers of a small group of Private Military Companies (PMCs). These three private armies (Valor, Raven, and S.V.E.R.) then began to recruit aggressively. Soldiers without a country, the contractors fight wars that never happened. This is the nature of the Shadow War.","imageUrl":"https://media.rawg.io/media/games/68c/68c605a9defef3386ff9986aeb11efad.jpg","releaseYear":2010,"developer":"Zipper Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":35800,"name":"Catwoman","genre":"Action","price":0.0,"description":"Ginka, the beautiful officer, is on the local SWAT team by day. But at night, she becomes the Silver cat. And with incredible agility, unbelievable sensitivity and amazing ability, she roams the city like batman. Accidentally, she was informed that the famous gem ‘Emerald Queen’ was stolen. In order to get it back, she blended into the infamous Kurobara’s mansion. But to her surprise, she got trapped by a notorious SM dominatrix who’s crazy about whipping, bondage, shocking and wax-dripping. What will Ginka’s fate be?\nCat Girl is an AVG with an incredible storyline and voice-over throughout all game for main characters. Besides over 100,000-word script, the game also has different choices, which will lead to numerous endings.\nCV:\n貓野目　銀華役:　思 ちぽ\n黒薔薇　峰子役:　柳 優雨\n三毛　玉五郎役:　福田　純\n三毛　玉子役:　紅葉　美兎\n三毛　鈴音役:　禦上みみ\nTrading cards: According to new policy of Steam, trading cards will be available when the quantity of copies of game sold reachs a certain amount.","imageUrl":"https://media.rawg.io/media/screenshots/737/737c8fa6cb2747b1f4ba1872561737ef.jpg","releaseYear":2004,"developer":"EA UK","libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"}]},{"id":34959,"name":"Blitzkrieg","genre":"Strategy","price":0.0,"description":"Blitzkrieg is a tough-as-nails tower defence game from Loui Studios. Complete with a built-in level creator,  so you can create and share levels with other players!\nYou must defend the motherland from invading convoys of tanks, cars, and jeeps while enemy aircraft bomb vital buildings. Utilise an arsenal of flamethrowers, high-explosive cannons, artillery, machine guns, missile launchers, AA turrets, pill-box bunkers, and experimental tesla weaponry to survive the blitzkrieg.\nEach level is a tightly woven puzzle of turret placement, optimisation, and upgrades. Careful strategy is the key to your survival.","imageUrl":"https://media.rawg.io/media/screenshots/52b/52bc1b7b6fc4b6a24def143600c82dd9.jpg","releaseYear":2003,"developer":"Nival Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":28449,"name":"Magic 2012","genre":"Desconocido","price":0.0,"description":"(Online Interactions Not Rated by the ESRB) All-new and redesigned, Magic: The Gathering – Duels of the Planeswalkers 2012 takes last year’s massive hit game to even greater heights with better graphics, more options, and new challenges!   Face off against the AI, or gather your allies for the new multiplayer format: Archenemy, where you team up to take down a boss opponent. And if one of your fellow Planeswalkers drops out, no problem–the AI will drop in for uninterrupted action!  Featuring ten unique decks, Duels of the Planeswalkers 2012 also lets you customize those decks. As you progress in the game, you can enhance your deck by swapping in new, unlockable cards!   Gather your allies. A challenge awaits.","imageUrl":"https://media.rawg.io/media/screenshots/f20/f20d9a98ec627047cd9d305b13bfa66f.jpg","releaseYear":2010,"developer":"Stainless Games","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":24160,"name":"Spider-Man: Edge of Time","genre":"Action","price":0.0,"description":"Play as both Amazing Spider-Man and Spider-Man 2099 in SPIDER-MAN: EDGE\nOF TIME, a high-octane, adrenaline-fueled adventure that puts gamers on\na mission to prevent a cataclysmic event that leads to an unexpected\noutcome: the death of Amazing Spider-Man.\n\nFeatures\n\n- Rich, tightly crafted narrative written by acclaimed Marvel writer\nPeter David\n- Epic mission to save Spider-Man and the world from a\nchaotic, dystopian future in a thrilling race against time\n- Two\ntimelines evolve in parallel with story-driven cause and effect moments\nwhere the actions of one Spider-Man have an immediate effect on the\nworld of the other Spider-Man\n- Featuring an all-star voice cast that\nincludes Val Kilmer, Laura Vandervoort, Katee Sackhoff and more!","imageUrl":"https://media.rawg.io/media/games/9c9/9c9f8831ba94aff64264a69667feb100.jpg","releaseYear":2011,"developer":"Beenox","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"}]},{"id":23143,"name":"Sea Dogs: City of Abandoned Ships","genre":"Action","price":0.0,"description":"Fortune and glory awaits you!\nIn Sea Dogs - City of Abandoned Ships you can choose to go it alone and become the most feared pirate of the seven seas. Or you can prove your loyalty to one of four different navies; French, English, Spanish, or Dutch. Sail the high seas as a swashbuckling pirate or dashing naval captain. Explore strange new countries and undiscovered civilizations, raid and plunder ships, fortified ports, and cities. But beware, the dead do not sleep easy, and in the dark South American jungles myth and reality intertwine. Solve the ancient mysteries of a vanishing tribe, cross swords with the most notorious pirates ever to sail the ocean blue and make sure that none of your foes ever set foot on land again.\nChoose from 3 different characters and 3 different classes, Merchant, Corsair and Adventurer, each with its unique quest line\nOver 40 quest generators allowing for an additional infinite amount of quests\nImproved combat system and advanced trading system\nChoose from 3 weapon classes: Light, Medium, and Heavy\nNew \"P.I.R.A.T.E.S\" role playing system with the following characteristics: Power, Insight, Reaction, Authority, Talent, Endurance, Success\nA vast new world to explore! Navigate uncharted waters; seek out new islands, undiscovered cities, and hidden treasures","imageUrl":"https://media.rawg.io/media/screenshots/485/485e7b3f6fa319b726ceb9ced440872d.jpg","releaseYear":2009,"developer":"Akella","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23091,"name":"Sea Dogs: Caribbean Tales","genre":"Action","price":0.0,"description":"Sail the rough seas with your tall ship and loyal crew of vicious cutthroats and fierce corsairs. Build up your fleet and capture and rule colonies to become the mightiest pirate of them all!\nSea Dogs: Caribbean Tales is a naval game devoted to pirate adventures on the Caribbean seas of the 17th century, aiming to be the ultimate pirate simulation. Sea Dogs: Caribbean Tales models all the details of a sword swinging pirate's life and misses no part of his everyday adventures. Taking the role of reckless fortune-hunter Blaze or redheaded daredevil Beatrice – you will navigate your sailor in the original seas of the Caribbean, trade multiple goods, plunder merchant convoys, accomplish quests, build up your fleet, capture and rule colonies and much more. In addition, the game can be played in third person perspective, allowing you to walk through your colonies or fight with your own sword, side by side with your crew, and challenge every other captain on the sea!\n- Develop your captain's skills, muster your crew, battle fierce enemies, and gain treasure and fame!\n- Fight epic naval battles with a squadron of up to 4 vessels and 16 different sailing ships with upgradeable features\n- Exciting weather conditions with devastating storms in full day and night cycles\n- Hone your fighting skills with both swords and guns, trade with merchants, and solve challenging quests to make your fortune\n- Conquer and manage colonies, construct town buildings and improve your defenses\n- Join multiplayer battles with up to 16 opponents in four multiplayer modes: Deathmatch, Team Deathmatch, Defend the Convoy and Capture the Fort","imageUrl":"https://media.rawg.io/media/screenshots/adf/adfd9a73de01abc574381b8822a227a0.jpg","releaseYear":2006,"developer":"Akella","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22284,"name":"One Star","genre":"Action","price":0.0,"description":"One Star - space 2D shooter.\nIn the game waiting for you will find a lot of space battles against with enemy races. Destroy the enemies to get money and improve your spaceship. Attack the enemy's station to win and earn cosmic domination.\nThe game features:\n12 original starship.\n5 starship improvements.\nThe battles with small ships and huge liners.\nMany beautiful planets filling the star system.\nSpace battles are waiting for you!","imageUrl":"https://media.rawg.io/media/screenshots/cce/ccec5dbabd7106133ee7ee34ba31d073.jpg","releaseYear":2017,"developer":"Spectrum Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22194,"name":"NEKO-NIN exHeart","genre":"Action","price":0.0,"description":"INTERESTING FEATURES LIKE MOVING CAT EARS!\nJapan. From time immemorial, there are those who possess superhuman abilities.\nThese beings who looked like a cross between man and beast are called Demi-Humans.\nThey acted as Ninja and served those in power.\nAnd so time passes to present day——\n“We have come from the Fuuma Village to fulfill an ancient contract. To serve you! Nin♪”\nYura and Tama. These ninja cats made their dynamic entrance.\nThese cats approached our hero with their loving aura in full bloom.\nTheir adorability and will causes our hero to be taken by them.\nBut how will he support them? How on earth do you use ninja in this day and age?\nAs he ponders this question, the sense of being a master begins to sprout in our hero when he interacts with these lovely cats.\nBut who is spying on them from the shadows…?\nA heartfelt tale of cat ninjas who won’t shut up about loyalty. With a bit of action thrown in the mix.","imageUrl":"https://media.rawg.io/media/screenshots/ab6/ab69e0cf6d07704776a7959ea5eea972.jpg","releaseYear":2017,"developer":"Whirlpool","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22094,"name":"JASEM: Just Another Shooter with Electronic Music","genre":"Action","price":0.0,"description":"Do you need any reason to shoot your enemies in game? Because JASEM doesn't give you one - just you, your weapons, crazy beats and enemies. And you need to shoot every one of them, and it's up to you to make it the most hilarious and explosive way.\nSo, JASEM: Just Another Shooter With Electronic music - is:\nWhirlwind gameplay;\nGunfight non-stop;\nFighting enemies, no dancing around their slow bullets;\nJuicy low-poly effects;\nCrazy physics - you can do improvized stealth or create shortcuts;\nEpic Bosses;\nNo story, narrative and even texts at all (except of seizure warning, because, you know, if you know the way of warning about it with no text, pls let me know).\nTaking into account the last item, here is the perfect place for game credits:\nGame design, programming, bugs creation and a lot of stuff you don't want to know about - Stas Shostak;\nMusic: Ira Lobanok;\n3D-models: Aleksandr Palmov;\nTesting, creative help, insulting of devs and other invaluable help - Max Efimov, Sergey Mozharovskiy  and other awesome guys.","imageUrl":"https://media.rawg.io/media/screenshots/34f/34f7b1ee15e90ca50ae55b4d3587b6bd.jpg","releaseYear":-1,"developer":"Stas Shostak","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21431,"name":"QbQbQb","genre":"Action","price":0.0,"description":"\nExtended soundtrack available\nCO-OP and single player arcade game. Colorful musical experience designed for both casual and hardcore players.\nSimple rules and increasing speed makes it an ideal choice if you are looking for a game to occupy your friends, guests\nor yourself for a while. Each 100 points pumps up the music and gameplay speed.\nThere is also built-in support for color-blind players, gamepads and ... karaoke.","imageUrl":"https://media.rawg.io/media/screenshots/a15/a15bd05364e1169de767ce60883f1448.jpg","releaseYear":2014,"developer":"Rezoner","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"}]},{"id":21093,"name":"Cubot","genre":"Indie","price":0.0,"description":"At first sight, Cubot is a puzzle-game with a minimalist gameplay, just move color cubes towards tiles of the same color. It's really easy, but it will be a torture for your mind to complete all levels of the game because the apparent simplicity of the game is in contradiction with the complexity of the level-design. Moreover, an important point in the gameplay is if you have multiple cubes, they move simultaneously !\nFeatures:\nEasy gameplay, just move cubes... that's it!\nSimplistic but not repetitive, use different elements to achieve your goal: buttons, elevators, color swappers, teleporters...\nThe game and menus have a clean look to not disturb your concentration. In the same vein, the music is very soothing.\nThere are 80 levels for several hours of playing to keep you challenged.\nThe challenge increases level by level. If you are stumped, help is available!","imageUrl":"https://media.rawg.io/media/screenshots/b00/b009541d85272f619ee88f73de57905c.jpg","releaseYear":2015,"developer":"Nicolas Pierre-Loti-Viaud","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20951,"name":"Robin's Island Adventure","genre":"Casual","price":0.0,"description":"There is an island in the ocean that's lost in the fog and absent from all geography maps. The seafarer suffers a shipwreck and gets washed ashore an island. He attempts to find a way out, as he develops a relationship with the natives.\nThe ultimate objective is to build a ship and leave the island. But first the player must build a house, a boat, and other strategic objects, all the while helping the natives with their problems. The final task is to build a vessel and sail away.\nThe point of the game is to complete the levels Match 3 and receive access to Hidden Objects and Puzzles, at which point the player can begin to build objects.Key features: Incredible locations\nAwesome gameplay\nOriginal game world\n18 building structures\n123 diverse levels\n2 game modes: Normal & Time Challenge","imageUrl":"https://media.rawg.io/media/screenshots/425/425e7836987c8e78f1a11ac480b04fd5.jpg","releaseYear":2014,"developer":"Shaman Games Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20701,"name":"There Was A Caveman","genre":"Indie","price":0.0,"description":"There Was A Caveman is a prehistoric themed, retro styled, action platformer.  Get ready to die and die a lot.\nThe world has been overrun by dinosaurs. The last living caveman, is left alone in his cave, with every other living thing he knew dead. But he does not want to give up the world to these ferocious beasts. So with what little hope he has left, he will venture out of his caves, to find the only thing, that could save the world as he knows it - A female specimen to rebuild the cavemen civilization. But doing that won't be easy as the world is full of these dangerous creatures and other deadly hazards!\nGame Features -\nChallenging gameplay that will keep you on your toes.\nCrisp pixel graphics and smooth animations.\nStrong core game mechanics, with stable platforming, dashing, variable jumping, friction etc.\nLots of various areas to go through, like dark caves, forests or even the insides of a huge dinosaur.\nDangerous dinosaurs and other creatures to fight, including Pterodactyls, Diplodocus and overgrown squid!\nChallenging boss fights, that will test your skills to the max.\nSecondary throwable weapons\nSwimming and underwater areas.\nLots of hidden things, and secret places to discover.","imageUrl":"https://media.rawg.io/media/screenshots/149/149b5439f5cd3e4dd4d09b5581c7f318.jpg","releaseYear":2015,"developer":"Nauris Amatnieks","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19967,"name":"Fairy Tale Mysteries: The Puppet Thief","genre":"Adventure","price":0.0,"description":"When evil Puppeteer kidnaps souls of innocent children, you're assigned your first mission as Brothers Grimm's investigator - find a way to defeat the malefactor and bring rescue to all in need. Follow the trace of magical events to discover sorcerer's blind spot. Use it to defeat him and bring home all who have been lost!\nOnce upon a time, there was a man who went from town to town with songs and poetry, capturing the souls of children. From generation to generation, the tale was told. But every fairy tale has its true bitter beginning. Now a new evil has visited the town of Arbourshire, and children have been going missing. A mysterious puppet theatre seems to be at the centre of their disappearance. The town is in an uproar! A mob roams the streets and the Brothers Grimm have assigned to you the task of discovering the truth behind the Fairy Tale Mystery! Discover the truth behind the myth and save the children!\nfeaturesInvestigate your first case as Brothers Grimm detective!\nRescue kidnapped children!\nResolve mysteries hidden in 19 Mini-Games!\nFind clues in 22 Hidden Object Scenes!\nDefeat the soul-stealing Puppeteer!","imageUrl":"https://media.rawg.io/media/screenshots/0d9/0d98bd96a847184782c28b3e8500e4c0.jpg","releaseYear":2016,"developer":"Gogii Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":18039,"name":"Broken Armor","genre":"Action","price":0.0,"description":"A classic style game with retro graphics and game play like something you'd see on a 5.25\" floppy disk. The protagonist is an inept knight who wears a suit of plate armor that isn't quite up to the task. Exiled from his kingdom, he must find the holy grail if he is to return. He is usually too busy fending off pests to worry about actual combat.  Many floors filled with vermin, hazards, and bosses to stumble your way through.\nNow includes the playable mage DLC.\nLinks:\nGlobal Achievements\nGlobal Leaderboards","imageUrl":"https://media.rawg.io/media/screenshots/dba/dba5793ada972ce3389f61891939f68b.jpg","releaseYear":2016,"developer":"Jonathan Kirk Tindell","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16097,"name":"Star Tactics","genre":"Strategy","price":0.0,"description":"Star Tactics is a hardcore turn-based tactics game all about space fleets battles.\n20+ hours of gameplay, randomized battles, two campaigns. Infinite tactical situations.\nStar Tactics is a rather simple game focused on tactical gameplay with simple rules. Don't expect a developed story, interesting characters or dialogues. Do expect challenging battles, interesting tactical situations and pure joy when destroying an enemy ship. Because battles are tough.Main features:\nTurn-based tactical gameplay with top-down perspective;\nMain campaign featuring large-scale fleet battles;\nAdditional campaign featuring fierce dogfights involving small spacecraft;\nFleet and Dogfight Skirmish modes - randomized battles; Level up your Commander and access new ships;\nActive abilities like missile or torpedo strike, afterburner, shield, U-turn and other awesomeness;\nShips from smallest Scout to  tremendous Dreadnought;\nBroadside-focused ships and ships focused on frontal firepower;\nInteresting, skill-based achievements with meaningful rewards;\nRare visual style with holographic vibe;\nMusic by X3 and X-Rebirth composer.\nWe strongly believe in words: 'Pay once, Play forever' and will provide all future content updates for free.\nThere are at least two planned expansions with new ships, abilities, campaigns and a multiplayer support.","imageUrl":"https://media.rawg.io/media/screenshots/22d/22d1810442fa82904a6cc27f30e1b2de.jpg","releaseYear":2016,"developer":"Devil's Dozen Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15716,"name":"SHOWTIME 2073","genre":"Action","price":0.0,"description":"New from Nicolas Bernardhttp://store.steampowered.com/app/636520\nAbout the Gamein 2073, the greatest show of all time playing with the lives of the participants to the delight of spectators.The game is really very simple. The player must collect the balls and survive for 5 levels. Red balls give him rocket and green balls give him health.The show keeps on getting harder level by level.\nRunners , Spiders , Mecha , turrets ,Human clones want to play with you.\nEvery level is a procedural construction and can be destruct a lot.\nYou can become a star of the show !\nControls are classical FPS keys.\n\" In this game , i wanted the player have fun and fury in the same time.\"\nBERNARD Nicolas , Developer","imageUrl":"https://media.rawg.io/media/screenshots/498/4989b5ea78d1794cbe840155447da24c.jpg","releaseYear":2016,"developer":"Nicolas Bernard","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":15465,"name":"Masky","genre":"Action","price":0.0,"description":"Masky - winner of IGJAM2016 mobile game category - from creators of Timberman and Surfingers.\nTake part in annual grand costume ball. Dance to the mystic sounds and invite as many dancers as you can. Keep balance and watch out for special skills of other dancers’ masks. Explore different worlds through the magic doors. Unlock and upgrade unique masks - dance longer and longer, faster and faster!","imageUrl":"https://media.rawg.io/media/screenshots/5ce/5ced4727bd561d5f853e7d1cf0c29bde.jpg","releaseYear":2016,"developer":"Digital Melody","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":15411,"name":"Heroes Must Die","genre":"RPG","price":0.0,"description":"Heroes Must Die - the Show!http://store.steampowered.com/app/569030/\nAbout the GameKill heroes first. Ask questions later. (Note: game does not actually require you to ask any questions)\nHeroes Must Die is the story of a young hero forcibly conscripted into the villain's army, and viewing classic RPG trials from this perspective. Faced with the daunting task of dealing with the world's evilest boss, stupidest minions, daringest freedom fighters, and troublesome-est posers, how do you survive a world where all sides are in conflict? Battle through hours of challenging combat (even we have to work hard to beat our own game), laugh out loud dialogue (but like, for real, not a 'lol'), and surprising story turns (seriously, a professional playwright wrote this game).\nHeroes Must Die is an action-RPG with aesthetics inspired by the best roleplaying games of the 16 bit era, with the sophisticated story and design of modern epics. Follow a grand and fun story of trying to break the world and then save it. Combat is easy to learn and difficult to master. And best of all, it's free.\nAnd if that wasn't enough, Heroes Must Die has a sequel - an interactive stage show that brings video games to life - now available here on Steam!\nFeatures:\nUnique Combat - An action/puzzle battle system different than anything out there, but still intuitive. Simple rules but difficult to master.\nActual Writing - Heroes Must Die brings sincerely funny dialogue and engaging story. Not content for half-assed reference humor, HMD brings its full ass, and borrows a few other asses, to tell a structured tale with memorable characters and moment after moment of making you laugh without interrupting the flow.\nPixel Art - Retro-inspired graphics from artists who grew up on the best of the 16-bit era. Detailed backgrounds and sprites full of personality are brought to life with only the most limited of technology!\nRockin' Soundtrack - A fantasy/orchestral/prog rock mashup of funky tunes propel you through the game. Available for download!\nNo Inventory - Just focus on the fun stuff.\nNot Roguelike - Sorry, it's not, but this is a good keyword to have\nAlienware FX implemented - check out those lights on your Alienware laptop!\nFree - Yup.\nIt Also Exists in Real Life - Info coming on how you can see the live-action, audience-interactive play!! That's worth at least two exclamation points. Three? What's the conversion ratio, here?","imageUrl":"https://media.rawg.io/media/screenshots/dc5/dc5673b10bf7723c04aed3ac94fbbbb3.jpg","releaseYear":2016,"developer":"Heroic Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13782,"name":"Millennium 5 - The Battle of the Millennium","genre":"Adventure","price":0.0,"description":"Backstory\nMarine has less than a week to get her friends (and herself) ready for the incredible showdown in Mystrock.\nBut as tempers flare and time runs out, isn't the whole enterprise in danger of failing from the start?\nIs Marine's vision a glorious quest... or a sinking ship? And how can peasants face martial artists and their hordes of fans in their own arena?\nFind out what happens... if you dare to be a part of the Battle of the Millennium! Details\nMillennium 5 is the final episode of Aldorlea's flagship series (the makers behind The Book of Legends, Moonchild, Dreamscape, 3 Stars of Destiny, Asguaard, Undefeated etc.).\nFeaturing an immersive story, this game is a fantastic chapter to a series greenlighted by the Steam community that spans over 5 episodes and features more than 20 characters in total.\nKey Features\n35+ Achievements to unlock - can you get them all?\n19 playable characters to manage - build your dream team and defeat Mystrock\n4 levels of difficulty - choose your difficulty and enjoy replaying the game at its most challenging\nChoose visible or invisible monsters - cater to the encounter style you prefer\nOptional guiding arrows - enjoy the game without the worry of having to look up a walkthrough or guide\nDozens of secret rooms - for those who like to explore and discover every secret\n18 quests - easy request from a villager or very tricky riddle to solve, help people as you progress in your adventure\nBattle superb monsters including 9 Animal Kings - they are the most dangerous and feared creatures out there, so beware\nGet help from Jeanne - your magically-gifted fairy friend that you can summon when you really need that little something extra\nGorgeous retro graphics and musics - Millennium features high production values in its genre, all for your enjoyment Best-Selling Games by Aldorlea\nhttp://store.steampowered.com/app/277470\nhttp://store.steampowered.com/app/332390\nhttp://store.steampowered.com/app/370670 Aldorlea Useful Links\nOfficial Website (contains 100+ games including all 15+ Aldorlea Games released to date)\nAldorlea Community (join it to receive help and info about the games)\nAldorlea Facebook Page (become a member to get up-to-date news about us)\nMillennium Help Forum (tons of info to be found there for the aspiring adventurer)","imageUrl":"https://media.rawg.io/media/screenshots/396/3964c0fd28d48068973b8d353ff93e51.jpg","releaseYear":2014,"developer":"Aldorlea Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12588,"name":"SourVR Video Player","genre":"Desconocido","price":0.0,"description":"SourVR video playerSourVR provides an easier way to enjoy local or online VR video content without any setting hassle.  Automatic VR video format detection and support all major format. Online video content aggregation updates every week for your enjoyment*.Deluxe edition http://store.steampowered.com/app/607690/Adapt to major video format for best experiencePlug and play with all major VR device, auto detection for major video format. No more complex setting for video playback.One click to keep your pleasure goingUse any type of your controller as remote to fast forward or pause at anytime. View any type of video from your local library in one click.Find your VR video in a blink*Huge content selection in one platform, easy to navigate by category. Massive video entertainment is waiting for you to explore.Key FeaturesSupports HTC Vive, Oculus Rift and OpenVR headsets.\nSupports Vive controllers, Oculus remote, keyboard and mouse.\nSupport 2D, 180°, 360°, Over Under and Side by Side videos.\nAutomatic video format setting memorized.\nStreaming video support and youtube playback support*.\nOnline video content aggregation*.\nLocal files navigation in HMD.\nScreen projection size adjustment.Video Format Support.mp4, .m4v, .mp4v, .3g2, .3gp2, .3gp, .3gpp, .mpg, .mpeg, .m1v, .mp2, .mp3, .mpa, .mpe, .m3u, .asf, .wma, .wmv, .wm, .asx, .wax, .wvx, .wmx, .avi, .ivf, .mov\n*The Youtube playback support and online content aggregation feature is only available in deluxe edition.  http://store.steampowered.com/app/607690/","imageUrl":"https://media.rawg.io/media/screenshots/a98/a985561f72b794fc331ffa0ba205109f.jpg","releaseYear":2016,"developer":"River Twice Co","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12533,"name":"Bunker 58","genre":"Action","price":0.0,"description":"Bunker 58:\nLocked inside of Bunker 58 surrounded by unidentified creatures trying to kill you. There is only one way to survive, and that is to kill anything that attacks you. You are set with a selection of weapons ranging from melee to guns, and even have a torch for the use of light.\nHow much do you value your life, and how much are you willing to kill to keep it?\nFeatures:\n- Atmospheric soundtrack\n- Enemy ai\n- Open map (The Bunker - Open for you to explore)\n- Animated jumpscares\n- Unique Enemie\n- Multiple weapon choices\nPlanned:\nWe hope to add the following\n- A selection of different maps\n- Re-spawning enemies, so players can enjoy enemies wave by wave.\n- GUI that indicates wave\n-Purchasable weapons on wall (Used by points earned from killing enemies)\nPlease note that this state of the game is a complete version and may never change, meaning the planned changes above may never be added.\n*Enemies can be killed within around a 15 minute gameplay time, which is why we are planning on adding the re-spawning of enemies really soon! That being said, we still find the game to be enjoyable.*","imageUrl":"https://media.rawg.io/media/screenshots/2ba/2badfa59058d8d9c2daa2a9dc20975df.jpg","releaseYear":2017,"developer":"Acuze Interactives","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":9907,"name":"Pictopix","genre":"Casual","price":0.0,"description":"Pictopix is a puzzle game where you use logic to color squares on grids in order to reveal pictures. Easy to learn and very addictive, the game starts with small grids and ends with much bigger grids. With over 150 colored puzzles, a shuffle mode and a puzzle editor, Pictopix will bring you hours of fun!\nThe game is similar to Picross, Nonograms, Hanjie, Pic-a-Pix, Paint by Numbers and Griddlers.\nMain FeaturesPlay over 150 beautiful colored puzzles (+1000 from players)\nLearn the rules with a fun tutorial\nPlay puzzles randomly with the Shuffle mode\nEarn awards and achievements for more challenges\nCreate your own puzzles\nAnd share them with others players!  (via Steam Workshop)\nRelaxing music (Jazz, Bossa Nova)Other FeaturesLogically solvable puzzles (no guessing required)\nUseful hints to help beginners\nPlayable with mouse, keyboard or game controller\nMultiple save slots\nPuzzles can be suspended and resumed at any time\nUndo and Redo buttons to fix your mistakes\nSquares can be temporarily marked\nSmart Slide (helps you to draw straight lines even if the mouse wanders out of the row)\nTouch Screen support\n13 languages (translated by the community)Steam FeaturesCloud\nAchievements\nWorkshop\nTrading Cards\nSite: http://pictopix.tomlabgames.com/\nTwitter: https://twitter.com/pictopix\nFacebook: https://www.facebook.com/pictopix/","imageUrl":"https://media.rawg.io/media/screenshots/ff0/ff0edaf53508cfcaa3937575e68faf2e.jpg","releaseYear":2017,"developer":"Tomlab Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":5659,"name":"Sonic's Ultimate Genesis Collection","genre":"Adventure","price":0.0,"description":"Sonic's Ultimate Genesis™ Collection contains over 40 classic games from SEGA's 16-bit Genesis, 8-bit Master System and 1980’s arcade era games library! This is the first compilation to include the complete series of Streets of Rage, Phantasy Star™, Golden Axe and Shining Force as well as other classic titles.","imageUrl":"null","releaseYear":2009,"developer":"Backbone Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3709,"name":"JoJo's Bizarre Adventure: All-Star Battle","genre":"Arcade","price":0.0,"description":"With a revolutionary proprietary graphics shader system, JoJo’s Bizarre Adventure: All-Star Battle gives players the feeling that they are participating in vivid and colorful battles straight from the pages of the manga.  Players will be able to choose from an impressive cast of characters spanning the entire series.  Each character comes with their signature moves punctuated by dynamic camera angles to capture every highlight of the fight either against computer opponents via Story Mode or human adversaries online.\n1-2 players\n4MB minimum save size\nHDTV screen resolution: 720p\nNetwork Features\nNetwork Players 2-2\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\n© Hirohiko Araki & LUCKY LAND COMMUNICATIONS / SHUEISHA\nGame © 2014 BANDAI NAMCO Games Inc.","imageUrl":"https://media.rawg.io/media/games/f3b/f3b53a701afa9e2786c649303dc0440e.jpg","releaseYear":2013,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":2954,"name":"Warhammer 40,000: Armageddon","genre":"Strategy","price":0.0,"description":"\"Armageddon, a world whose name has become a byword for war and destruction on a massive scale…\" -Lord Commander Solar Eugenian\nThere is no peace amongst the stars... It is the 41st millennium and there is only war!\nWe live in the Imperium of Mankind, the greatest empire the galaxy has ever known. Millions of planets united in their adoration for the Emperor.\nBut we are not alone…\nA massive space hulk is drifting towards Armageddon, and the planet is threatened by the war hungry brutal Orks. Welcome to the battlefield!\nARMAGEDDON MUST NOT BE LOST\nWarhammer 40,000: Armageddon is a fantasy war game set in the Second War of Armageddon.  You take the role of defending the planet as the Imperium of Man against the Ork invaders.  Throughout the campaign you will also be joined by three chapters of Space Marines: the Salamanders, Blood Angels and the Ultramarines.\nIn this hex-based, turn-based strategy game, players will lead the Imperial forces of the Armageddon Steel Legion and Space Marines from a variety of Chapters against the Ork invasion through over 30 scenarios, on the hostile terrain of the planet and its gigantic Hive Cities.\nThe game features a complex plot, involving known characters from the Warhammer 40,000 universe and while advancing through the campaign, the player will have the ability to carryover his core force from scenario to scenario.\n\nPlayers fight alongside Commissar Yarrick and Commander Dante against the cunning Ork Warboss Ghazghkull Thraka and carry over battle-hardened veterans from scenario to scenario, using their experience and upgrading their equipment.\n\nOn top all this extensive modding options are available through a powerful and easy-to-use game editor.\nFeaturesLarge branching campaign with 30 major scenarios, plus additional 5 tutorial scenarios that explore the story in detail.\nHundreds of hours of gameplay fun with huge replay value and several difficulty settings.\nThe game portrays the Second War for Armageddon in great detail, from the initial Ork landings to the final liberation of the planet.\nFight alongside Commissar Yarrick and Commander Dante against the cunning Ork Warboss Ghazghkull Thraka.\nA complex plot, which can develop during a mission, right in the middle of battle, creating an engaging story line with unexpected twists.\nMeet several iconic characters like Inquisitor Horst, Governor Von Strab and many more, who will guide you through an epic scenario based adventure all with their unique voice-overs.\nPlayers lead Imperial troops of the Armageddon Steel Legion, with supporting assets from a number of Space Marine chapters against the ferocious Orks.\nCarry over battle-hardened veterans from scenario to scenario, using their experience and upgrading their equipment and weaponry.\nDetailed combat model with custom terrain, cover and morale effects.\nGuide your troops on Armageddon`s hostile ash wastes, through treacherous volcanic canyons, over acid polluted rivers, through dense jungles and through massive Hive cities.\n300+ unit types representing Armageddon Steel Legion, the Orks, Blood Angels, Ultramarines and Salamanders Space Marine chapters and even Titans!\nMultiple weapon systems per unit, each with their unique stats and graphical effects.\n20 different unit stats plus many unique special traits and abilities.\nToggle options to set the game to your own liking like to enable/disable: Fog Of War &  Undo Moves.\nA separate set of maps are designed and balanced specifically for asynchronous multiplayer via Slitherine's PBEM++ system.\nPlay as either Orks or the Imperial forces in multiplayer.\nIncludes a Hotseat mode.\nExtensive modding options delivered through a powerful and easy-to-use game editor.\nDesign and build your own unique scenarios and share them with the Warhammer 40,000: Armageddon community.","imageUrl":"https://media.rawg.io/media/games/c35/c35a968314150e3832c1ed162d57c63b.jpg","releaseYear":2014,"developer":"Slitherine Software","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2724,"name":"Pixel Hunter","genre":"Action","price":0.0,"description":"Pixel hunter is 3D side-scroller game, designed in Voxel and 8Bit style. The game is about a hunter, whose weapons were stolen by animals. His only thought is to return them all. The main objective of the game is to go through the worlds, kill the Boss and retrieve your stolen weapons.\nYou’ll face different animals such as birds, amphibians, goats and fish. By the end of each level you have to fight the Boss.Main Game Features\nAwesome 3D Voxel and 8bit graphics\nPerfect mix of retro and modern game styles\n5 worlds with various environments and unique soundtracks per each\nEpic fights with bosses at the end of each level\nMultiple game plays within one game (side-scroller, runner, boss fights)","imageUrl":"https://media.rawg.io/media/screenshots/541/541a4d10bfc5faf51ae994163bc3e665.jpg","releaseYear":2014,"developer":"Lemondo Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"}]},{"id":2387,"name":"Prison Run and Gun","genre":"Action","price":0.0,"description":"Prison Run and Gun is a retro puzzle platformer with modern gameplay and mechanics.\nThe recent events in a state prison, involving Jake from  Team was a perfect moment for some prisoners to escape - you are one of them.\nUse your skills and the guns to break through 30 sections standing between you and the freedom !\nPrison Run and Gun  is a spinoff of our other game - Hot Guns\nhttp://store.steampowered.com/app/376910/Hot_Guns/","imageUrl":"https://media.rawg.io/media/screenshots/522/5228de3ebbe727b2978cf57e1f67bef9.jpeg","releaseYear":2016,"developer":"Quantized Bit","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":983717,"name":"The Legend of Zelda: Echoes of Wisdom","genre":"Adventure","price":0.0,"description":"The Legend of Zelda: Echoes of Wisdom is an adventure game. It came out on 26-09-2024. Most rawgers rated the game as ´Recommended´. The Legend of Zelda: Echoes of Wisdom is available on Nintendo Switch. Eiji Aonuma produced the game.","imageUrl":"https://media.rawg.io/media/games/ef0/ef095574ebf35dbe30cbb85f3798b4e5.jpg","releaseYear":2024,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]}]