[{"id":468,"name":"Kingdom Rush Frontiers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e11/e11de17d005559710270c5d6a8e531db.jpg","description":"The world's most devilishly addictive defense game is back - welcome to Kingdom Rush: Frontiers!\nBigger and badder than ever before, Kingdom Rush: Frontiers is a whole new level of the furiously fast, enchantingly charming gameplay that made the original title an award-winning hit. Command your troops through an epic (mis)adventure as you defend exotic lands from dragons, man-eating plants, and ghastly denizens of the underworld -all with flashy new towers, levels, heroes, and more goodies to help you crush your foes to a pulp. (Don't worry, we've still got all the good ol' stuff from the last game, too. It's vintage now.)\nKingdom Rush: Frontiers packs in so much content, it's like a fully upgraded artillery blast of mouthwatering, pixelated joy launched right into your smiling little face... and it hurts so good!Key Features\nFantastic Tower Defense game with lots of strategic decisions. Great power-user stuff like Reinforcements, Meteor Strikes, Heroes and more.\nFortify the frontier in exotic news lands - hold the line in deserts, jungles and even the underworld!\nEight new specialized tower upgrades! Slice, sizzle, and stomp your foes with Crossbow Forts, Mighty Templars, Necromancers, and even Earthquake Machines - hey, we told you we were shaking things up.\nOver 18 tower abilities! Unleash Death Riders, pestilence clouds, or Assassins that steal and kill your enemies!\nOver 40 enemies with unique abilities! Stay on your toes as you fight through desert sandworms, tribal shamans, nomad tribes and underground terrors.\n9 legendary heroes. Choose your champions and train their abilities! Each has unique specialties that fit different play styles! and More to come!\nSpecial units and features on every stage! Watch out for the Black Dragon!\nMerciless boss fights! Hey, we told you to get those upgrades...\nUpgrade system allows you to min/max your towers towards your preferred strategy.\nHours of gameplay with over 70 achievements!\nClassic, Iron, and Heroic game modes to challenge your tactical skills!\nThree difficulty modes! Are you up for a real challenge? Go with Hard mode!\nIntoxicating charm with a rousing score, full-bodied voice-overs and lovingly illustrated cartoon art! (Complete with cartoon blood, naturally.)\nIn-game encyclopedia! True warriors know thine enemies... and their towers. Study up!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ironhide Game Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":261226,"name":"Warcraft III: Reforged","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e9/4e908c9270228430128105bcd88e51bc.jpg","description":"Warcraft III: Reforged is a stunning reimagining of the revolutionary real-time strategy game that laid the foundation for Azeroth’s most epic stories. Veterans and newcomers alike will experience these pivotal events in Azeroth’s history like never before.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":53714,"name":"Battletoads & Double Dragon","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5d9/5d964c81ef84a680319ae3860ebe8463.jpg","description":"Battletoads/Double Dragon is a 1993 beat 'em up developed by Rare and published by Tradewest. It was originally released for the Nintendo Entertainment System and later ported to the Mega Drive/Genesis, Super NES, and Game Boy.\nThe Ultimate Team is a crossover of both Technos Japan's Double Dragon and Rare's own Battletoads game franchises, although Technos had little or no credited involvement in the production of the game outside of the Double Dragon license. The game features the characters from the Double Dragon series, Billy and Jimmy Lee, two young martial arts experts; also included are the three humanoid toad protagonists from the Battletoads game. It is also the first Battletoads game to feature all three toads as playable characters. The game's engine and design are directly based upon the Battletoads series.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Rare","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"},{"id":0,"name":"SNES"}]},{"id":19461,"name":"99 Levels To Hell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d5/4d5943b2223a695d80944dbcdeaa3d52.jpg","description":"99 Levels to Hell is a platform shooter with lots of guns, upgrades, magic, traps and monsters to kill.\n99 Levels to Hell is a rogue-like, which means surviving is key and every time you play you get a new set of levels to play.\nWhen you complete 10 levels, the 10th being a boss-fight you unlock a door to the next dungeon.\nHidden in the darkness of the dungeons are shops, casinos and elevators. And if you search the dungeons carefully, you might find secret rooms that unlock more of the story, and free new adventurers, you can play as in your next game.\nBut best of all you get to kill the devil to a killer metal soundtrack!\nKey Features10 different dungeons.10 bossfights.100 levels that spawn at random.25+ monsters.50+ powers ups and weapons.Shops, portals, casinos and elevators.Unlock the story of two brothersAnd blood, a lot of blood.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"B-evil","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11552,"name":"Black Mirror III: Final Fear","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68c/68c817e7cf9168e4944c9f060441a74c.jpg","description":"In the final chapter of this acclaimed horror trilogy, Black Mirror III picks up right where the thrilling ending to Black Mirror II left off.\nOnly a short time ago, Darren Michaels was a quiet store clerk in a sleepy New England town. Now in Willow Creek, England, a tormented Darren barely reacts as police handcuffs are closed on his wrists. All the evidence points to him, and the police have arrested Darren as their primary suspect in a fatal crime. He's subjected to extensive questioning, but Darren is numb to the events occurring around him, and has withdrawn into a deep emptiness. Then after several weeks of incarceration, Darren is unexplainably released.\nBut he is not free. Darren remains terrorized by sleepless nights, nightmare-like visions, and the chilling specter of murder and death,.\nNow alone, Darren must continue his search to uncover what has been happening to him and lift the veil on his clouded past. What has he really seen? What do his torturous nightmares really mean? Who is the mysterious person that posted the bail to set him free? What demons lie waiting in the crypt?\nReturn to face the dark forces that haunt the ominous Black Mirror Castle as you search for the secrets that lie behind the tangled web of haunting riddles, mysterious secrets and dark characters. Alternate between two playable characters, as you explore over 100 highly detailed and atmospheric locations; interacting with over 50 characters in your quest for redemption.\nDare to find the answers in the climactic final chapter of this epic trilogy - for once you gaze into the Black Mirror, you won't be able to look away.Features:\nIn the final chapter in this acclaimed horror trilogy, Black Mirror III picks up right where the thrilling ending to Black Mirror II left off.\nReturn to face the dark forces that haunt the ominous Black Mirror Castle as you search for the secrets the lie behind the tangled web of haunting riddles, mysterious secrets and dark characters.\nAlternate between two playable characters as you explore over 100 highly detailed and atmospheric locations, and interact with over 50 characters in your quest to find redemption..\nDare to find the answers in the climactic final chapter of this epic trilogy - for once you gaze into the Black Mirror, you won't be able to look away!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"dtp Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":11392,"name":"Think of the Children","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37c/37cb3c7740f38ef84b4eedb122ac0872.jpg","description":"Little Bobby’s dead, the BBQ is on fire, Jen’s eating poisonous berries and the birthday cake still needs icing. It’s just another wonderful day out with the kids in Think of the Children, a chaotic parenting simulator for up to four players.\nHauled before the court for bad parenting and endangering the lives of your children, the Prosecutors present a series of events as evidence that will either condemn or exonerate you: a birthday party at the park, a day at the zoo, a camping trip, an unexpected visit to the Australian Outback and more. Each of these locations proves to be far more dangerous than they sound, and even the tamest of environments are filled with deadly hazards.\nRun solo, or team up with other parents locally and online, to play through each trip in flashback to prove your parenting skills-and your innocence-to the judge, and avoid going to jail.\nMulti-tasking mayhemThere’s never a dull moment when you’ve got the BBQ to tend, picnic tables to set, some of the kids are playing with a rabid dog, and two of them just ran out onto the road.Parenting is hardTo get a good parenting grade and avoid jail time you’ll need to get all your tasks done, keep the kids happy, and–ideally–alive!Nowhere is safeThe local park, the beach, the supermarket, the zoo. Great places for a day out with the kids. That is, aside from the poisonous berries, ravenous seagulls, towering grocery shelves and electrified pens.All kinds of families welcomeSingle parent? Two mums? A mum, two dads and a horse in a long distance relationship? It’s all good. Parent solo or co-operatively with up to four players, locally or online.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SURPRISE ATTACK","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":6708,"name":"Zaccaria Pinball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccb/ccbd2ac82626c7fbb8970b5fa40dd9fe.jpeg","description":"Zaccaria was founded by three brothers (Marino, Franco, & Natale) and was the 3rd largest manufacturer of pinball machines in the world (behind Bally & Williams). They had created and produced more than 35 different pinball machines between 1974 and 1987.FEATURESTime Machine table is playable totally free.\nAll other 37 pinball tables are in trial mode that means there is a score limit.\nHigh detailed Zaccaria pinball tables.\nOriginal table rules, sound effects and vocals.\nBreathtaking light and shadow effects.\nVery accurate and customizable physics and ball movements.\nArcade and Simulation game modes.\nCustom game mode allows you to tweak pinball machine the way you like!\nCamera Editor to make camera views you prefer to.\nVarious fixed and customizable camera views.CUSTOMIZATION FEATURESZaccaria Pinball has tones of awesome customization features which affect to graphics and physics aspects of the game. As well as there is a camera editor.\nGraphics Tweaks: Room Light, Metal FX, Particle FX, Dynamic Light, Reflection FX, Glow FX, Motion Blur, Lightmap, Colors\nPhysics Tweaks: Flipper Size, Playfield Tilt, Flipper Force, Ball Elasticity, Ball Friction, Slingshot Force, Bumper Force, Ball Velocity, Plunger Force, FLipper Tap PassSOLID-STATE (SS) PINBALL TABLESTime Machine (free table)\nDevil Riders\nLocomotion\nPinball Champ '82\nPinball Champ\nFarfalla\nBlackbelt\nRobot\nHot Wheels\nSoccer Kings\nShooting the Rapids\nStar God\nMagic Castle\nEarth Wind Fire\nClown\nFuture World\nFire Mountain\nSpace Shuttle\nWinter Sports\nZankor\nPool Champion\nMexico '86\nHouse of Diamonds\nMystic Star\nSpooky\nStar's Phoenix\nStrikeELECTRO-MECHANICAL (EM) PINBALL TABLESAerobatics\nCircus\nCombat\nMoon Flight\nLucky Fruit\nUniverse\nSupersonic\nCine Star\nWood's Queen\nNautilus\nRed Show","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"ASK Homework","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":61585,"name":"Reigns: Game of Thrones","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f88/f88c1db527f668a6cd875425f1a08d67.jpg","description":"Reigns: Game of Thrones is the third installment of the Reigns mobile game series and the first to be based on the popular fantasy TV series Game of Thrones.\r\n\r\n###Characters\r\nThe player takes control over one of the leaders in the medieval world of Westeros. At the start of the game, he or she assumes the role of Daenerys Targaryen, while other characters, including Tyrion and Cersei Lannister, as well as Sansa Stark, and Jon Snow, have to be unlocked as the player progresses in the game. \r\n\r\n###Gameplay\r\nThe game combines elements of a strategy and a visual novel. A term “swipe 'em up” was coined for the Reigns gameplay model, which is somewhat similar to a game book. The player faces other characters, dialogue options, and situations, and has to make difficult decisions. There are always two options to deal with each situation, and the player can swipe the screen right to choose one option or left to choose the other. \r\n\r\nThe choices he or she makes affect the plot and the state of his or her kingdom. The game informs the player which factors his or her decision will affect, however, it does not specify in details which consequences it may provoke. Ill-considered decisions can lead the main character and his or her faction to defeat and even a grisly death.\r\n\r\n###Style\r\nThe game features simple and somewhat comical portrayals of the Game of Thrones characters.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Devolver Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":50824,"name":"A Raven Monologue","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a8/9a807d0e94a4f28f8bfb6f301ed3e502.jpg","description":"Dearest Sir Raven,\nDo you still wander around without end?\nCrafting colors under the still and silent\nNot knowing I'm waiting here alone without a friend\nDearest Sir Raven,\nWhen you are around, would you mind to stop by?\nJust a hello, just a moment\nTo let me savor the memories before our goodbye\nDearest Sir Raven,\nLet us go home\nTo the place devoid of reality frame\nWhere I shall  watch over us even without a logical form\nA Raven Monologue is a short experimental silent story about a raven that does not know how to croak and his relationship with the people in the town.\nThis experiment was part of #MojikenCamp2, an internal upgrade program by Mojiken Studio to experiment with how to tell stories or to communicate an experience using a constrained work of interactive art.\nIt features:\nA silent Raven\nFictional people\nHand-drawn art\nA story that you can interpret without limit\nMusic by Christabel Annora","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mojiken","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":46063,"name":"Tricolour Lovestory","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3f/b3fb23e446212a6662daa2fff28acb42.jpg","description":"——It is the freedom, that one’s been longing for a lifetime. ——It is the simple of mind, that one’s never released from its shackle.——It is the emaki, that we all paint our own color on.\n◆STORY◆\nIt was the fall of 2005, weather here in the River City was warm and lovely.\nHis childhood is like a pair of handcuffs, shackled the boy like he was soaked in dark grey paint.Entering the classroom called 「Fine Art」,\nhe saw 2 girls who auras out entirely different colors, embraced him at the same time.He almost say the auras encountered, twined, parted, and twined again……The young man was fascinated, before he could even reach his inner self. 「……How about we paint something together……」「……all three of us, from now on……」\n◆CHARACTORS◆\n◆Violet◆\nCV：朱雀橙\nBirthday:Oct.7th    Height:162cm    Weight:51kg\nB：96(D)    W：60   H：87\nOne of the main characters, 17 and in her junior year.\nLike the young man, she was also a transfer student, and happened to sit by his side.\nWith eyes deep like amethysts, dark silk-like hair a face of perfect beauty but cold as ice, and mesmerizing bosom, she drew attention wherever she went.\nAn ‘Ice Queen’ like her, responded nothing after the young man greeted her. And because of this, she wasn’t the most popular one among her classmates.\nBut in the professor’s point of view, Violet was an absolute wizard of brushes. She worked her magic on a canvas like no one ever seen before. But her art was quite distinguished from her personality and seemed missing something crucial. What would that be? What would that be?\n\n◆Daisy◆\nCV：小N\nBirthday: Aug.10th     Height:157cm  Weight:44kg\nB：82(A)    W：58    H：85\nOne of the main characters, 17 and in her junior year.\nShe always light up the room with her bright smile. But not always speaks her mind.\nShe had lived in the same block with the young man, and had known him for 10 years. She always tried to protect him. And though she was the younger one, she insisted on acting more mature. And when he was locked up by his parents, he could always count on her.\nBut for some reasons, she is on 「NOT TALKING」 term with him.\n◆SYSTEM◆\n\n●Your decisions will guide the game to come!\nThe game carried the original, unprecedented system which basically uploads your every choice to our cloud sever, and shows the result to all after data was gathered and calculated on our page. So the ending isn’t final yet, and the rest is for you to write.\n◆STAGE◆\n\n●Wuhan - the River City\nA beautiful city in central China, also known as ‘The River City’. Everyday here is a new and promising day.\n\n●Wuhan No.12 High School\nFound in 1954, a prominent high school, and has a group of students studies Fine Art every grade.\nTrading cards: According to new policy of Steam, trading cards will be available when the quantity of copies of game sold reachs a certain amount.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"HL-Galgame","platforms":[{"id":0,"name":"PC"}]},{"id":27390,"name":"Metroid Fusion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43d/43dc073be8443e5f39e5d02f8d344127.jpg","description":"While lending mission support on planet SR388, interstellar bounty hunter Samus Aran is attacked by an X parasite, an organism with the ability to mimic the abilities of any creature it infects. Near death, Samus is saved by a vaccine made from the DNA of the last Metroid--the X parasite's only natural predator. When the X spread to a research station in orbit around SR388, a weakened Samus is forced to exterminate them all...or die trying.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":25618,"name":"Sam & Max Season One: Save the World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/04c/04cce795a298775d95086af2046369b9.jpg","description":"Team up with Sam & Max, self-styled Freelance Police with their own\nbrand of justice. Uncover clues, interrogate suspects, crack six bizarre\ncases, and find out why Sam & Max has been praised as the funniest game\nin years.\n\nSeason One of this award-winning series can now be played on the Wii. So\nget ready to flop down on the couch with your Wii remote in hand and\nlaugh. A lot.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Telltale Games","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":25373,"name":"No More Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e48/e4887e872c0e3ab9055ba2ab82477c40.jpg","description":"No More Heroes is the story of Travis Touchdown. He has received orders\nto kill a vagabond. In front of him appears the handsome assassin Helter\nSkelter. After a fierce skirmish, Travis eliminates Skelter, upon which\nSilvia Christel arrives. She informs Travis that his victory was done\nwithout UAA permission, but he nonetheless becomes the 11th best\nassassin. And so Travis’s journey begins.\n\nUsing the unique characteristics of Nintendo Wii, No More Heroes will\noffer an exhilarating action experience, a thrilling scenario written by\nSuda51, and stylish visuals and sounds created by Grasshopper\nManufacture Inc.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Grasshopper Manufacture","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii"}]},{"id":19478,"name":"Cradle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6e6/6e6f8a9983d474a9648ddfc238979d11.jpg","description":"Cradle is a sci-fi first-person-view quest designed for the player to explore the surrounding world. The story is built around the relations of the protagonist and a mechanical girl who by quirk of fate found themselves amidst the desert. The player’s task is to repair the mechanical body of his companion and solve the mystery of the neglected entertainment park located not far from the yurt together.Key Features\nOpen World. Explore the mysterious and stylish world of the robotized Mongolia. Search the yurt, take a stroll down the river or head towards the entertainment park - this game has no fences you cannot overcome.Interactive Environment. Interact with objects - all of them bear a part of the story and most can be used in the gameplay.Living Characters. Communicate with NPCs. Owing to non-standard emotion display technology where actor eyes video is used, the NPCs in Cradle look as ‘live’ ones.Deep Story. Immerse into learning the thoroughly thought-out story. Every of its detail adds to the storyline, while a short newspaper slip accidentally found in the steppe could completely change the sense of the storyline.Varied Gameplay. Mix thoughtful exploration quests with bright and dynamic mini-games.Excquisite Soundtrack. Engulf the atmoshpere of mystery with the enchanting soundtrack of the game. Cradle contains 90 minutes of music including the meditative ambient, synthetic tracks and vocal compositions.Storyline\nThirty years ago in the mid-2040s the sweeping development of neuroscience stirred up the common anticipation of victory over aging and death. In 2047 the scientists of the Neurocopying Institute in Cologne run the first experiments on transferring human consciousness onto an artificial carrier. In the course of experiments a weird previously unregistered phenomenon was discovered - the copies of neurotic system of the test subjects awoken in the computational device began to self-destroy by immersing in a state of deep irrational fear.\nThe discovery of the mysterious phenomenon induced a string of events to have completely changed the society. Dozens of years later the question of the ‘Panic Attack’ nature still remains open. We do not know how far the researchers’ thought has led them in search of the answer, but we believe it hardly ever visited this Mongolian steppe.\nYear 2076, Mongolia. You wake up in a yurt amidst the boundless steppes. You neither remember your name, nor are aware of how long you had slept. Who are you? Who is this mechanical girl sitting on the table and what is the number she has on her chest? Nearby there towers the dome of a neglected entertainment park. How did it appear in these desert lands? What has happened here? Look around and try to sort things out. You are to begin on a peculiar and a touching story.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Flying Cafe for Semianimals","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17767,"name":"XIII Century – Gold Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41e/41ea27e7f042b95ee18a0ad5532d7460.jpg","description":"XIII Century Gold Edition combines the highly successful strategy game XIII Century: Death or Glory with the follow-up sequel, XIII Century: Blood of Europe.\nXIII Century: Death or Glory is an RTS game which immerses players in the Middle Ages. Among the playable factions are the English, the French, the Mongols, the Germans and Kievan Rus' (Russians). The game consists of 5 campaigns, which cover the most well known battles of that period. XIII Century: Death or Glory features large-scale battles, with thousands of soldiers located on a battlefield at the same time, and offers players a chance to test their skills as military leaders in medieval Europe.\nXIII Century: Blood of Europe campaign is set in 1266 AD. Alexander Nevsky, the famous defender of ancient Rus' western borders, is long gone, and the knights of the Teutonic Order are again marching to Pskov, a gem of the Northern Rus'. They are out for easy prey and loot. Dovmont, Prince of Pskov, is the only hope to push out the invaders. Prepare to join his armed force to defend their territory and win fame worthy of the memory of the Grand Prince Alexander! Enjoy historical battles of the Middle Ages as Dovmont leads his troops against German and Livonian knights.\nFeatures\nOver 40 battles in 5 campaigns. Famous battles that changed the face of medieval Europe\nHistorical reconstruction. Real conditions of renowned battles such as landscape, time of day and weather conditions are taken into account\nAuthentic heraldry of European aristocracy\nDozens of unit types\nWeapons, arms and equipment of knights are made using historical documents and specifications\nUnique battle system taking into account 80 parameters and characteristics, which allow complete authenticity of medieval battle on the unit level\nState-of-the-art shader graphics with astonishing level of refinement and veracity\nLAN and Internet multiplayer\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Unicorn Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16514,"name":"Sunrider: Liberation Day - Captain's Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/188/188a9cd02ab4fbdaea21e26349e82e81.jpg","description":"Sunrider Liberation Day is a turn based tactics game with deep storyline segments where you are Captain Kayto Shields of the starship Sunrider and must lead your squad of mecha pilots to victory.\nCombining an edge of your seat story from the best mecha animes with ruthless gameplay where every mistake is punished and every victory feels like a triumph, Sunrider Liberation Day is a must play for fans of Japanese tactics RPGs and anime.\n-Command the prototype starship Sunrider and her squadron of mechas in brutal battles for survival\n-Intense story where one of your beloved crew members is a spy\n-Vastly improved art and gameplay mechanics from Sunrider Mask of Arcadius\n-Full voice acting in Japanese for the entire main cast\nNote: It is highly recommended that you play Sunrider Mask of Arcadius (for free!) before playing Sunrider Liberation Day.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Love in Space","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14740,"name":"The Last Door: Season 2 - Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8f/a8f2bae0d8d8aeaa79293620a4d9aa18.jpeg","description":"In Season 2 of the award-winning hit The Last Door, delve further into the madness of the Veil as Dr. John Wakefield, psychiatrist to Season 1’s protagonist Jeremiah Devitt. Setting out in search of his client who has mysteriously vanished, Wakefield is soon drawn into the haunting web of forbidden knowledge, madness, and a much deeper conspiracy hiding it all than he ever could have imagined. As his search takes him beyond England, will he find his missing client? Or will he merely find that he, too, is about to become lost in the search for the Last Door?\nThe Last Door Season 2: Collector’s Edition brings four new episodes and exclusive extras with more mysteries, more locations, more characters and more chilling otherworldly horrors than the first Season. Journey back to Victorian England, through mental asylums, abandoned manors, opium dens and beyond in this fascinating conclusion!\nFeatures:\nSequel to the award-winning point-and-click Victorian era horror adventure, The Last Door\nSearch for and uncover forbidden knowledge that may be driving you mad\nGuide Dr. Wakefield through new locations, characters, scenes, and puzzles in a new compelling mystery\nFour episodes and exclusive extras and bonus content in one limited-edition set\nA brand new haunting, original musical score by Carlos Viola\nInspired by the works of H.P. Lovecraft and Edgar Allan Poe\nAvailable now on Steam Early Access at a discounted price","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Game Kitchen","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":13398,"name":"Poi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a99/a9916b6e2c4bd85ec5a6c820b46c7bf6.jpg","description":"Poi is a 3D platformer featuring two kids on a grand adventure to unravel the mysteries of the Milky Way Globe. Explore uncharted lands, compete in challenge levels, meet quirky characters and defeat comical creatures on a journey to become a Master Explorer.\nKey FeaturesAdventure: Explore the world in search of 100+ Explorer Medallions.\nChallenge: Set the fastest times in global online leaderboards.\nMastery: Learn to pull off wall jumps, triple jumps, rolling long jumps and more.\nOriginal Soundtrack: Listen to original compositions from composer Lyndon Holland.\nController Support: Plug & play support for dozens of devices.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"PolyKid","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12411,"name":"Unknown Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/852/8520c33879e579a9c902fa351791a719.jpg","description":"\" I hope that you know me, but this is not important. I've been wanting to do away with you...\"\nThis phrase - the beginning of a huge story!\nYou don't know, where you are and you don't know this man, but your first purpose - to find it.\nThis game is a indie first-person shooter, with an intricate story that happened to one person, this person is the main character and you will find yourself in his shoes. You must have a good reaction to dodge lasers, many traps and kill your enemies, and do not forget about your main objective: to get to the menacing stranger to you. Though it may seem easy to some, but in reality it is not. The main character, and not only he, but also you want to as quickly as possible to wait the moment when you will be in front of one you wanted to see.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nikolai Patrakov","platforms":[{"id":0,"name":"PC"}]},{"id":9930,"name":"Cavern Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5af/5af1974e330a1ba6f4319400dde88129.jpg","description":"Cavern escape is new platformer puzzle game.\nThe goal is simple: Try to drag the small cute character into finnish. The walls and other obstacles in platform are bad, avoid them at all costs.\nIt may look easy but it’s tough. Actually, it’s VERY HARD.\nTest your skills and find out if you have what it takes to beat the odds.\nHow far can you go?\nGame is in early access:\nEarly acces version includes 10 Challenging levels.\nin full version will be:\n• Over 40 Challenging Levels\n• Dozens of Unique Puzzles to Solve\n• EXTREMELY addicting\n• The Ultimate Casual Brain Teaser\n• Almost impossible to beat!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"White Dog","platforms":[{"id":0,"name":"PC"}]},{"id":557738,"name":"Gorilla Tag","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74c/74cbaabbef80442c6de5f9ea7efbf44f.jpg","description":"Reject humanity.\nRun, climb, and jump in VR using a unique locomotion method that only needs the movement of your hands and arms. No buttons, no sticks, no teleportation. Push off of surfaces to jump and squeeze them with both hands to climb. The game mode is simple tag, for up to 3 players, or infection mode, with 4 or more. Run from the infected gorillas, or outmaneuver the survivors to catch them. Parkour up trees and cliff faces to evade and chase people down. Hang out in a virtual, low-fi jungle with randos or group up in a private room with friends to hang out and play. The stakes are low, so feel free to just chat or make up your own games. The movement is easy to learn, and hard to master. Crossplay with the Quest version of the game, so play with anyone, anywhere.\nBecome gorilla.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Another Axiom","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":337023,"name":"The Complex","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d9/1d9fa8e760612fa6a7f309e2f26417ac.jpg","description":"After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. With choose-your-own-path style gameplay, your actions and your relationship with other characters will lead you to one of eight suspenseful endings.\n\nHaving treated the victims of a chemical attack in the totalitarian state of Kindar, Dr Amy Tenant is a leader in the advancement of Nanocell Technology. Now, in London, news breaks of a blood-vomiting civilian whose identity is far from coincidental. Reunited with an old friend, Amy is trapped in an impenetrable HQ of laboratories—a womb of scientific advancement with a perilous secret.\n\nThe Complex is written by Lynn Renee Maxcy, part of the Emmy award-winning writing team from The Handmaid’s Tale. The interactive movie stars Michelle Mylett (Letterkenny, Bad Blood), Kate Dickie (Game of Thrones, The Witch) and Al Weaver (Grantchester). Featuring guest acting performance by Twitch streamer and former Xbox UK presenter, Leah Viathan.\nRelationship Tracking\nThroughout the game you will interact with characters and — depending on your choices — will either strengthen or weaken your relationship. The relationship scores are calculated from the start right through to the very end and will affect certain scenarios as well as having major consequences in the concluding scenes.\nPersonality Tracking\nFor every decision you make, every interaction, your character’s personality is being tracked. At the end of each playthrough, you are rewarded with a Personality Score and a breakdown to see how you played the game. Discover the five basic dimensions of a personality; openness, conscientiousness, extraversion, agreeableness and neuroticism. Which of those will your character play?\nFeatures\n• A completely live action, cinematic interactive sci-fi thriller, filmed in the UK. Directed by Paul Raschid, and written by Lynn Renee Maxcy (The Handmaid's Tale - TV Series).\n• Multi-optional storytelling with 8 different outcomes.\n• Real-time Relationship Status Tracking that influences the story as you play.\n• Real-time Personality Trait Tracking that evolves based on your choices.\n• Starring Michelle Mylett (Letterkenny, Bad Blood), Kate Dickie (Game of Thrones, The Witch)\nand Al Weaver (Grantchester)\n• Guest acting performance by live streamer and presenter, Leah Viathan.\n• Unlockable features include Skip Scene, Personality Assessment and a Hidden Event.\n• Featuring a Pause Choices option for improved audience participation during live streams.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Wales Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"}]},{"id":59319,"name":"Creed: Rise to Glory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d1/0d14552f01148041afe62f74dbdfb830.jpg","description":"Train. Fight. Win.\nGot what it takes to become a champion? You are Adonis Creed, fighting toe-to-toe with the world’s top opponents to establish your boxing legacy. This intense cinematic experience features new Phantom Melee Technology for impactful VR melee combat so you can train, fight, and win like Creed.\nLive Your Legacy\nChallenge both your body and mind as you experience the ascent of Adonis Creed from undiscovered underdog to world-class fighter, all within an immersive universe inspired by the Creed™ films. Train with the legendary Rocky Balboa in iconic gyms, including Mighty Mick’s and Front Street Gym, then step into the spotlight and take down a cast of champion-level opponents in high-stakes fights with reactive commentators, gritty visual effects, and dynamic music.\nPlay Your Way\nMultiple game modes let you choose your path to glory. Live the saga of Adonis Creed in the story-based Career mode, learning and growing alongside Rocky as you train for bigger and more prestigious championship fights. Want to polish your punches and sharpen your reaction time? Let Training mode get you in shape with fun, physical minigame montages. And when you just feel like a fight, create custom matches in Freeplay against a wide range of opponents.\nFeel the Impact\nPhysically active 1:1 boxing gameplay features Survios’s newest proprietary VR innovation: Phantom Melee Technology™, which utilizes Responsive Control and Virtual Stamina to mimic the real-life effects of punching and being hit in the ring. Throw a variety of punches like uppercuts, jabs, and flurries in satisfying, impactful combat. But don’t let your guard down: punch too much and you’ll suffer from fatigue, and always be prepared to dodge and defend against incoming blows. Too many hits will stagger or completely knock out of your body—race back to your avatar before the ref counts down to show that the fight’s far from over.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Survios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":57880,"name":"THE KING OF FIGHTERS '98 ULTIMATE MATCH","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d0/9d01c130e3a33571c9ae6e9695973eb0.jpg","description":"'The ultimate dream match' never ends! THE KING OF FIGHTERS '98 ULTIMATE MATCH sees another release with even more content!\nThe game features a total of 64 playable characters including fan favorites such as Eiji Kisaragi, Kasumi Todoh, Geese Howard, Mr. Big, and Wolfgang Krauser! Get in the ring with EX versions of King, Blue Mary, Ryuji Yamazaki and Geese Howard! Orochi Iori, Orochi Leona and Goenitz are also playable after fulfilling certain conditions! This release includes multiple system updates and graphic updates such as brand new stage backgrounds (with the ability to switch between 2D and 3D styles), gallery modes and more! On the audio side the game features classic voiceovers and an arranged soundtrack! Relive the glory days of NEOGEO with this piece of fighting game history!\nAre you ready to battle it out just like you did in your local arcade back in the day!?\n1-2 players\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©SNK CORPORATION ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SNK","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":29590,"name":"Warcraft: Orcs & Humans","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/afe/afe2b96b3c9f3632cfce254fad4eb242.jpg","description":"Welcome to the world of Warcraft, a fantastic universe where terrifying Orcs face noble Humans in a struggle for survival and domination. Capable of using a variety of weapons and devastating magic, these two armies will use all their strategy, intelligence and brute force to confront each other.\n\nDestroy the Orc hordes or crush the pathetic Humans ... the choice is yours.\nMy lord ?\nStormwind Castle overlooks the lands you have sworn to defend.\nThese Orc raiders could destroy your city. Gather your troops to push them back.\nYou have won ! Cries of victory ring out as the last Orc collapses to the ground.\nStop touching me!\nPrepare devilish strategies to wreak havoc on your Human enemies.\nDefend your village against the ruthless onslaught of these armies of Pallid Dogs.\nAdmire the destruction you have sown and the unrecognizable corpses of your enemies!\nBuild and manage your own medieval fort.\nTwo player mode in LAN.\nControl the noble humans or the lawless orcs.\nDozens of scripted campaigns with two distinct stories.\nMore than 20 additional scenarios, customizable for endless replayability.\nControl unique creatures, like Demons, Elementals, Necromancers, Archers or Spearmen.\nA soundtrack rich in typical Warcraft music.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":25909,"name":"X-Men Origins: Wolverine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ce3/ce38c9a778138b8886355c40d727f0d8.jpg","description":"Uncage Wolverine’s tragic past and discover how the ultimate weapon was\ncreated. Unleash the razor sharp adamantium claws, feral instincts and\nmutant regeneration power of the world’s fiercest hero. Visceral combat.\nPure rage. Epic battles. Take on the impossible in your hunt to uncover\nthe secrets of Weapon X…then exact your revenge.\n\nFeaturing 6 uniquely designed Acts that go through the Wolverine\nstoryline\n\nUses the Touch Screen to help locate hidden objects in “Feral Mode”\nand utilizing Rage mode to swipe enemies down\n\nUnlockable outfits that are only seen on the DS version\n\nFight against main foes as seen in the movie - such as Sabretooth,\nGambit, and the Blob","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Raven Software","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"}]},{"id":25658,"name":"Guitar Hero World Tour","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/70e/70e982c3bdb93500176d906288f0a6fb.jpg","description":"You'll be in rock-and-roll paradise with Guitar Hero World Tour. The\ngame has advanced modes, options and tools for your rocking pleasure.\nEnjoy a vast amount of master recordings from some of the biggest acts\nof all time, including Van Halen, Linkin Park, the Eagles, Sublime and\nmore. The game will also offer significantly more localized downloadable\nmusic than ever before. Guitar Hero World Tour gives you creative\nlicense to fully customize everything from characters' appearances and\ninstruments to the band's logo and album covers. The innovative Music\nStudio lets you compose, record, edit and share music. The hard-hitting\nBattle of the Bands mode lets up to eight players get in on the mayhem.\nJam like a pro and show off your talents like a true superstar.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Neversoft Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":25137,"name":"Castlevania","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ab/2ab7fb76bcc7ac73265ff3f949937e72.jpg","description":"Beware of Dracula and his ghoulish minions as you enter his lair…\n\nCastlevania marked the beginning of Konami’s acclaimed series, one that is still going strong today!\n\nAs vampire hunter Simon Belmont, you must fight your way through Dracula's castle teeming with ghosts, goblins, demons and other supernatural creatures. Six challenging levels await before you finally confront the Count himself.\n\nStep into the shadows of the deadliest dwelling on Earth. You’ve arrived at Castlevania, and you’re here on business: to destroy the curse of the Evil Count, once and for all. Make your way through six monstrous floors filled with bats, ghosts, zombies, and every kind of ghoulish creature you can imagine. Use the legendary whip Vampire Killer and a host of deadly weapons to battle your way to Dracula’s chamber and.the ultimate duel of good vs. evil.\n\nYou'll need your wits and weapons to survive because when you finally meet Dracula, you know he’ll be going for the jugular. So keep your courage up and your stake sharp!","review":"","timePlayed":0.0,"releaseYear":1986,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"NES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":20490,"name":"The Lost Mythologies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/141/1416ee66320c31aec8c6d625994d94f3.jpg","description":"StoryThousand years ago, The civilization was almost completely wiped out after a great war.\n\nCenturies had passed, almost no one remembers the once glorious empire.\nBut, when the ancient history strikes back, you, the half god protagonist has awaken to prevent it to repeat itself all over again...NoteThis game's main focus is to show how much we're capable to do at a short period of time, but since we thought the result wasn't actually sellable, we decided to release this game for free.\nThis is a student project, it may contain various issues and we CANNOT guarantee these will be fixed due to the reason mentioned below.\nWe're planning to start a studio after graduation and Military services(according to Taiwan law we have to finish it unfortunately).\nFor those who liked our work please stay tuned, hopefully we may roll out some information about our next project when we're back on business.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Basaltic studio","platforms":[{"id":0,"name":"PC"}]},{"id":14745,"name":"Town of Night","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/904/90479b79409a1906fc165edd932ec58d.jpg","description":"Town of Night is a First-Person Dungeon Crawler inspired by games like Shining in the Darkness, Etrian Odyssey, Diablo and Wizardry.\nIn Town of Night you play as Corr Algrimm. Hero, Scholar, ladies' man and expert Sword fighter - All self proclaimed.\nCorr is visiting the Town of Night, a strange little town that makes money with Dungeon and Monster hunting tourism, to find out where the monsters are coming from.\nIn Town of Night you can recruit different members to your party to go dungeon crawling like you want to.\nRemember to bring Ink and Paper to draw your own map and try not to die.\nFeatures\n5-10 Hour Campaign\n6 Different Recrutable Heroes\nLooting and Levelling\nFirst Person Dungeon Crawling","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Delusional Games","platforms":[{"id":0,"name":"PC"}]},{"id":14257,"name":"Frederic: Resurrection of Music Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ef/9ef2c2c4d487384575dec569bf4c86e7.jpg","description":"This is a new version of cult game with new levels and exclusive Steam online multiplayer!\nPlay Bollywood and Stambul - two new stages, and watch new movies with it's peculiar story! Now you can challenge for a musical duel any steam user from around the world!\nCheck out this new incredible version of Frederic!\nStep into Frederic Chopin's shoes, and embark onto an one-of-a-kind adventure through musical genre in this remastered especially for Steam enhanced version.\nFrederic Chopin – one of the world's most talented classical composers, is brought back from the afterlife and finds that he's an involuntary part of a treacherous plan. The world of music is at the edge of destruction. Soulless music labels and mass-produced popstars have hindered all creativity. And you're the only hope of bringing it back.\nAccompany Chopin in his amazing journey full of quirky events. Battle your opponents in musical duels, intensity of which will make your palms sweat. Enjoy an hour of hand-drawn animated comic picturing the quirky story. Play through twelve catchy arrangements of Chopin's greatest classics, each in a different musical genre. Practice your skills until perfection and become the master of the piano.\nFeatures\n- 12 fantastic remixes of classical hits\n- 10 colorful locations from around the world full of hidden easter eggs and jokes\n- An hour of outstanding animated comic\n- Megatons of humor\n- 18 achievements of all difficulties\n- DRM-free game soundtrack included\n- Trading cards\n- Optimized for Windows 8 touch screens","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":12271,"name":"Germ Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e44/e44a724a1ec6ab2d01e9452bc997f9c0.jpg","description":"It’s the flu season and you’re stuck at home feeling sick. Or maybe you are just bored but still want to do some good in this world. Now you can headbutt viruses, bacteria and other germs into oblivion, and look damn cool while doing it!\nTake control of a determined White Blood Cell on a quest for self discovery, vengeance, punishment and annihilation of all evil germs who would dare infiltrate an unsuspecting and innocent human body in this unique and organic experience.\nBattle evil germs by slamming into them, using your Powerbutt ability to further enhance the damage and pain inflicted.\nIf you are feeling particularly chaotic, you may even resort to the Blast ability, which will push back all nearby germs and debris (which can effectively be used as projectiles and another way of causing great suffering to the malevolent germs). Although the Blast won’t be super effective until upgraded, it will eventually prove to be quite an effective instrument of destruction if used correctly.\nThere are upgrades! Precisely, there are 8 branches of upgrades for your valiant White Blood Cell:\nSpeed – More speed equals more potential damage and less chance of enemies evading your wrath!\nDamage – More pain!\nAbility Cooldown – Use those powers more frequently!\nPowerbutt Strength – Nothing better than surprising your enemies with a magnificient headbutt!\nBlast Radius – Improve the area of effect of your Blast!\nBlast Power – Cause more chaos in the bloody battlefield!\nHealth – Be able to survive more damage!\nHealth Regeneration – The longer you live the more you will be able to keep kicking!\nEach upgrade branch has two unique perks, which are unlocked on level 5 of their respective branch, and only one perk per branch can be active at once. Each perk gives your cell a unique visual attachment, which in turn makes you even more stylish, as well as more powerful!\nThe more you play, the stronger you’ll get, but beware, enemies get stronger as well! The more you play a single game (until you die), more powerful enemies will spawn. So do not be afraid of dying, because each time you will rise again harder and stronger.\nGerm Wars Official Soundtrack:\nhttps://soundcloud.com/user-708772547/sets/germ-wars-soundtrack\nCredits for several sound effects: Pigment Ajans I Stock Footage on Youtube","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Svarog Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9519,"name":"Dropzone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2a/d2abcd44d032a64c7e44a94dacea27ca.jpg","description":"Pilot Pack: Threshing TrioGet started in Dropzone with 3 additional Pilots - save time and money with this high value bundle!\nThe Pilot Pack: Threshing Trio includes:\nKnockout the Tank\nFury the Gunner\nCortex the Mechanic\n7,500 Jovians for additional Pilots or Gear\nPlease note: If you buy this bundle but have already unlocked one or more of these 3 Pilots in the game, there will be no refund or compensation for the affected Pilots\nAbout the GameIt is the 22nd century…Compete to win in the Dropzone - part renegade captain and part privateer, you strive against other mercenaries and elite military companies for Cores, reputation and glory!Explosive 15 Minute MatchesYou will command a squad of up to 3 highly-specialized battle Rigs in intense 15-minute matches. Fight against your opponents and the alien Kavash over Cores to score points. Experience the rush of beating the buzzer and score the winning point in the last second.1vs1, 2vs2, 3vs3, CO-OP, PvE and moreControl 1, 2 or 3 units across a wide variety of modes including competitive 1v1, 2v2 and Team 3v3 battles, PvP and PvE, custom maps, single player gameplay against AI and a cooperative wave-based Infestation modeUnique Pilot AbilitiesRecruit Pilots from across the solar system, each with his own default Gear and unique abilities. Then build your squad of three Rigs from four classes: the hulking Tank, powerful Gunner, resourceful Mechanic, and unpredictable Summoner.Deep Rig CustomizationChoose from hundreds of Gear options granting active and passive abilities to outfit your Rigs. Match your squad to your play style and use it to execute effective combos that will send your enemy reeling.Dynamic Replay ControlsUse the game’s replay system and observer modes to watch live Dropzone matches, relive your greatest moments and study the moves of the top players to improve your skills.Coming SoonIn-game tournaments, ranked leaderboard, new maps and the mysterious 5th Rig class, with all new abilities and Gear to bring even more options on the battlefield.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sparkypants Studios","platforms":[{"id":0,"name":"PC"}]},{"id":5212,"name":"Critter Crunch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/def/def239885ed7669f03a2d2a1ad0ad2d5.jpg","description":"Critter Crunch is an award winning, arcade-style puzzle game, starring the loveable Biggs. Using his long, sticky tongue to grab critters from vines above, he feeds them to each other until they burst, dropping tasty jewels for him to gobble up. Using Critter Crunch's 'Food Chain' mechanic, players will eat their way through a smorgasbord of levels and gorge on a feast of modes, including Co-op and Versus multiplayer.\nOh, and barf. Rainbow barf!\nKey Features:\nStunning Visuals: Hand-animated characters and backgrounds come to life in gorgeous 1080p at 60fps.\n4 Single-Player modes: Adventure, Puzzle, Challenge and Survival offer something for everyone!\n2 Multiplayer Modes: Team up with a friend in Co-op or battle each other in Versus. Both modes are playable online or locally.\nAddictive puzzle fun: With the unique Food Chain mechanic, players feed smaller critters to larger ones to make them pop! The longer the chain, the larger the reward!\nTons of variety: Power Ups and Special Critters keep things fresh and offer new challenges.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capybara Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":850702,"name":"Pacific Drive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43e/43e69395a05af3b4d44ef3a7d50925b2.jpg","description":"Pacific Drive is a run-based, first-person driving survival game. Your car is your only companion as you navigate a surreal and anomaly-filled reimagining of the Pacific Northwest. Structured as a “road-like”, each excursion into the wilderness brings unique and strange challenges, as you restore and upgrade your car from an abandoned garage that acts as your home base. With the car as your lifeline, you’ll unravel a long-forgotten mystery as you make your way to the heart of the Olympic Exclusion Zone.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Ironwood Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":284700,"name":"DYSMANTLE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/599/59905f4cc9614a53f36989a26098d13c.jpg","description":"As you ascend from your shelter after the long long years, a brave new old world awaits you. A world inhabited with nasty and vile creatures. A world with no other human soul to be seen. A world with nature in reigns now. A world that's about to get even worse.\r\nYou need to find a way to escape the wretched island. But before that, enjoy the bittersweet apocalypse.\r\nBreak over 99% of all objects for materials with the right tools. No barrier will stop you.\r\nFight with (or run away) nasty and vile creatures of the post-apocalyptic era.\r\nExplore the handcrafted open world and uncover its mysteries.\r\nSurvive. Clear areas of monsters and claim it as yours.\r\nBuild outposts to establish your presence.\r\nCraft permanent weapons, tools, outfits, and trinkets.\r\nHunt dangerous game or tame them for your post-apocalyptic zoo ranch.\r\nFarm exotic plants and reap the rewards as crop gets ripe.\r\nSolve puzzles above ground and underground in the Tombs of the Old Ones\r\nFish cunning scaly things under the watery surface.\r\nCook delicious recipes for permanent stat and ability upgrades.\r\nExplore the ruins of the past and discover technology from the hitech era. Gain technological advantage against the hostile environment. Or go deeper and recover the ancient lost knowledge from the hidden tomb chambers of the old ones. Acquire materials with almost magic-like properties and use them to craft insanely powerful gear.\r\nOver 99% of everything can be broken for materials with the right equipment. Do that, and collect the sweet nectar of the old world: plastics, rubber, and metals. There is a reasonable number of different materials to gather. Find Recipes to craft permanent items and upgrades.\r\nExplore the vast hand-crafted open world and build Outposts to establish your presence. Claim back the land area by area. Find hidden treasures and solve puzzles long ago forgotten. Find your means of escaping the island.\r\nThe world after the end is inhabited by nasty creatures. Something vile has affected most of the wildlife and former human inhabitants of the island -- turning them into aggressive beast-like creatures. Slay them and collect their loot - or run away and come back when you're stronger. Fight using various melee and ranged weapons. Create traps and lure monsters in. Do whatever it takes.\r\nYou will not be fighting just to maintain the status quo. This IS NOT a game about starving. You won't be constantly looking for a tasty cockroach to fill your over-metabolic stomach while waiting for the unavoidable bliss that is death. You will never die of hunger. You will get more powerful, and unlock permanent upgrades. The world is a dangerous place, and you may take a few steps back once in a while, but eventually you will thrive.\r\nEnjoy the bittersweet apocalypse.\r\nI think this is pretty obvious, but the game is still in development. This means the details will still change and features may get added, changed, or removed. More details will be announced during 2019!\r\nOur team is not very big, so things take time. We're also building our own very technology and 3D engine for the game at the same time. We like to make sure we can do all the crazy stuff we want -- while ensuring everything runs smoothly on devices from PCs & next-generation consoles to mobile phones (and maybe toasters in the future).\r\nPlease wishlist the game to support the development! :)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"10tons","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":44746,"name":"Behold the Kickmen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc9/fc9112a4b6d32fde9364787c849b3522.jpg","description":"BEHOLD THE KICKMEN started as a silly Twitter joke, and evolved like a beautiful flower into the year's least-exciting and mostly-incorrect Football Simulation. It's football, as seen through the eyes of someone with no understanding of, or interest in, the Laws of Football.\nStart at the bottom of the Big Boring British Football Spreadsheet system and grind your way up, gruelling match after gruelling match, to become the best at the football that anyone's ever seen, and win the World Cup for your mantelpiece.\nFEATURES: Kicking, Passing, Tackling, Squad Management and Doing Goals over and over. There's even a full Story mode, crammed with overblown melodrama and inane decisions to be made.\nTWO WAYS TO PLAY! Hate football? No problem! The entire game can be re-skinned at the flip of a switch into a Dystopian Future Bloodsport!\nPLEASE NOTE: Kickmen has NO ONLINE MULTIPLAYER and NO LOCAL MULTIPLAYER, it's Single Player ONLY. Please don't buy it thinking it's at all sociable, because it isn't. Why, you ask? Because I wanted to make a Single Player game, I didn't want to make a Multiplayer game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Size Five Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18605,"name":"Joana's Life","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ea/3ea6e0147f9699c39c0cf8359b5fdac9.jpg","description":"SynopsisIn a peaceful part of the town, a series of deaths occur, seemingly random at first, but gruesome in their nature. One day, you find an object that doesn't belong in your house. An old, worn-out, stained mirror. That is the very moment when you'll discover that the simple mirror isn't the only thing that is out of place.\nExplore the thriving streets of the small suburban area, search through the abandoned houses stained by gruesome past, and find out what haunts you through the silver pane of glass. As the game progresses and the more you approach the root of all horror, you'll realise that not everything is what it seems.\nPeace together fragments of the past events, read between the lines, and look at things from a different perspective. All alone in the crowd, the cold grip of a confused and consuming rage will coarse through your veins.Features: A detailed and AI populated game world.\nA Haunting game atmosphere and soundtrack.\nMake the most of the Mirror mechanic - some things are not what they seem at first glance.\nA Gripping story woven through the environment, puzzles and in-game events.\nMystery style game-play. You must explore and search out clues and objects. The game will not hold you hand.\nMultiple choice endings.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Old Shack Studio","platforms":[{"id":0,"name":"PC"}]},{"id":17021,"name":"Droid Assault","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d5/0d532ae87c4abbd91e21815e19dbde28.jpg","description":"Play Droid Assault and experience running blaster battles with hordes of rampaging killer robots!\nDiscover a unique tactical arcade shooter, with the fun addictive gameplay of 8-bit classics. You'll need your wits and the help of your acquired droid squad to stay alive in this fast-paced retro actionfest. Wreak havok through 50 atmospheric levels of destructible scenery, avoid mines and turrets, and battle 48 different robot types from lowly Guardbots to the latest in Assassins, Special Ops and Battledroids.\nWith the aid of your trusty transfer beam capture your own squad of droids, armed with the latest hi-tech weaponry including lasers, rockets, grenades, flamethrowers and disruptors, boost their abilities with 17 kinds of powerup, and take on the formidable giant boss 'bots!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Puppygames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16930,"name":"Solarix","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71a/71a830d20d8cccaa0c46499060006bd3.jpg","description":"Solarix is a science-fiction stealth-horror game featuring open-ended levels for both combative and stealth-focused playstyles. Solarix combines old-school sci-fi horror with next-gen style and graphics. The story follows an electrical engineer desperately fighting for his life after an infection wipes out an interstellar research station. He must contain the disease, battling both the remnants of the crew and his own fracturing mind. Our goal is to go beyond jumpscares and cheap thrills. Solarix is about a world that overpowers you with unease, insecurity, and desperation, forcing you to confront your own role in the horrors to come.\nFeatures:\n12 chapters with engrossing story line with lots of unique characters that provide psychological depth to player experience of survival horror.\nVariety of weapons and hacking tools allowing the player to develop different strategies to overcome obstacles and progress for sneaking & combat & puzzle solving & environmental interaction.\nAdvanced Stealth A.I with varying voice sets & detection abilities and several other perceptive features.\nHere is a detailed description of Solarix Stealth A.I and its relation with the game-play mechanics:\nSolarix is a stealth game, and you can either use \"stealth-based combat\" or you can even finish the game without firing a bullet but knocking everyone out or you can even finish the game without alerting anyone.\nIf you like stealth kills, explore for ammo, use your pistol carefully(=combat) and aim for headshots and move around...\nIf you want to knock out enemies, don't use your pistol, use your tazer, observe their patrol points and knock them out one by one...\nIf you want to create your own darkness, use your pistol on lights, not on enemies...\nIf you want to \"ghost\" the entire game that is also possible, but you'll have to keep an eye your light meter and environment all the time...\nIf you want to lure enemies around, use throwable objects, not any weapons...\nIf you are around monsters and get caught, use your pistol to defend yourself until you find some cover/hiding spot...\nFurther in the game, if you are bored of sneaking around, use your shotgun to blast enemies, but you have to explore around carefully to collect ammo first...\nUnique puzzles in that require exploration and information gathering in classic adventure style.\nWide variety in environments...In Solarix, you'll travel from cramped corridors to vast exotic forests to giant space stations to ominous underground facilities. Each level has its own strategy; each strategy is created by you. Some levels you'll have to run away from monsters, in some levels you'll want to directly confront them. One level will require you explore around in classical-adventure style to solve puzzles, whereas another level will require you to sneak around carefully.\nRich in-game content – you’ll encounter not just human enemies and monsters but you’ll have to hack your way through turrets, security cameras, sniper-robots and flying drones. There is a different and unique type of enemy awaiting you around every corner.\nProfessional voice acting providing lots of depth to background","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pulsetense Games","platforms":[{"id":0,"name":"PC"}]}]