[{"id":12048,"name":"ORION: Prelude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/428/4286a224467623d23706dacb569a2ea1.jpg","description":"Orion: Prelude is an indie first-person/TPS shooter set in the sci-fi universe where you together with your friends can experience an intense and cinematic battles. You can use many powerful weapons and vehicles. In the game you also have to compete with other players to accomplish goals of the missions and also explore gigantic worlds and destroy the devastating hordes of dinosaurs. It is said that Orion: Prelude has one of the most spectacular visual effects and addictive combat in comparison to other indie titles. Not only the adventures filled survival-based cooperative gameplay ant retro Arena combat returns but also Prelude features an open-world cooperative mod as well as PvPvE. This is a third installment in the Orion series, the first to being Orion: Dino Beatdown (released in 2012) and Orion: Dino Horde (released in 2013). There are four different mods in the game: Survival (Objective), Slaughter (Duration), Rampage (Playable Dinosaurs) and Prehistoric (Custom Variable).","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Trek Industries","platforms":[{"id":0,"name":"PC"}]},{"id":4057,"name":"Defiance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f63/f63bb0916d982394dfedc1900375c88e.jpg","description":"Ex Inanis - Play Your WayArrival of the Ex Inanis!The winds of change sweep across the New Frontier, providing you more opportunities to play your way and acquire the loot you want! Learn more!\nAbout the Game\nArktech. Some die for it – everyone kills for it.\nJoin the futuristic online open-world shooter where thousands of players scour a transformed Earth competing for alien technology. Hunt alone or with others as you improve your skills and level up, unlocking powerful weapons that will help you survive the massive battles that await.\nLimitless Gameplay.\nRevolutionary Warfare.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Trion Worlds","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":19962,"name":"No Time To Explain Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5c/d5c4c4af04545fe14604b2807d83a927.jpg","description":"\"I Am You From The Future! No Time To Explain, Follow m-OH CHRIST!\"\nChase your future self through time and alternate realities while fighting giant monsters, collecting hats, and eating cake! No Time To Explain is a game about Time Paradoxes, Jetpack Guns and Ribs In People's Eyes.  It's a comedy platformer featuring great music, voice acting and gameplay that becomes more ridiculous as you go.Key FeaturesCompletely rebuilt from ground up in Unity! The Remastered version of No Time To Explain is how the game was originally intended to be played.\nNow with local multiplayer!\nUSE THE POWERFUL FUTURE CANNON as a gun AND a jetpack!\nPLAY AS NEW CHARACTERS to blast, beam, slingshot and catapult yourself through fire, acid and fairy-cakes!\nTEST YOUR GUN-GLIDING MASTERY: There are 60 wearable hats hidden around these levels, but where are they?\nFACE OFF against giant monsters from alternate timelines, including the most horrific of all: your evil alternate self!\nKill giant alien crabs!\nEat cake!\nFight sharks!\nJump on stuff!\nPlay fullscreen!\nPerform awesome dance moves while wearing collected hats!\nPlay different versions of yourself from the future!\nFully original Soundtrack!\nCreate and share your own levels in the built-in Level Editor!About tinyBuild\nWe're an indie game development and publishing company. No Time To Explain is our first game. It came out of a successful Kickstarter and Greenlight adventure. Since No Time To Explain, we started helping other developers with their games. After getting enough muscle behind our internal studio, we came back to No Time To Explain, and completely remade the game in a proper engine. No Time To Explain Remastered is free for everyone who owns the original!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"tinyBuild","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":58921,"name":"Mutant Year Zero: Road to Eden","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fcc/fccc143096ea188a7fb7daab52d26e35.jpg","description":"In Mutant Year Zero: Road to Eden, the player controls a trio of weird mutant warriors. It is based on a 1984 board game Mutants.\r\n\r\n###Setting\r\nThe game is set in a post-apocalyptic world, in which a nuclear war annihilated all humanity. Many years later, Earth is inhabited by the mutated creatures that look like combinations of humans with other animals and things. There's The Ark, a neon-lit sinkhole that serves as the hub for the player characters. This is where they can buy ammunition and armor, meet other characters and accept quests. Then there's the Zone, a largely unexplored dangerous world where Mutants roam. Somewhere in the Zone lies the legendary Eden, a safe haven where they can find all the answers they seek.\r\n\r\n###Characters\r\nThe game has three main protagonists. First, there's Dux, the duck-headed wise-cracking mutant with an attitude. Then there's Bormin, a huge gruff pig that has anger issues. Their third companion is Selma, a seemingly human female who has protective stone skin. Each of the characters specializes in using certain weapons and has a set of special mutant abilities.\r\n\r\n###Gameplay\r\nMutant Year Zero: Road to Eden combines real-time exploration and stealth system with square grid-bound tactical turn-based combat in the vein of X-Com series. The player controls the three characters as a party, switching between them when needed.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"The Bearded Ladies","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":22865,"name":"Tomb Raider: The Angel of Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f1/9f14ee1ccd4995ba93be9b80d0ee30d7.jpg","description":"Tomb Raider: The Angel of Darkness is an action-adventure game developed by Core Design. It is the sixth part of the Tomb Raider game series.\n\n###Story\nAfter a yet another expedition, Lara Croft meets with her mentor, Professor Werner Von Croy. In their conversation, he mentions the existence of ancient Obscura pictures and an unknown order placed on them. Unexpectedly, Lara gets knocked out. Upon coming to she finds herself next to the dead body of her mentor. Lara Croft is thought to be the murderer of the Professor. She sets out to prove otherwise.\n\n###Gameplay\nThe Angel of Darkness features both the usual action-adventure title elements as well as several RPG ones as in conversations with other characters, the players choose the lines to answer with. All the things said by Lara will influence the game's story. The game now features several stealth mechanics, which allow Lara to silently knock out enemies, find cover in the shadows, and peek out of any cover.\n\nCroft can climb walls, ladders, pipes, and ropes. The players can manage their inventory, utilize a diary, where they can find clues and tips on how to complete a level. There is no regenerative health present in the game, so the players have to pick up medkits, pills, and chocolate to restore health.\n\nThe core gameplay formula of Tomb Raider games stays unchanged, as the players have to explore fairly open-ended levels while finding certain items or exits off the level.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Beenox","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"}]},{"id":50678,"name":"SCP: Secret Laboratory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/506/5060f031599d7417f8789897c3ce1bfb.jpg","description":"SCP: Secret Laboratory is a multiplayer horror game, based on SCP - Containment Breach by Regalis (2012). To create this game, Unity engine was used to provide high stability and good graphics. Still being at the beta phase, game can contain an amount of bugs and errors which are usually spotted by a large team of testers and fixed quickly after.\n\nIt is a completely free horror game based on SCP Foundation creepypasta series. The Foundation focuses on protecting world from any entity, object or phenomenon which exceeds the all-known idea of normal.\n\nThe underground facility suffers from multiple breaches from various SCP objects which escape their containment chambers. During this events chain, players are given roles to play:\nClass-D Personnel - Prisoners kept for a purpose of being lab rats. Their mission is to escape the facility without getting any attention from others.\nNine-Tailed Fox - Team designated to neutralize the danger and rescue Scientists.\nScientist - Breach attendant that tries to escape the facility alive.\nSCP Object - anomaly trying to kill as much people as possibly. Currently only few SCP objects can be found in-game, but progressively their number will grow in oncoming updates.\nChaos Insurgency - Foundation traitors, trying to help Class D to escape in order to obtain helpful information.\n\nRandomly generated facility and role division makes every game special and full of sensations! You never know where you are heading or what awaits you behind the next door, no matter of what role you are playing. The winner team is one that finished all of its objectives.\n\nThere are many ways of fighting against enemies, from using firearms to detonating the whole facility with an hydrogen bomb.\n\nIn the game, we can encounter such anomalies like:\n\nSCP-173 - Living concrete sculpture that can move only when not observed, killing people by snapping opponents' necks.\nSCP-106 - Humanoid able to walk past matter, sending its prey to its Pocket Dimension.\nSCP-079 - Self-evolving Artificial Intelligence, able to control facility control systems.\nSCP-049 - Plague doctor trying to \"cure\" everyone he meets.\nSCP-914 - Object improving machinery.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Hubert Moszka","platforms":[{"id":0,"name":"PC"}]},{"id":10416,"name":"Darkwood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/341/3415bdd0f19cb034574e559f2ff163ab.jpg","description":"PLEASE READ THE KNOWN ISSUES THREAD BEFORE BUYING\nDarkwood provides a new perspective on survival horror.\nScavenge and explore the rich, ever-changing free-roam world by day, then hunker down in your hideout and pray for the morning light.\nSurvival horror from a top-down perspective that is terrifying to play.\nNo hand holding or quest markers. Test your skills and figure things out on your own!\nBy day explore the randomly generated, ever-sinister woods, scavenge for materials, craft weapons and discover new secrets.\nBy night find shelter, barricade, set up traps and hide or defend yourself from the horrors that lurk in the dark.\nGain skills and perks by extracting a strange essence from mutated fauna and flora and injecting it into your bloodstream. Watch out for unexpected consequences…\nMake decisions that impact the world of Darkwood, its inhabitants and the story you experience.\nMeet eerie characters, learn their stories and decide their fate. And remember - don’t trust anyone.\nAs nights go by, the lines between reality and nightmarish fantasies begin to blur. Are you ready to step into Darkwood?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Crunching Koalas","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":51324,"name":"Kingdom Hearts III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/968/968e6210715fd61237139e3caa193be0.jpg","description":"Kingdom Hearts III is the twelfth game in its series. As with its predecessors, Kingdom Hearts III is a crossover of characters and worlds from Disney/Pixar animated movies and Final Fantasy franchise with some of the original game characters. Kingdom Hearts III is the last part of the Dark Seeker saga, in which the main villain is Master Xehanort. The series itself, however, continues. \r\n \r\n###Plot\r\nThe main protagonist of the series, a boy named Sora, joins forces with Disney's Donald Duck and Goofy. Their quest is to find the Guardians of Light. Meanwhile, King Mickey and Riku are searching for those who previously owned the Keyblades. The common goal of the characters is to prevent a new Keyblade War that villainous Master Xehanort is trying to trigger. The game is set in several worlds based on Disney and Pixar films, such as Tangled's Corona, Big Hero 6's San Fransokyo and Frozen's Arendelle.\r\n\r\n###Characters\r\nThe player mostly controls Sora. However, other characters can join him to form a party. The party can have a maximum of five characters at once. Popular characters such as Baymax, Rapunzel and Jack Sparrow are available as party members. There are also additional “Links” characters the player can summon using Keyblades. They briefly appear to assist the party in a battle. Those include characters like Ariel, Wreck-It Ralph, and Simba.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":14625,"name":"Medieval II: Total War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/72f/72feeda516c44390c7ab218b8b328fda.jpg","description":"Medieval II: Total War is the sequel to the Medieval: Total War video game and it’s the fourth game in Total War series. The game is set between the years 1080 and 1530. It focuses on medieval warfare, religion and politics in Europe, North Africa and the Middle East. There, similar to previous games in the series, are two modes of play: battles which can be played in multiplayer, in user-defined scenarios or in historical scenarios which simulates real battles of history like Battle of Arsuf or the Battle of Agincourt and the single-player campaign which lets the player build his civilization to conquer other factions. In large maps of the campaign, the player has to control the faction’s military, economic and social systems. When it's the player's turn, he has to move his army anywhere on the map, while in combat, the player has to choose either to fight the battle or let the computer calculate the outcome. \nThere are several single-player campaigns.In the short campaign the player has to defeat a few enemy factions and control as least 15 territories, while in longer campaign, the player has to control at least 45 territories and a gigantic city like Jarusalem, Granada, Rome or Constantinople.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16014,"name":"Planetary Annihilation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20e/20ec6440ede691638c42684fd6551156.jpg","description":"Set in the distant future, this science fiction strategy was inspired by Total Annihilation (1997) and is designed by one of the original game's engine creators, Jon Mavor. Planetary Annihilation gameplay is largely similar to classic RTS series like Starcraft or Command & Conquer, yet not without its own unique features. This game is focused on interplanetary wars on a larger scale and allows its players to conquer the whole worlds or even destroy them using nukes and Death Star-like devices. The maps are randomly generated, and each map constitutes a whole planet in 3D projection (albeit scaled down). Each player starts with a Commander unit that is used to create necessary buildings. Commanders represent the player and, like in chess, loss of your Commander means losing the game.\n\nThe definitive feature of the game is that battles are not contained to certain planets, but are fought across the whole planetary systems using missiles and \"planet thrusters\"; and there are many such systems in the galaxy. The scale of the setting can make it difficult to keep track of one's operations across different systems at the later stages of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Uber Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10302,"name":"Dead Island Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dc9/dc9bfcddb7d0abc2d689193b3f43893a.jpg","description":"The game that re-defined the zombie genre - fully remastered.Paradise meets Hell!Welcome to the zombie apocalypse experience of a lifetime – and now more beautiful than ever. Caught in the midst of an epic zombie outbreak on the tropical island of Banoi, your only thought is: Survive!The Dead Island ExperienceSmash heads, crack skulls and slice ‘em up with visceral astounding melee combat and true story-based 4 player co-op in a sprawling open world just waiting for exploration.FeaturesIncludes all previously released DLC!Fully remastered: Experience Dead Island in crisp full HD with Improved graphics, game models and a photorealistic lighting system with physically based shadingAdrenaline-Fuelled Combat: Smash heads, crack skulls and slice ‘em up with the weapon of your choice in the visceral astounding melee combatSeamless Coop Multiplayer: Collaborate with your friends, live through a story of the struggle for survival in a world gone madDiscover the Island: Explore the island paradise; from the deserted city, secluded beaches and vast highlands – discover the story behind the zombie outbreakExperience the atmosphere: Experience the dense atmosphere - feel the destruction, the horror and madness. Immerse yourself in the turmoil that is taking place on the Island.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":42060,"name":"Wreckfest","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff2/ff2315fb895502efcbd40f1e5f37c170.jpg","description":"Wreckfest is a demolition derby themed racing game with soft-body damage modeling and in-depth vehicle upgrading, featuring both demolition derbies and more traditional track races. It’s all about fun, breakneck racing and over-the-top crashes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Handy Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":295020,"name":"Wasteland 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/370/370a4cbcfa75e5238ee8f74bf323694d.jpg","description":"From the creators of Wasteland 2 and Torment: Tides of Numenera comes Wasteland 3! Following the critically acclaimed releases of 2014's Wasteland 2 and 2015's Wasteland 2: Director's Cut, fans have been clamoring for a direct sequel. Wasteland 3 is currently in development with a target release date of late 2019.\r\n\r\n​\r\nA party-based role-playing game, with a renewed focus on our trademark complex story reactivity and strategic combat.\r\n \r\nBy including vehicles, environmental dangers, and a revamped, more fluid action system, we are evolving on Wasteland 2's deep tactical turn-based combat and unique encounter design.\r\n \r\nPlay by yourself or with a friend in story-driven synchronous or asynchronous multiplayer. Choices open up (or close off) mission opportunities, areas to explore, story arcs, and lots of other content.\r\n \r\nYour Ranger Base is a core part of the experience. As you help the local people and establish a reputation in Colorado, quests and narrative will force you to make decisions on how to lead.\r\n \r\nThe game will be set in the savage lands of frozen Colorado, where survival is difficult and a happy outcome is never guaranteed. Players will face difficult moral choices and make sacrifices that will change the game world.\r\n \r\nWasteland 3 will feature a deep and engaging story utilizing a newly-revamped dialog tree system from the celebrated writers of Torment: Tides of Numenera.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"InXile Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":39707,"name":"God of War II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/615/615e9fc0a325e0d87b84dad029b8b7b9.jpg","description":"The second installment in the God of War franchise and exclusive for the Sony PlayStation 2 console. The game uses basics from the hack-and-slash genre, like its predecessor, and was developed by Santa Monica studio, which is a subsidiary of Sony Entertainment. The game is recognized as one of the best for the console from Sony and the best game in action genre in 2007. The game was released on Sony Playstation 2 already at the moment when the third version of the console was already selling for four months. The developers explained their decision: one hundred million people already playing on PlayStation 2, whereas on the next-generation console gamers were just going to adopt the new hardware.\n\n###Key features\nThe player controls Kratos, who in the first part killed the god of war Ares and took his place. The game heavily relies on the ancient Greek mythology and uses it as inspiration and the main source for enemies and NPC design as well as locations design. However, the game is not a great source of accurate historical facts: Ancient Greece history was rewritten for the sake of the genre and the game universe, the rules of which were established in the first part.\n\n###The story\nKing of the gods Zeus betrays Kratos and kills him, but the Spartan is saved from the Underworld by another goddess Gaia, who invites Kratos to find the Sisters of Fate and go to the past and prevent his own murder. The gameplay remained the same: the player can use several attacks, which can be combined and improved with the help of the in-game currency collected from enemies. The game has a lot of Quick-Time-Events, mostly they are used in battles with bosses and in finishing combo-moves. Bosses in the game, in comparison with the first part, significantly increased.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"SCE Studios Santa Monica","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":10241,"name":"Thief II: The Metal Age","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f04/f04030abc433df09da4bb70a74bdf339.jpg","description":"Thief II: The Metal Age is a first-person stealth game, the second installment in the series.\n\n###Plot\nThe game’s narrative takes place a year after the first game. The main character, an elusive thief Garrett, is tasked with resolving a crisis brewing in the metropolitan City. Different factions fight for influence and schemes are put into action to undermine each other’s plans. As the story progresses, the protagonist finds more clues about the mysterious prophecy that tells about the end of humanity and risks his own life to prevent it from fulfilling.\n\n###Gameplay\nThe game heavily emphasizes discreteness and stealth, as the guards of the City may often try to stop the main character. Visibility and sounds play a crucial role in completing different tasks, and utilizing the surroundings can help get rid of enemies without confrontation. Different gadgets can be used to mask the sounds, obtain enemy’s location, and snuff out the lights. However, the playable character can still use his weapons to get rid of pursuers, but on higher levels of difficulty, doing so ends up in defeat and the need to restart the mission.\n\n###Visuals and features\nAs with its predecessor, Thief II employs a refined AI system, where enemies can notice sudden changes in the environment and react correspondingly. The lighting and shadowing have also been revamped, albeit keeping the same noir mood to the locations. The graphics of the game are awe-inspiring for its year of release, as each texture is highly detailed, and physics are made to be life-comparable realistic.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Looking Glass Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2828,"name":"NARUTO SHIPPUDEN: Ultimate Ninja STORM 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b1f/b1f0b19226228555d8b93b2f42b22349.jpg","description":"The latest opus in the acclaimed STORM series is taking you on a colourful and breathtaking ride. Take advantage of the totally revamped battle system and prepare to dive into the most epic fights you’ve ever seen in the NARUTO SHIPPUDEN: Ultimate Ninja STORM series!<br/>\n<br/>\r\nPrepare for the most awaited STORM game ever created!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CyberConnect2 Co.","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":16351,"name":"Realm of the Mad God","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c20/c201f665fc1d461719833ec1320935d6.jpg","description":"Realm of the Mad God is a multiplayer-only cooperative game in which teams of players hunt for monsters. The game uses a minimalistic retro-pixelated visual style with very simple animations. \n\n###Plot\nAccording to the game's backstory, the mad god Oryx kidnapped the protagonists and transported them to his dark dimension. He is going to use them as food for his hordes of monsters. However, the protagonists have weapons, and they will fight back.\n\n###Gameplay\nMost of the gameplay consists of slaying monsters with a fantasy version of firearms. The game uses the top-down third-person view. The player controls his or her character with the use of a keyboard (for movement) and a mouse (for aiming). \n\nThe central part of each server is Nexus, a safe zone in which the players can trade. From Nexus they teleport to various realms where they receive quests that involve killing monsters. When they kill enough monsters, they may encounter a boss, and eventually Oryx himself.\n\n###Characters\nThere are fifteen character classes, but the new player has to start with only Wizard class available. Other classes that include Ninja, Samurai, Paladin, and Assassin, among others, will be eventually unlocked when the player gains more experience. \n\nAn unusual feature of the Realm of the Mad God is the permanent death. When the player's character is killed, he or she will not respawn. All equipment of the dead character is also lost.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Wild Shadow Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":3987,"name":"Giana Sisters: Twisted Dreams","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5b/e5be8c031ac0dbd85bf058947d480375.jpg","description":"Giana Sisters: Twisted Dreams is the third game in the series that was started by Giana Sisters, a 1987 platformer. The original game was a Super Mario rip-off, but, though the new game retained many of the old mechanics (such as defeating enemies by jumping on them), there are also novel gameplay ideas.\nYou play as Giana, a girl who tries to rescue her sister Maria from the hands of an evil dragon Gurglewocky. Giana herself has two different personalities, a \"Cutie\" and a \"Punk\", that can be switched during the game. This change also dramatically alters the environment, allowing the player to shift between two dream worlds: one is a brightly colored garden, while other is a dark, nightmarish forest of giant mushrooms. In both worlds, the levels are nearly identical, despite the aesthetic change. But sometimes the game may demand you to switch to another world to move forward or to obtain a powerup that only exists in one of the worlds.\nA definitive feature of Giana Sisters: Twisted Dreams is its music. The score was composed by Chris Hulsbeck, who worked with the original Giana Sisters, and metal band Machinae Supremacy. The soundtrack shifts between “traditional” and \"heavy\" versions of the same compositions to highlight the game's dual nature.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Black Forest Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"}]},{"id":16779,"name":"BIT.TRIP RUNNER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72f/72f1e176e1affdf7a6c0e49e167080d7.jpg","description":"In the fourth part of Bit.Trip series the player controls Commander Video, a small featureless character, as he runs eternally to the right through a pixelated landscape. He jumps and slides to evade dangers, such as giant caterpillars, angry trees or soaring fireballs, and kicks to attack them. He has no hit points, and any hit means you have to restart the level again. Commander Video always runs, the player cannot stop or reverse the movement and is only able to make the character perform certain actions, such as jumps, at the necessary moments. \nCommander Video's movements are perfectly synchronized to music. When movements are performed right, new notes are added to the game's chiptune music score. Even pushing an unassigned button will result in playing some musical sounds. The run becomes quicker with time, raising the game's difficulty, but also giving the player more control and influence over the soundtrack. The game's visual style is that of simple and colorful pixel art with a \"retro\" feel to it. There are three “worlds” in the game, each of them includes eleven levels and ending with a boss fight.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":570074,"name":"Teenage Mutant Ninja Turtles: Shredder's Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aac/aac683272f862540a18625f02f5f3679.jpg","description":"Teenage Mutant Ninja Turtles: Shredder’s Revenge reunites Leonardo, Raphael, Michelangelo, and Donatello to kick shell in a beautifully realized pixel art world invoking the turtles’ classic 1987 design.\r\n\r\nWith Bebop and Rocksteady amassing gizmos to support Krang and Shredder’s latest scheme, Teenage Mutant Ninja Turtles: Shredder’s Revenge finds the turtles battling through a breathless tour of iconic TMNT locations to thwart their nemeses’ most diabolical plan yet. Armed with shell-shocking new abilities built on a foundation of classic brawling mechanics, the gang are in for an exhilarating, Foot Clan-stomping romp leading them through the sewers and bustling boroughs of New York City all the way to Dimension X.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Tribute Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":1545,"name":"Hand of Fate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9c/b9cb8c4e69907a68e33a4ebb2580f82a.jpg","description":"Hand of Fate is an unusual combination of various genres. It is based on mechanics typical for deck-building board games, but also features rogue-like and hack-and-slash elements. Its approach to the storytelling is typical for tabletop RPGs like Dungeons and Dragons. \nYou play cards against the Dealer, who is both your DM, opponent, and narrator of your adventures. Each card represents an item, a character, or an encounter. You navigate your character through the story that unfurls as you reveal the cards and make your choices. The goal is to collect a powerful deck of cards that give your character better weapons, armor, and other equipment. You can unlock more cards after you defeat bosses and complete quests. The Dealer’s goal is to hamper your progress, as he plays his cards to put new obstacles in your way.\nMost of the time the game will only show you the cards and the Dealer who sits across the table from you. You will learn the events from listening to him and reading the text on cards. Battles, however, are actually fought in real time by animated characters on visualized 3D arenas. This is very unusual for board game simulators and brings some variety into the gameplay.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Defiant Development","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":452642,"name":"Horizon Forbidden West","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bf7/bf73b105ccbba42107986bbcd96fcada.jpg","description":"Explore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon.\r\n\r\nThe land is dying. Vicious storms and an unstoppable blight ravage the scattered remnants of humanity, while fearsome new machines prowl their borders. Life on Earth is hurtling towards another extinction, and no one knows why.\r\n\r\nIt's up to Aloy to uncover the secrets behind these threats and restore order and balance to the world. Along the way, she must reunite with old friends, forge alliances with warring new factions and unravel the legacy of the ancient past – all the while trying to stay one step ahead of a seemingly undefeatable new enemy.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":9459,"name":"House Flipper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd9/dd91beec6add2a49038d62d67fd0733f.jpg","description":"House Flipper is a unique chance to become the one-man renovating crew.\nBuy, repair and upgrade devastated houses. Give them a second life and sell at a profit!\nAt your disposal is a collection of tools and parts. Use them to hammer, drill, nail down, screw, and do what needs to be done to mount, fix or clean up stuff.\nExperiment with interior design and decorating style you like.\nDecorate and furnish interiors with hundreds of unique items to choose from.\nExpress yourself!\nDo you love interior design and want fill up empty room in your favourite style? You can buy empty apartment and furnish it.\nDo you prefer things only engineers would understand? You can focus on repair and installation.\nAre you expert in \"small move, big change\" approach? You can buy decent house and make it perfect by adding some style and fixing stuff.\nUltimate goal of house flipping business is profit. Are you a risk taker? Do you like to invest?\nEstimate profit and find best risk/reward ratio for you.\nHouse flipping business is very challenging. Improve and sharp your skills. Get better tools. Unlock new mechanics and earn money to be able to invest more and progress faster. Have fun!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ultimate Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":284664,"name":"Streets of Rage 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e56/e56d74b0a1072662eea7c1a194363884.jpg","description":"Streets of Rage, known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017’s gorgeous Wonder Boy: The Dragon’s Trap remake, Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Playdigious","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":5689,"name":"The Sims 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/369/36914d895c20e35f273286145c267764.jpg","description":"The Sims 3 is the third part of its series. Like all Sims game, it allows the player to control the life of a person or even a whole family.\n\n###Character creation\nBefore the main game starts, the player has to create his or her character, called sim. The player can choose to play as a single character or a family. The game allows full customization for each sim. The player chooses their gender, age, race, and body type, as well as their traits that influence the sim's in-game behavior. The traits help sims to learn new skills that will be useful in their job and social life. The player can also choose to set all settings to random. There are also settings that define if the sims will age, and how fast.\n\n###Gameplay\nThe game introduces the open world that lives on its own even when the player doesn't interfere. Unlike in Sims 2, the world is seamless and there's no long load time when you travel it. The sims themselves became more independent and require less player attention to stay alive. Sims 3 is less oriented towards \"tamagotchi\"-like life-sustaining and more towards actually living the sims' lives, such as going to work, attending parties, making friends and flirting. The sims will occasionally have wishes, and fulfilling them earns the character more happiness points.\n\n###Building homes\nThe building mode didn't change much since Sims 2, but the game introduced a few additional options. Most notably, elements don't have to be aligned to a grid anymore. The player can place them diagonally at any angle.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"}]},{"id":14230,"name":"Sang-Froid - Tales of Werewolves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ec/6ec7245a6a69fa45d49cfc8a37787865.jpg","description":"Sang-Froid: Tales of Werewolves is a tower defense game. It is based on the Native American and Canadian folktales and prominently features mythological creatures like werewolves and wendigos. \n\n###Plot\nThe game is set in Canada in the XIX century. The protagonists are two brothers O'Carroll who set their differences aside to save their sister. Every night, a pack of werewolves and other monsters attack her house. If they fail, the Devil himself will abduct the poor woman. The brothers have to hold on for three weeks in the midst of December.\n\n###Gameplay\nThe player assumes the role of one of the brothers and controls them from the top down view. The goal is to defend the house and other buildings. The game is divided into days and nights. By day, the player can prepare his or her defenses by setting traps. The protagonists have a limited number of action points and money to spend on the traps. The more buildings there are, the more action points the player has, but also the more difficult they are to protect.\n\nBy night, the werewolf invasion puts the player's preparations to the test. Enemies come in waves by random numbers. However, the player has all important information about the strength of the opponents. The protagonist can fight the monsters directly using his axe and a musket. The latter is ranged but has limited ammo and a long loading time. The player can also intimidate the monsters so that they will not attack his or her character.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Artifice Studio","platforms":[{"id":0,"name":"PC"}]},{"id":17013,"name":"Lucius","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/679/67900b47263413bd65fc0032ad966e0b.jpg","description":"06.06.1966 - an unusual number of sixes on this date, perhaps, somehow affected the character of one boy, born that day - Lucius. And certainly his character was influenced by the fact that his father is Lucifer himself, who on the sixth day after birth informed the boy that he had prepared many gifts for him. But to get these gifts, the boy needs a little work. Namely - to finish off everyone who lives with the boy in the same house or just inappropriately appeared next to him. This is a lot of people - twenty. Most different, from butlers and gardeners to reporters, priests and police. Papa Lucifer did not make any special demands, he was soft with his son - he did not order any special methods of murder, he agreed to any. But life is unpredictable, and the boy had to often retreat from simple scenarios, acting very ingeniously. On the other hand, he already had some of the unusual gifts - for example, telekinesis, pyrokinesis, the ability to subordinate someone else's will.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Shiver Games","platforms":[{"id":0,"name":"PC"}]},{"id":5390,"name":"Burnout Paradise","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/788/788b80cbc8c39167f7ed6dd89fd398dc.jpg","description":"Burnout Paradise is a race in the open world from the studio Criterion Games.\n\nThe action takes place in a fictional Paradise City, a completely open world in which a player can participate in several kinds of races, discover new cars and secrets. \n\nA distinctive feature of the Burnout game series is the detail recreation of damage to the cars. Each accident occurs in slow-mo, and the camera hangs in the most exciting angles. In Paradise there are two types of damage: if all wheels are in place and the suspension is not damaged, then the player can continue the race despite the damage. If the player loses one of the wheels - a car is considered wrecked and player respawns. Also, all cars react realistically to all collisions: scratches and dents appear on the body, the body twists abreast solid objects impacts.\n\nPlayers can both go through the game alone in a single campaign, and compete in multiplayer races. It adds new modes such as Cops and Robbers.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":23302,"name":"Black Squad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf9/bf985433cad316bdc03ae737cf7fc81e.jpg","description":"Black Squad is a free-to-play multiplayer shooter developed by NS Studio. \n\n###Story\nA new terrorist organization known as Viper Circle emerges. The group seeks world domination by eliminating political figures and executing terrorist attacks. A group of peacemakers opposing them.\n\n###Gameplay\nIn Black Squad players engage in competitive team versus team matches in a variety of game modes. As in most free-to-play shooters, the game features an in-game shop where players can buy skins for their guns as well as experience point boosters and loot boxes for the in-game currency. This currency can be earned either by participating in the game's matches or it can be purchased for real money. The in-game shop does not affect the gameplay in any way, as only cosmetic items can be purchased just like in Overwatch or Rainbow Six: Siege.\n\nBlack Squad offers a variety of competitive multiplayer modes, such as Deathmatch, Team Deathmatch, VIP Escort, Bomb Defusal, and a unique mode of Base Destruction, in which two teams of 16 players fight each other to destroy the enemy base.\n\nThe standard loadout system is present in the game with the players being able to carry one main weapon, one sidearm, one lethal and one non-lethal grenade, and a knife. The players can choose to utilize a gadget, such as an automatic turret or a motion sensor instead of a grenade.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NS STUDIO","platforms":[{"id":0,"name":"PC"}]},{"id":1391,"name":"Assetto Corsa","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/133/133e752b7488e7f2afe45923b9f790a2.jpg","description":"NEXT GENERATION RACING SIMULATOR\nAssetto Corsa features an advanced DirectX 11 graphics engine that recreates an immersive environment, dynamic lighthing and realistic materials and surfaces. The advanced physics engine is being designed to provide a very realistic driving experience, including features and aspects of real cars, never seen on any other racing simulator such as tyre flat spots, heat cycles including graining and blistering, very advanced aerodynamic simulation with active movable aerodynamics parts controlled in real time by telemetry input channels, hybrid systems with kers and energy recovery simulation. Extremely detailed with single player and multiplayer options, exclusive licensed cars reproduced with the best accuracy possible, thanks to the official cooperation of Car Manufacturers.\nASSETTO CORSA has been developed at the KUNOS Simulazioni R&D office, located just inside the international racing circuit of Vallelunga, allowing the team to develop the game with the cooperation of real world racing drivers and racing teams.\nLEGENDARY TRACKS\nThe circuits have been developed using Laser scan technology, in order to guarantee the highest level of accuracy possible in reproducing real world motor racing environments.\nMonza, Silverstone, Imola, Mugello, Spa, Brands Hatch and many more tracks, including the historical reproduction of Monza, that brings again to life the legendary Sopraelevata, the high-speed oval where races were staged until 1961.\nEXCLUSIVE CARS\nThe Assetto Corsa physics engine is all new, using practical knowledge acquired from working closely with the elite of motorsport in order to engineer the best possible accuracy of physics and tactility of feeling.\nA physics engine like this begs to be used with officially licensed contents: Abarth, Audi, BMW, Classic Team Lotus, Ferrari, KTM, Lamborghini, Lotus cars, McLaren, Mercedes, Scuderia Glickenhaus, Pagani, Porsche, Tatuus and many more!\nHARDWARE COMPATIBILITY\nEnjoy ASSETTO CORSA using any kind of game device: keyboard, joypad, joystick, steering wheels including any kind of professional device and the most common motion systems.\nASSETTO CORSA is also compatible and ready for Oculus and OpenVR/VIVE, triple monitor view, Track IR and 3D VISION.\nGAMEPLAY & FEATURES\nAssetto Corsa includes a career mode, a list of special and unique events and challenges, as well as a fully customizable, single player and multiplayer modes featuring quick races, custom championships, race weekends including free practice session, qualifying session and race. Drag races, drift challenges and much more! Four driving assist profiles (gamer, racer, pro, plus a fully-customizable profile) allow any kind of player to enjoy the simulation at their desired level.\nAdvanced setup options and telemetry for data analysis; dynamic simulation of the tyre rubber deposited on track, depending on the car laps; an adjustable time of the day mode, featuring sun position calculated in realtime, depending by geographical coordinates of the track and by the sun curve according to time and date, in order to get the same light conditions of the real tracks!\nMODDING & CUSTOMIZATION\nAssetto Corsa will allow for considerable customisation and modification, in order to satisfy the expectations of professional simracers, gamers who prefer to approach the driving experience more progressively, and hobbyists who just like to reproduce and share their cars and tracks, taking advantage of the same editing tools developed and used by the developers of the game.Available content:\nCARS\nPRODUCTION\n- Abarth 595 EsseEsse (3 variants)\n- Abarth 500 EsseEsse (2 variants)\n- Alfa Romeo Giulietta QV\n- Alfa Romeo Giulietta QV Launch Edition\n- Alfa Romeo MiTo QV\n- Audi Sport Quattro (2 variants)\n- Audi S1\n- Bmw 1M (2 variants)\n- Lamborghini Miura S.V.\n- Lotus Elise SC (3 variants)\n- Maserati Levante S\n- Mazda MX-5 NA\n- Porsche Panamera G2\n- Porsche Cayenne Turbo S\n- Porsche Macan Turbo\n- Shelby Cobra\n- RUF CTR Yellowbird\n- Toyota GT-86\n- Ford Mustang 2015\n- Chevrolet Corvette C7 Stingray\nGT\n- Bmw M3 E30 Evo (3 variants)\n- Bmw M3 E30 Group A\n- Bmw M3 E30 DTM\n- Bmw M3 E92 (3 variants)\n- Bmw Z4 E89 (3 variants)\n- Lotus Evora GTC\n- Lotus Evora GX\nGTR\n- McLaren MP4-12c GT3\n- Bmw Z4 GT3\n- Bmw M3 GT2\n- Ferrari 458 GT2\n- P4/5 Competizione\n- Mercedes SLS GT3\nCLASSIC GP\n- Classic Team Lotus Type 49\n- Classic Team Lotus 98T\n- Ferrari 312T\nRALLY\n- Audi Sport Quattro S1 E2\nENDURANCE\n- Mazda 787B\nSUPERCAR\n- Audi R8 Plus\n- Ferrari LaFerrari\n- Ferrari 458 Italia (2 variants)\n- Ferrari F40 (2 variants)\n- Ferrari 599xx\n- McLaren Mp4 12c\n- Mercedes SLS AMG\n- Nissan GTR NISMO\n- Pagani Zonda R\n- Pagani Huayra\n- Lotus Evora S (2 variants)\n- Lotus Exige S Roadster\n- Lotus Exige Scura\n- Lotus 2 Eleven GT4\nTRACKDAY\n- KTM X-Bow R\n- Lotus 2 Eleven\n- Lotus Evora GTE\n- Lotus Evora GTE Carbon\n- Lotus Exige 240R (2 variants)\n- Lotus Exige V6 Cup\nOPEN WHEEL\n- Tatuus FA-01\n- Lotus Exos T125 (2 variants)\nTRACKS\n- Magione - \"Autodromo dell'Umbria\"\n- Imola - \"Autodromo Enzo e Dino Ferrari\"\n- Mugello - \"Autodromo Internazionale del Mugello\"\n- Silverstone - GP\n- Silverstone - International\n- Silverstone - National\n- Silverstone 1967\n- Monza - \"Autodromo di Monza\"\n- Monza - \"Classic 60's Edition\" (3 variants)\n- Nurburgring - GP\n- Nurburgring - Sprint\n- Spa Francorchamps\n- Vallelunga - \"Autodromo Piero Taruffi\"\n- Vallelunga - Circuito Club\n- Zandvoort\n- Trento - Bondone Hillclimb\n- Drift Track\n- Drag strip\n- Black Cat County (fantasy track)\n- Highlands (fantasy track)\nSHOWROOMS\n- Standard showroom\n- The Beach\n- Hangar\n- Industrial\n- Sunset\nGAME MODES\n- Free Practice\n- Racing against AI\n- Career\n- Custom championship\n- Online Multiplayer\n- HotLap\n- Time Attack\n- Special Events\n- Drift\n- Drag race\nFEATURES\n- In game telemetry and apps\n- Advanced car setup management\n- Flags\n- Penalties\nAPPS LIST\n- Basic info\n- Chat app\n- Tyre app\n- Real time app\n- Help\n- Lap time\n- Pit stop presets\n- Friends Leaderboard\n- Camera On Board Customization\n- Time of the day display\n- Input monitor\n- Time performance indicator\n- Gear/rpm indicator\n- Track map\n- Rankings\n- G-meter indicator","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":40265,"name":"Dungeon Siege 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a8d/a8d08a70ce7a4f3263bedf5d764fc538.jpg","description":"In Dungeon Siege III, 150 years have passed since the ending of the original Dungeon Siege. Some 30 years ago, a woman named Jeyne Kassynder led the rebellion and took over the power in the fantasy realm of Ehb. Kassynder framed the heroic 10th Legion, featured in Dungeon Siege, for the murder of the king, and nearly annihilated them.\nThe player takes the role of an heir to one of the last surviving Legion members. There are four possible protagonists with pre-scripted backstories to choose from, and the main plot will slightly differ based on your choice. However, regardless of which character you choose, the other three will eventually appear in the game and can be recruited to accompany the player, one at a time.\nEach character has his or her unique set of skills and attacks. For example, Lucas, a knight, can withstand heavy damage in a melee fight. Katarina prefers ranged weapons and a little magic. Anjali is a shape-shifter who is a combination of both, depending on her current form, and Reinhart is a classic magician who uses energy spells. The controls are very different from the previous parts: the point-and-click approach was scrapped in favor of arrow keys and attack buttons.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":320,"name":"Night in the Woods","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0a/b0a370527fea0e824225269d4a8797db.jpg","description":"Night in the Woods is a quest game developed by Infinite Fall.\n\n###Plot\nNight in the Woods takes place in a universe of anthropomorphic animals. A cat named May returns back to her hometown of Possum Springs because of a dissociative disorder that does not let her recognize other people something other than rectangular shapes. May had dropped out of college and she does not know what to do with her life yet. She got back into the town to hang out with her old friends or simply walk around the town and meet the people she knew in her childhood, yet this childhood world is no more. The city's residents start talking about something happening in the nearby forest. May gets her friends together and goes out to figure out what's going on.\n\nThe game explores the typical teenage problems in a common environment, as stated by the game's developers.\n\n###Gameplay\nThe main objective of the game is to explore the in-game world. May can run, jump, and interact with both other characters and the in-game objects. As stated by the developers, the key actions the player should take are to explore, converse, see and touch. The game focuses mostly on its narrative, rather on the gameplay experience. \n\nWhile talking to other characters, the players can choose the line for May to reply with. Your replies will affect the game's story, yet the change will be minor.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Finji","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":4240,"name":"Worms Revolution","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/197/197780c33719b9b2e4d3619a527f3c21.jpg","description":"Worms Revolution is a Team17 game and the 18th part of Worms series, counting as many as 25 titles total. It is the turn-based game with a heavy accent on customizable characters and environment. The game features single- and multiplayer while giving the players an opportunity to play in cooperative with the hotseat feature allowing them to take turns one at a time.\nIt is hard to say that \"Worms\" has any plot at all: there is barely even hints, which may prompt the player to understand the eternal conflict between the worms of a different color. \nThe gameplay, on the other hand, is quite memorable: in fact so crucial that not only Worms have given birth to many other worms-like games but also created a whole genre: artillery tactical turn-based strategy. The primary goal of a team or a player is to eliminate the opponent(s). To achieve this goal, one must utilize a various range of weapons. They do not only damage the other worms but also transform the ground. While every turn grants the player with the ability to walk a certain amount of space and utilize one weapon — the landscape factor is crucial here.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":463723,"name":"Far Cry 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5dd/5dd4d2dd986d2826800bc37fff64aa4f.jpg","description":"Welcome to Yara, a tropical paradise frozen in time. As the dictator of Yara, Anton Castillo is intent on restoring his nation back to its former glory by any means, with his son, Diego, following in his bloody footsteps. Their oppressive rule has ignited a revolution.\n\nJOIN THE REVOLUTION\nPlay as Dani Rojas, a local Yaran, and become a guerrilla fighter to liberate your nation.\n\nYARA TORN APART\nFight against Anton's troops in the largest Far Cry playground to date across jungles, beaches, and Esperanza, the capital city of Yara.\n\nGUERRILLA FIREPOWER\nEmploy makeshift weapons, vehicles, and animal companions to burn Anton's ruthless regime to the ground.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":2944,"name":"Trine 3: The Artifacts of Power","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0fb/0fbd117f2417089f4527eeb05f7dca87.jpg","description":"Trine is a mystical artifact that at some point in the past chose three mighty heroes to make sure that the land would be safe and the balance would be restored in time. Brave Knight Pontius, agile Thief Zoya and Amadeus the Wizard are called again to find out the source of the disturbance. \n\nAfter the events of the second game, all three heroes had their time to rest, but now, after they answered a new call, the prisoner of the Artifacts, Sarek, has broken out and is planning to corrupt the world with his magic.\n\nStudio Frozenbyte continued the story of the games while adding new mechanics. They expanded the game camera, and now players can experience bright and detailed backgrounds of the game and even move with the camera behind their back because Trine 3 is a full 3D game. The game studio had to cut the game short, ending the game on a cliffhanger, because the full scope of the project went outside of their budget, and it was the only way for them to finish the game. The rich soundtrack helps to add the atmosphere to the world of magic and whimsy.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frozenbyte","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":798,"name":"Downwell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9c/e9ce72a3e2c1ac344e8876d6bb0dcf50.jpeg","description":"This is a procedurally generated rogue-lite, that lets players to explore the depths of a well. Taking a role of Welltaro, local curious man, players will drop down the well to kill monsters and collect the treasure. Simple three button controls are consisting of left and right movement and an action button. The action button will make a character jump, and while airborne, pressing and holding the button will give players the ability to shoot below them from the gunboots. But ammo is limited and replenished only when players are landing on the platforms.\nExplorable well is built out of multiple stages where each has three levels with different environments. After beating a level, players will be offered to pick one of three perks. A total amount of existing different perks are 20. Downwell has a combo system, which gives players a buff that makes attacks stronger if the combo score is high enough. To make their character stronger, players can buy gunboot charge and health upgrades.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":15422,"name":"Serious Sam Classics: Revolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/017/017e1f2c593b4f1a036f96b9ccdbd500.jpg","description":"Serious Sam Classics: Revolution is a unified version of the Croteam's original Serious Sam Classic: The First Encounter and Serious Sam Classic: The Second Encounter experience, which is currently in development by Alligator Pit, an indie development team made of Serious Sam fans with the support of Croteam. Serious Sam Classics: Revolution, along with newly developed content by Alligator Pit, also includes all levels from both Classics and is powered by an updated Serious Engine 1 featuring all-new advanced graphics shader support, full 64-bit compatibility, full Steamworks integration, and lots of bug fixes for a superior game experience. Serious Sam Classics: Revolution is a standalone product and it is completely free to those Steam users that already own both original Serious Sam Classic games on Steam (Serious Sam Classic: The First Encounter and Serious Sam Classic: The Second Encounter).\nDevelopment team Alligator Pit is comprised of Angelo, Rakanishu, Bromvlieg, Solais and many other dedicated Serious Sam fans from around the world.\nSerious Sam is a high-adrenaline old-school arcade-action shooter heavily focused on frantic arcade-style action. Serious Sam travels through the beautiful landscapes of Ancient Egypt, Mayan Civilization, Persian Empire and Medieval Europe, confronting the countless numbers of Mental's hordes hell-bent on destroying the human race. You are Sam \"Serious\" Stone. Welcome to the fight!Key FeaturesDuring the development in the Early Access phase, you can enjoy the following features:\nSteamworks - Fully integrated with Steam powered servers, game browser, achievements, leaderboards, and more!\nFrantic Arcade-Style Action - Fight your way through nightmarish warriors in Mental's army, including old favorites like the Beheaded Kamikaze, Sirian Werebull, Kleer Skeleton and new forgotten baddies that somehow got lost in time. Battle it out with three of Mental's fiercest generals to save the day or die trying!\nVarious Environments and Secrets - Unleash mayhem in 4 spectacular locations: Ancient Egypt, Mayan Civilization, Persian Empire and Medieval Europe. Discover over 100 secrets spread throughout the battlefield!\nSpecial Weapons and Power-Ups - Wreak havoc with a huge arsenal of weapons including the classics such as the Double Shotgun, Minigun, Sniper Rifle and Cannon! We also added the beloved Plasmagun and Minelayer from the Warped mod!\nCo-Op Multiplayer - Embrace the chaos with up to 42 players! Play through the entire campaign with your closest friends or enemies!\nSurvival - Try your luck at the brand new Survival gamemode!\nVersus Multiplayer - Drop the gauntlet and let the heavy ordinance fly in the classic Deathmatch and Scorematch, and when you've had enough of that, try out the all-new game modes unique to Revolution: Team Deathmatch, Capture-the-Flag, Control Zone and more!\nSplit Screen - Huddle up with up to 4-player local split screen co-op and versus modes!\nMassive Updates - Fully updated engine with hundreds of bug fixes.\nFull 64-bit Compatibility - Run on the latest versions of Windows with a fully working editor!\nAdvanced Shader Support - Write your own OpenGL shader programs and apply them in your levels!\nLevel Editor - Create your own levels, mods, textures and other content with the inclusion of the fully featured Serious Editor and the Serious Modeler!Future UpdatesWith our regular updates during the Early Access phase, we will introduce the following updates over time:\nA brand new campaign with new and exciting enemies, environments and a special ending boss!\nEven more new and refined gamemodes!\nEven moooooore achievements, and icons for them!\nA fully featured scripting engine for advanced mod creation!\nMore OpenGL shader integration like post processing and more!\nMore versus maps and fixes to the current ones based on user feedback!\nFor modders, we'll be adding a set of tutorial maps to showcase the new features we've added to the engine!\nSteam Trading Cards!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":12279,"name":"Tomb Raider V: Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ff1/ff1f2c5ca5bd645b6ab10e15c0bcce23.jpg","description":"Tomb Raider V: Chronicles is an action-adventure game, the fifth main installment in Tomb Raider series and sequel to 1999 game Tomb Raider: The Last Revelation. \n\n###Plot \nThe story continues the plot of the Last Revelation. After the collapse of Great Pyramid of Giza, the game’s protagonist Lara Croft is presumed dead. Her three friends come together on her funeral and tell three stories about her recent adventures that did not appear in previous games. These three stories take the most of the game’s playtime. \n\n###Gameplay \nThe gameplay shares many similarities with Last Revelation. The levels in the game incorporate platforming, puzzle solving and fighting enemies. Lara can use many different weapons in combat such as her iconic double pistols with infinite ammo, submachine guns, shotguns, harpoon guns. The new item to the series is grappling gun. It can fire grappling hook that clings on certain surfaces and produces a rope that can be used to swing across rooms and get over pits. \nPlatforming sequences require Lara to use different acrobatic moves like somersaults, walking the tightrope, swinging on horizontal bars. Some levels take place underwater where a player must use weapons and items different from the other parts of the game.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Core Design","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":28632,"name":"Gears of War 3","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/422/4228842dcfaef2a83bdb14c2a3ca2165.jpg","description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French. “Gears of War 3” is the spectacular conclusion to one of the most memorable and celebrated sagas in videogames. Developed by Epic Games exclusively for Xbox 360, “Gears of War 3” plunges players into a harrowing tale of hope, survival and brotherhood.  In “Gears of War 3,” players fight on as Marcus Fenix, the grizzled war hero and leader of Delta Squad. Eighteen months after the fall of the last human city, the war against the Locust rages on. Meanwhile, deep beneath the surface, a fearsome new threat is infecting the planet from within. With survivors scattered and civilization in ruins, time is running out for Marcus and his comrades as they fight to save the human race.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Epic Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":59695,"name":"Cuisine Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/319/319262248c762977f7f8d0557988b9e6.jpg","description":"Cuisine Royale is an all-kitchen-warfare Battle Royale game with the most honest system for Loot Boxes ever. Originally an April Fool’s joke from developers of squad based MMO shooter Enlisted, Cuisine Royale was highly appreciated by players and is now released as a stand-alone title.\n\n###Features\n - Dinnerware will finally be able to show off its true potential: Use a colander as head protection, equip a \nwok as a formidable breastplate, or strap on a massive waffle maker to be protected even against the largest calibers of weapons.\n\n - The most honest system for Loot Boxes: Those are scattered around the battlefield, and are free to open, their content is well labelled, and the drop chance of what is said to be inside is a 100% guarantee.\n\n - Improve your characteristics in the battle significantly: Strapping on a medical dropper will provide you with accelerated health regeneration, a set of glasses will increase weapon accuracy and chewing on a cigar will turn you into a real Tough Guy!\n\n - Massive and intense battles: 30 players per session in total will head out from different parts of the map, starting only in their underwear and making their way to the center of a battlefield that is constantly shrinking in size.\n\n - The fanciest pants: This ain’t no Joke! Try them on and good luck on the battlefield!\n\n###Seasons\nThe Seasons of High Cuisine is a series of in-game events. Each season lasts for 10 weeks and is devoted to a particular country. During the season players can craft various cosmetic items: pants, masks, suits and others, stylistically associated with this country. In order to \"cook\" the items players need ingredients that can be obtained for reaching a new level, completing daily and weekly tasks or purchased in the game shop.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Darkflow Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]}]