[{"id":5596,"name":"Kingdom Hearts Birth by Sleep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f29/f29dfda4bbdfcd5b6d15d408643a2bbd.jpg","description":"Long before Sora was chosen by his Keyblade, the worlds’ safety lay in the hands of Keyblade Masters. \n\nThree youths—Terra, Ventus, and Aqua—have been training long and hard under Master Eraqus to prove that they, too, exhibit the Mark of Mastery. \n\nBut they will soon find themselves in the middle of a crisis affecting worlds far beyond their own.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PSP"}]},{"id":3851,"name":"Madden NFL 25","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f46/f4608cd629adf70c00977839bc992236.jpg","description":"Powered by EA SPORTS IGNITE, Madden NFL 25 ushers in the next generation of sports games delivering 10x more detail and unprecedented control.  Players think and anticipate in the trenches and across the field. Every step is calculated to showcase the most realistic player movement ever, and the emotion of Sunday is brought to life like never before with living sidelines, rich commentary, and thunderous crowds.  Madden NFL 25 changes the game forever.\nVideo output in Full HD 1080p requires 1080p native display.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. One-time license fee for play on purchasing account’s designated, primary PS4™ system and other PS4 systems when signed in with purchasing account.\n©2013 Electronic Arts Inc. The mark 'John Madden' and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear, Inc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. All rights reserved. NFL materials © 2013 NFLP. Officially Licensed Product of NFL PLAYERS | NFLPLAYERS.COM. All rights reserved. All other trademarks are the property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":522975,"name":"NEO: The World Ends With You","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90d/90d8760ba2c817ab86f56d23bcc42e0a.jpg","description":"Explore a stylized recreation of Shibuya, as you take on the role of Rindo to battle for survival and unravel the mysteries of the deadly “Reaper’s Game” in this new Action RPG for PlayStation 4 and Nintendo Switch.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":52169,"name":"osu!","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/142/1420d28eb5fa9d012b90c48629a18a94.jpg","description":"osu! is a rhythm game created by Australian developer Dean \"peppy\" Herbert in 2007 and playable for free on PC. It is among the most popular rhythm games in recent times, counting about 500,000 active players and over 14,000,000 created accounts. It received an official iOS version named osu!stream in 2011. A new PC client codenamed osu!lazer is currently in the works.\n\nosu! features 4 modes, three of them based on popular commercial rhythm games :\n- osu!standard is based on Osu! Tatakae! Ōendan (known as Elite Beat Agents in the West); it is the default and most popular mode. Notes are represented by numbered circles which appear on the play field. The player must use a pointing device (such as a mouse or graphic tablet) to click on the circles to the beat of the music to earn points and keep up their combo until the end of the song. \n- osu!mania is based on classic Vertical Scrolling Rhythm Games (VSRG) such as the Dance Dance Revolution series. Notes scroll down a play field with multiple lanes each corresponding to one key, until they reach a line. The player must press the right keys at the right timing indicated by the line to earn points.\n- osu!taiko is based on the Taiko no Tatsujin series. Red (don) and blue (katsu) circles representing notes scroll on a single lane and the player must press the key corresponding to the color of each note at the right timing. This mode supports use of Nintendo Wiimotes as a control device, mimicking the controls in Taiko no Tatsujin Wii.\n- osu!catch, also known as Catch the Beat or ctb, is the only original mode in osu!. Notes represented by various fruit fall down from the top of the screen. The player controls the mode's mascot, Yuzu, holding a basket, and must move him left and right to catch the falling fruit. \n\nWhereas commercial rhythm games generally only feature music licensed or commissioned by the developer, osu! is notable for its entirely player-created content. Players can freely create beatmaps (the game's equivalent of charts) for any song using an extensive editor and upload them on the game's website for anyone to download and play. Quality maps are selected through a evaluation process to become ranked, allowing them to possess a leaderboard and count towards the game's player performance ranking system. The game also features support for skins which can change the appearance of nearly everything in the game.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"ppy","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":43755,"name":"Metroid: Samus Returns","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c8a/c8a659feff775789bf3b23790229b204.jpeg","description":"Brave the hostile terrain of an alien planet teeming with vicious life forms as legendary bounty hunter Samus Aran. Her mission? Terminate the Metroid menace in this masterful reimagining of her 1991 Game Boy™ adventure. Samus Aran's arsenal has been enhanced with new moves and abilities that are sure to help her face the deadly surprises that await. This intense, side-scrolling action platformer is a great entry point into the Metroid franchise and perfect for returning fans as well, and it's available only on the Nintendo 3DS family of systems.\nFeatures:\nThis intense, side-scrolling action platformer has been completely remade with engaging and immersive 3D visuals and a rich, atmospheric color palette.\nClassic Metroid II: Return of Samus gameplay is joined by a wealth of new content, including a set of brand new abilities that utilizes a mysterious energy resource called \"Aeion,\" a powerful melee counterattack, and 360-degree Free Aim Mode.\nThere are plenty of secrets to find—and if you uncover enough of them, you may even start to unravel the mystery of Planet SR388's past.\nTwo new amiibo™ figures*—Samus Aran and Metroid—will be released as a set alongside the game. This game is also compatible with the Zero Suit Samus and Samus amiibo from the Super Smash Bros. series. Functionality details will be revealed at a later date.\nWhile supplies last, fans will be able to purchase a special edition of the game, which includes a physical copy of the game, a sound-selection CD featuring 25 tracks from across the Metroid franchise, and a reversible title-sheet insert for the game case.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":19683,"name":"Dead State: Reanimated","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2c3/2c30770559827208554fbf000f4a5019.jpg","description":"Dead State: ReanimatedWe’ve spent a couple of months of solid development time making Dead State stronger, smarter, and faster, and we’re happy to say that the results are fantastic. We’ve brought new life - or is it unlife? - to every aspect of the game.  This isn’t just Dead State anymore - this is Dead State: Reanimated!  DS:R isn’t just an update - it’s our definitive enhanced edition with brand-new content, full of improvements and fixes requested by you, our community!The HighlightsMajor overhaul of combat balance!  Core combat systems have been thoroughly reworked to take advantage of all the data and feedback we’ve gathered over the months since Dead State’s original release.  Ranged weapons, melee weapons, armor, special attacks, ally / PC healing, and more have been reworked and carefully tested to create an engaging and challenging combat experience.  Even the core combat system has been tweaked so that AC is calculated before damage reduction; this change makes combat more consistent and more fair, and corrects the “invincible” armor problem.\nSmarter AI!  Medic, Guard, Grenadier, Sniper, and more - New AI behaviors and schemas exist for human enemies, making them more interesting and more challenging to fight!  Enemies will notice your presence more quickly, follow you around corners and through doors, and fully utilize all of their tactical options, thrown weapons, and special attacks.\nNew PC Infection option on New Game menu!  Create a new game with PC Infection checked and your character will be as susceptible to infection as your allies are.  Carefully manage your antibiotics and change your combat strategies to ensure your own survival!\nHardcore Mode!  Just in case living in the apocalypse wasn’t hard enough for you.  In Hardcore mode combat becomes more dangerous, allies consume more resources and heal more slowly, and Morale is harder to keep up.  Turn on Hardcore, Iron Man, and PC Infection for the ultimate challenge!\nAlarms!  That’s right - we’ve added alarms to buildings in several areas.  Red, blinking lights warn you that there’s an active alarm on a building. Use your Science skill to deactivate an alarm and prevent a looting distraction from becoming a noisy attraction!\nNew areas and random encounters!  Several new levels and random encounters have been added.  Make sure to keep an eye out for the Chemical Plant, an area with a unique twist…\nNew combat sounds and animations!  We’ve added new special attack, reloading, and healing animations and sounds.  Special attacks feel smoother and more impactful now!\nStability improvements!  We’ve rooted out every crash and progress blocking bug to make sure you have the smoothest possible experience.  Several popularly requested usability improvements have been added, such as friendly fire conformation, looting piled up bodies, and an option to toggle Live Shelter movement on and off.\nPathfinding improvements!  Both allies and the undead have received major pathfinding adjustments that will reduce lag some people have experienced as well as make movement more consistent and natural.\nAbout the GameAbout the GameDead State is a compelling, high-tension survival RPG set in central Texas at the collapse of civilization and the dawn of the undead apocalypse.\nAs society is beginning to fall apart, the player must organize a group of survivors together, fortify a shelter, scout for food and supplies, negotiate with or defend against other factions, and maintain order inside the shelter as humanity teeters on the brink of extinction. Dead State is a full-fledged RPG featuring base building and management, turn-based tactical combat, and reactive story and dialogue with an emphasis on survival at any cost.\nAttract new allies, scavenge food and supplies, and protect your shelter at any cost. Do you have what it takes to lead a desperate group through a crisis? This is your chance to find out.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"DoubleBear Productions","platforms":[{"id":0,"name":"PC"}]},{"id":18871,"name":"Wings of Vi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c9/5c9cca146ba2e40e419374eaa04c0474.jpg","description":"Wings of Vi is a challenging 2D platformer in which you play as the angel Vi, tasked with defeating the Demon Lord Jeh’oul after he is freed from captivity. Throughout her journey she must traverse dangerous worlds and fight countless hellspawn in order to discover where Jeh’Oul lurks and save the world from his demonic clutch.\nThe game takes inspiration from \"Megaman\", \"Cave Story\", and \"Castlevania\", along with a host of masochistic retro platformers, while cutting out the arbitrary difficulty of hidden traps and pixel-perfect jumps in favor of skill based gameplay. The game aims to capture the attention of the same core group of players as its spiritual precursor, \"I Wanna be the Boshy\", including the hardcore-platformer lovers and the speedrunning community, all while appealing to a broader audience through a variety of difficulty levels and modifiers.Key Features\nChallenging Gameplay\nWings of Vi is an action platformer that brings to best out of old-school platformers while removing most of the arbitrary difficulty brought with them. That being said, you will die. A lot. But don’t let that turn you off! There’s three different difficulties and some hidden modifiers catered to multiple audiences, so you’re sure to find a challenge setting suitable for you.\nIntense Bossfights\nBattle your way through treacherous terrain and devilish enemies before facing up against epic bosses. Fight against a clumsy satyress, giant dreadnought, possessed angel, and more in tough-as-nails clashes.\nCrisp Pixel Graphics\nExplore a world crafted in stunning SNES-inspired pixel art, where each level is complete with its own unique tileset, background, bosses, enemies, and more.\nOnline Leaderboards\nBattle your friends or random folks on the internet for a spot at the top of online leaderboards. The boards track your completion time and deaths, separated into sections based on both difficulty and game modifiers. There’s even a section for boss rush!\nAchievements, Secrets, and Customization!\nTackle your foes in unorthodox ways or complete special challenges to earn achievements with unique rewards. Explore hidden depths and complete treacherous platforming to discover secrets, unlocking cosmetics and new attacks to customize Vi!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Grynsoft","platforms":[{"id":0,"name":"PC"}]},{"id":13821,"name":"From the Depths","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03e/03eed62aece871e66ecc3f1cc2fe20db.jpg","description":"SummaryIn From the Depths you can build and take first-person command of battleships, planes, submarines, space ships, hot air balloons and more! The game is currently in alpha and contains a wide range of single player content including:\nA creative mode allowing you to push your designs to the limit and ensure the total annihilation of your opponents.\nA campaign waged over hundreds of islands against eight unique factions.\nA Story Mode where you can (eventually!) play 15 missions as each of the eight factions - a fantastic mixture of strategy, design and wild battles! Defend your fleet against waves of enemy forces in a series of extremely tough challenges that unlock new components.   An expansive multiplayer and co-op element is planned for the coming months!\nKey FeaturesDesign and build your fleet, fortresses and structures however you want. The alpha currently has over 400 unique components blocks, not including 29 different components for making missiles, torpedoes, depth charges and bombs.\nThe sky's the limit, you can equip your vehicle with - cannons, lasers, mines, bombs, missiles, torpedoes, propellers, rudders, jet engines, wings, hydrofoils, hot air balloons, anchors, fire control computers, blueprint spawners, repair bots, air pumps, automated control blocks and many, many more!\nRealistic physics - every block destroyed or added affects the vehicle's functionality, physics and control. Drag, inertia tensors, buoyancy and sealed compartments are all updated based on the design of your vehicle and the damage sustained.\nBe part of a fantastic community (http://www.fromthedepthsgame.com/forum), with new releases made on average once a week. Community organised challenges and blueprint sharing make it an extremely friendly place to hang out!\nCustomisable ComponentsThe customisable components in From the Depths allow a unique level of engineering customisation:\nDesign custom missiles, bombs, depth charges and torpedoes by combining various warheads types, fuse types, IR seekers, laser beam riders, laser designators, thrusters, navigation algorithms, fuel pods, sonar seekers, buoyancy compartments and propellers, to deliver a truly bespoke weapon.\nDesign custom cannons by combining four different barrel types and lengths with autoloaders, warhead types, ammo boxes and auxiliary components to create everything from AA cannons to howitzers.\nDesign custom AI by combing an AI mainframe with 'AI cards' slotted into motherboard blocks. Add radar detection, laser detection and tracking and local weapon controllers to give partial or full control to AI. Create anything from a fully AI controlled aircraft carrier to a battery powered drone.\nDesign custom engines using crank shafts, cylinders, carburetors, super chargers, exhausts and fuel injectors. Electric engines, generators and chargers are also available for backup power supplies and drones.\nSimilar systems exist for the creation of anti-vehicle and anti-missile lasers, as well as drills that can cut even the largest of battleships in half.\nWorkshop","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Brilliant Skies","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":6128,"name":"#IDARB","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f48/f48af1368eb7bbed7a8846bd06294670.jpg","description":"Prepare to battle everything from Moustache Cops to Breakfast, in this game inspired by fast action, 8-bit sports and arcade classics! Built with the input of thousands of crazed internet gamers, #IDARB is a chaotic 8-player eSport jumping future arena ball game. Create characters, teams, team logos, tournaments, even your theme music, in this highly customizable experience complete with disruptive “hashbombs” which dynamically change the game itself via Twitch and Twitter! IDARB supports up to a whopping 8 simultaneous local players, and up to 4 vs. 4, head-to-head online matches. Additional features include a mind-blowing single-player story mode, wild half time competitions, and unlockable recipes.#R##N##R##N#Begun as a crowd-sourced project, the game’s title is an acronym for “It Draws a Red Box” (IDARB). Thanks to thousands of suggestions via social media, the game evolved from one red box into the wacky amalgam it is today, complete with hundreds of strange “hashbombs”, secret commands which, when sent to the game via Twitch or Twitter, will disrupt and dynamically change the game in realtime! If there’s something you want that isn’t in #IDARB, it’s probably because you didn’t suggest it, but with so many customization options, you can probably still make it yourself!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":6078,"name":"Crazy Machines","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ac/9ac7d21cf4f5b929a9f3d0f228176582.jpeg","description":"Turn the crank, rotate the gears, push the levers, Use the catapult, explode it, or fly it...From grilling sausages with a pulley, gears, rubberbands and a candle to firing a cannon with a basketball, these wacky brain-teasers will light up your imagination with creative and addictive fun.\nKey Features:\t\t\t\t\t70+ Elements\nAddictive Fun!\n200+ Challenges\nDesign your own Puzzles with the Building Editor\nMultiple Solutions!\n3D Graphics & Real Time Shadows\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"dtp Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":5498,"name":"Lemmings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/347/347e1979dcf9b62dc48202b73317a186.jpg","description":"Lemmings are on the loose in High Definition!\nIt's time for the best Lemmings experience ever!\n-Guide green-haired critters through hazardous new levels.\n-Compete on the online global scoreboards, how many  Lemmings can you save?\n-All new musical score\nNow compatible with the PlayStation®Move motion controller!\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item's use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"3DO"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SEGA Master System"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"NES"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Atari ST"}]},{"id":2193,"name":"Sword Coast Legends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c04/c04e614c0a892abfb0c0ab6d735a7022.jpg","description":"Just Updated\nPlay the free Rage of Demons expansion now!\nVenture into the depths of the Underdark, through the trading outpost of Mantol-Derith, and fight alongside the legendary Drizzt Do’Urden! Rage of Demons is a free DLC expansion for Sword Coast Legends that includes hours of new story content; new Dungeon Master options; a new playable race: Tiefling; and a new playable class: Warlock!\nGather your party and prepare to delve into the Underdark, before the Rage of Demons consumes the Sword Coast!\n*Rage of Demons content in English only\nAbout the GameSet in the lush and vibrant world of the Forgotten Realms, Sword Coast Legends offers an all-new way to enjoy the time-tested magic of playing Dungeons & Dragons as a shared storytelling experience. With a deep narrative developed by a team of long-time industry veterans and a partnership with Wizards of the Coast, the single player campaign of Sword Coast Legends brings the world of Faerûn home like never before.\nSword Coast Legends also brings the roleplaying dynamic between players and Dungeon Masters to life with DM Mode, a first-of-its-kind real-time experience in which Dungeon Masters guide players through unique customizable adventures. In DM Mode, the Dungeon Master engages players and empowers them to have fun in a way that suits the party best while creating a tailored, non-adversarial 4 with 1 experience that any RPG or pen-and-paper fan will enjoy.Key Features:Single player campaign created by  members of the leadership team that brought you Dragon Age™: Origins\nChoose from five playable races and six unique character classes to build your own stalwart adventurer\nA return to form, SCL is the compelling and complex RPG you've been waiting for and features pause time, party-based tactical combat and involving storylines\nDungeon Master Mode: Create your own epic adventure to share with your friends, or enhance their experience in real time as they traverse your dungeon\nSet in the Dungeons & Dragons Forgotten Realms universe based on the fifth edition ruleset and populated with Dungeons & Dragons lore and legend","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digital Extremes","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":1379,"name":"The Legend of Heroes: Trails of Cold Steel II","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2b5/2b55fa9b23ba1324a5ae3998a28edcf2.jpg","description":"Peace is but a memory.\nIn the wake of the Noble Faction’s occupation of Heimdallr, civil war has broken out across Erebonia. The provincial armies, loyal to the aristocracy and the Four Great Houses, have claimed many of the nation’s great cities in the name of the Noble Alliance. The Imperial Army, called back from the four corners of the Empire, has only just begun its sweeping counterattack.\nAfter Rean managed to escape Trista with Celine and Valimar, he awakens in the mountains near his hometown uncertain what fate befell his friends, who bravely threw themselves in harm’s way to buy him time to flee.\nThough the road will not be an easy one, Rean decides to take up his sword again, journeying across Erebonia with his Divine Knight, Valimar, in search of his friends from Class VII and a way to end the conflict before its price becomes far too dear…\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTaking place on the same continent as the fan favorite Trails in the Sky offshoot of Nihon Falcom’s storied The Legend of Heroes franchise, Trails of Cold Steel II (Sen no Kiseki II in Japanese) is a direct sequel to Trails of Cold Steel, picking up one month after the decisive collision that changed the fate of the entire nation of Erebonia. The speedy, tactical turn-based combat with the newly-developed “ARCUS” system returns with all the bells and whistles together with the new Overdrive mode, new means of transportation both across the land and sky, new allies, new dangers, and a renewed sense of hope as Rean tirelessly works to right the wrongs that have led the country to disarray.KEY FEATURES\nA Direct Sequel that Remembers the Past\nClear data from Trails of Cold Steel carries over into Trails of Cold Steel II, granting players bonuses, and most importantly, remembering the many relationships cultivated during time spent at Thors Military Academy, allowing for more personalized conversations throughout the story.\nTake to the Land and Sky in New Modes of Transportation\nFast travel isn’t just for Trista anymore; a personalized airship now allows players to swiftly choose and descend upon both familiar and foreign destinations alike—and on land, horseback riding not only returns, but players can now customize and utilize Angelica’s orbal bike for fast transportation across the map.\nThe Link System Returns with a new Overdrive Mode\nBonding with allies continues to pay off with the Combat Link System, netting a variety of combat benefits including healing, guarding, and more, and the new Overdrive mode allows linked characters to attack up to three turns in a row for new strategic battle options.\nExperience the Game as Never Before\n50% more lines of English voice-overs have been added to the PC release, bringing a fresh experience to even those who have played it before on console. New features for this release include ultrawide aspect ratio support, turbo mode, and an instant resume feature that allows players to launch directly from Steam to their most recent save.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":616687,"name":"Bramble: The Mountain King","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1f/d1f058e4c29abbfbb2ce16c08f626e62.jpg","description":"“I felt I was face to face with nature, and I've never felt so small.”\n\nLetter from John to an unknown friend, 4th January 1902.\n\nThe tale of a young boy’s journey through a mythical land, to find his sister, and overcome his fears.\n\nSet in a world inspired by Nordic folklore, Bramble takes you on an adventure filled with atmospheric environments, mythical beings, and giant bosses.\n\nKey Features:\n\nTraverse the treacherous land of Bramble on an emotional journey to find your sister, all while uncovering the secret of a dark curse.\nStory-driven gameplay, cinematic moments, “David and Goliath” boss fights.\nEncounter mythical creatures such as Nacken, the Skogsra, trolls and gnomes.\nExplore landscapes and environments inspired by Nordic nature.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Dimfrost","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":64275,"name":"DYO","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17c/17c827c9988fa6d514a1d76c5928f238.jpg","description":"DYO is an award-winning local co-op puzzle platformer for one or two players in which you navigate two Minotaurs through a seemingly impassable maze and solve mind-bending puzzles. Each Minotaur is trapped in their half of the split screen – but only in a combined effort can they escape the cursed labyrinth.\nIn this impossible maze, you can merge both halves of the split screen into one and thus hop from one side of the screen over to the other. Use this ability to your advantage! It’s up to you to rearrange and manipulate the level structures of 30 carefully crafted levels in order to carve out a path to the exit. Many have tried to figure out the numerous mind-boggling challenges hidden in the depths of this cursed labyrinth. Will you be the first to solve them?\nTeam DYODYO started out as a holiday project of four Game Design students in 2014. Since then, DYO has come a long way: It’s 2018 and – after winning several awards and having been exhibited all over the world – DYO is now finally available on Steam. So grab a copy, grab a friend and get ready for 30 levels of mind-bending puzzle action!FeaturesGood old local co-op fun for 1 or 2 players.\nMerge and split your screens to manipulate the level around you.\nNo precision platforming. No enemies. No timers. Just you and your brains.\n30 levels (3-4 hours of playtime) of mind-bending puzzles and more to come.\nFind multiple solutions to each level (some of which not even the devs might know of).\nDon't have two controllers to play with your friend? You can also play on one shared controller!RecommendationFor the best DYO experience, we recommend playing with a friend!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Team DYO","platforms":[{"id":0,"name":"PC"}]},{"id":28537,"name":"N+","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4e/e4ec7e2bc6cf1c4ce81c455517702e3a.jpg","description":"Single Player, Local Multiplayer 2-4, HD (High Definition). Upgrade now, and quench that aching thirst for more intense platformer action! The full version features more than 400 levels, a custom level editor so you can build your own challenges and share them with friends, access to leaderboards, achievements, the ability to upload your high-score runs, several delicious flavors of multiplayer, several new enemies, and the ultimate test of your amazing ninja skill. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Metanet Software","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"}]},{"id":25557,"name":"Super Mario RPG: Legend of the Seven Stars","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/384/3848abcd66c93552e46647c3db985f30.jpg","description":"A mysterious enemy named Smithy has appeared, forcing Mario and Bowser\nto fight as allies. Journey across a wide variety of locations and\ntackle a mixture of obstacles that will require both timing and strategy\nto overcome. Gain experience, grow more powerful, and meet new\ncharacters to use their abilities in taking down Smithy and his gang!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Square","platforms":[{"id":0,"name":"SNES"}]},{"id":23516,"name":"Sniper Fury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12e/12e8bdf2c9fcf5389ce5e01ec93d2567.jpg","description":"Update NotesWORLD DOMINATION – Help your clan gain the favor of powerful factions and gain powerful perks in return.\nCLAN LEADERBOARDS – Check your clan’s victories and push to the top to win the war!\nSPIN THE WHEEL – Brand-new system to win unique daily goodies, just 30 seconds away. Try it now!\nCRAFT-PARTS UPGRADE – Need better craft parts? Combine your old ones to fit your needs!\nMORE BASE-DEFENSE OPTIONS – Brand-new options to cement your defenses: Enable the Decoy or place your Floodlights to blind your attackers.\nAbout the GameINITIATING GLOBAL OPERATIONS:\nThe time for diplomacy is gone. We are calling for the best sniper in the world to join us as we take aim at evil, wherever it hides. This is not a game. There is no room for remorse here, so shoot to kill.\n\nA STUNNING FIGHT AGAINST EVIL\n• 130+ missions.\n• Soldiers, armoured vehicles, air units and many more enemy classes.\n• Next-gen “bullet time” effects capture your every amazing sniper headshot.\n• Sandstorms, blizzards, rainstorms and other rich atmospheric effects.\n\nMODERN FIREPOWER\n• Shoot sniper rifles, assault rifles, railguns and top-secret weapons\n• Gather components to upgrade your military arsenal\n• Unique weapon personalization\nPVP MULTIPLAYER CHALLENGE\n• Steal resources from other players by breaking down their defenses in PvP Multiplayer mode\n• Build a strong squad to keep your loot safe in PvP Multiplayer mode\nEASY TO PLAY, MUCH TO MASTER\n• Varied AI behavior makes each enemy unique and challenging to shoot & kill\n• Extra rewards for joining the action in special events\n• Connect to the game community to discover more content, more contests and more rewards!\nLEAGUES\n• Earn a high enough score to enter a league and unlock rewards! Then check out who's top of your league on the Leaderboards. Guard your gold and secure your position using the brand-new SHIELD defence system.\nCLANS UP FOR GRABS\n• Join or create sniper Clans to team up with other players.\n• Trade and share resources with your Clan mates to strengthen each other.\n• The group Chat lets you talk strategy and socialise with your allies.\nCLAN HQ\n• Establish a home base for your Clan that members can help improve together. Clan HQ buildings can unlock loads of perks, including PvP boosts, Tier-5 Squadmates and much more.\nCLAN WARS\n• Prepare for a new game mode where Clans go head-to-head in the ultimate showdown. Declare war, weaken the opposing clan's Reactor Core, and pillage resources from them!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21249,"name":"Luxor 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/516/516f1a40a97ee662535c7d7db7009119.jpg","description":"The much anticipated sequel to the #1 casual game of 2005, LUXOR 2 sets the new standard for action-puzzlers. LUXOR 2 takes you on a beautiful voyage through 88 all-new, gorgeously rendered levels set amongst the pyramids of ancient Egypt. Use your mystical winged scarab to shoot and destroy the approaching magical spheres, and to help you shoot them down, Luxor 2 features more explosive power-ups than ever before.\n88 explosively challenging and gorgeously 3D-rendered levels, taking casual games to the next level\nFour invigorating levels of difficulty, including the expert level that unlocks the mind-blowing Challenge of Horus\nOver 80 new statistics and badges, plus bonus rounds at the end of each stage\nNew ranking system to let players work their way from Farm Hand to Pharaoh\nThree stimulating modes of play, including the new Survival and Practice modes\n13 explosive and unique power-ups, including the new Color Cloud, Net, Dagger and Lightning Storm, to help shoot down the oncoming enemy spheres\n13 intense and rewarding bonus rounds at the end of each stage in the game","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":21216,"name":"Small Town Terrors Pilgrim's Hook Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d81/d8139d932610bbfd46aef9bf0ee2f6b7.jpg","description":"A visit to Pilgrim’s Hook is the last thing you wanted. You vowed never to return to your childhood home. The only person that could ever compel you to come back summoned you with an unexpected phone call. How could you not answer his desperate plea for help? You must go back and save your twin brother from the deadly menace that lurks below the island.\nThe horror begins at land’s end and spreads its wrath over land like a web of suffocating tentacles.  A tide of terror has attacked Pilgrim’s Hook. Few townsfolk remain and the ones who do appear to have gone mad. A diabolical power eats away at those who dare to resist the call of the sea.\nYou could fall prey too. A mysterious underwater force threatens you with ominous words. “I keep everything that comes to me through the sea. I think I will keep you and your brother both,” the voice resonates like the echoes of a living nightmare.\nDefy destiny of doom. Your dear brother’s fate is in your hands.  Only you can free Arthur and the townsfolk from the perils of doom.\nDive in if you dare and brave the depths of Pilgrim’s Hook. Encounter colorful characters, a kingdom of ocean life, mesmerizing aquatic sound effects and hauntingly realistic maritime scenes.  You alone can unravel the mystery and break the horrific spell.\nYou are the last hope in this decades long struggle between good and evil, sand and surf, and land and sea. Turn the tide of deadly danger that lurks below the troubled shores of Pilgrim's Hook.FeaturesReveal the clues, piece them together, and solve the mystery of Pilgrim’s Hook!\nDiscover life-saving clues and solve unusual puzzles\nFind dozens of morphing sea creatures: starfish, lobsters, crabs and more\nEarn a collection of sea-based achievements\nInteract with the inhabitants of Pilgrim’s Hook, from the  seaman and  priest, to the  bartender and the townsfolk\nSearch Pilgrim’s Hook for missing whale bones\nWork with an integrated strategy guide\nBonus chapter Beneath the Sea","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gunnar Games","platforms":[{"id":0,"name":"PC"}]},{"id":20914,"name":"Navy Field 2: Conqueror of the Ocean","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ba/3ba27a3174b80519e1b597eb66cf5293.jpg","description":"Building upon a foundation of epic naval battles set to historically accurate backdrops, Navy Field 2 provides intense real-time strategic combat, genuine historical details, and an ever expanding sea of content for seasoned veterans and newcomers alike.\nSeveral nations with rich naval histories are presented for the creation of your ship’s crew; these include, the United States, United Kingdom, Japan, Germany and more to follow. Each nation offers a unique set of ship strengths and attributes for further strategic development. Crews are customized to reflect your style of play through an in-depth RPG-style sailor leveling system.\nA fleet of fully customizable WWI and WWII era naval vessels from various nations are at your command in Navy Field 2. Each ship, from the lowly frigate to the massive battleship is painstakingly modeled in accordance to historical detail. Modify your ship’s decks, shell types, guns, engines, sonar, and more to suit your play style. Experience a whole new perspective through the variety of vessels at your disposal including: frigates, destroyers, light-cruisers, heavy-cruisers, submarines, aircraft carriers, and battle ships.\nForm a fleet of friends or quickly engage in massive real-time naval battles through a quick auto-matching system. Develop your skills through use of various tactics depending on ship type and role. For example, you can delve into the heat of battle with the quick maneuverability of the smaller frigate and destroyer class ships, use a submarine to sneak into enemy territory for a surprise torpedo attack, sit back and carefully plan fighter and bomber squadron flights from the deck of your aircraft carrier, or carefully aim immensely destructive long-range salvos from a battleship!\nJoin us on the field of Navy Field 2Features IncludeImmediate real-time large scale PvP online naval battle engagementsRichly detailed 3D ship models, immersive sound effects, and adaptive musicThoughtfully balanced fleet of authentic WWI and WWII era naval vessels, each with unique abilities, and roles to playIntuitive automatic and manual controls with fully customizable hot-keys for personalizationRepresented nations include the United States, Great Britain, Japan, and GermanySelections of battle modes promote cooperative, strategic, and skillful gameplayFleet and platoon support to drive community interactionAdditional nations, ships, maps, and features planned for the future","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SDEnterNet","platforms":[{"id":0,"name":"PC"}]},{"id":20726,"name":"The Settlers Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f04/f04e42aba22b0e655a3677d02efa7e1a.jpg","description":"Inspire and lead your settlers, gather resources, construct houses, and expand your kingdom in The Settlers Online.\nThe Settlers Online combines popular gameplay elements with brand new additions and improvements. Seize territory and explore in a gaming experience built for everyone to enjoy, from ‘The Settlers’ newbies to old-school gamers. Build your city brick by brick, and lead it to glorious prosperity! It takes a great leader to build a great city, and you'll have to optimize your production chains and lay out the perfect infrastructure. Don’t worry though, as guides and guilds will help you along the way, and also provide higher level challenges of increasing importance, as you establish your reign in the realm!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20421,"name":"Momodora III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5b2/5b29aec90c238aa3f11a6b6023ff7190.jpg","description":"Momodora III is a classic action platform game with a variety of items and secrets.\nIt's the third installment of the Momodora series, although playing the previous titles is not necessary to enjoy the game!\nThe game takes a departure from the style of Momodora II and focuses more on linear level design, similar to the first title in the series.\nIt follows a simple story revolving around sudden weird apparitions at the village of KoHo.\nThe people of the village send two priestesses, Momo and Dora, to investigate the matter.\nFeatures:\n-6 regular stages, plus one secret stage!\n-Items that allow you to customize your way of playing\n-Difficulty selection\n-Several secrets, and more!!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bombservice","platforms":[{"id":0,"name":"PC"}]},{"id":20179,"name":"Warside","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4bb/4bb8633c205b931183f1a9aa90d7206f.jpg","description":"Warside is a visceral multiplayer Sci-Fi shooter featuring classic 2D gameplay combined with RPG elements. Play as part of a small squad of elite troops fighting for resources and power across the galaxy.\nCreate your own elite soldier and take him in to online battle in this visceral multiplayer Sci-Fi shooter. Use your unique abilities in full blooded combat with other players as well as hordes of monsters and gain tactical battlefield advantages over your enemies by hovering in mid-air, covering great distances in a single leap and hanging on walls to ambush your enemies. Use the flexible RPG system and wide array of equipment to advance and customize your character.\nFast-paced 2D action and an advanced RPG system allowing players to rely on their character’s unique stats and their own skill level in equal measure.\nUtilize the landscape and a variety of movement styles to gain a tactical advantage over your enemies. Combine different character classes and equipment in your team to achieve the best results.\nHeavily customize your character with different class types, specializations, weapons and armor types. Play as a bulletproof titan or as a deadly assassin. Become a swift infiltrator or a balanced fighter. Create a unique character that will fit your play style.\nHundreds of weapons available, from common assault rifles to futuristic ion launchers. A huge array of armor types, from lightweight protective vests to heavy exoskeletons. Customize your character using various implants, upgrade your weaponry with weapon attachments, and use gadgets to access special skills in combat from poison-arrow crossbows to stationary energy shields.\nGo head-to-head with enemy teams on top of giant tree canopies. Seize control points on a cavernous space station. Gather resources in the ruins of an imperial city. Defend valuable artifacts in the dark caverns. Fight hordes of homicidal robots and treacherous bosses in a secret laboratory. Hold your ground against waves of enemy mercenaries during the evacuation of an underground bunker. Those are just some of the exhilarating game missions available with many more to follow!\nFeel free to ask any questions and leave your feedback here and on our site: https://warside.ru/en","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kraken Games","platforms":[{"id":0,"name":"PC"}]},{"id":20106,"name":"Running Shadow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba6/ba64a64018e0c36df54a12ddc5c584cf.jpg","description":"Running Shadow is a unique mix of a runner and fantasy RPG. Along with the simple game mechanics typical of this game type, it has a mythical plot full of secrets and intrigue.\nYou will try on the role of a fortunate thief and assassin in possession of a unique artifact: the Gauntlet of the Celestial Guardian stolen from the adepts of a dark and ancient cult. You will be gifted with wondrous and unique abilities, too. Get ready for an unending adventure full of risk: age-old castles, gloomy dungeons and treacherous enemy ambushes, dozens of most fascinating levels and unique quests. Enter the path full of danger and win the title of Master Shadow!\nFeatures:\n- Intriguing locations: noblemen’s castles, bandit layers, sewers, town prison, and many others\n- More than 20 unique characters, including elves, goblins, and majestic draconids\n- More than 8 outfits for the main hero, including swords, armor, and masks\n- Unique battle system: regular foes which you can fight with your sword, and the nefilims which are subdued by magic only\n- Secret elven tricks that you can learn to overcome obstacles\n- Special magic abilities which will let your character become a shadow, restore his mana, replenish his health and increase his rage while fighting the enemies; and, of course, the powerful Gauntlet you can also use in the battle\n- 300 collectible items which you can gather while fulfilling your quests","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Game Insight","platforms":[{"id":0,"name":"PC"}]},{"id":19051,"name":"Requiem: Avenging Angel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3d90573783bb0319cf828ab727270eb.jpg","description":"Requiem: Avenging Angel is a 3D, first-person action game of biblical proportions set in a world under siege. A holy war rages on Earth between Heaven's Chosen Soldiers and Hell's Fallen Angels. You are Malachi, a Chosen Angel, sent to Earth to save Creation from the wrath of the Fallen. Blast your way through an immersive futuristic 3D world developing Angelic powers like possession, blood boil, locust swarms, and the ability to turn your enemies to pillars of salt. Without you, mankind doesn't have a prayer.Features:All the heart-pounding action of a top shooter, with a rich story line and realistic character interaction\nFight demons and hell's minions using rare angelic powers, including: Bloodboil, Lightning, Flight, Holy Light, and Turn to Salt\nTake up arms against the dark horde of the Fallen and utilize 7 unique weapons of the plane of Creation, including: the “Trinity” Combat Shotgun, “Beelzebomb” Grenade Launcher and “Revelations” Railgun","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Cyclone Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16853,"name":"Zombie Tycoon 2: Brainhov's Revenge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ce/1ce1f4f82737a747e5ca668a3b4c6861.jpg","description":"Choose your side in the epic war between two masterminds of Evil: apprentice-gone-rogue Orville Tycoon and his army of heavy-duty zombies, or his vengeance-thirsty mentor Professor Brainhov and his rioting mass of twitchy brain-munchers.\nTriumph over other players in adrenaline-charged MULTIPLAYER DEATHMATCHES and seal the fate of the last survivors of Finkleville in the SINGLE PLAYER CAMPAIGN as you:\n- STRATEGIZE the perfect combination of 6 different types of zombie squads: samurai, scavenger, scout, engineer, brawler and cleaner\n- CONQUER the massive multiplayer map\n- MASTER the badass Monster (Hero unit) that best fits your play style\n- UNLEASH a huge horde of zombies on your opponent with the ultimate Dead Rush ability\n- EXPERIENCE a thrilling storyline that sets classic hulking zombies against frantic modern zombies\n- DEFEAT the epic bosses to prove your worth as the true alpha mad scientist\nPick your faction, Monster, strategy, and find out who gets to become King of the Undead!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Frima Studio","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":10395,"name":"Impossible Creatures","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f96a02f9764e562743637fd86beeaa6.jpg","description":"Update NotesPatch 3 not only brough more bug fixes but adds Workshop support to Impossible Creatures. Together with the great possibilities of the SDK (even with full C++ support) and the mod tools now the highest level of mod support comes with IC.\nWe hope to soon see some more great creations from the IC mod community!\nFull list of changes can be found here:\nhttp://steamcommunity.com/games/324680/announcements/detail/598224818526633340\nAbout the GameSet in a fantastic 1930s world, “Impossible Creatures” is a 3-D, real-time strategy game by Relic Entertainment the creators of Homeworld, Dawn of War and Company of Heroes that pits the player against an evil villain in a desperate campaign across a chain of remote and diverse islands.  Using Earth’s most formidable animals as building blocks, the player must create an army of genetically-altered mutant monsters in a titanic struggle to protect an unsuspecting world.\nSteam Edition Features:\nFully remastered to work with modern systems\nInsect Invasion, Mod SDK (C++) and all patches included\nRe-implemented multiplayer and NAT traversal for a smooth online experience\nSteam Friend invite implemented\nSteam cloud support\nKey Features:\nThousands of units:  “Impossible Creatures” has more than 50 animals that can be combined to create a vast number of mutant creatures, the results of which are limited only by players’ creativity.\nStrategies as boundless as your imagination -- By building these creatures into powerful and effective armies, players can define their strategy and how they want to tackle their opponents.\nExplore rich 3-D worlds – The highly detailed, fully 3-D dynamic world allows players to battle in four richly detailed environments, each with special flora and fauna.\nCompelling single-player campaigns – Players command dozens of creatures, and henchmen in 15 missions across 14 distinct islands.\nUnprecedented replayability – “Impossible Creatures” offers boundless creature combinations, armies, and strategies as well as online play and an easy-to-use mission editor that provides limitless play options.\nUnique multiplayer options – Up to six “Impossible Creatures” players will be able to wage war in real time. The multiplayer component will streamline base-building, allowing players to build creatures offline and store them for future online battles.\nTransferable units – Players can refine their armies in the single-player campaign, and test their strategies with the same armies in a multiplayer game.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"}]},{"id":4454,"name":"Touch My Katamari","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/431/431689983e1e0f96c6a4ecb1744b3cce.jpg","description":"Roll everything from tiny ants to skyscrapers in this exhilarating 'Shape-changing and Ball rolling' title. Use the touchscreen or the traditional controls to roll! Change the ball's shape with the flip of your fingers, expand the ball on a vast space or squeeze into gaps. Challenge more missions by downloading more contents! See if you can break the records of friends around with the 'near' application. Packed with addictive features such as collection, shopping and many more!\nTouch My Katamari ™＆©2011 NAMCO BANDAI Games Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PS Vita"}]},{"id":3431,"name":"TRIVIAL PURSUIT LIVE!","genre":"Family","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75a/75af05ef583575f5242218d3143e9dbe.jpg","description":"A modern twist on the world’s most well-known trivia game! Trivia has never been so much fun.  A more modern look, new reinvented question types, and the world’s best questions from the world’s top trivia authority.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\nTRIVIAL PURSUIT is a trademark of Hasbro and is used with permission.  © 2014 Hasbro. All Rights Reserved. Licensed by Hasbro to Ubisoft Entertainment. Ubisoft and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries. Games software © 2014 Ubisoft Entertainment. All Rights Reserved.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"}]},{"id":3173,"name":"EA SPORTS NHL 16","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ef/9eff74427541e502c1587a33f08dfca5.jpg","description":"Built with more input from our fans than ever before, NHL 16 steps onto the ice to deliver new features across the most played single player and team modes, including a re-imagined EA SPORTS Hockey League.  Combined with new gameplay balance and innovation at every position and an unrivaled game day authenticity, NHL 16 puts you into the heart of a team, where you play together and win together.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-4 players\nNetwork Players 2-12\nDUALSHOCK®4\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks of Electronic Arts Inc. NHL, the National Hockey League, the NHL Shield, the word and image of the Stanley Cup and the word mark NHL Winter Classic are registered trademarks and the NHL Winter Classic logo is a trademark of the National Hockey League. All NHL logos and marks and NHL team logos and marks depicted herein are the property of the NHL and the respective teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. © NHL 2015. All Rights Reserved. Officially Licensed Product of the National Hockey League. National Hockey League Players' Association, NHLPA and the NHLPA logo are trademarks of the NHLPA and are used under license by Electronic Arts Inc. © NHLPA. Officially licensed product of the NHLPA. All other trademarks, copyrights and other forms of intellectual property belong to their respective owners.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":911543,"name":"Amnesia: The Bunker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a45/a45abc50643f0fa355f5cb24cbb94744.jpg","description":"Amnesia: The Bunker is a first-person horror game from the makers of SOMA and Amnesia.\r\nLeft all alone in a desolate WW1 bunker with only one bullet remaining in the barrel, it’s up to you to face the oppressing terrors in the dark. Keep the lights on at all costs, persevere, and make your way out alive. A truly intense horror experience.\r\nRISING TENSION\r\nImmerse yourself in the multiple ways of tackling survival. In the shoes of the French soldier Henri Clément, you are armed with a revolver gun, a noisy dynamo flashlight, and other scarce supplies to scavenge and craft along the way. With randomization and unpredictable behavior, no play-through is the same.\r\nHunted by an ever-present threat reacting to your every move and sound, you must adapt your play-style to face hell. Every decision will change the outcome of how the game responds. Actions bear consequences.\r\nESCAPING THE NIGHTMARE\r\nSolve things your own way in a semi-open world. You must explore and experiment to make your way out. Figure out what’s going on down here - what has happened to the other soldiers? Where have all the officers gone? What diabolical nightmare lurks underneath this hellscape? Unravel the mysteries of the Bunker and get to know the nooks and crannies of this cruel sandbox to up your odds of survival.\r\nFEATURES\r\nDynamic and ever-present monster that reacts to player actions.\r\nConstant tension - Time is not on your side.\r\nTactile and physics based interactions with the world.\r\nScavenge for resources and craft tools to aid your survival.\r\nMultiple solutions to problem solving in a non-linear open world.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Frictional Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":850698,"name":"Like a Dragon: Ishin!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/472/4722e05c50b9ffe9b984dce11fce82c7.jpg","description":"1860s Kyo is plagued by widespread inequality, and one samurai will change the course of history in his search for justice. Take up the sword of Sakamoto Ryoma and venture to Kyoto to find your father’s killer, clear yourself of a framed murder, and restore your honor. In doing so, you will bring an end to the samurai era and forever change the future of Japan. Draw your blade, load your revolver, and join the revolution in this heated historical adventure that only the creators of Yakuza: Like a Dragon could produce.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":720945,"name":"Expeditions: Rome","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43d/43dbdae2946946373d2c52d6c54ded21.jpg","description":"The future of Rome is in your hands: what will your legacy be?\nTake on the role of a young Legatus whose father was murdered by an unknown political opponent, forcing you to escape Rome and take refuge in the military campaign to subdue a Greek rebellion. Step by step, you increase your military prowess, strengthen yourself in the forge of combat, and become the Legatus everyone learns to both respect, and to fear. In Expeditions: Rome, you exert the will of Rome through your actions across the world stage, from the bright blue coasts of Greece to the deep forests of Gaul. Decide how people will view you, and Rome. Will you strike with an iron fist, or speak with a silver tongue? Will you embrace the political heritage of the Republic, or carve your own path as you navigate the complex politics of the Roman Senate? Every choice matters as you decide the fate of your legion, your close companions, and of Rome itself.\n\nCreate your own Roman Legatus! Customize your character’s look, gender, class, and skills to match your playstyle and role-playing fantasy\nEngage in tactical turn-based combat powered by an extensive skill-based action system where every weapon changes your potency on the battlefield\nAdventure with 5 unique companions discovering their extensive backstories and unique personalities\nExplore a beautifully realized, colorful world across many different environments, including North Africa, Greece, Gaul, and Rome herself\nExperience a historically inspired story of political intrigue and personal drama through a fully voiced narrative where choices matter and consequences are far-reaching\nLevel-up each character and select from a variety of skills and passive abilities to explore a wide range of tactical options\nLoot, Craft, and Equip a variety of weapons, armors, and tactical items to customize your game even further, providing a tremendous range of tactical options for each character\nLead your legion on 3 extensive war campaigns across Greece, North Africa, and Gaul. Recruit legionaries, improve your warcamp, conquer regions, exploit resources, and defend your territories as you lead your legion to victory","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Logic Artists","platforms":[{"id":0,"name":"PC"}]},{"id":389004,"name":"Kyle is Famous","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eed/eed7410295fe1a4899430327f522823e.jpg","description":"Take Control of Kyle in this Text-Based Adventure. . .\n-----------------\nMake decisions for Kyle that will affect every part of his day. Take Kyle's hand through 21 unique endings, each determined by what Kyle has done and who he has interacted with. He needs you. Be kind.\nKyle just woke up. . .\n-----------------\n. . .and Kyle needs to prepare to conduct an interview with a very, very important guest on his show. Collect items, make choices, and solve mysteries.\nKyle can swallow the fridge. . .\n-----------------\n. . .and Kyle can travel time and steal from the locals and dump lard on his neighbor and many, many other things that KYLE SHOULD NOT DO. Take Kyle's hand. Direct him. Tell him what he ABSOLUTELY SHOULD NOT DO. Confidently help Kyle. He needs you.\nKyle has 21 endings. . .\n-----------------\n. . .but only one of them is the good, well-prepared ending that you are going to guide Kyle to. Who knows what would happen if you weren't there for him? Would he destroy the city? Gossip about his neighbor? Fight crime? Revive a dead loved one?\nBe alert. . .\n-----------------\n. . .and be careful. Things may not entirely be what them seem. . .\nAnd on a more personal note. . .\n-----------------\nThanks for checking out my game! I'd like to continue doing smaller-scale projects like this and release them for free. If you'd like to see more or give me a hand in developing, make sure to hit up any of my social media, found on this page!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"John Szymanski","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":373621,"name":"Firestone Idle RPG","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/373/37310ba390c1936378ef23a6992e5792.jpg","description":"Firestone Idle RPG is set in the fantasy world of Alandria, where Undead and Orc forces have gathered again to bring chaos and disorder to the realm. This time, they possess the great power of the Firestones. The King has trusted you to assemble a party of heroes in order to stop them, reclaim the firestones and save the kingdom.Key Features\nHeroes\nHeroes are the champions of the realm. They are separated in Classes (Warrior, Mage, Priest, Druid etc) and Specializations (Damage dealer, Tank and Healer). Each hero has unique battle abilities that can be activated by using the hero resource (Mana, Rage or Energy).\nParty and Battle Formation\nLike in all classic RPG games you can assemble a party of 5 heroes to fight for you. In the party you need to deploy the best heroes and classes as the battle formation of your party is essential to ensure victory.\nGear\nYour heroes are as strong as their gear! Find and equip your heroes with the best gear. Upgrade its rarity and enchant it to make it more powerful.\nGuardians\nGuardians are divine creatures. Angels and Dragons that you control to destroy your enemies! Unlock guardians and evolve them so they can reveal their true power.\nMap\nSend your squads into multiple types of missions and claim unique rewards as you free the land of the evil forces.\nTown\nAt the town there are several buildings, each one is a unique mechanism that you can unlock to expand your gameplay. The Alchemist, Library and the Magic Quarters are just a few of them.More FeaturesResearch the ancient knowledge at the Library\nConduct alchemy experiments\nTrade with the exotic merchant\nCollect Firestones and start over via the Prestige mechanism to progress further\nIn game Chat\nYour king summoned you. Will you answer the call?","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Holyday Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":355232,"name":"Zero Hour","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1c/a1cf2a32417641639094126a79e1237f.jpg","description":"Welcome To Zero Hour\nZero Hour is officially up for grabs in Steam! Jump in and experience true online tactical gameplay. We want to thank our community for the tremendous support and patience everyone has shown. Join our discord and get closer to the community and the game’s development. We hope you enjoy the game! We would like to clear a few things before you head in to make sure you have the optimal experience.\nRegions\nPlease make sure you select your proper region to get the best ping possible. You can always change the region through the settings>Gameplay menu. Also make sure if you are playing with friends that you all are in the same region to make sure no one is left behind when queuing for a match.\nKey Binding\nKey Binding works but still can cause issues for few individuals. For them the best way to make sure you do not face issues in binding (as for now you cannot bind in game); please make sure that you don't bind an action with a key used in another action. If you want to do so, please change that binding to another key before changing your preferred action key.\nTraining Ground\nWhen you get in the game you will be first required to go through training, make sure in training you set up your sensitivity and basic settings. Go through the kill house which is in the other room. For the kill house follow the arrows to start in correct order. There are 21 targets in the kill house, many taking corners. If you miss one of them the trial will fail. Even if trial fails you can still head back to main menu and start quick match.\nVoice Chat\nAlways use the voice chat to cooperate with your team members, as it is very important in our game. Not having proper team communication can lead to losing rounds.\n101 Trailer\nRevise and go through the 101 Trailer 1 more time before heading in as it explains many of the features in game. It will really help you head starting the game.\nLink : https://youtu.be/DQgTJTTff9s\nBomb Defuse\nIn Bomb game mode, As an attacker you are required to defuse the bomb after the Time says \"1:20\" remaining. Even if the enemy team is taken down, you will need to defuse the bomb.\nWe really hope you enjoy the game and we really appreciate everyone's support!Roadmap\nThe roadmap we have prepared for Zero Hour consists of new maps, bug fixes and new features.\nRegarding new maps, we have plans to add 4 new maps to the game with its location being in Bangladesh. Each map will have it’s own unique story with various gameplay procedures\nWith bug fixes, we will always keep an eye out for bugs occurring for players as they post it in our community groups. In addition, we will pay close attention to any necessary changes or tweaks regarding the game via community feedback.\nIn the near future, we have plans to add PVE, co-op game modes, along with upgraded animations which is vastly requested by the community. We will rework a few maps in order to fix flaws to enhance smooth and polished gameplay.\n#Update 7.2.2_notesNew Update 7.2.2PART 1\nBriefs\nWith this update we are trying to counter the toxicity issues being faced by new and veteran players. We are trying to find ways to improve the experience and fix bugs noted by the community since the launch week. This is only the Part 1 of the updates, Part 2 will try to improve on more aspects in the coming days.\nDue to the issue of reconnect still not being fixed, League matches will be further delayed.\nUpdate Logs\nAdded Log\nAdded Profanity Filter for Clan Tag\nAdded Vote System to vote \"Abuser\"\nAdded Team Mate mute Option\nAdded Match MVP Screen at the end of the match\nAdded New 5 Tier Badges\nAdded Auto Deafen for using profanityFixed Log\nFixed Vault Trigger Teleport issue\nFixed Team killing with grenades still being possible after Team kill penalty\nFixed Bomb Defuse Points not being accounted\nFixed Hostage Rescue Points not being accounted\nFixed Dead body angle orientation\nFixed throwing grenade if press \"G\" during chat\nFixed Unlimited Damage after round ends\nFixed Spawn Peek Locations founded by Ryzer\nFixed Ping can cause selection menu to have issues\nFixed cannot change the planning table controls\nFixed Map 1 balcony no detectionChanged Log\nIncreased Shield Melee Damage to 100\nIncreased Anti Spawn peek measures from 5 seconds to 30 seconds\nReduced Spectate Camera Filter\nRemoved the ability to Melee glass during Preparation phase\nRemoved ability to throw gadgets outside the operation building during the Anti Spawn Peek Measures\nRemoved Team color code for kill feeds\nThanks for your patience and support, there is more to come with Update Part 2!\nAbout the Game\nA tactical FPS with online team-based action game play that takes place in a variety of locations in Bangladesh with Real-life scale & resource management. Inspired by various other tactical shooter games, Zero Hour tries to bring a very grounded Team vs Team experience in locations with real-life scale (no video game scale) and resource management. Both sides are tasked to wipe out the other team and complete objectives. The defenders are tasked to protect the bomb from being defused and keep their hostage from being rescued and running away. On the contrary, the attackers are to defuse the bomb or rescue the hostage held captive\nTACTICAL GAMEPLAY\nZero Hour brings a very grounded 5v5, team vs team, Close quarter combat experience to the game that focuses on two teams with each player having their own roles. The attackers utilizing shields, weapons and the planning table and the terrorists utilizing traps and gadgets in order to fortify the area.\nPLANNING TABLE\nAt the start of each round, MS-09 Unit (The Attacking Team) can come up with strategies by drawing in the planning table with a 3D miniature version of the location being played similar to the use of blueprints. It can be used to direct teammates where to spawn and/or advance from. There are 3 types of marker that you can place around the planning table which can indicate danger and objectives. During this phase, The Terrorists (The Defending Team) will be given time to place traps and gadgets to aid in their defense strategy.\nRESOURCE MANAGEMENT\nBoth Teams have resources that they need to manage per 3 rounds. The Attacking Team has 2 sets of 5 types of weapons while The Defending Team has 5 sets of 5 types of gadgets. This is crucial in terms of saving your resources, picking up and utilizing your opponent’s weapons, and not giving an advantage to your enemies\nHOSTAGE\nThe hostage held captive by the defenders will have its own mindset which means it would run away if not careful. This indicates that it would be critical to keep an eye on the hostage and move it around wherever a player feels necessary.\nDOORS\nIn order to bring a realistic approach, the doors help in encouraging slow and tactical gameplay. It would cause both teams to hesitate before entering a room since it will be oblivious to know what’s going on behind the door.\nBREAKER SWITCH\nThe switch causes a complete blackout of the whole operation building that you're playing on. By doing this, the players won’t be able to visualize their surroundings unless they use the tactical flashlight.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"RESETgame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":62520,"name":"Shantae: Half-Genie Hero Ultimate Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fa/6fa0b933431114c24980219204923bc7.jpg","description":"Shantae embarks on her first full HD adventure! When a mysterious crime wave sweeps Sequin Land, it’s up to Half-Genie Hero Shantae to save the day! Use Shantae’s devastating Hair-Whip Attack to send monsters flying, or Belly Dance to transform into a more powerful creature form! Topple the masterminds behind each criminal caper and prepare for the ultimate showdown against Shantae’s arch nemesis - the bodacious buccaneer Risky Boots!\nKey Features:\n• Shantae’s trademark moves return! Dance to transform into all-new and classic creatures, or summon magical attacks! Over a dozen dances to discover in all!\n• New Relic System allows players to unlock new powers and customize moves for Shantae and her many forms!\n• Conquer arcade-style action stages that unfold into a full world to explore. Fast action and quest-style exploration rolled into one!\n• When Shantae’s story ends, you’re just getting started! DLC Modes introduce new characters, levels, and bosses!\n• Huge Bosses, humorous dialogue, and the wonderfully weird Shantae cast return, now in fully animated HD!\nThis all-inclusive version comes with all of the previously released DLC, Modes, and Costumes!\nSave the day as belly dancing half-genie Shantae! Conquer Sequin Land as the evil Risky Boots in ‘Pirate Queen’s Quest’! Swap between Sky, Bolo, and Rottytops in ‘Friends to the End’! And finally, wall-jump as Ninja Shantae, soak up sun as Beach Shantae, serve justice as Officer Shantae!\nAlso includes Tinkerbat Transformation, Blue Shantae & Classic Risky costumes!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":49079,"name":"STAR OCEAN - THE LAST HOPE - 4K & Full HD Remaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/51f/51f3531f4e4a5927fffb4c10d989f952.jpg","description":"Day-One Edition\nDay One edition - The game will launch on November the 28th with a 10% discount and a mini-soundtrack (offer to last 2 x weeks until Dec 12th)!\nAbout the GameSTAR OCEAN - THE LAST HOPE - 4K & Full HD Remaster Coming soon for STEAM!\nFrom the creative minds of Square Enix and tri-Ace, STAR OCEAN - THE LAST HOPE  takes place at the very beginning of the Star Ocean series.\nThis action-packed RPG takes players on the epic journey of mankind’s last stand, with exploration and battle across some of the most mysterious, dangerous and fantastical worlds of the universe.\nEarth has been decimated by World War III and now humanity must turn to the stars in search of a new home. Explore the galaxy on your quest, make allies and enemies among the alien races you encounter and uncover a danger so great that it threatens all of creation.\nSpectacular New 4k and Full HD Visuals\nExhilarating Real-time Battles\nA universe of adventure and danger await in the great Star Ocean!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20294,"name":"NotGTAV","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b61/b610448b44cc29cde70345092bcd4cdf.jpg","description":"This game is a parody.\nIt is definitely, positively and (hopefully) legally, NOT the game Grand Theft Auto Five.\nSure, it's called NotGTAV, but those letters stand for Great Traffic Adventure and the V is silent. Like the one in \"lawsuit\" (which, you'll notice, is also invisible).\nThis short tour of the glories of the UK’s M4 corridor is easy to play, hard to master, addictive, very funny, and cheap.\n100% of the profits from this game go to young people’s charity Peer Productions. Without Peer Productions the NotGames team would never have met. By buying this game you can help us pay something back.\nNotGames: Sticking it to the virtual man since about ten minutes ago.\nFAQ:\nQ: Is it meant to look that bad?\nA: Yes.\nQ: Really?\nA: Yes.  Really.  It's satire.  Like South Park.\nQ: Is it meant to be just Snake?\nA: Again, yes.  That's kinda the point of the satire, see?\nQ: So why should I buy it exactly?\nA: We guarantee it'll be the funniest game of Snake you've ever played.  Especially if you know anything about the UK.  Or an infamous driving game. Or have, you know, a sense of humour.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"NotGames","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]