[{"id":52176,"name":"Florence","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a52/a52908e971191d326caba0bf9857b856.jpg","description":"Florence is an interactive storybook from the award-winning lead designer of Monument Valley about the heart-racing highs and heartbreaking lows of a young woman's very first love. \r\n\r\nFlorence Yeoh feels a little... stuck. Her life is an endless routine of work, sleep, and spending too much time on social media. Then one day, she meets a cello player named Krish who changes everything about how she sees the world and herself.\r\n\r\nExperience every beat of Florence and Krish's relationship through a series of mini-game vignettes - from flirting to fighting, from helping each other grow... to growing apart. Drawing inspiration from 'slice of life' graphic novels and webcomics, Florence is an intimate and unforgettable story.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":18143,"name":"Zen Bound 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd9/dd909004052791fbc9dedb307bd6f10d.jpg","description":"Zen Bound 2 is an indie puzzle game developed by Secret Exit. It is a spiritual successor to the first Zen Bound.\n\n###Gameplay\nThe game features no plot whatsoever and focuses on the relaxing aspect of itself. The main objective of the game is to paint wooden sculptures using a rope to wrap them up. As the rope touches the sides of the object you are tying it around, they get painted. The players have to completely cover the sculpture with paint using as less rope as possible. There are three completion goals present in the game - minimum, medium, and max paint coverage. The players have to be careful, as the rope is not infinite and the players can run out of it if they use it irresponsibly.\n\nMost of the game's sculptures resemble animals, birds, geometrical structures, or building components.\n\nThe developers call Zen Bound 2 a down-tempo experience, which puts a heavy emphasis on the ability for its players to calm down and focus only on the task that is rather challenging, yet is not stress-inducing.\n\nFor those who still want some challenge, the game offers a Challenge mode. Time limits are featured in this mode, which sometimes make your heart beat much faster. Challenging achievements are also present in the game, with most of them hidden to encourage at least some degree of exploration in the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Secret Exit","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":2229,"name":"Carmageddon: Max Damage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f59/f5987f61320786a8a41203c3905a5435.jpg","description":"BONUS STEAM EXCLUSIVE CONTENT!!\nTHE U.S. ELECTION NIGHTMARE SPECIAL EDITION\nAcross America and the rest of the World, the public have been gripped by election fever - as two of the least-liked meat sacks on the planet slug it out to become the Most Powerful Person On Earth. Now, for the first time, you can show those Presidential candidates what you really think of them… By MOWING THEM DOWN IN A VIDEOGAME! Not just once, but over and over again... Impale a horrified Hillary on the end of your mighty rod! Repulsificate demented Donalds straight to frigging CHINA! It’s FUN for the whole FAMILY!\nCarmageddon: Max Damage for PC features 3 EXCLUSIVE NEW game modes:\nTrumped-Up where every pedestrian is respectfully replaced by the Republican candidate for the U.S. Presidency.\nHillaryious in which you’ll meet nothing but duplicates of the Democratic candidate.\nMass Debate which features a politically correct balance of both candidates.\nAnimals remain in the mix too – suitably accessorised… You haven’t lived till you’ve knocked the wig off of a penguin!\nHEADS UP!\n•\tWARNING: this game contains humour, strong language and violence that some may find offensive.\n•\tCheck your PC specification against the required specifications before purchase.\nAbout the GameCarmageddon: Max Damage is the latest instalment in the legendary Carmageddon series. Carmageddon is the driving sensation where pedestrians (and cows) equal points, and your opponents are a bunch of crazies in a twisted mix of automotive killing machines. It’s the ultimate antidote to racing games!!\nPlay an adrenaline pumping bunch of game modes against AI opponents, or online against the rest of the Carmafan masses! Progress your Career through the Carma ranks or have a MultiPlayer romp in a Car Crusher, Fox 'n' Hounds (always been Stainless MP game session favourite!), Death Race or Checkpoint Stampede event - all frenetic fun, featuring Carmageddon’s trademark over-the-top violence, crazy PowerUps and non-stop laughs…\nPLUS! You can relive all the mangling mayhem with the built-in Action Replay System. Featuring multiple choice of cameras and replay options – it’ll mean you never miss a pile-up again! Get your movies online and brag about your ped culling achievements. And there will be plenty of THOSE too – Achievements, Challenges and Collectables to hunt down, that’ll keep the whole family entertained for hour upon happy blood and oil splattered hour.\nThe game features:\nSingle Player Career mode\nFreeplay mode\nOnline & Offline Multiplayer mode\nCarMODgeddon mods mode\nThe Car Is The Star! Carmageddon: Max Damage features a wide and varied range of cool, crazy, custom killing machines; each with its own highly distinctive “character”. Carmageddon cars are specifically built for the job in hand – wrecking opponents and killing peds! Nearly 20 years ago the original Carmageddon invented the whole concept of videogame physics and real-time damaging of cars and scenery, and so it’s obviously been our responsibility to bring this technology BANG up-to-date with a brand new state of the art car damage (and repair) system. Crush, bend, twist, and completely mangle your opponents’ and your own car – smash parts off, or split it in two; the original game was all about wrecking motors and pummelling pedestrians, and today we take this to a whole new level!  Power, Armour, and Offensive upgrades are available for your car, along with other customising options, allowing you to personalise the killing capabilities of your rides.\nA host of old favourites from the original Carmageddon make a comeback, along with some all-new faces. Only ever seen before as low resolution mugshots, now you get to see them from head to toe (well, head to knees in the case of Screwie) in full HD 3D glory – usually as they smash through their windscreen and hurtle past (or INTO) yours!\nThe new environments are amalgamations of the best bits from the numerous chunks of landscape that we all loved to tear around in Carmageddon. “Bleak City”, \"Devil's Canyon\", “Dusty Trails”, “MagNuChem” and \"Snowy\" levels all return in updated forms, with their memorable landmark features such as the Loop ’de’ Loop, acid pits and Football Stadium. Everything is reassuringly surreal; hell, we’ve even managed to incorporate a giant food mixer into a level!\nThe topography and detail in the locations is updated and enhanced, with even more fun stuff to smash into, smash up, snap off, and send careening into the poor pedestrian population. “Nice Shot Sir!” And talking of pedestrians…\nOnce again, the game features a varied mix of adult pedestrians of all ages, shapes, persuasions and species. Classic pedestrians are back, such as old lady on a Zimmer frame and old man with his stick, with their famous cry “I was in the war!”, plus bikini babes and swimming trunk hunks, fat bastards, and herds of cows in improbable locations. Joining them are some new faces – including cyclists, wheelchair users and peds on mobility scooters. Carmageddon is an equal opportunities ped slaughterfest!\nPowerUps are back and this time they’re even funnier, surrealier, hurtier, and messier than ever! Lots of the classic PUps return in super-enhanced form, such as Repulsificators, Kangaroos & Solid Granites. Then we have all new PUps like \"Pelvic Thrust\" and a variety under the heading “Tossers”! Combine PUps to create hilarious combo results like Groovin’ Helium Filled Peds, or Peds without legs at a Temporary Rapture!\nLeaderboards. Challenge yourself to reach the top of the leaderboard using skill or brute force!\nAchievements. A suitably warped array of mad Feats and Exploits will garner you the rewards that every gamer dreams of.\nChallenges: Do the most stupid things, collect meaningless trinkets and waste hours of your life in the pursuit of ultimately pointless goals!\nSmelly Bushes: We’ve hidden a variety of these specially fragrant Easter Eggs throughout the game to keep you busy and entertained!\nCarMODgeddon: The whole game is MODdable for your MODding pleasure!\nCheck out the official Carmageddon comic series! Click on the image!\nFancy a FAQ? Check out the known issues here: Go here!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stainless Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":323081,"name":"Hammerting","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63f/63ffe800e467cc670285690c3c0312a5.jpg","description":"Hammerting is a vertical dwarven mining colony sim with RPG elements.\nManage a clan of colorful dwarves, establish an epic mining operation, craft legendary swords and delve deep for greater glory, riches... and danger.\nWith a war raging on the surface, the dwarves pledge to delve deep and, as the master craftspeople they are, produce and supply whatever is needed. From humble beginnings, you start with a few, hurried dwarves who need to set up operations. Ultimately, your small clan of dwarves will be known throughout the Upper Realms for their skill, and the base will span kilometers.Crafting for Victory\nAllies on the surface have all manner of requests. Dwarves may find themselves asked to craft oodles of silver swords against an oncoming vampire army. For an elf princess’s coronation, they’ll wish for nothing less than a Legendary Diamond-Encrusted Gold Crown of Divine Ruling +3.\nWith the overworld in need, every successful delivery takes you one step closer to triumphing against evil.\nAs your dwarves increase in skill and your base expands, build conveyor belts and elevators to free them of manual labor.Colorful Personalities\nDoes Åglöf’s fancy ancestry clash with Vargskreva’s humble upbringing? Is your explorer afraid of the dark? Has your master crafter reached her Ballmer Peak? Exploit your dwarves’ strengths as well as their weaknesses to succeed.\nEach dwarf is richly and uniquely defined through it’s stats, dwarven ancestry, traits, abilities, equipment, movement set, and more.\nA dwarf may go out of her way to achieve her goals - and they may not always align with the player’s.\nEvents in a dwarf’s life can give them new abilities and traits.Skilled Craftspeople\nAnyone can craft an iron sword; but only dwarves can haggle a Crystal Cave Dragon to sell her fiery plasma breath, pump it up to a Andthril Forge of Doom and use it to craft an... Iron Sword +2.\nWith every strike of the hammer on the anvil, a skilled dwarf has a chance to crit, making the result all that much better.\nThe chain for completing a single great item is long. First, find and mine some gold ore. Carry it home. Smelt it into ingots. Take the ingots and make a crown. Take the crown to the jeweler and insert perfectly cut rubies, imbuing it with a glow that radiates happiness to everyone around. Then take it to the runesmith and inscribe it with a powerful dwarven rune. Elegant HomeTechnically, one could design doors and rooms roughly sized after the person using them, but that is not the dwarven way. A leeway margin of at least 5.25 meters is recommended in the Dwarven Architecture Handbook, but of course, that was written by a half-dwarf, half-environmentalist. Real dwarves need at least 11 meters.\nThe dwarves like to give everything they do an extra touch. Hanging banners around the base, polishing their walkways, and replacing ladders with grandiose elevators are all things that make the dwarves happy.Living Cave\nDwarven Beer Recipe: Farm wheat, preferably in a dry, but not barren biome. Grind it, put it in a lake, and boil for two weeks. Hunt down and add three Malty Slimes, stir. Boil for another week. Chill. Add two liters of yeast from a Sweaty Swamp Ogre (find them by following the stench of Musty Mangrove Moss), cover and ferment.\nBiomes ranging from sandy deserts to nordic forests and blistering lava caves. Of course each biome is visually unique and contains its own set of flora, fauna, hazards, special locations, and events.\nPlants can be farmed, or harvested in the wild.\nIndigenous creatures can be attacked, used to your advantage, or simply avoided.VerticalityDwarves are big on elevators, but not so much on free falling. It follows that they’d have their own takes on hellevators. For example, members of Clan Steelbrow prefer a traditional shaft dug straight down, straddled by a crane with a 300 meter rope, and nothing but a barrel to stand in. Needless to say, the barrel’s built-in bar is stocked with ale.\nOnly in the deepest depths will you find the most powerful materials, the warmest magma, the rarest treasures, and the most dangerous conditions.\nFiguring out the fastest and safest route down - and up again - is a chief concern, but you’ll have plenty of unique dwarven mechanisms to help you do so.\nFeatures liquid and physics mechanics for pumping lava to your hearths, brewing beer, tossing torches down shafts to light up the unknown, and more.ModdingDon’t like the game? No worries, just buy it anyways and mod it to your heart’s content!\nUse the bundled SDK to create pre-packaged mods.\nAdd or replace any of the game’s assets\nNot just limited to “data” assets such as textures, you can also script and write new full blown systems in native C++.End notePlease wishlist the game, come join us on Discord and follow us on Twitter!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Warpzone Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14064,"name":"Tropico Reloaded","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b6/9b62bce614b8c22d350637479629dc03.jpg","description":"TROPICO RELOADED is the ultimate game compilation for hobby-dictators and those dreaming of their own Caribbean island. Tropico combines real-time strategy and simulation elements with a healthy dose of political intrigue and Caribbean flair to create a unique and critically acclaimed game experience.\n\nTROPICO\n\nYou are the sole ruler of a remote banana republic. Fight against poverty, corruption and rebels, make your own people happy or enforce your rule through military strength. However, do not forget to set aside a few dollars for your own retirement on a swiss bank account!\n\nTROPICO — PARADISE ISLAND\n\nThe official expansion for the original game not only brings natural disasters like tropical storms but also new tourist attractions to your island. Face the challenges of tons of new scenarios, prove yourself a worthy leader to your own people and make Tropico a paradise for wealthy visitors from overseas.\n\nTROPICO 2 — PIRATE COVE\n\nAs a feared Pirate King, you have to keep both your buccaneers and prisoners under control and send your ships on the prowl for treasury. Apart from an entirely new setting, the official sequel to the original Tropico offers gameplay improvements, new features and scenarios.\n\nKey features:\nIncludes the original Tropico, the expansion Paradise Island and Tropico 2: Pirate Cove\nOver 100 scenarios\nRandom map generator for an infinite number of challenges\n","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Frog City Software","platforms":[{"id":0,"name":"PC"}]},{"id":10053,"name":"Project: Snowblind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7e2/7e259589600668bca01f8bb019bb17c5.jpg","description":"Experience the dramatic intensity of the frontlines of a war through the eyes of the first of a new breed of super soldiers in this gritty and epic first-person action game.\nAn augmented super-soldier must stop a renegade regime from eradicating the civilized world.\nHong Kong, 2065. 2nd Lt. Nathan Frost is just a regular grunt in an international army called the Liberty Coalition. When he takes massive injuries from an explosion on the battlefield, Frost undergoes an experimental procedure. The outcome of the surgery is something more than human; a transformation that makes him a unique weapons-grade warrior, with abilities that far surpass those of the average soldier.\nEmpowered with these extra-normal abilities via implanted augmentations, Frost is immediately sent to the frontlines of a war as a secret weapon against the destructive regime. Stranded in hostile territory, cut off from command and far outnumbered, Frost and a handful of men must try and stop the entire renegade militia's plan threatening to plunge the world into darkness.\nEngage in battle online multiplayer with up to 16 players & voice over IP support in classic and new multiplayer modes.\nA wide variety of game pacing ranges from the frenetic chaos of battlefield action to tactical stealth infiltration style missions.\nEquip yourself with an arsenal of experimental weaponry such as the Riot Wall™ and Attack Drones, and other high tech gadgetry. Used in combination, the equipment yields a variety and depth of gameplay never before realized, especially in multiplayer play.\nIn multiplayer, vehicles are co-operatively used; one guy drives while the other mans the mounted turrets.\nAugmentations such as Invisibility, Reflex Boost and Electrical Storm give you an edge on the battlefield against your highly equipped and battle-ready foe.\nPick-up & play, visceral action pulls the player through a cinematically immersive storyline from Minute One of play.\n11 missions spanning across 16 maps including the Opera House turned Prison, a Buddhist Temple converted to a Military Base, and the sprawling urban Wastelands.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Crystal Dynamics","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":58950,"name":"Cookie Clicker","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ba/8ba1178d043aa752838d68b14fffb922.jpg","description":"Cookie Clicker is an idle clicker game with a baking theme. Bake cookies by clicking on a giant cookie. Use the collected cookies to buy upgrades. Which will get you even more cookies, and more, and more... you get the idea! Start by clicking the giant cookie to produce cookies – each time you click you generate one additional cookie. As your number of cookies increase you can purchase upgrades and a workforce.\nThere are two categories of upgrades – Buildings and Upgrades. The buildings section includes various different items that automatically create cookies such as a cursor and grandma. The cost of these buildings increases incrementally. The upgrades section contains upgrades to improve your clicking rate and the amount of cookies you generate per click. This game is progressive and in no time at all you will be creating thousands of cookies and your popularity will grow! Can you create a cookie empire and sell your produce to millions?","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Orteil","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":21563,"name":"Sniper Art of Victory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3f/a3ff1e8492234567f0653ef3d27a115b.jpg","description":"BECOME THE EYE WITNESS OF THE FALL OF THE THIRD REICH\nWW II was a theatre of war for many specialized combat units, working together to ensure an army’s victory. Among them a unique role was played by hidden and deadly marksmen. Their ability to lay motionless waiting for the perfect shot together with their professional equipment allowed them to change the course of the history with one pull of a trigger.\nBecome a sharpshooter and take part in the turning points of the WW II. Eliminate the Nazi general, who came to support the Germans lying siege to Stalingrad. Make your way through areas occupied by the Third Reich to your unit. Aid the Alliance forces during their offensive on the Italian Peninsula to break the resistance of the retreating Wehrmacht forces.\nKey features:\nRealistic sniper rifles: Mosin-Nagant PU and Mauser98KS.\nFaithfuly reproduced uniforms and equipment of the Third Reich soldiers.\nRealistic locations rendering the atmosphere of Russia and Italian Peninsula during the war.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"CI Games","platforms":[{"id":0,"name":"PC"}]},{"id":18367,"name":"SimplePlanes","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/57d/57d561294af826d0dbf8d72aeeeff4b8.jpg","description":"BUILD AIRPLANES\nYou have the tools you'll need to bring any airplane to life. Snap parts together to build your airplane's body. Place engines to add thrust. Design and attach wings and then strap yourself into the cockpit and see how it flies.\nDOWNLOAD AIRPLANES\nOver 100,000 airplanes are available to download for free from SimplePlanes.com Find anything from old WW2 bombers to next generation fighters to sci-fi spacecrafts. You can upload your own airplanes and rise through the ranks from a bronze builder to a gold level builder.\nDYNAMIC FLIGHT MODEL\nEvery little change you make in the designer impacts how the airplane flies. Weight distribution, thrust, lift, and drag are all calculated continuously while flying. Parts can break off in spectacular fashion while flying due to over-stress or by hitting something. The fun won't stop there though. You can keep on flying even with a missing wing if you've got the skills. CHALLENGES\nClimb into the cockpit of one of your custom aircraft and see how it does in the challenges. The challenges will keep you entertained for hours. Land on aircraft carriers, escort bombers, dodge surface-to-air missiles, race through courses, and so much more. SANDBOX\nUse all available parts to build airplanes with no restrictions. The sky is the limit. Literally.\nMODDING\nModding is fully supported so you can build your own parts and environments. Download our Unity package which includes specially designed tools to aid in designing and building mods which you can then share with your friends and the community.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Jundroo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":10068,"name":"Aaero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/510/51009a72ad917f5132dadd2eea832972.jpg","description":"**Controller Required!**N.B. A controller with dual analogue sticks is required to play Aaero. (e.g. Xbox 360/One, PlayStation DualShock etc.)\nAbout the GameSpeed through stunning, stylised environments tracing ribbons of light, releasing the energy in the music. Battle strange enemies and fight epic boss battles all driven by an incredible licensed soundtrack.\nIndependent micro-studio ‘Mad Fellows’ brings you a unique and innovative game featuring music from Noisia, Flux Pavilion, Katy B, The Prototypes, Neosignal and many more.\nN.B. A controller with dual analogue sticks is required to play Aaero. (e.g. Xbox 360/One, PlayStation DualShock etc.)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Reverb Publishing","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":8757,"name":"Agent Awesome","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e20/e20aa716bba921aece8e722215f2f6e1.jpeg","description":"Agent Awesome is a strategy game for PC and iOS developed by Chaos Industries in 2015. \n\n###Plot \nThe player performs as Agent Awesome, a secret agent going through his former employer’s building called E.V.I.L. (Engineering Vicious Ideas Labs). The player aims to deliver the agent from point A to point B on each of the 12 levels and get rid of every enemy on the way. \n\n###Gameplay \nThis is a third-person perspective tactical arcade. With each level, the player gets to see the floor’s map.\nThe screen consists of a map, a health bar, the amount of collected money and the timing line, so each level should be finished on time. The map shows the location of every enemy and their routes, so it lets the player choose his path suitable for survival and attacking. The gameplay has both combat and stealth modes. The player can mix those to fight all of the enemies and collect more money. Each point can be used for a character or a weapon upgrade and new weapon purchase. Every level is accompanied by a typical secret-agent-movie type of soundtrack and dialogues between the characters. \n\n###Reception \nThe game is praised for its humor and design. However, at the same time, Agent Awesome is criticized for incomplete settings and expensive weapon improvements.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ashot Balasanyan","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17516,"name":"Orbital Gear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9bc/9bcfda02e96e88d1d86dbc00a927f0d6.jpg","description":"Orbital Gear is a sidescroller shooter where you utilize the gravitation of celestial objects to give your mech momentum through space.  Arm your Mech with two of twelve different weapons and destroy your enemies. Orbital Gear features classic multiplayer gameplay with new mechanics and 3D graphics.\nOrbital Gear has classic deathmatch as the basis for multiplayer pandemonium but it also have a special game mode called Orbital Warfare, a mode where you battle the opposing team with the goal to destroy the opponents base. Victory is ensured either with your mechs weapons or by charging your doomsday weapon with energy cores, collected from fallen enemies.FeaturesHone your skills in Orbital Trials, a single-player mode where you must complete a series of timed trials against enemies!\nFast paced multiplayer experience, inspired by classic multiplayer games!\nThe gravitation gives Orbital Gear a unique gameplay. Movement are affected as well as many of the weapons are either affected or affect the gravity, giving the gameplay new challenges!\nTwelve different weapons, all with different effects. Scorch planets with the Kasainami to force your opponent to move, or run them down in close combat with the Gauntlet to name but two!\nFour different utilities. Set up Turrets and Shields or use the Booster to navigate between planets!\nFour different looks for your mech!\nClassic deathmatch and Orbital Warfare where your team fighting against an opposing team with the goal to destroy their home planet!\n4-player split screen multiplayer.\nGet ammunition and health from energy cores, spawned from every opponent destroyed. In Orbital Warfare you can also save them to charge your planets super weapon to destroy the opponents planet once and for all!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Night Node","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17470,"name":"Please, Don’t Touch Anything","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e4/1e47c961bcc1477fa9a66dd51b29e9c1.jpeg","description":"Please, Don’t Touch Anything is a cryptic, brain-racking button-pushing simulation.\nCovering for a colleague who is taking a bathroom break, you find yourself in front of a mysterious panel which only component is a red button. And since you’ve clearly been instructed not to touch anything, the only thing you want to do now is push that damn button.\nPush it and expect to be held liable for any unintended aftermath. And there will be many.\nFEATURES\n25 devious enigmas\nSingular pixel art\nAtmospheric chiptune soundtrack\nSteam Cards\nAchievements","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Escalation Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":17121,"name":"Rise of the Triad","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/667/6672f1b8b4624d7beed05d8de6a8ce71.jpg","description":"Apogee Software and Interceptor Entertainment proudly present the rebirth of the cult-classic first-person shooter, “Rise of the Triad”.  Bigger, better and more ludicrous than ever before.  The H.U.N.T returns with a full single-player campaign, a fully featured multiplayer experience and so much more.Key Features:\nStep into the shoes of the H.U.N.T. (High-Risk United Nations Taskforce) with five unique characters, each with different play styles\nBlast through over 20 of levels of explosive single-player action\nUnique online multiplayer maps bring back all the fun and excitement of classic ROTT\nThe full arsenal of over-the top weapons is back, including the Flamewall, Firebomb, Split Missile, Drunk Missile and, of course, the Excalibat!\nThe maniacal modes return, with God mode, Elasto mode, Mercury mode, Shrooms mode and everyone's favorite, Dog mode!\nBuild your own levels, mods and share them with the Ludicrous Development Kit™ & Steam Workshop\nFind tons of secrets, collectibles, special events and hidden areas to explore\nGet 95 achievements to add to your score, which is tracked on our worldwide leaderboard and stat-tracking system\nROTT is bloodier and more ludicrous than ever, with full character and enemy dismemberment\nThe iconic original soundtrack has been completely re-forged in the fires of heavy metal!\nNostalgia abounds with the option to play with all the original music","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Interceptor Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":62409,"name":"In Other Waters","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/370/370dbc27b2ff669c508c029d39b825be.jpg","description":"An alien ocean, rich with impossible life.\nA lone xenobiologist, adrift in a world of secrets.\nAn AI, waking from a dreamless sleep, ready to guide humanity to a terrible truth.\nIn Other Waters is a unique exploration game, where you must aid xenobiologist Ellery Vas in diving and studying the depths of a distant alien ocean.\nFEATURES\nExplore an Alien Ocean\nCasting you as an Operator AI In Other Waters is structured around an ever-growing, tactile interface. Through this unique mode of interaction you will chart underwater courses, scan environments for vital clues, and navigate this unearthly ocean.\nStudy New Life\nRather than play as a sci-fi soldier or planetary colonist, In Other Waters gives you the chance to engage with its world through xenobiology. You will assist Ellery in tracking, sampling and studying the planet’s life to understand how to navigate its ocean.\nUncover Terrible Secrets\nAs you dive deeper into the ocean of Gliese 677Cc, the bond between you and Ellery will be tested by what you discover. The choices you make, and the way you react to Ellery will change the course of the expedition.\nPRESS QUOTES\n\"In Other Waters gets weirder and more interesting the closer you look.\"\nPC Gamer\n\"It looks simple (and ever so stylish) yet underneath there's oodles of narrative depth.\"\nEurogamer\n\"Its Metroid-likeness doesn’t come from finding coloured keys or whatnot, but from studying the world and its ecosystems.\"\nRock Paper Shotgun\n\"It’s smart, and capable, and, yes, that instrument-twiddling captures a bit of the spirit of playing with toy instrument panels and fake science tools as a child.\"\nPaste Games","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Jump Over The Age","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":29131,"name":"Forza Motorsport 3","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/283/28305d39eacde0458b87e30a467e5d8d.jpg","description":"Forza Motorsport 3 is an auto simulator game developed by Turn 10 Studios. It is the third game in the Forza Motorsport franchize.\r\n\r\n###Gameplay\r\nThe main game mode is Season Play. The players are given three events to choose from, which consist of three to five races at the beginning of the game. On the last day of the second week, a championship takes place. Each season has more and more season races. \r\n\r\nForza Motorsport 3 has a car class system that depends on the Performance Index. 11 performance classes are present in the game. Performance Index is calculated by evaluating the car's base stats, such as Speed, Handling, Acceleration, Launch, and braking. The Performance Index can be increased by buying car upgrades or decreased if the car's weight gets bigger or the players decide to switch the drivetrain.\r\n\r\nThe players can create completely custom designs of their vehicles and later upload them to the internet. It is even possible to record videos through the in-game photo mode and upload them to the Forza Motorsport 3 website. \r\n\r\n###Multiplayer\r\nThe game features a competitive multiplayer mode, which pits eight players against each other on any track available in the game. The multiplayer lobbies are fully customizable, which allows for creating both realistic races like an actual 24 hour Le Mans marathon on Circuit de la Sarthe or teaming up together for a fun drift session.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Turn 10 Studios","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":12678,"name":"BLOCKADE 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8d/d8d6fd80c69ab8d920b893980bb6bec9.jpg","description":"BLOCKADE 3D!\nFirst Person Shooter! Dynamic cubic world where you can build and destroy things and ones. Modern, real prototype of weapons and other liquidating your different-colored enemies will vary your in-game possibilities. A lots of cool game-modes, where you can shoot, destroy, build your own map, be the last-man-standing against zombies in Zombie-Mode, or to arrange a massive tank battle in Tanks Mode. Every one can find stuff he addicted to in this game. Huge amount of maps, made by developers themselves and of course by community. Upgrade your weapon, your looking, and looking of your equipment, increase your in-game level, involve yourself in the game's worldwide ranking system with another players. Some of game-modes include up to 4 team at the same battle field. Clan tournaments where you gather with other clans to reach 1 goal - be a champion.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shumkov Dmitriy","platforms":[{"id":0,"name":"PC"}]},{"id":19467,"name":"Altitude","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/766/766bf376eb4c3ecd0edd1e55369e3154.jpg","description":"Altitude is a multiplayer combat game developed by Erik Measure and Karl Sabo in 2009. \n\n###Gameplay \nThis is a classic 2-D arcade with simple gameplay and old-school design. The player aims to win in aerial battles performing in one-person battles, where computer bots can be used instead of other players or as a team player.\nThe pace of each battle is fast so that this game may change the player’s skills. As the player gains experience in battles, new planes and customizations are unlocked. A significant part of controlling is concentrated on the mouse. The usual amount of players per battle is something between 2 to 16 persons. Each plane and each level has its design: there is a football ground theme, a space theme, and a city theme. \n\n###Game modes \nThere are seven game modes which differ in the number of players, combat techniques and demands needed to complete the level. There is the classic deathmatch called the Free For All mode, where the player’s goal is to destroy as many planes as possible. There is a level that follows the rules similar to football: the team’s goal is to make a goal with a single persistent ball. The winner should reach six goals or gain more points until the time is expired. There is also a One Life Deathmatch which is a lot like the classic FFA mode, but with the exception that no player can respawn after each round – the winner is the last plane left alive.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nimbly Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9438,"name":"Golf It!","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecd/ecd0a5625396219090454c4a2e0c8543.jpg","description":"Golf It! is a multiplayer Minigolf game with focus on a dynamic, fun and creative multiplayer experience. One of the most exciting features is a Multiplayer Editor, where you can build and play custom maps together with your friends.\nThis version of the game features at least 5 different maps with 18 holes each: Grassland, Winterland, Graveyard, Mines and Pirates Cove. Every map has unique gameplay features and different aesthetics. Every asset of each area and more will be available for you inside the Multiplayer Editor and you are free to mix them all together to create the map of your desires! Currently there are over 1.000 placeable objects inside the Multiplayer Editor!\nTo have a more fun and different experience each time you play, we are using a ball hitting system which is based on the speed of the mouse. The faster you swing your mouse the harder you will hit the ball. It takes more experience and practice to hit that precious hole in one every time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Perfuse Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":28604,"name":"Midnight Club: Los Angeles","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90b/90b9ac906f9e3b983913e21809227fe1.jpg","description":"The best way to see Los Angeles is at 245mph. Race at breakneck speeds through the streets of modern-day L.A. recreated in stunning detail. Drive the hottest range of real-world tuners, muscle cars, exotics and superbikes on the streets today. Customize your vehicle with the best after-market performance parts and custom kits. Illegal street racing with no track, no load times, no rules: Welcome to the Midnight Club.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Rockstar San Diego","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":6800,"name":"iBomber Defense Pacific","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f1/4f1e5d7dcf6ae5a601ee6bad396cca06.jpeg","description":"iBomber Defense Pacific is the sequel to the original iBomber Defense. It is the second part in this tower defense series designed for mobile devices. \n\n###Premise\nThe game is set during the World War II. Unlike the original game, the sequel shifts its attention to the Pacific Theatre. The goal of the player is to defend his or her towers from the enemy units that attack from the air, land, and water, sometimes simultaneously. \n\n###Gameplay\nThe game uses all traditional tower defense mechanics with only slight additions. Like in the previous iBomber game, the player controls his or her units in real time, using the top-down view. Most towers serve as AAAs and gun turrets that fire on the incoming aircraft and armored vehicles. There's also a Bomb tower that generates bombs which the player can drop at the enemies. The player can build new towers and units and repair them as well as to manipulate his or her towers to adjust their defenses to current needs. For example, the game introduces the Dig In option that allows the player to increase the tower's safety at the expense of its firepower.\n\n###Goals\nEach level features a new map as well as a primary and a secondary objective. The secondary objectives provide variety to the missions, as some of them require offense rather than defense. For example, the player can be tasked to disrupt the enemy supply. Completing objectives earns the player the Victory Points that allow him or her to level up and obtain additional perks.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":802181,"name":"Synergy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68b/68bcfe02c9b9b7123edab7ecce3f2660.jpg","description":"Humans live on a hostile planet. To ensure their survival, they must learn to survive in extreme weather conditions and in an environment that is not conducive to their development.\nCareful and pragmatic management of resources has become essential to the survival of human race, as has the morale of the population.\n\n\nMain Features\n\nManage weather, seasons, extreme conditions and natural disasters.\nBuild a city with the happiness of its inhabitants as its main goal.\nExplore and analyze their world in order to adapt the evolution of their city.\n\n\nAdditional Features\n\nRespect the physical and mental needs of the inhabitants.\nLive in harmony with fauna and flora.\nMake short or long-term choices.\nPlay different scenarios to enjoy various experiences.\nSandbox mode: experiment with different combinations by yourself.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Leikir Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14511,"name":"16bit Trader","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9cc/9cc770fbf82183b1158ed4d3ca5ed828.jpg","description":"16bit Trader is an casual brother of our other trading game: Merchants of Kaidan.\nTake revenge on your father’s killer, and become the richest merchant in the kingdom! Immerse yourself in this old-school nostalgia-inducing trading experience.\nStep into the shoes of a medieval traveling merchant, whose life boils down to one simple sentence: you got to buy cheap, and you got to sell high. Travel between the cities and villages of the realm in search of cheap goods to acquire, various quests to accomplish and wealth to accumulate. Visit local taverns for latest local gossip. Gain influential friends who may help you along the way. Hire companions to assist you if you run into vile bandits or unpredictable events. Pursue rumors of great harvest and goods shortages to find the best deals. Search for local people in need and they may reward you handsomely for your help. Expand your company, invest in it, and get rich in no time! And if you’re for a bit of a thrill, visit ancient landmark and search for valuable artifacts. Take the challenge and become the richest merchantman in the world and get revenge!\nPlay at your own pace. Casually travel through the realm if you want to relax. Monitor every price change, pursue every rumor, manage every detail if you want to achieve best results!\n- Dozens of different cities and villages\n- Tens of various quests to accomplish\n- Great graphics with an old-school 16-bit vibe\n- Easy to get to know, hard to master\n- Random encounters","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":277988,"name":"Paradise Lost","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/781/7819f502c1352af1ccca234a28086d55.jpg","description":"Paradise Lost is an FPP adventure game about coping with loss as a 12-year-old kid who finds a mysterious Nazi bunker while roaming a post-nuclear Polish wasteland. Can you find its secret?\n\n### Storyline\nAfter 20 years of war, the Nazis carried out a nuclear attack, which changed the face of the occupied Poland forever. Can a new world be born in the ashes of the old one?\n\nTake on the role of a 12-year-old kid who finds a mysterious Nazi bunker while roaming a post-nuclear wasteland. Will he find what he seeks there? Will he cope with the loss he has suffered?\n\nExplore a vast underground world in which unusual, advanced technology mixes with Slavic folklore and myths. Are you ready to learn what fate its inhabitants met?\n\nDiscover the past, shape the present. Decisions you make while learning the history of the bunker will affect what you will see on your journey.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"PolyAmorous","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":59340,"name":"Not Tonight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/617/6173ebd9a0ed696369e25a9066e57a68.jpg","description":"Person of European Heritage #112: Welcome to Relocation Block B, your new home. Your designated role is 'Bouncer'. Work hard, stay out of trouble, and we might let you stay in the UK.\nIn an alternative Britain where Brexit talks have collapsed, an extreme far-right government has taken power. Citizens of European heritage have been rounded up and exiled. Forced out of your previous life, you find yourself in the midst of a booming gig economy, fighting to scrape by and return to the city you call home.\nNot Tonight is a post-Brexit management game, fusing a time-pressure RPG with a politically charged story where every decision matters. Will you join the resistance and fight the regime -- or keep your head down and hope that one day this will all be a distant memory?\nMan the doors of pubs, clubs, festivals and parties, finding work via the BouncR app\nCheck IDs, manage guestlists, and stop revellers from becoming unruly\nUpgrade your apartment, bouncer and equipment to better prepare yourself for the future\nDecide what lengths you'll go to in order to survive in a Britain on the verge of collapse","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"PanicBarn","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":58497,"name":"Shining Resonance Refrain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d5/0d526ea44b82eadaff0e8727638acf99.jpg","description":"Play as Yuma Ilvern and stop the Empire from exploiting the power of the ancient dragons, including the soul of the Shining Dragon within you. With the help of your friends, realize your destiny, save Astoria, and unleash the strength you’ve always had locked away.\nIn the original game, previously released only in Japan, Imperial Princess Excella was an unplayable character, but in the new “Refrain Mode” in Shining Resonance Refrain, both she and Dragonslayer Jinas can be added as party members for a new experience – just be sure to save this for your second playthrough to avoid any spoilers! As an added bonus, all of the extra cosmetic items and side quests are included in this remaster.\nDragons were long thought to be extinct, and because Yuma holds the ability to transform into the Shining Dragon, he was taken as a captive of the Empire. With the help of the Dragoneers, Sonia, princess of Astoria, pleads with Yuma to aid them in their fight to save their land from the Empire’s dominion. Typically timid, will Yuma find the courage to realize the strength he has within him?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":29203,"name":"The Elder Scrolls V: Skyrim VR","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/291/2919a3b400ace62dd5c1d145d6ee97d5.jpg","description":"A true, full-length open-world game for VR has arrived from award-winning developers, Bethesda Game Studios. Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion.  From battling ancient dragons to exploring rugged mountains and more, Skyrim VR brings to life a complete open world for you to experience any way you choose.  Skyrim VR includes the critically-acclaimed core game and official add-ons – Dawnguard, Hearthfire, and Dragonborn.\nDragons, long lost to the passages of the Elder Scrolls, have returned to Tamriel and the future of the Empire hangs in the balance. As Dragonborn, the prophesied hero born with the power of The Voice, you are the only one who can stand amongst them.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":14017,"name":"Anna - Extended Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a6/5a69acef9d0ac3c659c7d2c582b2e72a.jpg","description":"Anna is a creepy horror game in which the protagonist researches the mystery of a haunted house. Its dark atmosphere is reminiscent of Silent Hill games. However, Anna has an emphasis on puzzle solving and no battles.\n\n###Plot\nThe game is set in the Northern Italy, in the mountainous region of the Alps. The setting was modeled after a real place, and the story is inspired by the Alpine folklore. The player controls a man who lost his memory. He only can vaguely remember a sawmill and a woman called Anna. The protagonist visits the sawmill that is apparently haunted. He has to discover the uneasy secrets of his past and the fate of Anna.\n\n###Gameplay\nThe player's goal is to solve the puzzles to move forward and uncover the mystery of Anna by recalling dialogues the protagonist had with her. Unlike in most adventure games, not all items the protagonist can carry are useful. The game does not highlight the important items.\n\n###Extended Edition\nThe Extended Edition is a dramatically improved version of Anna. It was based on the feedback and criticism the original game received. This edition introduces a new AI-controlled character called \"The Wife Doll.\" It also adds letters, books and other documents that provide insight into the mystery. Unlike in the original version, which had no \"game over\" option, the player can lose sanity after encountering supernatural phenomena. It leads to a \"bad\" ending. This edition also has improved graphics and user interface, as well as additional locations.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Dreampainters","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11061,"name":"Wildfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd6/cd6009aac96d59821a2f499d319c6254.jpg","description":"Master the elements in this stealth game where everything burns!REUNITE YOUR VILLAGEIn a world where magic has all but died out, you've been branded a witch by villainous forces who fear your elemental power. Outsmart the superstitious armies of the Arch Duchess as they hunt you through lush forests, deep caverns, and over frozen mountaintops. Find and free your fellow villagers from captivity, then lead them to safety and reclaim your home.CONTROL YOUR ENVIRONMENTThrow fireballs to set the world ablaze and terrify your foes. Freeze water to cross impassable lakes, or trap enemies in ice. Move earth itself to grow grass to hide in, or vines to climb and reach new heights. Grow your connection with the elements to learn new abilities, but beware: fire will spread and consume everything in its path – including you!PLAY YOUR WAYCreep through tall grass and conceal yourself in smoke to slip by enemies unnoticed - or burn everything in your path to make your foes panic and flee. Use your enemies’ fear against them to create opportunities to slip past, or trick them into their own demise. Wildfire lets you play as a ghost, a pyromaniac, and everything in between.INTELLIGENT, CHALLENGING ENEMIESThe knights, archers, and trained attack bobcats who pursue you will intelligently work together to hunt you down. They will investigate sound disturbances, communicate with each other, and coordinate to close in on your position. Only by turning your environment against these foes can you overcome their superior strength.TWO PLAYER LOCAL CO-OPWildfire can be played entirely in singleplayer, or in two-player, local co-operative mode on the same screen. Use your elemental powers in tandem with one another to find entirely new ways through Wildfire’s dense, systemic environment.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sneaky Bastards","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":1058,"name":"Nova-111","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e76/e764de7e37992c33f2158d71a30d0998.jpg","description":"Nova-111 is an action-adventure turn-based game developed by Funktronic Labs. The project was sponsored by the Indie Fund.\n\n###Plot\nIn a distant future, there was a team of brilliant scientists who were living in a turn-based world. They wanted to expand their research in the field of chronology and have developed a device, that would unlock the mysterious real-time to them. At first, everything seemed fine, and the experiment worked flawlessly. However, something goes wrong, and both the turn-based and real-time worlds get mashed together. You are a pilot of Nova-111 a search and rescue ship.\n\n###Gameplay\nNova-111 fuses a turn-based game model with real-time combat. The players explore the world that was inspired by the 60s sci-fi novels in search for the lost scientists. It is necessary to solve puzzles and face the newly created creatures in a completely new world.\n\nThe players are free to upgrade their ship however they like. It is possible to upgrade the ship's health, fuel capacity, its weaponry, and speed. The ship's ability modules are also scattered across the open-ended levels leaving them for the most curious players to find.\n\nA dynamic soundtrack system is present in the game, which allows for the most exciting combat situations and fits the player's play style perfectly.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Curve Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":350684,"name":"In Sound Mind","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/368/368f7cbd6a2f8f3acfab929873e89d0c.jpg","description":"In Sound Mind is a psychological horror complete with fast paced puzzles, unique boss fights and original music by The Living Tombstone. From the creators of the cult game Nightmare House 2 - explore, ﬁght through and unravel the eerie and unsettling story of a town through memories.\nWake up in the corridors of an impossible building, only to find its odd design and hallways are guiding you to solve the mystery behind a therapy experiment gone wrong. Made to rewrite painful memories, an unconventional method seemed to have caused more chaos than harmony.\nOh, what a beautiful and fragile thing, the mind is. Oh, how devastatingly strange and dark it can be. Travel, as if through time, into the perspective of Milton Haven’s broken. In Sound Mind delivers a fresh approach to the genre of horror and suspense that will make you question the inner workings of your own head.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"We Create Stuff","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":16172,"name":"Gravilon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb9/fb9314ab3b1f2c38243b9bc8b4ebf150.jpg","description":"Gravilon is a thought-provoking puzzle-platformer without a jump button. \n\n###Gameplay\nAll the player has to do is explore the Gravilon world and to reach the end. The game has no enemy NPCs, no collectible items, no achievements. The movement mechanics are simple to follow up, even though the mechanics are a bit different from those in other platformers: to complete each level, the player can use power-ups and inherent gravity-bending powers. The level design builds on itself as time passes, which allows the player to learn it more. The levels and game mechanics are designed to encourage exploration and to allow for creative pathfinding – there is no one correct path for most levels, there is only (arguably) the fastest, most efficient route.\n\n###Key features\nStanding in the way of you and that end is a world is frozen in stasis, its secrets locked away. The levels and game mechanics are created to support exploration and allow creative pathfinding; throughout the play, the player learns more about his role in the game world. There are no correct paths for most levels; there are even no fastest routes. The atmosphere is calm and relaxed; this is the type of game where you stay and see how the story unfolds in front of you: at first, the surroundings are in black-and-white colors, but gradually they become yellow and bright.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"gravdev, Fan Wu","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10594,"name":"Bloons TD Battles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/142/142e13c73bf0aaf247a0c771d41a6f91.jpg","description":"Play the top-rated tower defense franchise in this free head-to-head strategy game.\nIt's monkey vs monkey for the first time ever - go head to head with other players in a Bloon-popping battle for victory. From the creators of best-selling Bloons TD 5, this all new Battles game is specially designed for multiplayer combat, featuring over 20 custom head-to-head tracks, incredible towers and upgrades, all-new attack and defense boosts, and the ability to control bloons directly and send them charging past your opponent's defenses.\nCheck out these awesome features:\n* Head-to-head two player Bloons TD\n* Over 20 custom Battles tracks\n* 22 awesome monkey towers, each with 8 powerful upgrades, including the never before seen C.O.B.R.A. Tower.\n* Assault Mode - manage strong defenses and send bloons directly against your opponent\n* Defensive Mode - build up your income and outlast your challenger with your superior defenses\n* Battle Arena Mode - Put your medallions on the line in a high stakes Assault game. Winner takes all.\n* All new Monkey Tower Boost - supercharge your monkey towers to attack faster for a limited time\n* All new Bloons Boost - power up your bloons to charge your opponent in Assault mode\n* Battle it out for top scores on the weekly leaderboards and win awesome prizes.\n* Create and join private matches to challenge any of your Steam friends\n* 16 cool achievements to claim\n* Customize your bloons with decals so your victory has a signature stamp","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":9527,"name":"Atlas Reactor","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f09/f09e5ed03119a59b94f986a99f3d6f56.jpg","description":"CH. 4: Master of the Hunt\nPlay 10 matches to earn a Freelancer of your choice!With short match times and fast-paced combat, you'll have your favorite 'lancer before you know it.  Log in and start earning your Freelancer now!\nRecruit-a-Friend. Get bonus loot.We’ve updated the RAF (Recruit-A-Friend) and it’s easier and more rewarding than ever! Just click on the Recruit button in game to start.\nGet 5 RAF Points the first time each of your recruits play 10 PvP games, plus earn one-for-one points for any money they spend on the game!\nYour recruits will receive a 7-Day Access Pass to try Atlas Reactor in its fullest, including all freelancers and ranked mode! Be sure to play some matches with them to train them so they can go on to train their own recruits.\nAbout the GameCompetitive PvPCompete in 4v4 team battles in Solo, Vs. Bots, PvP, Ranked, and Custom games. With the range of ability combos possible, no two matches are ever the same.Customizable heroesBattle as one of an ever-growing roster of Freelancers! Customize each hero’s abilities with Ability Mods, which can be saved into loadouts or tweaked to counter enemy teams.Unique maps and environmentsFight in battles all around the city of Atlas, including the deck of a flying cargo ship, a rooftop garden, a hi-tech laboratory, and the engineering bay of a working reactor core.Seasonal stories and rewardsExperience Atlas’ story through “Seasons,” a multi-week arc where players can influence the fate of the world and challenges reward regular gameplay with bonus loot!A futuristic universeEnter a cloud-piercing megacity where Freelancers fight for (and against) monolithic Trusts vying for control over the last Reactor on the planet.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Trion Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":49185,"name":"CS2D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c49/c4914eb6bc42782281d652833af60b66.jpg","description":"CS2D is a fast-paced top-down multiplayer shooter! FREE for Windows, Linux & MacOS!\nTwo teams fight each other in action packed matches. With a variety of missions like bomb planting, hostage rescue, V.I.P. assassination, capture the flag, construction, zombies, deathmatch and team deathmatch. You have access to a huge arsenal of weapons - also including crazy stuff like portal guns, lasers, RPGs and much more. Play online, in LAN or against bots. Use the built-in map editor to create your own maps within seconds or write Lua scripts to modify and extend the game!\nCS2D is 100% FREE! Zero costs. No payments. No pay to win. No way to spend money.\nThat's right! You don't have to pay anything to play this game! We just want you to have some fun!\nFast paced online action (or offline against Lua scripted bot AI)\nPistols, shotguns, rifles, sniper rifles, (S)MGs, grenades and many other weapons\nMany game modes: Classic (Bombs, Hostages, VIP), Deathmatch, Zombies, Construction...\nEasy to use map editor with entity/trigger system\nConsole & buy scripts\nModify & extend with Lua scripts (yes, we also have mods with funny hats!)\nDynamic light effects and a \"GTA 2\"-like top-down 3D mode\nWin, Linux & MacOS clients and headless dedicated server\nMany active players around the world, loads of custom maps and scripts!\n... also... did we mention that all this is FREE OF CHARGE?!\nMany different firearms and a tactical shield\nFancy special armors (including a medic armor and a stealth armor)\nMedikits & bandages (instant health recovery on pickup)\nMoney items (gain money by collecting them)\nClose combat: machete, wrench, claw, chainsaw\nSpecial \"grenades\": flare, molotov cocktail, gas grenade, airstrike, snowball\nLaunchers: RPG launcher, rocket launcher, grenade launcher\nMines: anti-personnel mine, laser mines\nAnd more: flamethrower, laser, portal gun, ... - over 70 different items in total!\nClassic mode with DE, CS and AS maps (bombs, hostages, VIPs)\nDeathmatch: just go crazy and kill everyone!\nTeam Deathmatch with capture the flag and domination maps\nConstruction mode: Build your own turrets, walls, teleporters, dispensers and more!\nZombies! Try to survive or be a zombie and infest all survivors!\nCS2D has been around for over a decade and it has been improved with many updates\nA complete and working game! No early access! no wrong promises! WYSIWYG!\nThe awesome CS2D community already created tons of custom maps and mods","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Unreal Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10670,"name":"Bigscreen Beta","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/044/044411385bed5ffd1eb968754fee9e63.jpg","description":"Just UpdatedThe Cinema Update - Now with Flawless Desktop Streaming! HUGE Cinema environment  Incredible 1080p 30fps Desktop Streaming (for movies, multiplayer games, etc)  Native Desktop Audio Streaming  Experimental Windows 7 & Nvidia Optimus support\nRead the full release notes here: https://blog.bigscreenvr.com/the-cinema-update-our-biggest-release-yet-f8cd96e4067c\nAbout the GameBigscreen is a virtual desktop app that lets you use your computer in VR on massive virtual screens and a place to hang out with other users in virtual worlds to play PC games, have virtual LAN parties, draw with 3D markers, listen to music, watch movies, anime, YouTube, and Twitch streams with friends, or relax by the campfire and chat.Feature List PLAY your favorite PC, Xbox One, or PS4 games on massive screens\nWATCH movies, videos, and TV shows on sites like Netflix and YouTube—basically anything you can do on your PC today\nDRAW with 3D markers for fun sketching, doodling, and whiteboarding\nCUSTOMIZE your screen to the perfect position, size, and curvature\nHANG OUT IN VIRTUAL WORLDS from a luxury house, campfire, theaters, to outer space\n3D SBS (Side-by-Side) & OU support for 3D movies & games\nSOCIAL VR hangout in Multiplayer in Public and Private rooms with up to 4 players\nCROSS-PLATFORM support with Oculus Rift & HTC Vive\nVOICE CHAT with positional audio so you can hear your friends like they would be talking to you in real life\nDESKTOP SHARING to look at and hear a friend's computer screen in VR. Watch movies together, have a virtual LAN party, and more!\nUSE YOUR HANDS with LeapMotion, Oculus Touch, Oculus Remote, and HTC Vive controllers to move screens around, interact with the tablet UI, draw, and wave at friends\nMULTIPLE MONITOR support for up to 3 monitors, showing either your physical monitors or virtual/emulated monitorsComing Soon Mobile Vr Headsets\nLarger Multiplayer Rooms\nMore virtual worlds\nIntegrated “native apps” (better video players, browsers, etc)More features to be announced! Follow our recent updates. Bigscreen is regularly updated.\nIdeas? Feature requests? Bugs? Join our active Discord Community or email us at contact@bigscreenvr.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Bigscreen","platforms":[{"id":0,"name":"PC"}]},{"id":10198,"name":"Craft The World","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfe/cfed2e5b127ab7fce676be22b247ab40.jpg","description":"Craft The World is a unique sandbox strategy game, the  mix of Dungeon Keeper, Terraria and Dwarf Fortress.\nExplore a random generated world populated by dangerous creatures, build a dwarf fortress, gather resources, and craft all the items, weapons, and armor you need.\nGOD-SIMULATION\nYou control a tribe of dwarves by giving them commands to dig in certain places, attack enemy creatures, and build houses and other structures. You'll need to provide your dwarves food and clothing, as well as help them with magic when fighting against other inhabitants of the world. You start the game with one dwarf and gain additional dwarves as your experience level increases.\nSANDBOX GAME\nEach game level has many layers of earth to explore, from the sky down to boiling subterranean lava. The level is randomly generated as an island, restricted by natural boundaries: oceans on the edges, lava beneath it, and the sky above. Other features include day and night and changing weather conditions. The worlds differ in size, humidity, temperature, terrain, and flora and fauna. Abandoned halls and rooms with treasure are hidden somewhere deep within the islands.\nCRAFTING\nOne feature of the game is a user-friendly system of recipes for crafting. The recipes are organized and easily accessible. You can craft dozens of different items: building blocks for houses, furniture, decorations, weapons, armor, ammunition, and food for your dwarves.\nRTS\nAt the outset you find the recipes for basic tools and items, and build a small house with places to sleep and eat. Then, the size of the tribe increases and catches the attention of other inhabitants of the world. Most of them are night creatures and dwell underground. The worlds are full of fantasy creatures like zombies, skeletons, goblins, beholders, ghosts, giant spiders, and others. Some of them pay little attention to the dwarves, as long as the dwarves do not come into their field of vision. Others gather into quite large groups and try to break into the dwarves’ residence.\nTOWER DEFENSE\nEspecially dangerous are the waves of monsters that appear from time to time from portals. So, do not neglect to build a safe haven with strong walls and numerous trapdoors, cells, firing towers, and secret passageways.\nMAGIC\nAs a divine being, you possess various spells. You can speed up the movement of the dwarves, open small portals, illuminate dark caves to scare away monsters, evoke natural magic in the form of rain or tree growth, hurl fireballs at the monsters’ heads, and find useful resources and hidden rooms underground, thereby helping to speed up resource extraction, exploration of the world, and the population growth of your assistants.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dekovir Entertainment","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":303614,"name":"Smile For Me","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8f/d8fb2f96895826dacfb62ab91d340008.jpg","description":"Smile For Me is an unconventional Point-and-Click Adventure Game that puts you at the center of an abstract world! Nod and shake your head to chat with new friends, and solve their mysteries to cheer them up.\nThe People are bizarre, the Puzzles are Wack, and the World hides a sinister secret...\nKeep Your Chin UpYou may be silent, but you’ve got a lot to say! Nod-and-shake your way through the Habitat, with a host of funky and friendly characters.\nA Quaint Cast of MisfitsThe Habiticians are full of juicy gossip. Learn their quirks and qualms, and cure them of their blues!\nMake your Choice...Help only your favorite pals, or stay behind to save all the Habiticians.Features:Explore a beautiful world\nSolve a mouthful of tricky puzzles\nChat with 23 peculiar charactersBut that’s not all!There are charming animations!\nSecret backstories!\nTOO much gossip!There’s more!!Emotional baggage!\nAlarming puppetry!\nA condescending narrator!KEEP IT GOING!!!Depressed clowns!\nFear of mortality!\nThe true meaning of friendship!\nWhere am I?!?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Gabe Lane","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":24940,"name":"The Sims 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d26/d263d8d035027185193ddd253a6e3479.jpg","description":"Explore the wide-open world of The Sims 2 as you guide your custom Sims in their quest to become a rich and powerful mogul. Build and run your own hotel in Strangetown. Keep the cash coming in by maintaining it and keeping the guests happy. Design paintings for the gallery and record music for the lounge through Touch Screen mini-games. Make sure Strangetown’s Sims are happy and you just might uncover their hidden secrets.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Maxis","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"}]},{"id":23760,"name":"Bayonetta 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d7/3d7c8e749b18cfc898c80016594981fe.jpg","description":"Wield wild weapons and execute deadly moves—like the powerful Umbran\nClimax—to take out angels and demons in this breathtaking action game.\nYou can even team up with friends in 2-player online or local wireless\nco-op fights (additional accessories required; sold separately.)\n\nBayonetta is a butt-kicking, havoc-wreaking witch who wields sweet\nweapons like pistols, whips, hammers, flamethrowers, and poison bows.\nBut it’s not just about brawn—it’s also about style. Bayonetta is deadly\nbut sleek, with moves like Witch Time that slows down time itself, and\nthe all-new Umbran Climax—a special magic attack that summons Infernal\nDemons to devastate enemies. The Bayonetta™ 2 game also features an\nonline and local wireless 2-player cooperative mode where players bet\nhalos on their performance and work together to amplify their sass,\ncause destruction, and score some riches.\n\nFoxy, sassy Bayonetta is a butt-kicking witch who’s back to wreak havoc\n\nWield stylish moves and deadly weapons—like a poison bow and\nflamethrowers\n\nUse magic to execute Umbran Climax and summon Infernal Demons to do\nyour bidding\n\nTeam up with other players in the 2-player Tag Climax co-op mode via\nlocal wireless or online (additional accessories required; sold\nseparately)\n\nThe original Wii U version of Bayonetta™ game is now on the Nintendo\nSwitch™ system—included with the packaged version of Bayonetta 2 as a\npack-in digital download code","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Platinum Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"}]}]