[{"id":19670,"name":"Marine Sharpshooter II: Jungle Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cce/cced5da5dea1b1728140d8cfec7c10b0.jpg","description":"In this follow-up to the hit Marine Sharpshooter, you'll be a lone operative fighting to restore democracy in an African country. The President of Burundi has been taken hostage by rebels and mercenaries. The brutal civil war that would ensue from this will threaten American interests - so you'll use your elite military training and advanced weapons to take the rebels down!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Jarhead Games","platforms":[{"id":0,"name":"PC"}]},{"id":236714,"name":"Beat Hazard 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70f/70f1dc777211d4449bea601c62cb8ba9.jpg","description":"Gameplay Powered by YOUR Music!\nExperience your music collection as never before with this intense music driven arcade shooter.\nEach of your songs will have its own unique ebb and flow based on the music. Beat Hazard 2 seamlessly mixes the love of gaming and music. Together they become greater than the sum of their parts.\nBeat Hazard 2 improves on and ramps up the awesome zen feeling of battling to your own music. Power up your spaceship and watch as the music boosts your firepower. Unleash hell on the enemy ships when you max out with weapon pickups!\nPushing the boundaries of music powered gameplay, the sequel will include procedurally generated boss ships. Each track will create a unique archenemy ship for you to vanquish.\nPremium music streaming services will be supported via an 'Open Mic' system that can listen in to any music source. Now the music world is your oyster, play to Spotify, Amazon Music, Apple Music, YouTube, or any other provider!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cold Beam Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":52389,"name":"Pool Panic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a70/a70d84d401073fa8498ef7cc6ee0b36b.jpg","description":"Pool Panic is the world’s least realistic pool simulator. Play as a mischievous, and dare we say, oblivious cue ball in a giant game of pool that sprawls across a colorful cartoon overworld with more than 100 levels.\nExplore jungles, deserts, carnivals, cities and more while knocking around a peculiar cast of billiard balls, most of which won’t appreciate being pocketed.\nNote: Pool Panic plays best with a controller\nEvery level of Pool Panic has an 8-ball, but he won't be standing around waiting to be potted. While you seek him out, you'll be occupied by plenty of strange activities involving balls:\nRide a Ferris Wheel! Knock off other balls for your own gain!\nExplore caves where even the bats are balls!\nPlay nine holes of mini-golf with a pool cue!\nFlee the zombie horde! But careful, they're contagious!\nGo skiing and mountain climbing! With balls!\nHunt boy scouts in the woods! Steal their hats! Wait...\nExplore a colorful overworld with more than 100 levels. Shoot pool in deserts, gardens, cities, the carnival, the woods, and more\nGet mad at balls that dash away from you, think strategically about when to hit toothy balls that can unleash stomp attacks, and line up the perfect shot.\nTake down bosses and join a motorcycle gang chase.\nUnlock higher levels of the central tower as you travel the world. What awaits you at the top?\nChallenge up to four of your friends in local multiplayer.\nHats. This game has hats.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rekim","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":2243,"name":"Orborun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99d/99d7fc8df05e0c896db75b2615d5db38.jpeg","description":"Orborun is a 3D action skill run & roll game!\nControl your Orbot to collect the goods, avoid the obstacles and escape the hazardous Orbo-world. Complete levels on perfect run to get more bonus. More than 100 levels, local co-op multiplayer, feeling of speed and adrenaline, twisted levels in haste/puzzle and hazard shaped different worlds and cool Orbot skins makes this game fun to play for ages!\nPlayers have mentioned that Orborun gameplay would be perfect on PC, fast-paced action is just made for game-pad controller. Today Orborun gets a huge upgrade, new features, special effects, quality boost and much more so that PC players could rediscover the rolling games genre again!\nFEATURES\n- Fast paced, fun & uber challenging\n- Rediscover the rolling ball games genre\n- Local co-op mode to play with your friends\n- Game pad support\n- 100+ various and rich levels in 3 robotic environments\n- 3 different robots with 27 cool Orbots skins to unlock\nTROUBLESHOOTING\nSome users reported issues with garbled video on Mac OS X. Updating your drivers (https://support.steampowered.com/kb_article.php?ref=1244-WEJN-0804) usually helps, however if it does not, launch Orborun in windowed mode.\nTo select video options (custom resolution, windowed mode, etc.) hold ALT key (Option key if you are on Mac) while launching the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Tiny Lab Productions","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19110,"name":"Wizardry 8","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/722/72230cc64b3165e027fdb80473661257.jpg","description":"A New Wizardry for a New Generation\nThe universe is in the throes of violent upheaval and change. Vast and mysterious forces are preparing for the final confrontation. A small group of heroes from distant lands must plunge into the heart of the maelstrom, to uncover long-forgotten secrets, and bring about a new era. Should they succeed, they will gain the powers of the gods themselves. If they fail, countless worlds will fall into the grip of darkness.\nWizardry 8 raises the standard for fantasy role-playing with a vengeance. Prepare yourself for a new level of excitement, immersiveness and depth that made role-playing games one of the best-selling, best-loved genres of all time.\nPrepare to experience the culmination of a prestigious RPG series. Enter a vast world of intrigue and wonder. Unravel a gripping, non-linear storyline. Battle your way to victory using your swords, your magic, and your wits. Compete with rivals or align with allies as you struggle to ascend to the Cosmic Circle. Take the battle to the dreaded Dark Savant in Wizardry 8, the phenomenal conclusion to the Dark Savant trilogy, one of the most extensive and challenging stories ever told in classic role-playing games!\nThis is the legacy of Wizardry 8!\nExplore a vast 3D world filled with action, magic and adventure. Wander through dark dungeons, lush landscapes, scorching volcanoes and even beneath the sea.\nCreate your own custom party of adventurers. Make a gnome gadgeteer, a lizardman fighter, a rawulf lord or even a faerie ninja. the possibilities are endless!\nChoose a custom personality for each character and hear them speak over 100 lines of dialogue; Kindly or Chaotic, burly or surly-how your characters act is up to you.\nTalk to dozens of intelligent characters. How you treat them determines whether they become powerful allies or deadly enemies.\nBattle over 300 types of monsters in some of the most intense combat ever seen in an RPG. The unique auto-targeting system makes combat easy to learn, while the huge number of strategies adds unprecedented depth.\nAdvanced creature A.I. brings a new level of realism to RPGs. You don't just hunt the monsters-the roaming monsters hunt you.\nCast over 100 spells using a unique power-level system that guarantees that no spell ever becomes obsolete.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Sir-Tech Canada","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":442839,"name":"Observer: System Redux","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ac/9acdbcf11b7aa2c9d629ee38f8fa8c71.jpg","description":"Observer: System Redux is the definitive vision of the award-winning cyberpunk thriller, rebuilt and augmented for the next generation. You are Daniel Lazarski, portrayed by late Rutger Hauer, an elite investigator of the future able to hack into the minds of other people.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bloober Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":407547,"name":"Torchlight III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10c/10ca05d82f1e1db800e6bc2314895383.jpg","description":"Return to the Torchlight universe when the dungeon crawler, previously known as Torchlight Frontiers, releases as Torchlight III in summer 2020 on Steam.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Echtra","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":388968,"name":"Nebuchadnezzar","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e3/8e33971c4d6c732db61a1f2f71d170da.jpg","description":"Nebuchadnezzar is a classic isometric city builder game inviting players to experience the mysterious history and culture of ancient Mesopotamia. In the campaign, players get to rule over influential historical cities filled with magnificent monuments.GameplayFrom plowing fields to creating products, players must oversee the manufacturing of agriculture and goods for the city population. Players have an arsenal of tools to optimize their objectives. In addition, a maximum overview of their city helps players to solve problems and prevent population loss. Nebuchadnezzar’s gameplay is geared towards all types of players: from beginners of the genre to experienced strategists.\nCampaignNebuchadnezzar’s main campaign contains 16 historical missions covering the colonization of ancient lands to the conquest of Babylon by Persians in 6th Century BC. Each mission summons a different time period in Ancient Mesopotamian history. Players must carry out tasks important to the specific time and place of each mission, including the construction of historical monuments.\nMonumentsDuring the campaign players will not only build complex ancient monuments, but design them too. Nebuchadnezzar features an in-game “monument editor” giving players complete control over their buildings. From structural design to color scheme to final details: it’s in the hands of the player. Will you recreate history or make history? It’s up to you.\nMods & LocalizationNebuchadnezzar was created with mods and localization in mind. Modders will be able to create their own buildings, goods, and monuments. And in addition, they can invent new missions and campaigns. All definition files are written in the easy to read Lua language. Localizing mods will not be a problem. You can create mods in multiple languages and/or add languages to existing ones. This applies to the base game as well.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nepos Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":53471,"name":"Phoenix Wright: Ace Attorney","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02d/02da3c4a7c5cd335a9d45e24cdf1df6f.jpg","description":"Phoenix Wright: Ace Attorney is a visual novel adventure video game developed by Capcom. It was originally released for the Game Boy Advance in 2001 in Japan, and has since been ported to multiple platforms. The Nintendo DS version, titled Gyakuten Saiban Yomigaeru Gyakuten in Japan, was released in 2005 in Japan and North America, and in 2006 in Europe, and includes an English language option. The game is the first entry in the Ace Attorney series, and has received several sequels and spin-offs.\nThe story follows Phoenix Wright, a rookie defense attorney who attempts to get his clients declared \"not guilty\". Among other characters are Phoenix's boss, Mia Fey; his assistant and Mia's sister, Maya; and prosecutor Miles Edgeworth. The player controls Phoenix through two types of sections: investigations and courtroom trials. During investigations, they gather information and evidence, and during trials, they cross-examine witnesses and answer questions from the judge, the prosecutor, and the witnesses. The story is split into five cases, the fifth being introduced in the Nintendo DS version to take advantage of gameplay elements using the handheld's touchscreen and not available in the original Game Boy Advance version.\nDevelopment of the game was handled by a team of seven people over the course of ten months. It was directed and written by Shu Takumi, and was originally planned to be a Game Boy Color game about a private investigator. The game was designed to be simple, as Takumi wanted it to be easy enough for even his mother to play. While the original version of the game takes place in Japan, the localization is set in the United States; this became an issue when localizing later games, where the Japanese setting was more obvious.\nThe game has been mostly positively received by critics, who have appreciated its premise, writing, characters and presentation. The game has been a commercial success both in Japan and internationally, with the North American release selling higher than expectations and being hard to find in stores shortly after release. Other media based on the game has been made: a manga series premiered in 2006; a film adaptation of the game, titled Ace Attorney, premiered in 2012; and an anime series adaptation started airing in 2016.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Capcom","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Android"},{"id":0,"name":"Game Boy Advance"}]},{"id":26824,"name":"The Legend of Zelda: Skyward Sword","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/884/884d12f527a9a12b5e486ee1b79ecf7f.jpeg","description":"One of the most storied franchises in history soars to new heights. The\nLegend of Zelda™: Skyward Sword shakes up the tried-and-true\nadventure game formula and marks a turning point for the franchise. The\nintroduction of full motion controls to the series enabled by Wii\nMotionPlus™ technology enhances player movements while offering the most\nintuitive play control of any game in the series to date.\n\nFEATURES:\n\nThe Legend of Zelda: Skyward Sword boasts the most realistic\nsword combat of any game to date, turning every encounter into a\nchallenge of both brains and brawn. Wii MotionPlus technology\naccurately translates the angle of every sword slice, effectively\nputting Link's blade in the player's hand. Analyzing enemy attack and\ndefense tendencies and counteracting with precise swings of the sword\nprovide a satisfying experience that blends puzzle-solving with a new\nand distinctly unique combat system.\n\nExplore a massive, multilayered world that seamlessly blends soaring\nexploration in a sea of clouds with intense ground-based adventuring\nthat blurs the line between the main world and traditional Zelda dungeons.\nLink™ soars through the skies on the back of a noble bird and dives\nbeneath the clouds to the continent below in an epic quest that lays\nthe foundation for the events in the critically acclaimed The\nLegend of Zelda: Ocarina of Time.\n\nPrepare for intense puzzle-solving as only The Legend of Zelda games\ncan deliver. Exploration of the forests, volcanoes and deserts\nrequires players to think on their feet as they solve puzzles,\novercome obstacles and escape deadly traps. Once they find their way\nto each dungeon, they are confronted by even more puzzles guarded by\nfiendish enemies.\n\nThe Legend of Zelda: Skyward Sword redefines the traditional\nZelda framework and introduces an arsenal of items, upgrades and\nrewards unlike any game in the franchise to date. The adventure guides\nplayers into, out of and back to dungeons and areas they've already\ncompleted. Along the way, Link gathers a massive inventory of peculiar\nitems and resources that can be used to upgrade many of his weapons\nand equipment.\n\nEvery copy in the initial production of the game will come packaged\nwith a special music CD featuring orchestral arrangements of select\nsongs that will be performed at The Legend of Zelda 25th Anniversary\nSymphony Concert.\n\nA Wii Remote Plus™ controller or Wii MotionPlus™ accessory is required\nto play The Legend of Zelda: Skyward Sword. There will also be\na limited edition bundle version of the game available, with a Gold\nWii Remote Plus™ controller included. LEARN\nMORE >\n\n*Note that the gold controller will simply be gold in color and will not\ncontain any actual precious metals. Sorry.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"}]},{"id":24881,"name":"Pac-Man","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef3/ef3d2c3fe94361a3a3ef2dab06daa144.jpg","description":"You control everyone's favorite iconic Pac-Man as you navigate through\nmazes, eating Power Dots while simultaneously avoiding the devious\nGhosts. Warp from one edge of the maze to the other using the Warp\nTunnels, or eat a Power Pellet to turn the tables and make the Ghosts\nvulnerable! In order to clear the stage, you'll need to eat all the\nPac-Dots! See just how far you can get through the stages before losing\nall your lives! Fruits, such as cherries and strawberries, will give you\nextra points to help you reach the highest score!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1980,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Atari 5200"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Atari 2600"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Game Gear"},{"id":0,"name":"PC"},{"id":0,"name":"Apple II"},{"id":0,"name":"NES"}]},{"id":21055,"name":"Not The Robots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b5/4b53e8b7b184230de02737ed78995231.jpg","description":"You are a robot in an office building. You have to eat furniture and not get caught. A mysterious story unfolds.\nNot The Robots is this year’s most exciting Roguelike Stealth Furniture Eating Simulator. It’s a game with random levels, permadeath, and the goal of eating furniture - which is also your stealth cover.\nA seven-building Campaign Mode of increasingly brutal (and fully procedural) levels\nFearsome machine-gun-equipped patrolling guards to avoid and trick\nSpotlights, lasers, bombs, and other traps to sidestep\nTons of crafty gadgets to master\nContains an unlockable sequel to \"You Find Yourself In A Room,\" a previous game from 2DArray\nShort/medium/long game modes for play sessions of any size\nMysterious and fully-voiced storyline to gradually explain the game's strange setting\nController support\nThe year's most exciting furniture-eating stealth game!About 2DArray\n2DArray is previously known for web game hits like Company of Myself, Fixation, Fisher-Diver, and Spewer. This is their first commercial game, supported by tinyBuild GAMES.\nFollow @2DArrayAbout tinyBuild GAMES\ntinyBuild GAMES is an indie game development and publishing company. No Time To Explain is their first game. It came out of a successful Kickstarter and Greenlight adventure. They're currently working on a bunch of games:\nCo-developing SpeedRunners -- currently in Early Access on Steam\nWorking with 3rd party devs on games like Not the Robots (live on Steam)\nPreparing to release Fearless Fantasy and other unannounced titles\nUnannounced super-secret in-house game\nFollow @tinyBuild","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2DArray","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19274,"name":"Assassin’s Creed Chronicles: India","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e99/e9969ab76756fe041aaa72cdeb768649.jpg","description":"Embody Arbaaz in his quest for retribution through a colourful depiction of 19th century Colonial India in 2.5D stealth gameplay.\n• Travel across an amazing 19th-century India and its legendary landmarks\nDiscover an exquisite depiction of Colonial India thanks to a palette of vibrant colours. Zip-line across the streets of Amritsar, hide in the shadows of the palace, and hunt legendary artifacts, following in the footsteps of Alexander the Great.\n• Experience the thrill of being a stealthy assassin\nAs a smart and charming Assassin, use new subterfuges to disguise and to loot. Discover all-new Assassin’s gear such as the talwar (curved sword) and chakram (circular throwing weapon) to deal great damage and interact with the environment.\n• Showcase your fighting talents with the new double kill move, helix strike, or silent takedown. Be more agile than ever in even more platforming levels, and escape through the destructible environments of the squares and bazaars, leaving a trail of chaos in your wake.\n• Discover a brand-new challenge mode\nUnlock various challenge rooms: your skills and abilities will be pushed to their limits through a complex sequence of obstacle course. Beat the score to collect artifacts, fulfill special contracts and assassinate in an exciting new game experience!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":19235,"name":"Majesty Gold HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f99/f997d3b8035c974344125fa2807fe203_uE36jXT.jpg","description":"The High Definition edition of Majesty Gold contains main game, the Northern Expansion Pack as well as 2 new quests and several other graphics and gameplay updates.\nMajesty is a Real-time strategy game with indirect control – your heroes have a will of their own! Your rule is not absolute, as you face subjects that are independent, stubborn -  and greedy. They will need a great deal of persuasion (ok, gold) before they carry out your wishes...\nKey features:\nTwo additional quests, The Wrath of Krolm and The Balance of Twilight\nThe game can now be set to run at all common resolutions\nCompatible with Windows 7, Vista, and XP operating systems\nMany other gameplay bug fixes, improvements, and refinements","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Cyberlore Studios","platforms":[{"id":0,"name":"PC"}]},{"id":3085,"name":"Dragon Fin Soup","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed3/ed3e0ff5c28bc4369adf766867c80742.jpg","description":"Dragon Fin Soup seamlessly blends genres to create a fresh experience: half story-driven tactical RPG and half high-stakes roguelike, with a pinch of crass humor and a heaping helping of murder & madness set in a procedurally generated fantasy world.\nMeet Red Robin - a charming, yet raging alcoholic bounty hunter, who’d rather get into a bar fight than deliver baked goods. Players must take up Robin’s blades and set out across Asura, a lushly colorful fantasy world that sits on the back of an enormous space turtle, on a journey to discover the secrets of her bloody past.\nWARNING!!!\nThis game is not for the casual player and can be highly addictive.\nDragon Fin Soup contains the following:\n- Superfluid turn-based tactical combat\n- Raging alcoholic bounty hunter heroine\n- New procedurally generated world each time you play\n- Mercenaries for hire and awesome pets to collect\n- Over 60+ hours of roguelike gameplay in Story, Survival & Labyrinth modes\nDragon Fin Soup is hand crafted by a 5 person indie development team - Grimm Bros LLC.\nLearn more about Dragon Fin Soup at www.DragonFinSoup.com!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grimm Bros","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":1082,"name":"Hero Academy","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edc/edc436cb992c4454d184ee300add4906.jpeg","description":"Hero Academy is a two-player turn-based tactics game. The game is the first release in the series. \n\n###Gameplay\nIn Hero Academy, the player takes turns moving units on board and attacking enemy assemblies. The goal is to be the first to destroy the other player's crystal or to kill all of the other's units.\nEach battlefield consists of 9x5 squares; it is a lot like chess: the game is focused on strategy, it requires careful planning before each step. Each player has one or more crystals. Each turn gives five moves in the game. Units are played from a hand which is replaced at the end of each round; it is renewed with new units chosen randomly. Also, a player's hand can contain spells and healing liquids as well as weapons and armor. The leaderboard shows the player's progress, the last battle's scores. Customization includes teams lists, avatars, upgrades, and taunts. \n\n###Key features\nThe game contains six factions also known as Heroic Teams: Council, Dark Elves, Dwarves, The Tribe, Team Fortress 2, Shaolin. Team Fortress 2 and Shaolin are special editions; the first one is made for Steam users (now it is available on other platforms), the second one is for the Chinese players. It is referred to as the success Hero Academy had in China when first released.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Robot Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":833441,"name":"Tower of Fantasy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e35/e35b2e3c8e62e27152cc56cd56307497.jpg","description":"Embark together on your fantasy adventure!\nSet hundreds of years in the future on the distant planet of Aida, the shared open-world MMORPG, anime-infused sci-fi adventure Tower of Fantasy from developer Hotta Studio and publisher Level Infinite, is now available on PC and mobile platforms globally. Players will be able to experience an anime-inspired post-apocalyptic sci-fi art style, freeform character development, and exciting combat through thrilling battles and exciting open-world exploration.\nIn Tower of Fantasy, dwindling resources and a lack of energy have forced mankind to leave earth and migrate to Aida, a lush and habitable alien world. There, they observed the comet Mara and discovered an unknown but powerful energy called \"Omnium\" contained in it. They built the Omnium Tower to capture Mara, but due to the influence of Omnium radiation, a catastrophic disaster occurred on their new homeworld.\nImmersive Open-World\nExperience a vast alien world full of beautiful open vistas and imposing futuristic structures.\nUnique Characters\nWield the unique weapons of each character that grant different gameplay styles as you explore their compelling backstories.\nGrow and Explore Together\nParty up with friends online and take on new adventures in the shared open world.\nEpic Combat\nEngage in epic battles against enemies of all shapes and sizes as you switch weapons and gameplay styles on the fly to unlock your own personal fighting style.\nExplore and Interact\nExplore and interact with a vibrant living world as you discover your own journey through it.\nTo learn more about Tower of Fantasy, go to https://toweroffantasy-global.com or check out our other official channels:\nFacebook: https://www.facebook.com/Tower.of.Fantasy.Official\nInstagram: https://www.instagram.com/@toweroffantasy_official\nTwitter: https://twitter.com/ToF_EN_Official\nYouTube: https://www.youtube.com/channel/UC1NbDLZjc41RQk-pV94mu_A/about\nDiscord: https://discord.gg/eDgkQJ4aYe","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Level Infinite","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":408286,"name":"13 Sentinels: Aegis Rim","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be8/be8896348e804287dfd44323bac7380e.jpg","description":"13 Sentinels: Aegis Rim is a cross-genre video game developed by Vanillaware and published by Atlus for the PlayStation 4. It was released in Japan in November 2019, and is planned a worldwide release in 2020.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"VanillaWare","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":61904,"name":"Space Hulk: Deathwing - Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af9/af9ed0baec95fcb0ff654b5f21acf20f.jpg","description":"Twitch Dev Session\nAbout the GameSpace Hulk® Deathwing™ Enhanced Edition is a First-Person Shooter based on Games Workshop’s cult classic board game set in Warhammer 40,000 universe. Expanding upon the original game, and featuring a host of new content, new features and a richer multiplayer mode, the Enhanced Edition is the ultimate Space Hulk: Deathwing experience.\nPlay as a Terminator of the Deathwing – the feared 1st Company comprised of the elite of the secretive Space Marine Chapter, the Dark Angels – and engage in a desperate battle against Genestealers, within the claustrophobic confines of a Space Hulk. Grow stronger, gaining skills, new abilities, and powerful equipment as you earn experience across perilous missions. The Enhanced Edition brings a host of fresh features to enjoy in both solo and multiplayer: a new class, an expanded arsenal, deadly new enemies, a deep online customisation system, and a new Special Missions mode bringing infinite replayability with randomly-generated missions for every game chapter.\nStrap on your Terminator armour and equip the iconic weaponry of the Space Marines to overcome the threats lurking deep within Space Hulk Olethros!NEW IN THE ENHANCED EDITION:SPECIAL MISSIONS GAME MODE\nCHAPLAIN CLASS\nEXPANDED ARSENAL\nDEADLY NEW ENEMIES AND A DEEP CUSTOMISATION SYSTEMNEW: SPECIAL MISSIONS GAME MODESpecial Missions bring infinite replayability to both solo and multiplayer modes, with randomly-generated objectives and enemy spawns for every game chapter.\nNEW: CHAPLAIN CLASSThe Chaplain is a powerful addition to any Terminator squad. Wielding the Crozius Arcanum power mace, the Chaplain’s armour allows him to fearlessly wade into even the fiercest Genestealer swarms.\nNEW: EXPANDED ARSENALThree new weapons will the arsenal of players in both solo and multiplayer, including the devastating Stormbolter Mk. II!\nNEW: DEADLY NEW ENEMIES AND A DEEP CUSTOMISATION SYSTEMPlunge into the Space Hulk and experience a desperate battle against the Genestealers, including new, deadlier enemies. Customize each class in solo and multiplayer and unlock devastating weapons, including an expanded arsenal exclusive to the Enhanced Edition.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Streum On Studio","platforms":[{"id":0,"name":"PC"}]},{"id":49375,"name":"Superflight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16c/16c2675d137e622b9d9914a1b5350cbc.jpg","description":"A quick note from the developers:\nSuperflight is a game about flying in a wingsuit through colorful mountainscapes and scoring as many points as possible by pulling off risky proximity maneuvers. If you enjoy simple games about flying and speed, look no further! The controls are super intuitive and easy to learn, and there is an endless amount of procedurally generated maps for you to explore.\nGrizzlyGames is a very passionate but small team of three students, so please keep that in mind when you think about buying Superflight. It’s not a huge game with hours and hours of content. What we would like to offer you is a simple game that gives you the feeling of intense speed, high adrenaline moments and beautiful vistas to explore at the price of a coffee to go.\nPlease feel free to contact us if you have feedback, questions, or problems with the game. We’ll do our best to get back to you as quickly as possible and provide support if needed. Also let us know if you enjoyed the game, because that makes our day!\nThis game offers you:\nIntuitive high speed flying gameplay\nEndless amount of procedurally generated maps\nA seed system that lets you share maps with other players\nBright beautiful colors\nGreat for playing for a little while every now and then to discover some new maps and see if you can beat your old highscoreThis game doesn’t have:\nHelicopters\nOnline leaderboards\nGuns\nLeveling system\nA Soundtrack\nLootboxes\nA cinematic story\nOnline multiplayer\nTwitch live integration\nCharacter skins\nOrcs.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"GrizzlyGames","platforms":[{"id":0,"name":"PC"}]},{"id":21683,"name":"Fork Parker's Holiday Profit Hike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b54/b54ca1e652cab52ba0f6f41df654db0c.jpg","description":"The fiscal year is coming to a close and poor Fork Parker has lost all his wonderful profit to greedy developers and their endless thirst for royalties! Grab a martini and ride your private helicopter to the snow capped mountains and hunt down the riches you so rightly deserve. Jump, dash, and rappel your way up the sheer mountainside to scratch out a little profit and meet the demands of an increasingly angry board of directors!\nFork Parker's Holiday Profit Hike features snow, helicopters, ugly holiday sweaters, non-denominational penguins, a title screen, dope beats, ethics, torches, reverse monetization, hot tubs, non-candied canes, falling, ropes, and non-refundable holiday cheer.\nFollow @DevolverDigital on Twitter and join the Devolver Digital Super Fun Club on Steam for more fun and games. Sometimes free games. But not all the time, it would make Fork Parker sad.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dodge Roll","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20202,"name":"8BitMMO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/236/23638815227ef9bd0203217d1f2f7ef2.jpg","description":"8BitMMO is a retro-style 2D massively multiplayer game! It's a giant construction sandbox -- you can build a home or a castle in a persistent streaming world. Found and manage your own city. Fight evil LawyerCats and engage in Player vs Player battle.Features\n100% Player Built World - The entire world is built by players.  Build your own house, town, voxelart, or dungeon.  The world is massive -- there's plenty of space to build in, and it streams in as you explore (no load screens).\nBe the Mayor - Start your own town and invite your friends.  You'll have an array of management tools for overseeing your town.\nInteractive Development - The entire game only has one full-time developer, and development is still ongoing.  You can submit and vote on ideas -- many of the top voted ideas have been implemented into the game.  Free updates with new content and features are frequently released.\nAnti-Griefing Systems - Several systems protect players from griefing.\nFree To Play - No purchase necessary to have fun.  Support the developer and buy a fancy hat... or don't.  (Premium items give NO competitive advantage)\nCustomize your Character - Wear hats, clothing, accessories, change your skin color\nBecome a Zombie - Want to be a zombie?  You can!  But you'll need a steady supply of delicious brains from other players.  Don't worry, after you eat their brain, they'll be zombies too!\nFight Nefarious Enemies - Congressional Lobbyist Slugs, LawyerCats, and Hipsters oh my.\nMegaMap - The world is huge, so the MegaMap interface (based on Google Maps API) is a handy way to browse the world and share your creations with friends.\nMusic - Enjoy chiptune from legendary artists Danimal Cannon, Zef, PROTODOME, and Honin Myo Audio.Introducing the Steam Founder's PacksPlease consider supporting development by optionally purchasing a Steam Founder's Pack.  You will receive a variety of benefits:\nAfter you have purchased a Steam Founder's pack, please restart the game launcher for the game to detect the purchase.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Archive Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17996,"name":"Nyctophobia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e61/e61da6f1b6575482206c71577dda690c.jpg","description":"As you make your way through an underground megastructure, you fall into an area with a long-lasting power outage. Your only way forward is to find a path towards the elevator, in the surrounding darkness, which will lead you to a higher level. Hopefully leading out of this place. Tread the pitch black corridors of the structure, and try to find your way out. GAMEPLAYUse various devices at your disposal, to illuminate the darkness. Use the torch to illuminate your close surroundingsThrow flares to create a mobile source of lightPlace beacons to mark your way Find the elevator and use it to travel from one floor to another. Solve problems preventing your journey, and continue onwards. COLLECTIBLESSome levels contain collectible upgrades for the player characters.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lightning Man Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":294128,"name":"Suzerain","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/096/09627345aa95f0636ea89d326e6ea17c.jpg","description":"Suzerain is a text-based narrative role-playing game focused on politics. It takes place in an alternate reality set in the 1950s with unique countries, cultures and characters. In this interactive world, the player is on a journey where they can express themselves politically, morally or pragmatically as the President of Sordland, as well as a father and husband.\n\nThe artistic aim and philosophy of the game is to put the player in the shoes of being a political leader at the personal level, delving extensively into power relationships, hard choices and real consequences. We strive to answer a few questions regarding the complexities of politics and raise even more questions about the driving force behind certain behaviours.\n\nTherefore, we set out to create a realistic and engaging story which is conveyed through the interactive and multi-conversant capable conversation system. This core element is further supported by other story or game mechanics such as factions, budget, constructions, countries, news, situations and policies which influence and/or react to player choice.\n\nMoreover, the game expands on other serious complex topics such as security, economics, freedoms and many more while allowing the player to reflect their own views by steering them. The powerful role of being the president enables expression in the form of decisions that shape the country along with its citizens in different ways. There is no right or wrong, only actions and sensible reactions.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Torpor Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12233,"name":"Cube Destroyer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c18/c18b8794d64871b06122f81a5d17bba7.jpg","description":"Now Availablehttp://store.steampowered.com/app/603190/\nNow Availablehttp://store.steampowered.com/app/654770/\nAbout the GameCube Destroyer is a top-down shooter with a dynamic gameplay.\nDodge bullets and destroy enemies.\nFactories at the different levels are continuously producing enemies.\nYou must destroy the factories before the enemies surround you.Features:75 levels\nDynamic gameplay\nMinimalist graphics","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Freedomize Studio","platforms":[{"id":0,"name":"PC"}]},{"id":2802,"name":"Randal's Monday","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/566/566831990c0e3a351eed2b7b082194c4.jpg","description":"A kleptomaniac, a sociopath and a horrible friend. Randal is potentially one of the most scurrile protagonists since the invention of the hoverboard. Randal's Monday is a crazy space-time odyssey in classic adventure design, spiced up with countless geek culture references of the last 30 years.\nRandal wakes up after the engagement party of his best friend Matt; he's ridden by a raging hangover and also has Matt's wallet in his possession. Inside the wallet is his engagement ring and without thinking of the consequences, Randal sells the ring - and thus gets struck by a terrible curse. Matt commits suicide and now Randal is forced to relive the same ill-fated Monday over and over, trying to undo his mistake.\nRandal needs to retrieve the ring and sort his own life out, before things get any worse... Collapsing the whole space-time continuum-kinda-worse, in fact.\nAttention geeks! Randal's Monday offers black humor of the finest sort, all kinds of pop culture references and all that packed tightly into classic Point & Click adventure gameplay. It's a tribute to a whole generation of gamers, readers and watchers of retro and contemporary sub-culture formats.\nThe game features an epic voice over with Jeff Anderson as Randal Hicks, and Jason Mewes as the one and only Jay, accompanied of course by his inseparable friend, Silent Bob... who says nothing at all.Features:Playtime: depends totally on the time you've spent in front of your TV as a kid\nAbout a bazillion references to the geek culture\nNo Zombies! (Let's be honest, they are kind of a feature nowadays...) Then again, in fact... We got some of those, so: ZOMBIES!\nA ton of unexpected twists... And even more twists you'll see coming from a mile away\nA hilarious script, written by the best friend of the neighbor of the guy who's Terry Pratchett's barber","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1818,"name":"Valley","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cbe/cbeaf7256ab2eec1c928cc0286fabc3b.jpg","description":"Explore the vast and beautiful world of Valley using the power of the L.E.A.F. suit: a fierce exoskeleton that grants exceptional speed and agility along with the phenomenal ability to manipulate the life and death of all living things.\nExperience the adventure of a lifetime\nValley is a First-Person adventure unlike any other. Hidden deep within a remote region of the Rocky Mountains, you find yourself bewildered within a secluded valley. With the power of a recently discovered L.E.A.F. suit (Leap Effortlessly though Air Functionality), run and jump your way through beautiful forests, dangerous ruins and vast environments; all the while utilizing the power to control life and death to uncover the startling secrets of the mysterious valley.\nBe forewarned, with these new-found abilities comes a daunting repercussion: the more you experience death within the valley, the more the valley will die around you.Features\nMove faster, jump higher: make your way through the world of Valley using the incredible speed and agility of the L.E.A.F. suit.\nManipulate life and death: the L.E.A.F. suit grants its pilots the phenomenal power to both give and take life from any living thing.\nExperience a unique twist on death: the more you die, the more the valley will die around you.\nEnhance yourself: upgrade your suit with new abilities and strengths.\nExplore: the world of Valley is filled with forests, wildlife, ancient ruins, charming creatures, dangerous enemies and other mysteries.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blue Isle Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":37130,"name":"Halo 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3bf/3bfc3bd9fda76bf83f6cf1d788e1c7c7.jpg","description":"The Covenant alien race threatens to destroy all humankind, and the only thing standing in its way is Master Chief, a genetically enhanced supersoldier. Master Chief returns in Halo 2, which features new vehicles, weapons, environments, and more. This time, you can interact with your environment, wield two weapons at the same time, board opponents' vehicles, and even switch sides to play the role of a Covenant Elite. Halo 2 also supports broadband multiplayer action via Xbox Live.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Bungie","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox One"}]},{"id":19348,"name":"Death to Spies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/472/47264311e4c1feb004b375f4f47104e0.jpg","description":"Smersh is Russian for \"Death to Spies\" and was the name of a set of counterintelligence agencies formed in the Soviet Army during World War II. Their mission was to secure the rear of the active Red Army by arresting traitors, deserters, spies and criminal cells. During the war these agents became the main force combating the German intelligence service.\nAs captain of the 4th department of Smersh, it is your job to execute these operations in the heart of enemy territory. Be prepared to complete various tasks, including stealing important documents, eliminating enemy officers, kidnapping high-ranking officials, and sabotage enemy plans.\nThird-person stealth action immerses the player into the atmosphere of World War II military intelligence operations.\nDifferent types of missions based on real historical intelligence and counterintelligence operations.\nFreedom to choose the way a mission is completed.\nExtensive real-life indoor and outdoor locations.\nA variety of different spy skills at the player's disposal such as sneak, hide, carry dead bodies, change clothes, mine objects, throw knives, sniping, picking locks, setting traps and many others.\nAuthentic weapons and vehicles of World War II.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Haggard Games","platforms":[{"id":0,"name":"PC"}]},{"id":18398,"name":"Sinister City","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65b/65be6ef338fa29b9fb1d63258cc1aadb.jpg","description":"Our latest games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other adventures:http://store.steampowered.com/app/431260/\nhttp://store.steampowered.com/app/497400/\nTry other adventures:http://store.steampowered.com/app/396790\nhttp://store.steampowered.com/app/326190\nhttp://store.steampowered.com/app/347430\nAbout the GameWho would name their town Sinister City? Vampires, of course! When John discovers his bride-to-be has been kidnapped by Sinister City's number one bloodsucker, there's only one thing to do - search for hidden objects! And kill vampires! Or at least insult them until they give your girl back.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"PC"}]},{"id":17217,"name":"Royal Quest","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/305/305da434c96f84a1ce082cb0be2a0f64.jpg","description":"Royal Quest offers a fresh MMO experience from the creators of Space Rangers and King's Bounty series. Join Guild Wars, conquer Castles, and battle other players in unique PvPvE locations, or explore the vast world of Aura and enjoy the story on your own.\nInnovative elemental battle system allows players to exploit enemy weaknesses by properly choosing what weapons and skills to use against the target, while game mechanics are easy to learn (including an automatic character upgrade system), and offer deep and challenging experience later in the game.\nDownload now to:\n- Discover over 100 outdoor locations and multi-floor dungeons\n- Complete nearly 1000 quests designed for both group and single players\n- Fight more than 200 extraordinary monsters, each with its own rare card with special attributes\n- Dive into extensive skills and talents system and combine them in a unique way for each of the 8 classes\n- Summon pets that follow you around and collect loot for you\n- Compete in PvP Arenas, Battlegrounds and Castle Sieges\n- Earn the right to control a Castle and its surrounding areas with your Guild\n- Gather powerful Shadow Gear by winning over other players in special PvPvE zones\nPlay Royal Quest now for free, or empower your hero with our special DLC packs!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Katauri Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":12014,"name":"America's Army 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d63/d63d705c9179900754788602acfd8cb1.jpg","description":"Check Out the latest installment \"America's Army: Proving Grounds\"\nDownload AA3 Today and Become a Member of the elite America's Army Team!\nAmerica's Army fans and new players alike can now experience America's Army 3, the official U.S. Army game, which has more authentic military elements including training, technology, weapons, and audio than any other military game.\nBuilt on Unreal Engine 3, AA3 delivers stunningly realistic characters, environments, lighting effects, animations, and team-based experiences. In the game where Every Detail Counts™, players are bound by Rules of Engagement (ROE) and gain experience as you navigate challenges in team-based, multiplayer, force-on-force operations. With 15 different map/mission combinations and exclusive advanced training that allows you to unlock new abilities and customize your gear, you'll experience Soldiering in the U.S. Army like never before.\nFind strength like no other in a game like no other. Start your mission now!\nWhen you play AA3 on Steam, you'll earn Steam Achievements, ranking up among your friends as you earn distinguished status, badges, medals and ribbons. With AA3 on Steam, you can also save your keyboard bindings to the Steam Cloud - just login to your Steam account and fire up AA3 on any PC to utilize your custom settings.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"U.S. Army","platforms":[{"id":0,"name":"PC"}]},{"id":3002,"name":"Duke Nukem: Manhattan Project","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/24d/24d7163164c078e49f4c7e45e55fdf9e.jpg","description":"Total Mutant Mayhem on Macs!\nDuke Nukem takes his Mighty Boot to the Big Apple. Using G.L.O.P.P. (Gluon Liquid Omega-Phased Plasma), the maniacal Mech Morphix has transformed the creatures of New York City into an army of bloodthirsty mutants. In Duke Nukem: Manhattan Project, Duke must deploy W.I.N. (Weapons, Insults and Name-Calling) to rid the city of goo-based bad guys, and return peace and tranquility to The City That Never Sleeps.\nOriginally released to commemorate the 10th anniversary of Duke Nukem in 2002, Duke Nukem: Manhattan Project blends together the best elements of Duke Nukem 3D and the best 2D sidescrolling of the first two games in the series, Duke Nukem and Duke Nukem II.\nFrom babes, bombs and Battlelords, to goggles, guns and Gargoyles, revisit Duke's dynasty with these re-released classics. Return to a time when the King Of Action didn't need regenerative health or auto-aim - a time when action games were actually about action, an era when heroes had the strength to carry as many guns as they wanted and use as many cheats as they needed.\nCelebrate Duke Nukem's 20th anniversary in sunshade-wearing, quick-quipping style with a title that - alongside the re-release of Duke's first two adventures - recognizes a series that's had a tremendous impact on an entire industry, and represents the best of Duke in a way that no other game could.\n***   Key Features:   ***\nA Good Day To Duke: Rip 'em a new one with 9 brand new weapons, including the G.L.O.P.P. Ray, Pipe Bomb, Pulse Cannon and the almighty \"press-to-kill-everything\" X-3000.\nNew York, New York:  8 huge levels across various regions of New York City: Rooftop Rebellion, Chinatown Chiller, Metro Madness, Unholy Underworld, Fearsome Factory, Tanker Trouble and Deviant Drilling. And the last level is, let's say, a little out of town.\nEvil Has A Snout: Blast, jump and smart-ass through more than 25 enemies, including Pig Cops, Gator Grunts, and Roachoids.\nDuke The Director: A dynamic, zoomable camera allows the audience to catch Duke's best side. Both of them, of course.\nWhat Are You Waitin' For?: A potent blend of old school gameplay and smooth 3D visuals, Duke Nukem: Manhattan Project brings together the best of both Dukes for the ultimate Duke Nukem experience.\nLet's rock!","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"3D Realms","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":411611,"name":"Yakuza 5 Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d1/2d12bc8dab9d01bc0c0b60dbc34a8b22.jpg","description":"Experience the fifth chapter of the Kazuma Kiryu saga in 1080p and 60fps.\r\n\r\nIn December 2012, Kazuma Kiryu left his past as a \"\"legendary yakuza\"\" and his place of peace in Okinawa.\r\n\r\nHe now spends his days as a cab driver in a corner of Fukuoka's red-light district, hiding his true identity. All for the sake of fulfilling the \"\"dream\"\" of an important person.\r\n\r\nHowever, a disturbing atmosphere begins to drift through the supposedly well-balanced society of the Kanto and Kansai yakuza, emerging as a plot to drag all of the yakuza organizations in Japan to war.\r\n\r\nIn order to protect the \"\"dreams\"\" of his loved one, Kiryu is drawn into the vortex of battle once again.\r\n\r\nThis is the story of four men and a girl chasing their \"\"dreams\"\" in five major cities in Japan, presented on the largest scale of the series yet.\r\n\r\nComplete The Dragon of Dojima’s journey.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ryu ga Gotoku Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":20311,"name":"Ragnarok Online 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/203/20325be76ca9ec1bb08cbc087084882d.jpg","description":"Return to the beautiful and dangerous world of Midgard! Inspired by Norse mythology, the much-anticipated sequel to the groundbreaking Ragnarok Online has arrived! Immerse yourself in the new, but recognizable world of Ragnarok 2.\nVisit the large, capitol city of Prontera, form a party and explore the underwater Sea Temple dungeon, or set up a shop and earn a living for your character by accepting a job as an Alchemist, Artisan, Blacksmith, or Chef. Adventurers who have explored the world of RO1 will instantly recognize many of the famous monsters and landmarks as their journeys continue. The fun social experiences of character customization, guild creation and PVP play have also returned!\nRagnarok 2 is a free-to-play, fantasy MMORPG that takes elements from the original Ragnarok Online and re-imagines them as a three-dimensional, modern MMO experience.Key FeaturesExplore the Massive, 3D World of Ragnarok 2: Return to the world of Midgard and explore the familiar areas like Prontera, Alberta, and Morroc, as you’ve never seen them before as well as adventuring in the numerous new lands, dungeons, and caves!\nRevisit Familiar Lands and Creatures: Visit the famous capitol city of Prontera, battle the evil Baphomet, or run through fields filled with Porings. Rediscover the areas, allies, and monsters that you knew before in their new form!\nCreate & Customize Your Adventurer: Level one of the five base classes to the next tier and choose a specialization, explore and collect the armor and weapons of your Midgardian, and place your own, unique stamp on the world of Ragnarok 2.\nCraft Items and Open a Store: Immerse yourself in being an Alchemist, Artisan, Blacksmith, or Chef, create a variety of useful potions, armor, weapons, or food, and then open a store and sell your wares to other players!\nPvE and PvP Available to Any Player Type: Battle against the monsters and villains of Midgard, or test your mettle against other players in the Arena. Take it a step further at level  10, and try your hand at the coliseum for five stages of brutal battle! There are tons of opportunities available for solo players, groups, and even guilds who want to take part in PvP!\nFree-to-Play How You Choose: Ragnarok 2 has a simple, no commitment policy when it comes to free-to-play. If you want to purchase items, it’s on your terms. You can enjoy the world of Midgard no matter what path you choose, with no monthly subscription required to play!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"GRAVITY","platforms":[{"id":0,"name":"PC"}]},{"id":15268,"name":"SCUM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52a/52a46fbbb085ab9c012ed4c8532fa3f7.jpg","description":"The world’s unquenchable need for entertainment has turned towards bloodlust as entertainment behemoth TEC1 is set to premiere season two of its television sensation SCUM. This new season moves the contest from the rugged, enclosed Alcatraz sector to the full grandure of Bagne de Cayenne, an island with a sordid history of violent incarceration. Both fan favorites and new prisoners will clash in a ruthless war of survival while battling for the support of viewers, producers, and corporate sponsors for fame, gifts, and a chance of life after death.\nSCUM evolves the multiplayer open world survival game with unprecedented levels of character customization, control, and progression where knowledge and skills are the ultimate weapons for long-term survival. Players will balance base level needs with knowledge-based skills to manage everything from nourishment, metabolic rate, and body mass to weapons proficiency, combat style, and security systems hacking. Dominate the island with your skills, cunning, and strategies to achieve higher levels of game and receive powerful gifts from corporate sponsors and, if you happen to slip up and die, get resurrected by the show’s producers with all your valuable skills still intact.\nSCUM is built with Unreal Engine 4 and set to launch on PC via Early Access in 2017. Fans can follow details on development with weekly dev blogs on scumgame.com and on Twitter @SCUMgame.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":11194,"name":"Battle vs Chess","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e7/0e7582dda5530d5b95f877dfad57e6ba.jpg","description":"Commanders, assemble your armies! BATTLE vs. CHESS calls for an interactive feather duster, chartering the successful chess game principle into the present day multimedia world. Animated fantasy figurines assemble in magical worlds and await your command! As a Commander, execute skillful maneuvers on the game board and catapult yourself directly into the battle with devastating attacks, chessman vs. chessman.\nChess – the unrivalled champion of strategy games has been attracting players of all ages for countless centuries. BATTLE vs. CHESS is based on the simple yet ingenious concept of creating a fusion between professional chess software and upbeat, combat oriented game mechanics, complete with richly animated game pieces. At the outset of a match things seem quite basic: a 3D game board pits two opponents against each other in a seemingly ordinary game of chess. The game board itself is set in one of six available environments, each with its own unique landscape and presentation features. Traditionally recognized game pieces have been given a facelift as hulking stone golems and beastly chimaeras take the place of the typical rook and knight pieces respectively.\nFEATURES:\nMultiple richly crafted army sets combined with 6 different gameboard environments introduce an unheard of visual complexity\nTwo gripping strategy campaigns with 30 missions and 30 different mission goals\nInteractive 3rd person action mode\nBeat'em up fights in six unique arenas with each of the twelve characters\nChallenging PvP duels together on one PC over LAN and Internet\nUtilizing the famous Fritz! chess algorithm, equipped with 10 distinct levels of difficulty, as well as an extensive opening library, participants of all skill levels are provided with an appropriate degree of challenge\nThe state of the art 3D graphics engine powers the breath taking visuals through the incorporation of HDR and particle effects\nCinematic quality animated sequences pull players into the action of the game\nThe innovative fusion of professional chess software and action oriented fight-ing simulations result in a strategic action experience unlike anything before","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"}]},{"id":10278,"name":"Sixtieth Kilometer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c86/c865daeba393d68b868b29d4b5e64e7c.jpg","description":"You're going to work by train, but strange things happens on the way: the train stops, the pink fog appears outside and the man who came off the train immediately dies. The main characters turned out to be locked in the train without any clues about what's happening...\nChoose how to react in different situations. Speak with characters. Your actions and decisions will change the story around you.\nUnique atmosphere, sudden plot twists and colourful cast of characters whose attitude for you is changing depending on your actions.\nYou can also find Android version on Google Play.\nAbout characters:\nNicolay is a driver of a train. When the fog starts, his friend and assistant comes out of the train to see what's going on and gets suffocated. Nikolai is very upset about his friend's death and feels guilty because he didn't stop him.\nNicolay takes over the leadership in the train and is trying to calm down the passengers. He is always trying to find the less conflict decision for any situation.\nAlexander Petrovich is one of the most mysterious people on the train. He has some gas mask which helps people to come out of the train for a while. Alexander is trying to get the situation under control and take down a peg everyone who is trying to interfere.\nMarina is an ordinary student of senior courses, going to the university. She has a pretty gentle nature, but very initiative at the same time.\nEugeniy Konstantinovich is a really unpleasant man spreading the scent of booze everywhere. He takes his own opinion as the only correct one and never admits his mistakes. Trying to interfere in everything around.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Talentplace","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10251,"name":"Overload","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ee/7ee1830b8df51b83204fc02ed752b3cf.jpg","description":"Overload is a new six-degree-of-freedom shooter from the creators of Descent, currently under development.  We released our 1st Early Access build on March 13, 2017, with our 4th major update (version 0.2) released on June 22, 2017.   The current Early Access release contains the following, as of version 0.5:\n8 unique Challenge Mode levels\nInfinite and Countdown variants that change the focus to Survival or Efficiency\nOptional training level for refining your piloting skills\nThree story mode single-player levels (from the main 15-level campaign)\nOne sample single-player level (not part of the main campaign)\n13 explosive weapons (7 primary weapons and 6 missiles)\n12 terrifying robot enemies\nSteam Achievements and Online Leaderboards\nUpgrades system and Advanced player stats\nAutomap and Holo-guide\nPreliminary Save/Load\nSee below for the Full Game features, expected to release in early 2018.EARLY ACCESS ROADMAPOur focus with Early Access is to make Challenge Mode the best it can be through iteration, polish, and player feedback.  We will also be revealing about a third of the single-player campaign with a focus on refinement of the elements present there as well as interface and level complexity/flow.\nWe plan to do a significant update to the game every 3-4 weeks of similar size, with some smaller updates to address bugs and player feedback.  Much of the story content will be held back for the full game release, but by the end of Early Access, Overload will feature:\n10+ Challenge Mode levels\nMultiple rule variants in Challenge Mode\nXP-based unlocks and permanent upgrades for Challenge Mode\n5 Single-player fully playable campaign levels\n13-14 upgradeable weapons with fully functional upgrade screen in single-player\n15+ robots of varying ferocity\nThe remaining content listed in the FULL GAME will be added at launch.FULL GAMEWhen we exit Early Access and launch the full game, Overload will contain:\nSingle-player story campaign with 15+ FULL-SIZE atmospheric levels\n12+ Challenge Mode levels with tons of replayability\nUpgradeable player ship and 16 weapons with multiple upgrade options\n20+ terrifying robot types and 3 massive bosses\nStory by the writer of FREESPACE 2, plus pulse-pounding soundtrack\nEpic soundtrack by Dan Wentz (DESCENT 2), Allister Brimble (DESCENT 1 REDBOOK), and Jerry Berlongieri (DESCENT 3)MULTIPLAYER EXPANSION AND LEVEL EDITORAll purchases include the FREE expansion to add Multiplayer support 6-8 months after launch.  A custom Level Editor will also be released sometime after launch.  The Level Editor is currently expected to be available before the Multiplayer Expansion.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Revival Productions","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3590,"name":"NARUTO SHIPPUDEN: Ultimate Ninja STORM Revolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c5a/c5a7912a602518cb921324785fa73703.jpg","description":"THE REVOLUTIONARY STORM SERIES RETURNS!\nThe latest instalment of the NARUTO SHIPPUDEN: Ultimate Ninja STORM series will offer players a new experience in the deep & rich NARUTO environment. Tons of new techniques, enhanced mechanics, over 100 playable characters & Support Ninjas, and a brand new exclusive character (Mecha-Naruto) designed by Masashi Kishimoto.\nNinja Battle Action - Amazing fights and original animation heighten the incredible action and interactive experience of the STORM series like never before.\nImproved Gameplay - New Gameplay mechanics with the powerful Combo Ultimate Jutsu and combined attacks.\nNever-before-seen Roster –100 Playable & Support Ninjas, including new characters and variations appearing for the first time!\nExclusive Character - A brand new character (Mecha-Naruto) designed by Masashi Kishimoto exclusively for the game.\nNinja World Tournament - A fresh and thrilling single player mode where 4 different Ninjas brawl and the one gathering the most  Battle orbs wins!\nThe Akatsuki origins revealed! - For the first time ever, the untold story behind the infamous gang will be told through an animation woven into gameplay!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]}]