[{"id":43712,"name":"ECHO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/584/5847838702b0013a75c456709a716868.jpg","description":"Introduction\"Echo\" is an ARPG game using RPG Maker XP engine.\nPlayers can build their own skill sets to use in battles.\nCharacters will gain different status based on their actions during every boss fights.\nBesides battles, there are also puzzles and mini games to play.\nWe also have a variety of difficulties for those who are not good at action games so they can still enjoy the game.StoryJanuary 1st, EC3008. One blue meteor crashed into the ground.\nThis accident had drawn the attention of adventurers', many of which went to search for clues,\nonly to find no craters, no any signs of magic, nothing.\nThus marks the start of the Adventure Era, where Guilds are established for adventurers to travel around the world to investigate.\n​\nPeople believe in many other worlds, and name their own world \"Evoross.\"\nHowever, there has been no proof that other worlds exist, further making adventurers more curious.\nLin is one of the adventurer from an Independent Guild, who just received the right to proceed missions alone.\nShe comes to the Constructed Forest, whose owner has been lost for 6 months, with one purpose.\nWhat holds within this supposedly-deserted forest? And what is Lin going to unveil?FeaturesOriginal opening movie\nOriginal soundtrack\nSkill tree system - 50+ skills for you to choose\nGrowth system - enhance your characters’ abilities base on what you do in every boss fights\n10+ Puzzles and little games\nConfigurable hotkeys\nDifferent game difficulty for different players","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"GameLoop","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":28480,"name":"Condemned","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/397/3974c0238d0ea7b446bdb1d2e4dc1926.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish.  First Person Psychological Thriller.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Monolith Productions","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":27968,"name":"Fire Emblem Awakening","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c43/c432339312ee5441edb081c05d2fa411.jpg","description":"In the visually stunning world of the Fire Emblem Awakening game, you \n      command and fight alongside an army of spirited heroes standing against \n      an enemy with the power to destroy empires; a dark dragon whose agents \n      include armies of the undead. Plan your attack, customize your forces, \n      and guide your heroes as you forge alliances that strengthen your \n      resolve in battle and shape the course of history. Lead a team of \n      distinct characters with unique abilities, rich backstories, and \n      evolving relationships that guide the path of your quest. Plan your \n      attack carefully – the lives of your soldiers and the future of the \n      world depends on it.\n    \n\n        IMMERSIVE STORY AND VISUALS:The deep and immersive fantasy storyline \n        is told throughbeautiful 3D visuals and movies.\n      \n\n        DEEP CAST OF CHARACTERS: A massive selection of characters are at your \n        command,withal with a unique personality and background story and \n        different class types and skill sets.\n      \n\n        DOWNLOADABLE CONTENT: An extensive selection of downloadable content \n        will be available for purchase and will offer opportunities to acquire \n        new maps, new story elements, new playable characters, new classes, \n        and rare items and weapons.\n      \n\n        CUSTOMIZATION: Create your own personalized character and fight \n        alongside heroic characters on the battlefield.\n      \n\n        BONDS GROWN IN BATTLE: Team up characters to strengthen their \n        friendships on the battlefield. The closer they grow, the better these \n        friends and allies will fight together. Some characters can even get \n        married!\n      \n\n        TEAM UP: Team up with your friend and fight against a group of enemies \n        in the local multiplayer mode.\n      \n\n        The StreetPass™ featureallows you to exchange your team data. Recruit \n        or battle against the other player’s team or purchase rare items they \n        might carry.\n      \n\n        The SpotPass™ feature allows you to receive new \n        maps, items and legacy characters to battle against in random battle \n        and local multiplayermode.\n      \n\n      In-game content available for purchase using stored account funds.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Intelligent Systems","platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":21219,"name":"Geneforge 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/986/986afa46038b1ad6676b71c1670a84a8.jpg","description":"Geneforge 3 is an Indie fantasy role-playing adventure, the third chapter of the Geneforge Saga. In this fantasy adventure, you can explore strange, hostile lands, choose which side you will fight for, and, as always, make your own horde of completely obedient mutant monsters.\nGeneforge 3 has a huge and open storyline. You can help one of several factions, each with its own goals. There are dozens of different endings. You can help the rebels, or fight them. Slay your enemies, or use stealth and diplomacy. When you finish the game, start over, choose a different side or tactics, and experience a completely different game.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17937,"name":"Darkest Hour: A Hearts of Iron Game","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2af/2af3aaedea4cdf955db1a5a97b053adb.jpg","description":"Developed by a team of experienced modders from the Paradox forum, Darkest Hour is a stand-alone Hearts of Iron game. The game features a mixture of short and in-depth campaigns set across the darkest chapters of the 20th century. Play from the outbreak of the Great War up until the onset of the Cold War.\nDarkest Hour will introduce a new artificial intelligence that is now able to react to hundreds of different situations simultaneously. It implements a dynamic diplomatic system that will allow the player to have a real impact on the course of history.\nKey Features:\t\t\t\t\t\tShort and grand campaigns allow players to experience the darkest hours of the 20th century, from the Great War to the onset of the Cold War\nNew map, redesigned to offer greater detail as well as strategic and tactical opportunities\nDynamic diplomatic system giving the player greater influence on the course of events\nNew artificial intelligence capable of reacting to hundreds of different situations\n\nScenarios:\t\t\t\t\t\tGrand campaign scenarios (where it is possible to choose any of the nations involved):\n1914 The Great War (starting on June 27, 1914)\n1933 Day of Decision (starting on March 4, 1933)\n1936 The Road to Another War (starting on January 1, 1936)\n1939 Invasion of Poland (starting on September 1, 1939)\n1940 Burning Europe (starting on May 10, 1940)\n1941 Awakening the Giant (starting on June 22, 1941)\n1942 Enemy at the Gate (starting on November 22, 1942)\n1943 Allied Invasion of Sicily (starting on July 26, 1943)\n1944 Allied Landing in Normandy (starting on June 20, 1944)\n1945 Battle of the Bulge (starting on December 16, 1944)\nBattle scenarios which focus on specific battles or wars and where players can choose between a small number of nations:\n1904 Russo-Japanese War\n1939 Invasion of Poland\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Martin Ivanov","platforms":[{"id":0,"name":"PC"}]},{"id":14357,"name":"Caveman World: Mountains of Unga Boonga","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2f/a2f9cd44dd94100ae0c064eb8cc87420.jpg","description":"Caveman World: Mountains of Unga Boonga is a retro inspired 2.5D platformer adventure game set in fantasy prehistoric time. You play as a Caveman, exploring various levels and overcoming physical obstacles. Levels become increasingly more difficult as you encounter new enemies, obstacles, traps and more!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"GrabTheGames Studios","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12585,"name":"Drift Streets Japan","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb9/eb96a110f3140e82f0e2ce9b811caefe.jpg","description":"DRIFT STREETS: JAPAN\nRacing Game about Illegal Night Street Racing!\nNice Cars and Advanced Engine Tuning!\nMost Quality Graphics!\nDrive the Large Japan Highway with traffic!\nFeel the Real experience, try to drift with car cockpit camera!\nHigh quality car's cockpits.\nRealistic Engine Power Realtime Graphs.\nNice Scoring system!\nOnline mode up to 600 players!\nLocal Multiplayer! You can play with up to 32 friends!\n+ Damage System (F - Repair car)\n+ Added Forward Grip Adjustment!\n+ Added Sideways Grip Adjustment!\n+ Added SteerLock Adjustment (min 0*, max 60*)!\n+ Added DriveTrain Adjustment! (fwd, awd, rwd) (F/R - %/%)!\nNow you can create your own physics!\nYou can make FWD car to RWD!\nYou can drift, race or drag with your car!\nSet up your favorite physics!\nModding Support! (Custom maps and Cars can be loaded on forum)\nOfficial Forum: http://driftstreetsjapan.com/\nPerformance Tuning: Engine Pistions, Exhaust, Turbocharging, NOS, etc.\nGuide to setup Steering Wheels -\nhttp://steamcommunity.com/games/412880/announcements/detail/722064832642507651\nMaps Modding How To:\nCustom maps location: Game Folder/Drift Streets Japan_Data/mods/maps/map_name/map_name.obj + .mtl + textures\n.mtl file is necessary!\nTextures need to be in same directory with .obj\nSupported up to 65000 vertices models only!\nDiffuse materials (recomended!)\nCustom maps are available at forum: http://driftstreetsjapan.com/mydownloads.php","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"JDM4iK","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":11091,"name":"Alter World","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebb/ebb06d6af9b696ed4517e6663073c43b.jpg","description":"- Is there any other reality than existing one? Is there any other world than one we live in?...Yes there is. And if this world is as cold and unbearable as the winter's wind, what happens if we get in there...get in the Alter World...\nThe Game is inspired by Stephen King’s book - “The Dark Tower”. The game is a 2D platformer with an interesting gameplay mechanics. Player can travel to an alternative universe anytime and use an alternative universe reality to move to another level. Levels are unique, with puzzles, and player will have to react quickly and assess when to move between the Worlds. The game has unique art style, like a painting.\nDo you think, that you are a Pro Gamer? Try Alter World with 80 unique and challenging levels.\n10 different immersive worlds will conquer your heart!\nListen to your ego, and finish the game with several different endings!\nStrange and quiet melodies would soon conquer a player's heart and feel themselves in a tale with unique sound system.\nKeep Going, going in Alter, find your friend, and watch out for sudden misfortunes...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lemondo Games","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9801,"name":"Raw Data","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/abb/abb6827192e98197c64116c8bd563c20.jpg","description":"Neo-Shinjuku - 2271. The massive and seemingly benevolent Eden Corporation owns the world. The elite hacker resistance movement SyndiK8 has unearthed the sinister reality behind Eden Corp’s newest line of robotic products. As one of SyndiK8’s elite operatives, your mission is straightforward: infiltrate Eden Tower, steal as much Raw Data as possible, and get out alive--bringing Eden Corp down in your wake.\nHowever, as the secrets behind Chairman Shiro’s new “Promotion” program becomes clear, the reality gets much more complicated. Does it really grant immortality? What is Eden truly collecting? It seems that Eden’s corporate veneer may be just a thin facade for something much, much worse.\nBuilt from the ground up for virtual reality, Raw Data’s action combat gameplay, intuitive controls, challenging enemies, and sci-fi atmosphere will completely immerse you within the surreal environments of Eden Corp. Go solo—or team up with a friend—and become the adrenaline-charged heroes of your own futuristic technothriller. You will put your wits, boldness, and endurance to the test.\nActive VR gameplay turns you into a controller, with instant reflex access to an arsenal of advanced weapons and cutting-edge nanotech powers. Shared spaces with avatars and motion tracking encourage players to physically communicate through body language and environment interaction.\nCool Features\nActive VR Combat: Utilize your body to dual wield pistols, slash and slice katanas, pump shotguns, deflect projectiles, do gun tricks, or even use your fists in close-quarters combat. Holster up and pull weapons off your body with physical loadout and check your stats on the in-game forearm display.\nHostile Takeover PvP: Whatever side you’re on, this fight is personal. Featuring four hero classes with optimized abilities, balanced gameplay, intuitive “joystick” locomotion, as well as stealth and armor powerups, Raw Data: Hostile Takeover lets you battle it out in up to 5v5 matches across multiple king-of-the-hill maps. Duel Mode (coming soon!) also provides a unique 1v1 showdown experience for those who are bent on revenge.\nChoose Your Hero: What’s your fighting style? Choose from multiple badass heroes--Bishop, the Gun Cleric; Saija, the Cyber Ninja; Boss, the Street Merc; or Elder, the Rogue Hunter --with a variety of advanced weaponry, special abilities, combat techniques, and ultimates. Defy gravity, slow down time, charge up shots, crush enemies, boomerang your blades, unleash deadly bullet barrages, fling enemies into the air, and much more.\nDeadly Weapons and Defenses: Access a futuristic arsenal of firepower, from dual handguns and pump-action shotguns to iron knuckles and laser swords, as well as deployable turrets and holographic shields for extra insurance.\nAdaptable Enemies: Battle against swaths of murderous machines, including stealth ninjas, laser gunners, rocket heavies, jumping crawlers, exploder bots, flying drones, charger mechs, ion beams, towering megabots, and more.\nCross-Platform Online Co-op: Bring along a trusted partner to cover your back no matter what platform they’re playing on. Team up in a shared co-op VR space that encourages social communication via body language, facial expression, and blended animation.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Survios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":21980,"name":"orbt xl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/456/45623e3bbf7c34556d4bde054af7d68f.jpg","description":"This is an 'XL' version of my mobile game 'orbt'. I have added/changed a variety of things to make it more suitable for the Steam platform. I have been learning to make games in my free time and love making small-yet-solid arcade games with simple mechanics. Please expect 'Orbt XL' to be a small, re-playable, arcade score-chaser game where the only basic goals are to constantly beat your previous score and unlock a variety of cosmetic skins. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter, My Website, or the forums if you encounter something wrong with the game, something misleading on the store page, or you just want to say hello.\nThank you for taking a moment to read this; I really hope you enjoy playing my game.\nAdam Nickerson - Nickervision Studios\nStay in orbit while avoiding obstacles or being sucked into a black hole. Survive as long as you can while dodging and weaving between the various obstacles, the closer you orbit to the center; the faster you achieve points. The longer you last, the harder it gets. Good Luck and have fun playing with gravity!\nSimply pressing the orbt button allows your planet to move away from the black hole, not pressing the button forces your planet to be sucked towards the black hole.\n|| Left mouse button ||  or  || Gamepad 'A' ||  or  ||Keyboard Space||\nEasy to learn, simple one button controls\nAn endless, fast paced and challenging arcade style game play that constantly gets harder\nUnlock 15+ unique planet skins with in game points (cosmetic)\n'Near Miss' system that awards extra points for close calls with obstacles.\nSteam Achievements, Leader board, and Trading cards! (with emoticons & profile wallpapers)\nPerfect for playing a round while in Queue for another game :)\nIn game translation available in 25 Languages (I did these painstakingly with Google Translate so please tell me if something isn't right)\nThe in game audio/SFX was provided by my mouth making noises into a crumby consumer mic, and some royalty free SFX from FreeSFX.\nIn game song is DJ Chacha - \"Cover Trance\"","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nickervision Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":20470,"name":"Earth 2140","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a70/a701aaf5151524978360588573d4e23e.jpg","description":"The year is 2140. After numerous wars and several environmental disasters, only two world powers remain; the United Civilized States (»UCS«), covering the American continent, Western Europe and North Africa, and the Eurasian Dynasty (»ED«) covering the coherent landmasses of Eastern Europe and Asia. The damage caused by the long wars led both world powers to evacuate the population to recently built underground cities.\nAustralia and most parts of Africa were sacrificed during the long wars, which lasted several decades. Highly toxic biological and chemical weapons were developed on these continents, leaving them so badly contaminated, that no human life can survive there. Not even the use of robots and machines is possible. The general opinion was that these continents would forever remain uninhabitable, and they were wiped from every map. Most of the world's population forgot that this land ever existed.\nNatural resources are becoming scarce and have to be extracted above ground. There have been a number of small conflicts between the UCS and the ED, the last of which escalated and became a fierce and bitter war - the final world war. Only one side can win. This final war will decide who will get the last of the available natural resources and ultimately rule the world.\nEARTH 2140 is a real time strategy game involving the high tech warfare of the 22nd century. More than 50 exciting missions, an unprecedented AI, more than 100 ground units, mechs, flying units and ships, strategic orders like formations, escorts and others make Earth 2140 a high class product.\nThis version of Earth 2140 supports resolutions up to full HD and contains both Mission Packs (Mission Pack 1 and Mission Pack 2).","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Runesoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19176,"name":"TGV Voyages Train Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ecd/ecd7e0fca2e802eec7a15a2cdd372a82.jpg","description":"TGV Voyages allows you to experience high speed train travel through the French countryside in Train Simulator. This is a standalone version of Train Simulator that has limited content. See below for more information.The high speed railways of France, dominated by the iconic TGV® Duplex, are brought to life in the breathtaking new Ligne Grande Vitesse: Marseille Saint-Charles to Avignon-TGV route for Train Simulator.\nConstruction of the LGV Méditerranée began in 1996, designed as a dedicated high speed line that spans over 160 miles to connect the South-East of France to the nation’s capital, Paris. The LGV Méditerranée extends from the end of the LGV Rhône-Alpes in Valence and terminates at Marseille via Avignon and Aix-en-Provence.\nOpened in 2001, the LGV Méditerranée is operated by SNCF® with TGV Duplex high speed trains, operating on the 25kV AC catenary system, capable of reaching 320 km/h. These revolutionary high speed trains slashed journey times to the South coast of France with TGVs now handling the vast majority of all journeys in France, covering some 750 km (470 miles) in around 3 hours – faster than some domestic airlines.\nThe line serves a total of 4 stations, featuring three purpose-built structures, the Gare de Valence TGV, a uniquely built multi-level station allowing easy transfer between the high speed and local services, Gare d’Avignon TGV, made popular by its close proximity to Avignon city centre and Gare d'Aix-en-Provence TGV, allowing easy travel into the north of Marseille and Marseille Airport, accessible by regular bus services. The final station is Marseille-Saint-Charles - a terminus station previously built to serve the surrounding area and the French Riviera, access to this station is via the classic French main lines.\nDue to the undulating nature of Southern France’s terrain, the LGV Méditerranée features many steep inclines and declines, not to mention the impressive number of vast cuttings, tunnels and viaducts that traverse the landscape, the longest tunnel being over 8 km (5 Miles) long. Not only is the outstanding scenery a wonder to behold, the LGV Med. regularly sees 300 – 320 km/h operation providing a fast, reliable service with the beautiful southern France countryside flying past the upper and lower windows.\nThe route is equipped with the TVM430 (Transmission Voie-Machine) signalling system, a revolutionary in-cab signalling system designed for operating high speed trains in high capacity. Conventional signalling is not practical for very high speed routes, as drivers have very little time to see and react to what flies past the windscreen. TVM430 displays information in the cab telling the driver what speed he should be travelling at, without the need for conventional track-side equipment.\nIncluded with the 100km Marseille to Avignon high speed route is the iconic TGV Duplex in SNCF livery.ScenariosBAL Signalling Tutorial\nTVM430 Signalling Tutorial\nMarseille Saint-Charles to Avignon\nAvignon to Marseille Saint-Charles\nAix-en-Provence to Marseille Depot\nAix-en-Provence TGV to Avignon TGV\nAvignon TGV to Marseille Saint-CharlesKey Features105km (65 mile) LGV route from Marseille Saint-Charles and Avignon TGV\nStunning southern France scenery, including numerous tunnels and high speed viaducts\nLocomotive yard at Marseille\nTGV Duplex in SNCF livery\nScenarios for the route\nQuick Drive compatible\nDownload size: 1300 mb\nFor the complete Train Simulator experience, you will need to upgrade to the full version of Train Simulator. You can do this by selecting 'upgrade' from the in-game front menu. Below is a list of additional features in Train Simulator that are not available in TGV Voyages:\nCareer mode\nIn game store\nAccess to Steam Workshop\nExpand your Train Simulator collection with add-ons\nAt any time, you can upgrade to the full version of Train Simulator, and the content you bought in TGV Voyages will automatically appear in the full version of Train Simulator.\nEver dreamed of driving trains? Now you can! Train Simulator brings to life some amazing extreme train challenges on real world routes and delivers the ultimate railway hobby.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dovetail Games","platforms":[{"id":0,"name":"PC"}]},{"id":18275,"name":"Chime","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f7/3f7938693bb609c7a08b285cbe9ce19e.jpg","description":"A Zoë Mode production for the video game charity initiative OneBigGame, Chime pits gamers against the melody in an all-new puzzle experience. Place blocks against the clock,\ncomplete solid quads and try to cover the whole playing surface, all the while remixing and embellishing pieces by musicians from across the planet. And you get to feel good about yourself,\ntoo: The console version of Chime was originally developed for OneBigGame with all the developer’s royalties going to Charity for sales up to June 2010, and Zoe Mode will continue to donate a proportion of its royalties (equivalent to 5% of purchase price) for sales of the Steam version. OneBigGame always aims to donate a minimum of 80% of all donations to its charity partners Save the Children and the Starlight Children's foundation.\n\nKey features:\n\nPuzzle: Rotate and place shapes to form solid quads and fill up the grid before the time runs out\nListen: Chime features music by Moby, Paul Hartnoll (Orbital), and more\nRemix: Fill the grid to alter the track loop, place pieces to play notes, and create quads to trigger a range of song samples\nReplay: Reset the grid by reaching 100% and continue playing and beat your high score\nExperience: Each of the six unique levels is made up of its own music, grid, and shape sets, including the new Portal-inspired sixth level: “Still Alive”.\nFree-play mode: Choose between three different levels of difficulty or just play for the sake of making music with no time pressure\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Zoë Mode","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":14729,"name":"Guilty Gear Isuka","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f43/f43208111a298d0f405f16e67ef3db5b.jpg","description":"A new Gear arises, its name Leopaldon. As they threaten to lay waste to the world, you prepare to mount your offense. The good news? You won't have to face them alone.\n\nGuilty Gear Isuka introduces the brand new mechanic of cooperative gameplay to the tried and true fighting madness of the Guilty Gear XX series. With support for up to four local players (either on teams or as lone wolves), Guilty Gear has never seen more hectic action.Key FeaturesA Cast of Misfits - The colorful characters of Guilty Gear XX #Reload return for an encore, and are joined by newcomers A.B.A and Robo-Ky Mk. II! On top of the 23 characters available by default, who knows if there are even more waiting to be uncovered...\nBeat-Em-Up Action - Isuka goes from fighter to brawler when you dive into GG Boost Mode. Punch/kick/cut/grapple your way through waves of formidable opponents, and feel free to invite a friend to help; two-player co-op can give you that extra edge you need.\nMake an Abomination - Newcomer Robo-Ky Mk. II can be retrofitted with the moves of other characters, making him the ultimate doppelganger. Brutal command grabs, a projectile or two, almost nothing is verboten when it comes to the murderous art of imitation.\nBeautiful Characters and Environments - From the tiniest bounty hunter to the largest brute, from sunny beaches to moonlit cemetaries, Guilty Gear Isuka's sprite art oozes character.\nJaw-Dropping Heavy Metal Soundtrack - From the mind and frets of Guilty Gear creator Daisuke Ishiwatari comes some of the most intense rock you'll ever roman cancel to. Buyers of Guilty Gear Isuka on Steam will receive a digital copy of the Official Soundtrack for free!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Arc System Works","platforms":[{"id":0,"name":"PC"}]},{"id":10529,"name":"One Way To Die","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c9/3c9b862ff57c4441d4c248cd2087b090.jpg","description":"Set logic aside to play the game where losing is actually winning and your character may be the dumbest person to ever live!\nAfter waking from a terrifying dream of your own untimely death, you attempt to make your way to the Finnigan Brothers' Fun Park for its last day then back home again in this all new text-adventure from CoaguCo Industries. You must survive 10 pages of ridiculous deaths and traps spanning over 157 ways to die with no discernible way to navigate to safety. It's like playing Russian roulette with five chambers loaded, but more frustrating.\nWarning, this game is reading. Lots and lots of reading.\nThe Steam Edition features:\nAll-new Choose Mode so you can decide your fate instead of the computer\n16 new deaths not in the stand-alone desktop version, nor the Android or web versions\nTwo holidays modes: Halloween and X-Mas; active on their respective holidays\nNew game feature: the Saboteur\nA bunch of new achievements\nOf course, all your stats are backed up on the Steam servers (and CoaguCo's if you have an account)\nNow With Choose Mode\nThe new Choose Mode feature allows the player to pick their fate before each page instead of the computer doing it for you.  This must be toggled in the Options section of the game before it is active.  Using the Choose Mode feature will give you a prompt before each page asking you to input a number which will correspond with your death or success, then it will show you the result.\nRebuilt\nThe web-based version of the game has been rebuilt from the ground up for PC (Windows and Linux) so you can repeatedly die across multiple platforms, if needs be.  It features various graphical upgrades and sounds, as well as music from Azucar.  Much like the Android and web versions, various statistics are logged and displayed to show progress from the different platforms and should allow for cross-platform progression.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"CoaguCo Industries","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3174,"name":"Flame Over","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c52/c5204b268fce6d0b0c378eed88c2cda0.jpg","description":"Now you’re playing with fire!\nBlending top down ‘squirt ‘em-up’ action with Roguelike RPG mechanics, Flame Over features fast-paced fire-fighting thrills, randomly generated levels and 4 deadly game zones.\nGuide fire-fighting hero, Blaze Carruthers, in a race against time and near-certain death! Squirt, splash and spray your way through all 16 floors of the deadly Infernal Industries building, combating ferocious fires in a red-hot adventure that changes every time.\nThis game is ON FIRE!\n•\tIt Burns! - Fight against a deadly dynamic fire system that spreads realistically.\n•\tShop ‘til you Drop! - Find hidden items, equip powerups and upgrade Blaze to survive.\n•\tBe a Hero! - Rescue panicking people and cutesy cats to stay alive.\n•\tNever-Ending Emergency! - Thousands of room variations and secrets will keep you fired up… forever!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Laughing Jackal","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":50050,"name":"Armored Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/77e/77eb0bf2e2a62986eb619b59cbe321fd.jpg","description":"In Armored Warfare, you become a mercenary commander expanding your private fleet of military vehicles, taking on deadly missions and dealing with opponents with a vast array of war machines at your disposal.\nPlay Armored Warfare for free now and charge into battle with 100+ vehicles spread over multiple classes! Raid over a dozen PvP maps for competitive play and take part in a wide range of cooperative missions, teaming up with your friends around the world. From scorching African deserts, through the mountains of China, to Russian tundra. Experience everything modern tank warfare has to offer!\nExclusively in Armored Warfare:\nGlobal Operations - Feel the adrenaline rush as you participate in modern engagements in this revolutionary hybrid PvE/PvP mode. Capture special zones, order airstrikes, call in supplies, resist the enemy AI support, take cover, and, in the unlikely event of becoming overwhelmed, respawn during battle! All this and more on large scale maps littered with modern armored vehicles!\nCooperative PvE Missions - Team up with your friends or complete strangers seeking to rush into battle against overwhelming odds. Overcome a wide array of challenges in the form of superior enemy numbers, controlled by advanced AI! Opponents will become more menacing as you increase the difficulty level, but the improved rewards make the challenge worthwhile!\nRoll up your sleeves and experience modern warfare hands-on – choose a modern military masterpiece with iconic names such as the Abrams, Armata, Centauro, Challenger, Leopard, and many more! Use cutting edge technology to slice enemies open and enjoy the exhilarating feeling of total battlefield control!\nMaster the steel monsters. Dominate battlefields. 21st century modern warfare is yours for the taking.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":20883,"name":"Lexica","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/7174bad575e50aa602734d87caad02bf.jpg","description":"Lexica is a word-puzzle, roguelike deckbuilder  where you harness the power of classic books to spell your way to victory. Spell out words with your letter pieces and rack up points so you can reach each round's score goal. Between rounds, visit the shop to buy powerful books, special board tiles, magic runes, and piece-clearing bombs to push your scoring to its limit. What kind of bookstore sells bombs, you ask? What are you, a cop?Features:3 game modes to try outNormal and Hard difficulty to put your skills to the testOver 50 unique books to power up your words. Some give score bonuses, and even give special abilities like the power to play words backwards.A host of consumable items to enchant your letters and board spaces to improve your scoring and earn more in-game moneyA smooth jazz soundtrack to hum along toPut your wordsmithing skills to the test and play Lexica!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"d3t","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19935,"name":"Hero Quest: Tower Conflict","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf9/cf92df28f738a38609be14e6a67ed37f.jpg","description":"Hero Quest is a Tower-battle in the most literal sense! Defeat waves of enemies as they attempt to overthrow your keep! An extension on the freeware flash game- this is your chance to own your very own copy of this highly addictive game for your Steam library!\nMain Features:Use spells ranging from freeze, fire and thunder to gain the edge in battle!\nGain the upper-hand and destroy your enemy's castle!\nUpgrade your units and spells to become the mightiest general!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mihai Morosanu","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17188,"name":"Plazma Being","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b4/1b41d725866ca34cca6474a169447d24.jpg","description":"Take control of Zeb in this puzzle/platformer. He is a small energy based life form from space, known as a Plazma Being. While journeying through space to his home, Zeb was surprised to find that he was being kidnapped by aliens. They took him back to their planet and unceremoniously threw him into captivity. During this time a series of earthquakes shook the planet and wreaked havoc upon the alien civilization, but gave Zeb a chance to escape.\nFollow Zeb as he travels across the planet's surface in search of a space ship which will give him the means to get back to his beloved cold vacuum of space, as he confronts strange creatures and robots and as he uses his unique energy powers to overcome obstacles.\nThe game features 10 puzzle/platforming filled levels spread out between 3 different environments.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Felix Wunderlich","platforms":[{"id":0,"name":"PC"}]},{"id":16099,"name":"Angry Video Game Nerd Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59b/59b53cd585865f1b75fb304ff3cfd9f5.jpg","description":"Steam Greenlight\nAbout the Game\"The most rewarding game of 2013!\"\nInfluenced by retro classics Mega Man and Castlevania, Angry Video Game Nerd Adventures features the AVGN and friends as they blast their way through 10 levels of fun, fast paced 2D action based on the AVGN's adventures in his online series. With multiple playable characters, power ups, cameos galore, tons of secrets and more we're making a game that all fans of video games will enjoy.  If you're a fan of old school difficulty, fart jokes, The Nerd and/or old school platformers chances are you'll enjoy AVGN Adventures.\nSome say \"hard\" we're saying \"rewarding!\" Why? Because every check point you get, every boss you beat, every accomplishment is earned.  You feel like like a stud. This is a game that allows you to brag to your friends if you beat it.\nYes, this is the official The Angry Video Game Nerd game!\nVisit Cinemassacre.com to see the series the game was based on!\nWe're 100% cool with you posting gameplay videos, Let's Plays, reviews, etc of AVGN Adventures and monetizing them as much as you possibly can. Have fun! All we ask is that when you do them, let us know because we want to watch you play the game  That's fun for us!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"FreakZone Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"}]},{"id":14087,"name":"Cube Runner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39c/39c04d58d77cd8249ffde3e361881079.jpg","description":"Cube Runner is a 3d action platformer that's simple to learn, exciting to play, and deep enough to challenge even the greatest gamers.\nThis fast paced game is soul crushing, but compelling and addictive. Enjoy the blistering speed and brutal physicality, hurtle forward and master the moves. In Cube Runner, reflexes and timing are the key.\nPrepare for impossible challenges and push your skills to the limit. Dodge the obstacles, destroy them and advance through the game.\nResist the gravity, switch dimensions in the right moment and survive as long as you can.\nWhy choose Cube Runner?\n- Fast-paced and simple core gameplay\n- Variety of levels\n- Competitive, challenging and exciting\n- Perfectly balanced and fun to play with friends\n- Achievements and rewards","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12460,"name":"Shot Shot Tactic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f4/0f4246c556240103c46445215dca7f39.jpg","description":"Take a role in a realistic styled FPS multiplayer game. Choose bunch of weapons and play Head Shot online with friends and strangers.\nFeatures:\n-Various types of weapons including  Assaults, Equipments, Machine Guns, Pistols, Shotguns and Snipers;\n-Different game modes (Death Match, Team Death Match, Bomb Defuse, Capture The Flag)\nPlanned features:\n-More weapons;\n-More game modes;\n-More items and various other content that will bring more fun into the game.\nMore features coming soon.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Indie Game Group","platforms":[{"id":0,"name":"PC"}]},{"id":904375,"name":"Dark and Darker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e72/e722d462113f4e595426e92c322b5012.jpg","description":"An unforgiving hardcore fantasy FPS dungeon PvPvE adventure. Band together with your friends and use your courage, wits, and cunning to uncover mythical treasures, defeat gruesome monsters, while staying one step ahead of the other devious treasure-hunters.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"IRONMACE","platforms":[{"id":0,"name":"PC"}]},{"id":622489,"name":"ELEX II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7bb/7bbc774e39bfe149dc8d3e6945a102f7.jpg","description":"ELEX II is the sequel to ELEX, the vintage open-world role-playing experience from the award-winning creators of the Gothic and Risen series, Piranha Bytes. ELEX II returns to the post-apocalyptic Science Fantasy world of Magalan – with massive environments that can be explored with unrivaled freedom via jetpack, you will be able to move through the epic story any way you want.\n\nSeveral years after Jax defeated the Hybrid, a new threat arrives from the sky, unleashing the dangerous powers of dark Elex and endangering all life on the planet. In order to defend the peace on Magalan and the safety of his own family, Jax has to go on a mission to convince the factions to unite against the invaders and find his own son, Dex, who got separated from him …\nDive into a huge, hand-crafted, completely unique world with multiple factions and diverse environments set in a post-apocalyptic science fantasy universe.\n\nThe game allows you to:\n\nexplore the planet of Magalan with unprecedented freedom, using your trusted jetpack to traverse the map and even fly!\ninteract with a lived-in world, full of unique NPCs, who\nwill remember what you’ve done and react accordingly\nwill join or leave your group depending on how you behave\nare able to be killed, which will have an effect on the story\nengage in fluid close and ranged combat with a massively improved control system\nexperience a story where your actions have consequences, immersing you in a world of moral decisions","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Piranha Bytes","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":35374,"name":"Unreal Tournament 2004","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59c/59ccb40e955d56d3d4d0656dd93b132c.jpg","description":"Unreal Tournament 2004 is a competitive multiplayer FPS developed by Epic Games. It is the direct continuation of Unreal Tournament 2003.\n\n###Gameplay\nThere are no classes or specific loadouts in Unreal Tournament 2004. Players have to find weapons to fight with on the level. Several game types can be chosen for a match. Classic modes like Deathmatch, Team Deathmatch, and Capture The Flag are still present in the game. A number of new team-based modes were added to the game and became very popular. Modes like Jailbreak, Assault, and Onslaught were met with critical acclaim and praised by the game's audience.\n\n###Career mode\nUnreal Tournament 2004 also features the career mode. The main objective of the mode is to create a team and get to the Tournament finals. The players are free to choose from 18 pre-defined characters to form their team.\n\nAt the beginning of the game, you participate in the Liandri tournament. It is the 12th legal tournament in the corporation's history. After winning the first four matches, you get the attention of an investor, who offers you to hire several players. You are now a captain of a team. Each player has four parameters that define their stats: Accuracy, Aggression, Speed, and Tactics. You play four matches of Team Deathmatch, and after that, the tournament itself begins.\n\nIn the finals, you'll meet with one out of the three strongest teams that won previous tournaments.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Digital Extremes","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":19829,"name":"Batla","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/006/006ec7ec1ea7de58c26a3a557de4aab0.jpg","description":"Batla is the awesome shooter game about robots, which came to conquer the Earth, but turned to be were too small for that. They had no choice but to capture the kid's room and start fighting there. Sometimes robots go into orbit and fight there for the most valuable resource on the planet - glucose. That's right - the robots fight with each other for stick candies.\nThe main character is the robot nicknamed ‘Soldier’. This is a classic representative of the robots’ race. He shows good efficiency in basic criteria; he possesses standard set of weapons. He is familiar and easy to control. Soldier is an elite assault trooper from Robots’ Planet.\nFans of classic shooters, such as Quake or Unreal, will like Batla due to its good dynamics, 3 kinds of robots, nice graphics, interesting locations and great mood!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"[geim].pro","platforms":[{"id":0,"name":"PC"}]},{"id":16243,"name":"Space Beret","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1f/b1f2f84fca8be80913f9272bb790005c.jpg","description":"Space Beret is a top down sci-fi shooter set in a \"Starship Troopers\" and \"Crimsonland\" inspired setting. In it, mankind is forced to fight hordes of horrible monstrosities in a desperate struggle for survival.\nGameplay\nPlayer will be offered to choose between two game modes.\nCampaign Mode - where the player will have to complete series of stages, populated with many monsters in one go.\nSurvival Mode - where the player will resist waves of various enemies in pursuit of the highest score.\nEach of these modes will be played with the sound of dubstep which captures the retro sci-fi movie atmosphere.\nWeapons and upgrades\nDuring his quest for survival the player will pick up various weapons and upgrades which will help him survive the trials awaiting.\nSome of the weapons featured in \"Space Beret\" are:\nAssault Rifle  - starting weapon with medium rate of fire and weak damage\nShotgun - weapon with slow rate of fire, strong damage and gradual bullet spread\nMinigun - weapon with very fast rate of fire and weak damage\nGauss Rifle - weapon with good rate of fire and good damage, but shoots only in a narrow straight line\nEach weapon can be upgraded by picking it up again, thus improving its attributes.\nAlongside weapons, player will be able to pick up various power ups like attacking and defensive drones, shields and many other.\nEnemies\nDuring the game, player will face hordes of various enemies with different strengths and weaknesses.\nSome of the enemies player will encounter are:\nScarabei - Most common enemy.  Small and weak, but very fast.\nCrawler - Medium sized charging enemy, especially susceptible to Gauss Rifle.\nCenturion - Twisted synergy of organic and mechanical. Very endurable enemy which shoots projectiles from his powerful railgun.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":16164,"name":"Kidnapped","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/723/723bdd7982914f9f5253889149ff4989.jpg","description":"-It's dangerous to leave your child home alone at night,\nand if that dangerous thing happened to your child, would you be able to handle it?\nAnd what if the kidnapper is a demonic clown?\nThey need your help now.\nDefeat the demonic clown and survive!Explore a fantastical, high-quality graphical map to find your child.\nExplore a large map to progress through the game.Communicate with characters to advance the story.\nCommunicate with characters, find evidence, and progress the story.Find the guns and defeat our enemies.\nKill to not die. You have to survive!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Deceptive Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4059,"name":"Grand Theft Auto: Vice City Stories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2cf/2cfc874f7d547fa6f6a84816f7a00bb3.jpg","description":"Vice City, 1984. Kicked out onto the streets of a city torn between glamour and gluttony, Vic is faced with a stark choice - build an empire or be crushed.This title has been converted from the original PlayStation®2 version to the PS3™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©2000-2007 Rockstar Games, Inc. Rockstar Games, Grand Theft Auto and Vice City Stories marks/logos are Take-Two Interactive Software trademarks.  All Rights Reserved.This videogame is fictional doesn’t depict any actual event/person/entity & any similarities are coincidental.  Take-Two doesn’t endorse or encourage engaging in any conduct depicted in game. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited.  Use of software is subject to license in the game manual & online at rockstargames.com/eula.  Non-transferable access to special features such as exclusive, unlockable, downloadable or online content, services, or functions may require single-use serial code, additional fee and/or account registration (13+)","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Rockstar North","platforms":[{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":1210,"name":"SPACE HULK ASCENSION","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c86/c86d63aab437515a0cd8800a1ebf5503.jpg","description":"Space Hulk Ascension\nSet in the isolated corridors and tomb-like chambers of ancient vessels lost in the graveyard of space, players lead a small force of fearless Space Marine Terminators in a ferocious fight for survival against hordes of predatory, alien Genestealers.\nThe standalone sequel to Space Hulk brings an all new and improved single-player experience for the turn-based strategy game.\nNew Ultramarines Chapter\nAn all new Space Marine chapter, including a Terminator armed with Cyclone missile launcher.\nTerminator Progression and Customisation\nEarn XP during missions and level up attributes and skills, and give your Terminators a personal touch by customising their names, weapon loadout and appearance.\nCampaigns and Missions\n100+ missions spread out over 3 complete campaigns, and all new flash missions. These are opportunistic mini-missions encountered as you explore the deep unknowns of the Space Hulk that can yield a tactical advantage or be a deadly trap.\nRogue Mode\nPlay random generated Hulks in this all new way to play Space Hulk collecting points to challenge friends and foes on Steam Leaderboards.\nExploration and Discovery\nTerminators reveal the layout of the Space Hulk as they venture deep into the darkness.\nAdditional Weapons, Tactical Options and Game Rules\nGame mechanics have been reworked to make Space Hulk Ascension a true video game experience. Combi-weapons (Combi-Melta, Combi-Plasma and a Combi-Flamer) have been added to the game as well different firing modes like aimed shots and alternate flamer patterns.\nGenestealer Variations\nGenestealers with Fleshhook, Feeder Tendril and Acid Maw biomorphs have been added to the game, each with their own special game mechanics. You can also encounter biomorphs with scythes that have multiple attacks or carapace for increased armor.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Hoplite Research","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":309739,"name":"Forza Street","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f93/f93c0096c9a2ec6d3fdf91a15183e867.jpg","description":"nter the ultimate street racing scene to win the car collection of your dreams. Pick an event, set your lineup, and race for infamy.\nCOLLECT AND UPGRADE ICONIC CARS\nRace to collect legendary cars – from classic muscle to modern sports and retro supercars – turning your garage into a trophy case.\nTRUE CINEMATIC RACING\nStreamlined controls focus on timing for gas, brake, and boost as action-cams chase the adrenaline up close.\nRACE ON YOUR TERMS\nRace anytime, anywhere. Squeeze in a quick one-minute race or get immersed in an endless story with multiple paths to victory.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Microsoft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":50970,"name":"Street Fighter 30th Anniversary Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/940/9402ce92d212bd2cae9ff99dea6d4fb8.jpg","description":"Celebrate Street Fighter’s historic legacy with the Street Fighter 30th Anniversary Collection. In this massive collection of 12 Street Fighter titles, perfect arcade balance makes it to consoles and PC for the first time ever.  Four groundbreaking titles let you hop online and relive the arcade experience through the online Arcade Mode or play with friends - SFII Hyper Fighting, Super SFII Turbo, SF Alpha 3 and SFIII: Third Strike!\nThe celebration continues in the Museum, where fans and historians alike can follow the timeline of how Street Fighter has evolved over the past 30 years. Learn more about the Street Fighter cast, view key animation sprites in the character viewer and take a behind-the-scenes look at the design documents that helped solidify the franchise that produced generations of World Warriors!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":20990,"name":"Dungeon-Party","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c44/c44b5bc1923d26c200c311fd997f4e33.jpg","description":"Dogs of War OnlineAnother great free to play game by Cyanide Studio.\nhttp://store.steampowered.com/app/219700\nAbout the GameDungeon Party is a free online game that is played in teams. You are plunged into a totally crazy, heroic-fantasy world, where you compete in teams of heroes in dungeons full of deadly traps and awesome monsters to win the treasures they are trying so hard to hide.\nIn Dungeon Party, you create your character and customize him using a vast range of different outfits and items. From the enthusiastic wizard to the wise-guy thief, via the executioner who ain't exactly a sweet old grandma, anything goes! Each player equips his character with various objects and weapons before sending him into battle against the different teams.\nYou will have to develop your character during the matches and select his spells and special abilities very carefully to maximize his efficiency in the team.\nThe games have been spiced up; the dungeons are riddled with hundreds of deadly traps and there are some mighty strange creatures roaming around. These critters will make no distinction whatsoever between the teams and will prove to be ferocious protectors of the treasure!\nKilling the monsters will give you bonus experience points that are essential for buying new spells at the earliest opportunity. The bosses and mini-bosses will also give you a whole heap of trouble, but they carry an even greater number of bonus experience points and, more importantly, will earn you the favors of the chest!\nOrganize yourselves into guilds so that you and your friends can help each other, and use the level editor to create your own dungeons and then share them with your friends and the community.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PC"}]},{"id":18647,"name":"Magicite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a08/a082fda0bd06c484d16edd03253b51b9.jpg","description":"Explore, craft, and survive in this Multiplayer RPG Platformer with permanent death! Featuring many Rogue-like elements, Magicite randomly generates each underground dungeon for you and your friends to delve deep into. Chop trees, mine ores, and hunt beasts in order to collect the resources and materials you need to survive the harsh and unforgiving environment. With a ton of character traits, stats, companions, and classes, players will have a different experience each play through! Be prepared to die... A LOT.\nMagicite's main influences were Monster Hunter and Spelunky. I loved the resource collection and crafting in Monster Hunter, and of course fighting giant monsters with my friends. Spelunky's brutal yet rewarding platforming was also something that I wanted to capture with Magicite.\nFeatures:\nRandomly Generated Dungeons - Experience a new dungeon each time you play. Expect tons of trees to chop, ores to mine, plants to harvest, and bugs to catch! Oh and giant monsters.\nPermanent Death - The game logs all of your stats in a play through, leading the way for achievements and upgrades.\nCrafting System - Combine any two items to create a new one! For example, Wood + Wood = Plank. There are tons of combinations to discover!\nCombat System - If you plan on just running in and swinging you sword, you're gonna get wrecked. Take time to craft useful items and examine enemy positioning before executing a well timed attack.\nUnlockable Races, Hats, & Companions - The more you play, more greater chance you'll unlock awesome new hats with a variety of special effects. Races and Companions can also be unlocked to provide different starting items and stats!\nMultiplayer - Want to put your friendships to the test? This is the game to do it! Permanent death only occurs when the ENTIRE party has fallen. So if your buddy gets knocked out feel free to run over and help him back up. Or not...","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SmashGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":5382,"name":"Burn Zombie Burn!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad9/ad97d459e27fc4096ea824a2221ffc3a.jpg","description":"Welcome to the char-grilled world of Burn Zombie Burn, where the best type of undead is barbequed undead.\nThe goals are simple: keep Bruce alive, as he tries to keep Daisy alive, and get the highest score possible. Standing (well, ambling) in your way is a never ending horde of the rotting, stinking and stupid undead. Fortunately our mild-mannered hero Bruce can get hold of some tasty weaponry. Burn, batter, shoot, maim, blow up, mince, and obliterate as many zombies as possible before they make Bruce their dinner…\nFlaming zombies are faster and more dangerous than regular uncooked zombies. But burning zombies drop better pickups and act as a score multiplier – light ‘em up, score big, and have fun.\nKey features:\nA hoard of zombie types – dancers, exploders, armored, infectious, and fire-farting super zombies\nAn arsenal of weaponry – bats, guns of all sizes, chain saw, flamethrower,  lawnmower, brain gun and groovy dance gun\nBig red button – use weapon combos to enable the big red button and trigger unique level events\nA healthy range of explosives – upgrade your everyday TNT for increasingly destructive explosives and mines\nA truck load of pick-ups – ammo, defense for daisy, rampage, speed, time, TNT, TNT range and type upgrades, and junk food health boosters\n6 infinite play arenas – The Woods, Graveyard, Suburbia, Drive-in, Army Base, Secret Lab\n3 game modes –  Free Play, Defend Daisy and Timed\n10 challenges with alternate styles of play\nSuper un-lockable bonuses including multiple game rendering modes\nA coffin full of in-game achievements to complete\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Kuju Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":22547,"name":"Pixplode","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9e0/9e0d1b85c285ae4dd7a714508b96541e.jpg","description":"Pixplode is a 3d puzzle game with 2d physics mechanics.\nAt first glance puzzle seem to be impossible to solve, but why not to change the view of the whole level?\nOver 40 detailed levels allow you to rack your brains for a long time!\nThe angle you look at the puzzle defines what you see and how the elements will interact with each other.\nCan't reach that target? You can rotate the view freely for 90 degrees right and left to see unseen!\nYou solve the puzzle by changing the angle and moving the elements with explosions.\nEach level is created with four diferent parts that you can turn and see the results of your actions.\nDon't worry if you mess up anything, you can always restart level and try again.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Empyrean","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19588,"name":"Naval Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/11b/11b749091774b0ae370ca9605bf5faba.jpg","description":"In a fantasy world of Victorian architecture, war is raging between the industrial superpowers. As Commander of a Naval Super-Destroyer, it is your duty to destroy the enemy's mighty Boss Units in a military campaign of epic proportions in, under and above the surface. If you are to emerge victorious from a variety of challenging scenarios, you must lead your troops against wave after wave of massive attacks from ships, planes and gigantic Special Forces.\nKey features:\t\t\t\t\t\t\tDestructive: Powerful weapons with many lethal upgrades\nComprehensive: Great variety of enemy units with ships, submarines, planes and futuristic vehicles\nExplosive: Challenge your friends in the immensely variable multi-player mode or play alongside them against the PC in Co-operational Mode\nImpressive: An exciting story-line plus sensational graphics with incredible effects and stylish cut-scenes guarantee maximum enjoyment.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Game Distillery","platforms":[{"id":0,"name":"PC"}]},{"id":17007,"name":"YOU DON'T KNOW JACK Vol. 2","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/186/18650a72a37618b46fd7fb3f4d97f9ef.jpg","description":"Reintroduce yourself to this classic YDKJ sequel! All the fun of Volume 1, but with completely different questions, host, and smell!\nYOU DON’T KNOW JACK Volume 2 is the mutant offspring of the original award-winning, irreverent, fast-paced trivia game where you are a contestant on a manic game show. With all the excitement of the first game, lots of mind-blowing surprises, plus four additional question types, YOU DON’T KNOW JACK Volume 2 will scrape the trivia out of your cranium like the seedy pulp from a melon.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":16114,"name":"Squirbs","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/28a/28a07e2e63c5e0ad389ffc8b99e82766.jpg","description":"Squirbs is a challenging puzzle-platformer in which you control two cute blue Squirbs simultaneously with one set of controls.\nSquirb shattered the Universe Crystal splitting himself into two seperate Squirbs. Now both Squirbs must journey through dense forests, underground caves, snowy mountains and a magical castle in order to collect each crystal fragment and set the universe back to normal.\nSquirbs combines solid platforming controls and mechanics with awesome puzzles but with a twist. You control two characters at the same time. You can't just jump around and get to the end, you must watch both characters and ensure every movement you make won't be certain doom for either Squirb.Features\n- 100+ single player levels - Easy to insanely challenging\n- Online Co-op - 20 Specifically designed co-op levels\n- Four environments - Forest, Underground, Snow and Castle\n- Wide variety of mechanics that provide new challenges as you progress\n- Steam Trading Cards\n- Achievements\n- Awesomely difficult levels\n- Cute Squirbs!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Team Indev","platforms":[{"id":0,"name":"PC"}]}]