[{"id":19779,"name":"Gamma Bros 1.5","genre":"Action","price":0.0,"description":"Remember the GAMMA BROS?  If you do, you're probably old like Pixeljam.  If you don't, then welcome aboard! This is the game that solidified Pixeljam's resolve to be the best damn pixel-wielding indie game company we could be, and we're on a mission to MAKE THE SOLAR SYSTEM GREAT AGAIN.\nThe Gamma Bros are the hardest working mixed-race twin brothers of the near future, and they are about to embark on a commute of epic proportions...\nTHE ORIGINAL STORY\nThe Gamma Brothers spend their days working on a huge space station near Jupiter.  No one works harder than the Gamma Brothers. What could they possibly be working on? Something very important, no doubt.\nThe Gamma Brothers also understand the importance of not working.  Every day at quitting time they hop into their commuter vehicles for the long, difficult journey back to earth.  Every day on their way home, they are attacked by ships and creatures of unknown origin. Every day, to and from work, they must survive many vicious and clever alien attacks!\nIt is up to YOU to guide the Gamma Brothers home.  Prepare yourself for the ultimate space commute battle!  After all, it is dinner time on earth, and the Gamma Brothers' families will not be pleased if you don't get Buzz and Zap home safely.\nTHE PLAN\nWe're releasing Gamma Bros on Early Access as VERSION 1.0.  Watch us magically transform the game into VERSION 1.5, with all new weapons, bosses, playable characters and more.   Track our progress through a deliciously transparent ROADMAP on our site at http://pixeljam.com/gammabros.\nFAILURE IS NOT AN OPTION!  For us, and the Bros.  Help them get home in time for dinner, and help us make the game better than it's ever been before....","imageUrl":"https://media.rawg.io/media/screenshots/aa1/aa1a2ff7c945c2b99918dceebdd489d3.jpg","releaseYear":2016,"developer":"Pixeljam","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19112,"name":"Z.A.R.","genre":"Action","price":0.0,"description":"In 2097, the mining of minerals and other natural resources is completely automated and controlled by supercomputers. The planets that are mined for 'Iberium', an essential mineral to control pollution on Earth, are called Z.A.R.; Zones for Artificial Resources. The 'central computer' that controls all of the mining robots is hit by a meteorite and enters a frenzy. It starts building robots with weapons, intent on conquering more planets. A single soldier, Colonel Hermit, is sent to deal with this threat.\nExplore vast, open, low-gravity terrains whilst gunning down hordes of enemies.\nEnjoy the CD-quality audio soundtrack.\nDestroy your enemies with a variety of weaponry.","imageUrl":"https://media.rawg.io/media/screenshots/71b/71b567c7854614e95ad2bc8e500ca0d2.jpg","releaseYear":2015,"developer":"Maddox Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":18890,"name":"SurrealVR","genre":"Adventure","price":0.0,"description":"Surreal VR\nGiant emojis? Check. Robot puppies? Check. Avatars? Check. Doodle with friends? Check. Come hang out in a surreal, magical place being built by people who love virtual reality, gaming, and buzzing dinosaurs with flying drones.\nWelcome to crazy, fun and social world of SurrealVR.Version 3.0\nThere are big changes in SurrealVR with our latest update.Finally, Oculus Touch Support!\nCross Platform between Vive, Oculus and PCVR, NoneVR, Motion Controllers (Vive and TOUCH) and also Gamepad supportNew Avatars!\nRealistic or cartoony avatars, human, alien or robot… We have them all nowFrom head to toe, customize your avatar and make your own VR identityNew teleportation system (Classic walk is also supported)Voice chat, IK, lip syncGame Trailers, Drones and Brush!\nVideo player in Home scene with game trailers to watchIdentity Sync with games powered by SurrealVRPlay Drone Fighters on Steam and use same identity back and forthGet game points with actions and mini gamesSpend your game points to customizationReal time networked physics objects, throw, catch, shootUse Surreal BRUSH for creating things togetherWhiteboard location to share drawings Fly a RC drone in VRIf that’s not enough Fly a human size drone in Dino LocationDo you want to win an award?\nWe hide a crazy secret in Surreal. Some things you can find in Surreal world and solve an impossible puzzle. What is it? What to do with it? We can’t say. You should figure it out. If you are the first one to solve, you will win something BIG. It is extremely difficult we must admit, so reward is equally awesome.Location Location!\nHomeCruise ShipDinosaur IslandDrone Fighters PreviewBasketball CourtZombie ShootingWhiteboardPsychiatric WardDance ClubDadaismConfession Room","imageUrl":"https://media.rawg.io/media/screenshots/687/6876888e16631f8d4bde27330238cb67.jpg","releaseYear":2016,"developer":"Surreal Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18297,"name":"Mutant Storm: Reloaded","genre":"Action","price":0.0,"description":"Mutant Storm progresses over 89 levels of twin-stick shooter mayhem! As you get deeper, you are ever more overcrowded with nasty beasties. This carnival of frenetic fun is showcased in a cutting edge graphics extravaganza.\nViewed from well above, you and your enemies can always be seen. Always be killed, and always be laughed at! There is no hiding. No tactics. No planning. No Net.\nYour enemies created this world and they sure ain’t gonna help you out!\nYou like to play hard? Then the game gets harder. Feel like you're doing well? ... Enjoy it while it lasts!\n\nSurvive long enough, and you get rewarded with score multipliers, doubling your score. Making your enemies even angrier, and that bit more determined to kill you!\nLose a life and watch your multipliers tumble, and the beasties slow down and relax, safe in the knowledge that you are just a big softy really!!\nAfter you conquer all 89 levels you’ll be awarded a ‘White Belt’. Progress to win all 8 belts until you possess the much coveted Mutant Storm ‘Black Belt’.\nKey Features\n89 Levels\nAdventure & Tally gameplay modes\n7 Difficulty levels\nOver 20 unique enemies\nPsychedelic 3D visuals and effects\nGlobal Online Leaderboards\nLocal multiplayer\nAchievements","imageUrl":"https://media.rawg.io/media/screenshots/d6a/d6ac92c4db77b67ce5ea3cfb0664d273.jpg","releaseYear":2012,"developer":"PomPom Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17641,"name":"Grapple","genre":"Action","price":0.0,"description":"Grapple is a parkour game built for speedrunning. You're tasked to reach the end of the level only with the aid of a grappling hook & glider. The game also features an online racing mode! The game has amassed a small speed-running community. Level 2 in particular was a favorite among speedrunners due to the shortcuts it featured","imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd130b1a56877b8fd6e96c5c9283c27c.jpg","releaseYear":2015,"developer":"Barji","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17476,"name":"Envy the Dead","genre":"RPG","price":0.0,"description":"Envy the Dead is zombie survival roguelike, where you are leading group of unique, randomly generated characters through destroyed lands, infested with zombies.\nThe game combines node-based exploration with random events, similar to games like FTL or Renowned Explorers with Tower Defense based battle mechanics. The characters are all randomly generated and they are all have different personalities, skills and traits.\nThe game is extremely hardcore. Your characters can be injured, infected, killed in battles or in accident. Your supplies of food and medicine are limited, and someone in your group will have to starve so all your group can survive.\nDuring your travel, you can encounter hundreds of different events, in which you can find supplies, fight zombies or meet another survivors. Some events could require hard decisions with life and death consequences. For example: someone in your group was captured by bandits, and you must choose between leaving him to die, risking the whole group and getting him out or trying to trade him for some of your supplies.\nBattles are based on tower defense mechanics. You must defeat waves of zombies or groups of other survivors, usings skills and abilities of your characters, teamwork and defensive structures.","imageUrl":"https://media.rawg.io/media/screenshots/6cc/6cc159cafe50085bed0f56f14f04d2d3.jpg","releaseYear":2016,"developer":"Kazakov Oleg","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15410,"name":"Endless Fables: The Minotaur's Curse","genre":"Adventure","price":0.0,"description":"Discover the truth about the mythological Minotaur!\n48 LOCATIONS AND 17 HO SCENES TO EXPLORE!\nEmbark on the greatest adventure of your life in a fascinating world of antiquity. Step into the shoes of Pamela Cavendish and visit visually dazzling locations ranging from Paris to the island of Crete, all of which are filled with cleverly hidden objects and challenging minigames!\nWIELD THE THREAD OF ARIADNE AND SOLVE 34 MINIGAMES!\nUse the mythical thread of Ariadne to overcome obstacles and find clues about a mysterious cult that is seeking to resurrect the Minotaur.\nDISCOVER YOUR MYTHICAL HERITAGE!\nLearn the truth about the descendant of Ariadne – the only human capable of stopping the beast from the labyrinth once and for all.\nUNRAVEL THE ANCIENT MYSTERY OF THE MINOTAUR!\nFind out what happened during the mythical encounter between the demigod Theseus and the beast Minotaur thousands of years ago. Then enter the dangerous labyrinth and face your destiny!\nFIND THE PEGASUS IN THE BONUS ADVENTURE!\nHunt morphing flowers, catch hidden butterflies, and explore an exotic island in a bonus journey to search for mythical creatures like the Pegasus.\nFeatures Learn about the world of Greek mythology!\nInvestigate a mysterious cult!\nExplore 48 varied locations!\nFace the Minotaur in his labyrinth!","imageUrl":"https://media.rawg.io/media/screenshots/775/775ccf355152fe6ce5b6f81760acf9b3.jpg","releaseYear":2016,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":14704,"name":"The Station","genre":"Adventure","price":0.0,"description":"The Station is a first-person exploration game set on a space station sent to study a sentient alien civilization. Assuming the role of a recon specialist, players must unravel a mystery which will decide the fate of two civilizations.\nHow would you react if we discovered a sentient alien civilization, challenging everything we know about biology, chemistry, physics, religion and answering the questions man has asked throughout history? But what if this sentient alien civilization was discovered in a state of civil war? Determining that the rewards outweigh the risks, an undetectable space station with a small three-person crew deploys to research the alien culture in search of a means towards a peaceful relationship. Unable to contact the crew, a recon specialist to sent to uncover what happened. What players discover will challenge their view of surveillance, imperialism and moral law.\nWelcome aboard The Station.Gameplay\nA World of Augmented Reality - The future holds a progressive attitude towards how information is stored and shared. Technology has gone through a digital revolution and conversations, notes and even computers are experienced in full Augmented Reality. Ranging from personal to professional, these AR logs will let players explore what was taking place on-board.\nIntuitive Problem Solving - When a door won’t open, what will you stop at to discover what lies behind it? The secrets on-board the station will resist being uncovered and you must rely on your ability to identify and solve intuitive but subtle problems - The Station itself is a puzzle to be solved.\nPiece Together a Living Story - We believe the best stories are shown not told. Each room and space will have a unique moment to share if you look close enough – as the story unravels each detail will begin to fall into place. For the keen eye, a rich story awaits.","imageUrl":"https://media.rawg.io/media/screenshots/ac8/ac820d516d60bd1176a753413f9e98c9.jpg","releaseYear":2017,"developer":"The Station","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":14586,"name":"Pointless","genre":"Indie","price":0.0,"description":"Pointless is a game about destroying Dots. Each Dot you destroy adds one point to your score. You can add your score to a global point pool, and see how many Dots have been destroyed globally. Rad!Features Dot destroying action. Five different weapons; Laser, Pulse, Wide, Bomb and Chain. Destroy thousands of Dots! A Global count of all Dots destroyed, using the magic of the internet. Eleven unlockable palettes, destroy Dots to any colour. Alex, he/she's literally a talking head. Can you find a way to be attached? Character building! An authentic Retro Game Gal aesthetic, right down to that 160*144 pixel screen. Steam Achievements, show off your Dot destroying skills. Steam Trading Cards, you'll have to earn those badges!","imageUrl":"https://media.rawg.io/media/screenshots/c9f/c9f8855f8c7572682dd36b99ca960904.jpg","releaseYear":2016,"developer":"Cake Collective Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14329,"name":"Lux Delux","genre":"Strategy","price":0.0,"description":"Lux Delux is a fast-paced turn-based-strategy game inspired by the classic board game RISK, with so much more!\nTake over the world in 10 minutes!\nCross-platform online multi-player with rankings league! Our online champions want more fresh meat.\nConquer over 900 different maps: Historical, geometric, fantasy, every US state!\nBiohazard mode nukes out different countries on the maps each game!\nDiverse map generator plugins including CastleInfinity.\nCreate your own maps with the built-in Map Editor.\nIncludes the 2 DLC expansion campaigns of American History Lux and Ancient Empires Lux!\nChallenging AI will slap you around (no joke).\nProgrammers can create new AIs using the open-source LuxAgent SDK.\nHot-keys galore enable you to run an entire map in under 30 seconds! If you have a fast mouse-hand and enough armies, that is.\nLux Delux is an indie game cult classic, created by players, for players, and growing organically for over a decade now.\nBecause taking over the world is fun!","imageUrl":"https://media.rawg.io/media/screenshots/010/010857114c12e579eee924ebf4c421f2.jpg","releaseYear":2015,"developer":"Sillysoft Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14294,"name":"PeriAreion","genre":"Strategy","price":0.0,"description":"PeriAreion ReLaunch Patch 5.0!Bear with us as we continue to update our Steam store page and website to reflect the new changes. It's been a long process, but we've completely overhauled the game graphics, UI, mechanics, and more. Check it out and let us know what you think!\nAbout the GameExplore a new and unforgiving frontier. Lead an international team in establishing humankind's first foothold on another planet. Extract raw materials from the Martian surface to refine and use. Survive dust storms, accidents, and hypoxia. Achieve complete self-sustainability, or die trying.\nPeriAreion, an astronomical term for the closest approach to Mars, aims to blend real-time strategy gameplay with a little simulation and science.Key FeaturesConstruct Your BaseBuild and upgrade a variety of modules to help your colonists survive. Each module provides unique activities and research for your colonists to engage in.Explore MarsChoose from three landing sites: Candor Chasma in the dusty Valles Marineris, Mawrth Vallis at the boundary of highland and plains, and frozen Hellas Planitia close to Mars' south pole. Each map has different weather and hazards, along with difficulties for navigation and resource location. Find points of interest, missions, minerals, ice, and photo opportunities as you explore. All terrain has been generated from satellite images of actual locations on Mars.Research Colony UpgradesSpend research points in five different trees with 71 possible upgrades. This includes three different colony specializations that determine your path to sustainability and change the way you win the game.Learn About MarsUnlock articles in the PeriAreipedia containing the latest research and science about Mars. Get new articles for completing missions, constructing modules, and performing research.","imageUrl":"https://media.rawg.io/media/screenshots/c7b/c7ba022d4b736a26236e5cce2f21343f.jpg","releaseYear":2015,"developer":"TBA Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14183,"name":"Please, Don't Touch Anything 3D","genre":"Adventure","price":0.0,"description":"Please, Don’t Touch Anything 3D is a cryptic, brain-racking button-pushing simulation now reimagined in full 3D.\nCovering for a colleague who is taking a bathroom break, you find yourself in front of a mysterious console consisting of a green screen monitor with a live image of an unknown city. Also present is an ominous red button with the simple instruction to not touch anything!\nPush it and expect to be held liable for any unintended aftermath. And there will be many.\nScavenge the room for clues, tools, and buttons to solve riddles and trigger explosive events. You cannot begin to imagine how many mind blowing surprises such a deceptively simple console has for you.\nThis new 3D version of the classic game features all new high-quality visuals, new mechanics, updated classic endings with new solutions, and a slew of new endings. Defiant button pressers are now presented with over 30 engaging puzzles that spring from hidden compartments inside the mysterious console.\nGo ahead, press the button. You know you want to.\nFEATURES\n30+ mind-bending enigmas with new endings and enhanced original endings\nFully re-imagined 3D environment with high-quality visuals\nSteam Cards, Achievements, and Emoticons\nAtmospheric chiptune soundtrack","imageUrl":"https://media.rawg.io/media/screenshots/b12/b122d70d49bc6dce55937c07e0b58ff8.jpg","releaseYear":2016,"developer":"Escalation Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":12953,"name":"Spy Fox 3 \"Operation Ozone\"","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameWhere would you like to go next, SPY Fox?\nAir Today, Gone Tomorrow.\nA huge hairspray space station is blasting vile vapors into the ozone, putting Earth at the mercy of the sun's rays. With her paw on the nozzle, Poodles Galore unleashes her plot to corner the sunscreen market. It's up to SPY Fox and his friends to \"can\" Poodles and save the planet.\nFeatures:\nKooky, crazy characters you'll love.\nInteractive animations send you on out-of-this-world adventures.\nMultiple game paths and mini-games in every corner stretch the fun.\nThe only interactive spy adventure of it's kind.\n11 original SPY songs.\nSave the World from the Poodle Menace!\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/e01/e01376b1a039bcddf7c5adf7fe99f590.jpg","releaseYear":2001,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12089,"name":"Forgotten Lore","genre":"Strategy","price":0.0,"description":"What is Forgotten Lore?Forgotten Lore is an online trading card game. It features dueling with random matchmaking, playing with friends, in game chat, and of course card trading between players. Every card is a Steam Inventory item, which can be traded and/or put on the marketplace. Players set their own rules - we will stay out of card trading as much as possible.\nCollect souls to summon spirits, use your spirits to crush your opponents. Take their tomes both to gain power and to learn more about the story. The game is based in a world far away from our own - in another time. So far away that most of it's lore has been lost to time. Battle after battle, the secrets of the world will reveal themselves to you.GameplayEach player can create their own deck of up to 64 pages, or cards. Place your pages into a Tome, and your deck will be born. Each Tome has it's own unique ability. For example, the default tome card is Leech - which hurts the user by 1 HP every turn, but giving them 2 souls (for summoning cards) in exchange. Another is Mill, which allows summoners to eat away at their own deck for souls. Nothing gained or lost each turn, only what they choose to sacrifice from their own hand.\nOn a player's turn, he/she is able to summon cards, use magic cards, attack the other player's cards or the other player directly. Each player starts with 64 HP, so the goal is to get their HP to zero. With a wide variety of cards with their own unique abilities, the ways to go about it are endless.\nThe game features a sacrificial system, to summon powerful cards at the expensive of weaker cards (or alternatively - just summoning the stronger cards at a super high soul cost). There are status effects, such as poison, burn, freeze, etc. Overheal also is a big part of the game - healing beyond the normal limitations of a card's abilities.","imageUrl":"https://media.rawg.io/media/screenshots/e23/e2387ea034c5b361b98e00462c955154.jpg","releaseYear":2016,"developer":"Coty Getzelman","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":11897,"name":"Genius Greedy Mouse","genre":"Action","price":0.0,"description":"Update NotesUPDATE: Im have changed the game start postion, so new players now starts directly in the Regular 1 village in order to avoid confuctions between puzzles and maze village sections. You now simply now start to see the first sets of puzzle levels.\nAbout the Game\nGENIUS GREEDY MOUSE is a clay based puzzle game featuring a host of fun and challenging levels.\nAre you a Genius Greedy Mouse?\nYou are a mouse, a very, very hungry mouse, living in a large underground world. Luckily, your world is filled with the delightful cheeses that you so desire. If only you could just reach out and eat to your hearts content.\nUnfortunately, the life of a mouse is not quite so simple. The cheese is not easy to obtain and many traps and puzzles will hamper your endeavours. Using all your cunning mouse skills, like all crafty mice can, you must find your way to the cleverly located cheeses. Can you eat all the cheeses ‘Greedy Mouse’?\nThe game plays through a variety of themed levels, encompassing both ingenious puzzles, and amusing diversions. Each level is played a move at a time, giving the player time to plan ahead and oversee the result, step by step. Play as fast or as careful as suits.\nFeatures: More than 110+ regular levels, spread in 12 villages.\nNore than 50+ random generated mazes from a map setup for causel players.\n3 difficulties: Light, Normal and Genius for all regular levels.\nHigh quality clay besed graphics.\nMany fun items to push, pull, prod, collect, and run from.\nSmash your way thought the puzzled mazes.\nBonus scoring ‘Plump Mouse’.\nXOR (A old BBC Micro Game) style gameplay, but with unique pieces and design.\nThe game does not using timed limit (except some water levels) puzzle design.\nSteam Trading cards & Badges to collect (see Badges above, the foil badge is secret here).\nGet ready to play the genius created puzzle mazes and try eat some genius placed cheeses!","imageUrl":"https://media.rawg.io/media/screenshots/0ce/0ce6f20c3d302a83389d66d330efebb1.jpg","releaseYear":2016,"developer":"Space Fractal","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":4852,"name":"God of War Collection","genre":"Action","price":0.0,"description":"Two Epic Adventures of Conquest, Destiny, and Vengeance, God of War® and God of War® II, return! In God of War® Collection, players will experience the dark world of Ancient Greece through Kratos, a brutal warrior determined to murder the God of War and alter what no mortal has ever changed... fate itself.\n* God of War® and God of War® II (two download files)\n* Remastered at a resolution of 720p\n* Anti-aliased graphics for 60 frames per second gameplay\n* Full PlayStation®Network (PSN) Trophies Support for each title.\n* Does not include bonus/behind-the-scene materials\nAdditional purchase info: For one price get access to this product for BOTH PS3™ and PlayStation®Vita systems. Purchase it on one system and it's automatically available in the PlayStation®Store on the other. Purchasing account may download item to up to 2 activated PlayStation®Vita systems and 2 activated PS3™ systems associated with this Sony Entertainment Network account.\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n© Sony Computer Entertainment America LLC.  God of War is a registered trademark and the Santa Monica Studio logo is a trademark of Sony Computer Entertainment America LLC.","imageUrl":"https://media.rawg.io/media/screenshots/5bb/5bbc83c6b4789122cc30b62877a9dcf6.jpg","releaseYear":2009,"developer":"Ready At Dawn","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":4583,"name":"God Hand","genre":"Action","price":0.0,"description":"When assaulted by a gang of vicious thugs, a shady drifter named Gene gets his right arm cut off. When he comes to, he finds himself with a young girl at his side, and his right arm reattached. But this is no longer an ordinary arm: it's been replaced with the legendary 'God Hand', and now that he's got it, Gene's on the hunt by every demon in the county, as they all want their hands on his. And with four powerful figures planning the demise of the world, things are probably gonna get ugly.\n\nGod Hand is a Western-style 3D beat-em-up where the protagonist punches enemies repeatedly with an incredibly powerful fist. The player can completely customize their attacks to their liking, as well as earning new ones. It is possible to set up a combo for four presses of the square button (choosing each attack for each press), or select more powerful special attacks and juggles. Dodging enemy attacks can be performed by moving the analog stick in the corresponding direction. Sometimes, stunning an enemy will cause a \"press this button\" icon to appear on-screen (similarly to God of War); if the player performs well at this bonus prompt, Gene will deal some extra damage to the enemy.\n\nOnce Gene has wailed on enemies enough with his regular fists, his 'Tension Gauge' will become full and the player can then press a special button to use the God Hand itself. This will make Gene completely invincible, more powerful and sped-up for a brief time. The player also has the option to use 'Roulette Moves', which use a special attack depending on the one selected.\n\nThe game also features a casino where the player can gamble using the slots, video poker, or blackjack. Cash earned at the Casino can be used to purchase all sorts of moves for Gene as well as other power-ups.","imageUrl":"https://media.rawg.io/media/games/1e5/1e5d9e5c50e3ed3013ce5abe95f1ab50.jpg","releaseYear":2006,"developer":"Clover Studio","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":1742,"name":"Giana Sisters: Dream Runners","genre":"Action","price":0.0,"description":"Race to the finish in Giana Sisters: Dream Runners, a fast-paced, head-to-head platformer for up to four players.\nRun and jump, dash and smash, daze and teleport, morph and cannon… oh you get the idea: mess with your opponents!\nThe game pits up to four players (or AI opponents) against each other in local and online competition, speed-running for the finish in an effort to push each other off the screen with the help of boosters and power-ups.\nSwitch the level layout on the fly as you rush through dreamgates. Collect gems to fill your speed booster and use your power-ups to knock out the other players and claim victory!\nKey features:\nCompetitive pick-up-and-play platforming game\nSupports a party of up to four simultaneous local & online players\nBe faster than your opponents, push them off the screen and win!\nUse your arsenal of boosters and power-ups to blast your opponents off track\nNine levels to race, four characters to unlock\nDual soundtrack: Chris Hülsbeck along with Swedish heavy metal legend Machinae Supremacy","imageUrl":"https://media.rawg.io/media/screenshots/11e/11ecbe8de0be6ab407a277cfb49276b5.jpg","releaseYear":2015,"developer":"Black Forest Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":1588,"name":"Toast Time","genre":"Action","price":0.0,"description":"Toast Time is a throwback to the golden age of video games where old-school homebrew titles fused arcade action with a distinctly British sense of humour.\n--\nAn appetising arena shoot-em-up garnished with tower-defence elements and served warm with awesome-sauce (probably syrup).\nInter-dimensional time-blob beasties have sailed the cosmos in pursuit of spare time, and now they've found it, tasted it, on an idyllic Monday morning.\nAssume the role of TERRY (toast-ejecting recoil & reload system), a humble and solitary toaster with an uncontrollable love for English breakfasts, hats and scheduling.\nClick to launch toast, crumpets and magnitudes of other breakfast paraphernalia at the beasties. Bounce around and crush them with your hot metallic mass. Tip over bins, and use the environments to your advantage. Drink a little coffee and go a little crazy. Do everything it takes to defend toast time – you are Monday morning's final hope. Have your toast and eat it.Feature List: 54 action-packed missions.\n16 exciting bread-based weapons.\nIron man survival mode & bonus COFFEE TIME mode.\nLoads of colourful hats and customisations.\nAddictive and original gameplay mechanics.\nSteam Achievements, Leaderboards, Stats, Cloud Save & Trading Cards.\nSuper-slick audio and calibrated soundtrack -- each level has its own piece of music.","imageUrl":"https://media.rawg.io/media/screenshots/3a6/3a6c53a132f79579de5e605997b19c16.jpeg","releaseYear":2014,"developer":"Force Of Habit","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":901,"name":"EARTH'S DAWN","genre":"Action","price":0.0,"description":"Earth’s Dawn is looming and the fate of the planet hangs in the balance! Become a member of A.N.T.I. – a squad of super-human soldiers powered by alien technology – and fight to reclaim Earth from the alien invasion known as E.B.E!\nDive into frantic side-scrolling combat and take the fight to the alien horde before destroying hulking bosses! Earn XP to unlock new abilities across a massive skill tree, then create new swords, guns and equipment with materials harvested from the battlefield. Choose your own mission path, discover the truth behind the invasion and save the planet before it's too late!\nPlay as an elite soldier using bionic alien implants and reclaim Earth from the invading nightmare!\nCreate your own unique soldier, customising their skills to your play style and crafting new weapons and equipment\nUse a huge range of sword, gun and agility moves in fast-paced battles to build combos and earn rewards.\nDiscover a unique story that changes depending on the missions you choose to fight through.","imageUrl":"https://media.rawg.io/media/screenshots/b04/b04ec7a80d47c190ef8c82e2b0d0d0d6.jpg","releaseYear":2015,"developer":"Rising Star Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":516113,"name":"Devil May Cry 5 Special Edition","genre":"Action","price":0.0,"description":"DEVIL MAY CRY IS BACK, BABY!! The legendary stylish action game is better than ever in the ultimate version of this multi-award winning hit.\r\n\r\nNew features:\r\n\r\n- New playable character - Dante's brother and arch-rival, Vergil\r\n- Legendary Dark Knight mode - an extremely challenging horde mode featuring huge numbers of enemies\r\n- Turbo mode - make the game even more intense by playing at 1.2x speed\r\n- Ray-tracing support - this next-generation graphics technology brings the already near-photorealistic world of DMC5 to a new level of unparalleled visual splendour\r\n- High Frame-Rate mode - experience super-smooth action","imageUrl":"https://media.rawg.io/media/games/d22/d2275ec49a1897191625fb04367bb702.jpg","releaseYear":2020,"developer":"Capcom U.S.A","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":373600,"name":"Book of Travels","genre":"RPG","price":0.0,"description":"Join The Book of Travels and become a part of  a unique social roleplaying experience that doesn’t hold your hand. Inspired by genre classics, this is a serene adventure that sets you adrift in a fairytale world... but it’s also an invitation to roleplay without the restraints of linear missions and plotlines. Feel at liberty to travel the free wilds and vivid cities of the Braided Shore peninsula. Wander deep into the layers of this hand-drawn world, stumble upon its hidden places or unravel one of its many mysteries. There is no overarching goal, no real beginning or end, but for mortal characters the stakes can be high.\r\nBraided Shore is a vast and intricate world, but meetings with other players are few and far between so your chance encounters will be something special. Choose to collaborate together or to survive alone, either way, you’ll be part of the birth of an exciting new online community, one  where many stories will be told.\r\nBut take note: This is a game for wayfinders and wanderers and it won’t plan out your route. Instead it will trust you to to play in your own style and to shape your own journey. Whichever way you choose to travel, you’ll soon be adding your own chapters to the Book of Travels.\r\nAuthentic roleplaying and individual playstyles\r\nPick one of 20+ Forms in a detailed character creation sheet that focuses on personality and identity rather than stats and classes. The game allows you to play in a style that matches your character and to set your own personal goals. Are you a danger-seeking adventurer, a stoic practitioner of magic binding, or a carefree tea drinking gambler?\r\nBoundless narrative that won’t hold your hand\r\nYour travels will present you with countless randomly occurring events making your story unique, and each session different from the last. Peel back the layers of diverse plotlines and discover an immensely deep fairytale world.\r\nTMO - Tiny Multiplayer Online\r\nOther players are few, but your paths will cross - it’s up to you to choose to travel together or go it alone. Find vehicles to reach far flung places or just amble through woods together. The absence of guilds and social structures makes your temporary fellowships unique and memorable.\r\nA beautiful world of uncertainty\r\nAn intricate and unique world that draws inspiration from old-world fairytales, Eastern mythologies and early industrial eras. Tons of intricate events chains that unlock items, characters, deep world secrets, and hidden gameplay features and tricks.\r\nCommunicate using symbols\r\nLearn to use a unique set of symbols to communicate with other players. Unlock new symbols as you encounter new features and places (e.g. you’ll gain the symbol for “city” only after you’ve visited a city). The limitation in communication lays the foundation for a rich and friendly multiplayer experience.\r\nInnovative RPG systems\r\nDefine your character by unlocking and mastering 300+ abilities, magical skills and passive feats that will have a huge impact on your character and open up different experiences of the game. Gain experience in numerous ways: by exploring, being courteous, gathering and trading. Battles can be rewarding, but you will learn more in defeat than in victory.\r\nThe world is a hand painted diorama\r\nExperience a unique game view perspective ‘painted’ in a richly detailed artstyle. Click to walk like old school RPGs but in scenes with 3-dimensional depth.\r\nCommiting to the world - together\r\nMight and Delight studio is fully committed to making this online world grow and live for a long long time - together with you. Much like a dungeon master we will hint about new mysterious scenarios, but it will be up to you, the players, to let us know what we should explore next. Additionally, we’ll add new levels, constantly making the vast world even bigger, adding new playable characters and of course thousands of storylines and events. Stories will change and evolve and eras of new narratives will follow.","imageUrl":"https://media.rawg.io/media/screenshots/555/55541e997e7cb96ced11d3f4775686a5.jpg","releaseYear":2021,"developer":"Might and Delight","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":372687,"name":"Spirit Hunter: NG","genre":"Adventure","price":0.0,"description":"Face the nightmares you thought were merely urban legends. Use your wits and trusty flashlight to search for clues to your sister’s disappearance. Team up with shady characters to uncover a dark mystery, making deadly decisions just to survive. The choices you make determine your fate and affect the lives of everyone around you.\nThis chilling companion story to the award-winning Spirit Hunter: Death Mark game brings terror home as fearful spirits invade local streets and parks – even your own home. Experience frightful sounds and stunning environments illustrated by artist Fumiya Sumio.","imageUrl":"https://media.rawg.io/media/screenshots/6c8/6c8e152584ba10b0fb9b34ebd3e2a434.jpg","releaseYear":2019,"developer":"Experience","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":371826,"name":"Deadly Premonition 2: A Blessing in Disguise","genre":"Action","price":0.0,"description":"Deadly Premonition 2: A Blessing in Disguise is an open-world survival horror video game serving as both a sequel and prequel to the original Deadly Premonition: The Director's Cut.\nThe story takes place in present-day Boston where it turns out FBI Special Agent Francis York Morgan will have to revisit a case he thought was solved in 2005. Through unique storytelling, venture back in time to the American town Le Carré, Louisiana and uncover the mysteries buried within this once peaceful town.","imageUrl":"https://media.rawg.io/media/games/f4e/f4e6375517e2b6e1d711249972365602.jpg","releaseYear":2020,"developer":"TOYBOX","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":275715,"name":"PRO EVOLUTION SOCCER 2019 LITE","genre":"Sports","price":0.0,"description":"A free-to-play version of \"PES 2019\" is here!*\nNow you can play the Online myClub and PES LEAGUE Mode, as well as the Offline Exhibition Match and Training Mode all for free!\nCreate your very own dream team with myClub, where current and historic superstars can be signed. World renowned legendary players like Beckham and Maradona feature, as well as FC Barcelona's Ronaldinho, and Inter's Recoba, Cambiasso, Djorkaeff and Adriano. More Legend players will appear in-game throughout the year in myClub!\nAim to be the best PES player in the world by competing in this season's PES LEAGUE. Users will be able to qualify for global events by participating in the  CO-OP (3v3) ONLINE Championship, time limited tournaments, or the newly introduced PES LEAGUE myClub 1v1 competition.\nPES LEAGUE is an online mode which features exciting tournaments to compete against each other to become the best PES player in the world.\n(*Offers in-app purchases)","imageUrl":"https://media.rawg.io/media/screenshots/2c1/2c10d510f49abfbd61cb3b6a61c4da56.jpg","releaseYear":2018,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":264859,"name":"Nanotale - Typing Chronicles","genre":"Adventure","price":0.0,"description":"Since time immemorial the Archivists have studied and cataloged the mysteries of the planet, observing its changes and holding to our vow of neutrality. Yet from the Ancestral Forest to the Blue Desert, the world is suffering. The Tree of Life sings the Final Song and we can feel it in our flesh: the world is dying. We bear witness, but we cannot interfere. We contemplate in silence.\nNanotale - Typing Chronicles is an atmospheric typing adventure RPG set in a colorful vibrant world. Follow Rosalind, a novice Archivist, as she journeys out into a valley to collect plant and rock samples for further analysis. The valley is peaceful. War is a thing of the distant past. Nothing can go wrong with such a casual task... can it?FeaturesExplore a vibrant 3D fantasy world: play as the Archivist Rosalind on her journey to the very edges of the planet.\nMore than just typing: Talk to other characters, solve mysterious puzzles, unleash magic powers and defeat enemies in epic magical fights\nEverything with keyboard: from movements, combats to even menus, control everything with a keyboard\nPlay in your own language: game texts are localized in English, French, German, Spanish, Portuguese (Brazil), Russian, Polish with voice-overs in English.\nThe game supports several keyboard layouts (QWERTY, QWERTZ, AZERTY, BÉPO, Dvorak, Workman and Colemak)\nMore features to be announced","imageUrl":"https://media.rawg.io/media/screenshots/ab8/ab8376ce80525ff745fa68b67fad3d53.jpg","releaseYear":2021,"developer":"Fishing Cactus","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":166209,"name":"H1Z1(itch)","genre":"Indie","price":0.0,"description":"Play the Battle Royale game that started it all. Now includes AUTO ROYALE. Drive into battle as part of a team-based vehicle of mayhem. Fight for power-ups to equip your squad and upgrade your ride.","imageUrl":"https://media.rawg.io/media/screenshots/2d8/2d82c5eb339b1fcf312ffba77fe902ef.jpg","releaseYear":2017,"developer":"Curdz","libraryGames":null,"platforms":[{"id":0,"name":"Web"}]},{"id":62118,"name":"Knights of Pen and Paper 2: Free Edition","genre":"RPG","price":0.0,"description":"Join the retro RPG world of Paperos - become a Knight of Pen and Paper in the newly revamped \"Free Edition\"!\nYou heard right! Enter and experience the horror of another beloved game franchise joining the dark side of free to play. Not tough enough? Turn on easy mode and pay your way to victory!\nPlay as both Party and Game Master playing a tabletop RPG (yeah, very meta) and face hours and hours of humoristic and nail-biting challenges!\nMain features:\nThe ultimate retro role-playing simulation - Free!\nCustomizable players, characters, equipment and even game room.\nSeriously deep character creation: Make that Hipster Elf Paladin and pull it off!\nMore contemporary geeky jokes than you can stuff in a CAVE! Gotta catch them all!\nLots of monsters to slaughter and loot for that sweet, sweet equipment\nA crafting system so powerful it can turn even the dullest stones into brilliant charmsHuge amount of locations, side-quests, dynamic dungeons… and more!\nNeed even tougher challenges? Prove your worth in the New Game Plus mode\nDISCLAIMER: Not compatible with the premium version of Knights of Pen and Paper 2! Progress cannot be transferred between free and premium version or vice versa.\nSick of corporate greed and cheap money-grabbing? Go back to the roots and check out true retro gaming:\nhttp://store.steampowered.com/app/310060/","imageUrl":"https://media.rawg.io/media/screenshots/b05/b05b76c85e4547a63ce438ada26da191.jpg","releaseYear":2018,"developer":"Kyy Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":59777,"name":"Holy Potatoes! A Spy Story?!","genre":"Strategy","price":0.0,"description":"Wishlist NowGet notified when Holy Potatoes! A Spy Story?! is released by clicking the Add to your wishlist button above!\nAbout the Game\nHoly Potatoes! A Spy Story?! is a wacky spy-agency sim game where you manage your very own spud spy headquarters! Recruit new spies, train and enhance your potato team, discover and build crazy gadgets, vehicles and facilities, and embark on top-secret missions!\nPlay as twins Ren and Rexa, who set out on a journey to discover the truth behind their parents’ disappearance with the use of their spy skills. Outwit and outsmart security personnel, bust through the sturdiest of doors, and hack some of the most complicated security systems! You will be the unseen hero in the shadows, using your intelligence, charm, stealth and strength to take on the enemy and fulfil your missions.\nInfiltrate enemy headquarters and sabotage their evil plans, use genetic splicing technology to create new spies and recruit legendary spies, and encounter pop-culture secret agents such as Justin Powers, Harry Fart, and Ezio de Frenzy in your quest to uncover the larger truth in Holy Potatoes! A Spy Story?!Key FeaturesManage and train the best potato spies the world has to offer\nEncounter pop-culture legendary special-agent spuds\nCreate new Genetically Modified Potato spies through genetic splicing\nMeticulously plan secret missions and heists\nCustomize, enhance and upgrade your spy agency\nBuild crazy gadgets, vehicles, facilities, and training stations\nStrategize your moves during mission planning to counter various obstacles","imageUrl":"https://media.rawg.io/media/screenshots/6b8/6b86cb0afaf93efe0e053ed0d580b1c4.jpg","releaseYear":2018,"developer":"Daedalic Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":58823,"name":"Splatoon 2: Octo Expansion","genre":"Action","price":0.0,"description":"Play as an Octoling in a new single-player DLC adventure with 80+ missions!\nPlay as an Octoling for the very first time in this large-scale downloadable content for the Splatoon 2 game! This full-on single-player adventure spans 80+ missions starring Agent 8, a new character who awakens on a dark subway platform. Navigate this mysterious underground test facility in a desperate battle to reach the surface of Inkopolis. Escape from these twisted depths, and you’ll finally be able to join multiplayer* matches as an Octoling!\nYou may think you know everything about the world of Splatoon, but these waters run deep, and so does the lore. Purchase this content today for immediate access to special octo-themed in-game gear.\nFeatures:\nPlay as an Octoling in a new single-player adventure spanning 80+ missions\nAfter waking up without your memories, navigate an underground facility to reach the surface of Inkopolis\nTake on a variety of mission types packed with new challenges you won’t find in the main game\nComplete the campaign to unlock Octolings (Girl or Boy) as playable characters in multiplayer* battles\nClear additional challenges to unlock more than 10 new pieces of in-game gear\nPurchase this DLC for immediate access to octo-themed in-game gear (Studio Octophones & Octo Layered LS)","imageUrl":"https://media.rawg.io/media/games/8a7/8a7e9776a4f72be09eff57c821391b96.jpg","releaseYear":2018,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":58118,"name":"Mafia II: Director’s Cut","genre":"Action","price":0.0,"description":"Mafia II: Director’s Cut includes Mafia II and the following DLCs: Joe's Adventures DLC, The Betrayal of Jimmy DLC, Jimmy's Vendetta DLC, War Hero DLC, Greaser DLC, Vegas DLC, Renegade DLC, and Made Man DLC.\n\nVito Scaletta has started to make a name for himself on the streets of Empire Bay as someone who can be trusted to get a job done. Together with his buddy Joe, he is working to prove himself to the Mafia, quickly escalating up the family ladder with crimes of larger reward, status and consequence… the life as a wise guy isn’t quite as untouchable as it seems.\n\n– Action-Packed Gameplay: Intense gunplay, white-knuckle car chases and visceral hand-to-hand combat \n—it will take all that and more to become a “made man”.\n\n– Epic Gangster Story: Inspired by iconic mafia drama, the compelling characters and cinematic presentation will pull players into the allure and impossible escape of life in the Mafia.\n\n– Immersive World and Period: Enter the world of Empire Bay - World War II is raging in Europe and the architecture, cars, music and clothing all echo the period in stunning detail. As time passes, hot rod cars, 50s fashion and some of the era’s best music reflect the birth of a cool new era.\n\n– Illusion Engine™: 2K Czech’s proprietary Illusion Engine, allows gamers to explore Empire Bay’s 10 square miles of beautifully rendered outdoor environments and intricately designed interiors.\n\n– Soundtrack Reflects the Mood of the Era: Players will be immersed in the Golden Era of America as Mafia II features tracks from some of the era’s most influential artists..","imageUrl":"https://media.rawg.io/media/screenshots/b89/b89e21262f2cd03b32db80ffcf4f515b.jpg","releaseYear":2011,"developer":"Feral Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"}]},{"id":45883,"name":"Lost with Dinosaurs","genre":"Action","price":0.0,"description":"In Lost with Dinosaurs you are a scientist that somehow teleported himself into dinosaurs times in order to collect mushrooms.\nYou must collect all the mushrooms in all  8 levels and find a way to get back to modern times.\nBut you have to be very careful those dinosaurs are hungry and will attack and stole some of your mushrooms.\nYou can temporary shoot them down and you can use power up potions that you will find in game. The red potion makes you jump higher for 10 seconds and the green potion allows you to make a double jump.\nIf you get lost and you are unable to find a mushroom you can press K for a hint.\nWhen you got all mushrooms you must search for exit.\nIn your way there will be 3 types of energy field. You must collect the corresponding color crystal to disable that energy field.\nGood luck","imageUrl":"https://media.rawg.io/media/screenshots/dba/dba81f0666f148dab6de209262dfde71.jpg","releaseYear":2017,"developer":"Mihai Morosanu","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":43411,"name":"Reverie","genre":"Action","price":0.0,"description":"This game presents a vivid animated style where players take on the role of a kitten armed with a gun, embarking on adventures in a challenging world. Using the ASDW keys for movement, the space bar for jumping, and the left mouse button for shooting, players navigate through the game. The background music is cheerful and energetic, with a fresh sound effect accompanying every jump, setting a light-hearted and enjoyable atmosphere. Along the way, players face various monsters but can also collect sun-shaped coins that enhance their abilities. By leveraging the terrain, the kitten can perform higher and farther jumps. The health bar in the top-left corner shows the kitten’s condition, and by picking up items, players can recover health or gain additional playtime. Additionally, tunnels allow the kitten to teleport to different locations, adding strategic depth and fun to the gameplay.","imageUrl":"https://media.rawg.io/media/screenshots/896/896a031eff2e03dc483e2c72c9709457_KrfRkrI.jpg","releaseYear":2015,"developer":"Rainbite","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":42019,"name":"Supremacy 1914","genre":"Strategy","price":0.0,"description":"Welcome to The Great War, General! Choose your nation and assume the highest office in your desired empire. Balance the production of materials, troops and weaponry with the rare resources your land has to offer. Forge alliances with your competitors, do important trade deals or fight yourself through the 1st World War. This rough period demands a clear minded leader like you. Don’t let your people starve, train them to join the cavalry, place them into the first experimental tanks, develop your country and slowly conquer the world.\nVeteran grand strategy players will see their gaming skills be put to use on the battlefields in this huge World War I game, battling with economy, armies and the ever growing threat presented by your opponents. Role-play as Queen Victoria or change history however you want. In Supremacy 1914 - The Great War your imagination and skill are your only limits! Up to 500 players can compete in real time on historical and fictional scenarios.\nFEATURES\nReal Time Multiplayer\nUp to 500 real opponents per map\nRealistic distances and unit movement\nMultiple maps and scenarios to play\nHistorically accurate troops and vehicles\nExperimental weapons and units of the time\nFrequent updates and new content\nForge alliances with other players\nWin together in coalitions\nLogin with your existing Supremacy 1914, Call of War or Conflict of Nations account when the game is available!\n***IMPORTANT: Supremacy 1914 - The Great War is a free game and is continuously being updated and further developed. To ensure further improvements and fresh content, there is the possibility to purchase premium currency and premium account in-game.***","imageUrl":"https://media.rawg.io/media/screenshots/539/539ad4a6935a47f29b3291dc1856c78a.jpg","releaseYear":2010,"developer":"Bytro Labs","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":40095,"name":"Forsaken World","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/d99/d99ae30ed5a0ae6ccc3fcd5c7141ed0f.jpg","releaseYear":2011,"developer":"Perfect World","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":39516,"name":"Art of Murder: Cards of Destiny","genre":"Adventure","price":0.0,"description":"A vicious serial killer leaves a trail of blood across America. He butchers his victims and leaves a card at the crime scene as his signature trademark. But he wants more!\n\nHe triggers a psychotic face-off with the Federal Agent Nicole Bonnet, whose area of expertise is serial killers. After observing her for years, the time has come to challenge her. So far, he is always one step ahead of Nicole...","imageUrl":"https://media.rawg.io/media/screenshots/cf5/cf54b5a362a1a90305cd0611a34f77b8.jpg","releaseYear":2010,"developer":"City Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":31439,"name":"3D Pinball: Space Cadet","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/2e4/2e43a1d9e73c9c413b6f1ee92a337bc2.jpg","releaseYear":1995,"developer":"Maxis","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":30945,"name":"Last Rites","genre":"Action","price":0.0,"description":"And The Dead were made flesh and dwelt among us. In flesh ripped and pocketed in running sores and the terror of our age our bodies cannot staunch the flow of darkness nor stem the tides of death. We are food but not for long.\nThere is enough fire power stacked here to blow them soulless husks to hell and back; and we are giving it them all. The towns and cities are burning and the end's a long time coming. Enjoy it while you can.\n• Full 3D Environment with full 360 degree rotational view.\n• Mission based scenarios for full immerse play.\n• Massive numbers of enemies at any one time.\n• Controversial horror setting.\n• Gory hack and slash first person action.\n• Incredible Painted backdrops.\nDue to the age of the title, it currently does not support network multiplayer.","imageUrl":"https://media.rawg.io/media/screenshots/385/385fdde41ab7d8c1edf280979ef7c31d_gTSM29o.jpg","releaseYear":1997,"developer":"Ocean Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21129,"name":"Match 3 Revolution","genre":"Action","price":0.0,"description":"Match 3 Revolution” is an original physics Match 3/ Marble Popper game. Its main features are:\n-\tCreate sets of at least 3 touching balls of the same color.\n-\t100 Levels of Unique Gameplay.\n-\tOriginal game modes: click a ball, draw a line, drop a ball and play pinball.\n-\tSupercharge with combos.\n-\tA lot of power-ups (electroball, fireball, megabomb, fusionball, missiles,…).\n-\tTop 50 Online World Ranking in every level.\n-\tOriginal music.","imageUrl":"https://media.rawg.io/media/screenshots/4ae/4ae160d4248dc4222537624b70605168.jpg","releaseYear":2015,"developer":"DreamsSoftGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20527,"name":"Crazy Belts","genre":"Casual","price":0.0,"description":"Do you know what happens after check-in? Do you think our luggage is safe in the conveyor belts of the airport? Now you can discover the truth!\nCrazy Belts is a casual puzzle game that tells the amazing story of our bags, and why they end up in distant countries when we leave them in the belts. Join Loui the Bag in his trip across five countries: travel from London to Madrid, from the majestic Statue of Liberty in New York to the Great Wall of China… and help him and his friends to return home safe!\nBECOME THE CARGO GUY!\nPlaying Crazy Belts is simple: you become the cargo guy and have to manage the belts, making every piece of luggage falling from above get to its correct destination. Colors will help you, and eventually you’ll get amazing superpowers to unlock. Easy-peasy? Well, don’t be so sure… When the action rushes on and mad gears and contraptions appear in the screen, you’re going to need all your expertise and best reflexes to prevent the bags from being lost forever. Hurry up before the plane leaves!\nFEATURES:\n* Addictive puzzle game for all ages\n* 50 levels to beat, and Infinite non-stop mode!\n* Travel across 5 countries, from London to Peking\n* Irresistible pop-eyed bags!\nDon’t forget to leave us a review if you like our game :-)","imageUrl":"https://media.rawg.io/media/screenshots/c54/c547df9d236894aa9d2b0b6c836cbb54.jpg","releaseYear":2016,"developer":"jemchicomac","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]