[{"id":12671,"name":"Racecraft","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48a/48ac21574cf80995740d01e04832495c.jpg","description":"Racecraft is the new innovative racing experience by Vae Victis Games, a sandbox driving game based on PROCEDURAL technology. For the FIRST TIME ever, you can randomly generate an endless number of realistic racetracks and craft your car to reach the top in every race and eSports challenge.\nWith its original approach and innovative set of features, Racecraft aims to be a really fresh product in the racing games arena.Racecraft: a Procedural Sandbox Racing Experience.A proprietary procedural engine, called Camilla, generates an endless number of tracks. They can be saved and shared, producing lots of different racing situations. For the first time in racing games, the look and feel of the randomly generated tracks is really similar to the real-world circuits, Racecraft has a unique hard edge futuristic design that set it apart from all other racing titles.Multiplayer and eSports Racing featuresChallenge your friends in multiplayer races and hot lap parties or share your procedurally generated track and let them race against your ghost. Join the official Racecraft leagues or use our complete eSports toolset to easily create your own online racing leagues and live broadcast your events.Sandbox ExperiencePlayers can craft the car from scratch using and crafting all the various parts to generate lots of different sets of physical features and car setups. Players will also be able to craft their own tracks with a track editor using the same logics of the Camilla procedural engine. All events can also be defined by players: they can choose rules, tracks, cars and invite friends by sharing the event on Steam and Facebook.VR supportRacecraft has been developed with VR in mind. The driving menu allows interaction with the cars during the races without losing focus. The entire game UI is usable without taking your hands off the wheel or joypad. This system is called SixInput, for steering wheel users, seats and/or a VR headset. The game also implements voice commands and a “virtual track engineer” who will help the driver improving his racing experience by talking about tracks, setup, strategy, race status, car status and so on.Co-op and multi-rolesThere will be different roles in the multiplayer mode of Racecraft. A team will be composed by several cooperative roles: driver, team manager, track engineer, mechanic, car designer and many others.Follow the Dev BlogFollow the dev blog at http://playracecraft.com to know more about Racecraft, its development, its procedural technology and the people who are working on the game.\nLike us on Facebook for exclusive contents and the latest news and updates on Racecraft!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vae Victis Games","platforms":[{"id":0,"name":"PC"}]},{"id":12626,"name":"Good Robot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa0/fa0f4d8020c95b444a9eb1e9ee646e06.jpg","description":"Feature ListNavigate procedurally generated labyrinths that provide a different challenge every time\nUse a vast range of weapons, from the reflecting laser and plasma mortar to the classic shotgun and exploding bouncing frisbee\nCustomize your killbot with an upgrade system guaranteed to improve termination efficiency. OR you can just waste all of your money on buying hats.\nCompete for high scores on global leaderboards and with your friends\nTrace amounts of dystopian humor\nAbout the GameIn 2031, unchecked pollution meant humans could no longer survive on the Earth’s surface. Fortunately, PyroCorp saved the world by building massive underground cities with an army of intelligent robots.\nEverything was fine - until one day, the robots went bananas and killed all humans. To avert a public relations and stock market nightmare, PyroCorp rests its final hope on you - the only remaining Good Robot.DO✓ Erase all evidence that suggests PyroCorp caused human extinction\n✓ Terminate all bad robots, for they are the incriminating evidence\n✓ Support PyroCorp by purchasing the latest in robot destruction technology\n✓ Save yourself from killer robots by making sure your killer robot is betterDON'T✗ Question what you’re told\n✗ Listen to what the virus has to say\n✗ Talk to the robots\n✗ Romance the robots\nAre you a Good Robot? Let me put it this way:\nDo bad robots come with a 14-day money back guarantee*?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pyrodactyl","platforms":[{"id":0,"name":"PC"}]},{"id":11325,"name":"The Body VR: Journey Inside a Cell","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a0/5a0ff7bd29a5747ccc2528e430569985.jpg","description":"The Body VR: Journey Inside a Cell is an educational virtual reality experience that takes the user inside the human body. Travel through the bloodstream and discover how blood cells work to spread oxygen throughout the body. Enter one of the billions of living cells inside our body and learn how the organelles work together to fight deadly viruses.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Body VR","platforms":[{"id":0,"name":"PC"}]},{"id":8368,"name":"Braveland Wizard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6aa/6aa7fd3afc1aa92bf64167317738b0f2.jpeg","description":"The same old school turn-based strategy game is back - welcome to Braveland Wizard! The graduate of the Academy of Magic is ready for new adventures. Her journey begins high in the mountains and passes through the southern lands, populated by orcs, ghosts, and mysterious nomads.\nNew hero - Wizard\nAn entire set of unique battles with unexpected surprises\nDungeons for random battles and worthy rewards\nPiles of stylish artifacts\nThree schools of pure battle magic\nA talent tree that changes the nature of battle\nA brave team of combat allies: monk, ice archer, elementalist, and many more\nA hand-drawn game world with a huge waterfall\nAnd, last but not least, three cunning bosses\nBraveland Wizard is the second book of Braveland series.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tortuga Team","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":4872,"name":"Dead Space Ignition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/713b04076ad38438a01d903eb1fb5c84.jpg","description":"Free download with pre-order of Dead Space™ 2 from participating retailers.* Dead Space™ 2 unlocks activated after completion of first hack and game save in Dead Space™ Ignition. In Dead Space™ Ignition you must survive the initial Necromorph outbreak on The Sprawl.  The game blends a comic presentation with three unique hacking games.  You’ll receive unlocks in Dead Space™ 2 including an exclusive suit.  Can you survive the events leading up to Dead Space™ 2?\n*Free download requires prior reservation and unique redemption code from participating retailers.  Dead Space™ Ignition is also available for purchase without the pre-order of Dead Space™ 2.\n© 2010 Electronic Arts Inc. All Rights Reserved. All other trademarks are the property of their respective owners.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":1810,"name":"Storm in a Teacup","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b1/1b108a7778d958b50e2e76e88c1c9c53.jpeg","description":"Take Storm on a wonderful adventure in his magical teacup. Storm's brother Cloud has created an amazing dream-like world for you to explore! Solve puzzles, avoid pitfalls and beat the bad guys in this imaginative and unique platformer!\nKey Features:\t\t\t\t\t\t\t\t\t\t\tWonderful, rich rewarding game-play with physics based puzzles\nExplore and discover 50 magical levels\n5 Survival mode levels to compete against\nCustomize in-game Storm character options\nRich, gorgeous, graphics\nFull Joypad support\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cobra Mobile","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":833450,"name":"Heaven Burns Red","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/131/131620d21a68b0ec6bc120c04118003f.jpg","description":"Heaven Burns Red (ヘブンバーンズレッド) ___\nThe Earth, which was attacked by the mysterious life form \"Cancer\", was in danger. The \"Cancer\" was not affected by the weapons that human beings had produced so far, and human beings who had no way to repel were defeated. The land was abandoned and various nations disappeared into the war. Most of the land is now under the control of \"Cancer\".\n\nWhen humanity had little time left and was prepared for extinction, a new weapon was developed. That is the decisive battle weapon \"Seraph\". Only those equipped with it could effectively hit the \"Cancer\". Mankind gathered those who had the skills to manipulate \"Seraph\" and established the Seraph unit with the last hope. Those who could manipulate the \"Seraph\" had one thing in common. Being girls with some talent.\nKayamori Tsukiuta is one of them. She also puts herself into the fight with Cancer.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"VisualArts/Key","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":674321,"name":"Age of Darkness: Final Stand","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6e/f6e0bb35396f66fbefd224620261268e.jpg","description":"Survive and Strategize Discount\nJoin The AoD Discord!\nDevelopment Roadmap\nAbout the Game\nBuild, Gather and Fight in a Desperate Last Stand Against an Onslaught of Never Ending Evil!\nThe darkness is an entity of evil. Some say it is the manifestation of human fear and nightmares, others say it is a wandering mass of damned souls haunting us. The origin of the darkness itself is unknown, but one thing for certain is that we can keep it at bay through the power of light and fire.\nBrace yourself against huge tidal waves of Nightmares. Leveraging an internally developed technology called ‘SwarmTech’ allows the game to render over 70,000 enemy units on the screen at one time. These enemy legions claw their way up through seething fissures in the earth to reinforce ‘The Veil’.\nLight up a rich, complex, procedurally generated map to claim territory back from ‘The Veil’. A dynamic living death fog that conceals enemies and drains life from your troops. Holding the line against this terror is not for the faint of heart.\nBorrowing from the the roguelite genre, Malices are random afflictions placed on the player during every Death Night, unraveling the best made plans. Conversely, if a Death Night is survived, you may decide between three randomly selected Blessings, enriching the experience and giving your army a much needed edge.\nLead the charge against the horrors of the night with powerful and unique Heroes. Using special abilities gained from leveling up, these Heroes can be key to turning the tide of a desperate battle. But beware, the Nightmares have Elite roaming champions of their own that drop precious resources when killed, posing an extreme and ever-present threat to your expansion.\n'SwarmTech' allowing for over 70,000 swarming AI units on screen at any time\nBuild defenses against thousands of enemies during Death Nights\nDay & Night transitions, expand by day, hunt by night\nUnique Heroes to level up and micro-manage to gain an edge against the dark\nLiving Death Fog system that grows and recoils from the light\nRandomized Malices & Blessings to make every survival unique\nMulti-faceted Skill Tree system to progress through for your Units\nWandering Elite Nightmares that may ambush your party and drop precious Dark Essence\nHorror and Embolden based status effects which may curse or aid your troops\nSpecial Nightmare units, Spitters, Crushers, and Wraiths that test your combat skills","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"PlaySide","platforms":[{"id":0,"name":"PC"}]},{"id":485209,"name":"Inertial Drift: Sunset Prologue","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f2/7f2ee47887256380483adce9f406b402.jpg","description":"WISHLIST THE FULL GAME HEREhttps://store.steampowered.com/app/1184480\nAbout the GameSet in a 90's retro future, Inertial Drift offers a driving experience genuinely unlike anything you've played before – boasting twin stick drifting mechanics that need to be felt to be believed.\nWelcome to Inertial Drift: Sunset Prologue - a place to put your racing credentials to the test before Inertial Drift arrives later this summer.\nHone your skills by the lakeside, then head to the coast for a sunset showdown and pitch your best time against the most skilled drivers on the planet.\nConquered the demanding twists and turns of the Sunset Circuit? Think again. Step into HPE’s high performance car - The Dragon - and discover what it REALLY means to master the art of drifting.\nUnique Twin Stick Controls for Precision Drifting\nThe left stick handles steering, the right hand stick gives you total control over your drift. Intuitive for new players and uniquely challenging for pros.\nTwo Challenging Tracks\nLakeside Loop - The long, sweeping bends of the lakeside are the perfect place to learn your craft as you race around the water’s edge.\nSunset Sea Circuit - A gorgeous neon sunset provides the backdrop for this technically demanding track.\nTwo Fiercely Individual Cars\nCoda Gecko - Coda’s most popular model, the Gecko strokes a balance between speed and control. It’s great all-round performance and predictable handling make it perfect for racers looking to hone their skills.\nHPE Dragon - Intimidating to drive and to race, what HPE’s high-performance Dragon lacks in subtlety and manoeuvrability, it more than makes up for it in raw power and top speed.\nThe Best Is Still To Come\nInertial Drift is coming this summer to tear up the racing rulebook. Wishlist Inertial Drift now on Steam to be the first to receive updates on the full, 16 car and 20 track racing game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Level 91 Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":336535,"name":"Valkyria: Revolution","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/586/586759d921b718def4c0f8b46e89ccce.jpg","description":"In the wake of a revolution, Jutland's elite soldiers, the Vanargand, must band together to defeat the Ruzi Empire and stop death itself—the Valkyria. With an engaging story full of political intrigue, a battle system that mixes real-time combat and tactical strategy, a gorgeous visual style, and more, Valkyria Revolution will immerse players into the frontlines of a desperate war.\nEquipped with advanced mana weaponry and wielding powerful ragnite spells, this grizzled anti-Valkyria squad will charge head on to combat the terrifying threat of the Valkyria. However, Amleth Gronkjaer, the commanding officer of Vanargand, hides a terrible secret. Is he friend or foe to the country he has sworn to protect?\n1 player\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SEGA. SEGA, the SEGA logo and Valkyria Revolution are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates.\nAll rights reserved. SEGA is registered in the U.S. Patent and Trademark Office. All other trademarks, logos and copyrights are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SEGA","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":281878,"name":"Streets of Red: Devil's Dare Deluxe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/631/6315c9fecb6d97c92d49164b136e2162.jpg","description":"FREE COPIES FOR DEVIL'S DARE OWNERSStreets of Red: Devil's Dare Deluxe is an updated version of the original Devil's Dare, with updated contents, better balancing and improved experience.\nWhen the game was released on Nintendo Switch a few months back, we were able to found small success, climbing up to 9th place on the EU eShop during launch. However, none of this would have been possible without the love and support from the original players that told us repeatedly how much they enjoyed and believed in the game.\nAs a token of appreciation for all the support back when the game was first released, we are giving away a free copy of Streets of Red to everyone that owns a copy of Devil's Dare in your Steam Library. Thanks again for all the love. I hope you find time to enjoy Streets of Red again, and share the news with your family and friends that might have missed it the last time. Thank you!\nAbout the GameIn Streets of Red: Devil's Dare Deluxe, the only thing scarier than being eaten alive is running out of quarters! A permadeath multiplayer horror beat'em up that bestows players with the skills of retro gaming heroes in a fight against a legion of undead monstrosities.\nStreets of Red was designed to be played over and over again, with each run offering up the potential for new content. Six unique playable characters and an ever-growing level selection work to keep the gameplay from getting old and rotten, while the easy to learn but hard to master combat system allows for plenty of depth.\nWith every kill, you earn cash that can be spent on upgrades, or to revive yourself when you die. You better learn how to make cash fast and spend it smart in Streets of Red because when you're dead, your save data dies with you. The chills, thrills, bills, and opportunity to learn new skills here won't stop until every street runs red with blood! Are you up for the challenge of an anti-lifetime?","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ratloop Asia","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":276653,"name":"Sea Salt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f72/f7285e1987a7e6ced58e1012134a7750.jpg","description":"Sea Salt is an action strategy hybrid, in which you are an Old God summoning unfathomable horrors to blight the human lands. You will have your sacrifice, and humanity will pay for denying you what you are owed.\nSummoning a tide of minions, your army will emerge from the sea to take vengeance on the religious figures who have dared to defy you, and anyone else that stands in your way.\nWhen humanity prayed you were willing to offer them fair winds for their fishing vessels, and they enjoyed the riches and prosperity you provided. They knew the price, but cowardice overtook their faith when the time came to collect. The bishop of your church defied your will, but when the horrors of the deep emerge from the gloom he will beg for the mercy of a swift death.\nCommand an unruly troop of nightmarish creatures, cultists and horrors from the deep\nControl the whole swarm at once, directing it to attack your victims or withdraw to avoid their defenses\nUse the terrain to surprise and surround the weak minded to make them lose their minds to fear\nDiscover cards in a hellish tarot to unlock 16 different units with their own strengths and weaknesses\nHunters, and special bosses alike, will be swept away on your path to vengeance","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"YCJY Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":61315,"name":"IOSoccer","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/550/550bb78e6c1ed1e8a2c541e030e8c0e5.jpg","description":"IOSoccer is a free non-commercial competitive third-person online multiplayer soccer game that offers unparalleled freedom in ball control and gameplay depth. Originally released 15 years ago under the full name International Online Soccer as a Half-Life mod, the game was later ported to the Source Engine and re-released in 2008. Since the last public release, the game’s code has been completely rewritten, new player models created, and countless new gameplay features added.\nFeatures:\nUnparalleled freedom in ball control and gameplay depth: The combination of a third-person camera together with mouse and keyboard input gives you full control over your dribbling, shooting, and passing.Skill moves: Show your mastery of the game with bicycle kicks, diving headers, ball flicks, and precision dribbling.Flexible team sizes: Whether you prefer 4v4 street games or our standard 8v8 matchups, we support everything from 1 to 11 players per side.AI and human goalkeepers: You can let the server control the keeper or take its position yourself on the fly.Public matches: Join and leave public servers with casual matches whenever you want to.Competitive matches: Participate with your club, national team or mix team in leagues and cups organized by the community.Dedicated servers: Use our official dedicated servers or rent your own one from a hoster of your choice.Player customization: Set your shirt name, pick your shirt number and choose your ethnicity, hair style, shoes, keeper gloves, ball, and sleeve length.Instant replays and highlights: Watch goals again from the TV camera's perspective right after they happened and use intermissions to catch up on chances you missed.Goal celebrations: Choreograph your team's goal celebrations with various animations.Warm up mode: Practice shots on your own goalkeeper during warm up before the match where every player has their own ball.Custom assets: Make your own maps, team kits, balls, shoes, and keeper gloves.100% free: No microtransactions or any other hidden costs.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"IOSoccer Team","platforms":[{"id":0,"name":"PC"}]},{"id":59739,"name":"Scheming Through The Zombie Apocalypse: The Beginning","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0a/b0a2d2ca82acc669a0b1baafb0919448.jpg","description":"Join retired salesman rabbit, Hank, and his canine pal, Larry, in part one of this story-driven game series as they use their knowledge of influence and persuasion to make their way through the apocalypse—without having to risk their own skin.\nWith a mixture of dark comedy and the use of real-life influence tactics, this story-driven game puts you behind the wheel of the characters’ choices. Can you convince a timid animal to enter dangerous looting locations? Will you risk your scavenger’s life for more resources?\nFeatures:Bargain to convince animals to scavenge for you and split the loot.\nGuide your scavenger in high-risk situations.\nTrade items to earn the highest value.\nGamble items, if you too like to live dangerously.\nLearn a thing or two about influencing others. (Works in human-dominated worlds, too.)\nSurvive without having to actually work too hard.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Entertainment Forge","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":39144,"name":"Spore: Galactic Adventures","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/658/6580fae138b8abf920929af6501cce4d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Maxis","platforms":[{"id":0,"name":"PC"}]},{"id":36787,"name":"Enemy Territory: Quake Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51e/51ea4f8266be68daed40f0340313f1b4.jpg","description":"Enemy Territory: QUAKE Wars™ is the ultimate online strategic shooter. Taking place in the year 2065, the game lets you play as the GDF or Strogg in one of five unique character classes, either online or offline with computer controlled AI teammates and opponents. Employing an arsenal of weapons, vehicles and deployable armaments, engage in an action-packed test of skill and coordinated teamwork through a series of combat objectives. Persistent character growth and achievements reward players for teamwork, while clearly defined mission and class objectives guide new players to meaningful contributions on the battlefield.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Aspyr Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":28109,"name":"Sprint Vector","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18e/18e4966728a9ff65105cab856f20750e.jpg","description":"Welcome to Sprint Vector championship intergalactica! The most popular game show in the universe is always scouting for stars...and its newest and brightest is YOU!\nHosted by everyone’s favorite robo-personality, Mr. Entertainment, Sprint Vector sends its intrepid contestants running, jumping, climbing, flinging, drifting, and even flying across crazy interdimensional race courses and challenge maps where your speed and finesse are put to the test. These intense head-to-head matches have become the must-see event of the millennium!\nSprint Vector is the ultimate competitive VR game: a multiplayer adrenaline platformer that merges the physical thrill of extreme sports competition with the unhinged energy of a zany game show spectacle. Survios’ innovative Fluid Locomotion System and intuitive intended motion mechanics let you comfortably attain and maintain extreme speeds in VR.\nStep into the vector blades of an intergalactic star, rev up, and explode onto Sprint Vector’s colorful landscapes on a variety of races courses and challenge maps. Scale skyscraping towers, leap across treacherous chasms, plummet from perilous heights—but watch out for your fellow sprinters! It’s just one slow mine, nitro, or impulse jump between glory and defeat.\nAdd in a pulsing electronic soundtrack, hilarious running commentary, powerful projectiles and boosts, as well as multiplayer support for up to eight players, and you’ve got a hit show no matter what planet you’re on!\nCool Features\nFluid Locomotion System: You’ll feel the rush as fluid translation and intended motion lets you attain and maintain incredible speeds with no physical discomfort.\nActive VR Gameplay: Use your entire body to run, jump, drift, zip, climb, fling, shoot, dodge, and fly with intuitive motion controls.\nSingle and Multiplayer Competition: Race against up to eight contestants live before the entire galaxy, or train hard for the title on hazardous challenge maps.\nWeapons and Items: What’s a little friendly competition without a bit of self-serving sabotage? Take aim at both the course and your competitors with weapon attacks and usable items.\nChoose Your Look: From space kids and disc jockeys, to graffiti artists and gangster sharks, enjoy a diverse case of playable characters from every corner of the galaxy\nVibrant Universe: Plunge into a colorful, bombastic spacepunk world vibrating with energy that’s sure to get your pulse pounding.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Survios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":23488,"name":"Sudden Strike 2 Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62d/62d3f3fa5ae69b100513e168a95be92f.jpg","description":"NOTICEThis is a re-release of a classic game. Even though it was tested on a variety of modern Windows PC configurations, unwanted side effects such as video/audio glitches and crashes may occur. If you are encountering technical issues with this game, please visit the community forums for assistance and support.\nAbout the GameAt the height of World War 2, take command of German, Russian, British, American and Imperial Japanese armies on battelfields across the globe. Sudden Strike 2 expands on all aspects of the classic RTS game with new units, maps and epic campaigns as well as overhauled multiplayer modes.Features\n5 epic campaigns and a new combat theater: The Pacific!\nMassive battleships, landing craft and trains\nCommand airfields and deploy aircraft\nMechanized units now have individual crews to command\nDynamic weather system\nContains \"Sudden Strike 2\", \"Resource War\" add-on and \"Total Victory\" map pack\nContains map editor for user-generated maps and missions","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Fireglow","platforms":[{"id":0,"name":"PC"}]},{"id":22811,"name":"Crusader: No Remorse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8cb/8cb6ed21bc4d084b41dd00dd52342548.jpg","description":"As a Silencer, one of the elite enforcers of the World Economic Consortium, you're supposed to be incorruptible. But if the system you serve is utterly corrupt, where does that leave you? You go over to the Resistance, the same pack you used to hunt down. Now, your former employers better watch their backs because you're coming after them with all the firepower at your command.\nNo pity. No mercy. No Remorse.Very immersive Sci-Fi atmosphere enhanced with very polished graphics and an amazing soundtrack composed by acclaimed musician Andrew G. Sega, a.k.a Necros\nHighly interactive, destructible environment - why bother finding a keycard when you have some C4 to spare?\nImpressive arsenal of futuristic weapons and fast-paced action create a very satisfying feeling of being the elite killing machine: The Crusader","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Origin Systems","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":22403,"name":"Warfare","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/baf/bafcd230513ad242a9d9ea626a60fc77.jpg","description":"Saudi Arabia, one of the world's leading oil suppliers and a key U.S. ally, has been taken over by a highly organized group of radical terrorists. The government is in a state of collapse and turmoil and you have been chosen to lead the United States' armed forces to restore control.\nSearch and destroy using the latest military hardware from the Abrams tank to the Apache helicopter in realistic settings ranging from the open desert to close-quarters infantry combat. Wear down enemy morale by capturing vehicles, weapons and buildings.  You'll need elite forces to destroy the world's best-armed fanatics, bent on world-wide economic collapse.  The soldiers who survive will gain experience and move with you from mission to mission.\nFailure is not an option — This is Warfare.\nKey features:\nFight with the latest U.S. & Russian Weapons Systems\nDominate real territories created from satellite images\nGain experience for your troops by keeping them alive\nCapture Enemy vehicles and weaponry\nDestroy everything in your path with realistic physics\nShock and Awe your opponents to wear down their morale\nHone your tactics in various environments from open desert to urban combat\n12 missions for the USA army expeditionary corps","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"GFI Russia","platforms":[{"id":0,"name":"PC"}]},{"id":21267,"name":"Dinner Date","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a6/1a6dc3c44a38e9adaf22bdcf3816356c.jpg","description":"Julian Luxemburg has prepared a dinner for two at his place – but things go awry when the date does not show up and he is left waiting at his dinner table, the clock’s ticking growing unbearably loud.\n„Dinner Date” is the character portrait of Julian: by becoming his subconsciousness you gain a clear vantage point on the worries which take a hold of him. As the wait for the beautiful girl grows longer it becomes evident that Julian’s real problems may not even begin originate the girl: what of his work and his boss? And what of the headhunter, his fascination with Byron and his friendship with Jerry who, all things considered, was ultimately the person who pushed Julian to go on this date?\nYou are not merely listening – in the unprecedented role as his subconsciousness you tap the table, look at the clock and, as Julian bares more of his mind, reluctantly start to eat, your actions resonating with Julian’s thoughts to form an absolutely singular form of intimacy.\nIn this manner you will experience „Dinner Date”: with some glasses of wine, some bread, some soup - and with a clock which slowly mocks the constant wait for when she comes, this elusive girl who will solve everything.\nKey features:\nJulian’s story lasts a fully voiced 25 minutes and is told through various unique animations, set in a real-time 3d environment with the unique interface of playing as a subconsciousness, the first of its kind.\nThe game is complimented by an original score, written by Than van Nispen tot Pannerden.\nAt the Independent Game Festival 2011, „Dinner Date” has been nominated for the Nuovo award, an award which ‘honors abstract, shortform, and unconventional game development which advances the medium and the way we think about games.’","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Stout Games","platforms":[{"id":0,"name":"PC"}]},{"id":19028,"name":"Putt-Putt: Pep's Birthday Surprise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdc/bdc4547edf75bfac55e3a72363f0d29a.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameHappy Birthday, Pep!\nIt's Pep's birthday and Putt-Putt® wants to surprise him with his first birthday party ever! Join Putt-Putt® as he travels through Cartown, helping various residents, reaping rewards, and gathering supplies for the party. With new friends to meet and new problems to solve, kids will love helping Putt-Putt® get everything ready in time for the big surprise--a birthday cake, presents, decorations, and friends!\nCartoon-style learning adventures where kids choose where the characters go.\nOver 20 fun locations to explore.\nThe adventure changes each time the game is played.\nKids have so much fun they don't even realize they are learning.\nPutt-Putt's® friendly and polite nature reinforces good social skills and manners.\nEncourages critical thinking, creative problem solving, and teamwork.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":13862,"name":"Desert Law","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/902/902d0c0abc6b795d44785e9869ff168b.jpg","description":"Desert Law is a new spin on the traditional real-time strategy that immerses players into a post-apocalyptic world where gasoline is the new world currency.\nIn Desert Law, player takes on the role of Brad as he begins his quest for vengeance against those who ruined his very existence. After returning to his home village and finding the settlement plundered and destroyed, Brad swears to bring justice to the memory of his slain village. Uniting desolated outcasts, he forges a fighting unit to strike out against bandit gangs, drawing allies under his banner.\nUse your tactical skills to survive in the harsh wasteland as you control a group of heroes with different statistics, drive various vehicles and fight your way through the enemy lines.Features\nPost-apocalyptic settings\nOver 30 missions with multiple objectives ranging from defense, to rescue, to all-out assault\nDetailed isometric visuals combining 2D and 3D graphics\nModified Blitzkrieg engine","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Arise","platforms":[{"id":0,"name":"PC"}]},{"id":13281,"name":"Doom & Destiny","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db9/db9f5482fd7ca09620829d333c07260b.jpeg","description":"Four nerds, drawn into a fantasy world and mistaken for heroes, have to battle their way through a massive, crazy adventure and defeat a preposterous villain!\nDoom and Destiny is a turn based hilarious jrpg where you take control of a party of four everyday friends. Journey through an unpredictable story filled with parodies and cameos. Start your adventure in a classic dungeon with dragons, save princess with the help of green-dressed elf and then fly to manga-themed city with the help of a famous italian plumber. This is Doom and Destiny, the flying-spaghetti fantasy adventure!\nMain Features:\n20 hours of story and 20 hours of extras, adventures, side-quests, and more!\n100 levels of experience and nerdy customization\nChoose your nerdy leader to apply special bonuses to your party\nShare save files between mobiles and Steam\nMore than 200 special powers and spells\nMore than 300 enemies\nMore than 500 items between potions, chips, weapons, shirts, and armor\nMore than 700 locations,\nMore than 10,000 lines of crazy dialog\n44 Steam Achievements\n7 Steam Cards\n5 Steam Backgrounds\n5 Steam Emoticon\nThe one and only Epic Flying Spaghetti Monster!!!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Heartbit Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":9919,"name":"Just Ignore Them","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/590/590b1373247a213400a835315102a80e.jpg","description":"Welcome to the Just Ignore Them Steam Store Page.\nBefore considering purchasing Just Ignore Them, please try our FREE demo and read the rest of this section.\nJust Ignore Them is a point and click adventure horror that is mainly story driven. It contains an alterable story line which the player can control with critical choices. However, the main plot does not change (This is due to a possible sequel). The game is roughly a few hours long (For first time players), but this also depends on some of the choice you make during the game.\nIt's your job to discover the mystery of the invading monsters.\nOne night can feel like a lifetime of pain, suffering and horror to a child...\nThe story starts of a Little boy at the age of 8 who is tormented by monsters that live in his house. He lives with his mother which works from home so she can look after him. You will be taking a glimpse into the future which can be altered by the choices you make, which will alter the game's ending. The story is to resemble some what of a movie script rather than a game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Stranga Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":9819,"name":"Shovel Knight: Specter of Torment","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74f/74fa557d473ce29a1891fb1ff7641d1e.jpg","description":"Disclaimer: If you own Shovel Knight: Treasure Trove, you will NOT need to purchase Shovel Knight: Specter of Torment separately. This title is included with all versions of Shovel Knight: Treasure Trove.\nShovel Knight: Specter of Torment is the action-packed prequel to Shovel Knight! Take control of Specter Knight, servant to the Enchantress, in a quest to recruit a cadre of knights and create the Order of No Quarter. With his scythe and preternatural agility at the ready, he can glide across the ground, clamber up walls, and command an arsenal of curious weapons.\nIf he carries out his duties, Specter Knight may have a chance at regaining his lost humanity and breaking his chains of servitude. But what cruel tricks might the Enchantress have up her sleeve?Features:Climb walls, leap over gaps, and dispatch enemies with the Dash Slash. Specter Knight’s playstyle brings motion and action to the forefront!\nCollect and upgrade curios to unleash all new special attacks.\nTest your scythe skills with Feats and Challenge Stages featuring boss rematches, platforming challenges, and more!\nYacht Club Games' beautifully authentic style bridges the gap between yesterday and today. Design, art, and audio hearken back to the days of 8-bit.\nA somber tale told with a light touch to narrative with humor, levity, and heart.\nAwesome soundtrack by Jake \"Virt\" Kaufman!\nBalanced gameplay is a warm welcome to newcomers, and an old embrace for experts.\nLovable characters and bosses!\nTake on a new challenge and uncover all of the world's secrets with New Game+!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Yacht Club Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":7764,"name":"Scram","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb7/fb706f42f8939ea8e077c30756c8b664.jpeg","description":"you are stuck in a dangerous area with no help, you gotta find the damn radio to call for evacuation and wait until rescue arrives. a small portion of players are mutants and the rest are peasants who turn into mutants if they die.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"spleen","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4074,"name":"Hogs of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/08b/08b3a9c1ec12eb4ef058bf0600d2b906.jpg","description":"(Please note: The game does not work on Windows 8, Windows 10 or on a Mac)\n\nAbout: He who controls the swill controls the universe. It really is that simple.\n\nAn untapped supply of swill has just been discovered on the uninhabited archipelago of Saustralasia deep in the South Pigsific Ocean, and every Hog Nation wants the land as its own. Gone are the days of scratching around for drips of swill. Saustralasia’s 25 regions are drenched in the stuff, and the only way to ensure that no one else gets their filthy trotters on the delicious swill is WAR!\n\nYour task will not be an easy one. To successfully conquer and exploit Saustralasia you will need to seek and destroy the enemy across each and every one of the archipelago’s six islands, from Hogshead all the way down to Arstria. Our resources are limited, you have to maintain a rather small army, but with every victory on the field of battle, your swine will learn more skills and acquire the use of a wider range of weaponry.\n\nThere will be slaughter and butchery. Your job will be to bring victory to your chosen nation, to save your own bacon and make a meal of your enemies. With victory comes great reward. So great in fact that your brave boars will be as happy as pigs in… well, you get the idea.\n\nExplosive 25 level single player campaign and an addictive online multiplayer mode for up to four players.Arm your hogs to the teeth with a choice of 40 different weapons including sniper rifles, bazookas, mines, jet-packs, cluster grenades, and tanks.Fight for one of six different pig armies, each one based on a real nation from the First World War-era: Great Britain, Russia, Germany, Japan, France, or the USA.Customize your squad as you promote your hogs from Grunt to Officer in one of four different classes - Heavy Weapons, Medic, Espionage, or Engineer.Cheeky sense of humor brought to life by the vocal talents of renowned British comedian Rik Mayall.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":3093,"name":"PONCHO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f72/f728b41fafdd6aeb612afa8b6e462683.jpg","description":"A robot, a poncho and a journey of discovery! Make your way through this wonderful world of pixelated parallax platforming to solve the ultimate puzzle: who is Poncho?\nThe world is ruined; humanity has disappeared and all that remains are robots, trying to find a new purpose in existence. But for Poncho, the adventure is just beginning! Explore an open world full of colourful characters, leaping between parallax layers to overcome obstacles and solve puzzles. Can you make it to the Red Tower, meet your Maker and ultimately save humanity?\nA 2D world with 3D thinking! Use brains as well as platforming skill, moving back and forth through Poncho's world as well as left and right to progress.\nDiscover new challenges around every corner: platforms that move when you do, areas that switch from 3D to 2D and back again, shifting walls, seemingly impossible ascents and much more!\nA philosophical and intriguing storyline filled with mystery and a dark twist...\nAn open world adventure, with a multitude of solutions to every area, hidden secrets and multiple endings!\nRandomly generated NPC characters and critters that react to Poncho's presence make the world feel alive!\nSeek out and find new abilities to unlock even more secrets hidden in the world!\nGorgeous pixel graphics mix with clever gameplay and a beautiful soundtrack to create a retro-style experience that's truly unique!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rising Star Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3001,"name":"Twisted Metal: Black","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/00a/00afce20b41eaadf2f06db5991f03e96.jpg","description":"Experience Twisted Metal: Black™ for PS2™ system with 1080p up-rendering and Trophies. Additional enhanced features include Shareplay, Remote Play, Activity Feeds and Second Screen support for game manuals with PS Vita or PS App.\nThey say the mind bends and twists in order to deal with the horrors of life…            …sometimes the mind bends so much it snaps in two.\nThe best-selling car combat game on the PlayStation®2 is now available for PlayStation®4!  In the ultimate contest of wreckage and devastation, Calypso has plucked a motley crew of contestants straight from the lunatic asylum. As the carnage unfolds, so does the horrifying tale behind each of these tortured souls. Slip into their twisted minds and come out screaming for more!\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nThis title has been converted from the original PlayStation®2 version to the PS4™ system. Consequently, there may be times where the title plays differently from the PlayStation®2 version, or where some features may not function properly. This version does not support PlayStation®2 peripherals, therefore some functionality may not be available.\n© 2001 - 2015 Sony Computer Entertainment America LLC. Twisted Metal: Black is a registered trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":872266,"name":"Football Manager 2023","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b0/6b09ec8abc44fb8900e7b639ba02731d.jpg","description":"In Football Manager 2023, it’s not just about picking tactics or crafting a team. It’s about taking on challenges and writing history as you establish your own style.\nDelve into unrivalled depth and detail as you take charge at your club. You’ll join the elite by earning the love of the fans and dominating the competition.\nNew features and licensing updates will arrive late September. Join FMFC for exclusive game news direct to your inbox.\nGame Description\n• Find the right club for you. Meet the owner’s targets and beat the best as you win football’s top prizes.\n• Don’t just sign superstars, create them. Recruit smartly with the help of your scouts and provide pathways to the first team for your wonderkids to develop a world-class squad.\n• Your team’s playing style is down to you. Create a unique strategy on the tactics board to deliver big wins and memorable matchday moments.\n*Early Access versions of the game may go live at different times on different platforms.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sports Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":678558,"name":"Settlement Survival","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9f/c9f6a267a08609d634d62473173e8f0d.jpg","description":"Discord\nAbout the GameLead your people to their new settlement in this survival city-builder. You will need to provide their shelter, guarantee the food supply, protect against threats of nature, and pay attention to well-being, happiness, education, and employment. Do all of this well, and you might even attract residents from foreign cities!\nChoose where to build your settlement based on nearby resources, before determining your perfect layout. How will you build your settlement?\nCarve out the land, join rivers, form lakes and use your tools to shape your settlement exactly how you want it.\nBuild housing, recruit Mayors to determine the morality of your settlement, control crime and ensure your baby-booms don’t negatively impact your resources.\nExperience all seasons and heed the early warning signs of disasters. Bunker down and protect your citizens from the elements as well as environmental disasters, or risk losing all that you’ve built.\nOffering powerful effects, unique themes and styles, rare blueprints are an opportunity to customize your settlement even further when you’ve mastered the art of trading.\nDetermine which development routes you will choose, with options that range from trading, education, mining, construction, agriculture, processing, logistics, and liveability. Each route unlocks new buildings and abilities to boost development. and there is no set pattern to the route selection, so you can choose freely and play to your strengths.\nWith each map randomly generated, right down to its resources and landmarks, every experience is unique and brings with it its own challenges.\nWhether exchanging artistic items of high value, unprocessed products or unlocking the mint to create a common currency, trade is key to your populations survival.\nExperience a unique game mode designed to challenge even the most experienced player. From the bubonic plague in Europe, to the Easter Island disaster, are you able to overcome its challenges?","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"X.D. Network","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":607397,"name":"Summer of '58","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff2/ff2d19c493876ced161e233ecf47d136.jpg","description":"You can also check out my gameshttps://store.steampowered.com/app/1504740/Find_Yourself/\nhttps://store.steampowered.com/app/1258590/Locked_Up/\nhttps://store.steampowered.com/app/1425990/From_Day_To_Day/\nAbout the Game«Did you see him?»\nWARNING: Epileptic seizures associated with increased sensitivity to light are Possible.  Some people may experience seizures when exposed to flashes of light and flashing images that appear in a video game. People who have not previously experienced such attacks may not be aware of their illness. A reasonable restriction of the game audience is recommended.\n\"Summer of' 58 \" is a first – person psychological thriller. The game takes place in an abandoned building of a Soviet camp.\nPioneer camp \"Yunost\" is a common place where parents left their children for the summer from year to year. Until one day in 1958, a nightmare happened that was much scarier than the stories around the campfire. Residents and counselors were killed at this place. One of the children was accused, as his body was not found, and souvenirs of the deceased were found in his belongings, but he disappeared. The camp was closed and no one opened its doors again.\nAlex Morton is a video blogger who makes revealing videos about paranormal phenomena around the world.\nSummer 2008. The main character, at the request of followers, goes to Russia to explore the abandoned camp \"Yunost\". Locals say that this place is inhabited by restless souls. This will need to be checked.\nEnvironment.- Genre: \"Walking Simulator»;\n- You will walk from one room to another, noticing the changes;\n- Find out what happened that day, in the summer of 1958;\n- Solve the mystery of the mystical phenomena that are rumored;\n- Explore the pioneer camp slowly, listening to the rustles;\n- Find hidden objects to immerse yourself in the atmosphere of those days;\n- You will be accompanied by the natural sounds of the environment, which convey the effect of presence and plunge into madness.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"EMIKA_GAMES","platforms":[{"id":0,"name":"PC"}]},{"id":485219,"name":"Unknown 9: Awakening","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f1a/f1aa0e2ce14294b842ac90e63078bc01.jpg","description":"Raised on the streets of Kolkata India and haunted by visions of her own death, Haroona struggles to understand her mysterious innate abilities to manipulate the unseen. A mentor soon helps Haroona hone her gifts, teaches her to access the mysterious hidden dimension known as The Fold and propels her on a journey to unlock the mysteries of this new realm","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Reflector Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":481905,"name":"Bear and Breakfast","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/208/20820a89be9b199628c0b50dabc0faad.jpg","description":"Bear and Breakfast is a laid-back management adventure game where you play as a well-meaning bear trying to run a B+B in the woods. Hank and his friends find an abandoned shack and, equipped with their teenage ingenuity, turn it into a money-making bed and breakfast scheme for unsuspecting tourists. As your business expands so do the mysteries of the forest, and Hank soon finds himself uncovering a plot deeper than the wilderness itself.\n\nDeeply customize your inn with dozens of guest rooms, bathrooms, parlors, and entertainment. \nEach room can be individually customized completely from furniture to fixtures.\nBring guests into the forest to stay at your inn. Keep guests happy to maintain your reputation, earn tips, and attract new customers!\nComplete objects and storylines to collect new additions and perks for your inn.\nUncover a world rich in lore, side quests, characters, and secrets.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Gummy Cat","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":449165,"name":"The Dungeon Of Naheulbeuk: The Amulet Of Chaos","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48f/48f36cc7375360aa341c4e9f55955844.jpg","description":"Are you ready to dive into a tactical RPG chock-full of charm, humor and crazy characters?!\n\nThey are clumsy, inexperienced and feisty but...they’ll have to endure each other’s company to get the dungeon’s treasure.\n\nHowever, a feeling of déjà-vu quickly arises...\n\nGuide this team of unlikely heroes in an adventure full of humor and chaos!\n\nThe Naheulbeuk universe is an original creation by French author John Lang. It started as a very popular audio comedy series parodying role-playing games and heroic fantasy tropes. Now the story is available in English and as a video game for the first time!\n\nPlay with seven classic role-playing game characters complementing each other’s skills as you level them up: the Ranger, the Elf, the Dwarf, the Magician, the Ogre and the Thief!\n\nEvery member of the team has their own skill tree to upgrade their abilities and equipment.\n\nChoose one of three additional companions to join the team on their adventure!\n\nExciting turn-based battles, with creative support mechanics between team members.\n\nAn adaptive difficulty system: from an accessible and fun story mode with simplified combat to the “nightmare mode” where the smallest tactical errors will doom you!\n\nAn expansive bestiary (more than 100 enemies!) pushing you to think more tactically with every fight.\n\nEpic boss battles where you’ll have to muster both strength and smarts to emerge victorious!\n\nHidden and destructive objects (including beer kegs) with surprising status effects will turn the tide of battle for the better...or worse!\n\nExplore a huge and surprising dungeon from the cave up to the luxury quarters of the evil lord Zangdar, passing through the goblin iceskating park and even an extremely lively tavern!\n\nEscape traps and solve deadly puzzles to unlock the most impressive treasures!\n\nBizarre conversations, absurd situations and unusual encounters await!\n\nExperience an exciting main storyline and many side quests for your heroes","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dear Villagers","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":306034,"name":"Crumble","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f24/f24ac818a2ee536374c39e08920d8564.jpg","description":"Crumble is an upcoming physic platformer with addictive and fun gameplay.\nThe world is crumbling, try to progress in every unique levels falling around you.\nUse your jump and tight movement  to stay on top, use your tongue to recover.\nFeatures:\nA campaign mode with an increasingly crumbling world\nA multiplayer party mode up to 4 local players\nUnlock new skins\nOnline leader boards\nVery addictive gameplay with high dynamic physics\nThe demo is coming shortly :)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"anstabo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Web"},{"id":0,"name":"Linux"}]},{"id":216268,"name":"Enderal: Forgotten Stories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/acb/acb888502dc7b0821269199d3fc7e45e.jpg","description":"Enderal: Forgotten Stories is a total conversion for TES V: Skyrim: a game modification that is set in its own world with its own landscape, lore and story. It offers an immersive open world, all for the player to explore, overhauled skill systems and gameplay mechanics and a dark, psychological storyline with believable characters.\r\n\r\nEnderal is free and can be played by anyone owning a legal copy of TES V: Skyrim. (No DLCs are necessary.) It is developed non-commercially by SureAI, the team behind the renowned Oblivion mod \"Nehrim: At Fate´s Edge\" (and various other projects).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SureAI","platforms":[{"id":0,"name":"PC"}]},{"id":46747,"name":"Guns'n'Stories: Preface VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/45f/45ffcc4bf9885fce19090c5418447dcc.jpg","description":"Put on a VR device, grab a gun, and hang on to your pantaloons for one heck of a wild n' crazy story heading your way! Dive into your grandfather's memories, who once was an infamous bounty hunter! Relive his glory days full of adventures, but truth be told, he tends to go overboard! The longer you listen to him, the stranger those events become to look like. Suddenly you'll be surrounded by large armies of unbelievable enemies! Dark humor, steampunk and cowboys – this is the world of GUNS`N`STORIES.\nFeatures:\n- Be prepared for drastic changes of events. The plot unfolds so rapidly that you can fail at any time!\n- Win battles against extremely deft opponents, put together intricate memories to form the complete picture of those days.\n- Sintown is full of dangers, and only your courage coupled with a powerful weapon will allow you to survive!\n- Keep practicing with your firearms in order to become the best gunslinger in town. Check out your results to see how good you are.\n- HTC Vive, Oculus Rift compatible","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"MIROWIN","platforms":[{"id":0,"name":"PC"}]},{"id":45662,"name":"SENRAN KAGURA Peach Beach Splash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/847/847bd6e348de83f9e7df83ff0e06105c.jpg","description":"The summer of bouncy, high-flying hijinks continues for the girls of SENRAN KAGURA! They've fought rival ninja, evil masterminds, and apocalyptic demons from beyond the veil of sanity, but nothing—NOTHING in their lives has ever prepared them for...a water gun fight?!\nSummoned to a mysterious tournament by its shady organizers, the buxom shinobi students team up and face off, using all kinds of water weapons to soak and splash their opponents. As they rise through the tournament brackets, they'll uncover the secrets behind the organization － secrets that hide an ever-growing threat to... Wait, what? Sorry, I was watching all the splashing.\nChoose a team of five from the more than 30 girls available, outfit them with customizable weapons and abilities, lead them through lighthearted water gun battles across five single-player storylines, or join your friends online and take on opposing teams worldwide. Come on in; the water's great!\nThe \"Sexy Soaker\" edition includes the Soaking Wet High School Uniform costume, a set of colorful bikini costumes, the Futomaki Roll Bazooka special weapon, a Bebeby pet card, and a special set of skill cards, along with a downloadable soundtrack containing 47 music tracks.\nKEY FEATURES Water, Water Everywhere\nWater powers not only the girls' 10 types of water weapons, but their state-of-the-art hydro-jetpacks, which are used to fly and slide around each large arena at will.\nSplash Across the Seven Seas\nGo online, with players in your region or worldwide, for 5-on-5 team battles and survival matches. Climb the rankings and prove you're the top shinobi.\nStack the Deck Your Way\nWith over 800 attribute cards available, providing improved weapons, unique skills, and summonable pets, players can equip any combination of 6 skill cards and 3 pet cards per match for a combo their opponents will never see coming.\nBecome Bosom Buddies\nThe dressing room returns with all-new methods of interaction (including squirt guns, of course). Customize each character’s outfit, but be forewarned that it may not be fully intact (or opaque!) by the time the match ends.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"XSEED Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]}]