[{"id":14065,"name":"Hegemony Rome: The Rise of Caesar","genre":"RPG","price":0.0,"description":"Hegemony Rome: The Rise of Caesar takes you to the plains and forests of ancient Gaul where Julius Caesar wages a decade long war to subjugate the barbarian hordes.\nHegemony Rome will immerse you in the history like no other real time strategy game ever before, forcing you to pay close attention to the changing seasons and rapidly changing military situation. Unfolding across an epic satellite-accurate map stretching from the Mediterranean coast to the British Isles, the game utilizes the Hegemony series' trademark zoom to seamlessly take you from a grand strategic view of your empire right down to the battlefield at any time.\nHegemony Rome: The Rise of Caesar brings the past to life as you manage your armies and manipulate your enemies in a beautifully drawn simulation of 1st century BC warfare. Bring all of Gaul under the rule of the Senate and People of Rome. Or, unite the Gallic tribes in the expanded sandbox mode and end the threat of Roman rule forever.\nDirect from the hand of Caesar – Four campaigns follow the conquests of Julius Caesar as he wrote them in Commentarii de Bello Gallico. Bridge the Rhine, invade Britannia and conquer the Gauls in over 100 objectives or choose from over 20 factions in the epic sandbox mode. All new map – Explore over one million square kilometers that are seamlessly zoomable, from the Mediterranean coast to the shores of Britannia. Improved graphics engine – Hegemony Rome supports 10x the terrain detail over previous installments and features a diverse and immersive landscape to explore. Build an empire – The construction system allows players to build forts, walls, and bridges at thousands of sites across the map to cement Roman control over the barbarian kingdoms. Promote your legions – Players can train officers to augment their unit’s skills as well as appoint governors and construct buildings to expand and improve their cities. Starve your enemies – Supply camps and logistics system makes sieges and supply lines more intuitive and more important than ever.","imageUrl":"https://media.rawg.io/media/screenshots/6d0/6d067616272b2c83597c59845a77d3c4.jpg","releaseYear":2014,"developer":"Longbow Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13154,"name":"Gravity Cat","genre":"Casual","price":0.0,"description":"Gravity Cat - it's a puzzle-platformer. You play as a cat who has an ability to change the gravity. Turn off the lasers and avoid saws. Go through the levels from the simplest to incredibly difficult.\n\n2 Game Modes:\nThe first mode - you're able to change the gravity only after touching the surface;\nThe second mode - you're always able to change the gravity.\n\n▪ 70+ levels\n▪ 2 game modes\n▪ EASY to learn, HARD to master\n▪ Cat!\n▪ Will add new levels in updates\n▪ Steam Traiding Cards\n▪ Achievements\n▪ Сontroller support","imageUrl":"https://media.rawg.io/media/screenshots/3e2/3e27ad2e273e0ee01f8e420ffd39b5d4.jpg","releaseYear":2016,"developer":"Quiet River","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12855,"name":"Chester One","genre":"Action","price":0.0,"description":"Key Features8 Gameplay Changing Styles to switch up the look of the entire world around you\nOver 200 Achievements to, umm, achieve!\n10+ Playable Characters with special attacks to level up\n40 Levels across 7 Planets to explore\nAn amazing original soundtrack with 20+ tracks by Reina Lamour\nSimple element system adds depth to platforming combat\nUnlock nearly 100 Bestiary pages to learn about the weird world of Chester\nSteam Trading Cards and Cloud SavesDo you have what it takes to save the world you ruined?\nYou'll have to think fast and move even faster if you hope to save this world!\nAfter an ill-advised prank by Chester, The Bad Guy has been pushed over the edge and driven on an absolute rampage. Buildings have been burned, realities shattered, and most importantly of all: CUPCAKES STOLEN.\nIt's not going to be easy putting this world back together, but for some unknown reason only Chester can do it!  Get ready to fight through over 40 levels finding cupcakes, killing baddies, and collecting stamps to spend on the many unlockables of CHESTER!Now with over 200 Achievements!Over 200 Achievements broken up into multiple categories ranging from standard progression and collect-o-thon achievements to adding extreme challenge, completely unnecessary stat tracking of everything, and more!\nAchievements are still in an early stage and while all achievements are functional many still need their unique icons.  These are being updated with every patch.Control the style of the world!8 game changing styles to unlock!\nAs you progress through Chester you'll unlock new Styles that you can use to change the look of the entire world around you.  Each style changes gameplay up in unique ways.That's a lotta characters! Over 10 unique characters to unlock!\nYou won't just be unlocking new Styles as you play, but completely new Chesters to play as as well!  With The Bad Guy destroying realities like he did, Chesters from other universes can help Chester out on his quest.  Unlockable Chesters range from classy gentlement, to tanks, and spaceships, and weird slug things.Featuring an amazing 20+ Song soundtrack by ReinaLamour\nOver 20 original songs that capture the fun quirkiness of classic video game music with a modern vibe that will keep you grooving through all 40 levels.Rock Paper Scissors style elemental system!Every Chester and enemy you encounter is either a FIRE, WATER, or GRASS elemental, forcing you to react quickly to make sure you’re using the right Chester for the job.Learn about the weird world of Chester! Every Chester, enemy, style, and item in the game has an unlockable Bestiary page that gives you a small glimpse into the world of Chester.What's new in Chester One?Chester One is an enhanced version of the original game, featuring Steam integration (Trading Cards, Achievements, Cloud Saves), enhanced graphical features, improved keyboard controls, rebalanced gameplay and more.\nThe game is also seeing regular free updates that are transforming it into a complete remaster of the original.","imageUrl":"https://media.rawg.io/media/screenshots/4f6/4f69089df5a2c4e46fe60a993c862733.jpg","releaseYear":2017,"developer":"Brilliant Blue-G","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":966118,"name":"SYNCED","genre":"Action","price":0.0,"description":"Follow Now\nAbout the GameSYNCED is a futuristic free-to-play co-op shooter developed by NExT Studios and published by Level Infinite. In a world overrun by Nanos—rogue technology that has brought civilization to its knees—you will take on the role of a Runner, deploy with your squad or fight alone with your tamed Nano. Venture into the collapsed world for intense PvE and PvP combat and uncover the secrets buried deep inside the Meridian.Weaponize Your Enemies\"Sync\" the Nanos you defeat to control companion classes with different abilities: Crusher, Guardian, Seer, and Suppressor. Unleash your enemy-turned-ally companion on the battlefield to even the odds. Evolve your battle tactics over time with companion Nanos with customizable mods.Synergize Your AbilitiesGear up as part of a 3-person team, utilizing squad tactics to out-maneuver the enemy and claim victory.\nSelect the optimal Runner, Nano, and build to complement your squad. Formulate your team's real-time battlefield strategy by choosing from various weapons and loadouts.Strategize Every RunEach match plays out as a fresh run on non-linear battlefields. Take down Tyrant Nanos in progressively challenging PvE Dead Sectors. Pit your skills against rival Runners in high-octane PvP matches. Mod your Runner, weapons, and even your Companion Nanos in Each run to turn the tide of battle in your favor..","imageUrl":"https://media.rawg.io/media/screenshots/d1e/d1e9ee21e19c667da2019c5c4cb7142a.jpg","releaseYear":2023,"developer":"NEXT Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":854381,"name":"Rogue: Genesia","genre":"Action","price":0.0,"description":"Walk upon a new world and slay foes endangering it.\nFend against vast enemy forces, reaching hundreds of foes on screen at any given timeIn this action rogue-lite, you play as Rog.\nMaster of all weapons, Rog can use anything to slay his numerous foes.\nKill, grow stronger, and kill some more!\nMake your build from more than 60+ passive upgrades and 16 weapons.\nYou define Rog's adventureYou can choose which path Rog takes, feel brave enough to take on a powerful foe, or would you prefer to rest at the shop? The choice is yours!\n30+ Powerful Items to discoverOn this journey, you'll collect many unique and powerful artefacts that will greatly impact your game experience, harness their power to help you on your quest!","imageUrl":"https://media.rawg.io/media/screenshots/6be/6be1ed1dd963071251da5fec19f88196.jpg","releaseYear":2022,"developer":"Huard Ouadi","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":816325,"name":"Lost Eidolons","genre":"RPG","price":0.0,"description":"Lost Eidolons is a turn-based tactical RPG with a gripping cinematic narrative, set in a waning empire riven by civil war. Take on the role of a charming mercenary captain, Eden, and lead his band of allies through epic encounters on a classic turn-based battlefield.","imageUrl":"https://media.rawg.io/media/screenshots/a3b/a3b3175652ee257f20908664424ec37d.jpg","releaseYear":2022,"developer":"Ocean Drive Studio","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":799276,"name":"Spacelines from the Far Out","genre":"Action","price":0.0,"description":"CAN'T WAIT TO PLAY? THEN CHECK OUT:https://store.steampowered.com/app/1588400/Spacelines_from_the_Far_Out_Flight_School\nAbout the GameCO-OP RETRO-FUTURISTIC SPACE AIRLINES\nSpacelines from the Far Out is a ‘roguelike-like’ co-op management game about airlines in space, featuring unlockable spaceships, upgrades, characters and customizations, randomly-generated challenges, trips and itineraries, with a generous serving of 60s space-age flair and jazz!A PROCEDURALLY-GENERATED SPACE TRIP\nNever fly the same trip twice with our mighty Trip Generator, a system that constructs fresh compaigns with unique sets of routes, destinations, space hazards, ship emergencies and passenger events.\nAlongside it, our game-balancing system Game Director AI monitors players' progress and performance through trips and dynamically controls game events in real time, allowing for a seamless transition from single to multiplayer!A COSMIC HANDFUL OF NEEDY PASSENGERS\nEach of your passengers are independent AI entities with their own needs and behaviors, dynamically responding to their environment and players' actions.\nBe advised: if they don't approve of your service, you may get a visit from the dreaded Inspector, who will look for health and safety violations and shut your spaceline down!BUILD THE PERFECT STARLINER\nFrom helm to engines, each of your ship's 15 different systems can be upgraded to create the perfect space ride.\nWith tons of unlockable ships, you will be able to expand and create your own luxury star fleet!YOUR VERY OWN CUSTOMIZED SPACELINE\nBy successfully completing flights, you will find lost parcels containing tons of unlockables for your company: from spaceline customizations such as logos and color schemes, to skins for your ships and new species of playable characters!","imageUrl":"https://media.rawg.io/media/screenshots/166/166e17d403f74bd4494ae4dcb289ad2c.jpg","releaseYear":2022,"developer":"Coffeenauts","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":650664,"name":"Aeterna Noctis","genre":"Action","price":0.0,"description":"Aeterna Noctis is a challenging 2D Metroidvania drawn by hand, with intense combat and skill-based platform sections. Taking the role of the 'King of Darkness' you must help him regain his power across 16 different and connected areas in an epic journey with environmental storytelling.","imageUrl":"https://media.rawg.io/media/games/d86/d86c523f20560ca06dd2c86f7ac34571.jpg","releaseYear":2021,"developer":"Aeternum Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":611683,"name":"Overboard! (2021)","genre":"Adventure","price":0.0,"description":"JULY, 1935. A MURDER HAS BEEN COMMITTED aboard the SS Hook, eight hours out from New York.\nOnly one problem: you did it.\nCan you get away with murder?\nGAMEPLAY\nOverboard! is a tense, highly replayable detective game from the creators of 80 Days and Heaven's Vault.\nBlackmail a spy. Fall in love. Murder a rival. Cheat at cards.  Drug a witness. Lie, befriend, betray, console, sneak, seduce, steal, borrow, pray, eavesdrop, kill...\nThere are clues, evidence, suspects, accusations, secrets and lies.\nYou’ll need all your cunning, coercion and charisma to ensure that someone else takes the fall.\nDYNAMIC NARRATIVE CLOCKWORK\n* Next-gen visual novel: go where you want, when you want, and say what you want\n* Simulated story-world: other characters move and act independently, remember everything they see and hear, and everything you do\n* Every minute counts: you have eight hours to escape justice. Time is always ticking\n* Who can you trust? Some characters are friendly, and some are out to get you. Who will you befriend? And who will you betray?\nBuilt using the award-winning ink narrative engine, Overboard!'s narrative twists itself around every choice you make.\nPlay once for a thrill, or multiple times to uncover all the secrets and achieve an ideal ending.\nOne play-through lasts about 30 - 45 minutes, but achieving the perfect crime run will take a lot longer.\nCan you get away with murder?","imageUrl":"https://media.rawg.io/media/screenshots/f0e/f0e162179589342f4ea5a239b8841d77.jpg","releaseYear":2021,"developer":"inkle","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":557729,"name":"Mosaique Neko Waifus 4","genre":"RPG","price":0.0,"description":"You had a long day, you deserve to relax.\nMeet the girls once more! Engage in exciting scenarios.\nand promise not to tell anyone\nClick, relax, level up, collect items.\nAll the fun stuff you already know and love\n• 4 Girls to flirt with\n• 18 Puzzles\n• Strategize with ability builds\n• Collect different items for each dialogue selection\n• Enjoy the in-game gallery\n• 100 Achievements","imageUrl":"https://media.rawg.io/media/screenshots/fdb/fdbe2b3f4b670900c342c86f07427b8d.jpg","releaseYear":2021,"developer":"Lil Hentai Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":510097,"name":"Destination: Arcade","genre":"Desconocido","price":0.0,"description":"This application is for recommending games to friends, finding cool games in a fun and intuitive way and to celebrate the awesomeness that is Xbox LIVE Arcade.","imageUrl":"null","releaseYear":-1,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":484498,"name":"Just Dance 2021","genre":"Casual","price":0.0,"description":"Just Dance 2021 is the ultimate dance game, with 40 hot new tracks from chart-topping hits like \"Don't Start Now\" by Dua Lipa, \"Feel Special\" by TWICE, \"Señorita\" by Shawn Mendes & Camila Cabello and more! Start a dance party your friends and family can enjoy. One month FREE of Just Dance Unlimited included. This subscription streaming service lets you dance to over 550 songs!\nPlay with friends and share the fun with co-op mode. Work together to get the highest score!\nDance the way you like by creating your own personalized custom playlists.\nEnjoy eight new kid-friendly songs and choreographies for a family-fun experience.\nUse your smartphone to track moves with the Just Dance Controller app – no additional accessories required! Up to six players can join.","imageUrl":"https://media.rawg.io/media/games/af8/af87cbd6b81e5b9fa42aaa488dfd6efc.jpg","releaseYear":2020,"developer":"Ubisoft","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":428916,"name":"Train Station Renovation - First Job","genre":"Strategy","price":0.0,"description":"Train Station Renovation - First Job is a prologue to the full version of the game.https://store.steampowered.com/app/914010/Train_Station_Renovation/Welcome to an old, ruined train station. A place that will give you a lot of fun!\nIn Train Station Renovation you play as a renovation company specialised in restoring railway stations. The game is set in abandoned and destroyed train stations, you will start with small rural ones to ease in and eventually be challenged with sprawling train stations in metropolitan areas. The game is divided into 10 maps (stations) which gradually teach you new mechanics and help you manage different working environments. Each station needs to be cleaned, fixed and decorated with items and equipment to bring it back to life.\nChoose how hard you want to work.\nThe level of difficulty depends on the player's commitment. The game can be very demanding if you decide to complete each stage one hundred percent but it also can be perfect for beginners if you just want to relax while renovating and simply have a good time. In such a case, you only need to complete half the planned tasks to advance to the next stage.\nQuick and easy access to equipment is the key to success.\nThere are many tools and options for repairing and decorating the station. Work with basic items such as paint rollers, spray cans, crowbars and repair wrenches or use your in-game tablet to order new materials and items. Some stations will even allow you to repair and renovate the old trains. This means you will be able to take care of the technical condition of those vehicles yourself.\n\nSpecializations development tree\nAn aesthetic development character tree t is available. You will speed up your work time at individual stages and elements of the game by upgrading your skills. You will also get new equipment or unlock new options while renovating. If you happen to enjoy some renovation activities more than others, you will be able to upgrade them during your playthrough.\n\nRenovate and decorate train stations and trains.\nDetailed and complex 3D models of railway stations allow you to renovate them - from cleaning, painting and  to replacing decorations and mechanical elements.\n\n\nThe economy is very important\nA complex economy aspect has been added to the game to increase realism. In addition to money needed to buy new items and repair materials, you can also benefit by segregating waste or completing additional tasks.\n\nBuild your own station.\nThanks to the station decoration system, you will be able to create the internal and external appearance of various facilities yourself. You can add benches, vending machines, kiosks, and other items as needed, and place them wherever you want. Thanks to this function, you will quickly turn a dump into a great looking ready for business train station.\n\nThe possibility of expanding the game.\nThe game will be supported after launch, with patches and new official content released addressing needs that the community puts forward. The game will be open for user submitted mods.","imageUrl":"https://media.rawg.io/media/screenshots/a52/a52e442658b193d8e205135b3055f6bf.jpg","releaseYear":-1,"developer":"Live Motion Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":312682,"name":"Nether: The Untold Chapter","genre":"Action","price":0.0,"description":"Welcome to Nether: The Untold Chapter:\nNether: The Untold Chapter reveals a story that picks up where Nether left off. The ravaged cityscape inspired by a post-apocalyptic Chicago is still haunted by creatures called “Nethers” and fresh reports claim that years of mutations have resulted in new forms of life in the city. One of the most unique survival experiences has been given a new look, optimizations, content, new monsters, bug fixes and a powerful anti-cheat to ensure a fun and fair game-experience.Key FeaturesDiscover an open world featuring a massive city landscape with open high-rise buildings and unforgiving outskirts.\nScavenge and fight your way to survival. Build up your inventory, complete objectives to earn XP and level up your character’s abilities, craft and search the city for a wide selection of weapons and gear.\nPlay alone or group up with others to survive. Join a tribe and fight against others over territories in the map. Complete missions individually or for your tribe to earn experience, money and reputations. Experience a fast-paced PvP with a wide variety of weapons to choose from.\nFight a variety of creatures and scavenge their unique drops to trade and craft for items, money and experience. Defeat the powerful Reaper boss in its raids and learn how to best fight each unique Nether.\nPlay on official servers, or host your own with up to 64 players to tailor the game experience to your needs.\nFredaikis Anti-Cheat (FAC) is a new, innovative anti-cheat that ensures a fair game-experience for everyone.","imageUrl":"https://media.rawg.io/media/games/704/704c80641292c7f4d3c77c6be965b9c8.jpg","releaseYear":2019,"developer":"Fredaikis","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":249983,"name":"HALF DEAD 2","genre":"Action","price":0.0,"description":"THE LORE\nYou are one of the most bloodthirsty criminals in the galaxy. The number of your victims is almost more than people hanged for the betrayal of the Empire. They caught you, and it seems that you definitely will face death penalty. But the corrupt galactic system gives you a second chance. The Emperor, for his personal pleasure, starts hosting galactic games of survival among the most bloodthirsty killers, and the people who are even worse: democratic rebels.\n\nFor that purpose, they built up a huge network of rooms filled with deadly traps.\n\nA manic smile appears on your face, because you know that the most deadly thing in the universe is you. Take part in the HALF DEAD 2 and show what you're capable of!KEY FEATURES\nFuturistic network of rooms\nA bunch of deadly traps in each room\nWeapons to kill each other and protective equipment\nUp to 16 players playing with you on the same map\nCharacter customization\nMultiple floors","imageUrl":"https://media.rawg.io/media/screenshots/08c/08ca40006d354b3f7c46b4162bb2738c.jpg","releaseYear":-1,"developer":"Room710Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":63214,"name":"Please Love My Computer Game","genre":"Adventure","price":0.0,"description":"You finally left home on August 9th, 2017. You hated that place, you hated how it made you feel... And yet you closed yourself off in that unfortunate abode. Leaving was the only rational choice, but maybe it wasn't the best one. Even once you leave, scars don't simply disappear. They say time heals all wounds, but the extent of how much that can heal may be limited. Especially when it keeps being picked and torn at, when you're expected to do something, something you hate. But it lingers over you, tortures you.\nI hope you love this game, I mean that sincerely. Would you please love this computer game? In the game you explore a black and white house; you can just wander, and indeed may wander for some time without really knowing what to do. But I promise you that there is depth and hidden layers here. Sometimes we want to be loved, but not want to be seen. But how can one expect to truly be loved if one also won't share oneself? Loving anything else but the true person is like loving an apparition, it's just an image of a being rather than the being themselves.\nIt's a sort of cryptic house exploration game about discovery, road blocks, atmosphere, love, and creation. There are things to interact with, non-linear progression, and various tough obstacles. The game may close at times, but that's not the end. It's all pretty ambiguous and not really made to be played with a single person trying to figure out what to do, more with a group or a community. I give this heed as there's a very high chance you make get stuck in a rut without much of a clue how to get further. This is natural, the game is quite cryptic and there's layers of discovery of how to make progress.\nTo understand the depths of love is to understand the depths of being. This game includes puzzles and atmospheric elements. In many ways it's a game that can be solved, but doesn't want to be. You could consider that a puzzle game, but it's not really about the puzzles. They're more like a defense mechanism, a shell to break through. It only takes one person to change one's life, but for better insight we often need a viewpoint outside the ourselves that two people create. I doubt any one person will be able to beat this game alone, it might take some conjuncture and cooperation. But that maybe shouldn't be surprising... How can one truly understand love if one doesn't let others in? Different people and experiences help us understand different things, and it's in that fragile act of sharing that we can open ourselves to new discoveries.\nThe game is cryptic and creepy, but can you still love it? Can you explore the depths and still see its good qualities? Can you even find the depths? I guess in a word this game is about discovery. If you like to discover things, then you may like this game. There's a lot to discover, and a lot of it isn't obvious. But despite not being easy or simple, I hope you will still come to love this computer game. Through all of it's roughness and unfriendly design, you can love the tender core.\nFor if you can love it, then maybe....","imageUrl":"https://media.rawg.io/media/screenshots/0f1/0f18677699c18607db5bc3aa6532d649.jpg","releaseYear":2018,"developer":"Yai Gameworks","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":62932,"name":"Among Trees","genre":"Adventure","price":0.0,"description":"A vibrant first-person survival adventure, Among Trees is set in a colorful wilderness world teeming with life.\nKey Features:\nThis is your little wood cabin. Located in the heart of a lush forest, the cabin is expandable: build new rooms and unlock additional game mechanics, including food cooking, plant growing, and tool crafting.\nExplore a colorful, breathing world that is filled to the brim with life. From dense forests to dark caves.\nStay safe as you explore. Do what you need to do: scavenging for food, catching fish, and chopping down trees.\nStay stealthy so that you can avoid the wild, deadly beasts that roam the forest. Stay warm during ice cold blizzards  – and who knows what other dangers the night brings.","imageUrl":"https://media.rawg.io/media/games/1e0/1e015a2fa31b5a16aa90d90a7ab262fd.jpg","releaseYear":2021,"developer":"FJRD Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61133,"name":"Hentai Shooter 3D","genre":"Action","price":0.0,"description":"\"Hentai Shooter 3D\" - First person shooter with spirit of good old days. One day our hero Seranul, hear the doorbell in his appartment, he open the door, but find nothing, except the strange portal. What leads him to some bizarre world. Only beautiful girls live here, which don't like men with strange names. And the only weapon what can be found here is a cucumber and two tomatoes... Help Seranul return home alive.  Game features:\n• Retro graphics.\n• Original idea.\n• Girls in swimsuits, who want to kill you.\n• Weapon Upgrade System. Start the game with one cucumber, and then upgrade it with tomatoes to a high-speed tomato machine gun\n• The game contains no word, only action.","imageUrl":"https://media.rawg.io/media/screenshots/b2b/b2b332c39b3b3a37fa0ad43f1fc5bc42.jpg","releaseYear":2018,"developer":"КиКо","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":57269,"name":"X-Men","genre":"Action","price":0.0,"description":"X-Men is a home console video game produced by Sega in 1993, based on the adventures of the Marvel Comics superhero team, the X-Men. One or two players can play as any of four pre-chosen X-Men. X-Men is a Mega Drive/Genesis-exclusive game and in 1995 was followed up by X-Men 2: Clone Wars.","imageUrl":"https://media.rawg.io/media/screenshots/dae/dae7db129bb1e86f8a1a38cf5362805d.jpg","releaseYear":1993,"developer":"Western Technologies","libraryGames":null,"platforms":[{"id":0,"name":"Genesis"}]},{"id":53943,"name":"Mega Man 5 (1992)","genre":"Action","price":0.0,"description":"Mega Man 5, known as Rockman 5: Blues no Wana!? (ロックマン5 ブルースの罠!?, lit. \"Rockman 5: Blues's Trap!?\") in Japan, is an action-platform video game developed by Capcom for the Nintendo Entertainment System. It is the fifth game in the original Mega Man series and was released in Japan on December 4, 1992. It saw a release during the same month in North America and in 1993 in Europe.\nTaking place after the events of Mega Man 4, Mega Man's brother and ally Proto Man uncharacteristically leads a group of menacing robots in attacks on the world and kidnaps his own creator Dr. Light, leaving the title character little choice but to take up arms in a fight against his once trusted sibling. Mega Man 5 carries over the same graphical style and action-platforming gameplay as the four preceding chapters in the series. The game introduces a new character, Beat, a robotic bird that the player can use as a weapon once a series of eight collectible letters are found. Artist Keiji Inafune had to re-illustrate the bosses several times but described his work as fun.\nMega Man 5 was met with a positive critical reception for its graphics and music, while receiving criticism for its lack of innovation in its plot or gameplay. Like other NES games in the series, Mega Man 5 has been re-released in Japan on the PlayStation, PlayStation Network, and mobile phones; in North America as part of the Mega Man Anniversary Collection; and in both regions on the Wii Virtual Console. It has also been released in North America, Europe, and Japan on the 3DS and Wii U Virtual Console.","imageUrl":"https://media.rawg.io/media/screenshots/b1f/b1f18a6a20af35101d5d34c06f7de67f.jpg","releaseYear":1992,"developer":"Capcom","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation"},{"id":0,"name":"NES"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo 3DS"}]},{"id":51860,"name":"Aeve:Zero Gravity","genre":"Action","price":0.0,"description":"\"Aeve:Zero Gravity\" is an arcade space shooter about battles in open space. In a classic mode \"Shoot'em'all\". You are piloting an elite fighter equipped with a special \"goodness\", such as a non-stop gun that unrestrainedly releases blaster fire for all 360 degrees. Hot shootings at high speeds with impenetrable bosses, also armed with smart weapons of destruction will make a good challenge for hunters for a high reward.\n* Hordes of armored spaceships.\n* Hundreds of shells dancing in a single fire mash.\n* And only one against them all .You.","imageUrl":"https://media.rawg.io/media/screenshots/c04/c049f4916ac98256b17389826458d232.jpg","releaseYear":-1,"developer":"EasyGames","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":51395,"name":"Dead Ground","genre":"Action","price":0.0,"description":"Tower defense reimagined! Dead Ground is a procedurally generated tower defense game with rogue-like elements. Each playthrough will offer randomly generated guns, skills and augments. You'll have to travel, collect scrap, water, manage your inventory and upgrade your base to survive!\nPlace and upgrade the towers wisely, and use your hero to further defend it in this fast-paced game, a perfect blend of action and strategy. You will face permadeath, lots of brutal enemies, tough boss fights and MUCH, MUCH MORE!\nProcedurally generated levels - each playthrough is unique!\nTons of randomized loot - guns, skills, augments\nManage and upgrade your base\nBoss fights!\nRandom events\nUnlock new heroes and artifacts to further customize the game\nPermadeath!","imageUrl":"https://media.rawg.io/media/screenshots/1d4/1d4b6f8517559ddc5c53ee394d9787cb.jpg","releaseYear":2018,"developer":"ShotX Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":45033,"name":"Insanity VR: Last Score","genre":"Adventure","price":0.0,"description":"\"Insanity\": Stranded in the subconsciousness of another person in Virtual Reality.\n\"One person's craziness is another person's reality\"-Tim Burton. In the sense of Tim Burton a group of students from the University of Applied Sciences Salzburg faced the challenge to combine virtual reality technology and the horror genre in one game. On both the artistic and the technical level, the students wanted to break fresh ground and walk new paths. The project will be exhibited with many other student projects at the Creativity Rules Festival in Hallein from June 8th to June 11th 2017.\nConcept and Story\nThe game tells the story of a gray future where, thanks to the latest technology, it is possible to enter another's subconsciousness and treat their psychological problems. During a routine procedure, the player enters the subconscious mind of a former instrument maker. Shortly after the entry he has to realize that things don't go according to plan and that he is locked inside. During the search for a way out, the terrible past of the instrument maker is gradually revealed and the player discovers that he is not alone.\nVisual style and new technical possibilities\nAimed at a very simplified and abstract design the team wants to stand out from the mass of hyperrealistic horror games and offer their own distinctive style. On a technical level, the students try to use new and innovative techniques to push the game onto a new level.","imageUrl":"https://media.rawg.io/media/screenshots/2ce/2cecf4d3b1578df6dcf2113f7ea03f08.jpg","releaseYear":2017,"developer":"Threevol","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44982,"name":"Mercury: Cascade into Madness","genre":"Adventure","price":0.0,"description":"Mercury is a quirky, unpredictable, and a violent vigilante who seeks to bring justice upon a variety of low-life scum in the city.\nGeneral Features:\nAn urban sci-fi cyberpunk setting, taking place in a crime-ridden city where vigilante justice is a common occurrence.\nChoice and consequence. The choices you make will have an impact on the world around you.\nSimilar skill progression system to City of Chains – gain skill points by completing tasks and making progress in the story.\nUse a variety of ways to tackle the challenges, be it stealth, charisma, lockpicking, or head-on combat.\nWeapon Charge combat system – no more worrying about ammo! Use basic weapon skills to charge it up, then unleash these charges with stronger attacks.\n2 difficulty modes – Normal and Challenging.\nStory overview:\nMercury is a quirky, unpredictable, and a violent vigilante who seeks to bring justice upon a variety of low-life scum in the city. However, she used to be a normal person with a normal life, a smart young woman with ambitions. One night changed it all. A traumatic experience sent her mind tumbling down into a spiral of madness. Haunted by nightmares and struggling to trust others, Mercury saw a new meaning in her life.\nDriven by her newfound purpose, Mercury took to the streets to punish those who are responsible for what happened to her, so that an experience like this won’t happen to anyone else. However, before long, she finds herself entangled in something much bigger than her own sense of revenge. She soon discovers that petty criminals are only a tip of the iceberg and that the city contains individuals who are far worse. In order to bring down the enemy, she will have to find potential allies, make hard decisions, manipulate others when necessary, and use unhinged violence in order to keep herself safe through all this.\nYou are Mercury. Whether she becomes an agent of justice or a ruthless killer is in your hands.\nYou can check out Astromic Games' popular RPG titles on Steam here: http://store.steampowered.com/bundle/347/","imageUrl":"https://media.rawg.io/media/screenshots/09c/09c30c17165ce6cba2612b9f28cdd2e8.jpg","releaseYear":2017,"developer":"Astronomic Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":41557,"name":"Oniken","genre":"Arcade","price":0.0,"description":"In a post-apocalyptic future controlled by a sinister corporation, ninja mercenary Zaku is the last hope for humanity. Inspired by the demanding gameplay of 8-bit action/platformers, Oniken pits your agility and swordplay against a gauntlet of enemies, traps, and challenging bosses.\n\nKey Features:\n8-bit inspired pixel art and music\nCinematic cutscenes\nSix difficult missions, plus additional bonus stages\nBattle 18+ bosses in the campaign or Boss Rush mode\nSingle-life Hardcore Mode for a true challenge","imageUrl":"https://media.rawg.io/media/screenshots/f67/f6722f0ba4241ea1a9c67e0c2c99a3a6.jpg","releaseYear":2012,"developer":"JoyMasher","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":40813,"name":"Rusty Hearts","genre":"Action","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/5be/5be314fd02179888237daa8b53f527aa.jpg","releaseYear":2011,"developer":"Stairway Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":40795,"name":"Mass Effect 2: Arrival","genre":"RPG","price":0.0,"description":"A deep cover agent is missing in Batarian space, after reporting evidence of an imminent Reaper invasion. Shepard must travel to the edge of the galaxy, rescue the agent, and discover the truth behind the Arrival. Uncover new research and 3 new achievements in this spectacular new adventure for Mass Effect 2.","imageUrl":"https://media.rawg.io/media/screenshots/8b5/8b5fb961348013139f9cca25f30ba1a6.jpg","releaseYear":2011,"developer":"BioWare","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":40724,"name":"Mass Effect 2: Overlord","genre":"RPG","price":0.0,"description":"When sent to investigate a Cerberus research base that's mysteriously gone silent, Shepard arrives to find geth overrunning the base. The sole survivor, Chief Scientist Archer, paints a dire picture: an experiment to fuse a human volunteer with a virtual intelligence created a dangerous hybrid \"VI overlord\". The rampaging VI has already attacked three other Cerberus bases, controlling any technology it finds in an attempt to break free--and unleashing geth across the planet. Unless Shepard can infiltrate the VI's fortress and shut it down, this homicidal intelligence will beam itself-off planet and wreak havoc on other systems.","imageUrl":"https://media.rawg.io/media/screenshots/64c/64c94f6b185faef9fb5b042ddde0f0ad.jpg","releaseYear":2010,"developer":"BioWare","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":39502,"name":"Fallout 3: Point Lookout","genre":"Action","price":0.0,"description":"Buy a ticket and hop onboard the ferry to the strange seaside town of Point Lookout. What secrets do the dilapidated boardwalk hold? What horrors lie in the depths of the murky swamp? Point Lookout is the most open-ended DLC yet, and allows you to explore a huge, swampy wasteland any way you’d like. A completely new quest line allows you uncover the town’s hidden secrets and wield new weapons like the Double-Barrel Shotgun against the swamp’s deformed denizens.","imageUrl":"https://media.rawg.io/media/games/9a9/9a97bc28759cf0c014e7df3ff66ad385.jpg","releaseYear":2009,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":28366,"name":"Amped 3","genre":"Action","price":0.0,"description":"Amped® 3 Recipe for Fun: Take the best snowboarding physics, controls, and tricks…top with zesty sled crashing and go-anywhere snowmobiles…add a pinch of powder carving…season with insanely hilarious story…mix with 230 new challenges and pour into huge playground snowboxes…spread evenly over seven massive resorts. Play it. Eat it. Love it.","imageUrl":"https://media.rawg.io/media/games/693/693b850fe54f73b01f97177b2aa4fb20.jpg","releaseYear":2005,"developer":"Indie Built","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28352,"name":"Mars Rover Landing","genre":"Desconocido","price":0.0,"description":"How hard is it to land on Mars? Test your skills! Your mission: guide NASA’s Mars rover Curiosity to its landing site safely and on target. Use your body to direct the craft and control thrusters as you descend. Gain avatar gear and achievements for a safe landing. The rover’s success depends on you! The Games on Demand version supports English, French, Italian, German, Spanish, Danish, Dutch, Finnish, Greek, Hungarian, Norwegian, Polish, Portuguese, Russian, Swedish, Japanese, Korean, Chinese. This game requires a Kinect™ Sensor.","imageUrl":"https://media.rawg.io/media/screenshots/258/258b9577dc40d4259f06bd5d8b4f9616.jpg","releaseYear":2012,"developer":"Smoking Gun Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":27998,"name":"Fire Emblem Fates: Revelation","genre":"RPG","price":0.0,"description":"You must have Fire \n      Emblem Fates: Birthright or Fire \n      Emblem Fates: Conquest to access this content.\n    \n      Two kingdoms have met at the crossroads of war, and you've walked the \n      path of loyalty or kinship. Yet some mysteries remain unsolved. After \n      purchasing either the Fire Emblem™ Fates: Birthright \n      version or the Fire Emblem Fates: Conquest version, take a leap \n      of faith in this third path by aligning with neither royal family. The \n      secrets you seek await you in another realm. Dare to discover the hidden \n      truth.\n    \n      In this revelatory Fire Emblem™ experience, your customized \n      avatar is the main hero. An army of knights, mages, archers and more are \n      at your command for the most challenging battles in series history. Each \n      unit and weapon has strengths and weaknesses that you must balance \n      against the foes they face. Partner your allies on the battlefield so \n      they can support one another in combat. Building relationships is \n      key—the closer your allies become, the better they’ll fight together.\n    \n\n        An epic storyline centered on the main character who is forced to \n        choose between his bloodline and the family who raised him\n      \n\n        Play as either a male or female protagonist; this customized avatar is \n        the main character\n      \n\n        New \"My Castle\" area to interact with your allies and build stronger \n        relationships\n      \n\n        Have StreetPass™ encounters with other players to visit their My \n        Castle or battle against their armies to have the chance to recruit \n        them.\n      \n\n        amiibo™ compatibility–scan the corresponding amiibo and Marth, Ike, \n        Lucina, and Robin will appear in your game for you to battle and \n        recruit. (amiibo sold separately. Compatibility and functionality of \n        amiibo may vary per game. Visit amiibo.com for specific details on how \n        each amiibo works.)\n      \n\n        A series of DLC maps will be available for purchase, with new maps \n        releasing every week (from 2/19 – 4/21)","imageUrl":"https://media.rawg.io/media/screenshots/b3d/b3d092aac952af4153f27606d6249321.jpg","releaseYear":2016,"developer":"Intelligent Systems","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":23093,"name":"Evil Islands","genre":"RPG","price":0.0,"description":"Welcome to an unprecedented blend of radical RPG and serious strategy. It's cunning against savagery and steel against magic. It's 80 mind-bending quests in an ever-changing 3D world. It's 300 vicious manifestations of pure evil. It's the unique power to create deadly spells and awesome weapons from the spoils of your adventures. It's flexible, multi-skill character development. It's stealth, treachery and fierce combat set in a dark, rich storyline. It's Hell to pay. We call it Evil Islands. You can call it home for the foreseeable future.Unique combination of Role Playing and Real-time Strategy\n3D Real-time world with free-moving cameara and easily customizable interface\n80 quests requiring combination of combat and stealth\n100+ hours of gameplay\n20 giant game zones on three massive islands each with diverse climate and culture featuring real-time weather day/night changes\nGraphically based weapons and spell creator\nNon-linear character/skill attribute development system\nCharacters walk, crawl, sneak, steal and backstab\nOver 300 monsters each with individual animation sets\nCharacter morphing technology featuring realistic in-game changes\nMulti-player support for up to 6 players","imageUrl":"https://media.rawg.io/media/screenshots/df9/df90b77b9563ab429d10cc1efa051be3.jpg","releaseYear":2001,"developer":"Nival Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22709,"name":"Wing Commander 4: The Price of Freedom","genre":"Action","price":0.0,"description":"The year is 2673, four years after the Treaty of Torgo and the end of the Kilrathi War. As hostilities died out, more trivial concerns like rebuilding what was lost or dealing with space piracy, became the biggest concerns of the Terran Confederation. Even Christopher \"Maverick\" Blair, the famous Confed pilot responsible for ending the war, settled down and became a farmer. In these times of peace, humans grew fat and complacent. All good things must end, though. Soon enough, heinous incidents erupted on the outskirts of the Confederation, and humanity was forced to the brink of civil war. Confed HQ needed the best and decided to recall Colonel Blair to active duty. This is where you come in.\nWing Commander™ 4 is one of the greatest space sims of all time, and some even consider it the greatest one of all. It is one of those games that did everything right. This is one of the few games that actually successfully manages to integrate a lot of FMV into the action, mostly because it uses trained film actors and directors. The combat is straightforward, fluid, and entertaining. The characters are as believable and memorable as they come. The orchestrated music -- just perfect. Finally, its enthralling story is both deep and plausible -- a combination that is often lost in modern games. There is simply no reason not to play this game and, once you do start playing, you will find it hard to think of a reason why you should stop. This version of Wing Commander™ 4: The Price of Freedom features DVD-quality cutscenes.\nArguably the best installment of the Wing Commander™ series and one of the best space sims of all time.\nEnthralling and believable story, accompanied by great gameplay and fantastic orchestrated music.\nHours of masterfully directed full-motion video with actors such as Mark Hamill and Malcolm McDowell.","imageUrl":"https://media.rawg.io/media/screenshots/10b/10bff0e8557f15dfb37e0863ee9a9ad2.jpg","releaseYear":1995,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":21209,"name":"Blue Toad Murder Files: The Mysteries of Little Riddle","genre":"Adventure","price":0.0,"description":"Blue Toad Murder Files™: The Mysteries of Little Riddle is a one to four player co-operative episodic download game published by Relentless Software.\nSet in the sleepy village of Little Riddle, the main aim of the game is to follow clues to find the murderer.  Along the way you'll also encounter a variety of different and challenging puzzles which help you move through the peaceful world of Little Riddle.\nAs one of the detectives you move around the village by selecting locations on the map.  Visit the doctor at his surgery and hear his flimsy alibi. Meet with the Station Master and learn his motive. Exploring the village and meeting the villages is key to unraveling The Mysteries of Little Riddle. The villagers have information and puzzles to solve that you must complete to reveal the truth!\nWith each step of the investigation a puzzle is played and further clues about the case are revealed. Pay attention to what transpires – you will regularly be questioned on your knowledge of the case, and only observant detectives will learn the truth behind the events of their day.\nWhodunnit?  At the end of every episode you will be asked to choose your suspect before the true culprit is revealed and exposed in all their criminal capacities!\nKey features:Six separate episodes\nThrilling cliff hanger at the end of every episode\nOver 90 puzzles, Whodunnits and cross-examinations\nOpportunity to play as one of the four unique members of the Blue Toad Detective Agency\n1 – 4 co-operative multiplayer gameplay\nA story of mystery and intrigue","imageUrl":"https://media.rawg.io/media/screenshots/284/284d43223e844a646073379d52141092.jpg","releaseYear":2010,"developer":"Relentless Software","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20815,"name":"Magical Battle Festa","genre":"Action","price":0.0,"description":"In the near future, humanity has discovered a new element in their search for renewable energy: Magicore. Using \"cauldrons\" to refine the element, humans successfully create magic, and mages are born.\nAll is not well, though. As magic becomes more widespread, new creatures dubbed 'spectres' begin to appear. In hopes of training mages to fight spectres and form an army of Holy Mages, TEOS, the ruling magic agency, hosts a high stakes tournament: The Magical Battle Festa.GameplayMagical Battle Festa is an arena-based fighting game with support for up to 4 players. Use devastating combos, special moves and incredible super moves to pummel your foes into submission. Easy to learn but challenging to master, Magical Battle Festa relies on your ability to dodge enemy attacks and use your attacks at the right time without sapping all your mana.Key FeaturesGain the edge in battle by using the magibots that follow you into battle. Order them into formations to give you higher attack, higher defense, and more! Proper use of both your magical abilities and your magibots are the key to victory.\nPlay intimate 1v1 matches arena matches against talented opponents, or take the game to the next level with four player. Play in teams or against unfair odds to test your skills. The sky's the limit when magic is involved.\nChoose from a wealth of unique characters, each with their own attacks, weapons and special moves.\nAn all-star voice cast, including voice talent from all over the anime industry.\nZoom around the arena to avoid fire or make subtle sway movements to dodge attacks without ever giving up ground.","imageUrl":"https://media.rawg.io/media/screenshots/83f/83fb71cff1bdafe9a005c0f22990ac97.jpg","releaseYear":2014,"developer":"Fly System","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18897,"name":"Baezult","genre":"Adventure","price":0.0,"description":"Baezult is a puzzle/action platformer set in a lost temple hidden for thousands of years behind a waterfall. You play as a brave explorer looking to find riches beyond his wildest dreams. But be careful, the people of the temple have protected their wealth very well.","imageUrl":"https://media.rawg.io/media/screenshots/6ec/6ec4c9d28917448ccdd8b16ba6a30cf0.jpg","releaseYear":2016,"developer":"Atapki","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18042,"name":"Arclight Cascade","genre":"Action","price":0.0,"description":"You are the contestant Pod Pilot, armed with only your wits and your composure.\nAND A GIANT LASER SWORD.\nIn the Arclight Arena, you fend off Glass Drones and other Player Pilots by swiping and slashing them away in glorious 4-way Sabre clashing combat! Fight through a multitude of Arena layouts in Competitive, Duel and Single Player Game Modes with fully customizable Rule Sets and full controller support.\nFeaturing delicious 'leighties' tunes from Indie scene stars Shirobon, MegaNeko and Jim Loh, Arclight Cascade brings the full Arcade experience to your Party/Living room/Dorm/Office meeting that totally ain't rad enough.","imageUrl":"https://media.rawg.io/media/screenshots/4d1/4d1fd88717acdd67ba330bd32ce684db.jpg","releaseYear":2015,"developer":"Hexdragonal Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17915,"name":"Unium","genre":"Strategy","price":0.0,"description":"Your task is to draw a line.  A single line.  How complex can that be?\nStart with one tile and trace a line to the next, then the next.  Each tile you pass over flips from black to white, or back again.  Using only a single line, can you flip all the black tiles?\nThe simplest puzzle can have hundreds of solutions, and Unium features over 100 levels to solve your way through.  Unlock harder puzzles by solving easier ones, learn what works and what doesn't, and solve puzzles in multiple ways to earn achievements.  Even better, use the built-in level editor to create your own puzzles, and share them on Steam Workshop!  Unium is a fantastic pick up and play puzzle game that can entertain for a minute or an hour.","imageUrl":"https://media.rawg.io/media/screenshots/937/93717a2e41af170ac654e8728e70babb.jpg","releaseYear":2015,"developer":"Kittehface Software","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17218,"name":"Fatal Theory","genre":"Action","price":0.0,"description":"Fatal Theory is nostalgic beat-em-up action with a fresh twist of ENDLESS AERIAL RAVE COMBOS and a killer illustrated story. Exercise your carnage muscle by smashing through huge hordes of unlovable fiends, meet a bizarre cast of characters (and subsequently slay a good 90% of them in wicked boss battles) and take your crummy city back from the forces of hell!\nChunky retro pixels: check.\nTight, fluid controls: check.\nCombat cranked to 11: check.\nStory that makes the writer want to drink until he forgets: check!\nThe StoryYou play as Nick Mayhem, who has just had his night RUDELY INTERRUPTED by news of the dead walking the streets and doesn't think twice before picking up a baseball bat and taking the fray head on! Soon Nick will find himself tangled up with screwy demon generals and their armies of hell, fighting his way to the head honcho with only a judgemental talking sword for guidance.\nCan Nick Mayhem save his city from destruction?\nWill he find love in a city mid-apocalypse?!?The Game\nWreak havoc through huge waves of enemies and 9 nifty boss battles. Execute chaotic special attacks by filling your rage bar and pulling off Street Fighter-esque button combinations. String together big combos and be rewarded with a big damage multiplier. Unlock 6 weapons and level them up to gain new special attacks to wreck fools with. Make cold cash by completing levels, spend it pumping up Nick's stats to get stronger. Do it all while enjoying an off-beat, darkly humorous story illustrated in cool comic book style.The Features Fully illustrated, darkly humorous story mode\nPower up! Find new weapons, level them up to unlock devastating new special attacks, and pump up Nick's stats at the shop.\nLocal multiplayer: co-op in arcade mode or duke it out in versus, with gamepad support for 1-2 controllers.\nSurvival mode - destroy all comers, forever!\nMod friendly: literally everything in the game can be reskinned.The Heart\nFatal Theory is a game crafted with love by two brothers who tried to make a simple 2D fighting game and got completely carried away. Matt coded the entire engine and game from scratch, did the bulk of the character animations, and illustrated the story. Adam wrote the dialogue, filled in the background art with life and detail, did the other portion of character animations and generally spit-shined things. The game has been in on-and-off development and various states of release for years, but we're proud to say this is the best version yet.","imageUrl":"https://media.rawg.io/media/screenshots/775/775ffadb8200015c28a2b9ccdcdd22c3.jpg","releaseYear":2016,"developer":"2 Hit Studio","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]