[{"id":507151,"name":"Endless Zone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e9e/e9e13e0a1b9e6d95d438f6d58c99a440.jpg","description":"Waaaaay back -- before Endless Legend, before Dungeon of the Endless -- Opbot was just another Field Surgeon and Organ Recovery Specialist in the Mezari military.\n\nThen, one day, something happened... and Opbot found themself on the run. In a stolen escape pod (with, fortunately, several gun emplacements), they will attempt to flee the Mezari empire, escape the tendrils of the Unfallen, avoid getting eaten by Cravers, and find a way out of a temporary breach into the Riftborn universe!\n\nFor SEGA's 60th anniversary, we're putting our favorite android through the wringer in homage to one of our favorite SEGA console games: Fantasy Zone.\n\nOpbot got stuck in the Endless Zone. Can you get them out?*Available until 10am PST / 6PM BST October 19th*","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"SEGA","platforms":[{"id":0,"name":"PC"}]},{"id":391395,"name":"West of Dead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/731/731576e935a2d50481812aab0e7ae9f6.jpg","description":"Purgatory, Wyoming, 1888. A place of gun smoke and darkness, sin and damnation, wendigos and witches. Step into the boots of the dead man William Mason (voiced by Ron Perlman) in this fast-paced twin-stick shooter. Dodge behind cover as you try to outgun your enemies in the unknown procedurally generated hunting grounds. The Wild West has never been this dark.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Upstream Arcade","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":17586,"name":"Knights of Pen and Paper +1 Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29d/29d887e63c1d9bc5034ad435d652c8dc.jpg","description":"Knights of Pen & Paper is a meta-RPG that offers the player to participate in a game within a game. It is the first installment in its series. \n\n###Gameplay\nAs its name suggests, the game is inspired by the pen and paper RPGs in the vein of classic Dungeons & Dragons. In Knights of Pen & Paper, the player controls a group of people who participate in a tabletop role-playing session. The Dungeon Master is also under player's control. The player uses the DM to set up the battles with monsters and then leads the party members as they crawl through the dungeons in a fantasy world. The characters and the DM are shown onscreen in the foreground. The monsters and the locations appear in the background.\n\n###Characters\nEach party includes up to 5 members. The game has a total of 19 characters with personalities like \"Little Brother\", \"Hipster\" or \"Nerd\". 14 of the characters are available from the start and 5 bonus \"Dev Crew\" characters can be unlocked. Each character has his or her personal bonus ability.\n\n###Style\nThe game is made in a \"retro\" pixelated visual style and is set to simple chiptune music. Knights of Pen & Paper includes a number of comical references to the classic role-playing games and popular culture.\n\n###Edition features\n+1 edition includes additional dungeons and monsters. There are also new character abilities to use during the battles that make the fights more varied. This edition introduced The Tavern that allows the player to store and change his or her characters.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Behold Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14188,"name":"Gorogoa","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3e7/3e70b112ae2f814b105552dfea7c16dd.jpg","description":"Designed, developed, and illustrated by Jason Roberts, Gorogoa is a beautiful hand-drawn story suspended inside a completely unique puzzle. Arrange and combine lavishly illustrated panels, each one a separate interactive window into a living game world. Navigate the scene inside each panel. Align the images in adjacent panels. Solve puzzles and advance the story by stacking and connecting panels. Imagine pictures on a wall escaping their frames and joining together to create new impossible scenes. Elegantly simple and yet astonishing.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Annapurna Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":147,"name":"Pinball Arcade","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/714/714e0b5c9a52a135fd782dc7a4830ddd.jpg","description":"###Licensing issues\nPinball Arcade is the meticulous digitization of real analog pinball machines. The licensing was provided to developers from FarSight Studios by Gottlieb, Alvin G. and Company, and Stern Pinball. In addition to a fairly straightforward development process, in parallel developers were negotiating the licensing of gaming tables. As a result, it was possible to negotiate for a certain period, and as of 2018, some types of gaming tables are not available for the game because the license was over. In total, more than sixty tables disappeared, most of which were included in paid DLCs.\n\n###Key features\nThe game came out on all possible platforms: including the most recent ones like Nintendo Switch, Sony PlayStation 4 and Xbox One. On the PC game is available for free, but for new tables, players have to pay. There is no plot in the game, and all the attention of the developers were focused on recreating all the smallest details of the gaming tables and the physics of the ball. The rest is a usual pinball: the player has access to the field and the ball, the main task is to beat out as many points as possible for three attempts, that is, without dropping the ball. You can catch it and toss it again with the help of two sticks that is the only player-controlled object in the entire playing field.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"FarSight Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":42309,"name":"Dead Island: Epidemic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a2b/a2bf0cdce95b8158720f156d269a3e3a.jpg","description":"A beautiful island serves as a haven of the \"living dead\" horde, eager to devour all life.\nThe island is an open world divided into locations.\nThree teams are present on the field at the same time. Your \"base\" is a car with a turret, in its body you store the collected things. Collect everything you need - this is a victory.\nFirearms are hard to find. You have to use unusual objects, fists and legs. Weapons can be improved, for this, you can find drawings and materials.\nYou can upgrade almost everything: account, hero, weapons and even a workshop. Killing enemies, you raise the level and improve skills - to a certain level. In the next battle, you will start all over again, the achievements will not be preserved.\nValuable things fall out of almost all opponents, but the most valuable can be taken for the capture or defense of \"checkpoints\". You can also steal resources from an enemy base.  Funny moment - if you collect a lot of things, the movement becomes more difficult and slower.\nThere are many tactical options in the game. In addition to the ordinary dead, there are especially dangerously infected. They spit bile and grab by the tongue.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Stunlock Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2137,"name":"Gemini Rue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/471/4715696335cefa662386da8f688d39ec.jpeg","description":"The future holds many stories, and this one tells of a cyberpunk future within the Gemini system. Gemini Rue is a graphic adventure game that allows players to take control of two main characters. First is the Azriel Odin, who is an ex-assassin turned law enforcer, in order to gather information on his missing brother. Second – Delta-Six, a man with memories of his past life that finds himself in some kind of a rehabilitation facility for criminals, who will be allowed to leave after some needed training.\nGemini Rue is played like any other point-and-click adventure; where characters controlled by the player have to explore their environments through interactions with NPC’s and puzzle-solving. Additionally featured shooting mechanics, where players can aim and shoot from behind the cover. At set points in the game, players will be able to switch between characters, present in different world locations, going through these stories separately until they reach a common plot thread.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":22751,"name":"POSTAL: Classic and Uncut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0cd/0cdce9af759853c79687bd977b4132b5.jpg","description":"Banned in over ten countries, realistic, non-stop-killing, action-strategy psychological thriller. No aliens, no mutants, no stupid quest for the dragon's balls. Just good antisocial, psychotic shoot-'em-up action, strategy and government intervention.\nBlast, maim and fire-bomb your way through 17 levels (plus 4 new levels and 24 new characters in the expansion pack). Exploit mass murder opportunities, mow down marching bands, spray protesters, charbroil whole towns. Enter multiplayer mode Go Postal with up to 15 other death row candidates.Includes the original POSTAL and the Special Delivery Expansion Pack\nA fast-paced, guns-blazing, mind-numbing isometric view killing spree\nLook at the world through the eyes of a psycho!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Running With Scissors","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21709,"name":"Unreal Tournament: Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/737/7376aef37a0d0c9f6b2aae0f437e3eab.jpg","description":"Unreal Tournament: Game of the Year Edition is a competitive arena first-person shooter. It is the continuation of Unreal series and was developed by Epic Games.\r\n\r\n###Gameplay\r\nAlthough the game was marketed as a multiplayer game, singleplayer mode is also present in order to prepare the new players for the multiplayer battles. The player has to complete 45 matches and face the current Tournament champion.\r\n\r\n###Game modes\r\nFive game modes are present in the game. \r\n\r\nDeathmatch, where the player with the highest kill count wins.\r\n\r\nTeam Deathmatch, which is the same Deathmatch but with the teams of 2 or 4 competing with each other.\r\n\r\nIn Last Man Standing, the players have a certain amount of lives. The player that loses all his lives is eliminated from the round.\r\n\r\nIn Domination, two teams fight over three markers. Upon capturing a marker, the team is given points for holding it. The team with the highest score wins.\r\n\r\nCapture the Flag is played on balanced and symmetric maps. Two teams spawn on their bases on which the team's flag is stationed. The objective of the mode is to steal the opponent's flag and carry it to your own base. The team that steals three flags first, wins. \r\n\r\n###Weapons and gadgets\r\nThere are ten types of weapons present in the game. Every weapon has an alternate fire mode. Apart from weapons, the players can use the Translocator in order to quickly teleport from one point to another. This gadget can also be used to inflict more damage to your enemies.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Epic Games","platforms":[{"id":0,"name":"PC"}]},{"id":326235,"name":"Blair Witch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/435/4351573fc473390479154f44b9dca695.jpg","description":"Inspired by the cinematic lore of Blair Witch, experience a new story-driven psychological horror game that studies your reactions to fear and stress.\n\nYour darkest fears will awaken in these woods.\n\nIt’s 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmare as you confront your fears and the Blair Witch, a mysterious force that haunts the woods…\n\nA STORY OF THE HUMAN DESCENT INTO DARKNESS\n\nFrom the creative minds behind the critically acclaimed Layers of Fear, experience first-hand the toll that fear can take on the mind in an original story inspired by the cinematic lore of Blair Witch.\n\nFIND THE WAY THROUGH THE HAUNTED WOODS\n\nWith just your loyal dog Bullet by your side, navigate your way through a cursed forest that warps and distorts both time and space.\n\nYOUR SANITY AGAINST HER CURSE\n\nStand against the horrors of the Blair Witch and the decaying sanity of a man burdened by his past.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bloober Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":311652,"name":"Planet Zoo","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/38f/38f484631d76603231be8bedf658f646.jpg","description":"Build a world for wildlife in Planet Zoo. From the developers of Planet Coaster and Zoo Tycoon comes the ultimate zoo sim, featuring authentic living animals who think, feel and explore the world you create around them. Experience a globe-trotting campaign or let your imagination run wild in the freedom of Sandbox mode. Create unique habitats and vast landscapes, make big decisions and meaningful choices, and nurture your animals as you construct and manage the world’s wildest zoos.\r\nMeet a world of incredible animals. From playful lion cubs to mighty elephants, every animal in Planet Zoo is a thinking, feeling individual with a distinctive look and personality of their own. Craft detailed habitats to bring your animals’ natural environments home, research and manage each species to allow them to thrive, and help your animals raise families to pass their genes onto future generations.\r\nManage an amazing living world that responds to every decision you make. Focus on the big picture or go hands-on and control the smallest details. Thrill visitors with iconic exhibits, develop your zoo with new research, and release new generations of your animals back into the wild. Your choices come alive in a world where animal welfare and conservation comes first.\r\nPlanet Zoo’s powerful piece-by-piece construction tools let you effortlessly make your zoo unique. Every creative decision you make impacts the lives of your animals and the experience of your visitors. Let your imagination run wild as you dig lakes and rivers, raise hills and mountains, carve paths and caves, and build stunning zoos with a choice of unique themes and hundreds of building components.\r\nJoin a connected community and share the world’s most creative habitats, scenery and even whole zoos on the Steam Workshop. See your own designs appear in zoos around the world, or discover fresh new content from the Planet Zoo community every day.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Frontier Developments","platforms":[{"id":0,"name":"PC"}]},{"id":52368,"name":"Shadow of the Colossus  (2018)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c5/5c5089af36b99bf9465357a8556449f9.jpg","description":"Rebuilt from the ground up by Bluepoint Games and JAPAN Studio, SHADOW OF THE COLOSSUS on PlayStation 4 system introduces the awe of its unforgettable world and towering creatures to a new generation of gamers, while allowing long time fans to revisit the beloved masterpiece with unparalleled visual fidelity and improved performance.\nTales speak of an ancient realm where Colossi roam the majestic landscape. Bound to the land, these creatures hold a key to a mystical power of revival – a power you must obtain to bring a loved one back to life.\nSHADOW OF THE COLOSSUS is a breathtaking journey through ancient lands to seek out gigantic beasts. Armed with only a sword and a bow, explore the spacious lands and unearth each Colossus, presenting a unique challenge to test your wits, determination, and skill.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2005-2017 Sony Interactive Entertainment Inc. SHADOW OF THE COLOSSUS is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"SCE Japan Studio","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":498,"name":"2064: Read Only Memories","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02c/02c492df578b8eedbde3e4379f9f536a.jpg","description":"2064: Read Only Memories is a retro game set in a cyberpunk world. \n\n###Setting\nThe game takes place in the near future of 2046. At this point, the technological advancements allowed people to augment their bodies and enter virtual reality. Most importantly, the robotic assistants called ROMs became increasingly popular and largely replaced the regular phones. The main producer of the robots is a corporation called Parallax, and it plans to create a new kind of fully independent AI. There's a rebel party called Human Revolution that aims to stop the progress of the AI.\n\n###Plot\nThe main engineer of Parallax, Hayden Webber, recently was abducted. The main protagonist is a journalist who researches the Webber's disappearance. He or she is accompanied by Turing, a highly advanced robotic assistant. They go on a search in the fictional city of Neo-San Francisco on the eve of Christmas.\n\n###Gameplay\n2064: Read Only Memories works as a point-and-click adventure game with a static first-person view. The environment and characters are presented to the player as slightly animated images. He or she can interact with them by clicking and choosing options, such as to look at, to take, or to speak to. \n\n###Style\nThe game is made in the vein of the 1980s and 1990s graphic adventure games. It uses pixel art visual style with minimal animation and neon-lighted environments, accompanied by a synthwave music score.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MidBoss","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":46220,"name":"Scorn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f8c/f8cc3b4834259f8a812ce77804bc12ed.jpg","description":"Scorn is an atmospheric first-person horror adventure game set in a nightmarish universe of odd forms and somber tapestry.\r\nIt is designed around the idea of \"being thrown into the world\". Isolated and lost inside this dream-like world, you will explore different interconnected regions in a non-linear fashion. The unsettling environment is a character itself.\r\nEvery location contains its own theme (story), puzzles and characters that are integral in creating a cohesive world. Throughout the game you will open up new areas, acquire different skill sets, weapons, various items and try to comprehend the sights presented to you.\r\nGAMEPLAY FEATURES\r\n-Cohesive “lived-in” world - Scorn takes place in an open-ended world with different interconnected regions. Each region is a maze-like structure with various rooms and paths to discover. All the storytelling happens in-game, with no cut-scenes to distract you from the grisly reality of the living, breathing world you’re in. But keep your eyes open - the game won’t show you any sympathy if you miss something important on your uneasy travels. Everything has a reason and purpose - you just need to work out what it is.\r\n-Full body awareness – Players will experience better immersion being aware of the character’s body and movement. Interaction with the world is realistic - objects are picked up with your hands (instead of just floating in midair), machines and instruments are operated by grabbing the controls etc.\r\n-Inventory and ammo management - is defined and limited. It plays a big role in keeping the player in an even greater state of awareness throughout the whole game. Players will have to think about when to fight and when to take cover and how their actions affect the world around them. Different play styles will be needed to advance.\r\n- Scorn part 1 of 2? Is the game split into parts?\r\nYes, we are planning to release it in two parts, with the first part coming in 2018.\r\nThese two parts represent everything that will ever be done. There will be no DLC, expansions or sequels. Ever.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Ebb Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":7407,"name":"Saints Row IV: Re-Elected","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4e/b4ec8e98127914d0a38051f641dcf2f1.jpg","description":"After saving the world from a terrorist attack the leader of the 3rd Street Saints is elected to become President of the United States. Things go reasonably well until an alien warlord named Zinyak attacks the white house and abducts his entire cabinet. Now stuck inside a reality bending simulation, the President and the Saints fight to save themselves, Earth, and the entire galaxy... if that all sounds crazy to you, trust us: we’re just getting started.\nKey features:\n• Dont Wanna Miss a Thing – share all the quintessential Saints Row IV moments with new generation screenshot, game clip and livestreaming tools.\n• Ridiculous Amount of Content – over $80 worth of content included – the base game, both DLC mission packs, plus 25+ DLC weapons, 15 new vehicles, 60+ wardrobe items, 15 new homies & 6 new superpower elements\n• Visual Enhancements - experience Saints Row IV in the highest resolution yet, with visual fidelity enhancements for enemy characters, environments, and shadows.\nThe downloadable version of this game supports English, French, Italian, German, Spanish, Polish, Russian.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Deep Silver","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":5978,"name":"Human Resource Machine","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8abf17ba4f55182f37b2eb2866fae35d.jpg","description":"Human Resource Machine is an educational game in which the player assumes the role of a program algorithm. The gameplay is a metaphorical representation of a visual programming language. The protagonist represents the processor register, and the player's instructions to the character stand in for the opcodes.\n\n###Premise\nThe main character is an office clerk who works in a storage department. His career lasts 40 years, each of them corresponding to an in-game puzzle. Two conveyor belts in the protagonist's office work as the input and the output devices, respectively. The input conveyor brings in the numbers and letters in the form of boxes. The protagonist is instructed to perform certain tasks and calculations with the boxes before sending them back through the output conveyor. The tasks usually require simple mathematical actions such as sorting and addition. The boxes remain stored on the office floor until the task is completed.\n\n###Gameplay\nThe player controls the character using commands that remind the assembly language. The handwritten notes represent the instructions the player gives to the character. As the player progresses through the puzzles, the game introduces more complicated concepts and mechanics, such as memory addresses. This feature allows the player to order the character to perform operations in the certain place of the office. The goal of each level is to create a program. The game will test the results and inform the player if it works or not (through a supervisor character).","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tomorrow","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"}]},{"id":18628,"name":"Arcanum: Of Steamworks and Magick Obscura","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/47d/47d430ae4a1e433cca041057ae3dd3da.jpg","description":"An Industrial Revolution in a World of Magick\nImagine a place of wonder, where magick and technology coexist in an uneasy balance, and an adventurer might just as easily wield a flintlock pistol as a flaming sword.  A place where great industrial cities house castle keeps and factories, home to Dwarves, Humans, Orcs and Elves alike.  A place of Ancient runes and steamworks, of magick and machines, of sorcery and science.  Welcome to the land of Arcanum.Character Design allows you to customize your character any way you choose\nWhether you choose magick or technology, the Arcanum world adapts and responds to your character's development\nClassless, point-based attribute system allows for limitless creativity in guiding your character's development\n8 basic stats, such as Strength and Charisma\nMore than a dozen derived stats, from Poison Resistance to Character Speed\n16 Primary skills, including Gambling and Healing\n80 Spells with 16 Colleges of Magick\n56 technological degrees within 8 disciplinesExtraordinary Adventure Features\nExplore a world as vast as it is mysterious-it would take over 30 real-time hours to traverse the land of Arcanum\nMeet more than 300 unique characters and monster types across this huge land\nMany means exist to solve the myriad quests, from dueling to discourse to thievery\nTake on a band of ogres in real-time, or plan your strategy through turn-based combat - you decide\nAccurate day and night cycles affect the gameplay, from combat to thieving skills\nAutomatic character management lets action-oriented players delve into the quest at hand\nCreate your own worlds or play the included multiplayer scenario online cooperatively or competively","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Troika Games","platforms":[{"id":0,"name":"PC"}]},{"id":5295,"name":"Shatter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a7/8a7586c647e10e6b6959df16d8bdc909.jpg","description":"The game belongs to the genre of Arkanoid. It has all the classic features of games of this genre and several significant innovations and differences. The platform in this game has the ability to attract or repel all objects that are \"in the air\". This property is controlled by the player. In addition to the platform, other objects have similar properties, but they can not be controlled by the player.\n\nAfter several levels, the platform changes its horizontal position to a vertical one - and there are many similar changes in the game, it constantly surprises the player.\n\nBosses, which the player meets at the end of each level, are carefully and ingeniously designed. They are able to successfully resist the player armed with the above ability to influence the \"magnetic field\" of the platform. To defeat each of them, the player will have to find some special tactics for each boss.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Kanawati","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1152,"name":"Thumper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f79/f7984b1ef834dac1262382c75adf6a87.jpg","description":"Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality. You are a space beetle. Brave the hellish void and confront a maniacal giant head from the future.\nScream down the endless track and crash through punishing obstacles with simple, airtight controls. Hurtle forward, master new moves, reach overwhelming velocities, and survive epic boss battles. Every crushing impact is interwoven with a pounding original soundtrack. To reach synesthetic bliss, you must go through rhythm hell.\nPlay in traditional HD or fully immersive VR (SteamVR or Oculus).\nNine levels of Rhythm Hell\nAdrenalizing Boss Battles, including the terrifying Crakhed\nSimple Controls: one stick and one button\nPsychedelic Visuals\nOriginal Soundtrack by Brian Gibson of noise-rock band Lightning Bolt","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Drool","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":495,"name":"Gravity Rush 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5dc/5dcaed97456910d273461485fa27e59e.jpg","description":"Another mind-bending adventure awaits gravity queen Kat as a new danger emerges to threaten the fabric of the universe itself. Still searching for clues behind the mystery of her origin, and with the powerful Raven at her side, Kat must master three unique gravity attack styles as she takes on enemies and massive bosses.\nGravity-Based Action –The franchise’s famous gravity-based action mechanics have evolved with two additional styles, each with their own unique attacks.\nVast Open World – Enter a bright and bustling floating city, bursting with life. Manipulate gravity with the motion sensors of the DUALSHOCK®4 wireless controller to soar and traverse a vast and detailed open world.\nSignature Art Style – French “bande dessinée” comic book aesthetic is artfully blended with Japanese manga and anime influences to create a unique and beautiful atmosphere, with cityscapes and characters and brought to life in stunning detail on PlayStation 4.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 Sony Interactive Entertainment Inc. 'Gravity Rush' is a trademark of Sony Interactive Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":2588,"name":"Evoland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/794/794f2a2496488b512858b3cab9072281.jpg","description":"Evoland is a role-playing video game. It is the debut project by French development company Shiro Games. \n\n###Plot and setting \nThe game is centered on the theme of action-adventure video games evolution. It takes place in the world of Evolandia and follows a typical story of a chosen one and his fight against evil forces. The game’s dialogues, items descriptions, and overall style are filled with humor, parody, and references to iconic video game series. \n\n###Gameplay \nThe main feature of the game is unlocking of graphical, sound and gameplay improvements. The game starts as a monochrome top-down adventure with no sound and gradually, as the player progresses through the story, transforms into full-fledged 3D RPG with soundtrack, different settlements throughout the game world, side-quests, NPCs and equipment system. \nEvoland’s gameplay continually changes. It can be divided into three main parts, each one resembling a certain game series. The first is top-down adventure similar to older The Legend of Zelda titles. Like Zelda, it features different puzzles and dungeons throughout the game. Then the game changes its combat system to turn-based imitating Final Fantasy series with its random encounters and party system. After that, it becomes the top-down hack-n-slash game in the style of Diablo series with the accent on obtaining various loot.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"}]},{"id":10851,"name":"TOXIKK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/151/15133c265bf553aa6192d7d8340c56ff.jpg","description":"TOXIKK is a competitive online arena first-person shooter developed by Reakktor Studios. \n\nA heavy accent on the fact that the game tries to emulate the feel of the nineties-era shooter is made by the developers. Reakktor Studios states that TOXIKK is what a typical multiplayer FPS would be if there were no MOBAs and military arcade shooters. There is no singleplayer campaign whatsoever present in the game.\n\n###Gameplay\nThe game draws heavy inspiration from Quake and Unreal Tournament in its gameplay. It combines fluid and fast movement with lethal and accurate weapons. There are no loadout or class systems present in the game, just like in classic multiplayer shooters. Instead, the weapons spawned on the map with each player beginning with a simple pistol and a chainsaw, that serves as a replacement for a knife.\n\nSeven more weapons are present in the game: Dragoneer flamethrower, Violator assault rifle with an under-barrel grenade launcher, a shotgun, Stingray energy rifle, Falcon sniper rifle, Cerberus grenade launcher, and The Hellraiser, that one-shots any enemy. Each weapon has an alternate fire mode. For example, while using the alternate fire of a Stingray, a deadly energy beam is used instead of an energy sphere.\n\nThere are 13 maps present in the game, with one of them being a training map. Four modes are present in the game: usual Deathmatch, Team Deathmatch, Point Control, and Capture The Flag.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Reakktor Studios","platforms":[{"id":0,"name":"PC"}]},{"id":638654,"name":"Dead Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ea6/ea6a1382b15d749e15fdfbf0aece7689.jpg","description":"Isaac Clarke is an everyman engineer on a mission to repair a vast, sprawling starship, the USG Ishimura, only to discover something has gone horribly wrong. The ship's crew has been slaughtered and infected by some alien scourge...and Isaac’s beloved partner, Nicole, is lost somewhere on board.\n\nNow Isaac is alone with only his tools and engineering skills as he attempts to uncover the nightmarish mystery of what happened aboard the Ishimura. Trapped with hostile creatures called “necromorphs”, Isaac faces a battle for survival, not only against the escalating terrors of the ship, but his own crumbling sanity.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Motive Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":19119,"name":"Dragonsphere","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/690/6904093b049c766b233e27eca8d62b68.jpg","description":"Travel to the land of the fantastic!\nNewly-crowned King of Callahach! It's been twenty years since your father saved the world by entrapping the evil Sorcerer Sanwe. Now the spell is waning. Sanwe's malevolent force will soon consume the land, and only you can stop him. Will your quest be aided or subverted by bizarre races like shape-shifting Slathans, the faery-like Brynn-Fann, of the black-eyed Soptus Ecliptus?\nA thousand deaths await your every step as you unlock mind bending puzzles. Magical items lie just out of reach. A host of deadly monsters are eager to do battle with you. And glorious rewards are yours to obtain as you struggle to preserve your father's legacy. The stage is set. The fate of the world turns upon your actions. The time for adventure is now!\nJourney through a fully realized fantasy world via dazzling state-of-the-art graphics.\nExperience the adventure through haunting music and fully digitized speech.\nPerform an unprecedented range of actions with the MADS intuitive interface of your fingertips.\nWatch your adventures come to life with ultra-smooth rotoscoping and advanced animation.\nSoundtrack Included in high quality FLAC format.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":11719,"name":"SNOW","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b5/9b537110cf89adc338c15b0b7c2131ac.jpg","description":"According to the creators, the only game is a free simulator of an extreme sport, descending on a snowboard and skis.\n\nHowever, it is not completely clear in what sense this game is the only one - the only one in the genre of simulators of extreme winter sports or the only free in this genre.\n\nThe game allows you to famously go through various trails for descending on snowboarding and skiing, without leaving the seat in front of the computer.\n\nThe player has everything that a real snowboarder usually has - the slopes of the mountains, the full abundance of equipment, the beautiful (or not) weather and any amount of snow.\n\nUnlike the real world, in the game world you can design slopes at your own discretion.\n\nIn the game there are unexpected finds, various types of competitions, including for groups of players. You can pass the tracks in different styles too.\n\n###Open world\nThe game world is open. This is not an analogue of the existing slope, but a huge alpine mountain created specifically for the game, Sialia. It has four slopes that you can explore, discovering towns, valleys, old ruins and much more.\n\n###Snow\nThe \"behavior\" of snow in the game reproduces all of its real physical characteristics on real mountain slopes. Just like in the game, the snow reacts in reality to skiing or snowboarding.\nthat","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Poppermost Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":52340,"name":"Iron Harvest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b7/8b7c5b4656959c608b8fcc23f166d7e0.jpg","description":"Iron Harvest is now available on Kickstarter, you can read more about it here\n“After World War 1 farmers found a plethora of unexploded ordnance, barbed wire, weapons, shrapnel and bullets while ploughing their fields. They called it the Iron Harvest.”\nThe Game\nIron Harvest is a real-time strategy game (RTS) for Playstation 4, Xbox One and PC, set in the alternate reality of 1920+.\nYou lead hero characters, mechs, and soldiers into battle. Cover mechanics and dynamic destruction play a major role in combat. Your squads take cover automatically, but a simple brick wall will only offer protection against small calibers, not against mech-mounted cannons.\nThroughout its open sandbox levels you have to find your own way to reach the goals set by the dynamic story line.\n1920+ was developed by Polish artist Jakub Różalski and earned him a cult-following because of his beautiful artworks painted in the style of the old masters.\n“We love games like Company of Heroes or Men at War and want to bring a similar gameplay experience to this fantastic world Jakub created.” Jan Theysen, Project Lead at KING Art Games.\nThe game is in its early development phase and is scheduled to launch 2019.\nThe World\nThe game takes place in the world of 1920+, an alternate version of our own world where mankind, fascinated by technology, engines and iron, invented powerful walking machines. Once mighty weapons on the battlefields of the Great War, they are now part of everyday life.\nMighty factions fight for influence, while hidden forces are working towards the destabilization of Europe, determined to set the world on fire once again.\nThe Saxony Empire is one of the most influential countries in Europe, with powerful industry, developed cities, modern factories and a strong military tradition. After the unfavorable conditions of surrender in the Great War, the current mood in the Empire is bad, and proud elites and humiliated aristocrats secretly oppose the Emperor’s appeasement policies.\nThe Polania Republic is a large agricultural country with a long history. It is trying to maintain its status and territory, struggling with its aggressive neighbors: The Saxony Empire in the west and Rusviet in the east. Polania initiated a program to modernize its army while a large part of the country is still occupied by Rusviet forces.\nRusviet is huge, powerful, and has unmatched industrial and population potential. However, the country is tired and worn out by the long war. People are frustrated, and the power of Tsar Nikolaj weakens. Mysterious Grigori Rasputin has become an extraordinarily powerful man and revolution is in the air...","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"KING Art","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":9728,"name":"Tooth and Tail","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fe/0fe56481cd45285bb82539dd4e66dcfb.jpg","description":"Lead the revolution with an army of flamethrowing Boars, mustard gas-lobbing Skunks, and paratrooper-puking Owls.  Tooth and Tail is a Real-Time-Strategy game featuring Single Player, Online Competitive Play, Split Screen, Replays, and more.\nBuild a base, lead your army, eat your enemies!The War for MeatThe Longcoats, the Commonfolk, the KSR, and the Civilized are in the midst of a Civil War over who gets to eat, and who has to be the meat.  A darkly humorous tale of riots and revolution is told through an extensive Single Player campaign.Endless ReplayabilityWith procedurally generated maps and customizable factions, no two conflicts will be the same, forcing players to strategize rather than memorize.Pick-up-and-PlayWith matches lasting from 5-12 minutes, controls designed specifically for the gamepad, and split-screen couch play, Tooth and Tail is a popcorn RTS for veterans and newcomers alike.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Pocketwatch Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":428033,"name":"Hotshot Racing","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/116/1169f370cdb4976dda3220faa3c57cda.jpg","description":"Hotshot Racing\nHotshot Racing is a blisteringly fast arcade-style racing game fusing drift handling, razor-sharp retro visuals and an incredible sense of speed to create an exhilarating driving experience.\n\n16 racing circuits provide the twists, turns and straights conducive to searingly quick racing. Take in coastal, jungle, alpine and Las Vegas desert environments, with each course modelled with the most vivid colours and blue skies for miles.\n\nTime Trial and Grand Prix modes cater to those who like to compete in classic racing formats, while ‘Cops and Robbers’ and ‘Drive or Explode’ modes offer exhilarating new ways to play.\n\nEach mode is available in single-player, four-player split-screen and eight-player online, while Time Trial is single-player only. Single-player modes run at a blistering 60FPS to deliver one of the fastest depictions of racing possible.\n\nSmash lap records to rise-up the global online leaderboards or download ghost laps to match your racing lines against the very best.MEET THE HOTSHOTSKeiko, Xing, Mike, Alexa, Aston, Toshiro, Marcus and Viktor - eight speed addicts that have dedicated their lives to the pursuit of being the greatest racing driver in the world.CATCH THE DRIFTDrifting is crucial in Hotshot Racing. Boost charges as the player drifts so maintaining it for as long as possible is vital to preserving maximum speed throughout a race.DRIVE OR EXPLODEIn this mode each car has a bomb attached to it. Drop below a certain speed and BOOM! The trigger speed gets faster and faster, forcing players to maintain impossibly high speeds.COPS AND ROBBERSRobbers evade the cops. Cops catch the robbers, and in doing so convert them to the police side, leading to an exciting test of skill for the surviving criminals.A WELL NEEDED BOOSTEarn boost by drifting and slipstreaming opponents and unleash a one-shot hit of speed to leave them in your rear view mirror.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":16024,"name":"Higurashi When They Cry Hou - Ch.1 Onikakushi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/443/44313191546d1280d72ee98e82d95e51.jpg","description":"*THE GAME THAT INSPIRED THE MEGA-HIT ANIME SERIES\nRETURNS WITH BRAND NEW CHARACTER ART!! *\n----------------------------------------------------------------------------\nThe 58th year of Shouwa, early summer\nIt’s June, and the summer heat has arrived earlier than it does most years.\nBy day there are crickets, and by night there are cicadas.\nWe’re in Hinamizawa, a small village in the countryside.\nThere are fewer than two thousand people here. But every year, there is an event.\nThis event is a mysterious death.\n(The series has run from 1979 to 1983)\nOn a certain day in June, someone dies, and someone else goes missing.\nThe series of deaths is connected to the upheaval surrounding the dam construction project.\nA murder case that was covered up is being reenacted.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there isn’t.\nSomeone who wasn’t supposed to be there is.\nSomeone who was alive last night is dead now.\nAnd someone who is here right now isn’t alive.\nSo, there is no way to avert tragedy. There is no choice but to give up.\nBut don’t give up.\nOnly you can stand up to this.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"07th Expansion","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9988,"name":"Crazy Machines 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84b/84bc9bbb4e160a194d0eb44a78248067.jpg","description":"Higher, faster, larger, crazier, trickier, and so much more 3D: that's Crazy Machines 3!\nPlace missing pieces into zany chain reactions and turn them into ingeniously working machines to solve puzzles like these:\nHow do you successfully punch an Egyptian statue in the face? How do you shoot a kettle from the head of a clumsycorn with a 'high precision crossbow'? How du you jumpstart the grey-matter-engine of that old junker of a space taxi?\nFind out in Crazy Machines 3!\nPrepare yourself for the ultimate playground of vast Rube Goldberg style possibilities!\nUse physical systems to your advantage, no matter if it’s electricity, explosions, lasers, lightning, or wind. By tinkering with chips you can delve into even deeper detail and provide objects with individual properties. Nothing is impossible. If you don't like that wooden plank, take your pick from different materials like metal or stone and change the size, rotation and color. It is, after all, your own machine...\nAdditionally, we invite you to use Steam® Workshop to gain access to a possibly infinite supply of puzzles and machines to implement into your game. And when you build your ultimate machine, you can share it with the whole world with a single click.\nFree content updates with new machines, parts and objects in the near future\nExtensive and powerful editor for creating your own machine parts\nMore than 220 objects and over 300 single parts you can choose from\nCreativity meets freedom: create and experiment with different materials and colors\nSteam® Workshop access for a possible unlimited supply of parts and levels","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fakt Software","platforms":[{"id":0,"name":"PC"}]},{"id":326244,"name":"Tales of Arise","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a9/5a9e785af72ae88026380f7987f23d90.jpg","description":"Deluxe Edition\r\nThe Deluxe Edition includes the Tales of Arise full game, Premium Travel Pack, and Adventurer's Pack.\r\nUltimate Edition\r\nThe Ultimate Edition includes the Tales of Arise full game, Premium Travel Pack, Adventurer's Pack, Collaboration Costume Pack, and 18 additional costumes.\r\nAbout the Game\r\nA world of nature drawn with the “Atmospheric Shader”:\r\nWe are introducing a new graphics shader, inspired by anime and watercolor painting. Characters with attractive designs travel among backgrounds filled with beautiful and delicate visuals.\r\nExplore a world that feels alive:\r\nExplore the world of Dahna, where a mix of unique, natural environments change in appearance based on the time of day. Climb over the rocky terrain, swim in rivers, gather around the campfire, cook food, head to the next town, defeat the master of an alien planet, and liberate the people!\r\nStylish action and battles:\r\nThrough the new system “Boost Strike”, you can now chain combos of powerful attacks together with your party members. Chain Artes, Boost Attacks, and Boost Strike combos to take down your enemies!\r\nExperience the story of the divided Renan and Dahnan people:\r\nThe protagonists who will determine the fate of these two worlds are Alphen and Shionne. They will overcome hardships and grow together with their unique group of friends. Gorgeous animation by ufotable is inserted at key points in the story, adding more color to our protagonists’ journey.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":62817,"name":"Crying Suns","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e97/e97020b39abc864e3cdf4e7e564c402c.jpg","description":"Pre-Purchase Offer\nOur Kickstarter campaign is now over! But you can still pre-order the game at a preferential rate here:\nhttps://crying-suns.backerkit.com/hosted_preorders\nAbout the GameWhen FTL meets Foundation\nCrying Suns is a rogue-lite and tactical game where you explore a dying galaxy as the admiral of a space fleet.\nAs a deep story-driven game experience, each successful run will uncover a part of the underlying truth about the fall of the galactic Empire.Main Features\n- Space exploration in a procedurally-generated universe\n- Tactical fights between battleships and their squadron fleets\n- More than 300 possible story events (with various possible actions and outcomes in each)\n- A deep and dramatic storyline structured in 6 chapters\n- A dark and disturbing atmosphere inspired by our favorite S-F universes (Foundation, Dune, Battlestar Galactica)\nPrepare to die often, it's a rogue-lite game... And it's a hard one…\nThe story: The epic journey of a clone\nAfter 700 years of peace and prosperity, the Galactic Empire has suddenly been shattered into pieces. The OMNIs, god-like machines which did everything for their human masters, have mysteriously shut down. And humankind, having long since lost the ability to survive on its own, is dangerously close to extinction. But somewhere in a far corner of the Galaxy is Gehenna, a planet of ice and rock and a top-secret facility that is the pinnacle of Imperial Tech and also humanity’s last chance.\nYou are a clone of Admiral Ellys Idaho, a weapon fashioned from flesh, the best Imperial Admiral ever to battle in the stars and you have just been awoken on this planet by its strange and darkly-humorous Guardian, Kaliban, the last functional OMNI to exist.\nYour mission: skillfully command a battleship through the Empire's now chaotic, violent clusters ––where one wrong move could be your last–– as you try to reactivate the OMNIs and save the future of all humankind. But you must leave Gehenna now.... for time has almost run out.PlatformsCrying Suns will be available at first on PC and Mac. We also planned to release the game on iPad soon after the desktop version.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Humble Bundle","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58597,"name":"LEGO DC Super-Villains","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28e/28e01713d78cd41d84a90e61d12aa00b.jpg","description":"It's good to be bad… Embark on an all-new DC/LEGO® adventure by becoming the best villain the universe has seen. Players will create and play as an all-new super-villain throughout the game, unleashing mischievous antics and wreaking havoc in an action-packed story. Set in an open world experience within the DC universe, the Justice League has disappeared, leaving Earth's protection to their counterparts, who have proclaimed themselves as the \"Justice Syndicate\". It's up to you and a crazy group of misfits to uncover the intentions of Earth's new, strange, wannabe superheroes. Joined by renowned DC Super-Villains: The Joker, Harley Quinn, and countless others from the Injustice League, players will set out on an epic adventure.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":46667,"name":"Octopath Traveler","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e23/e2345c839b323a94b6811705fda5af73.jpg","description":"Eight travelers. Eight adventures. Eight roles to play in a new world\r\nbrought to life by Square Enix. And now, you can enjoy all of them in\r\nthe new demo. Step into the shoes and live the stories of each of the\r\neight travelers and freely explore the world of Orsterra. Then, carry\r\nyour choices and adventure into the main game with save data transfer.\r\n\r\nUse each character’s special abilities in and out of battle. Break\r\nthrough enemy defenses by discovering and targeting weaknesses. Store\r\nBoost Points with each turn and then spend them at strategic times to\r\nstrengthen abilities, chain attacks, or provide aid. Choose the path you\r\nwish to walk and discover what lies beyond the horizon.\r\n\r\nExplore multiple, distinct RPG adventures in a world created by Square\r\nEnix\r\n\r\nChoose from eight characters, each with their own distinct story\r\n\r\nDeep, strategic turn-based combat with a layered battle system\r\n\r\nVisuals inspired by retro RPGs, brought to life with modern touches\r\nand a rousing, dynamic musical score","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":12891,"name":"Talisman: Digital Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/220/22073cc438f0fb97967a1b53fd58c920.jpg","description":"Talisman: Digital Edition is a video game adaptation of the fantasy board game of the same name. There have been four attempts to bring Talisman to digital media — Digital Edition is the fifth. The game uses the fourth version of the in-board-game rulebook and is officially approved by Games Workshop.\n\n###Gameplay\nThere are several modes to the title: one may either play with AI opponents or invite a partner to play locally — no more than one device is required. The game also features online multiplayer with 2-6 players. The gameplay consists of dice rolling and making moves while doing the actions envisaged by the in-game cards or the tiles the player occupies. There are several characters to play with different stats and multiple cards in the deck including events, stuff, and characters.  Each player picks a character (there is a total of 12 in the board version and 74 in Steam one) and starts a journey from own tile. \n\n###Plot\nThe story behind the dice rolling centers around the Talisman world in which the powerful wizard once reigned with the help of his Crown of Command. At the end of his rule, the wizard decided to transfer the magical power and thus reign to the one finding Crown first. Not only would the successors need to reach the Crown, but also to eliminate the other challenger for the throne.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":52369,"name":"Metal Gear Solid 3: Snake Eater","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2c6/2c60e20bebae94ee080bdf0993253b4d.jpg","description":"The story shifts back to 1964, the height of the Cold War. Naked Snake heads into Soviet territory to help the scientist Sokolov defect to the West. But due to the betrayal of Snake's mentor and mission advisor The Boss, a female soldier known as \"the Mother of Special Forces\", Naked Snake fails and heads back into the Soviet Union on a mission to kill The Boss... The third MGS game tells the story of men and women who struggle to remain loyal even while their fates are at the mercy of the ever changing political \"scene.\"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":2536,"name":"Axiom Verge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9d3/9d3f4145ee9931396ed189bdafacd8fb.jpg","description":"This is the action-adventure you’ve been waiting decades for.  After a lab accident, a scientist awakens in a mysterious, alien world.  Is this a distant planet?  The far future?  Or a complex virtual-reality computer simulation?\nPlumb the recesses of a large, labyrinthine world in order to learn its secrets and uncover your role within it.\nDiscover tons of weapons, items, and abilities, each with their own unique behaviors and usage.  You’ll need your wits to find them all.\nCombat bizarre biomechanoid constructs, the deadly fallout of an ancient war, and the demons of your own psyche.\nAnd finally, break the game itself by using glitches to corrupt foes and solve puzzles in the environment.\nLife. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\nIt's Axiom Verge.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Thomas Happ Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":423944,"name":"Call of Duty: Modern Warfare 2 Campaign Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/526/52604f43739e5280b8e7ba040ae2c855.jpg","description":"Relive the epic single-player Campaign from the 2009 blockbuster Call of Duty: Modern Warfare 2, remastered in true high-definition. Experience classic missions including Cliffhanger, The Gulag, and Whiskey Hotel as you join Soap, Price, Ghost and the rest of Task Force 141 in the globe-spanning fight to restore order to the world.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Infinity Ward","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":22934,"name":"Flight of the Amazon Queen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f03/f031bb8244dd6b6553cf110f435966de.jpg","description":"As Joe King, the pilot of the Amazon Queen, you must navigate your own fate in this point-and-click adventure brimming with fun-filled action. What began as a piece of cake job - flying a sexy movie star, Faye Russel to her next shooting location, soon turnes out to be a dangerous challenge, as you must outwit your unscrupulous rival the flying Dutchman and foil the plans of the evil genius Doctor Frank Ironstein… In the mysterious Amazon jungle you'll encounter a dangerous temple, fearsome Amazonian warriors, and a powerful mad scientist intent on taking over the world!\nIt's up to you to deal with the imminent threat of world domination … but be careful, or this may be the last Flight of the Amazon Queen!A classic point-and-click graphic adventure based on the much-loved adventure films of the '40s.\nExplore over 100 exotic locations and interact with over 40 wildly individual characters.\nWitty dialogues packed with sassy humor will make you laugh out loud.\nFull voice talkie featuring the talents of Brad Lavelle, Tom Hill, Bill Hootkins, Enn Reitel, Penelope Keith, Jon Coleman, Debbie Arnold and more!","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"MojoTouch","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":5550,"name":"Driver San Francisco","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cce/ccee39dd9977482f655f22ad35de61ce.jpg","description":"Driver: San Francisco is the fifth game in the Driver franchise. It is a game about chases with a crime thriller plot.\r\n\r\n###Plot\r\nPlotwise, Driver: San Francisco serves as a sequel to Driver 3 rather than the previous installment, Driver: Parallel Lines. As with the rest of the Driver series, the main character is John Tanner, a police detective, and a talented driver. Tanner is chasing the mobster Charles Jericho who survived the events of Driver 3. \r\n\r\nWhile awaiting trial in San Francisco, Jericho escapes the custody and wrecks chaos in the city. Tanner is injured and falls into a coma. While unconscious, the protagonist discovers he has a supernatural power to inhabit other people's bodies. It allows him to continue the chase.\r\n\r\n###Gameplay\r\nThe game is set in a thoroughly modeled San Francisco complete with its famous landmarks. Unlike in the three previous games, Tanner cannot leave the car and walk around. Instead, Driver: San Francisco introduces a new option called Shift, using which the protagonist instantly changes vehicles. This is explained as a supernatural ability to switch bodies. \r\n\r\nThe game also reintroduces the popular Film Director mode. It allows the player to replay his or her adventures using various cameras so that the walkthrough video looks almost like a movie.\r\n\r\n###Multiplayer\r\nThe game is the first in the series to introduce both local and online multiplayer. There are several modes that include a vehicular tag game and other variations of a competitive chase game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]}]