[{"id":2485,"name":"THE KING OF FIGHTERS 2000","genre":"Action","price":0.0,"description":"The existence of the secret society “NESTS” has finally been brought to light...\nWith terrorist attacks perpetrated here and there throughout the world, it didn't take a long time for Heidern's mercenary forces to guess that K’ and Maxima were behind these attacks. As the 'NESTS' organization is moving on to their next plan, and K' and Maxima join the KOF Tournament, called out as the officially invited team. Are these events just a coincidence, or are they being sponsored by 'NESTS' in the shadows?!\n'KOF 2000' brings back the elements that made the success of its prequel KOF ’99 a huge success, while making the gameplay more accessible to an even wider audience. Numerous hero characters from SNK's nostalgic franchises join 'KOF 2000' giving assistance to their team members via the new 'ACTIVE STRIKER' gameplay feature. Hone your skills and strategy with your favorite strikers, and put an end to the evil ambitions of 'NESTS'!\n1-2 players\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© SNK PLAYMORE CORPORATION ALL RIGHTS RESERVED.","imageUrl":"https://media.rawg.io/media/screenshots/f25/f25230a8e05d17230c7066724960442f.jpg","releaseYear":2000,"developer":"SNK","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Linux"}]},{"id":1840,"name":"Total War Battles: SHOGUN","genre":"Action","price":0.0,"description":"BUILD, BATTLE AND AVENGE!\nSpecifically developed for touchscreen platforms, Total War Battles™: SHOGUN is a new real-time strategy game from the makers of the award-winning Total War series.\nTotal War Battles™ delivers quick-fire, tactical combat balanced with intuitive building and unit management. All set in a beautifully illustrated Medieval Japan.\n“This high-quality production dramatically streamlines the RTS genre for mobile play, while making sure it's packed with enough tactical depth to make its many skirmishes tense and exciting”\nPocketGamer.com – 90% Gold Award\n“A refreshing change from the App Store's barrage of angry avians, physics-based puzzler and match-3 games.”\nTouchArcade – 4/5\n“Total War Battles is a surprisingly beautiful and engaging mix of war gaming and puzzles.”\nSlide To Play – 4/4\n1. COMPETE FOR THE SUPREMACY OF MEDIEVAL JAPAN\nLead your clan to battle through more than 10 hours of story-driven campaign set in the world of Total War™: SHOGUN 2; winner of “Best Strategy Game of 2011” awards from Gamespot, IGN, Gamespy and GameTrailers.\n2. BUILD YOUR ECONOMY\nDeploy and manage your bases to generate resources and recruit units including samurai, archers, ninjas and cavalry. Each victory awards XP to spend on building and troop upgrades that could make a decisive difference to your future battles.\n3. A UNIQUE TAKE ON REAL-TIME BATTLES\nTotal War Battles™ introduces a new real-time battle system that feels both familiar and fresh. The hex battle maps allow for natural unit movements and deep strategy. However, as followers of the “Bushido” code of conduct, your units can never turn back – this twist to classic RTS gameplay adds tension and intensity to the action, making each victory even more rewarding.\n4. DESIGNED FOR TOUCHSCREENS\nIntroducing an interface designed specifically for touchscreens – drag and drop buildings and troops, swipe across the battle map with a flick, and pinch to zoom in and out.\n5. 1Vs1 LOCAL MULTIPLAYER\nPlay against a friend in real-time on a single device in three different multiplayer modes.\n6. SKIRMISH MODE\nPlay through six standalone battles in Normal, Hard or Shogun difficulty. Compete against other players on the leaderboards and unlock new Skirmish achievements.\n7. STRATEGY FOR ALL\nTotal War™ fans will naturally enjoy the intense, deep and rewarding action-strategy gameplay, while more casual strategy fans will appreciate the Zen simplicity of the opening tutorial battles, scalable difficulty level and hint system that will soon make them a tactical master.\n8. UNIVERSAL APP\nThis iOS app is designed to scale its appearance for iPhone, iPod Touch and iPad, which means Total War Battles™ takes complete advantage of the iOS device that it's installed on.\n- - - - -\nPrivacy Policy: http://www.sega.com/mprivacy\nTerms of Use: http://www.sega.com/terms\n© SEGA. Creative Assembly, the Creative Assembly logo, Total War, Total War Battles and the Total War logo are either registered trade marks or trade marks of The Creative Assembly Limited. SEGA and the SEGA logo are either registered trade marks or trade marks of SEGA Holdings Co., Ltd. or its affiliates. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/9c9/9c9f16dfc0368aacb32c6cd8a7fc9f8e.jpeg","releaseYear":2012,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1492,"name":"Leo's Fortune","genre":"Action","price":0.0,"description":"App Store Best of 2014 and 2014 WWDC Apple Design Award winner!\nLeo’s Fortune is a platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.\n“Virtually flawless…could be called the best game on the platform” – 5 out of 5 Apple’N’Apps\n“Every level is meticulously detailed...Every scene looks simply spectacular” 5 out of 5 stars – Toucharcade\n“One of the most beautiful iOS games I’ve seen in a while…It will make you smile the instant you pick it up” 5 out of 5 stars Cult of Mac\n“I just returned home to find all my gold has been stolen! For some devious purpose, the thief has dropped pieces of my gold like breadcrumbs through the woods. Despite this pickle of a trap, I am left with no choice but to follow the trail. Whatever lies ahead, I must recover my fortune.” -Leopold\n\nVOYAGE through lush environments from mossy forests and arid deserts, to pirate cities and snowy mountains.\nSURVIVE vicious traps and solve physics-based puzzles through 24 levels of treacherous adventure.\n\nFOLLOW the trail of gold and uncover the truth behind Leo’s stolen fortune.\nFinish Leo’s Fortune to unlock Hard-core Mode: try to beat the whole game without dying to unlock a special prize! Compete with your Game Center friends to beat as many levels as you can in the fastest time possible.\nLeo’s Fortune supports iCloud game saves and Game Controllers made for iPhone, iPad, and iPod Touch. Game Controller support requires iOS 7 or later and is compatible with iPhone 5, iPhone 5s, iPhone 5c, iPad 2 or later, and iPod touch (5th generation).*\nAn internet connection prior to the start of level 7 will be necessary to complete the download of app data for Leo’s Fortune.\nJoin Leo’s community at\nhttp://facebook.com/LeosFortune\nhttp://twitter.com/LeosFortune\nhttp://youtube.com/LeosFortune\nQuestions or feedback?\nsupport@leosfortune.com\n*Certain Game Controllers have specific minimum device requirements. Check compatibility with your controller manufacturer.\nPrivacy Policy: http://www.leosfortune.com/privacy\nEULA: http://www.leosfortune.com/eula","imageUrl":"https://media.rawg.io/media/screenshots/369/369d405dd5facada8c63decb4be091ea.jpeg","releaseYear":2014,"developer":"1337 & Senri","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":1345,"name":"TurnOn","genre":"Action","price":0.0,"description":"The whole city has been plunged into darkness. After an accident in the power station, a living electric spark must restore electricity to the city and give citizens back their safe and carefree lives.\n\n\"TurnOn\" tells the spellbinding tale of a brave alien creature and its striking journey through blackout world. Featuring a charming art style and visual storytelling, cute character personality, and a soothing and magical soundtrack, \"TurnOn\" makes the world the way it was before, but a little better and kinder.FEATURES Setting! Be surprised how the world depends on electricity and what can happen if it suddenly disappears. Solve puzzles and figure out how to turn on the lights in every home, as well as fight unexpected enemies!\nVisual storytelling! Tired of all those dialogs in your video games? Never mind, in \"TurnOn\" everything is purely visual, and the entire story is told through what you see (and sometimes what you don't).\nPlatformer without platforms! The main character moves through the electrical wires. The mix of exploration and music levels makes the gameplay very immersive.The creation of “TurnOn” was inspired by the global movement Earth Hour, which is held by WWF.","imageUrl":"https://media.rawg.io/media/screenshots/8e6/8e6f6e3075db9e2dc96833f149481211.jpg","releaseYear":2016,"developer":"Brainy Studio","libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":987,"name":"Windlands","genre":"Adventure","price":0.0,"description":"A first person grappling hook exploration game.\nSoar through the ruins of a fallen world and discover the secrets of the ancients. Windlands has been developed primarily for Virtual Reality headsets, but is also a great experience for those without headsets.\nIt appeals to those who want to explore the breathtaking vistas at a relaxing pace, while the challenging routes attract gamers who like to master the skill of soaring through the towering environments at top speed.Gameplay Features\nDesigned and built for Virtual Reality First.\nGrappling Hooks Focused Movement.\nVariety of expansive levels that reward exploration.\nMultiple routes provide a range of optional challenges.\nOptional Skill based, Speed Runs and Time Trials with Leaderboards.\nGoal Driven Gameplay with Easy (Hook Anything), Normal and Hard Modes.\nCollectibles that reward exploration and completionism.\nCalm, Positive, Pressure-Free, Non-Violent, Zen like relaxing play.\nWARNING: Windlands is an intense (but awesome) experience in VR, it takes time to get your VR Legs, please take baby steps if you are sensitive to locomotion in VR play in very short sessions and perhaps try cages, sitting down and a controller if you are still effected, the second you feel a bit of nausea please stop and take a break","imageUrl":"https://media.rawg.io/media/screenshots/69b/69bb4c9bb693f5aaf2319eb81bfc110d.jpg","releaseYear":2016,"developer":"Psytec Games","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":861281,"name":"Ship of Fools","genre":"Action","price":0.0,"description":"Ship of Fools is a seafaring roguelite co-op game where you play the Fools, the only creatures fool enough to brave the sea. The Great Lighthouse that once protected the Archipelago is broken and a storm of malice and corruption is coming.\n\nTogether, you and your ship mate will jump aboard The Stormstrider and make your voyage across the sea. Man the cannons, ready your sails and protect your ship from sea monsters over multiple runs. It’s up to you to defend your home from the almighty Aquapocalypse.\n\nIn a clamshell, Ship of Fools is a game about blasting away your seaborne foes with mighty cannons as you defend your ship. Inspired by modern classic roguelites and built for co-op, you’ll want to bring your first mate on deck and enjoy oarsome combat as you unlock new trinkets and artifacts to help you save the world from catastrophe.\n\n\n\nDesigned for co-op play, frantic combat encounters with the horrifying creatures of the storm will test your teamwork. Work together to defend and repair the ship, combine item effects in powerful combos and make sure you have your shipmate’s back if you don’t want to become fish food.\n\n\n\nUncover lost treasures and remote shops on the islands of the Archipelago, but plan your moves carefully! As you chart your way through the sector, the Everlasting Storm shifts and changes, blocking your paths with its fury. You’ll need to adjust your course in reaction to storm movements and decide when you can brave a trip to discover what lurks inside the storm.\n\n\n\nMan your ship as a solo sailor and fight your way through dangerous waters and keep the glory for yourself, Ship of Fools offers solo play as well as multiplayer. As they sing in old sailor songs: it’s sometimes better to have no crew than a dysfunctional one!\n\n\n\nWith many Fools to play with, unique items to find and unlock, combat encounters to fight in and many islands to visit, each run will bring something new to your voyage. Bolster your strength each time, ready to defeat the monsters of the deep sea.\n\nKey Features\n\nFrantic nautical combat with another shipmate in co-op or as a solo sailor\nColossal leviathans to challenge the hardiest of sailors\nChart your route through the maps of the Archipelago and brave the Everlasting Storm\nEmbody one of the unique Fools with special abilities to help you on your journey\n100+ trinkets and artifacts to collect and combo for winning strategies\nSwashbuckling hand-drawn artwork to put the wind in your sails","imageUrl":"https://media.rawg.io/media/games/ce0/ce067de617e94b6f3c94f445b440ec1b.jpg","releaseYear":2022,"developer":"Fika Productions","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":823549,"name":"FIFA 23","genre":"Simulation","price":0.0,"description":"FIFA 23 brings The World’s Game to the pitch, with HyperMotion2 Technology that delivers even more gameplay realism, men’s and women’s FIFA World Cup™ coming during the season, women’s club teams, cross-play features, and more.","imageUrl":"https://media.rawg.io/media/games/dbc/dbcb05bcdf104264db35de68d1e73909.jpg","releaseYear":2022,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":674318,"name":"Ship Graveyard Simulator: Prologue","genre":"Action","price":0.0,"description":"CHECK OUT ANOTHER FREE PROLOGUEhttps://store.steampowered.com/app/1286880/Ship_Graveyard_Simulator/\nhttps://store.steampowered.com/app/1433570/Car_Detailing_Simulator/\nhttps://store.steampowered.com/app/1239320/Animal_Shelter/\nhttps://store.steampowered.com/app/1279240/Police_Shootout/\nAbout the Gamehttps://store.steampowered.com/app/671970/Junkyard_Simulator/\nhttps://store.steampowered.com/app/1442450/Monsters_Domain/\nVisit the largest ship graveyard in the world. A dozen kilometers of beach filled with wrecks. Hundreds of ships wrecked on the coast. Thousands of tons of steel. Choose the most valuable ship for you and start the adventure. Play as one of the workers during the most dangerous work in the world. Cut, hit, weld! Dismantle the whole ship and sell the obtained parts and upgrade your equipment.\nExplore all decks of the ship for valuable items. Take advantage of the opportunity to explore the mysterious spaces hidden inside these amazing colossi.\nThe job of a worker dismantling ships is one of the most dangerous in the world. Demolition with only basic tools. Contact with toxic substances.\nYou can sell or exchange the acquired items for other items.\nBe careful, you can have a serious accident or even die at any time","imageUrl":"https://media.rawg.io/media/screenshots/78f/78fa3bc10353451b72da76d3dbc32222.jpg","releaseYear":2021,"developer":"Games Incubator","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":649076,"name":"PowerSlave Exhumed","genre":"Action","price":0.0,"description":"PowerSlave: Exhumed is a KEX Engine port of the classic console game perfectly blending both the PlayStation & Saturn versions.\nDestination: The ancient Egyptian city of Karnak. Alien forces possessing horrifying powers have sealed off the once thriving community from all outside contact. As a covert operations specialist, you have been trained for all forms of contingencies. Nothing can prepare you, however, for the nightmare you are about to enter...\nNew Features:\nWidescreen / HD Display\nModern gamepad support\nSMAA Antialiasing\nAnisotropic texture filtering\nAchievements\nVulkan / DirectX 11 graphics API\nSmooth object interpolation for high refresh rate monitors\nBoth versions of the original game combined to bring the best of both worlds","imageUrl":"https://media.rawg.io/media/screenshots/7c1/7c1753696cdcefc3cde6de6f5ee91335.jpg","releaseYear":2022,"developer":"Nightdive Studios","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"SEGA Saturn"}]},{"id":622652,"name":"Police Simulator: Patrol Officers","genre":"Simulation","price":0.0,"description":"Welcome to Brighton! Join the police force of this ficticious American city and experience the day to day life of a police officer. Start with citing violations and giving out parking tickets, then work your way towards shouldering more responsibilities. Be part of the community of Brighton, get to know your neighborhood and handle daily police work to fight crime during your shift. Always be tough, but fair: respect the law and gain more experience to unlock more neighbourhoods, districts and duties.\nPolice Simulator: Patrol Officers includes a dynamic traffic system that organically creates the traffic flow and car accidents, as well as emergency situations that can randomly pop up during your shift. Be ready to react at a moment’s notice! In the Open World of Brighton you will be able to choose neighborhoods for your patrols and make sure to keep them safe. With the Intuition System your police officer will be able to pick up important clues during witness interrogations that could lead you to resolve situations the right way, so make sure you pay attention to everything being said and done. Police Simulator: Patrol Officers offers a Simulation mode for experienced players looking for the most authentic experience, as well as a casual mode for those looking for a more relaxing patrol in the streets of Brighton.\nThe game includes:\nTraffic system that organically creates accidents, speeding vehicles, traffic jams and other traffic violations like crossing a red light and more\nExplore the first district and its neighborhoods\nVarious duties such as car accidents, parking regulations, emergency callouts, traffic violations, wanted people and roadblocks\nProgression to unlock neighborhoods, cars and modes\nCasual and Simulation game modes\nIntuition System","imageUrl":"https://media.rawg.io/media/games/b92/b92d5db85b7b787eafcfe4627dc991d5.jpg","releaseYear":2021,"developer":"Aesir Interactive","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":586123,"name":"My Catgirl Maid Thinks She Runs the Place","genre":"Casual","price":0.0,"description":"Story\n“My Catgirl Maid Thinks She Runs The Place” is a slice of life comedy with a little heart thrown in for good measure.\nIn this rejected fairy tail romance, our heroes, a depressed mid-20s office worker and an energetic catgirl from another world named Cynthia, begin their life together in a small one bedroom apartment. Shenanigans ensue.\nOver time, the two grow closer and closer but as Cynthia’s past comes more to light, the two’s relationship is called into question. Can they overcome the trial or will their hearts forever be worlds apart?\nFeatures\n130,000 word Visual Novel - 4-6 hrs of content\nNameable MC - The goofier the name the better! Trust me.\nMultiple Endings - Can you navigate the relationship and get a good ending or will you get the bad ending?\nCG Gallery - Relive past humorous or nudey moments in our lovely CG Gallery\nFun and Bright Soundtrack - Thanks to royalty-free magician, Kevin MacLeod","imageUrl":"https://media.rawg.io/media/games/356/356e3153c61f31ad7b18b2d8caaf904b.jpg","releaseYear":2021,"developer":"Uncle Artie","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":428941,"name":"Titan Chaser","genre":"Simulation","price":0.0,"description":"Every night you left motel and drive through empty fields, looking for something.\nYour job is to scout wondering giants and drive them away from sleeping town using light.\nIt's a meditative experience, where you don't need to manage fuel and car maintenance, health or damage, just find where to drive and how to use your tools effectively.","imageUrl":"https://media.rawg.io/media/screenshots/d31/d3104070ede645fb3f0b48bdd010fd1f.jpg","releaseYear":2021,"developer":"Stas Shostak","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":428137,"name":"Astronarch","genre":"RPG","price":0.0,"description":"A fusion of roguelikes and auto-battlers like never before seen. Recruit a party of mysterious heroes, navigate deadly lands, collect an arsenal of magical items, and vanquish a new evil threatening the realm!\nFeaturesParty-Based Strategy: Select from a pool of unique heroes, each with skills which inspire vastly different strategies and customization. Position your heroes on the battlefield to influence the outcome of battle.\nExplore Dynamic Terrain: Each playthrough provides a new journey, changing not only your path, but the bosses you must conquer. Freely move between 3 subareas in each act, rewarding those with the knowledge of where their party can flourish, and where it will falter.\nLoot!: Collect ancient and magical items which augment your party's stats and abilities. Should your Wildmage be a glass cannon, or a front line bruiser? The decision is yours.\nEarly Access to Astronarch currently comes with:10 Unique and mysterious heroes.\n60+ Mystical items for your arsenal.\n50+ Combat encounters, including 3 elites, and 3 boss fights.\n15+ Intriguing map events to be discovered.\n1 Act containing 3 subareas, each with different enemies and terrain.\nAll future content free of charge, with 2 more acts in development.","imageUrl":"https://media.rawg.io/media/screenshots/370/3709d529051087d7680a42abcf204728.jpg","releaseYear":2020,"developer":"Dale Turner","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":409784,"name":"The Indifferent Wonder of an Edible Place","genre":"Adventure","price":0.0,"description":"The Indifferent Wonder of an Edible Place is a short, interactive tale about a building eater consuming a tower on the edge of the town of Matsyapura. Using a blend of descriptive text and surrealist visuals it is our attempt to ponder the violence of erasure and the profound grief of having to survive on the margins of history.\nIn 1960 when the state of Bombay split like an egg on the jagged edge of the Western Ghats and formed the territories of Gujarat and Maharashtra, the town of Matsyapura was abandoned by government decree - to make it easier to draw a clean border between the new states.\nMir UmarHassan, the fabled Gujarati poet, lamented this willful and violent erasure of an ancient town and in a delightful satirical poem titled : The Building Eaters of Matsyapur, he wrote about the vapid consumption of a place and the creation of a populace that is devoid of the flavors of their individual and munificent past.\nWith recent cause to recollect the horror of the demolition of Babri Masjid in Ayodhya, and in solidarity with the protests against the draconian actions of our government - we are revisiting UmarHassan's original poem.\nCreated with support from Phoenix, Leicester.  A site-specific variant of the game was displayed at Phoenix, Leicester. And at the Video Game Art Gallery in Chicago.","imageUrl":"https://media.rawg.io/media/screenshots/899/8992f5a5f300acc6397a8b5575bf9744.jpg","releaseYear":2020,"developer":"Studio Oleomingus","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":349905,"name":"Watchers","genre":"Action","price":0.0,"description":"Fight to the end. Influence the battle even after death. Place bets, mete out rewards and punishments and decide what happens next. It’s a battle with something for everyone.\n\nWATCHERS is a free-to-play Battle Royale top-down shooter where killed battlers remain in play thanks to the game's unique Watcher game mode.\n\nBATTLER mode:\n— 24-player top-down Battle Royale action.\n— An unpredictable outcome: the fewer battlers survive, the more Watchers there are to plan and carry out all sorts of experiments that can turn the tide of the battle.\n— The Watchers are watching your every move! Earn their favor, and they might just help you out when you’re in a tight spot!\n\nWATCHER mode:\n— A special mode that players enter after being killed.\n— Bet on your favorite surviving battler.\n— Influence the battle using anomalies and experiments.","imageUrl":"https://media.rawg.io/media/screenshots/28d/28dfe0e2f843b1735e938e03ae7db5de.jpg","releaseYear":2019,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":347823,"name":"Tomb Raider: The Times Exclusive Playable Level","genre":"Action","price":0.0,"description":"Purchase this PS one® Classic and play it on both your PS Vita™ and PSP® (PlayStation®Portable) systems!\nA bonus level released by The Times newspaper for the 75th anniversary Tutankhamun's tomb discovery.","imageUrl":"https://media.rawg.io/media/games/e42/e42bece2c3aa5cdb0480dd3b389ac971.jpg","releaseYear":1999,"developer":"Eidos Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":310852,"name":"Drift86","genre":"Racing","price":0.0,"description":"Get in the mythical 86 and prove you're worthy of this car!\nIn Drift86 you will have to master the art of Drift. Try to make the biggest combo on music that will make you want to press the accelerator.\n\"Driving technique is not something you can get in a few days\"\nFeatures :\n■ The mythical AE86 car!\n■ A great unique circuit!\n■ Addictive drift system!\n■ Transmission system and speedometer in km/h of the car!\n■ Eurobeat !","imageUrl":"https://media.rawg.io/media/screenshots/fab/fab17d44d5f1c536fe7396912ee44e12.jpg","releaseYear":2019,"developer":"Rewindapp","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":299566,"name":"Hentai Mosaique Vip Room","genre":"Action","price":0.0,"description":"Undressing puzzle game! Match the pieces and unlock new stages, each with less clothing. No need to move pieces around, just rotate them! Use abilities to solve puzzle quicker. All the girls notice what you do and comment on your progress.\nFeatures:\n• 20 Puzzles\n\n• 5 Abilities that help you solve the puzzle quicker\n\n• Ability Skill Tree\n\n• Don't ever get stuck! Use the sneak peak ability to uncover the missing pieces!\n\n• Click on abilities to restore them quicker\n\n• Girl chit-chat\n• 100 Achievements\n• Each stage gets more challenging\nSo How does this game work?\n• Complete the images by putting them in the right orientation.\n• You can rotate the squares to the right or to the left.\n• In the advanced levels the squares are mirrored by rotating them several times.\n• A stage is complete as soon as all fields are in the right orientation.\n• By successfully finishing a stage the following adjacent stage will be unlocked.\n• Each new stage consists of more rotating squares than the previous one.\n• During the game you get MANA which enables you to use different abilities and EXPERIENCE, that allows you to level those abilities.\n• For example the PEEK ability highlights all wrongly oriented squares and SOLVE BOMB rotates all adjacent squares into the right position\n• You can always leave the abilities unused if you feel like completing the picture without them\n• The game saves your progress, but you can always delete your save from the game, if you really want to\nArist: Lil\nMusic: Lukhash","imageUrl":"https://media.rawg.io/media/screenshots/4f8/4f8232c7fe2c29e8a7037602a0bdb6db.jpg","releaseYear":2019,"developer":"Lil Hentai Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":281342,"name":"Car Parking Multiplayer","genre":"Simulation","price":0.0,"description":"Car Parking Multiplayer, not only about parking:\n*86 Parking Levels with unique environment, car and real life challenges;\n*60+ Cars with detailed interior\n*Free Walking\n*Car tunings\n*Car Vinyls\n*Free Drive Mode\n*MultiPlayer Free Drive Mode\n*MultiPlayer Racing\n*Exchange car with friend\n*Chat\n*Friend List\n*Big Environment (Desert, Highway, City, Village)\n*Home with Interior and dog :)\n*Voice Chat\n*Police Mode\nThousands of players are waiting for you.\nJoin us!","imageUrl":"https://media.rawg.io/media/screenshots/906/9064630f2c343ef86f8910fe55c878eb_8WZ8s7b.jpg","releaseYear":2018,"developer":"Aidana Kengbeiil","libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":248486,"name":"Weedcraft Inc","genre":"Strategy","price":0.0,"description":"Weedcraft Inc explores the business of producing, breeding and selling weed in America, delving deep into the financial, political and cultural aspects of the country's complex relationship with this troublesome and promising plant.\nWould-be Mary Jane moguls will need to prioritize resources carefully as they manage the production and distribution of their weed. Cultivate killer plants, cross-breed them to create unique strains of the devil’s lettuce, hire and manage a growing staff, and be prepared to take on the competition. As in real life, the business of bud presents plenty of opportunity along with a plethora of problems. Decide when and where to take on extra risk to maximize profit, but be careful, the cops and politicians are all working their own angles.\nAn important, controversial topic presented in an insightful and detailed manner, Weedcraft Inc presents a challenge to those would rule the reefer offering a series of diverse scenarios and unique characters to work with (or around) as your budding empire grows. Whether you choose to hobnob with politicians, pay off the po-po, fight for medical marijuana rights or work the legal system, it’s all in the name of the sticky icky and your cutthroat corporate profits.","imageUrl":"https://media.rawg.io/media/screenshots/564/56483ab33e644c0fa5ac4981db47202b.jpg","releaseYear":2019,"developer":"Vile Monarch","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":63700,"name":"CrocoMars","genre":"Action","price":0.0,"description":"More games by Anatoliy Loginovskikhhttps://store.steampowered.com/app/838390/Merry_Glade/\nhttps://store.steampowered.com/app/474820/The_Magical_Silence/\nAbout the GameCrocoMars is a top-down shooter for the colonization of Mars by reptilians, executed in pixel graphics.\nYou will find exciting adventure and crazy battles. You will pass through pain and betrayal, through defeat and mushrooms.\nFeatures:\n• nice pixmap graphics and animation\n• full hardcore\n• no saving, only your skill will help you survive!\n• Three species of Mushrooms that do not affect anything.\n• an intriguing plot\n• pain\nFrom the author.\nArthouse look at the colonization of Mars ... Reptiloid, Captain Deer, Flying Octopus, Mushrooms and Pain ... I could not film, so I made a game.\nMars is a wonderful planet. I was not on Mars, but I'm sure that the Mushrooms grow there and the Flying Octopuses live. And beneath the surface are the Talking Stones.\nIf you want to be the first to colonize Mars, then you must be a Reptiloid. But most likely, you are not a Reptiloid ... If you were a Reptiloid, then you would have a friend Captain Deer who betrayed you ...\nThis game is about the difficult fate of one Reptiloid, who has the honor to capture Mars.\nDo you want Cracker? If so, go to the store ... And do not forget to buy milk!","imageUrl":"https://media.rawg.io/media/screenshots/d10/d1021c135e247fb97afc889cac76337b.jpg","releaseYear":2018,"developer":"Anatoliy Loginovskikh","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":58791,"name":"Metal Wolf Chaos XD","genre":"Action","price":0.0,"description":"The country is in peril as President Michael Wilson defends the nation against a full-scale rebellion led by Vice-President Richard Hawk and the mechanized legions he commands. As the 47th President of the United States, it is your sworn duty to take your country back by any means necessary and end this unjust coup d'etat! Battle in your advanced mech - armed to the teeth - across iconic American landscapes including the Brooklyn Bridge, the Grand Canyon, and the front steps of the White House.\nFromSoftware originally released Metal Wolf Chaos in December 2004, appearing exclusively on the original Xbox and only in Japan. The game went on to become somewhat of a legend as it was hard to acquire and even harder to play outside of Japan with most fans experience of the game through YouTube videos and the occasional screenshot. Devolver Digital and FromSoftware have partnered together with developer General Arcade to modernize Metal Wolf Chaos with updates to the game including upgraded visual fidelity, refined controls and gameplay, a new save system, and 4K + 16:9 support for modern displays.\nMech America Great Again\nUnleash the full power of the legendary Metal Wolf battle mech using every last bit of firepower at your disposal and put a stop to this traitorous rebellion!\nModernized and Remastered\nMeticulously updated visuals with improvements to resolution , select textures , and visuals effects that are brought to life in a new widescreen format with 1080p and 4K support, where applicable. Gameplay improvements, a new save system, and optimization deliver the definitive Metal Wolf Chaos experience.\nDynamic Combat with an Upgradeable Mech\nA carefully planned strategy will lead you to victory, and full-on destruction will lead to pure exhilaration. Swap out weapons on the fly for a tactical advantage. Develop and upgrade your weapons to carry an arsenal of over 100 different combinations into battle.","imageUrl":"https://media.rawg.io/media/screenshots/b9d/b9db8d44425083b3d4726f9223b14d8c.jpg","releaseYear":2019,"developer":"Devolver Digital","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":53394,"name":"Mario Party","genre":"Board Games","price":0.0,"description":"Mario Party (Japanese: マリオパーティ, Hepburn: Mario Pāti) is a party video game series featuring Mario franchise characters in which four human- or computer-controlled characters compete in a board game interspersed with minigames. The series was developed by Hudson Soft and published by Nintendo; the arcade version was developed by Capcom. The series is known for its party game elements, including the often-unpredictable multiplayer modes that allow play with up to four (and sometimes eight) human players.\nAfter the development of Mario Party 8, several of Hudson Soft's key designers left to work for Nintendo subsidiary Nd Cube, developers of Wii Party. Starting in 2012 with Mario Party 9, Nd Cube has taken over development of the series from Hudson Soft. The latest title in the series, Mario Party: Star Rush, was released in 2016 for the Nintendo 3DS.\nThe series currently holds the record for the longest-running minigame series. As of December 2014, Nintendo reported cumulative worldwide sales of 39.6 million game copies in the Mario Party franchise.","imageUrl":"https://media.rawg.io/media/games/576/576759570d5f9e67d4f1398e73a79bef.jpg","releaseYear":1998,"developer":"Hudson Soft","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Game Boy Advance"}]},{"id":52423,"name":"Galaxian","genre":"Shooter","price":0.0,"description":"Galaxian (ギャラクシアン, Gyarakushian) is an arcade game that was developed by Namco and released in October 1979. It was published by Namco in Japan and imported to North America by Midway that December. A fixed-shooter game in which the player controls a spaceship at the bottom of the screen, and shoots enemies descending in various directions, it was designed to compete with Taito Corporation's successful earlier game Space Invaders (which was released in the previous year, and also imported to the US by Midway Games).\nThe game was highly popular for Namco upon its release, and has been a focus of competitive gaming ever since. It spawned a successful sequel, Galaga, in 1981, and the lesser-known Gaplus and Galaga '88 in 1984 and 1987 respectively, as well as many later ports and adaptations. Along with its immediate sequel, it was one of the most popular games during the golden age of arcade video games.","imageUrl":"https://media.rawg.io/media/games/07c/07c5bb431361d64b66831d4a29c87be2.jpg","releaseYear":1979,"developer":"NAMCO","libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Wii"},{"id":0,"name":"Apple II"},{"id":0,"name":"Atari 8-bit"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Atari 5200"},{"id":0,"name":"NES"}]},{"id":51607,"name":"The World Ends with You: Final Remix","genre":"Action","price":0.0,"description":"Final Remix is the Nintendo Switch port of The World Ends with You, a supernatural urban fantasy game. Its visual style was inspired by Japanese anime and youth culture.\n\n###Plot\nThe game is set in Shibuya, a fashionable district of Tokyo, Japan. The World Ends with You takes place in a parallel spirits' world version of Shibuya, called the Underworld. This place is controlled by the spirits called the Reapers. They are led by the mysterious Composer, who administer the Game. In the Game, souls of recently deceased people can cooperate by fighting monsters called “Noises” that represent the negative energy of the human minds. The players have to put at stake the thing they cherish the most, be it their body, best friends, or memory. If the player wins the Game, he or she may choose to become alive again or to become a new Reaper. The game follows Neku, a dead teenage boy who enters the game and tries to save not only himself but also his friends.\n\n###Gameplay\nThe player controls Neku, who is usually followed by a companion, as they walk through various locations in the Underworld of Shibuya and fights monsters. The plot is delivered through numerous cutscenes stylized as colorized manga pages. The Japanese street fashion and culture have a great influence on the gameplay. Wearing certain popular brands can grant the main character the upper hand in combat. Neku can also make a brand fashionable by winning battles while wearing it.\n\n###Final Remix\nThe new version is released for Nintendo Switch. It features new controls that allow the player to use Joy-Con. Final Remix also includes a new scenario.","imageUrl":"https://media.rawg.io/media/screenshots/021/0211232346867e8a99ea443c839c3e8c.jpg","releaseYear":2018,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":47248,"name":"Star Traders: Frontiers","genre":"RPG","price":0.0,"description":"Command your ship and crew as a space pirate, merchant, bounty hunter, and more in Star Traders: Frontiers – an epic space RPG from Trese Brothers Games. Venture forth into a massive open universe, rich with adventure and the lore of the Star Traders. Choose your path by assembling and commanding your custom crew and spaceship in a constantly evolving galaxy torn by internal strife, political intrigue, and alien threats. Will you fly as a pirate terrorizing shipping lanes, join the solar wars as a military captain, or track targets across the stars as a fearsome bounty hunter?\nExplore a rich, open universe:  Discover endless procedurally-generated galactic maps, meet unique characters, and take on enemies to conquer the galaxy!\nBecome an intergalactic captain:  Take on the role of a spy, smuggler, explorer, pirate, merchant, bounty hunter, and more (21 jobs total)!\nCustomize your own spaceship:  Choose from more than 300 upgrades and build your very own vessel to venture across the vast reaches of space.\nAssemble and tailor a loyal crew: Assign talents and equip specialized gear for every spaceship crew member.\nExperience an ever-changing narrative: Decide to make friends or foes with other factions and influence political, economic, and personal vendettas.\nFirst there was the Exodus – when survivors of a great war left the ruins  of the Galactic Core behind in search of a new home in the stars. Scattered worlds were claimed on the fringe of the galaxy. Each pocket of survivors held on to an isolated set of worlds while trying to rebuild under the great law of Shalun. Three centuries later, technology has brought them back together again. Discovery of the hyperwarp has bridged what was once an unimaginable distance between far-flung colonies, long-lost families, and political factions.\nWith that reunification has come great economic prosperity. The hyperwarp reestablished the transportation of cargo, goods, and technologies between the quadrants – but it has also brought great strife. Political rivalries have been rekindled, blood has been shed in age-old feuds, and the fires of war have been stoked. Amidst the political infighting, a ruthless revolution is rising – and the fervent explorers of the hyperwarp have awoken something that was better left asleep.\nOur very first game, Star Traders RPG, took hundreds of thousands of gamers on an interstellar adventure. Star Traders’ success and overwhelmingly positive reception helped to launch Trese Brothers Games. It was the adventures of our community’s star-crossed captains that put us on a trajectory to share more of our worlds, ideas, and dreams.\nWe set out to capture the loneliness, bravery, and camaraderie of people living together in a spaceship sailing across the stars. It is with great pride that after releasing four other games in the Star Traders universe, we’ve created a sequel to the original Star Traders RPG.\nStep onto the bridge of your starship, take to the stars, and create your own story in Star Traders: Frontiers.","imageUrl":"https://media.rawg.io/media/screenshots/2cc/2cc4b28acc09b8024859f6ef6594cd35.jpg","releaseYear":2019,"developer":"Trese Brothers","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":46750,"name":"Mugsters","genre":"Action","price":0.0,"description":"Aliens have taken over the planet and enslaved humanity. Only you have the know-how to drive back the dastardly threat, free your fellow Earthlings and SAVE THE WORLD.\nMugsters is a physics-based, supercharged, action-packed puzzler with sandbox levels where you must outrun, out-manoeuvre and outsmart your enemies by experimenting with different vehicles, environmental traps and explosives.\nMugsters is focused your creativity. Break out the prisoners, collect the crystals and get the heck out of dodge any way you can!Key Features\nFAST PACED ACTION! - Tackle a variety of dangers across a series of ingenious levels.  Watch out for alien abduction rays, rocket turrets and a myriad of traps whilst escaping the pesky invaders who are forever on your heels.\nPHYSICS! – Experiment with a physics-based, sandbox environment. Complete your objectives as you see fit, and throw in a few exploding barrels for good measure.\nVEHICLES! – With more than 30 types of vehicles at your disposal; you can ram, lance, shred and shoot your way to freedom as you sock it to the extraterrestrial terrors.\nPUZZLES!– It takes brains to survive these hostile islands. Use a mixture of explosives, traps and vehicles to save the humans, collect crystals and fly the hell out of there. Just try not to run yourself over!\nMULTIPLAYER!– Team up and take on this world-dominating menace with a friend. All the single campaign missions are fully remixed for full two-player local co-op action!","imageUrl":"https://media.rawg.io/media/screenshots/133/1339be1dabf8bafc83da3c05e4b18ca7.jpg","releaseYear":2018,"developer":"Team17 Digital","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":46663,"name":"Iron Marines","genre":"Action","price":0.0,"description":"From the creators of the award winner Kingdom Rush trilogy comes the most extraordinary space odyssey.\nA real-time, dynamic and deep strategy game that will transport you to amazing and unknown planets. Immersive, engaging gameplay, ridiculously appealing art, and a touch of silly humor. Brave soldiers, mighty mechas and powerful aliens await your command to face the greatest challenges.\nRecruit and train the greatest heroes in the galaxy, lead them into dangerous missions against near impossible odds and unleash their mighty powers and abilities. Adapt your strategy by changing the role of your troops even in the thick of the combat, from ranger to sniper, from flamethrowers to missile launchers. Turn the tide of battle with bomb strikes, intelligent mines, support troops, turrets and a wide range of special weapons.\nArmies of robots, crushed starships, gigantic monsters, unknown races, brave assaults, desperate rescues, audacious sabotages... the galaxy needs your command.\nThe galaxy needs the Iron MarinesGame Features\nLead your troops in 21 campaign missions across three different worlds. Get ready to launch bold attacks, hold your ground, rescue civilians, hack supercomputers and all kind of heroic stuff. Each mission requires new tactics and actions to achieve victory.\nTest your wit on 21 Special Operations with their own combat rules and no mercy at all. Each stage a challenge to remember, with scars to prove it. We dare you.\nUnlock the Impossible Mode. Only for the most reckless of the dauntless. We double dare you.\nDefeat massive and unique Bosses in epic battles. They are mean, they are really really huge and they are determined to crush you. Suit up, Marines!!\n40+ Upgrades to improve your strategy and empower your units with defense drones, napalm rockets, ricocheting blasts and much more.\n14 Heroes with outstanding powers at your command. Train them to their full awesomeness or annoy them at your own risk.\n8 Special Weapons to unleash hell on your enemies and give your tactics even more depth. What’s better than a well placed missile? An orbital strike of 50 high explosive missiles!\nComplete any of our 70+ Achievements and claim your well deserved reward.\nFind your fair challenge choosing your difficulty mode: Casual, Normal or Veteran. Don’t get cocky! Or Do! Your choice!\nDozens of interactive easter eggs for you to find!","imageUrl":"https://media.rawg.io/media/games/a9a/a9a7f661ee02f572fa9cc4e137dee4df.jpeg","releaseYear":2017,"developer":"Ironhide Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":46187,"name":"Hoo-Boy","genre":"Adventure","price":0.0,"description":"Hoo-Boy!\nWant sweeter?\nHoo-Boy - A platformer game about the adventures of a candy boy hailing from Candy-Land.\nJump on platforms, avoid traps, defeat enemies, collect coins and find secrets together with our brave hero in his amazing adventure!\n- 25 Levels.\n- Enemies and traps.\n- Customization.\n- Find easter eggs and portal in Candy-Land.","imageUrl":"https://media.rawg.io/media/screenshots/cc0/cc01b7c78ce68d16ec830e9bdf48981d.jpg","releaseYear":2017,"developer":"Anatoly Konstantinov","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":42259,"name":"March of War","genre":"Strategy","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/aa5/aa5d5c4d4babb48b175fcc8406aadf13.jpg","releaseYear":2013,"developer":"ISOTX","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":41438,"name":"Might & Magic: Duel of Champions","genre":"Desconocido","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/screenshots/a49/a497a17054159666fed4914b9f5cdaba.jpg","releaseYear":2012,"developer":"Ubisoft Quebec","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":41324,"name":"SimCity (2013)","genre":"Strategy","price":0.0,"description":"The defining city simulation is back! Create the city you desire and make the choices that shape your city and power the Sims within it. Every decision, big or small, has real consequences. Invest in heavy industry and your economy will soar—but at the expense of your Sims’ health as pollution spreads. Implement green technology and improve your Sims’ lives while risking higher taxes and unemployment. Team up with your friends to solve global challenges: launch a space shuttle, reduce carbon emissions, or build magnificent wonders. Compete on global and regional leader boards to be the richest, the dirtiest, the happiest or the best place to visit!","imageUrl":"https://media.rawg.io/media/games/3ba/3ba021b9bb61fba58add8da0760fa764.jpg","releaseYear":2013,"developer":"Maxis","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28351,"name":"Wreckateer","genre":"Action","price":0.0,"description":"Featuring Avatar FameStar! Wreckateer uses the Kinect to put you in control of a massive castle-wrecking Ballista. With the help of Wreck and Tinker, use 6 magic projectiles to travel the land and destroy 60 castles.","imageUrl":"https://media.rawg.io/media/screenshots/656/6563b38ce7e8b35cb61ef3144027a804.jpg","releaseYear":2012,"developer":"Iron Galaxy","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28022,"name":"Snipperclips - Cut it out, together!","genre":"Puzzle","price":0.0,"description":"Hey, cut it out! No, really! In this action-puzzle game, paper pals Snip\nand Clip must cut each other up to overcome tricky obstacles…or just to\nlaugh their heads off (sometimes literally). Partner up with friends or\nfamily to cut the heroes into the right shapes, interact with objects,\nand solve a world of imaginative puzzles.\n\nSomeone grab a paper weight—these puzzles just won't stay still! The\nonly limitation to solve puzzles is your imagination. Snip may need to\ncut Clip into a needle to pop balloons, or maybe they'll have to team up\nto form a squawking, egg-laying bird!\n\nWhen playing together, prove you're a cut above the rest in Blitz mode,\nwhere 2-4 players* can compete in a series of puzzlingly action-packed\nchallenges. Three is never a crowd when you're paper thin, so make it a\nparty! In Party mode, up to four players* can team up to solve tough\nchallenges. Ready or not, this couch co-op is a riot, any way you cut it!","imageUrl":"https://media.rawg.io/media/screenshots/706/7068196eb5089a05caecc45e5bdd36e5.jpg","releaseYear":2017,"developer":"SFB Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":22721,"name":"I.G.I. 2: Covert Strike","genre":"Action","price":0.0,"description":"As the Cold War drew to a close, the world believed that peace would reign across the globe. It seemed that a new age had dawned, an age of lasting unity between nations, but this was not the case. Instead the fight for global supremacy had only been forced underground into the battlefield of covert ops and evil acts of terror.\nInto this arena sprung a new force. Masked behind the guises of subterfuge, plausible deniability and information management, the Institute for Geotactical Intelligence raised the sword against those who would subjugate the world.\nThough the malignancy of terrorism has broken our world on occasion, the global crucible has not yet boiled over into World War III. For that thank the one-man army David Jones and the forever-unsung heroes of IGI.\nMultiplayer notice: online multiplayer mode is available after register your unique CD-key for the game. For details see: Support.A great first-person shooter with a touch of stealth\nOver 30 authentic weapons\nCreate you own plan and find your own way through the challenging campaign","imageUrl":"https://media.rawg.io/media/games/2f6/2f632bc88df0563d74affce0a31ad744.jpg","releaseYear":2003,"developer":"Innerloop Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21985,"name":"Get To The Orange Door","genre":"Action","price":0.0,"description":"In Get To The Orange Door, you must use your parkour, cloning, and time control abilities to reach the orange door at the end of each level. Seems simple enough, but you will soon understand just how challenging the game can be. Intelligent A.I., challenging obstacles, and numerous other twists and turns cause for a difficult yet enjoyable experience.\nFight through three separate worlds, each with a unique art and playstyle\nGet To The Orange Door Features:\n- A full campaign, spanning over three separate worlds, each with a unique art and playstyle\n- Horde Mode: an endless wave shooter that gets harder the longer you survive\n- Classic Mode: A one-shot, one-kill parkour shooter reminiscent of GTTOD when it was first being concepted\n- Challenge Maps: Crazy, bizarre, and challenging maps meant to test and train your skills in GTTOD\n- The Edge: An open world map with many challenges and places to explore\n- Multiple Enemy types\n- Over 20 weapons\n- Player Abilties such as time control and self-cloning\n- A full Titanfall-esq parkour system (sliding, clambering, wall-running, etc)\n- A simple play-how-you-want style, beat the game in which-ever order you choose\n- Key rebinding and controller support\nGet To The Orange Door is set to be fully released sometime in Summer of 2017. Stay tuned!","imageUrl":"https://media.rawg.io/media/screenshots/488/488408eccc60d27f7a0a7d9180e0b267.jpg","releaseYear":-1,"developer":"Andrew Smith","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20751,"name":"The Few","genre":"Strategy","price":0.0,"description":"Take command over RAF during the WW2 history turning point, the Battle of Britain!\nThe goal of the game is to defend Great Britain against German bombing raids.\nThe game has two distinct gameplay experiences where:\n* The player manages war production and squadron placement\n* The player organizes patrol routes and tactics\nOnce combat is initiated the player can lead their squadrons to attack waves of German bombers utilizing simple touch or mouse commands.\nThe game follows the historical timeline very closely, but at the same time - the game mechanics are easy to learn (yet hard to master) and it provides great entertainment for both seasoned and novice players.\n* There are 8 aircraft types in the game - including of course the famous Supermarine Spitfire!\n* Every pilot is earning his own experience - witness your rookies become aces!\n* Manage the British war machine - decide what should be built and where\n* Fight epic air battles!\n* Lead English, Polish, Czechs, Canadian and New Zealands squadrons to fight for freedom!\nThe game implements ‘German Command AI” which results in each campaign playing out differently. No two games will ever be the same.","imageUrl":"https://media.rawg.io/media/screenshots/2c5/2c510f2068f5a9047dbdc6c56f610efd.jpg","releaseYear":2014,"developer":"BlackMoon Design","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20147,"name":"Dead Sky","genre":"Action","price":0.0,"description":"Dead Sky takes place admist the chaos of a mysterious outbreak where you will fight tooth-and-nail through hordes of undead creatures in order to escape the epidemic and survive. At its core, Dead Sky is an action-packed survival shooter that ties in several strategic tower defense elements. The gameplay consists of a satisfying mix between defending objectives and staying alive within contaminated territory by using the variety of powerful weapons, structures, upgrades, and power-ups at your disposal. In online cooperative play, you and up to 3 friends will team up to fight your way through several environments and the unique challenges they present. Using teamwork, strategy, and quick reflexes, you will work together to defeat the powerful and mutated enemies that cross your path.\nFeatures\n________________________________________\n• Experience the excitement of a fast-paced top down shooter infused with strategic aspects of tower defense\n• Craft a variety of turrets, traps, and barricades to add to your defensive parameter\n• Gain the edge you need with randomly dropped power-ups and weapons\n• Randomly generated mobs and boss encounters provide a unique experience every time you play\n• Fight against a wide variety of enemy types with unique abilities and attack synergies that always keep the action fresh\n• Compete via online leaderboards to see how you rank against other players\n• Play online in cooperative multiplayer mode with up to 3 of your friends and survive as long as you can","imageUrl":"https://media.rawg.io/media/screenshots/e47/e475a45b106eb4b628c1a6e173d08682.jpg","releaseYear":2013,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":20076,"name":"Space Moth DX","genre":"Action","price":0.0,"description":"Space Moth DX\nSpace Moth DX is the definitive edition of 1CC Games' intense arcade shoot 'em up, with a brand new DX Mode that will put even veteran bullet dodging skills to the test! Beginners are catered for as well, with a rebalanced Arcade Mode that's just right for anyone looking to get started with bullet hell games.\nLaser Insecticide\nFact: everything is better with lasers. So we put lasers on over 30 angry giant insects who want to stop you, Space Moth, from escaping Earth and going to the Moon. Show them who's boss and blast your way into space!\nUltimate Control\nEight directions. Three buttons. Keyboard, controller and arcade stick support. The freedom to remap any setup as you please. Jump straight into the game without having to worry about finger gymnastics!\nSatisfying Scoring\nBatter the bad guys with a missile barrage until they turn neon, then finish them off with your super laser for a massive bonus! But be careful: neon enemies are much more aggressive!\nTough Love\nSpace Moth will challenge you, fiercely. But Space Moth also wants to help you improve, so you can overcome those challenges. Your current condition (position, bombs and lives remaining) will be saved at the start of each stage and boss fight. Then if you lose all of your lives, you will be given the option to return to the condition recorded in the most recent save. But be warned: your score will be reset!\nProg Rock Prodigy\nSpace Moth mixes up the indie game music scene with a soundtrack that's less NES chiptune or Amiga tracker, and more Tangerine Dream.\nProper Pixel Art\nWhen was the last time most indie graphics artists sat down and played a game on a real CRT? For 1CC games, the answer is today. So you won't find any mixed-resolution assets or showy shader effects, just proper pixel art!","imageUrl":"https://media.rawg.io/media/screenshots/fb4/fb4119252cba846d3a1397cbea24769d.jpg","releaseYear":2016,"developer":"1CC Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19971,"name":"Queen's Quest: Tower of Darkness","genre":"Adventure","price":0.0,"description":"Queen's Quest: Tower of Darkness is an exciting adventure game inspired by one of the Grimms' Fairy Tales, taking place in a faraway realm full of magic, wonders and otherworldly creatures.\nThe idyllic life of the royal heiress and her husband is shattered when a demonic sorcerer arrives at their palace to kidnap their newborn daughter.\nMagnus, the godfather, saves our heroine with his magic, but Prince Henrik gets turned into stone, while the intruder escapes with the royal heir.\nWho is the sorcerer? Why did he kidnap the child? Is there a connection between the kidnapping and Prince Henrik's not so glorious past?\nTime is pressing. To save her family, our heroine will have to prove her mettle and act like a true queen. She will have to embark on a long journey through picturesque lands, solve numerous puzzles, meet many intriguing characters and discover the truth about a terrible curse that had befallen her family.\nCan she break the spell cast on her husband and retrieve her daughter?\nFeaturesTest your intellect in various mini-games and puzzles!\nChallenge yourself with 34 riddles and HO scenes!\nA group of unusual characters will accompany you on your journey through 27 locations!\nSolve the mystery of the princess' kidnapping!\nBecome a master by unlocking 22 achievements!","imageUrl":"https://media.rawg.io/media/screenshots/d98/d98e017a273a8faa0e8b4f21af1a883e.jpg","releaseYear":2015,"developer":"Artifex Mundi","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]}]