[{"id":14409,"name":"CPUCores :: Maximize Your FPS","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/822/8222faaf59f83cb1eeed4cc964ba0684.jpg","description":"Just UpdatedCPUCores fully supports VR-based games!\nCPUCores fully supports all launcher-based games including Skyrim, Minecraft, GTA-V, and more!\nFully supports Steam-based games as well as non-Steam games and applications!\nAbout the Software\nCPUCores automatically detects all of your Steam games.  It also automatically integrates with Steam's ability to launch a game.  You simply have to run CPUCores from within Steam, select the Steam game you wish to run optimally, then click the \"START GAME\" button within CPUCores.  That's it!\nCPUCores does multiple things to optimize your OS.  To start, CPUCores will isolate your entire OS to your first core.  Secondly, CPUCores examines and constrains key Windows services that are not essential and known to hog CPU resources.  Third, CPUCores examines and isolate key Windows processes to ensure a perfect balance of CPU savings without starving key Windows processes.\nCPUCores will isolate and dedicate processing cores to be exclusively used by your game.  In addition, CPUCores will allow game-specific hyper-thread disabling/enabling.  Further, advanced options allow you to be specific in what processing cores and/or hyper-threads you want you game to use (or not use).\nCPUCores examines what non-OS and non-game operations your PC is running.  It will do things such as constrain non-game programs to your first processing core.  Also, CPUCores will constrain the resources used of common web browsers and flash players.  So go ahead, watch your favorite Twitch streams and Youtube videos without fear of FPS drops!\nCPUCores is constantly being updated with new features, enhancements, and overall changes to maximize your gaming FPS.  One such change is support for Twitch streaming.  With CPUCores, you can isolate OBS to specific CPU consumption, disallowing it from robbing precious CPU resources that your game could be using.  So go ahead and stream to Twitch without any unplanned FPS drops!\nCPUCores gives your games max CPU power to enable you to reach max FPS.\nWith CPUCores, you will be able to dedicate CPU resources towards your gaming, thus enabling your game to hit the maximum FPS possible on your PC hardware.  CPUCores does this by intelligently controlling certain OS functions, non-game programs, and dedicated resources to be used explicitly by your game.\nUse CPUCores to:\nIsolate your Operating System to it's a non-gaming CPU processing core\nIsolate your non-gaming programs (Web browser, music streaming, etc.) to share resources with your OS-limited processing core\nDedicated multiple processing cores to be exclusively used for gaming\nHave the ability to eliminate potentially inefficient and under-performing CPU \"Hyperthreading\" for a particular game\nEnsure your video game has 100% of a processing core, versus Operating System default (often only 60%-90%)\n... Maximize your FPS!OS Default (without CPUCores):\nYour OS works to balance CPU energy consumption, power efficiency, and heat generation, with the end result being that a default Windows OS will often balance CPU consumption across all your cpu core processors, little by little. For example, if you look at your Windows Task Manager right now, you will likely see CPU usage between 2-20% across all of your processor cores. This is great for keeping all your cpu cores relatively cool as well as be more efficient with regards to energy consumption. However, this is at the cost of CPU POWER when gaming!\nThe End Result:\nYour are at the mercy of how your PC decides to mix and match Windows processes, misc. applications, and your games. This will inevitably lead towards a reduced performance potential that your PC hardware could offer up for your game to use.\nWith CPUCores Turbocharging Your Games:\nThe CPUCores application identifies dozens of Windows programs, background processes, and non-gaming applications, and immediately controls and isolates them to a subsection of your total CPU resources. CPUCores will then free up a block of CPU resources and dedicated it specifically for a game. You can then launch a Steam game, or any game/program, directly via the CPUCores application. This enables CPUCores to control the processor usage for that game/program and ensure it has dedicated usage to processing cores. Your game no longer has to share resources with the OS / other applications.\nThe End Result:\nFor single-threaded games: Before the application may have had 70-90% access to a CPU processor, it now has near 100% access to a processor. This enables your game to take full advantage of your CPU core, thus enabling it to reach it's highest FPS potential on your system. The net benefit can be up to 30% more CPU power for that game!\nFor games that operate on 2 cores (or more): Your game can now have unlimited access to all the remaining cores on your system without any sharing of CPU access to your core Windows installation or other applications on your PC.\nCPUCores has a lot of features build specifically for gamers!\nFull Steam Integration - Just run CPUCores and it will auto-detect all your Steam games!\nSupport for non-Steam games - A simple click of a button allows you to use any non-Steam game by selecting the .exe for the specific game!\nSupport for general, non-game applications - Use CPUCores with any application including video editing, databases, virtual machines, and more!\nConvenient game sorting options makes large Steam libraries manageable!\nIncredible community surrounding the software!\nDirect contact with the developer for suggestions on feature updates!\nContinual development with free software updates!What PC Hardware/Game Benefits The Most (Most FPS Gains)?\nThere are 3 determining factors that come into play with regards to CPU-driven FPS in a game:\nYour PC CPU Hardware:   Do you have 2 cores?  4 cores?  Or more?\nYour specific game threading:  Does it use 1 CPU only?  Or is it multi-threaded?\nYour specific game being CPU or GPU heavy:  Is your game very CPU heavy?  Or GPU heavy?  Or both?If you have a Dual Core (2 core) CPU and a game that supports 1 CPU (single thread) then you will likely see a nice benefit.  This is because CPUCores will give that game a dedicated CPU processor, just for itself.\nIf you have a Quad Core (4 core) CPU and a game that supports 1 or more threads (multi-threaded) which is CPU heavy then you will likely see a nice benefit.  This benefit occurs as CPUCores will constrain OS and non-game processes while giving dedicated CPU access to your game.  Note:  The very latest high-end quad core CPUs may not receive much of a benefit as they are known to be extremely fast on their own, so much so that high-end games are, at this point, not CPU resource bound.\nHowever, if your PC has 6 cores OC'd to over 9Ghz with 10 SSDs in Raid A(wesome) with 4x GPUs then you likely won't receive that much benefit from using CPUCores. But by all means, go ahead :)   You could say that CPUCores is best suited for low/medium/high but not ultra high-end systems.FPS Improvements:\nThe impact of how CPUCores will help with FPS depends on essentially 2 things:  #1  Your PC Hardware, and #2  The game itself.   That being said, here are some benchmarks we've recently seen from testing on a Dual Core (2 core) medium-level PC System:\nARMA III = 17.5% FPS Increase!\nTeam Fortress 2 - 58% FPS Increase!\nTombraider - 6.3% FPS Increase\nLeft 4 Dead 2  -  14%  FPS Increase\nYou can see videos of these benchmarks on the Benchmark Thread on our Steam Forums.\nAutomatic Steam Integration:\nAutomatic Steam Integration GRID MODE:\nEasy Steam Library Search Function:\nWorks With All Non-Steam Games:\nWorks With Non-Game Applications:","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tim Sullivan","platforms":[{"id":0,"name":"PC"}]},{"id":13059,"name":"Feel The Snow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/546/546d6bc029653fcf630fcc840255e377.jpg","description":"Feel the snow is a sandbox action-adventure game with an exciting storyline, dynamic combat system, RPG and survival components. Choose one of the characters and start your journey. The game has many interesting things in store: building, crafting, puzzles, bosses, mystery, laughs, quests etc.Game features:\nExciting storyline. Explore this unique world, meet new friends, fight dark creatures, laugh and solve puzzles.\nDynamic combat system. Most games are focused on surviving, disregarding complexed and exciting combat system, but Feel The Snow's battles will not get you bored! Cause you will have a great variety of weapons, skills and magic.\nSandbox Elements. Build a cozy house of your dreams, craft weapons to protect it from your enemies.\nCo-op support for up to four players! Bring your friends on the adventure by inviting them directly via Steam! Game Characters:The main two characters are Annie and Willie, cute and friendly snow creatures, which feel quite comfortable in extreme winter climate.\nBesides two main characters, you can find some other characters, which can be unlocked while walking through the game.\nGame World:The game’s world is a generated randomly. The entire game is drawn in pixel art which is charming. Every new location is a new adventure, new meetings and exciting situations.\nThe further you get, the more interesting and unusual will be the world around you.\nSupport: owletplay@gmail.com","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Owlet","platforms":[{"id":0,"name":"PC"}]},{"id":10523,"name":"InfiniPicross","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a94/a947d770d73ae1828f78b3d6e8962a0a.jpg","description":"InfiniPicross is a picross game, a family of games based on solving grid puzzles through hints and logical deduction. It supports all reasonable sizes and a staggering amount of levels for each of them. It can also be played with various themes, whether taken from the numerous default ones or created with the in-game theme editor.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ReverseImpact","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10146,"name":"Anyland","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f11/f11a9f6f86ce23d112457128e972d954.jpg","description":"Anyland is an open virtual reality universe to create your home, chat with others, explore & live in! Made from the ground up for VR, and shaped by all of us together.\nAnyland is a blank canvas for your imagination with no predefined stories and themes... it's up to all of us together to invent the world. Build, script, share, collect, meet friends, have parties, play games, watch videos, explore areas, and make history in a new reality!\nWe are two indie devs & VR enthusiasts and this is our labor of love. We hope to say hi to you in Anyland! If there's anything you need, let us know please, and thanks for being in Anyland!\nPlease note Anyland is free to download, chat & explore. You also get a free 1-week trial of the creation tools, and after that, can decide if you want to buy the creation tools for one year, or if you want to continue to freely chat & explore. Buying the creation tools will help us cover our server costs, so thanks if you get them!\nAnyland has a sibling called Manyland.\n[First video's music by Rimsky. Second and thid video's music by Kevin MacLeod of Incompetech.com with a Creative Commons license. Related keywords: vr modeling, mmo, crafting, roleplay. Greetings to the robot & makers of Job Simulator. Thanks!]","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Scott Lowe","platforms":[{"id":0,"name":"PC"}]},{"id":4214,"name":"Sports Champions 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b9/4b9e312d9a63ea3b305085b2925fceff.jpg","description":"SPORTS CHAMPIONS™ 2 – THIS TIME IT’S SERIOUS\nPut friendship and family ties aside and battle for honor in six fun-filled events. Anyone can take part, but who will have the skills to become a true sports champion?\nFeatures:\n•\tUse one or two PlayStation®Move motion controllers to defeat your rivals at golf, boxing, bowling, skiing, tennis and archery.\n•\tHost customizable tournaments where you pick the rules in new Party Play mode.\n•\tCreate your own character and see how your stats measure up against the opposition.\n•\tTrack your progress on the online leaderboards and post your sporting triumphs on Facebook.\nImportant Notices:\n•\tA PlayStation®Move motion controller and PlayStation®Eye camera are required to play this game.\n•\tIn three of the sports, an optional second motion controller can be used by each player. Up to four motion controllers can be used in total.\n•\tThis game is playable in 2D or 3D. To enjoy stereoscopic 3D features, you will require a 3D TV that supports 3D stereoscopic display and 3D compatible glasses.\n•\tSwing over to us.playstation.com to find out more about PlayStation®Move and the Sports Champions™ series on PlayStation®3.\nCompatibility Notices:\n1-4 Players, HDD: 32MB Minimum, HDTV Screen Resolution: 720p, Network Features, PlayStation®Move Required, 3D Compatible\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n© 2012 Sony Computer Entertainment America LLC. Sports Champions is a trademark of Sony Computer Entertainment America LLC.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":971889,"name":"Spells & Secrets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b71/b717a6ebd811a790f4478be84087f7d2.jpg","description":"Discord:\nAbout the GameSpells & Secrets is a deep and motivating rogue-lite experience that invites everyone to this rewarding genre with its adventure story. Free the wizard Academy of Greifenstein from magical creatures by using your spells in creative ways. Play in local co-op with your friends or family, customize your own character, solve mysteries and find powerful artifacts in this modern magical world.\nUse the numerous spells in creative ways to fight off magical creatures or to solve puzzles.\nIf you're tired of venturing alone, ask a friend to join you and discover the world of \"Spells & Secrets\" in local co-op or online via Steam-Remote!\n⚠️For co-op, two controllers are required.  ⚠️\nDive deep into character customization and unlock more possibilities with a variety of options:\nSelect a unique body type that represents you best.\nDress in your preferred clothes, offering freedom beyond gender boundaries.\nCraft your face from a vast selection: pick your eye color, shape of eyebrows and more, all designed to be gender-neutral.\nYour nose and eye shapes adapt based on your facial selections.\nPlay with hair colors: mix and match up to two shades for a distinctive look.\nFind the perfect skin tone from our diverse range.\nAccessorize with an array of items to enhance your style.\nAdjust height to suit your vision of the character.\nApply makeup that complements your chosen features.\nUse your spells creatively against magical creatures or to solve puzzles.\nCreate your character from extensive options and unlock more possibilities.\nSave and help your classmates.\nExplore the ever-changing school castle Greifenstein.\nFind many clues about the world & its inhabitants.\nImprove your character permanently.\nFind powerful artifacts and use useful potions.\nPlay in 2-player local co-op mode or online via Steam Remote Play.\nExperience optimized controller and mouse & keyboard controls.\nIn “Spells & Secrets”, you are a first-year student of the magic arts, arriving at the Academy of Greifenstein. Set in a world and time like ours, you are excited to live and learn together with your fellow students and professors at the impressive magical castle.\nA strange incident on your first day throws the school into turmoil. It’s up to you to save the ever-changing castle and rescue your lost schoolmates. Use your spells creatively to fight off magical creatures, explore the school grounds and uncover the castle’s secrets to reveal the mystery surrounding it.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"rokaplay","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":846442,"name":"Train Sim World 3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2f1/2f1696be27b8deed7e6283bab12af839.jpg","description":"MASTER THE MACHINE\n\nConquer American mountains as you haul incredible tonnage with the workhorses of industry, get the British capital’s commuters to work in record time and race state-to-state aboard German high-speed traction. Play your own way with creative tools. Master the machine with Train Sim World 3.\nRAW POWER\n\nHaul hundreds of containers through California deserts and mountains with the ES44C4, a 4400-horsepower beast dressed in bold BNSF livery. Experience the thrill of 280 km/h in the ICE 1, Germany’s first true high-speed train, as you cut through the Hesse and Bavaria countryside. Combine precision and versatility with the Class 395 ‘Javelin’, Britain’s fastest train running passengers to and from London at 140mph.\n\nEXTREME WEATHER\n\nNew volumetric skies bring a transformed atmosphere to routes, clouds roam free at altitude, casting shadows on the ground. Lightning dances among intense storms, the roar of thunder competing with the hefty sound of machinery. Feel total immersion as the turbulence of wind physics hammers the side of your train. Learn the art of defensive driving and remain in control.\n\nYOUR HOBBY\n\nWith multiple trains per route, there is no end to the experiences on offer, and you can expand that further by creating your own journey with Scenario Planner and Livery Designer. Paint trains however you desire and run on them on any route with Off the Rails mode, then share your creations with the Creators Club.\n\nYour collection also comes with you. All Train Sim World 2 content is available to play in Train Sim World 3, and any Add-Ons which you have yet to explore can be added at any time.Key Features\nOperate the ES44C4, conquer the 85-mile Cajon Pass\nRace in the ICE 1, over the 186-km Schnellfahrstrecke Kassel - Würzburg\nDrive the Class 395 across the 89-mile Southeastern Highspeed\nExperience more with over 9 trains to control\nHighly detailed, feature-rich, driving cabs\nTrue-to-life performance and handling\nLearn all there is to know about trains in the Training Centre\nTake on challenges across Scenarios and Timetabled Services\nBask under new, volumetric skies\nBattle with realistic weather, such as lighting and wind physics\nCustomise with the Livery Designer and Scenario Planner, and share on Creators Club\nPowered by Dovetail Games’ proprietary SimuGraph® vehicle dynamics engine and Unreal Engine 4® technology","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Dovetail Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":826879,"name":"Foretales","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4dd/4ddb74ac318d64e759fbf9dadfcf492b.jpg","description":"A terrible curse is ravaging the realm and the only one who can stop it is a small-time thief named Volepain.\nThe Weaver entrusted the instruments of creation to her children, the Nymphants.\nThe Weaver put in the hands of her children the fate of the world’s creation and stability. The instruments of creation have the power to create and destroy the many worlds of Foretales. Discover the true goals of the Nymphants and the Cult or embrace the Maelstorm for eternity!\nForetales tells the story of a world doomed by a dark prophecy. With the clock ticking on the apocalypse, it’s up to you to decide how to use what little time is left.\nIf you want to find the path to salvation, you’ll need to decide what’s best for you and your companions!\nFeaturing:\nEXPANSIVE BRANCHING STORYLINES WITH MULTIPLE ENDINGS\nCARD-BASED GAMEPLAY\nDECKSPLORATION GAMEPLAY\nUNIQUE “BOARD GAME” FEEL\nSUPERB ARTISTIC DIRECTION\nORIGINAL SCORE BY CHRISTOPHE HÉRAL (RAYMAN, BEYOND GOOD & EVIL)\nTURN-BASED CARD COMBAT\nGREAT REPLAY VALUE\nORIGINAL STORY AND WORLD\nHUGE CAST OF CHARACTERS\nNARRATION BY TRAVIS WILLINGHAM (CRITICAL ROLE, The Legend of Vox Machina)","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Alkemi","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":485114,"name":"Angel Legion","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fde/fdec1d1cf01635a5c6918a65a512393a.jpg","description":"A mysterious figure appeared on the command ship of the Hunter HQ.\nAccording to a Demigod who did not want to be named, this guest had traveled from a distant planet and claimed to be a saint who had witnessed miracles and was only loyal to her beliefs. On the battlefield, her glorious posture encouraged her allies to advance.\nJoan of Arc debut！\nEmbark on an adventurous journey with commanders from all over the universe!\nLead your Angel team to reveal the ancient mysteries of the universe……\n#Game Features#\nTenka Fubu, Oda Nubunaga, serves as your sword!\nNew Angel state: Insulation\nGorgeous scene, Extreme experience\n3D dynamic scene, unlock when stage passed.\nVast Ocean of Stars, Immersive gaming experience.\nIdle Anywhere\nIdle anytime you want, play anywhere you wish.\nAngel squad will fight for you automatically when you’re away.\nJust wait and relax, you will be rewarded with huge amount of treasures.\nCustomize faces of Heroes, Collect exquisite fashion\nYou can customize heroes’ faces as you like.\nShare the exquisite fashions with all your Angels.\nEvolving trick, Changing strategy\nYou can summon nearly a hundred powerful heroes！\nForming a powerful Angel Squad, forging perfect equipments, and releasing effective skills to stand out in the Star Alliance.\nBoundless universe is waiting for you to explore\nIn Angel Legion, not only can you explore the vast universe, you can also participate in Battlefield trials, you could even carry out the Expedition. Discover amazing treasure while you enjoying diverse gameplays.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Shanghai SilverMoon Network Technology Co.Ltd","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":485043,"name":"Incremental Adventures","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67f/67f90ad4bbc36583a01d441c96008a5b.jpg","description":"Lead your heroes in their neverending adventures!\nIncremental Adventures is a minimalistic Idle game where combat is fully automated. It's up to you to make the most of that automation to reach extremely high numbers!\nFeatures:\n- Fully automated turn based combat with multiple classes\n- Two prestige systems (both layered)\n- Advanced customizable automation\n- Extremely high numbers (double exponents are no exception)\n- Fully simulated offline progress\n- No repetitive \"clicking\" to progress\n- Unfolding gameplay mechanics that require you to adjust your strategies as you progress\n- Oh and it's completely free to play. While it does offer purchases to speed up aspects of the game and support the developer, the game is tested and balanced without any purchases. Major milestones never require real money to be achieved\nAfter 1 million game-plays on Kongregate, and a year of continued development after release, now available on Steam!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Gniller","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":393192,"name":"My Friend is a Raven","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e83/e836f43e3dbe818e484a1b0034647d78.jpg","description":"Play as Lutum, the last man alive after a devastating plague has swept the Earth clean.\nThe world of man has fallen into ruins.  Everyone that was once alive, now lies in their grave, returned to the Earth that they were born of.   You return to your old apartment one last time, in search of a sickened raven.  You must speak to him, and discover why such a calamity has spread across the world.\nComplete different puzzles, to unlock all four unique endings, and uncover the whole story behind Lutum, and the elusive raven.\nIf you've enjoyed My Friend is a Raven, you should check out my current project, My Beautiful Paper Smile!\nhttps://store.steampowered.com/app/1036700/My_Beautiful_Paper_Smile/","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Two Star Games","platforms":[{"id":0,"name":"PC"}]},{"id":379546,"name":"Sinking Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fc/8fc1542f913fd3cfa56b0fa05db5f99e.jpg","description":"The sequel to the unfinished Sinking Simulator, now with a lot more POWER!!!!\nWitness your witty love of chaos and destruction sinking 2D ships and everything else on board!\nWith one of the most advanced and optimized soft body physics, enjoy the absolute madness of destroying massive soft body structures into oblivion, ones that even dwarfs the empire state building or the Eiffel Tower!The game requires Java 8","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Wicpar","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":67684,"name":"Dungeon Hunter 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/307/3073e0271fdc919c9ee446a9fb8de63f.jpg","description":"Do you fight for good? Or for the gold?\nFate has thrust the land into an age of chaos that ushered in the rise of darkness. Now, the people must fend for themselves against bandits, monsters and other unspeakable terrors. However, for mercenaries and bounty hunters, this is an age of unbridled opportunity and prosperity, for justice always demands a high price, and their business has never been better!\nAN EPIC SOLO CAMPAIGN\no   Hunt down monsters and villains through all 94 missions of this expansive story.\no   Discover a variety of environments, from the shattered realm of Valenthia to the cold and barbarous Valen Outpost.\nFIGHT WITH FRIENDS\no   Rally up to 3 other players to fight side-by-side in co-op mode.\no   Hire friends as Allies to help you along your journey of vengeance.\nUNLOCK LEGENDARY POWERS\no   Wield over 900 pieces of armor and weaponry.\no   Unleash hundreds of devastating spells and skills.\no   Master the Elements by strategically equipping the best spells and gear for each mission.\nBUILD, DEFEND & RAID\no   Protect your loot with over 60 Trap Rooms and 230 different Minions.\no   Craft more powerful defenders by collecting Minion Shards in co-op mode.\no   Upgrade your Trap Rooms and DARE your rivals to try and break through.\nALWAYS A NEW CHALLENGE\no   Take on Daily and Weekly Events for more fun and huge rewards.\no   How far can you go in the Trial of Elements?\no   Climb the Leaderboard to earn mighty rewards in the Legendary Hunts.\no   Unlock unique rewards in special seasonal events.\n*IMPORTANT* Dungeon Hunter 5 requires an iPad 2 (or newer), iPhone 4s (or newer), or iPod touch 5th generation. An Internet connection is required to play.\n_____________________________________________\nVisit our official site at http://gmlft.co/website_EN\nCheck out the new blog at http://gmlft.co/central\nDon't forget to follow us on social media:\nFacebook: http://gmlft.co/SNS_FB_EN\nTwitter: http://gmlft.co/SNS_TW_EN\nInstagram: http://gmlft.co/GL_SNS_IG\nYouTube: http://gmlft.co/GL_SNS_YT\nThis app allows you to purchase virtual items within the app and may contain third party advertisements that may redirect you to a third party site.\nTerms of Use: http://www.gameloft.com/en/conditions-of-use\nPrivacy Policy: http://www.gameloft.com/en/privacy-notice\nEnd-User License Agreement: http://www.gameloft.com/en/eula","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":61161,"name":"Outpost Zero","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/716/716867f33c95789e3e5cd1298ba05cd6.jpg","description":"Outpost Zero blends the genres of Multiplayer Base Building Survival and Simulation games in a Sci-Fi universe.\nYou and your robotic crewmates were sent to this planet for one purpose - to prepare a working habitat for the future waves of human colonists eager to escape the dying earth. Gaiya's untold natural resources are a juicy target for interstellar big business. Healthy competition among competing corporations drive the dangerous expeditions. Will you succeed in establishing a profitable foothold on this mysterious world, or will the perils of Gaiya and the ruthless corporations out to exploit her natural resources be too much for you to handle?\nCommand. Colonize. Survive.\nFight against a variety of native alien creatures, and defend your base against roving bands of pirates and enemy raiders. Attack rival players’ strongholds to destroy their operations and loot their resources. Craft upgraded weapons and armor, and lead AI squadmates into battle against your enemies.\nWith skill and cunning, this hostile planet can be transformed into a thriving colony with a fully functioning society of AI robots. Setup mining outposts, harvest resources, create supply chains, and build a stable economy with automated factories to create essential goods for your survival. Create a base for safe refuge and infrastructure to keep your AI outfitted, healthy, and happy.\nConstruct robots and train them to defend your outpost. Keep your Outpost running at peak efficiency by crafting gear and assigning jobs to your crewmates. Build them luxurious quarters and raise their morale by entertaining them and satisfying their needs. Lead them into battle, and set them up to defend your base from invaders. Build a society of happy, efficient, and powerful robot citizens.\nContend with the threatening world of Gaiya as it continually tries to destroy everything you've built. Weather dangerous sandstorms, take shelter from meteor showers, survive deadly earthquakes, and cower before the might of an erupting volcano. Use your engineering skills to build a base that can withstand anything this dangerous planet can throw at it, from pirate raids to rampaging beasts, and keep yourself and your crewmates safe and sound in the sheltering walls of your outpost.\nAs you evolve your colony from survival to dominate the local ecosystem, you will have access to higher tiers of items. A full RPG stat system gives you limitless possibilities in how you outfit yourself and your AI robots. Build railguns, powered armor, jetpacks, mining lasers, gliders, jump boots, shield generators, massive battery packs, and more as you augment your robotic frame to be the ultimate power on the planet. Create, train, and outfit expert weapon and armorsmith robots that can craft super-powered weaponry and gear for your forces. Then take the fight to the deadly creatures populating the most hostile areas of the world, and take down prehistoric monsters undreamed of on Earth, as well as rival Outposts and pirate hideouts swarming with unfriendly foes.\nForm a corporation and invite your friends to join, giving them all control of the robots and automated facilities in the base. Set other corporations to allied, neutral, or rival status, and wage war against them. Measure your corporation's worth on the server in leaderboards that indicate who is currently winning the economic war on Gaiya. Contend with anarchist space pirates intent on stealing your hard won natural resources, and fend off higher and higher level attacks as your outpost value skyrockets, weathering constant raids against you when you become the leading power on the server.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Symmetric Games","platforms":[{"id":0,"name":"PC"}]},{"id":59233,"name":"Destiny 2: Forsaken","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68c/68c7bafb388dc19348bc694ae55919a5.jpg","description":"Following years of strife, what remains of the Reef has fallen to lawlessness. You and Cayde-6 are sent to personally investigate the recent unrest. Upon arrival, you soon discover the most-wanted criminals in the Prison of Elders have organized an escape. Beyond the Vanguard’s authority, you’ll pursue these fugitives deep into the Reef. Explore new regions, awaken new powers, earn powerful weapons, and uncover long lost Awoken secrets. The hunt is on.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":52891,"name":"Driver 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a40/a40c7623f6521dd30e739edfc4fd2fbb.jpg","description":"Driver 2: Back on the Streets (named Driver 2: The Wheelman Is Back in North America) is the second installment of the Driver video game series. It was developed by Reflections Interactive and published by Infogrames. A port to the Game Boy Advance was released in 2002, being developed by Sennari Interactive and was released under Infogrames' Atari range of products.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Ubisoft Reflections","platforms":[{"id":0,"name":"PlayStation"}]},{"id":43861,"name":"The Drone Racing League: High Voltage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/841/841cbaae9ca3e4b99b4c5b1f700d7f30.jpg","description":"FLY THE WORLDS FASTEST DRONES\nHome to the fastest drones on the planet, the Drone Racing League is proud to offer players the most electrifying FPV drone racing game ever: DRL High Voltage!\n\nRACE KILLER TRACKS\nRace on supercharged tracks, designed by the pros, for the pros, and master the skills that could take you to the big leagues! That's right! The best High Voltage pilots compete for a chance to take on and stun real world champions, in real life Drone Racing League events!\n\nEARLY ACCESS BONUS\nAll Early Access players will receive:\nThe Drone Racing League Season 2 Maps will be released throughout the season free of charge\nRacer3 free trial during Early Access period\nFeatures:\n• Learn new skills and practice them using the all new Mission System\n• Find all Freestyle Mode\n• Race real-life DRL courses and maps based on current and previous seasons (coming soon)\n• Explore all new Maps\n• Real-time Multiplayer (coming soon)\n• Personalize and optimize your drones in the Garage (coming soon)\nDo you have what it takes? There's only one way to find out...","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Drone Racing League","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":23283,"name":"Monolith","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/706/70611f43244db868fe0dd435b7351746.jpg","description":"Star of Providence is a top down action shooter with procedurally generated elements. Explore a large, abandoned facility in search of incredible power, fighting dangerous foes and gaining new weapons and upgrades as you progress.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team D-13","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":21953,"name":"WWE All Stars","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/265/2653f803b56118b2a41d9681927afdc7.jpg","description":"WWE® All Stars™ delivers an all-new take on WWE® with fast, fun, fluid and furious arcade-style gameplay that takes WWE® action to the next level! Featuring your favorite colorful WWE® Legends of the past and larger-than-life WWE® Superstars of today, WWE® All Stars™ delivers the greatest roster ever assembled in a WWE® videogame! It's up to you to determine the greatest of all time in the revolutionary new addition to THQ's WWE® videogame portfolio!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"THQ","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":21772,"name":"Metal Drift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7c/b7ce4689e32b7eebcac75c081453ee97.jpg","description":"Metal Drift is a vehicular sport combat game set in a distant future. As the player, you command an agile, high powered hover tank in a futuristic sports arena. Core game play centers on intense tank-on-tank multiplayer team combat seen through an immersive, first person cockpit.  Layered on this is a goal-oriented game type that allows for high level strategy and team dynamics. Players can level up to unlock new ranks, weapons, and upgrades.\nEach weapon and upgrade is specifically designed and balanced to allow different styles of play.  Pair up the Stealth upgrade and the Shock Cannon to uncloak behind an enemy player and unload a devastating blow before disappearing again.  Or choose the Sensor upgrade to see where all the nearby players are, and the Temporal Cannon to shoot them through walls!  There are 56 possible combinations – choose whichever suits your strategy.\nMultiplayer team-based vehicular combat\n5 Different arenas featuring multiple levels and boost tunnels\nPersistent leveling system – level-up to unlock new weapons and upgrades\nStats and Leaderboards\n56 Different tank configurations\n18 Steam Achievements, with more coming soon!\nUnique energy management system – accumulate energy and then distribute it to weapons or use it to gain a speed boost!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Black Jacket Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21737,"name":"Puzzler World 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdc/bdc0c0a49e7c590ad3f5e41a70d7017e.jpg","description":"The highly anticipated sequel to last year’s PC hit, Puzzler World 2 brings more puzzles, new games, fun rewards and an all new Master Mode.\nCreated by the same team that developed the original Puzzler World, the team were able to flex their development muscles and improve on every section in the game. With a revised selection of puzzles and mini-games, brand new Master Mode, a new reward structure and the inclusion of trophies – Puzzler World 2 takes the highly addictive franchise to a whole new level!\nEach puzzle completed unlocks a bonus game which in turn rewards the player with the all-new prize wheel. Players spin the wheel and see what prize they can earn. Players can win hint tokens that can then be used to buy help if they get stuck on tricky puzzles.\nPuzzler World 2 also allows players to unlock special Master Mode puzzles which provide player’s with even tougher challenges.\nKey features:\t\t\t\t\t\t\t\t\t Over 1200 new puzzles and bonus games from the world’s leading supplier of puzzle content - PML\nPlay a wide variety of different puzzles, including; Wordsearch, Fitword, Sudoku, Crossword, Hide and Seek, Link-a-Pix, Backwords, Silhouette and Pieceword\nUnlock additional bonus games – Picture Quiz, Splitwords, Chain Letters, Colour-In, Sum-Up, Jigsaw, Hangman, Chain Letters and more!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ideas Pad","platforms":[{"id":0,"name":"PC"}]},{"id":21385,"name":"Kinetic Void","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5b/f5bb97cc8eae4b8d5a9b2f3151efd7e9.jpg","description":"Steam Workshop\nAbout the GameAbout Kinetic VoidKinetic Void is a 3D space adventure with a focus on customization and exploration. The shipyard allows players to construct their ship piece by piece. Ships can be as simplistic as a cockpit, a hull, a engine and a gun, or as complex as a player wants.  Each module has available subsystems which can be applied to strengthen specific attributes of the ship, and when damaged, those subsystems may be destroyed.  While in space flight, interactions between objects are governed by the physics engine. Running into an asteroid at high speed will damage your ship, potentially with catastrophic effects. Using the Kinetic Field Generator (KFG) in game will allow your ship to create an artificial gravity around the ship, both protecting the ship as well as allowing your ship to fly freely through space.  This field will also enable the Micro Warp Drive, catapulting your ship far into space in a matter of seconds. Kinetic Void is a procedurally generated adventure, there is no main story line. The decisions and direction is left up to the player. Ally with factions, go to war, build your ship and amass wealth, the choices are yours.A New Galaxy Every Time. Procedural galaxy creation allows as many new experiences as you'd like.  When a new game is started, the galaxy map, contents of each sector, and the factions involved will be generated from scratch. You may continue to play this galaxy, or if you'd like to try something different, create a brand new galaxy.  Don't worry, your old galaxy will be saved in its current state if you ever wish to return.  Choose how many sectors you'd like in your galaxy, as well as how many factions (NPCs) and whether your ships will be Creative or Career mode.Know Your Neighbors. In Kinetic Void the galaxy is a living, breathing thing.  Not all factions get along, not all of them hate each other. As factions interact, agreements and treaties will be made and broken. Trade, combat and piracy will affect how the factions see each other based on their own internal standings.Fully Detailed and customizable Space Ships. Tailor your ship for any role. Make a sleek fighter, a bulky freighter, or a mighty carrier. Your ship’s capabilities and appearance are completely up to you. Using Kinetic Void’s ship builder you can make exactly the ship you want.  Customize every part of your ship from cockpits, hulls, engines, weapons, and aesthetic modules. Each module has its own statistics that affect the total performance of your ship. Every module can be further customized by adding subsystems (right click on a module to add subsystems). You can even color your ship exactly how you want.  Each module has seven color fields allowing you to make amazing ships quickly, and easily.  Once your ship is created, save it to your computer, or share it to the Steam Workshop for the world to see.  Subscribed ships from the workshop have a random chance of making it into any new galaxy as a faction vessel.Freedom to Choose Your Fate. Be the scourge of the galaxy, or its savior. A life of combat and struggle not your thing? Become an intergalactic trader and influence the galaxy one deal at a time. Not interested in being a ‘good guy’? Take on a life of piracy and plunder your way through sectors, creating havoc wherever you go, then docking at pirate stations for supplies as needed.Intense Active Combat. Target enemy ships and maneuver in real time to align devastating broad-sides or crippling strafing runs. Deploy drones to do your dirty work or simply confuse the enemy into targeting them instead of you while you deal with the enemy vessel.  In Kinetic Void, your skills as a pilot are just as important as the components that make up your ship.Take Direct Control Of Your Ship. Kinetic Void offers three control modes. In cursor-mode, the player can control the ship through keyboard commands, and pan the camera with the mouse in any direction for quick tactical overview; or Mouse Flight-mode, allowing direct control of the ship through mouse movements. Control your battleship’s turrets from a sweeping orbital camera or slip between asteroids in a dogfight while piloting your heavy-fighter using mouse flight mode. Switch between modes at any time to best suit the situation.Key FeaturesFully detailed and customizable space ships\nHundreds of weapons and modules of multiple sizes\nHuge procedurally generated galaxy, limited only by your computer's capabilities\nRandomized factions and political standings\nOpen world sandbox, you are in control of your fate\nDetailed economy simulation with resources, trade routes\nEpic space combat","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Badland Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20045,"name":"Message Quest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/7171db40fdb354b47056021f59896901.jpg","description":"Message Quest is a tiny stained-glass point-n-click adventure about laziness and her herald.\nThis is a fairy tale in the best tradition of works such as “The Hobbit” or “The Chronicles of Narnia”, inspired by the art of Studio Ghibli.\nThis is the story of a lazy herald called Feste. You may know heralds, the fellows who appear at the beginning of each journey, looking for the hero in an attempt to deliver that “call to adventure” thing, right before the interesting stuff starts to happen. That’s exactly the job our Feste must do. Find a hero, give him or her a call to adventure, and be done with it. No exploits, no saving the world. But all he wants to do is sleep and eat candy. You must become his conscience and lead him through the struggles and strange encounters of the Interworld Road.\nA cute fantastic journey for one evening - the game lasts about an hour and a half, so you’ll get the full story in one session.Features\nUnusual stained glass graphics that make everything even more fairy taleish.\nCharming and unpredictable characters who will tell you their life stories.\nPuzzles with traditional mechanics allow you to fully enjoy the story without losing game immersion.\nFunny boss fights in true JRPG style with zany attacks and bonuses.\nA new dialogue system that allows you to control both characters in a conversation.\nJokes and easter eggs that will surprise you when you least expect it.\nA magical soundtrack written especially for Message Quest that will immerse you in the bizarre fantasy universe of Interworld Road.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Royal Troupe","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":20022,"name":"9 Clues 2: The Ward","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/36c/36cc91d266f5a4bbd73a24bbbbbcb80a.jpg","description":"\"The Ward\" is the second installment in the 9 Clues series, in which a young detective and her partner respond to a distress call from a psychiatric hospital on a secluded island.\nThe island is isolated by freezing waters and constant, brutal storms. Upon the detectives’ arrival, one of the hospital’s therapists falls out of the window to his death.\nAs their investigation begins, the detectives learn much darker things are happening at Mnemosyne Asylum than they could have guessed. None of the patients are willing to speak about the devastating fire that engulfed the hospital four years ago, or the fire’s victims. The staff do everything they can to obscure the asylum’s past, and keep the façade of peace and order intact.\nEach new clue only raises more questions. Who killed Doctor Crow? What drove one of the male nurses insane? Who is Zed Rascov? Why is the name of a little girl, Ginger, carved into the wood-paneled wall of the dead doctor’s office?\nFeaturesDetective Mode: solve crime scenes by intuitively placing clues\nEerie story set in a psychiatric hospital in 1950s America\n42 atmospheric locations\n19 challenging mini-games\n39 achievements to unlock","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tap It Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19026,"name":"Putt-Putt and Pep's Balloon-o-Rama","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df7/df7104ead3ce846982c5b4b3592ee52a.jpg","description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameHelp Putt-Putt® bounce his pal Pep into the air to pop colorful balloons--some filled with hidden surprises!\nBalloon-O-Rama features 120 levels of action and hidden bonus rounds. It even has a construction mode, so kids can build their own challenging levels! The junior arcade games are jam-packed with fast and furious game-play that will provide hours of fun.\nFeatures:\nChallenging arcade-style games\n120 levels\nConstruction mode allows kids to create their own levels of balloon fun\nSave your game after each level and track scores for up to 75 players\nFor kids ages 3 to 8\nJunior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Humongous Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17612,"name":"Grey Cubes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b2/7b2f1cec218ff6de5d96ff142459209e.jpg","description":"Grey Cubes is a modern variation on the brick-breaker-type game, based on real-time physics and three-dimensional gameplay (not just 3d look).\nMinimalist in style, with clean graphics and deep, original soundtrack.\nThe game contains 60 levels, each one is unique, each one with new challenges.\nFeatures:\n- addicting mechanics based on classic idea mixed with real-time physics and three-dimensional gameplay,\n- 60 highly diversified levels,\n- a traditional system of power-ups incorporated into modern gameplay mechanics,\n- multi-layered levels.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Deion Mobile","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15154,"name":"Clash of the Monsters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/830/830bdf08d10cdba162f9eeff17518dc7.jpg","description":"Clash of the Monsters brings the most classic and iconic horror film and literature figures together in the traditional 3D fighting game style! The name quite literally says it all.\nHave you ever wondered what would happen if the Living Dead faced off with Nosferatu? Or what about the Headless Horseman vs the Phantom of the Opera? It's time to find out! Take control of your favorite classic horror genre monster or hero and get ready to fight.\nClash of the Monsters makes use of legally licensed characters from both film and novel works of art. Clash of the Monsters includes the following characters:\n-Living Dead, from the film classic 'Night of the Living Dead'\n-Nosferatu, from the film classic 'Nosferatu'\n-Phantom of the Opera, from the film classic 'The Phantom of the Opera'\n-The Headless Horseman, from the classic short story \"The Legend of Sleepy Hollow\"\n-Ichabod Crane, from the classic short story 'The Legend of Sleepy Hollow'\n-The Bride of Dracula, from Bram Stoker's novel 'Dracula'\n-The Invisible Man, from H.G. Wells' novel 'The Invisible Man'\n-Bones, a 'Clash of the Monsters' original character\nMany other characters are being actively worked on and will be released in content updates over time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cadence Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12681,"name":"Riding Club Championships","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca9/ca9956efc3c656b0deda032994f0d2b0.jpg","description":"Riding Club Championships is a horse riding game focusing on online competitions, and staying true to real equestrian disciplines.\nTake part in show jumping, barrel racing, pole bending, agility and jump agility. You can play alone, against friends, in ranked games against random players, or in our weekly tournament. If you aren’t satisfied with our huge selection of courses, you can create your own and share them with the world. Enjoy a large variety of horse colors and patterns, groom your horse, and train it to improve in multiple skills. Acquire better- and better looking gear as you go.\nCompete with your horse in true equestrian style, shortening and lengthening your strides to make those distances, ask for extra effort over some of those bigger obstacles, and your horse will even do lead changes for you to be on the correct rein.\nSo, if you want the excitement and thrills of live competition against players from all over the world, or just hang out with your friends and chat about horses, Riding Club Championships is the place for you.\nKey Features\n* Show Jumping, Agility and Jump Agility\n* Solo, Friendly- and Ranked Matches\n* Weekly Tournaments with cool prizes\n* Paddock Mode\n* Course Editor with voting and sharing system\n* A large variety of horse colors\n* Multiple choices of horse and rider gear\n* Horse grooming\n* Horse rpg system\n* Quest system\n* A thriving community\n* Multiple chat rooms\n* Stable Clubs","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artplant","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11175,"name":"ReThink","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d7/7d7bc93feb9ad2285b69aa5b7a9f8ab6.jpg","description":"As an inmate of a government-controlled Correctional Facility in the year 2275, you have the right to prove yourself worthy of being part of Society again.\nShow your skills in logical thinking by solving about puzzles of varying size, type and difficulty in this first-Person puzzle game, and redeem your freedom!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Yaeko","platforms":[{"id":0,"name":"PC"}]},{"id":10176,"name":"Let Them Come","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/927/9273834e3f8d52b0e060f3a867eb2f99.jpg","description":"Let Them Come is a fast paced pixel art shoot ‘em up.  Twitchy trigger fingers and focused battle tactics are the order of the day as wave after wave of alien-like creatures try to take you down. Gameplay is simple to pick up but hard to master - only the best of the best will survive to fight another day.  With a variety of alien creatures to mow down and cool weapons to do it with, stylish retro backdrops and a hard rockin’ soundtrack, Let Them Come is a fast and furious pixel style shooter on steroids\nFEATURES\n•\tLOADOUT CUSTOMIZATION - Upgrade and customize your arsenal as you unlock new items to take down the hordes!\n•\tUNRELENTING ONSLAUGHT - Combat an endless stream of diverse enemies with cunning attack mechanics.\n•\tBOOMBOX - Rock out to the music of your choice as you unleash hell fire on the enemy and collect new mixtapes as you go.\n•\tDYNAMIC LIGHTING – Use tracer fire and explosions tactically to help target the oncoming targets in darker levels\n•\tFEROCIOUS BOSS BATTLES - Face grim odds against terrifying boss creatures in the ultimate level showdown!\n•\tONLINE LEADERBOARDS – Show off your shooter prowess and boast with friends as you climb to the top of the ladder and become the best of the best!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Versus Evil","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":4141,"name":"Persona 4 Arena","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bae/bae4e1ea0ec61f1c38b42cfa9e57fa4c.jpg","description":"Two months after the ending of the hit RPG Persona 4, a new threat has emerged in Persona 4 Arena!\nJump into the next chapter of the story as Persona 4 enters a new genre in this 2D fighting game from the dream team of ATLUS and Arc System Works, made to be enjoyed by fighting game beginners and experts alike!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":443,"name":"Linelight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/428/428e583b9fa03a5e2a09198fc5cf5466.jpg","description":"Linelight is a refreshingly inventive, minimalist puzzle-adventure game. It takes the wildly simple premise of \"What if everything takes place on a line?\" and rockets it into outer space.\nEach mechanic is immediately understandable, then gradually combined with familiar elements, leading to an exponentially large array bursting with puzzles, each with a one-of-a-kind solution.\nThere’s no jump button. There’s no shoot button. The way you move creates a universe of possibilities and one mind-bending experience.\nGuide Dash across the game’s rich, clean, and relaxing worlds; Linelight simulates the experience of getting an A+ on an exceptionally hard test while receiving a back massage.\nThe gameplay is simultaneously unique and intuitive enough that gamers, non-gamers, your technology-illiterate relatives, tweens, rocket scientists, a potato with googly eyes and toothpicks for arms, and even line connoisseurs are all on the same playing field of challenge.*\nWelcome to the world of Linelight.\n*Okay, maybe not the potato.Key FeaturesBask in the soft glow of a world made out of straight lines.\nExperience 6 hours of pure, unadulterated gameplay.\nSolve more than 250 unique puzzles across 6 unique worlds.\nEnjoy a Zen-like, ethereal soundtrack, and enter a state of flow.\nExplore the intricacies of each world to uncover secret challenges.\n","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Brett Taylor Interactive Limited Liability Company","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":936474,"name":"Sir Whoopass: Immortal Death","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/074/074339461617f1b488c0fb560b501bd6.jpg","description":"While some are destined to be great heroes, others swing and miss. Meet Sir Whoopass, a try-hard hero with a heart of gold who, due to a series of hilarious and astoundingly poor life choices he manages to bring chaos and disarray to a utopian world. He must find The Legendary Villain-Beating Artifact™ on his quest to vanquish The Immortal, a mysterious recluse who for some reason is bringing down all manner of monsters and evil creatures on the world.SLAY THE BEASTSHack and slash your way through waves of orcs, skeletons, trolls and other foul, nose-picking beasts. Level up and choose between a variety of weapons, each with an unique fighting style to accomodate all your gushing needs!\nEXPLORE THE WORLDThe landscape of Wildwood is, for unexplained reasons, host to various puzzles, loot, secrets, dungeons and beautiful vistas for Our Hero to explore. With lofty forests, green meadows and rocky cliffs, Our Hero will excel in moderate adventures and Garden Gnome feasting.\nVenture deep into the damp skeleton caves and the Stinky Orc Camps to find mysterious artefacts and conveniently placed loot. Visit the local pub, The Jolly Barrel Inn, to get yourself refreshed between fights and take on quests to save the residents from the evil antagonist, The Immortal.\nBECOME THE HEROThe reckless antagonist, The Immortal, can only be defeated with The Legendary Villain-Beating Artifact™, which unfortunately is splitted into three different pieces. The legend speaks of a True Hero that wields all these pieces and puts a stop to The Immortal, once and for all. Will Sir Whoopass be this Hero? Why are there some many hats laying around? Who is Sullivan the Scribe? What is the HoverCraft 2500™? And why is this animated picture censored?\nFind answers to almost all of these questions together with Sir Whoopass!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Atomic Elbow","platforms":[{"id":0,"name":"PC"}]},{"id":926709,"name":"DR LIVESEY ROM AND DEATH EDITION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca9/ca96fc5fa055f2f6e391ab3db4e503c0.jpg","description":"DR LIVESEY ROM AND DEATH EDITION - Dr. Livesey, along with his legendary team, decides on an adventure and sets off on a journey to the lost Treasure Island. Unfortunately, on the ship, behind your back, some part of your team start a secret conspiracy, during which you and several other crew members, after discovering the place of the treasure, will be to be severely stabbed to death. Yet the conspiracy is revealed and you will have to be proactive.. Insane carnage awaits you in a deadly pursuit of precious prizes, now for them rom and death are officially one and the same. Fifteen men on the Dead Man's Chest Yo-ho-ho, and a bottle of rom! Drink and the devil had done for the rest Yo-ho-ho, and a bottle of rom!!\nYou have to control the walking Doctor Livesey, and his two partners: Jimmy and Squire. You will fight hordes of enemies, breaking through many unique biomes, each of which will end with an insane battle to extremely aggressive phonk music, and as a reward you will receive special items that will help you find a secret treasure on the Treasure Island.\nFeatures:\nWALKING DR LIVESAY (and his friends)\nSOVIET CLASSIC CARTOON STYLE\nSUPERUNIQUE GAME ITEMS\nMEGAHUUUGE DETAILED WORLD\nRANDOM ULTIMATE ABILITIES\nHIDEN TREASURES\nTRUELY BULLET HELL\nEXTREMELY AGGRESIVE PHONK","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Agafonoff","platforms":[{"id":0,"name":"PC"}]},{"id":891228,"name":"Horizon Forbidden West - Burning Shores","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/647/64747512270db10509f04880289d0135.jpg","description":"An expansion to Horizon Forbidden West which sees Aloy pursue a sinister threat in the untamed wilds of Los Angeles, now a treacherous volcanic archipelago.\n\nShe will be traveling to a dangerous new region south of the Tenakth Clan Lands, featuring a compelling storyline following from where Horizon Forbidden West ended, new characters, adventures, and more - some details which we look forward to sharing with you very soon!\n\nOur creative vision for the Burning Shores is an ambitious expansion which will take Aloy to the ruins of Los Angeles. It's an overgrown and fractured city that can be fully explored via the water and flying on the back of a Sunwing. A massive machine threat lurks in its shadows – a huge challenge that Aloy must overcome by using all of her skills and abilities. \n\nTo achieve this grand vision technically and creatively, we’ve made the difficult decision to focus all our efforts on making an incredible experience exclusively for the PlayStation®5 console.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Guerrilla Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":840930,"name":"Farmer Against Potatoes Idle","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20a/20a8aaeda9d13c5b6df80330bd7111ce.jpg","description":"Farmer Against Potatoes Idle is a game about an amnesic Farmer\nWith a past shrouded in mystery, that wakes up in the middle of a field and is attacked by a horde of mutated Potatoes. With no one else in sight, he takes it upon himself to try and keep the evil infestation in check.\nEven since release there are over 5 worlds with 9 Areas of 100 Waves, each with 2 difficulty settings, so YES, “it’s over 9000” waves with more to come in the near future.\nIn the early stages of the game you will have two main currencies, Potatoes and Skulls, that you can use on over 30 upgrades that increase your stats or debuff the Potatoes, but don’t worry, this is just the start of the adventure.The Potatoes somehow have various Items\nThere is a set of Equipment in every Area so there are over 250 visually different items but due to the Item Rating, Enhancing Levels and Bonus chances, there are over 2M possibilities for unique Equipment in the game.\nBut worry not. We know storage management is not something a lot of people like in general but the whole system is custom made and with auto’s available to help you keep everything neat and tidy.The Farmer has a very particular set of skills\nSkills that he has acquired over a very long career. Skills that make him a nightmare for Potatoes. And each and every one of his many Talents, are made for the sole purpose of ridding the world of all Potatoes. Even the non-combatant ones if possible, as they make one hell of a meal.\nThe Talent tree is huge, with choices that can change your play-style significantly. And the best part is that they are not permanent, so you can experiment to your heart’s desire. And everything’s visible from the start: no fog of war type of tree, no hidden talents … or are there?Besides the Daily Quests, Achievements and Challenges\nThere are many other features that you can play with, including a mini-game that you can play on a regular basis to get various timed buffs for your Farmer. The idea is simple: whack all the potatoes that pop their ugly heads out of the johns. Why, you ask? Because being a Farmer is a full-time job and enemies are everywhere!A feature that’s almost always present in all idle games\nThe Reincarnation system which Farmer Against Potatoes Idle also has. But every time you Reincarnate for bigger permanent bonuses, you can also change between 6 different Classes, each with their own strong points and Talent Trees. This creates a second layer of strategy decision making to make the game more enjoyable for various play-styles.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Oni Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":709172,"name":"Urbek City Builder: Prologue","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/85c/85c6dc59d21814dfdd8d65acd564b2c1.jpg","description":"IF YOU LIKE PROLOGUE ADD FULL VERSION TO WISHLISThttps://store.steampowered.com/app/1411740/Urbek_City_Builder/\nAbout the GameClick here to join our community\nUrbek City Builder: Prologue is a free game where you will be able to build a city of your own design! Manage its natural resources, improve the quality of life of the population, and build its neighbourhoods in your own way.NeighbourhoodsBreathe life into your city by building different neighbourhoods. Do you want a bohemian neighbourhood? Build bars, parks and libraries, but keep a low population density nearby. Do you want a bourgeois neighbourhood? You need parks and luxury shops.\nManageThere is no money in Urbek. Instead, you will have to build everything with your own resources, such as food, coal, or skilled work. There are more than 30 different resources to manage! Manage your natural resources well, so that they do not run out before they can be replaced. How will you choose to produce the energy for your inhabitants and industries?\nEducateEducation is fundamental! By producing enough qualified work and scientific work, you will be able to build more advanced buildings.\nObserveMove around at street level in order to get a more intimate sense of the city you are creating. See and feel the differences between neighborhoods the way your city’s residents do!\nOrganic growthThe growth of your city will be organic. Some constructions will appear according to the surrounding conditions. For example, buildings with more than two floors will appear in densely populated areas and with basic services.\nYou can place other buildings by yourself, but they need some conditions. For instance, the local market needs to be close to the farms. The university should have some high schools nearby, which, in turn, require nearby schools.\nWhen it comes to designing your city, you have a variety of viable options. There are no buildings that are superior to others. Every decision will have its pros and cons. Bourgeois houses consume more food and need resources that cost more to produce, but will improve the quality of life of the residents there. On the other hand, improving the productivity of industries will produce more resources, but will diminish the quality of life for residents living in the area.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Estudios Kremlinois","platforms":[{"id":0,"name":"PC"}]},{"id":615054,"name":"NINJA GAIDEN Σ2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98d/98dc32e183870f54b51a35019e6ab01e.jpg","description":"NINJA GAIDEN: Master Collection Deluxe Edition\nWith this version, in addition to \"NINJA GAIDEN: Master Collection\", the Deluxe Edition additional contents is also included.\n■Included Titles\nNINJA GAIDEN Σ\nNINJA GAIDEN Σ2\nNINJA GAIDEN 3: Razor's Edge\nNINJA GAIDEN: Master Collection Digital Art Book & Soundtrack\n■Deluxe Edition Additional Contents\nA Digital Art Book & Soundtrack that include visuals, still images, and music tracks from series history.\n※Online multiplayer is not available for the “TAG MISSIONS” in NINJA GAIDEN Σ2.\n※The “Shadow of the world” “Clan battle” for NINJA GAIDEN 3 Razer's Edge is not included.\nOnline multiplayer is not available for “ninja trials”.\n※\"NINJA GAIDEN Σ2\" and \"NINJA GAIDEN 3: Razor's Edge\" are also available in Traditional Chinese.\nPlaying in Fullscreen ModeThis game can be played in Fullscreen mode.\nTo do so, launch the game, and then click the maximize icon in the upper-right of the title bar. To return to Windowed mode, press the Esc key while in Fullscreen mode.\nChanging the Output ResolutionWhen the game starts, it determines the resolution that is most appropriate for your environment (either 1920x1080 (1080p) or 3840x2160 (4k)).\nYou can also set a specific resolution for playing this game.\nNote: The resolutions below are supported.\n1280 x 720, 1920 x 1080, 3840 x 2160\nTo configure the resolution, open the game's Properties from your Steam® Library.By entering \"720p\", \"1080p\", or \"4k\" in the text field of \"LAUNCH OPTIONS\", you can fix the resolution to the corresponding value.\nBy setting the game to a low resolution, you can reduce the processing load.\nAbout the GameNote: This product is included in \"NINJA GAIDEN: Master Collection\", and \"NINJA GAIDEN: Master Collection Deluxe Edition\". It is not available for individual purchase.\nNote: Please visit the official website for more information on the featured content.\n[About NINJA GAIDEN: Master Collection]\nEnjoy 3 games from the NINJA GAIDEN series in this one title.\nEach title is still just as fun as you remember while providing the same high speed action of the original releases.\nLook forward to heated battles with fearsome opponents!\n\nIn addition to Ryu Hayabusa, 4 other characters, Ayane, Rachel, Momiji, and Kasumi, are also playable. You can create a tag team with your favorite characters and freely swap out the playable character during battles.\n※The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.\n\nAll of the previously released game modes and DLC costumes for each title are included in this one set. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing you to enjoy action packed battles in whichever outfit you prefer.\n■Included Titles\nNINJA GAIDEN Σ\nNINJA GAIDEN Σ2\nNINJA GAIDEN 3: Razor's Edge\n※Online multiplayer is not available for the “TAG MISSIONS” in NINJA GAIDEN Σ2.\n※The “Shadow of the world” “Clan battle” for NINJA GAIDEN 3 Razer's Edge is not included.\nOnline multiplayer is not available for “ninja trials”.\n※\"NINJA GAIDEN Σ2\" and \"NINJA GAIDEN 3: Razor's Edge\" are also available in Traditional Chinese.\n[About NINJA GAIDEN Σ]\nIn addition to being able to pull off unmatched dazzling techniques with \"Ryu Hayabusa\", a young ninja who has inherited the ninja arts of the Hayabusa style, with beautiful stages in a westernized Japan embellished with spirit-world motifs, and more, the game is packed with features that are a must-play for any fan of action games.\n■The epic story can easily be enjoyed with \"Hero Mode\"\nWhen you select the difficulty setting \"Hero Mode\", Hero Mode is triggered when your health becomes low. With Hero Mode, you will guard and evade automatically, and can unleash ninpo as much as you want. Even casual action gamers will be able to feel the heroic thrill of escaping a pinch to turn the tables on the enemy and advance the game. Needless to say, difficulty modes that will satisfy hard-core gamers are also included.\n[About NINJA GAIDEN Σ2]\nBecome Ryu Hayabusa, the ninja who inherited the \"Dragon Sword\", a legendary blade, and once again experience high-speed ninja action in which you face battles all over the world. The game is also packed with additional features such as \"Hero Mode\", a mode in which the player will guard automatically when they are in a pinch.\n■In \"NINJA RACE\", life or death depends on speed\n\"NINJA RACE\" is a mode in which you must race across the map within the time limit while fighting high-speed battles. In this mode, the number of enemies you defeat in succession is counted as your \"CHAIN\", and by stringing together a high chain, your attack power will increase dramatically. Also, you can pick up speed-up and time increasing items along the way, so attacking non-stop, defeating enemies as fast as possible, and gathering items will be essential to your strategy.\n■Along with Hayabusa, 3 heroines dazzlingly dash about the battlefield\nHeroines from the \"NINJA GAIDEN\" series, \"Ayane\", \"Rachel\", and \"Momiji\" appear as playable characters. With \"TAG MISSIONS\", players can select 2 characters from among Hayabusa and the 3 heroines, allowing them to switch between 2 playable characters as they complete their mission.\n[About NINJA GAIDEN 3: Razor's Edge]\nThe ultimate high-speed ninja action has returned! The game offers both extreme \"challenge\", along with an equally extreme \"sense of accomplishment\". Experience the series' most alluring high-speed action.\n■In addition to Ryu Hayabusa, Ayane, Kasumi, and Momiji join the battle!\nIn addition to main character \"Ryu Hayabusa\", the 3 female ninjas \"Ayane\", \"Kasumi\", and \"Momiji\" can be used as playable characters. And they aren't limited to just the \"Chapter Challenge\" story missions - the 3 characters can also be used in \"NINJA TRIALS\". Also, \"NINJA GAIDEN\" series heroine Ayane has a dedicated story.\n■Thrilling battles where you must be constantly alert\n\"Tests of Valor\", a special phase for series fans who want to enjoy battles even further, have been included. In each chapter, there are hidden skulls that serve as gates to \"Test of Valor\" areas. By stepping foot onto these areas, battles will occur where players must face the fiercest and strongest enemies from the \"NINJA GAIDEN\" series.\n■Upgrading characters adds more replay value!\nBy collecting hidden \"Golden Scarabs\", using \"Karma\" collected in battles, and more, players can unlock new weapons and ninpo to upgrade their characters. Of course, upgrades you have applied can be carried over for 2nd and successive playthroughs. Among moves that can be unlocked, there are moves that are new to the series, such as \"Cicada Surge\", which allows you to dodge any enemy attack, \"Meditation\", which allows you to consume your Ki gauge to recover health, and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"KOEI TECMO GAMES CO","platforms":[{"id":0,"name":"PC"}]},{"id":484659,"name":"Black Skylands: Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8b/e8bc2ba8808450c769903dd9e08b4897.jpg","description":"Wishlist Full version of the Gamehttps://store.steampowered.com/app/1143810\nJoin us on Discord!https://discordapp.com/invite/MuhydYb\nAbout the GamePrepare to set sail! Every great adventure starts from humble beginnings. Learn a story of a young Earner named Walter, a story of his long path to defeating the Kain's Falcons and rebuilding his Fathership. Here is what awaits you:\nMeet the main characters of the game — your friends, your family, and also the villains of the story.\nTake your ship for your first voyage and bond with her. Aerial navigation isn’t easy. The Sky is always hungry, so if you want to have a shot at surviving, your ship has to be your best friend. Study it, tame it, be one with it.\nCraft and use various weapons and attachments. Love customizing your loadouts? Black Skylands has got your covered. Take SMG, for example: you'll be able to equip 4 different SMG mods at once, with around 50 mods available in total. Some of the mods drastically change the way a gun behaves!\nGather resources, build your first farm and grow your first crops. You’re an Earner, which means you’re an equally competent builder, farmer, and pilot. Never let your farms stand idle!\nAnd remember: The Sky is always hungry.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Hungry Couch Games","platforms":[{"id":0,"name":"PC"}]},{"id":350615,"name":"Bombergrounds: Battle Royale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19d/19d5b0bdf0fa266df230cd394b75a4d2.jpg","description":"Bombergrounds: Battle Royale brings new life to the Battle Royale genre by mixing the retro bomber games with modern gameplay. It is an action-packed multiplayer game set in a cute but deadly world where animals reign and compete against eachother.Features:Massive battles: 50-player mayhem with bombs and power-ups everywhere.\nOnline solo & group play: Fight your way to victory alone or play together with up to 5 friends.\nFree-form combat: Gain complete control over your character, bomb-placements & swings and develop your unique style.\nCrazy and fast combat: Feel the impact of every bomb you place, and send other players flying as you run to avoid explosions.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Gigantic Duck Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]