[{"id":1159,"name":"Until Dawn: Rush of Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/093/09392fba4ad0c47d033163d20e209eb5.jpg","description":"VR games may cause some players to experience motion sickness.\nDescend into madness.\nStrap yourself in for the most disturbing rollercoaster ride you’ll ever take. From the warped minds of the team behind PS4™ horror classic Until Dawn, comes Until Dawn: Rush of Blood – a virtual reality experience to strike fear into the hearts of every trigger-happy arcade shooter fan.\nArm yourself to the teeth then blast your way through a horde of enemies and monsters coming at you from all angles. Duck and dodge everything that’s thrown at you in this fright-filled rollercoaster ride from hell– exclusive to PlayStation®VR.\nCan you survive seven levels of pure terror to top the global leaderboards? With multiple paths to take and nightmarish themes to scare the living daylights out of you, no two rides will ever be the same – and neither will you...\nPlayStation®Camera Required\nEnhanced play with 2 PS Move controllers\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\nOnline Play (Optional)\nPlayStation®VR Required\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2016 Sony Interactive Entertainment Europe. Developed by Supermassive Games Ltd.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":976564,"name":"HELLDIVERS 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d58/d58b2e611e69b02757ffc4fccda8ee74.jpg","description":"Digital Deluxe Edition\nEdition includes:\n‘DP-53 Savior of the Free’ Armor Set.\n‘Will of the People’ Cape.\n‘MP-98 Knight’ Weapon.\nSuper Citizen Status.\nStratagem Hero Ship Game.\n‘Steeled Veterans’ Premium Warbond.\nAbout the Game\nThe Galaxy’s Last Line of Offence.\nEnlist in the Helldivers and join the fight for freedom across a hostile galaxy in a fast, frantic, and ferocious third-person shooter.\nURGENT BROADCAST – SUPER EARTH ARMED FORCESFreedom. Peace. Democracy.\nYour Super Earth-born rights. The key pillars of our civilization.\nOf our very existence.\nBut the war rages on. And everything is once again under threat.\nJoin the greatest military force the galaxy has ever seen and make this a safe and free place to live.\nBECOME A LEGENDYou will be assembled into squads of up to four Helldivers and assigned strategic missions.\nWatch each other’s back – friendly fire is an unfortunate certainty of war, but victory without teamwork is impossible.\nLOADOUTSRain down freedom from above, sneak through enemy territory, or grit your teeth and charge head-first into the jaws of combat.\nHow you deliver liberty is your choice; you’ll have access to a wide array of explosive firepower, life-saving armor and battle-changing stratagems… the jewel in every Helldiver’s arsenal.\nREQUISITIONSuper Earth recognises your hard work with valuable Requisition. Use it to access different rewards that benefit you, your squad, your destroyer ship and our overall war effort.\nTHREATSEverything on every planet wants you dead. That’s what we’re dealing with.\nEach enemy has distinct and unpredictable characteristics, tactics, and behavior – but they all fight ferociously and without fear or morality.\nTHE GALACTIC WARCapturing enemy planets, defending against invasions, and completing missions will contribute to our overall effort.\nThis war will be won or lost depending on the actions of everyone involved.\nWe stand together, or we fall apart.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":440084,"name":"Chorus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/656/656bf6751565fe441af18db27be92b12.jpg","description":"Take control of Nara, once the Circle’s deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentient starfighter, explore ancient temples, engage in exhilarating zero-g combat, and venture beyond our waking reality.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Deep Silver","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":362895,"name":"Internet Cafe Simulator","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb0/cb04d11e3bbe7159dff27cac9c77eeb5.jpg","description":"Build the best internet café in the world!\nInternet Cafe Simulator is an internet cafe business simulation game. You can set up and manage a comprehensive workplace within the game. There are many activities and people you can interact with in the city. You must pay the rent of your apartment and shop. You must satisfy your customers. You should install more elegant and powerful gaming computers. You can also do illegal work if you want. But be careful, the price can be very heavy. You can develop your internet café with a lot of applications on the computer in the game. You can even hire people to illegally give you a high score. You can expand your internet café by renting new areas. In the game you can buy crypto money. You can grow your internet cafe with the right investments. You can increase the likelihood of people coming to your internet cafe by purchasing popular games. You can advertise your internet café on the streets. Or you can rent some areas for advertising. All management and planning will be in your hands. Watch out and don't bankrupt!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cocopo","platforms":[{"id":0,"name":"PC"}]},{"id":22104,"name":"Fort Triumph","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ed/8ed6cc3c56615564d81eb8469df8d5a6.jpg","description":"Fort Triumph is a tactical RPG emphasizing the use of Environmental Interactions to create rich, challenging and rewarding tactical gameplay. In the game, you command a party of chosen heroes who set out to change the world, one quest at a time. On your path you will explore the world, discover ancient secrets, and face down any enemy who stand in your path to glory through turn based tactical combat.\nIn Fort Triumph, every crate and every tree is a potential weapon in the hands of experienced tacticians: in order to succeed, you will have to burn, freeze, topple, kick around or outright destroy the scenery at the right moment.Our game includes:\nHardcore tactical turn-based gameplay - You lead a chosen party of heroes, each with a different set of abilities and a unique playstyle. Your party of heroes will face challenges and win missions by completing diverse objectives in tiled procedural maps.\nFully Interactive environments at your disposal - push, topple, grapple, burn, freeze and crash your way through interactive levels that play into your tactics.\nHeroes evolving by learning new abilities from their class skilltree - As they gain experience, your heroes learn new skills and abilities, making them more versatile in combat. Since each hero is unique, the right combination of heroes in a party is crucial to victory and you will need to balance your heroes' strengths and weaknesses to bring out their full potential.\nNon-linear, contextually generated missions and quests - Fort Triumph features flexible campaigns with changing locations, events and quests influenced by the player’s choices. Missions are procedurally generated to ensure each battle is unique and calls for a new plan.\nStrategic gameplay and world map exploration - Fort Triumph is set in an original fantasy world, one being warped and changed by magical forces threatening to consume it. Between one battle and the next, you will explore and discover the world and learn its secrets.\nOriginal music in the game created by Marco Valerio Antonini.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fort Triumph","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":20965,"name":"Glacier 3: The Meltdown","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1f/b1f92f4baa3a12ac10ca2660e81bc75c.jpg","description":"Since the press discovered multi-billionaire Bob Slayer’s best kept secret, the illegal Glacier Races, there are more applications than ever before for this deadly, crazy race. New contenders have entered the race, their vehicles are faster, stronger and equipped with new, experimental kind of weapons. Every each contender believes that their car is best equipped and will lead them to victory and an unthinkable amount of prize money.\nIn “Glacier3” you can select one of the 8 powerful cars. Find out what car and weapons work best in which tracks, or work best with your strategy. Will you go for the fastest time and leave all other contenders behind in dust, or will you just turn around and blow them into pieces?\nFeatures:\nMore, heavier and cooler weapons!\nMore battle cars!\nMore, better and interactive tracks!\nLoads of more features!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team 6 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":19381,"name":"Cities in Motion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d73/d73d9b4b5b901030326fdc9038f3c6e7.jpg","description":"Just UpdatedCities in Motion has just received a Free update to include the German city, Munich!\nAbout the GameRendered in rich detail, four of the world’s greatest cities - Vienna, Helsinki, Berlin, and Amsterdam - await the steady hand of a planner to manage their transportation needs in Cities in Motion.\nOverseeing the changing needs of people from 1920 to 2020, it’s up to you to manage everything from buses, trams and subway trains to maximize profits while pleasing commuters.\nKey Features\t\t\t\t\t\tExplore four different cities: Vienna, Helsinki, Berlin, and Amsterdam\nEngage in a campaign with 12 scenarios, as well as a sandbox mode where all campaign cities are playable\nExperience realistic 3D graphics with more than 100 unique, highly detailed buildings\nUse the advanced map editor to create your own cities\nPlay through 100 years of transportation history throughout four eras spanning from 1920 to 2020\nChoose between more than 30 different vehicles based on real-life models of buses, trams, water buses, helicopters, and subways, complete with an underground view\nExperience a real-time city and traffic simulator as each location's bustling population commutes between their homes, jobs, and leisure sites\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Colossal Order","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12144,"name":"The I of the Dragon","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/998/99865666d4953af7406dcfe140787e76.jpg","description":"THE DRAGON'S LEGACY\nThe world of Nimoa is as beautiful as the morning dew, but only at first glance. Under the surface of hills and fertile valleys lurks an old and eternal evil. Living as a mould, stretching threads through an infected area like deadly toadstools. The center of this \"being?\" deep in the under world is the giant daemon, Skarborr.GAMEPLAYYou, the player, take the role of the young, inexperienced dragon. In the role of the savior of Nimoa you move through the skies and faces all the challenges of the evil Skarborr. At the beginning of the game the player has the choice of three dragons: Annoth The Fire Breather, Barroth the magician and Morrogh The Necromancer. All three are different and all three have their own ways of dealing with the great many adversaries you will meet. You also develop the dragon's combat abilities throughout the game to deal with the increasingly tough and resilient enemies, until you meet and conquer Skarborr himself.\nThat is not all, you will also need to control other characters and complete important tasks on the path to overall victory: a warlord and his steed on a potentially fatal fact finding mission, the thoroughly competent hunter on a mission of delicate accuracy and selective killing and the three huge creatures and their riders in an attempt to destroy magical generators keeping the dragons away from the next big fight.\nThrough 12 enormous and differing geographical areas the task is not only to hunt and destroy despicable monsters, but to build, maintain and defend human settlements. A dragon's individual character, breathtakingly fluid graphics and addictively exhausting aerial combat bring you many hours of sometimes sweat generating gameplay.\nYou will also fall under the spell of \"The I of the Dragon\" with its mystical atmosphere, impressive sunrises and colorful but ominous sunsets, for who knows what the night will bring.FEATURESA choice of three dragons each with its own abilities, based on fire, ice and acid, developing either into a battle, wizard or sniper dragon. There are no limits to the possibilities\n12 unique territories representing various geographical areas: mountains desserts, forests and savanna etc. Each map has over 10 square kilometers to cover\nMore than 60 spells with special effects available to each dragon\nReal time Terra-Forming allows complete mountain ranges disappear and reappear in another location\nStatic and real-time lighting ensure the correct lighting conditions to every day and night cycle\nFascinating sunsets and a night sky full of stars await you\nThe Time Control-Option makes it possible to adjust \"The I of The Dragon\" to your own speed\nSlow motion mode with a fascinating effect","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Primal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10745,"name":"Redeemer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/372/3724c266c9d028a6cff791dd8df4b98e.jpg","description":"REDEEMER is an intense Brawler where you will punch, hack and blast your way through enemies using fists, hammers, fire arms and even the environment. It grabs the genre by the throat and drags it into 2017 in brutal style by adding a deep melee combat system and numerous unique types of kills. Redeemer is the brawler for those who love brawlers and have been waiting for a modern take on the genre!\nPlay as Vasily, an elite operative who once worked for one of the biggest Cybernetic Weapons Manufacturers in the world. Officially working in security, you were tasked with infiltration, assassination, extortion and even torture. When eventually the corporation decided to turn you into one of its cyborg soldiers, you manage to narrowly escape to a secluded monastery deep in the snowy mountains.\nFor 20 years you tried to find peace and harmony amongst your fellow monks, but you are still too haunted by your murderous past to find either. Now after all of these years the corporation is finally closing-in on your location, and in so doing they have given you one last shot at redemption.FeaturesIntense Top Down Action: Take out enemies using a wide selection of fire arms and melee weapons including combat knives, batons, fire axes, hammers and many more.\nBrutal Hand-to-Hand Combat: Use your mercenary skills to beat down your opponents using a collection of brutal fighting moves, combos, charge- and jump attacks.\nUnique Kill System: Use three different types of kills to mercilessly eliminate enemies. Sneak around levels undetected to silently perform graceful stealth kills, or use the very environment to dispatch your opponents using environmental kills by smashing their skulls, impaling them and setting them ablaze in flames (many more options available). Utilize your combat prowess to beat down your opponents enough to enable you to perform savage execution kills that will have you reaching for the screen capture key.\nParry System: Defend yourself whilst taking down your enemies by utilizing a well-timed block. Learn the movements and attack patterns of different enemy types to perfect your parry and create a ballet of death for all of those unlucky enough to oppose you.\nDisarm-or-Dismember System: Use a unique combat move to either disarm enemies of their fire arms, or dismember certain enemies at will and use their limbs as melee weapons.\nStory Driven Single-Player: Discover Vasily's haunted past and experience a narrative journey of betrayal and redemption.\nArena Mode: Practice and test your fighting skills by battling countless enemies in a horde-like Arena Mode.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sobaka Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":4431,"name":"Shoot Many Robots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/119/1196e5095adc69ab73e458eff9100277.jpg","description":"The title sums it up pretty well, but if you still need convincing:  A 4-player co-op run-n-gun action shooter that throws you into a tidal wave of degenerate robots with an array of weaponry that would make any mama proud.  A classic 2.5D side-scrolling shooter, revitalized with modern game design.\nYou take control of P. Walter Tugnut (The “P” stands for “Pickles”), a regular guy who stockpiles guns, ammo, and beer in his dilapidated RV awaiting the inevitable robot apocalypse. When the abandoned factory in the distance begins producing robots on its own, Walter sets off in his RV on a robot-killing rampage, hoping to save humanity from an onslaught of robot hordes.\nDeveloped by Demiurge Studios, collaborators on Borderlands™, Brothers in Arms®, and Mass Effect™.\nKey Features:\n4-Player Co-op\n\nUp to four players online working together to take down robot armies.\nCharacter Customization\nWearing a tutu isn’t just a fashion statement; it’s a strategy.  Hundreds and hundreds of crazy guns and accessories to unlock, each giving unique stat boosts and special abilities.  Level up and gain XP by killing robots, boosting Walter’s stats.  Unlock new missions and equipment.\nMissions\nPush forward through robot territory in Run-n-Gun missions – huge levels that end in uncomfortably epic robot boss battles. Hunker down in Survival missions – claustrophobic levels where the only object is to outlast waves of robot hordes.  Tons of missions to fight through, all the way up to the ultimate challenge: Insane mode.\nDiversified Combat\nTake two weapons with you into battle – but it's going to be a tough choice.  Revolvers, rocket launchers, assault rifles, flamethrowers, SMGs, and shotguns all beg to be used – not to mention the freeze ray, gnome launcher, and a cat carrier that shoots an exploding robot decoy.\nPunch Bullets\nAlso, you can punch bullets.  In the game, I mean.\nRobots with Personality\nNumerous robots – from tiny chainsaw-wielding Choppers to gigantic fire-spewing Fatboys – all have unique personalities, AI, and unique ways to kill, with even fiercer models appearing as the difficulty ramps up.\nPC-Specific Features\nFrom the team that brought Mass Effect to the PC, Shoot Many Robots has been upgraded and overhauled specifically for the platform.\nLookin’ Good\nLooks even better with support for higher resolutions (like 2560x1600!) and the game now runs at 60 fps!\nFeelin’ Good\nAll interfaces and controls have been overhauled and optimized specifically for mouse and keyboard.  Customizable key mapping is also now available.\nBut Wait, There’s More!\nFully integrated Steam matchmaking\nFacebook matchmaking\nAchievements\nIn-game & Steam leaderboards\nIntegrated voice chat","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":32197,"name":"Heroes of Might and Magic 3: The Restoration of Erathia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e65/e657ac377c02e7f26403dc0e308f2757.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":14430,"name":"Lugaru HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/559/5596e04b7803ab126de066d3b8a2782d.jpg","description":"Follow Turner, a rebel bunny rabbit with impressive combat skills in his quest to find those\nresponsible for slaughtering his village. Uncover a far-reaching conspiracy involving the corrupt\nleaders of the rabbit republic and the wolves of the nearby lands.\nStreamlined Combat: Gone are the days of combo memorization and button mashing.\nLugaru uses a context-sensitive combat system to put all the moves at your finger tips. It’s\nup to you to choose the right move at the right time and think your way through the fights.\nOpen-Ended Strategy: Each level presents you with an environment and a series of enemies.\nHow you choose to defeat your adversaries is entirely up to you. Storm in from the front and\nfight everyone at once or ambush your foes one at a time with stealth attacks.\nRagdoll Physics: Not only does striking your enemies do damage, but so does colliding with\nthe environment once you’ve knocked them off their feet. Nothing does more damage than a\nswift rabbit kick that sends the enemy hurtling into a stone wall.\nEnvironmental Detail: Factors like wind direction and whether or not you remembered to clean\nthe blood off your knife affect your ability to sneak up on the enemy undetected.\nBrutal AI: Enemies in Lugaru prefer unfair fights. Expect them to shout for back up, attack in\ngroups, and exploit any superior weaponry they can find.\nModdability: Turning on Lugaru’s debug mode gives you access to the map editor so you can\nbuild your own levels, campaigns and mods. Debug mode also enables crazy cheats that allow\nplayers to fly, have infinite health, explode enemies’ heads and set themselves on fire further\nigniting anyone who comes too close.\nNew HD Textures: The original Lugaru has gotten a more modern, graphical makeover while still\nstaying true to the game’s spirit. Special thanks to Tim Soret for his HD texture pack.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Wolfire Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":6319,"name":"FINAL FANTASY IV: THE AFTER YEARS","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/525/525b5da62342fa726bfe2820e8f93c09.jpg","description":"Now with a full 3-D remake, FINAL FANTASY IV: THE AFTER YEARS can now be played as never before on PC. Take part in the epic sequel that unfolds nearly two decades after the events of FINAL FANTASY IV. Classic characters make their return alongside several new heroes, such as Ceodore, son of Cecil and Rosa.\nStory : Seventeen years have passed since the war's end, and the son born to King Cecil and Queen Rosa of Baron has grown into a young man. Prince Ceodore has enlisted in the airship fleet known as the Red Wings, eager to meet the expectations demanded of his blood and station. Yet once more another moon has appeared in the sky, and with it vast hordes of monsters intent on destruction. The brief peace enjoyed by the Blue Planet now stands threatened under the shadow of impending catastrophe.Ten Playable TalesBegin your journey with \"Ceodore's Tale.\" Complete it to unlock the tales of six additional characters, which can be played in any order, and then return to the core story with \"Kain's Tale,\" \"The Lunarian's Tale,\" and \"The Crystals.\" A total of ten tales in all, and all contained in FINAL FANTASY IV: THE AFTER YEARS.\nActive Time Battle\nTake control of exhilarating combat made possible by the non-stop action in Square Enix's iconic battle system.\nLunar Phases\nFeel the moon's presence in combat, as its waxing and waning influences the potency of attacks and abilities of all combatants. Lunar phases cycle naturally with the passage of in-game time, or when resting at an inn, tent, or cottage.\nBand Abilities\nCombine the strength of your party members to awesome effect with Band abilities that can be unlocked through in-game events or by levelling your characters' Affinity.\nMinimap\nKeep an eye on your current location and nearby surroundings, or click for quick access to the world map.\nIncludes STEAM Trading cards!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PSP"},{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":370243,"name":"Timelie","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bed/bed0c5b98bc567f3865148250c324640.jpg","description":"Timelie is an adventure through time, which every precise moment of action is crucial. Use your abilities to solve puzzles and uncover the secrets of this abstract world.Foresee and RewindWith Timeline, player can control time of game like any media player. Drag left to rewind time to the past and undo your actions. Drag right to seek the future and gain the information to change your past.Single Player CooperativePlan actions for both of your characters simultaneously on timeline, gives a coop gameplay experience in single player game like never before.Abstract WorldGuides a lost girl and a companion cat travelling across vibrant, surreal and abstract realms. Manipulate time to uncover hidden secrets and get both of them get back home.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Urnique Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":316821,"name":"Ironsight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c06/c06bf13b93ed82258ad600d88a67687c.jpg","description":"Ironsight is a futuristic military First Person Shooter (FPS) game, based on the battle over natural resources between armed forces (NAF) and a private military corporation (EDEN), equipped with cutting-edge weapons and drone systems. The realistic gameplay throws the player into the middle of intense situations as they progress through various different locations.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wiple Games","platforms":[{"id":0,"name":"PC"}]},{"id":11899,"name":"Lup","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d67/d678bfa71e44562bae6f8d472b43d45d.jpg","description":"Features:\n★Explore and fight your way through 15 levels, all with different environments.\n★Find and use a multitude of items.\n★Use weapons to blast your enemies and the environment.\n★A super smooth control system, easy to learn, hard to master.\n★Lup has an awesome Progressive-House soundtrack.\nMusic by: Jamie Nord\nLup es un vídeojuego 2D de plataformas, en el juego tendrás que superar muchas trampas, enemigos y podrás encontrar armas y objetos.\n★ Explora y lucha en mas de 15 niveles.\n★ Busca y usa muchos objetos para destruir a tus enemigos.\n★ Usa diferentes armas para destruir a tus enemigos.\n★ Consigue muchos logros!\nLup está siendo desarollado por Leo Black y publicado por Back To Basics Gaming.\nMúsica por: Jamie Nord","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Leo B","platforms":[{"id":0,"name":"PC"}]},{"id":2780,"name":"Plants vs. Zombies Garden Warfare 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be0/be0d885cdbdd0e5c808ad874d34d7444.jpg","description":"The battle for suburbia grows to crazy new heights in Plants vs. Zombies™ Garden Warfare 2! In this hilarious, action-packed shooter, zombie leader Dr. Zomboss has strengthened his horde and rebuilt suburbia as a zombie utopia. But hope remains, because for the first time the plants are taking the offensive in an all-out attack to reclaim their turf. Play as both the plants and zombies in new 24 player multiplayer and 4-player co-op modes, or go at it solo or in split-screen against the AI across all game modes. Garden Warfare 2 also introduces the Backyard Battleground, your very own interactive hub where you and up to 3 friends can take on daily quests, challenges, and interact with your favorite PvZ characters.\nAdditional hardware required for Remote Play.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\nNetwork Players 2-24\n20GB minimum save size\nDUALSHOCK®4\nRemote Play\n1080p HD Video Output\nOnline Play (Required)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2016 Electronic Arts Inc. Plants vs. Zombies, PopCap, EA and the EA logo are trademarks of Electronic Arts Inc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20309,"name":"BlazBlue: Continuum Shift Extend","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9da/9dada2b52c7613116875612636823b0a.jpg","description":"Special OfferPC version includes the system voice feature for 7 characters which was sold separately for the console version.Bonus content includes Special Original Soundtrack and BlazBlue Art Collection.\nThe bonus contents will be placed in your Steam folder: ...\\Steam\\SteamApps\\common\\BlazBlue Continuum Shift Extend\\Digital Extras\\\nFeatured DLCBuy BlazBlue: Continuum Shift Extend now and receive Japanese Voice Pack DLC for free.(Time-limited offer)\nAbout the GameThe second entry in the critically acclaimed BlazBlue franchise, BlazBlue: Continuum Shift Extend adds a number of game play modes, story scenarios, new moves, and an all-new playable character to further enhance the BlazBlue experience and solidify its status as one of the all-time great 2D fighters.\nStory\nSeveral years after the end of the Second War, multiple branches of the Librarium reputed to command a force as powerful as an entire nation’s army were suddenly and utterly destroyed. Inexplicably, the hidden cauldrons within each branch were also completely decimated. The few survivors spoke in hushed, shaken tones of a single man who had\nappeared out of nowhere, cutting down all in his path.\nMain Game Features\nExpanded Character Roster: In addition to the downloadable characters offered for the previous entry in the series (Makoto, Valkenhyn, and Platinum the Trinity), EXTEND introduces Relius Clover, the mad puppeteer and Carl's father, as a playable character. Master a whole new way of fighting with Relius as he uses his marionette, Ignis, to turn the tide of battle.\nEnhanced Story Mode: Relive and rediscover the events that took place in BlazBlue: Calamity Trigger or venture forth into one of four all new story scenarios!\nNew and Revised Game Modes: Take on the strongest of foes in Unlimited Mars Mode or fight your way to the bottom of Abyss Mode!\nFully Revised Combat System: All characters, new and old, have been thoroughly rebalanced and armed with all new strategies and combos to take your game to the top!\nImproved Online Multiplayer: Battle it out in BlazBlue’s acclaimed online mode with all new multiplayer features, such as online team battles!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Arc System Works","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":9798,"name":"Throne of Lies The Online Game of Deceit","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e1/3e19d6172be1c91e4f87d3b2c2a7d412.jpg","description":"Early Beta Access\nClaim Beta access now by joining our community and enter one of our many contests/giveaways to claim a closed-beta key, exclusive to Discord users!\nAbout the GameThrone of Lies is a 3D online multiplayer game where up to 16 players must combine their social deduction skills with over 100 abilities to root out the traitors at the table and stop their foes from taking control of the kingdom.\n\nIn a modern take on tabletop games like Werewolf/Mafia and set during a time of medieval conflict, each player is randomly assigned one of 40+ classes, ranging from the King, himself, to a hapless Fool. Most players will be loyal members of the Blue Dragon faction, but each game will feature members of either the wicked Cult or mysterious Unseen faction, along with a few Neutral characters to mix things up.\n\nThe unique Day/Night cycle allows players to congregate around the table, discuss their findings and accuse players of treason during the day and use their abilities to occupy, spy on, conspire against and even kill their fellow players at night.\n\nWhile Cult and Unseen players know their allies, members of the Blue Dragon must be suspicious of every other player to ensure that they don’t fall to an evil plot.\nEven the King is suspect in Throne of Lies, and the enemy’s ability to convert other players to their side means that allegiances are always shifting.\n\nThe game concludes when the Blue Dragon faction has disposed of all hostile threats against the kingdom or their enemies have seized control of the Throne of Lies!Additionally:Use social abilities to silence opponents, manipulate their words and actions, or even speak with the dead.\nKeep precise notes in a journal to expose your investigation in the event of an untimely death.\nLeave behind a custom, hand-drawn Deathnote to mock your attackers.\nEquip armor & weapons to customize your character and executions with absolutely NO pay-to-win mechanics.\nNeutral players have their own objectives and missions to complete. While this could be as simple as ensuring their own survival, it may be to quietly eradicate everyone at the table.Join Our Epic CommunityJoin thousands in the official Throne of Lies Discord and Forum now for an enhanced ToL experience!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Xed","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1555,"name":"Snuggle Truck","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96e/96e31c67d34f1b1eb31455d3e43f15dd.jpeg","description":"Welcome to Snuggle Truck, the award winning over-the-top physics-based indie driving game. Save your cargo of crazy animals by delivering them to the zoo unscathed in the least amount of time. Tilt your truck, catch the fuzzies, drive over armadillos, and rocket your way through hills, caverns, and deserts. Perform backflips and navigate loops, harsh terrain, and unexpected obstacles all while attempting not to crush the poor animals.Key Features:Absurd Amount of Content Over 20,000 (yes, twenty thousand) challenging and varied levels included, many created by the online community!\nExciting 'One More Time' Gameplay Easy-to-learn physics gameplay that's hard to master. Collect medals for successful runs and gather rewards for different play styles.\nBeautifully Rendered Cartoon Art Hand-painted by none other than famed LucasArts artist Bill Tiller, known for his work on Curse of Monkey Island.\nLevel Editor Built-in Level Editor allows you to showcase your creative side. Make crazy-fun levels and share them with others!\nOnline Level Portal The fabulous Level Portal gives every player access to unlimited new content thanks to community-created levels.\nLeaderboards and Achievements A smattering of silly achievements and multiple leaderboards to compare your best times against friends.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":598872,"name":"Shadow Tactics: Blades of the Shogun - Aiko's Choice","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd0/cd00d5c322cb6a08f2cde1f12f07b629.jpg","description":"Aiko's Choice is a brand-new standalone addon to the beloved stealth tactics game Shadow Tactics. Set in Japan around the Edo period, you take control of kunoichi adept Aiko and her deadly assassin friends to hunt down the ghosts of her past.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Mimimi Productions","platforms":[{"id":0,"name":"PC"}]},{"id":555994,"name":"Disciples: Liberation","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2d8/2d84abb8b5e5ca1611048f682a61f93b.jpg","description":"Disciples: Liberation is a mature, dark fantasy strategy RPG with turn-based combat. Liberate the land of Nevendaar and uncover the endless stories hidden within this richly detailed world where every decision has a consequence, and every wrong move could be deadly.\n\nExplore a rich overworld and align with a variety of in-world factions: from a human empire tinged by religious extremism to the dark forces of the undead lead by a mad queen. Assemble a team to gather precious resources, sway political standing, and take on brutal beasts in intricate turn-based battles.\n\nChoice is everything in Disciples: Liberation and it is up to you how you write your story.\n\n\n• 80+ hour single-player campaign: experience a sprawling dark fantasy epic over three acts, with more than 270 quests and five unique endings to unlock\n\n• Explore a war-torn realm: journey through a sprawling world in ruin and work to unearth its endless secrets, hidden treasures, and bloody past\n\n• Write your own story: pick from four uniquely skilled classes and define your place in the world, recruiting others to your cause from an assortment of factions\n\nBuild a base:• take on quests for precious resources and use your political savvy to build a place of planning and sanctuary\n\n• Fight for your life: recruit 50+ units and amass an army best suited to your play style; hone both steel and spell in intricate-turned based combat.\n\n• Challenge deadly bosses: test your mettle and pit your party against horrific monsters and beasts, each requiring a unique strategy\n\n• Choice is everything: let your decisions guide your fate and directly influence what sort of leader you become\n\n• Fight your friends: put forth the ultimate challenge and battle for supremacy in 2-player online skirmishes","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Frima Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":31080,"name":"The Sims","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/639/639b45004ba5ff983d790f39641393c7.jpg","description":"In \"SimCity,\" you had the power to build and control cities ... with The Sims, you'll create and control people!","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Maxis","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":28082,"name":"The End Is Nigh","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/30a/30a059b8fc6b95526434f710ec67d5bd.jpg","description":"If you are reading this you are probably dead...\nJust kidding, you aren't dead... YET!\nSee, in the future, everything dies... for the most part.\nand this is a game about just that.\nThe End Is Nigh!\n-the management\nGameplay:\nThe End Is Nigh is a sprawling adventure platformer where the player takes control over Ash, one of few \"things\" that have \"survived\" the \"end of the world\".\nFollow Ash as he flops his way through a future of pain and suffering. Feel his stress levels rise as you throw him into an endless swarm of decaying, mutant animal-like creatures and help aid his final epic quest... to simply make a friend (out of pieces of people he finds along his journey).\nOh, also you collect video game cartridges and tumors! if that does anything for ya.\nFeatures:\n600+ levels!\n12+ explorable chapters!\n20+ collectible and fully playable mini game cartridges! (each with their own tiny achievements!)\n80+ achievements that will make you feel good about yourself\n100s of collectible little squishy tumors!\nloads of hidden extras and endings that you will probably see someone else find before you do!\nand stress!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nicalis","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20241,"name":"Horizon Shift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a42/a424b5ac4adb099ec9fca72f8be3fe22.jpg","description":"'Shoot Stuff, Jump Stuff, Bomb Stuff'\nHorizon Shift is an explosive wave based, single screen shooter, with a ton of new ideas and platformer elements.\nDo what it takes to protect your horizon from the ever encroaching enemy attack!\nUse the unique risk reward multiplier system to maximise power-ups, build your bomb and destroy EVERYTHING!\nHorizon Shift also features an amazing pulse pounding soundtrack produced by Jason Heine of Heine House Entertainment.\nThese original compositions are a fusion of House, Electronica and Chiptune.\nFeatures\n7 different game modes and a ton of options to customise your experience A unique risk reward multiplier system Pulse pounding soundtrack produced by Jason Heine Epic boss battles and bonus rounds An original blend of classic arcade shooter and platforming","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Flump Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16119,"name":"Three Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e4/6e499c8e72d7b479faafa569b84250aa.jpg","description":"The homeland is being besieged by enemies on all sides, now it is up to three heroes to take up their sword, spear, and bow to cleanse the land of the evil invaders. Featuring exciting combat, polished graphics, and hilarious humor; Three Heroes is the action adventure game that has something for everyone.\nAt some point, everyone dreams of being a hero, well now they can be three. Choose your hero and smash, hack, and shoot your way through the Slavic homeland to cleanse it from the evils that plague your land.\nInspired by stories out of Slavic myth; Three Heroes features an engaging story, epic combat, and RPG character building.\nFeatures:\n-Three playable characters, each with their own weapons and unique abilities\n-Switch between characters at any time during gameplay to use the right hero for the job.\n-Make your heroes more heroic with new and upgradable weapons, armor, and abilities\n-Battle against enemies out of Slavic myth\n-A colorful cast of hilarious characters\n-Beautifully rendered graphics\nThere’s not much time, enemies press in on all side, grab your weapon and become a Hero.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cats Who Play","platforms":[{"id":0,"name":"PC"}]},{"id":14099,"name":"Sakura Beach","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8fa/8fabc62e3da0e88d589b2da568089833.jpg","description":"From the makers of Sakura Spirit, Sakura Angels and Sakura Fantasy this time working together with the artist Inma to bring you this visual novel dating sim on the beach!\nSeiji is a daydreamer who spends too much time thinking about space. When he was given a chance to visit the beach with his two childhood friends, all he can think about is his chance to take out his telescope and look at the stars. But gradually, he begins to realise that his childhood friends want him to pay attention to them instead of the constellations...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10226,"name":"i saw her standing there","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8eb/8eb91ab40cf50085d41d91ac223ac696.jpg","description":"i saw her standing there...\ni saw her standing there is an action/puzzle game about love, death, and pancakes. You and your love are on a world-spanning adventure through graveyards, cities, an art gallery, a volcano, and so on in that pattern. Successor to the i saw her web game series that won the 2014 Canadian Videogame Awards’ Best Casual Game....but then she was a zombie.\nOver 300 lovingly hand-crafted levels set among 7 distinct worlds\nSingle player or local co-op, for those with a friend or sweetie\nIn-game level editor lets you share custom levels with friends, enemies\nDozens of unlockables, including (but not limited to) Big Head Mode\nListen to the enigmatic guitar-playing Wanderer tell her tale\nContinue the age-old story from the original i saw her series\nDesigned by Nick Yonge of Curiobot, creator of the i saw her series.\nVoice acting by Elspeth Eastman (League of Legends, Dead Island: Epidemic, Crypt of the NecroDancer, Torment: Tides of Numenera)\nOriginal soundtrack by dloot (Coin Crypt, Sentry Knight 2)\n3D art by Chris Vasquez (Injustice 2, Mortal Kombat X, 100ft Robot Golf)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Curiobot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":462677,"name":"Shadow Warrior 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/366/3660f7923d5b16bb8bb67ac5a93f5b76.jpg","description":"Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets, Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon's egg, a touch of magic, and enough firepower to hold off the impending cataclysm.\r\n\r\nBring a Katana to a Gunfight\r\nConduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes.\r\n\r\nFancy Footwork\r\nFlow between nimble movement techniques including air dashes, wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle.\r\n\r\nExecute Then Annihilate\r\nExecute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.\r\n\r\nDynamic Combat Arenas\r\nEach environment is lined with hazardous structures and devices that can be activated to add another layer of creative choice to the offensive strategy.\r\n\r\nNeo Feudal Japan\r\nTrek across a mythic Asian land infused with the magic and technology of ancient samurai, now overrun by the demonic yokai from Japanese folklore.\r\n\r\nFunny Business\r\nBrace for expertly delivered one-liners from Lo Wang, pointed banter with Zilla, and an intense thrillride of absurd predicaments on the way to turning doomsday into a new day.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":292840,"name":"Super Mario Maker 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25f/25f1b4a7b6ed811a5f6e34e43d6cc550.jpg","description":"Let your imagination run wild with new tools, course parts, and features as you create the Super Mario courses of your dreams. This sequel to Super Mario Maker launches exclusively on Nintendo Switch.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":233858,"name":"God Eater 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18c/18c12ae1985e174ae9b82a11ce0cb6d5.jpg","description":"All of sudden, unknown life forms called “Oracle cells” begin their uncontrolled consumption of all life on Earth. Their ravenous appetite “devour” and remarkable adaptability earn them first dread, then awe, and finally the name “Aragami”. In the face of an enemy completely immune to conventional weapons, urban civilization collapses, and each day humanity is driven further and further toward extinction.\n\nOne single ray of hope remains for humanity. Following the development of “God Arcs”—living weapons which incorporate Oracle cells—their wielders, the “God Eaters,” appear. In a world ravaged by mad gods, these “God Eaters” fight a desperate war..\n\nCreate your character, and fight for the survival of human-kind in GOD EATER 3. Select your weapon from a wide range of God Arcs and face brand new Aragamis in dynamic high-speed battles. Explore devastated areas you have never seen in the previous GOD EATER games.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":45869,"name":"Fe","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/80a/80a336506a4bd7921ea6f3f81ef7d98d.jpg","description":"Fe is a new type of platform adventure where the story is up to you to\ndiscover, without handholding, told wordlessly through the discoveries\nyou make during gameplay.\n\nAt the heart of the experience is a tactile, analogue song mechanic that\nallows you to communicate and speak to every living thing in the forest.\n\nLearn a diverse array of animal cries that allow you to befriend or\nmanipulate any creature - even plants. Have birds guide you, bears fight\nfor you and have plants grow berries that help you overcome the Silent\nOnes.\n\nClimb, glide and dig your way through a dark Nordic forest and explore\nits living, breathing ecosystem filled with secrets, side quests and\nmystical creatures.\n\nBecome Fe and discover a world that you will never want to leave.\n\nSPEAK THE LANGUAGE OF THE FOREST\n\nSing in tune with any animal or plant in the world of Fe.\n\nMaster a diverse array of cries to befriend the fantastical flora &\nfauna in the forest and let them help you on your journey.\n\nEach having uniquely distinct attributes, abilities and behaviors that\naid the players progression.\n\nLeverage a mix of these abilities to unlock and traverse new areas of\nthe forest.\n\nA WORLD WORTH EXPLORING\n\nEmbark on a voyage of discovery in a sprawling forest, where\neverything is connected, and nothing is what it first seems.\n\nMeet, interact & rescue wondrous animals & plants from the menacing\nSilent Ones in a variety of visually stunning, memorable and lovable\nenvironments.\n\nSecret places, hidden artifacts, old ruins, shortcuts and powers makes\nexploring fun even when you’re not finding “the way forward”.\n\nPowers enable you to perk up Fe with upto 10 unique abilities that\nmake traversing the world a breeze.\n\nFe has 8 main quests, 8 songs/cries to master & 8 interconnected areas\nto explore.\n\nUNCOVER THE MYSTERIES OF NATURE\n\nAid fantastical creatures in hand-crafted short stories with multiple\nsolutions.\n\nMake unexpected discoveries on your journey through the forest,\nunravel the mysteries of the Silent Ones whilst slowly learning the\nsecret of Fe’s origin.\n\nThe entire story of Fe is open for your own interpretation and through\nminimal handholding and tutorials leaving you to make your own\ndiscoveries.\n\nUNPARALLELED FREEDOM OF EXPLORATION\n\nGracefully glide from tree to tree.\n\nUse stealth and agility to evade danger, spy on nature & hide in the\nshadows from the Silent Ones.\n\nClimb your way to treetops to plan your next move.\n\nEffortlessly traverse the entire forest without loading screens.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":28264,"name":"Forza Motorsport 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/29a/29a7b558c9ddaa907f2f3f326bd2c605.jpg","description":"Forza Motorsport 2 speeds its way onto Xbox 360. With authentic simulation physics, bone-jarring damage, photo-realistic graphics, and licensed tuning and customization options, the franchise improves on the unprecedented features gamers enjoyed in its debut installment. Loaded with more than 300 of the world's hottest cars for you to collect, personalize and tune, Forza Motorsport 2 gives you a complete racing experience.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Microsoft Game Studios","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":19338,"name":"Assassin’s Creed Chronicles: Russia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd9/cd9a44c7a80b8319a84ea737e71cb592.jpg","description":"Join Nikolaï Orelov in his search for redemption as you journey through an iconic, propaganda art style Russia in 2.5D gameplay.\n• Survive the aftermath of October Revolution.\nDive into the middle of a major historical event served by iconic propaganda art style and its revolutionary symbolism. Jump on the famous trans-Siberian train, infiltrate the Kremlin and escape from Moscow!\n• Experience the thrill of being a stealthy Assassin in a modern setting.\nExplore a new contemporary setting in the 20th century and its modern stealth systems, such as elevators, radios & trip wires. Interact with new vehicles like trucks, trains & tanks.\n• Switch between two playable characters.\nEmbody Nikolaï, snipe targets with his silenced rifle, detonate mines from a distance or get up close with its bayonet. Discover Nikolaï’s Mechanical Winch, a versatile tool that sends electric shocks.\nPlay Anastasia, infiltrate narrow channels and discover her exclusive Helix Blade.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":17597,"name":"Ikaruga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b4/5b4af50ce68cf94dcab24f3dba33eaab.jpg","description":"Shoot! Dodge! and... Get Hit!?\nIkaruga is a vertical shoot 'em up that features an unique polarity-switching gameplay.\nSwitch the ship's polarity and \"get hit and absorb\" enemy bullets!\nAchieve High Score with the chain bonus!FeaturesThe player ship, all enemies and bullets are black or white.\nPlayer's polarity can be switched at will.\nYour ship can absorb enemy bullets of the same polarity.\nFilled energy goes to fire powerful homing lasers! (Release Power)\nDefeat 3 enemies in a row of the same polarity and get the chain bonus!\nBuilding up high scores feels like a puzzle game?\nSpectacular 3D graphics. Fast and smooth game play.\n2 Players game (Local) and\nDouble Play Mode: You can play 2 Players game with one controller.\n5 levels. Tactical level design and boss battles.\n3 difficulty levels: EASY, NORMAL, HARD.\nChange your tactics depending on the difficulty.\n2 Game modes: ARCADE, PROTOTYPE (not hidden).\nReplay data save is available.\nYou can also download them from the Leaderboards.\nVertical screen mode support.\nYou can also play the game like a side-scrolling shooter by rotating only the game screen.\nXbox360 controller, Keyboard and Mouse support.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Treasure","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox One"}]},{"id":16898,"name":"Penguins Arena: Sedna's World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bab/babee5b2ed1f9b9200a845e9b2005370.jpg","description":"Penguins Arena is a thrilling and innovative First Penguin Shooter with quick, hectic rounds and where the magic of reincarnation, combined with the supernatural ability to return to the game as a ghost, ensures that your character has every chance to change your tribe's fate, even in the afterlife.\nSave the Penguins, Save the World!\n- Quick rounds and furious gameplay\n- 5 different weapons and bonuses\n- 4 unique game modes\n- 15 different Iceberg battlefields\n- Player interaction, even after death\n- Multiplayer game (LAN and Internet)\n- Penguin customization\n- Fight the good fight and unlock 10 Achievements!*\nIt all begins when a penguin legend comes to life in the form of Sedna, the ancient Penguin Goddess. Global warming, melting ice caps, pollution... penguin tribes are endangered. Sedna tells them that there is room for but one tribe. And so the purging begins.\nNow it's your turn to join the snowball battle and drive the other tribes into the sea.\n* in-game achievements only. For Steam achievements please read the following thread http://steamcommunity.com/app/11280/discussions/0/617336568080930532/","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Frogames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3977,"name":"Magic: The Gathering 2014 — Duels of the Planeswalkers","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98b/98b1b87e86a815c23efe902fce598e54.jpg","description":"Special EditionThe Special Edition includes the following:\nMagic: The Gathering 2014 - Duels of the Planeswalkers Base Game\nSoundtrack: Planar themes and the licensed I Fight Dragons song as MP3s\nWallpapers: 5 desktop wallpapers; in multiple sizes\neBook: “Return To Ravnica” novella in PDF format\n10x Foil Conversions.  Early access to foiled cards for the 10 Base game decks\nAbout the GameIgnite your spark with Magic 2014 — Duels of the Planeswalkers!\nWith over 12 million fans, discover what makes Magic: The Gathering the world’s premier trading card game.\nBecome a Planeswalker and travel the planes of existence unleashing a torrent of spells and creatures to devastate your opponents. Prove yourself in combat against Chandra Nalaar—a fiercely independent Planeswalker with an affinity for fire and quick temper—then battle your way through the planes to face the mysterious villain trying to pull Chandra’s strings.\nExplore the rich storyline of Magic 2014 and fire up your game:\nThe best way to learn to play Magic: A detailed tutorial makes it easy to get started.\nDeck building: Open virtual booster packs of Magic cards to build decks and battle in single-player and multiplayer modes.\nHours of game play: Discover 10 new decks, each with many new cards to unlock, plus campaigns to complete, encounters to overcome, and challenges to decipher.Key Features:10 decks; each with cards to unlock\n250+ cards unlockable through gameplay\nSingle player Campaign across the planes of Shandalar, Ravnica, Alara, Innistrad and Zendikar; plus 11 revenge matches\n4 Deadly opponents, including the Planeswalker Chandra Nalaar\nMultiplayer modes; including Two-Headed giant and custom games\nSealed Play Mode; introduces deck building\n10 puzzling challenges","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Stainless Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":3645,"name":"MouseCraft","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0b7/0b7574f4f9c3820c7db80d2560edf6af.jpg","description":"Ever wondered what a cross between Tetris and Lemmings would look like? Well, wonder no more, 'cause... MouseCraft is here!\nMouseCraft is an A to B puzzle game where players help Schrödinger, the crazy cat scientist, in completing his mysterious, mice-powered invention. Pile up Tetromino bricks to create a safe path for as many mice as possible, gather collectibles, fight enemies, use different types of blocks, blow up things and avoid environmental hazards in 80 handcrafted levels!\nKey Game Features:\nExperience a remix of two classic gameplay mechanics: Pile up Tetromino bricks to create a safe path for as many mice as possible.\nDiscover an epic tale of a crazy cat scientist who is striving to unlock the potential of a mysterious, mice-powered machine.\nDefeat obstacles, overcome gaps and gather collectibles by using different types of blocks, be them explosive, crumbling or even jelly ones.\nProve your stacking skills in your own style- freeze the game by using the Active Pause feature or increase the speed any time you want.\nGet involved by creating your own maps and show off your creativity by sharing them with our community.\nChill out while listening to our funky soundtrack scored by Mikolai Stroinski, the composer for Dark Souls 2, The Witcher 3 and The Vanishing of Ethan Carter.How much content is there?80 hand-crafted levels (about 6-10 hours of gameplay).\n7 different types of Tetromino Bricks, 2 types of Enviromental Hazards, Bombs, Enemies...\n4 different locations.\nLevel Editor which allows you to create your own maps.\nFull Steam integration, including: Cloud Saves, Achievements, Leaderboards and Trading Cards.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Curve Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":18407,"name":"Super Mega Neo Pug","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/515/5151170fa0e7f6043ede97c2e93c2618.jpg","description":"Turbo Pug is back! And this time, he's airborne!\nFeatures:Fly through a variety of stunning environments, each with a unique theme.\nCollect Pug coins and unlock new costumes for Turbo Pug and new creatures to play as.\nGo up against an onslaught of enemies and giant bosses.\nRace your buddies to the top of the leaderboards.\nFind secret collectables and show them off!\nAn awesome original soundtrack composed by super dude Felix Arifin.Please try not to squish your pug!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Back To Basics Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":16174,"name":"Intergalactic Bubbles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e1a/e1a51d1dc570abe3cfaa1bde1cd465dc.jpg","description":"Blast your way through space in this innovative 3D bubble puzzler! Bounce, bobble, swing, and explode bubbles across the universe. Intergalactic Bubbles advances the classic match-3 genre into the 21st century with stellar graphics, 3D action, and upgrades.\n\"It's a great game!\" - James Bartholomeou, Initiative Check\nSectors full of levels provide hours of bubble blasting challenges.\nUpgrade your abilities to enhance your play style.\nUse power bubbles alone or combine them to unleash devastation!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hellscape Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]