[{"id":11330,"name":"Serious Sam VR: The Last Hope","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/823/823f00275904617ac1658597530af189.jpg","description":"UPDATE 7 - SKILLS AND POWER-UPSFight your way through waves of pesky aliens using the brand new skills and power-ups system.\nEarn skill points by completing planets, higher the difficulty more skill points you earn.\nUnlock weapon upgrades by completing perfect runs.\nLay waste on your enemies with tactical orbital lasers and plasma cannons, slow down time, improve and overcharge your weapons, create holographic decoys, release swarms of flying quadcopters, unleash an army of spiders, place minigun turret defenses, or simply create giant explosions!\nVarious visual and gameplay fixes and lots of stability fixes and optimizations, as usual. Check out the discussion boards for the full changelog.\nUPDATE 6 - ARCADIA UPDATE NOW AVAILABLE!Planet Arcadia is now available. Fight your way through four different locations: Sea Breeze, Meadow of Death, The Lost Valley and The Final Breath\nFour new enemies\nNew giant boss. And he has a crush on you!\nFeeling overwhelmed? Try out the devastating cannon.\nAs usual, update includes tons of fixes, tweaks and optimizations. Check out discussion our boards for the full changelog.\nUPDATE 5 - VALTOS IS HERE!New planet Valtos with four different locations: The Swamp, Ancient Breeze, The Old Forest and Green Dream\n2 new additions to Sam's arsenal: a bow with piercing/explosive arrows and the deadly Devastator\n6 new enemies\n1 new boss, as scary as it is slimy\nTons of fixes, tweaks and optimizations\nUPDATE 4Added cooperative for Shaanti planet.\nAdded Chinese localization (text).\nAdded four different firing modes for laser sword.\nSeveral stability fixes and optimizations.\nUPDATE 3New planet Shaanti with four different locations and five difficulty settings.\n3 new game mechanics.\n9 new enemies.\n1 new boss.\nLeft hand weapon is no longer mirrored, so eventual texts on it will not look inverted.\nScreen areas not visible due to HMD lens distortion are now masked and don't render, yielding better performance.\nFixed darker display on right eye when using RiftCat on some devices.\nMixed Reality now supports portrait camera mode. This makes it easier to fit a human actor inside the frame.\nSome menu buttons in some menus were clipped. Fixed. (Most notably in Mixed Reality Wizard, Credits menu, etc)\nImproved Performance auto-detection, for cases where single-pass VR rendering is used.\nFixed in-game menu sometimes not opening in front of player in room-scale setups.\nTons of stability fixes and optimizations.\nUPDATE 2Added two-player coop mode: play campaign with your friends online.\nAdded two new difficulty settings: tourist and serious (both in single player and coop mode).\nWeapon pricing inside store (shotgun is a little cheaper, laser ammo is a bit cheaper)\nAdjusted health of certain enemies (Khnum has less health)\nVarious bug fixes.\nVarious performance optimizations.\nUPDATE 1Added full support for Oculus Rift and Oculus Touch on SteamVR.\nAdded mixed reality setup wizard: https://youtu.be/c_An0vxvPnk\nnVidia VR SLI - Added support for nVidia VR SLI.\nIn multi-GPU setups, the game will now automatically use the GPU into which HMD is connected.\nMinor gameplay fixes and tweaks.\nVarious performance optimizations.\nAbout the GameHave you ever wondered what it's really like to be Serious Sam? Have you ever wanted to fight Mental's alien hordes with your own two hands? Well, now you can! Step into the shoes of the Earth Defense Force's greatest hero in this unique VR simulation based on Sam Stone's own log files from his time as captain of the Battlecruiser Saratoga. Experience the missions that turned Captain Stone into the legend that he is today.Key Features at Early Access Launch:\nTons of enemies – Hordes of attacking enemies have always been a trademark of the Serious Sam series, and Serious Sam: The Last Hope continues to deliver countless terrors in just one scene, harnessing the serious power of the Serious Engine 4.5.\nTons of guns – Dual-wield miniguns, tommy guns, heavy lasers, shotguns, and an assortment of other guns. Oh, and chainsaws, too! More then 10 different weapons, including the rocket launcher, were available from the beginning of Early Access, and Sam's lethal armory was regularly expanded and updated.\nPlanet-hopping action – Battle across treacherous Egyptian sands, in the pitch-dark under ancient ruins, and on the surface of Pladeon, the long-abandoned heart of a great industrial civilization. Early Access started out with two planets, each with four different locations, and more of Sam's adventures across the galaxy became available through updates. And that's not all - watch this space for more info on planned updates to the game.\nDick's back, too! - Featuring the voice of Serious Sam, John. J. Dick, dropping one-liners as you drop enemies.\nCry for Mummy – Defeat Mental's most powerful servants, starting with the Unholy Space Mummy of Gamma Pegasi, a huge, terrifying, undead monstrosity brought to life with dark magic - as dangerous as it is smelly! And that's just the first boss.\nHyper-immersive realism – Graphics so good that if you die in the simulation, you die in the real world!*\n*Might or might not be entirely true. But we tested it and we're pretty sure it works the other way around.Updated Features since Early Access Launch:\nThe Skills and Power-Ups system - a brand new system that will help you annihilate pesky aliens using special power-ups and upgrades.\nNew Planet: Arcadia - 5th planet (Arcadia Minor) with 4 different locations, one new devastating weapon, 4 new enemies and 1 giant boss.\nNew Planet: Valtos - 4th planet (Valtos) with 4 different locations, two new weapons, 6 new enemies and 1 new boss.\nNew Planet: Shaanti - 3rd planet (Shaanti) with 4 different locations and five difficulty settings, 9 new enemies and 1 new boss.\nNew game mechanics! - Added energy shields, laser swords, sniping mode and bow and arrows.\nCoop Mode - Play the campaign with your friends online.\nMore Difficulty Settings - Two new difficulty settings: Tourist and Serious (both in single player and coop mode).\nImproved save game system - it now allows you to continue a wave where you left-off in a previous session, there's no need to go through a planet in a single sitting.\nOculus Touch Support - Full support for Oculus Rift and Oculus Touch on SteamVR.\nMixed Reality Setup Wizard - https://youtu.be/c_An0vxvPnk\nnVidia VR SLI - Full support for nVidia VR SLI.\nLocalization - Added Chinese text.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":4207,"name":"When Vikings Attack!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46f/46f5d8a8aae5b01cbed2963f2ab451ab.jpg","description":"Compatible with PlayStation®Vita and PlayStation®3.\nBuy this product for PlayStation®Vita and get the PlayStation®3 version FOR FREE. After purchasing, simply head to the PlayStation®Store “Download List” for your PS3™ and you’ll find this product ready to be downloaded.\nOverview\nA scary battalion of mischievous Vikings has suddenly invaded Britain – over a thousand years too late.\nThe silly things may have forgotten their weapons, but they are still itching for a fight.\nControl gangs of civilians to pick up and throw whatever you can find at your foes – from road signs, to post boxes and vehicles. Be warned: the Vikings have the same plan so the art of dodging is just as important as having a good aim.\nDefend farms, fairgrounds, building sites and more from your enemies and then take on your friends in truly frenzied multiplayer battles.\nFeatures\n•\tPlay alongside up to three friends on PS3™ or PS Vita via Cross-play.\n•\tThrash your friends in fast, frantic and funny multiplayer battles.\n•\tCarry on playing wherever you are with Cross-save: start your game on PS3™ and then continue your adventures on PS Vita, or vice-versa.\nImportant Notices\n•\tGameplay requires PlayStation®Vita memory card (sold separately).\n•\tVisit eu.playstation.com to find out more about When Vikings Attack™ and the exciting world of PlayStation®Network.\n•\tYou can read this title’s instruction manual via its LiveArea™ – just select the question mark icon.\nCompatibility Notices:\n1 Player 650MB Minimum Space Required Microphone Dual Analog Sticks Network Players 2-4 Network Features PS3™ Cross-play PS3™ Cross-save Requires the PSVita and PS3 system versions of the software (may be sold separately).\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\n100KB Minimum\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n(c)2012 Sony Computer Entertainment Europe. Developed by Clever Beans.  When Vikings Attack! is a trademark of Sony Computer Entertainment Europe.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":280639,"name":"嗜血印 Bloody Spell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4a/b4a78a32128d53a457f37328212a7c59.jpg","description":"\"Bloody Spell\" is a martial arts action role-playing game. The core of the game is battle-oriented, and it combines many fighting elements and systems.\n\nTen years ago, Yejin and his sister Li went to practice martial arts under the sect of Wanfa. Since then, they have been far away from the complicated human world.Ten years later, the mysterious organization that claimed to be Void Legion invaded the sect,  and then the world was in chaos, and the brothers and sisters were reinvested in the chaotic world.The sisters who are dependent on each other are taken hostage, and the disciples have been killed in one by one... At the moment when the bloodthirsty spell is opened, Yejin who knows himself, can he fulfill his commitment to everyone? And who is the last to be able to help the building, to save the devastated world?\n\nIn terms of combat, this game uses multi-weapon switching as the main feature, and for each weapon in different speeds, power and positioning, design a variety of different skills, a variety of skills combo, greatly enhance the game cool feeling, excellent hitting and handling feel make it even better.\n\nThe highlight of the level design is the form of random combination, that is, the scenes, monsters, equipment, and configuration of the props that the player is reborn after death are different from before, so that the game presents diverse characteristics, increasing the level variables and The game is fun.\n\nThe \"Bloody Spell\" system is that, Yejin uses special skills in the body's evil spirit curse to achieve various effects such as violent walking, bullet time, roar breaking, assassination execution, counterattack and blood return, etc., which is to enhance the character's attack power and auxiliary combat. And to simplify the battle, add to the character and weapon attributes, and some even play a role in determining the battle.\n\nThe system makes the combat part more flexible, more selective and versatile, while also ensuring the smoothness and refreshment of the battle. In addition, many interesting side quests, diverse survey elements, and mini games interspersed with them greatly expand the game's fullness and playability.\nWe hope to see ten different players in ten different ways. If the enemy's threat is too great, you can use the bloodthirsty skills, assassinations, flying props, scene agencies to destroy them. Finally, please be careful in this Survive in the game.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"艺龙游戏","platforms":[{"id":0,"name":"PC"}]},{"id":50739,"name":"Witchfire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bd0/bd0e96314c71b5b0d192f23c8e8ab07e.jpg","description":"**Armed with strange weapons and forbidden pagan magic, hunt a powerful witch holding the key to your salvation. Witchfire is a dark fantasy roguelite shooter from the creators of Painkiller, Bulletstorm, and The Vanishing of Ethan Carter.**\n\n---\n\n# Dark Fantasy — With Guns!\n\n*Witchfire* is a first-person shooter from the creative leads behind *Painkiller* and *Bulletstorm*. A roguelite for people who hate roguelites, the game offers a challenging but satisfying gameplay experience, and with multiple roads to victory.\n\n# At War With Witches\n\nDesperate for a chance to triumph in the deadly war against witches, the Church calls on forbidden pagan magic to turn willing sinners into immortal witch hunters called preyers.\n\nArmed with powerful spells and fearsome firearms conjured by the best Vatican sorcerers, your mission is to find the infamous witch of the Black Sea, destroy the phantom army that protects her, and retrieve a mysterious artifact that can finally turn the tide of war.\n\n# Immersive Graphics in a Grimdark World\n\nLike The Astronauts’ previous title (*The Vanishing of Ethan Carter*), *Witchfire* uses photogrammetry technology to achieve stunning visuals and a grim, immersive dark fantasy world.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"The Astronauts","platforms":[{"id":0,"name":"PC"}]},{"id":40662,"name":"ArmA II: British Armed Forces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/975/975f889e7ec07a5a53b91092a12d28a8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":30245,"name":"Command & Conquer: Tiberian Sun","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9ab/9ab65947298e8e73a158c9d1961524f9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Westwood Studios","platforms":[{"id":0,"name":"PC"}]},{"id":23473,"name":"Zup! 5","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ae/9ae4e775b49ffb63b4f9c9b036f33f2a.jpg","description":"Minimal physical puzzle with explosions\n▪ 60+ Levels\n▪ 2100+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nExtended panels of Steam's backgrounds were invented by Aevoa","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":21030,"name":"Weird Park Trilogy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03b8ece6b093a4bf4cecbb106fb31f87.jpg","description":"Experience the complete saga of the strangest amusement park you ever see in the Weird Park Trilogy!Stop a Reign of Terror\nWhat’s behind a rash of mysterious deaths at a creepy amusement park? Find out in Weird Park: Broken Tune. The mysteries continue in Weird Park: Scary Tales. Complete the saga in Weird Park: The Final Show. Make your way through dozens of captivating scenes filled with the unique characters — everyday types, carnival show people, forbidding demons and more Over the course of your adventure, you’ll encounter terrifying creatures like Louis the Clown and Mr. Dudley and discover the twisted secrets that hide in every corner of the Weird Park!Three Must-See Chapters\nBe sure to take in the first two Weird Parks before the Finale Show. The series will be even more entertaining when played in sequential order. They're all here! The game pack includes a trio of must-see Weird Park hidden object adventure games:\nWeird Park: Broken Tune\nWeird Park: Scary Tales\nWeird Park: The Final Show Collector's Edition Features\nExtraordinarily thrilling adventures await. The Weird Park Trilogy is packed with exciting gameplay features, including:\n45 Lavish locations to explore\nAn arsenal of vital items\nIntricate hidden object scenes\nFun assortment of mini-games","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19790,"name":"Blind Trust","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/966/96606b3294c69129affb2a1b21c6f7c7.jpg","description":"Blind Trust is a two-player, cooperative game where the deaf leads the blind on a fantasy island. Navigate using only 3D sound as the blind Oracle, or lead the Oracle with magical sound beacons as the deaf Soldier. Work together to fight monsters, solve puzzles, and reach your ultimate goal.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nick Burnham","platforms":[{"id":0,"name":"PC"}]},{"id":18333,"name":"Mystery Of Rivenhallows","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b09/b096421c46541811e2dcc64c96e1dcdd.jpg","description":"Mystery Of Rivenhallows is an exciting adventure game full of mystery and suspense paying homage to the classic genre of point-and-click adventure gaming. It is the story of the Rivenhallows orphanage, a once peaceful and happy place until disturbing events shook its foundation. Children would vanish without a trace and authorities failed to uncover the truth. What happened to all the missing children? Where did they go, and why? What sinister deeds took place, and what secrets does the orphanage hold? Your chilling task as a former student is to return to the mansion to discover the truth. Experience a feature-packed adventure game full of surprises, challenging puzzles, cryptic clues, secret passages and ghosts! Find keys, examine objects, be observant to your surroundings, and check out every room in the house. Only by reaching the very end will you unveil the terrible truth to the shocking events that eventually shut down the orphanage.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":18310,"name":"Barnyard Mahjong 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d90/d908d39405ae90c12a00c886e51fc72f.jpg","description":"Barnyard Mahjong 3 takes you on a grand adventure around the farm playing challenging mahjong puzzles with farm-inspired animals such as horses, cows and chickens. The game includes 8 different worlds containing a total of 640 puzzle layouts to enjoy in classic 2D and glorious 3D. No two games will ever play the same as tiles are laid out randomly when you play. Great features such as a built-in tutorial, scoring system, cute sound effects and relaxing music adds to the fun. Suitable to players of all ages and experience levels, Barnyard Mahjong 3 offers a contemporary version of the popular Chinese classic, and is a must-have download in your game collection today.KEY FEATURES640 Mahjong Puzzles To Solve\n8 Worlds To Complete\nClassic 2D & Rich 3D Environments\nRandom Tile Layout\nGreat Graphics, Audio & Score","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":18247,"name":"The Great Art Race","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/84c/84c0037b6710f73381e3e0411e4ed57f.jpg","description":"The famous art collection of your family was stolen. By investing the profits of your coffee or tobacco plantations you might have the chance to save the heritage of your ancestors – but only if you manage your colonial enterprise wisely.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"ASCARON Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":15006,"name":"The Cubicle.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f6/7f655cb5aca4d049e2224098602dc2a9.jpg","description":"Enter the magical world of a regular office with all the wonders of paperwork, files and other office related objects. Learn how to master the work of a real office man. Such as moving objects, sorting files, taking care of your children and other office related pursuits.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Roel van Beek","platforms":[{"id":0,"name":"PC"}]},{"id":12944,"name":"Crash Drive 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/caa/caa4b8de38ce90eda43edac6df5bce6a.jpg","description":"Get ready for ridiculous fun in this multiplayer free-roaming stunting game. Drive a bus, tank or  monster truck, speed across huge open worlds and participate in random events. Stunt across outrageous maps packed with plenty of bizarre terrain for an intense experience. Collect coins, level up your ride, and WIN the offroad race. Crash Drive 2 will drive you mad!\nCrash Drive 2 features include:\n4 vast open worlds to explore; Can you find all the secret areas…?\n6 random competitive events: Coin Collect, King of the Crown, Race, Tag, Stunt and Find the Ring\nRPG-inspired car-leveling system; 35 unique upgradable vehicles to unlock\n5 devastating customizable tanks in a special tank battle game mode; Destroy your opponents’ tanks and level up your Battle rating\nTeam up with your friends: Every purchase grants an extra copy that you can gift a friend!\nCross platform multiplayer and single-player (PC & mobile): No matter which platform you play on, you can always play with your buddies or take on the AI\nCrash Drive 2 is best played with friends. In order to have the best experience, we’re rewarding every buyer with the following; when purchasing this game an extra Crash Drive 2 copy is added to your steam inventory to gift to a friend for free! Please review the following guide for instructions on how to do so: http://steamcommunity.com/sharedfiles/filedetails/?id=448954967\nWe at M2H love games with a lot of freedom. It’s no surprise that this is the very core of Crash Drive 2. Drive around freely and explore the open world at your leisure. Find the best areas to score points, discover secret areas and search for the shady dealer.\nRandom events offer fun challenges to any player that wishes to participate. This allows you to\nunlock new levels and earn cash to buy new cars.\nThese random events include:\nCoin Collect: Coins fall from the sky: pickup the most valuable coins!\nKing of the Crown: Hold the crown for 60 seconds while other players try to steal it. Guaranteed adrenaline rushes when 7 players are on your tail trying to crash into you.\nRace: Be the first to finish on various racing tracks.\nTag: Tag the most objects by claiming them via stunts. Make sure you score enough points otherwise someone else can steal your tag.\nStunt: Score the most points in a limited time, discover the best places to stunt.\nFind the Ring: Be the first to pass through a specific ring.\nWhen starting a game of Crash Drive 2 you will be automatically matched while playing. This guarantees populated matches and saving you the hassle of finding an active match. All game “rooms” reserve extra friend slots (10 players per game) so that your friends can ALWAYS join you through the Steam friend join feature.\nWhenever an online connection is not available, the game smoothly transitions into a fully playable singleplayer version. Connectivity is never a problem!\nReady for a car RPG leveling system that we’ve gone crazy?!\nEvery car has four statistics: top speed, nitro, acceleration and grip. By using nitro, you increase this car’s nitro capacity, by driving at top speed you increase your top speed...you get the drift? When a car has all of it’s four statistics raised to 10/10, you will gain an overall level which allows you to buy a new car and earns you prestige on the in-game scoreboard and the Steam leaderboard.\nSince the tank is such a popular vehicle in the main game modes, we decided to dedicate one entire game mode to it. In CD2: Tank Battles you choose one of five unique tanks and strive to dominate the arena. Shoot or bump opponents off this sky arena to score points, extra points are awarded for special achievements such as multi kills, revenge, air shots and so on.\nWhen playing this game mode offline, bots(A.I.) will fill the opponent slots. This way the singleplayer is also fully playable.\nCrash Drive 2 originally started as a tablet game. The following features set the Steam version apart from the original:\nThe steam version does not have advertisements nor \"in-app\" purchases\nA big starting cash boost of 200,000 extra cash (would’ve cost over $5 in the original tablet game)\nOptimized for PC, Mac and Linux; better graphics, performance and controller support\nFurther fixes and small tweaks to the game\nSteam integration (including friend joining, achievements and leaderboard)\nIncludes a free giftable copy of the game to share with a friend\nCross Platform multiplayer between PC,WEB and Mobile/Tablet","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"M2H","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":12744,"name":"Gravel","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47d/47dabe0393d233fc70d3ad4610484b0f.jpg","description":"GRAVEL: THE ULTIMATE OFF-ROAD EXPERIENCE!\nGravel is the ultimate off-road experience. The most extreme racing game that will let you try out amazing stunts in the wildest places on the planet!\nPure fun, spectacular scenery and no-holds barred competition where each race will turn into a memorable battle!\nTake part in the wildest show on the Gravel Channel web TV, travel around the world to discover the wide variety of environments and be amazed by the visually impressive quality!\nEnjoy four different disciplines – Cross Country, Wild Rush, Stadium and Speed cross – to live the driving experience with the most extreme vehicles on any type of terrain.MAIN FEATURES\nA COMPLETE OFF-ROAD EXPERIENCE\nTake a tour around the world to discover the range of extreme and wild environments that will offer you a fully off-road experience.\nThere are four disciplines where you can compete with the most powerful cars.\nCross Country: Huge areas with different layouts, perfect for competing in checkpoint races in the most evocative landscapes. Run through a waterfall with the aurora borealis as backdrop or try the right grip in the largest deserts in the world.\nWild Rush: The wildest locations where you can compete in lap races. Unique environments with natural obstacles that will force you to race your way through the slopes of a mountain, on paradise islands, and through masses of debris and quarry rocks.\nSpeed Cross: Races set in the most beautiful tracks in the world. Real-world tracks, from Europe to America, where you can show your skills in incredible jumps and chicanes.\nStadium: Real and fictional arenas, full of jumps and spectacular layouts!\nFUN AND REWARDING\nFun and excitement are the main rules!\nGravel is adrenaline, pure fun, spectacle.\nThe game's physics is accessible and immediate and allows you to express all your driving skills and boldness during each competition.\nHair-raising bends, tussles, extreme jumps and treacherous terrain for an always different and increasingly dangerous gameplay experience.\nThere are many offline and online game modes that let you compete against human opponents!\nON AIR ON GRAVEL CHANNEL\nMeet the off-road Masters and find your way on the wildest show on TV at Gravel Channel!\nSix episodes broadcast from the most extreme and wildest corners of the planet to win the title of World Champion.\nThe Masters of the several disciplines in the game will challenge you in head-to-head races to determine who really is the best. And when the championship is over, the challenge is still not complete: take part in the final race to become an Off-Road Master. Only after beating the current titleholder you can step on the podium and raise the cup to the sky!\nSo turn on the TV and enjoy the first episode!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Milestone","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":12183,"name":"Warhammer 40,000: Sanctus Reach","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5cc/5ccbf77a49a31d3064bd600965223447.jpg","description":"Warhammer 40,000: Sanctus Reach brings you to a dark era of carnage and endless war. There is no peace among the stars: the Imperium of Man is beset on all sides by all kinds of threats. Among them is the Orks, a barbaric and warlike xeno race. One of their fiercest leaders, Grukk Face-Rippa, leads his Red Waaagh! in the Sanctus Reach system. Worlds after worlds fall to billions of Orks, until only one last planet resists the green tide: the Knight World of Alaric Prime. This is where a brave company of Space Wolves makes its stand to defend the last bastion of mankind in the system…\nWarhammer 40,000: Sanctus Reach is a 3D turn-based strategy game like you’ve never seen before: fast, immediate, deep, impressive to look at and incredibly fun! Lead the Space Wolves in their struggle against the Orks through two uncompromising and long story-driven campaigns: Stormclaw and Hour of the Wolf. Command several dozen different authentically crafted units and heroes, with unique and extremely detailed 3D models that bring the universe of Warhammer 40,000 to life.\nThe gameplay is rich and varied: spend your points, make your list, choose your deployment, and fight! Units at your disposal have different abilities, strengths and weaknesses, can level up and are carried over between scenarios. Choose among many different types of weapons, watch your flanks and make a wise use of the terrain: any tactical choice will be vital.\nWith a campaign system, a skirmish mode, a map generator and multiplayer PBEM++ support the game offers endless replaybility.\n\nFeatures:\n•\tLead either the Space Wolves Space Marines in the campaign or the green tide of the Orks in skirmish battles!\n•\tTwo campaigns: Stormclaw (over 20 missions and skirmishes!) and Hour of the Wolf (over 25 missions and skirmishes!)\n•\tPlay as the mighty Space Wolf heroes Krom Dragongaze, Ragnar Blackmane and their Jarl, the High King of Fenris, Logan Grimnar as well as the Ork Warbosses Grukk FaceRippa and Mogrok da Mangla\n•\t30 Space Wolf units from packs of Blood Claws to the fearsome Predator – And lead the legendary Imperial Knight Gerantius!\n•\t30 Ork Goff units including the formidable Gorkonaut!\n•\tUnit experience level progression though campaigns which unlock new abilities and tactical options\n•\tGenerated skirmish maps on many different types of terrain and environment\n•\tAddictive multiplayer modes using Slitherine’s online PBEM++ server","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Straylight Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":3117,"name":"Just Dance 2016","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c53/c53f76dc4eb1bba8ef20d6a1fdb2eb8d.jpg","description":"Includes the full game plus a 48 hour subscription to Just Dance Unlimited!  Introducing Just Dance 2016 - the newest game from the top-selling franchise - with a brand new way to play! All you need is your smartphone and the Just Dance Controller App to play Just Dance 2016 on PS4™ system, no PlayStation®Camera or PlayStation®Move needed.\nBust a move to “Uptown Funk” by Mark Ronson Ft. Bruno Mars and feel the beat in “All About That Bass” by Meghan Trainor - Just Dance 2016 features an amazing tracklist with visuals that are more creative and breath-taking than ever before. Join over 100MM players and dance to fun favorites and hot hits, today!\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n1-6 players\nNetwork Players 2-6\n1080p HD Video Output\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 Ubisoft Entertainment. All Rights Reserved. Just Dance, Ubisoft, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the US and/or other countries.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":598884,"name":"Infinitode 2 - Infinite Tower Defense","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/337/3379fa193527ee797373e61eec2dd84d.jpg","description":"A strategy in the Tower Defense genre, in which the player will have to build towers to protect his base from endless waves of enemies.\nThe player will be a volunteer in the Artificial Intelligence training program and will gradually discover new towers, abilities and ways to mine resources.\nEndless variety of maps\nThe game has 6 game stages and 50+ unique levels with inimitable chiptune compositions, as well as a map editor. Live leaderboards at each level and unique bosses at the end of each stage.\nTowers\nThe game has 15+ different types of towers with unique characteristics and skills, effective against different enemies. New towers become available during the passage of the storyline.\nTowers gain experience, which further increases their strength and allows the player to choose unique abilities. Each tower can be upgraded up to level 10, which improves its main characteristics.\nModifiers\nThe game has modifiers that enhance the characteristics of neighboring towers, increase the speed of mining and give other bonuses.\nResearch\n400+ unique research that unlock additional abilities and improve the stats of towers. Endless research tree is available in an Endless mode.\nMining\nAt all levels, even custom ones, you can mine resources to research new technologies and improve characteristics. Miners are also improved by research and can bring nice bonuses.\nAdditional functions\nSave game progress in the cloud, sync with Android and iOSMap editor with the ability to create your own, unique levels 36+ trophies that also give bonuses to the player Music player with all the game tracks Detailed statistics for each game Crafting of resources and unique items\nThe game does not end there - the player may continue to improve his research tree and compete for unique prizes in the leaderboard for pleasure and glory.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Prineside","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":428357,"name":"POLYGON","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/450/450d178f502df28c236978cbeb7c0fb4.jpg","description":"JOIN US ON DISCORD!\nhttps://discord.gg/4zDbthp\nAbout the GamePOLYGON is a dynamic multiplayer team first-person shooter. You have to battle on large-scale maps using various weapons with up to 32 players. Properly managing your existing arsenal and skills, you have to lead your team to victory!\nPlayers fight on the battlefield in furious PvP matches. Up to 16 players stand on each side. Swift battles take place between them!\nChoose one of the many available weapons, each has a real prototype, and customize it to your style: change sights and other modules. Сollect unique weapons!\nThe game is constantly being improved! Change the outcome of the battle using new weapons and skills. Team up with friends and explore new locations.\nIntuitive controls and obvious gameplay will make your acquaintance with the game simple and fun. Thanks to the Unreal Engine, the game can be run on outdated PCs. But it will show all its capabilities on modern computers. Launched by cutting-edge innovations, the Unreal engine gives the POLYGON game amazing graphics!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Redaster Studio","platforms":[{"id":0,"name":"PC"}]},{"id":370201,"name":"Black Skylands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e50/e5064fc7975cab9340c4e3e7d21fa181.jpg","description":"Earth turned into thousands of islands. In the new world you have to fight the swarm hidden in the depths of the Black Islands.\nThe gameplay is divided into battles in the sky and on land. Explore a sprawling open world. Try RPG elements: 100 types of weapons, different bullets,  player and ship upgrades, special abilities -- and so much more.\nExplore the dangerous world of Skylands, containing more than 50 islands, which include forest, desert, farm, and urban biomes, and the mysterious Black Skylands themselves.\nHarness the power of 25+ different weapons, using various weapon special abbilities to destroy your foes. Level up in the world by unlocking ship and player upgrades, and experience the unique special abilities granted by the 10 ancient artifacts, scattered throughout the Skylands.\nOpen World\nSpecial Abilities\nRPG Elements\nJetpack\nFauna\nDay-Night Cycle\nDiscover the secrets of Black Skylands!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Hungry Couch Games","platforms":[{"id":0,"name":"PC"}]},{"id":21195,"name":"7 Wonders: Ancient Alien Makeover","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b23/b2314eb307224341aa4dad491aa8ce14.jpg","description":"The long-standing 7 Wonders series keeps getting better and better! The fifth installment, 7 Wonders: Ancient Alien Makeover, adds an entirely new game component, new Wonders and a new and exciting material – Alien Energy!\nThe goal is still to construct exciting new Wonders by swapping same-colored runes to make matches of three or more to the tune of exploding bonuses. Make enough matches before time runs out to fill your arsenal with power-ups and the materials needed to complete your Wonders before your very eyes! As you complete each game board, bricks, water, gems, landscape, and now – Alien Energy! Excel and face bonus levels that take you deep below the earth’s surface to win materials like gold to adorn your Wonders! There is also, for the first time, a secondary game component to build a village! Mini-games rewards players with buildings and decorations to create their own village. Build all 7 Wonders and then unlock a magical 8th location, Nazca Valley! New game play and new Wonders await in Ancient Alien Makeover!\nKey Features:\n56+ addictive and challenging levels\nExpanded play field\nNew “alien energy” construction material!\nNew village component\n4 difficulty modes including “Zen” which has no timer.\nPlayers earn a star rating for the completion of any Wonder. There is replay value to improving the star rating from a 2 to a 4 because it will lead to unlocking the Bonus Wonder and more things to decorate the village.\nPlayers can earn a wide variety of achievements which are displayed in a trophy room.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":20021,"name":"Trucks & Trailers","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d50/d5063cf333eaad5327d273270f30816a.jpg","description":"Trucks & Trailers puts your driving skills to the ultimate test with 50 individual truck driving challenges. Compete against the clock to complete intricately designed courses and tasks that put you firmly into the driver's seat. Can you avoid obstacles whilst reversing a trailer? Do you have the lateral thinking required to sort a series of trucks & trailers in the yard into their correct positions? Can you park with precision?\nAs your skills increase, upgrading the difficulty level will guarantee that there is always a task that will put you and your truck to the ultimate test! At the highest difficulty setting external camera views are disabled, forcing you to maneuver like the pros using only in-cab mirrors. A test that will award you the gold medals and the honor of being a real trucking titan!Key features\n50+ challenges, with achievements and awards, guarantees you will want to keep on truckin'\nIncredible 3D graphics that bring beautifully detailed trucks and trailers to life\nMultiple camera views of an intricate 3D world\nFrom the makers of truck simulation games in the 18 Wheels of Steel series and the Euro Truck Simulator series","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"SCS Software","platforms":[{"id":0,"name":"PC"}]},{"id":19977,"name":"Time Mysteries: Inheritance - Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/693/693a27c7caaf9e6a3eba60c10b6feec4.jpg","description":"Time Mysteries: Inheritance – Remastered is an enhanced version of one of the most important games in Artifex Mundi’s portfolio and the first chapter of an exciting trilogy of time travel games from 2010. Vivien Ambrose, a young doctor of physics, goes to her father’s house to celebrate a recent scientific achievement. When she gets there, she finds out her dad is nowhere to be found.\nWhile looking for clues to her father’s disappearance, our protagonist finds a strange letter, which bestows upon her an unexpected family inheritance: seven magic rings and a crystal ball. These mysterious items will grant her the power to travel through time.\nThe artefact gives Vivian a glimpse into her father’s fate: for reasons unknown, he has been abducted by a mysterious Time Traveller.\nOur heroine goes on a dangerous journey through time and space, determined to find her father. Little does she expect that the journey will reveal an age-old family secret.\nVivien will have to use all of her wits to solve challenging puzzles, uncover dark secrets, collect the magic rings and save her father.\nWill Vivien accomplish her goals and defeat the Time Traveller?\nFeaturesThe Mysterious Nexus Machine – travel through time and space!\n27 varied minigames and 31 scenes containing hidden objects!\n24 atmospheric hand-drawn locations!\n10 mysterious characters!The Remastered edition includesFully voiced dialogue – each character now has a distinct voice!\nRedesigned user interface!\n5 all-new cutscenes!\nEnhanced visuals in numerous locations!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19527,"name":"CivCity: Rome","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49b/49bd1cb73e928f1e0b68c9c7768b34b6.jpg","description":"CivCity: Rome, an innovative city builder inspired by the world of Sid Meiers Civilization, and created by a collaboration between Firefly Studios and Firaxis Games, invites players to shift focus from building a multi-city empire and zoom-in on the great cities of the Roman Empire, culminating in Rome itself! Through dozens of missions, each offering an array of interesting decisions, players will be charged with building, nurturing and managing one of these great cities as they endeavour to lead the Roman Empire from its humble beginnings to its mighty apogee. Features players have enjoyed in the Civilization series, like research, city happiness, production and culture, can now be managed actively in the wonderfully immersive world of CivCity: Rome.\nLook inside the buildings - For the first time in a city builder you can look inside the Villas, the forums, and even the Roman baths! Discover, in much greater detail, how Romans went about their daily lives.\nCivilize your city - More than 70 technologies can be developed over time to give your city a strategic advantage. Use the rich research tree to improve many aspects of your city and its relation to the wider empire.\nFollow the life of a Roman family - Do they thrive and prosper from humble hut to noble palace as they move through the generations or not? Well, thats your call!\nEase of play - Driven purely by building placement and strong visual feedback, the game lets you create your own living community simply by choosing and placing the wide variety of buildings.\nReal Romans - An intriguing array of characters will interact with you","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"}]},{"id":18837,"name":"Abrix for kids","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9a/f9a0ddd358a03a149d0b4f30a17a72a1.jpg","description":"\"Abrix for Kids\" is an engaging logical game for players at the age of 5 up to 105. The new part of adventures of a likeable robot includes a new challenge – nasty gnomes trying to stop a small robot from reaching the exit. However, there is a way to do it! Push the container towards a gnome or shoot at him with a laser gun or a fire ball, and he will be changed into a small pile of precious coins. Is this the gnome who was holding a pot of gold at the end of the rainbow? See it for yourself!\nVisit 100 new stunning spaces at different difficulty levels - from easy to intermediate.\nTake up new challenges and regain the gold stolen by the gnomes.\nComplete Steam achievements and collect trading cards.\nCreate your own levels using an intuitive editor and share them with your friends at Steam Workshop.\nAbrix for Kids is the continuation of the hit “Abrix the Robot”, which received a lot of positive and enthusiastic opinions from the players. This time it is presented as a slightly easier version, without difficult and extreme spaces, but with an extra dose of humour and great fun instead. What are you waiting for? See it for yourself! But be careful – Abrix will engage you so much that you will spend lots of hours playing it.\nStill not enough of challenges in the Abrix world? Don’t worry! Abrix will be back soon with the next part of “Abrix Adventures”.\nVisit also first part of Abrix: http://store.steampowered.com/app/461850","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EJRGames","platforms":[{"id":0,"name":"PC"}]},{"id":17142,"name":"Monster Bash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/791/791ac7b14b86df4fc498dca19f67922c.jpg","description":"Monster Bash is full of scary action and haunting puzzles. No previous Apogee game has featured so much animation. Johnny can climb, crawl, shoot his multi-directional slingshot, fly a broom, and much, much more. His super-charged slingshot can shoot rocks, rockets, fireballs, and other surprises. There also more enemy creatures and monsters than ever seen in an Apogee game.Features\nMonster Memory: Over 8 megs of compressed animated and scrolling EGA graphics.\nBattle Beasts: Over two dozen uniquely-animated monsters to battle with joystick suppprt.\nBash 'em 'n' Smash 'em: Boss monsters that seem invincible - find their hidden weaknesses!\nSavage Sounds: Digitized sound and voice effects and awesome animated sequences.\nCreature Comforts: Three skill levels; save and restore up to 10 games; built-in hints\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16456,"name":"Woolfe - The Red Hood Diaries","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ae/3ae350dcd1263bedccf382c3fcbae786.jpg","description":"Woolfe – The Red Hood Diaries is a cinematic fable featuring a vengeful Red Riding Hood. All grown up, cried out and armed with an axe, our noble heroine embarks on an odyssey to avenge the death of her parents. Buckle up for a surprising take on the traditional Red Riding Hood tale, mixed with some good old-fashioned action platforming, fun combo-based hack ‘n slash combat and rewarding environment puzzles that explore the attractive fantasy universe.“THIS IS NOT A FAIRYTALE, THERE’S NOTHING FAIR ABOUT IT”\nKEY FEATURES\nA twisted fairytale – This take on the Red Riding Hood legacy is not an ordinary bedtime story. Four years ago, Red Riding Hood’s father Joseph, lead engineer for Woolfe Industries, died in a work accident. At least, that’s what his family was told. All grown up, our heroine is ready to unveil the truth and present the bill for her tragic loss.\nA rich, visual experience – Woolfe's atmospheric artwork immerses the player in a rich fantasy universe centred on a city paralyzed with fear, occupied by tin soldiers. Sneak through the slums, descend into the sewers, run through the harbour and escape the city into the evil forest, where all manner of creatures are out to get you.\n2.5D action-platforming – The tale’s 2.5D levels combine the simplicity of side-scrolling gameplay with three-dimensional puzzle-solving.\nFast axe-wielding combat – Armed with her trusty axe, Red will need to skilfully execute combos to strike at her foes' weaknesses.\nDeranged fairytale enemies – On her journey, Red faces some bloody encounters with “familiar fairytale faces”, such as The Pied Piper, tin soldiers, big bad wolves, scary fairies and (of course) her arch-nemesis, B.B. Woolfe.STORY\nRed leaves her Granny and her safe place, the forest, and heads back to the city, which she finds paralyzed with fear and scarred by a plague of kidnappings. B.B. Woolfe, CEO of Woolfe Industries, rules with an iron fist and maintains a constant state of fear through his army of henchmen. Our fearless young protagonist sets out on a violent vendetta against the megalomaniac, whom she holds responsible for her father’s death. Level by level, she learns more about her father and what happened on that dreadful night – and, ultimately, about Woolfe’s hidden secrets, which are even darker than Red could ever have imagined.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"GRIN","platforms":[{"id":0,"name":"PC"}]},{"id":16321,"name":"Mahsung Deluxe","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/753/7536d06c2494e1d83af3306076d17527.jpg","description":"Mahsung Deluxe is a unique blend of mahjong, concentration and puzzle solving cleverly combined into a single great game with 50 mind-bending challenges. Your task is to remove all tiles from the board by pairing up similar tiles.  Tile matches are only possible if a line can interconnect both tiles using no more than 3 segments (2 corners). A straight line can remove neighboring tiles that match. Wall-tiles are obstacles and part of the environment. On trickier levels, some tile images are hidden behind a “?” symbol and needs to be flipped and memorized for a correct match.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":16314,"name":"Dessert Storm","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ac/1acc35eccab9c012d8e17813d507eff3.jpg","description":"Dessert Storm is the sweetest Match-3 puzzler you will ever play! Your task is to switch desserts in order to match lines of three of more. An adorable ice cream man will cheer you along as you complete randomized puzzles. Suitable to players of all ages and experience levels, this cheery and colorful game offers multiple modes of play. RELAX mode is ideal to introductory players seeking a laid-back and casual gameplay experience. CLASSIC mode has 21 exciting levels to beat, and only experienced players will achieve top-star ratings across all levels. RUSH mode is a match made in heaven to expert players in a sugar rush challenge against a decreasing points-system.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16074,"name":"Faery - Legends of Avalon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/681/681e10979728ae30c0fbacb996011cf1.jpg","description":"Faery: Legends of Avalon is a big role playing game packed with a very distinctive ambience and graphic style. Create your character, embark in a great adventure and discover the fantastic world of Avalon!\nYou will have to understand why this magic world is dying, and save the kingdom from certain disappearance. In a thrilling adventure where your choices will shape the story, develop your character, his abilities and special powers, as well as his equipment through the victorious battles and accomplished quests!\nNumerous dangers await you and the battles against some of the creatures and monsters of the game promise to be formidable. Gain power and experience, and assure the support of friendly companions you will meet through your journey. Carefully select who will fight at your side, and live the incredible experience of being accompanied by a dragon, a troll, fairies and other fantastic creatures!\n- Gorgeous graphics packed in a unique atmosphere.\n- Explore mythical and magical places, meet plenty of colourful characters.\n- Battle in turn-based fights, in the pure style of classic RPGs\n- Develop your character through victory: choose new spells, skills, and find new equipment/\n- Recruit charismatic companions to help you in your quest!","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Spiders","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":15282,"name":"Deepworld","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/086/086cbb3758c3935551d2f00b5bc54b53.jpg","description":"Deepworld is a massively-multiplayer 2D crafting adventure game. Mine and craft your way through a persistent online universe where there's always something new to discover!\nFind your way through mountains, caves, and ruins filled with danger and reward, or venture into cities built by fellow players.\nDeepworld is always online in the cloud, so it's easy to hop on and play with your friends! Follow them in-game and easily find them when you play.\nMine and craft hundreds of different items with Deepworld's easy inventory system. Place them anywhere in the world to build your very own cityscapes.\nRecover lost pieces of technology to build machines that restore the environment and make your world a more interesting place.\nUse different weapons and protective devices to fight monsters of the deep, mysterious automatons, and other players in PvP.\nComplete objectives to win achievements and earn XP and skill points, which can be used to beef up your character's dexterity, mining ability, and more.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bytebin","platforms":[{"id":0,"name":"PC"}]},{"id":11721,"name":"Oh...Sir! The Hollywood Roast","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/02a/02a4ca91deb1f9b9482257bb582f82c0.jpg","description":"The boys & girls are back, and they look better than ever! Oh…Sir! The Hollywood roast is a brand new spinoff to the surprise indie hit 0f 2016, Oh…Sir!! The Insult Simulator. This time around we’re taking tinsel town down a few notches, whilst classing up the joint. Play as one of many famous, but for legal purposes, slightly different pop culture icons and verbally spar with other Hollywood elitists using a deep battle system\nVerbally joust by yourself or take you verbal skills on a global PR tour and battle friends and family from anywhere in the world.Game Features\nUnleash the sickest burns on your opponents in a Hollywood-style roast\nPlay alone, online or couch multiplayer\nDeeper-than-you-think mechanics featuring combos, continuations and exploiting your rival’s weak spots\nA star-studded new cast of crazy Hollywood characters\nFree updates with new characters and scenes coming soon to a screen in your house\nSet the scene with a slew of iconic film backdrops\nWith the new Character Creation Mode powered by Steam Whatever, you can create your own formulaic celebrity clones in a lab-- just like they do in real Hollywood!\nNew controller integration that critics everywhere are calling “gripping”\nWith more than 2x the vocabulary of the original Oh...Sir!! The Insult Simulator, The Hollywood Roast is Bigger, ruder and insultier!\nNew comeback mechanic: charge your anger and finish the sentence with a unique closure\nExpanded career mode: master each scene to win Golden Parrots and use them to develop your character\nRedesigned scoring system: more fair, more clear.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":11558,"name":"HERO DEFENSE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/183/183281fee332fbb9f74bba8e46c4b442.jpg","description":"HERO DEFENSE challenges fans from MOBAs, RPGs and Tower Defense games to strategically manoeuvre their upgradeable heroes to destroy hordes of sinister creeps.\nTake charge of five unique heroes that battle their way through various arenas to defeat Count Necrosis.\nIn order to destroy the world’s most powerful vampire, your team of slayers must impale, slash, tear and burn through legions of undead hell-bent on world domination.\nCustomize your heroes through a deep RPG layer featuring upgradeable weapons and rich character skill trees.\nA long lasting multiplayer experience gives enthusiasts the possibility to dominate the worldwide ladder for loot and precious runes.\nLiberate your island, assemble your team and enjoy hours of a narrated story\nReplay procedurally generated enemies and endless mode challenges\nSucceed over bosses that possess special abilities\nKill creeps fast to punish the enemy in an innovative mix of MOBA and Tower Defense\nBattle other players in ranked or unranked matches\nDefeat opponents with strategies or brute force to earn unique runes\nGather Achievements to show your friends your gaming prowess!\nSave to the Cloud. Never lose your savegames and play on all your devices!\nTrading Cards – Gather the set for HERO DEFENSE\nModify weapons by collecting and socketing powerful runes\nCustomize rune builds for devastating combos and skill-synergies\nBuild hero shrines to empower your characters during battle\nGain XP to access and level up each hero’s individual skill tree\nGather loot and equip spells that freeze, burn and poison the undead\nRebuild your town and unlock new buildings","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Headup Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":392384,"name":"Necesse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e5/0e55a42600e597bc3cff75743b6f0620.jpg","description":"Start your adventure and explore the infinite procedural generated world of Necesse. Mine, fight and craft to gear up and conquer powerful enemies that drop unique items. Set sail to visit other islands containing villages, dungeons and other secrets or start your own settlement by building houses for settlers to move into.\nFeatures include:\nTravel alone or invite your friends as companions. The game can be played solo or with multiple players from the beginning, and progress through scaled bosses to the end.\nYour character will never be locked to one build. Choose your weapon and gear to fight, change it up at any time, or mix and match to find the best setup for the situation.\nGo underground, mine ores and find treasure to craft better armor and weapons.\nBuild a farm to supply yourself with powerful potions and buffs that will help you progress through the game.\nExplore the world of different bosses, monsters, biomes, villages, dungeons and more.\nBuild settlements for NPC's to move into, trade items with them to get better gear in preparation for the next challenge.\nFind, collect and style up with cosmetics, pets and mounts.\nCreate circuit networks and traps to kill incoming enemies.\nHost a dedicated server for you and your friends to play on.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mads Skovgaard","platforms":[{"id":0,"name":"PC"}]},{"id":45265,"name":"The Metronomicon: Slay the Dance Floor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ec/1ec637e3a2157ec9d239da387f0991d3.jpg","description":"\"Save the World from Magical Party Crashers\"\nPacking in a full-fledged story mode with a colorful cast of musically-empowered heroes and villains, The Metronomicon sees you take control a party of eight new masters of the “rhythmic combat arts” to wage musical warfare against a multitude of dance-mongering fiends. Control up to four concurrent heroes as they cast powerful spells, buff their teammates, and beat down their enemies with a variety of magical loot and groovin’ dance moves. The effectiveness of your team is all in the rhythm, so put on your dancing pants, light up dad’s disco ball, and prepare your body for The Metronomicon. Oh, and did I mention couch co-op? Because nothing's better than an armored dance partner.\n\"Power Up Your Dancing, Moves, and Gear\"\nWould you like a side of RPG to your rhythm game? Too bad, because you're getting TWO MAIN COURSES. Hunt for epic loot, unlock new stylin' dance spells, and recruit new heroes to join your party. Tank, heal, buff, and dish out the damage in real-time musical combat to conquer your foes.\n\"Check Out My Mixtape\"\nThe Metronomicon features a fantastic, ear-blistering soundtrack featuring some of the hottest electronic, synthwave, chiptune and indie artists, including an exclusive track from Jimmy Urine of Mindless Self Indulgence, an unreleased track from Shiny Toy Guns, along with tracks from YACHT, Perturbator, J-Punch, Dj CUTMAN, and many, many more. We're also always adding new music, so the party never ends!\n\"Play Until Your Ears Turn Pointy\"\nGame modes you ask? We got: Story, Arena, Freeplay and Daily Challenges. But wait, there's more... But, you've gotta discover those yourself. \"The Metronomicon features a fantastic, fully-licensed soundtrack featuring some of the hottest electronic, synthwave, chiptune and indie artists, including an exclusive track from Jimmy Urine of Mindless Self Indulgence, an unreleased track from Shiny Toy Guns, along with tracks from YACHT, Perturbator, J-Punch, Dj CUTMAN, and many, many more. As much a soundscape as it is a soundtrack, the music behind The Metronomicon is set to be every bit as varied and exciting as the gameplay itself.\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Akupara Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":39092,"name":"Grand Theft Auto IV: The Lost and Damned","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/809/809c9eaa483f647c510d8c20e0e8a7cb.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rockstar North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":27256,"name":"The Legend of Zelda: Oracle of Ages","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e0/0e02b3c6aaf4bf6d7a59f8c001bb3fac.jpg","description":"Transcend the very fabric of time with the Harp of Ages. Rescue Nayru, \n      the Oracle of Ages, to save the Land of Labrynna from Veran, Sorceress \n      of Shadows, who will pitch the world into an endless night.\n    \n      Travelling through time presents Link with unique challenges. If a river \n      blocks Link's path in the present, he can travel to the past and move a \n      stone, redirecting the flow of water. If he plants seeds in the past, \n      he'll find full-grown trees and vines when he returns to the present.\n    \n      SAVE THE ORACLES\n    \n      Released on the Game Boy™ Color system in 2001, The Legend of Zelda™: \n      Oracle of Ages™ and The Legend of Zelda™: Oracle of Seasons™ represent \n      the pinnacle of classic 2D Zelda gameplay. Now you can play these \n      classics on your Nintendo 3DS™ system!\n    \n      When played together, these two games offer an ultimate adventure not \n      possible when each game is experienced on its own. The games feature a \n      link system that unlocks access to additional content that you can't \n      access any other way.\n    This game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy Color"}]},{"id":27255,"name":"The Legend of Zelda: Oracle of Seasons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8ab43c6316d0b5bf16039345867e025a.jpg","description":"Transform the world around you with the Rod of Seasons, and create order\nfrom chaos. Stop a power-hungry general named Onox, and rescue Din, the\nOracle of Seasons, to save the troubled land of Holodrum.\n\nChange the seasons to overcome puzzling obstacles. If Link finds a small\nplant at the bottom of a cliff, change the season to summer, and Link\ncan use the newly grown Deku Flower to boost up to the top. If Link\nfaces a deep lake, use the Rod of Seasons to shift into winter, letting\nLink walk over the ice.\n\nSAVE THE ORACLES\n\nReleased on the Game Boy™ Color system in 2001, The Legend of Zelda™:\nOracle of Ages™ and The Legend of Zelda™: Oracle of Seasons™ represent\nthe pinnacle of classic 2D Zelda gameplay. Now you can play these\nclassics on your Nintendo 3DS™ system!\n\nWhen played together, these two games offer an ultimate adventure not\npossible when each game is experienced on its own. The games feature a\nlink system that unlocks access to additional content that you can't\naccess any other way.\nThis game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy Color"}]},{"id":21427,"name":"Konung 3: Ties of the Dynasty","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/628/628036b5753f851d47cd1f90d957a0d1.jpg","description":"Konung III is a RPG, based on the Scandinavian and Slavic mythology, the third game in the Konung series (Konung: Legends of the North and Konung 2: Blood of Titans).\nThe new game brings the player back to the legendary Woodland – the unique and spacious fantasy land that combines parts of known history with classical myths of the Slavs, the Scandinavian and the Byzantine, as well as the legends of the Chronicles, including immortal heroes, magical artifacts and ancient sorcery world.\nThe Era of Titans, the almighty rulers of the Earth, has ended. Once glorious heroes and great Princes are gone for good. The hour of new heroes has come, when the throne of the Grand Principality became empty. Various valiant warriors and adventurers started their fight for the title, and only the legendary Champion Sword artifact can resolve their face-off.\nGet the artifact, become the Konung and write a new history of the Woodland!Key features:Possibility of characters’ interaction with various objects\nCreation of unique types of weapon and armor using magic potions\nUpdated and considerably enhanced battle magic\nRevised combat system with unique parameters of combat items\nInimitative atmosphere of the Woodland, recreated using the state-of-the-art 3D graphics\nImproved possibilities to control and protect the player-dependent settlements","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":18334,"name":"The Hidden Dragon","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/869/869a1acec8c3c45f8c6f0519b4bf3312.jpg","description":"Fugo Rojo the Dragon loves to collect manmade objects and his eternal taste for treasure takes him on a journey to collect items from around the world. Your task is to satisfy his hunger by collecting Hidden Objects from the realms of the Rivermill, the Enchanted Forest and the Lonely Hills. What treasures will you find? Objects must be discovered using words or shapes and with 100s of items to find and more than 10 hours of fun, are you skilled enough to complete 72 challenging levels? The quicker you find objects the higher score and achievement you get. Should you become stuck, Fugo’s dragon eye offers a hint that guides you on your way.KEY FEATURES72 Challenging Hidden Object levels\n3 beautiful interactive environments\n100s of items to discover\nBuilt-in Dragon Eye Hint\nMore than 10 hours of gameplay","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]}]