[{"id":14278,"name":"The Land of Dasthir","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/16d/16d86e4bbfa7614a9000b973f24a67d8.jpg","description":"One day while staying at the distant city Gailville, Terret receives a letter asking for help in his native Ganzer Village. The village is situated in a small country Dasthir - a country full of legends and mysteries. Urgently come to the village headman, Terret learns from him that his uncle was gone a few days ago. The headman suggested that this has connected with the legend of the \"Red Dragoons\" and recently appeared from somewhere monsters. Terret must find around Dasthir his uncle, and understand why the monsters have appeared in these places.\nThe Land of Dasthir\" features:\n• Fight with your opponents in the 1vs1 mode\n• No ordinary enemies. Only bosses, and to each of the bosses need their own tactics\n• Resources in the game is limited, so use them wisely\n• A small, but at the same time, a compact game world\n• At one moment, your actions can change the outcome of the events of the game\n• The game supports Steam achievements and trading cards","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"RPG Video","platforms":[{"id":0,"name":"PC"}]},{"id":4775,"name":"ModNation Racers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a44/a44fef3dff80f8979716141c7c18b3c3.jpg","description":"ModNation™ Racers is a next generation kart racer that empowers you to personalize your entire game. Race both offline and online, then create your own racing experience with your own Mod characters, quirky karts or imaginative tracks. Share with the rest of the PSN and access over 2 Million player creations. There is no end to the karting fun!\nNext Gen Kart Racing Action!\n•Full Single player storyline with over 25 outrageous tracks\n•Explosive Weaponry and Power Ups\n•Dynamic Physics for realistic Kart handling\n•4 Player Offline Split Screen and 2 Player Online Split Screen Modes!\nComplete Customization Options and Tools!\n•Design your own track, character, and kart\n•Deep, yet easy to access creative tools\n•Thousands of customization options\nFull Online Community Features!\n•Share all of your creations with the community\n•Browse over 2 Million community creations\nto play, rate, and remix\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\nModNation is a trademark of Sony Computer Entertainment America LLC. © 2010 Sony Computer Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4416,"name":"Shin Megami Tensei: Persona 3 FES","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ef/5ef4a707090dcc049dd9fe412220389f.jpg","description":"Terrible creatures lurk in the dark, preying on those who stumble into the hidden hour that lies between one day and the next. As a member of a secret school club, you must wield your inner power -- Persona -- and protect humanity from impending doom. Will you live to see the saga's end -- and beyond?\n\nLead a group of high school students with a dangerous extracurricular activity: exploring the mysterious tower Tartarus and fighting the sinister Shadows during the Dark Hour, a frozen span of time imperceptible to all but a select few. However, the end of their quest is no longer the end of the story -- witness for the first time the aftermath of the final battle and the students' struggle to find meaning in their new lives.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":1577,"name":"Real Boxing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/443/4437daab1fcdfe3817df3f47e9291cb5.jpeg","description":"Lace up your boots and grab your gloves, Real Boxing™ punches its way to PC!\nReal Boxing™ brings you the most exhilarating, no holds barred boxing experience ever seen on Steam. Featuring ultra-realistic motion capture from real boxers, with amazing graphics built using the powerful Unreal Engine, you’ll be sure to feel every hook, jab, and uppercut. Train your fully customizable boxer and seek glory in career mode, or duke it out with other players in a deep and satisfying local and online multiplayer modes. Whether on a keyboard, or using a controller, Real Boxing plays just as great as it looks, delivering the ultimate boxing experience on Steam. Download Real Boxing Today!\nINCREDIBLY DEEP GAMEPLAY\nCompete in a comprehensive career mode with three belt titles to conquer, Battle over 20 opponents, each with their own unique and adaptive fighting style. Then train your boxer using skipping rope, heavy bag and speed bag mini-games to bring your fighter up to scratch and learn new perks to boost your boxer’s abilities. Combined with a huge variety of customisation options, becoming your own boxer has never been easier.\nREAL-TIME MULTIPLAYER THRILLS\nTake your skills to the next level and enjoy hundreds of hours more gameplay in the feature-packed online multiplayer, or duke it out with your friends locally, on a single-screen, in your own prizefight. Bet virtual currency on your fights and climb the Steam Leaderboards to rise in the rankings and truly become the world champion.\nPACKED WITH EXTRA FEATURES & CUSTOMISATION\nUnlock new equipment, extra opponents and customized clothing, as you progress in the boxing world. Tailor your fighter’s appearance to your liking, including hairstyle, skin color, tattoos and gear. Fight across four distinctive arenas: Las Vegas, Moscow’s Red Square, Rome Colosseum, and New York.\nIMPRESSIVE 3D GRAPHICS AND SOUND\nReal Boxing harnesses the immense power of the Unreal Engine to bring you a great looking and sounding game, and create astonishing levels of atmosphere and realism. See and hear the crowd go crazy as you outbox your opponent. Watch sweat and blood fly with every punch and see your opponent’s face take injuries - then relish the slow-motion replay of your greatest KO’s.\nSTEAM EXCLUSIVE CONTENT\nPlay and earn Steam Achievements and Ring Girl Steam Trading Cards for your hard work on the ring. Unlock Steam exclusive gear for your boxers and fight your opponents in style.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Vivid Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":469031,"name":"Melvor Idle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a30/a304c969d6f3fd4fe891978f75f202a6.jpg","description":"Melvor Idle is a feature-rich, idle / incremental game with a familiar feel. With over 20+ unique skills to tackle, you will always have something new to tackle.\nFeatures include offline progression, cloud save compatibility, many unique shop upgrades, inbuilt bank / inventory system and more!\nEvery skill in this game has its purpose, and interacts with other skills in unique and interesting ways. The training of one skill will benefit others, forcing you to make decisions about the best cause of action to take.\nCombat has over 110+ unique monsters for you to face, utilizing Melee, Ranged or Magic attack types to gain advantages over your foe. You can level up Prayer, Slayer, and Hitpoints alongside your standard Combat\nCombat comes sorted with many fierce and tough Dungeons for you to conquer. Each Dungeon contains a unique, tough boss at the end which in turn will provide massive rewards for completion!\nSkills are your break away from the madness that is Combat. You can relax by training many different skills to aid in your journey. Currently, there is 12 separate Skills to progress away from Combat.\nDo you have what it takes to conquer Melvor?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Malcs","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":62553,"name":"Learn Japanese To Survive! Kanji Combat","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/217/21799d997ecd12fe3f3cb26a34bda6cd.jpg","description":"Learn Japanese To Survive! Kanji Combat is an educational game, designed to be the ideal introductory course to the Japanese language! It's the third game in a smash-hit series, following Hiragana Battle and Katakana War - but you don't need to have played those!\nThis new game teaches you a separate part of Japanese: the Kanji writing system. Everything you need to start learning Japanese is contained within the game!\nJapanese is a language that can be very daunting to begin learning. It contains a unique alphabet of intricate symbols that can be very confusing to newcomers. How do you write these symbols? How do you even pronounce them?! If you're asking yourself these questions, don't worry - that's completely normal!\nLearn Japanese To Survive! Kanji Combat is your ticket to easy Japanese learning!\nLearn over 200 Kanji characters! With this knowledge under your belt, you can begin reading and writing Japanese!\nAt the start of each of the game's chapters, you'll learn a new set of Kanji characters. Following that, you're free to go on adventures and explore. You'll encounter dangerous enemies that have taken the shape of Kanji. To defeat them, you'll need to correctly translate them! If you give the wrong answer, your attack will be reflected and used against you. It's a learn & live situation!\nMuch like the other games in this series, you will also have the opportunity to learn some Japanese vocabulary! You'll see how words are constructed using Kanji, and learn the translations of useful words and phrases.FeaturesLearn over 200 Kanji characters, with detailed instructions on how to read and write each character.\nLearn useful mnemonic techniques to recognise each Kanji.\nAudio speech examples from native Japanese speakers demonstrate how to pronounce each Kanji character.\nFollow along with the exciting story that will see you travel to Japan to defend the country from shape-shifting monsters!\nExciting gameplay with familiar RPG elements - collect items, complete quests, engage in batles!\nBuild a new town from the ground up. Customise your town with different features!\nForm new friendships and get to know each of your companions with unlockable story sequences.\nEarn experience points and level up your characters.\nReview completed lessons to brush up on your knowledge.\nIn-game quizzes test what you're learning.\nOriginal soundtrack, including opening and closing themes with vocals! Ready to learn Japanese? You bet you are!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sleepy Duck","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":61847,"name":"Foundation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd1/cd1f9f5a5c38c722be96a3f6dac638e3.jpg","description":"FOUNDATION : A NEW ERA OF ORGANIC CITY-BUILDING SIMULATION!\r\nFoundation is a grid-less, sprawling medieval city building simulation with a heavy focus on organic development, monument construction and resource management.\r\nThe game features in-depth resource management akin to the Anno (Dawn of Discovery) series, expertly mixed with city building elements from Settlers, SimCity, and Pharaoh all topped with narrative encounters inspired by Crusader Kings II to create the ultimate medieval ant-farm simulation.\r\nIn this strategy city-builder economy simulation game, players must create a prosperous settlement as the newly appointed lord of a region untouched by man.\r\nSetting to redefine the city-builder genre, Foundation puts the emphasis on the organic aspects of urbanism in the cities of old, powered by Polymorph Games’ proprietary game engine, Hurricane, which allows for full mod support and is optimized for the thousands of moving parts that come with building humongous cities.\r\nAmong other things, the engine provides the player with robust building tools to create countless unique monuments that can then integrated into your settlement.\r\nWith medieval architecture and urbanism at the forefront of its design, Foundation’s vision is to allow players to recreate cities of that period as they envision them or even as they really were.\r\nGrow your untapped land into a great sprawling kingdom as you appease the political factions of your area, all while listening to a beautiful original soundtrack by the veteran composers who’ve created music for Paradox Interactive’s Crusader Kings II, Europa Universalis IV and The Guild 2-3 games!\r\nFEATURES\r\nORGANIC URBANISM OF THE MEDIEVAL ERA: Create gridless and organically sprawling cities that grow like actual medieval cities.\r\nLAY THE FOUNDATION, THRIVE, AND PROSPER: Weave a complex web of interactions between inhabitants needs and skills, resources availability, extraction, and transformation.\r\nUNIQUE MONUMENT CREATION TOOL: Craft and design original free-form monuments like Abbeys, Churches, Lord Mansions, Castles and more, with our proprietary node-based tool.\r\nFULL MODDING SUPPORT FOR THE COMMUNITY: Share characters, buildings, quests, and even real topologies through our mod-support tool and be part of the Foundation community.\r\nPOWERED BY OUR OWN HURRICANE GAME ENGINE: Experience a city-building game engineered with a dedicated, tailor-made, in-house engine built with our unique vision in mind.\r\nORIGINAL SOUNDTRACK BY PARADOX VETERANS: Immerse yourself in our blissful soundtrack by talented composers who worked on titles suche as Crusader Kings II and Europa Universalis IV!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Polymorph Games","platforms":[{"id":0,"name":"PC"}]},{"id":47155,"name":"Modern Combat Versus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a2/4a2633053937f53f578655db8ed66d51.jpg","description":"BECOME AN AGENT OF CHAOS\nDrop into a brand-new multiplayer first-person shooter featuring fun, action-packed gameplay. Choose your Agent, master your role, and dominate the battlefield with your team. From skilled attackers to supportive defenders and covert assassins, there's an Agent for every play style.\nFEATURES\n• Deploy into 4 vs. 4 multiplayer battles and fight to control a central zone.\n• Play as 12 specialised Agents, each equipped with unique weapons and abilities!\n• Battle across 5 distinct maps featuring close-quarters combat and long-range warfare.\n• Get promoted to higher competitive leagues and earn prestigious rewards.\n• Experience immersive graphics featuring stunning visuals and effects.\n• New Agents, game modes, and maps are coming soon!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":22373,"name":"NEKOPARA Vol. 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c6f/c6f2042555c9c8154aa8536af1466933.jpg","description":"Patisserie \"La Soleil\", run by Kashou Minaduki, is flourishing thanks to the help of two catgirls: Maple, full of pride and a little on the haughty side, and Cinnamon, an impulsive daydreamer.\nThese two are especially close among the rest of the sisters. One day, Maple encounters something that shakes her belief in attaining her dream. Cinnamon, unwilling to see Maple suffer, wishes to help her in any way possible... but she can't figure out how. This story is a heartwarming cat comedy about their ambitions and the bonds between family members... with a little ecchi on the side, too.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"NEKO WORKs","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16412,"name":"Dracula 2: The Last Sanctuary","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f11/f11fc32032d630e486d1a7dc26286b6a.jpg","description":"The blood-curdling sequel to Dracula: Resurrection brings an even scarier adventure to life.\nAfter saving Mina, Jonathan Harker and his beloved return to London carrying a mysterious Dragon Ring.  As they begin to revel normalcy, events occur that indicate the Prince of Darkness and his Black Guard army have followed them home... with vengeance.  Stronger and more threatening... Dracula is even thirstier than ever... for blood.\nThe highly applauded 360-degree vision technology delivers a haunting Point & Click Adventure like no other.\n\nKey Features:\nThe early 1900's sets the stage as you travel across London, Carfax Abbey, the Borgo Pass and beyond to track down the world-famous bloodsucker.\nThis new adventure accurately revives some of the best original characters and the haunting spirit of Bram Stoker's novel\nBattle bat-like humanoids, gargoyles, apparitions, evil gypsies, Dracula's brides, the Prince of Darkness himself and more\nSurvive the insane asylum,  stay dry through the wet catacombs, watch your step in The Styx Cinema and say your prayers as you navigate across the Highgate Cemetery and finally into the depths of Dracula's Tomb","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Microids","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":15930,"name":"Forward to the Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f1b/f1ba0044ce301c87c547411f1dbd9ec2.jpg","description":"Story  Once upon a time, there was a great tower in the sky. People were mining crystal with delight during the prosperous days. Until that disaster happened…… Time past, the history had been forgotten. And now, it emerged from the clouds again – the sky tower.Game  Reveal the story of the sky tower!\nForward to the Sky is a third person action adventure game in the sky tower ruin. You are going to collect all the crystal pieces to connect the story and everything will be revealed once Princess reaches the top level.Feature  Puzzle platforming, a game features a mixture of puzzles, action and adventure. Relaxing mood, bright art, adventurous but peaceful music, simple control and combat. A game everyone are able to finish and provides additional fun of difficulty to hardcore players.\nThere are 6 unique levels to be explored. Battle the elements, run through the traps and play with interactive mechanisms to solve the puzzles. Find your path to discover the story in the sky!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Animu Game","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10383,"name":"Transport Fever","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/148/148c6b22a6cb6b274cd00ab4d43a7e83.jpg","description":"Transport Fever is a railroad­-focused tycoon game. Players start in 1850 and build up a thriving transport company. As an emerging transport tycoon, the player constructs stations, airports, harbors and makes money by connecting areas requiring transport services.\nConstruct complex road­-rail-water-air networks in the endless game and experience more than 150 year of transportation history. Fulfill the people’s needs and watch cities evolve dynamically. Supply industries with freight, develop complete cargo chains and enable  economic growth. Build up a transport empire!\nMaster challenges and get entertained in the campaign game mode. Two campaigns consisting of a multitude of missions with increasing difficulty can be tackled. Missions of the American and the European campaign tell the historical context of the 19th and 20th century and offer a wide range of real­world transportation challenges.Game FeaturesTwo game modes: Endless game and campaign mode\nOver 120 detailed trains, aircrafts, ships, buses, trams and trucks\nIntuitive yet powerful railroad and street construction\nUpgradable train and bus stations, airports and harbors\nEuropean and American campaign with a multitude of historical missions\nRandomly generated, modifiable terrains with realistic dimensions\nFully realized European and American game environments\nDynamically simulated urban development and passenger movement\nSophisticated economy model and freight simulation\nContent from more than 150 years of transportation history\nRealistic vehicle simulation, coloring and aging\nPhysically based graphics, lighting and simulation\nMore than 25 challenging achievements\nSteam Workshop and extensive modding support","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":438,"name":"Kill The Bad Guy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1de/1de04e34894bfac3cc2f67f3818d5030.jpg","description":"I - KTBG: the original single-player puzzle game\nII - Gangs of Bad Guys: the new multi-player mode\nI - KTBG\nDoes everyone deserve a second chance? Can crimes ever be forgotten? Hiding behind the mask of the average man on the street, and furtively blending into the background, many war criminals, ex-Mafia members and other criminals have been literally getting away with murder, or worse. That is, until you turned up to ruin the party. As part of a secret and mysterious society whose members have sworn to rid the world of these Bad Guys, it’s your responsibility to make sure justice is served in the bloodiest possible way, using your unpredictability to your advantage.\nTrack the Bad Guys, be brutal and smart in your planning, and eliminate them one by one. But bear this in mind: each criminal’s death has to look like an accident. In each level, you’ll have the chance to splatter and destroy the Bad Guy using various weapons and traps. It’s up to you to make sure he ends up in the wrong place at the right time.\nIn this ingenious puzzle game in which physics plays an essential role, you’ll need to keep a cool head and your wits about you. Show no mercy as you set out to kill the Bad Guy!\n“Until your mission is accomplished we don’t exist. If you fail, you’ll be the only person at fault, and we’ll deny ever knowing you.”\nFeatures\n•\tTRACK YOUR TARGET in 60 levels, each one more original than the last, and unlock 6 completely off-the-wall bonus levels.\n•\tUSE YOUR IMAGINATION as you take out the criminals one by one. Find the opportune moment to act, and make it as bloody as you can!\n•\tBECOME THE AMBASSADOR OF DEATH and make full use of all the different traps available. Sabotage vehicles, transform daily objects into deadly weapons, or combine different elements in order to create new ones.\n•\tWORK IN THE SHADOWS. Don’t draw attention to yourself. Cameras, pedestrians, cops and the Bad Guys’ bodyguards mustn’t suspect you. No one should ever doubt that these deaths are anything but unfortunate accidents.\n•\tTRY, TRY AND TRY AGAIN as you take advantage of the game’s replay feature. Get the top score, fulfil the secondary objectives, find new ways to kill each Bad Guy, and work on your murder skills.\n•\tSOCIAL SHARING. Show off your killing prowess and achievements to your friends, and prove that you are the world’s top justice seeker.\nII - Gangs of Bad Guys\nPlayable up to 16 players, Gangs of Bad Guys is a new competitive mode. Face your opponents and kill them all. This time you control the Bad Guy and no more discretion, you must be clever and cunning to achieve your aims. Turn items of everyday into deadly traps, combine elements and bring the terror in the streets. Alone or in team, fight your enemies in 4 game modes: Serial Killers, Capture the flag, Godfather and Gang Supremacy.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":579580,"name":"ROUNDS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ca/8ca58d601c47e6376c62d8f80053eb8a.jpg","description":"Wave your noodle arms around to assert dominance!\nExperience hype-filled dueling! Shoot, block, and jump your way to victory with your shotgun-rocket-launcher-that-shoots-heat-seeking-bouncy-missiles or one of the other over 11.2 million different powerup combinations.\nFeatures\n65+ Unique powerups\n70+ Maps\nAAA Face Customizer\nOnline Multiplayer\nLocal Multiplayer\nTwitch based matchmaking\n100% organic Noodle Arms","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Landfall","platforms":[{"id":0,"name":"PC"}]},{"id":366844,"name":"Atelier Ryza: Ever Darkness & the Secret Hideout","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/484/4849529dfe93d3a10bcbe5a0d6e12646.jpg","description":"Content of \"Atelier Ryza: Digital Deluxe Edition\"- \"Atelier Ryza: Ever Darkness & the Secret Hideout\"\n- Costume Set \"Another Fashion\"\n- Costume Set \"Summer Style\"\n- Hideout Parts \"Pixie Forest\"\n- Hideout Parts \"Lakeside Hideout\"\n- Initial Dash Item Set\n- Extra Large! Rebuild Gem Pack\nPre-Purchase Offer- Ryza's Outfit \"Divertimento Embrace\"\n*Ryza's Outfit \"Divertimento Embrace\" might be available as free content at a later date.\nFree for Limited Time- Ryza's Costume \"Summer Adventure!\"\nNote: Available until Tuesday, November 12th, 2019.\nAbout the GameThe concept of this title, the latest in the series to depict a new \"Atelier\" world, is \"True-to-life youths that develop together, even if just a little bit\".\nIt is the story of a girl and her friends who are about to become adults, discovering what is most important to them.\nTo depict the story of the main characters discovering things they've never seen before, we've created fields with natural shadows that allow you to feel the breath of the world. Graphics have been further enhanced, allowing for a world of daily-life and adventure to be depicted in a new way.\nMain Points\n■Advanced \"Synthesis\" system & \"Location Points\"\nThe \"Synthesis\" system in which players combine materials to create items has been revamped.\nNow, in addition to being able to understand the effects of synthesis visually, the system allows you to enjoy the experience of developing recipes more than ever before.\nAlso, we've included \"Location Points\" that players can create through synthesis!\n■Use different items to gather new materials!\nWhen \"Gathering\" the necessary materials for synthesis, the items you receive change depending on the tools you use to gather them, so it will be easier to obtain the items you want.\n■intense Battles\nWith a combination of turn-based command battle and real time elements, enjoy intense battles where the choices you make determine the outcome! It is a system that will allow you to sense the feeling of strengthening bonds with your friends more than ever.\nStory\nThe Main Character Is Ryza, An Ordinary Girl.\nTired of boring village life, she escapes the village to gather with her good friends in a secret location to talk of their dreams and plan thrilling adventures.\nOne day, the determined Ryza and company decide to head for the forbidden \"island across the shore\" as their first exploration trip.\nTogether with the alchemist and other friends they meet there, they have a \"summer adventure\" that they will never forget.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Gust","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":302974,"name":"Cadence of Hyrule","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f67/f678872fd89487324cf1267cd2adba96.jpg","description":"As Link—or even as Princess Zelda—you’ll explore the randomly generated overworld and dungeons on a quest to save Hyrule. Every beat of each remixed, The Legend of Zelda tune is a chance to move, attack, defend, and more, so stay one step ahead of each enemy and boss…or face the music.\n\nFrom modern-looking Lynels to the Hyrulean Soldiers of old, you must master the instinctive movements of each pixel-art enemy, and strategically outstep them in rhythmic combat. So equip yourself with an arsenal of iconic Legend of Zelda items, as well as the spells and weapons from Crypt of the Necrodancer. You must be prepared to face Hyrule’s most wicked bosses, which have been transformed by magic, granting them mighty, new forms!\n\nA rhythmic action-adventure game in the world of the Legend of Zelda™ series.\n\nExplore the randomly generated overworld and dungeons to save Hyrule as Link or Princess Zelda.\n\nUse items from the Legend of Zelda™ series, plus spells and weapons from the Crypt of the Necrodancer game.\n\nOutstep legendary enemies and bosses in rhythmic combat.\n\nKeep the beat with 25 remixed classic Legend of Zelda™ tunes.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":19845,"name":"Tales of the Orient: The Rising Sun","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09a/09ae70383cc1decc576a895e122afd03.jpg","description":"Travel to the Edo period in Japan and help Satsu and Miyamoto in an epic adventure to preserve ancient Japan. Prove your skills in Challenge mode with limited moves. Experience the excitement of building an ancient Japanese village in this engaging Match 3 game. See the beautiful scenery while listening to relaxing music inspired by this period in Japanese history. Dive into an epic story of honor and courage and help a Geisha and a Samurai save the day in Tales of the Orient: The Rising Sun!\n- Three game play modes: swap, pop, chain\n- Can you win in challenge mode?\n- Build an ancient Japanese village\n- Exciting adventure\n- Rotate the board make the best matches","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Green Sauce Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17069,"name":"Blockland","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/103/1032788a086491282891b71fe2095f6a.jpg","description":"Blockland is a non-linear sandbox game with no set goals, giving players the freedom to design and construct elaborate structures. Styled as a tiny minifigure, players build inside of the virtual world using bricks reminiscent of toy blocks. These structures can be built in either a single-player or multiplayer (either online or through a local area network) setting.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Anthony Rotondo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13974,"name":"Clickr","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab3/ab3a18ea98f6a77e1ee61887b9ba3130.jpg","description":"Click, turn and match four blocks! Enjoy smart and speedy puzzle action!\nClickr is a next generation puzzle game developed by Ntreev Soft, the studio behind Pangya & Trickster. The game competed in the 2010 Independent Games Festival and was selected as 'Top 10 Break Out Indie Games of 2010' by DIYGamer.Key Features:4 Main Game Modes: Puzzle, Battle, Push, and IQ modes with various sub-modes and missions.\nMultiplayer Modes: Head-to-head match-ups in Battle and Push modes.\n3 Unique Themes: Basic, Africa and Zombie themes provide different characters, effects, skins and sounds!\nOver 70 Steam Achievements to unlock!\nAdditional Features: Tutorial, left-handed controls, and global leaderboards.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ntreev Soft Co","platforms":[{"id":0,"name":"PC"}]},{"id":3372,"name":"Element4l","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e2/2e2adf649dd0c47922faa50b8a4e0944.jpg","description":"Element4l is an immersive and experimental indie platform game, with a strong focus on flow and smooth gameplay, wrapped in an exceptional soundtrack by Mind Tree.\nIn Element4l, you control four elements who are bound together on a journey to shape life. Your only hindrances are nature and the sun. It takes a different, innovative approach to classic platform games and challenges you to rearrange your reflexes.\nElement4l is a challenge. The first time you play it, you will struggle... just like the first time you've learned how to ride a bike.FeaturesElements with ninja moves\nAlternative 4-button based gameplay\nExceptional soundtrack by Mind Tree (Included for FREE as high quality MP3's)\n16 levels throughout 4 stages (+ tutorial levels and bonus)\nCompetitive race mode with adaptive ghosts from other players\nCollectibles/achievements/easter eggs/...\nIncludes DLC Update: Lap Races","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Desconocido","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2232,"name":"Star Realms","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a85/a85710bda9788c141254986b1333eb50.jpeg","description":"Star Realms is a hugely popular space combat deckbuilding game. Download and play today to find out why Star Realms is the winner of SXSW 2014 Board Game of the Year, 7 Golden Geek Awards from BoardGameGeek, including Best Mobile Game, and 2 Dice Tower awards! (note: full version is required to play online)\nStar Realms combines addictive deck building game play with exciting Trading Card Game (TCG) style combat!\nDesigned by Magic the Gathering Hall of Famers Darwin Kastle and Rob Dougherty (of the Ascension Deckbuilding Game), Star Realms provides tons of playability for free, and a one-time upgrade to be able play with your friends and more on any device.\nFree Version\n•Playable on Mac OS/X and Windows through Steam, also available on iOS and Android.\n•Addictive Deckbuilding Game with Player VS Player Combat.\n•Tutorial teaches you to play in minutes.\n•Stunning visuals.\n•Play VS the AI.\n•6 mission campaign mode.\nFull Game Additional Features\n•Play the AI on 3 different difficulty settings.\n•9 additional campaign missions.\n•Battle friends face to face with Pass and Play.\n•Online play with global rankings.\n•Challenge a friend online.\n•Play against opponents regardless of their operating system","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"White Wizard Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":504,"name":"Dead Effect 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/17e/17edd75b97fb4f98672b017bef1d192d.jpeg","description":"Dead Effect 2 is the newest addition to the acclaimed Dead Effect franchise. This action sci-fi shooter is looking to push the boundaries of first-person shooters to new levels with slick graphics, rich narrative and RPG elements.\nPlay the single-player missions at your own pace or engage your friends in the cooperative or PvP multiplayer mode. Train, develop your character, collect and upgrade countless weapons, gear and body implants and take control of the monster-infested ship.\nKEY FEATURES:\nYour hero adapts, grows and gets better as you play. Help them along the way by choosing the best gear!\n-\tget 100+ upgradable weapons of all kinds – pistols, shotguns, plasma guns, bows, swords... you name it\n-\tcollect 300+ gear items and implants\n-\tcollect dozens of gear sets, from Regular to Mythical\n-\tput together a complete gear set to gain special abilities\n-\tequip your hero with a selection of 30+ special abilities, from bullet time to force field\n-\ttry high-tech body implants to increase your character’s performance\nA colonist ship is full of diverse environments, from maintenance rooms to oxygen gardens. And full of dark corners, too!\n-\tenjoy the stunning environments with moody graphics\n-\texplore the whole ship during the main story campaign\n-\treturn to complete various basic tasks in generic missions\n-\tstand up to the challenge in special missions – Biohazard, Survive, Lone Wolf, Infestation modes\n\nYou know you are not alone on this ship. There are friends, and there are foes. Sadly, the friends are outnumbered.\n-\ttest your strength against zombies, soldiers, cyborgs, mutant, cannibals, mechanical dogs, drones...\n-\tget engaged in several unique boss fights\n-\tcomplete special missions with various enemy types to gain experience\nYou can face the enemy alone, but you won’t last long. Call your friends to action and together take up arms against the enemy!\n-\tplay together in the cooperative multiplayer mode – you can play the story campaign and all special missions\n-       challenge your friends to a life-and-death battle in the player vs. player multiplayer mode\n-\tconquer the elaborate system of achievements – collect all 170 of them!\n-\tget social - share your results and leaderboard position on social media channels\nBy purchasing Dead Effect 2, you directly support the developers and get more than just a game!\n-\t20+ hours of gameplay\n-\tall future updates for free\n-\tdownloadable game soundtrack\n-\texclusive art book with a comprehensive overview of the Dead Effect universe\n-\tbecome a member of a lively community and participate in the development\nFeel free to drop us a line at info@badflyinteractive.com, or catch up with our latest news on our official website or a social media channel of your choice:\nwww.deadeffect2.com\nFacebook: Dead Effect\nTwitter: @DeadEffectGame\nYouTube: BadFly Interactive","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"App Holdings","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":383496,"name":"Postal 4: No Regrets","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/815/815cab8e9048b0610b6fdb946cf940ed.jpg","description":"POSTAL 4: No Regerts is a satirical and outrageous comedic open world first person shooter and the long-awaited true sequel to what’s been fondly dubbed as “The Worst Game Ever™”, POSTAL 2! (No third game is known to exist.)\n\nSeveral years have passed since the events that devastated the once proud town remembered as Paradise. The only two to walk away from the cataclysm unscathed, the hapless everyman known as the Postal Dude and his loyal companion Champ, drive aimlessly through the scorching deserts of Arizona looking for a new place to call home. After a fortuitous gas station rest stop ends with their car, trailer home, and the rest of their worldly possessions stolen, all the Dude’s seemingly got left to his name is his canine cohort and his bathrobe, and neither of them smells all that great. However, on the horizon, the duo glimpses an unfamiliar and dazzling town that beckons to them. What untold prospects lie within? Fame? Fortune? Maybe a bidet or two? Edensin awaits.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Running With Scissors","platforms":[{"id":0,"name":"PC"}]},{"id":327206,"name":"Conan Chop Chop","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0ab/0abbd559db1717433fdb5de8baa26846.jpg","description":"Previews“Looks like the game I said I wanted.”\nMike Fahey, Kotaku\n“It honestly looks all kinds of awesome.”\nChris Capel, Gamrevolution\n“Part Conan, part Cyanide and Happiness in its visuals, Conan Chop Chop is proof that dreams can come true.”\nDarren Bonthuys, Critical Hit\nAbout the GameThe treacherous wizard Thoth-Amon has devised a plan to resurrect the ancient evil that is Xaltotun. If he succeeds, he will condemn the world to an eternity of darkness and enslavement. Only you can stop him, but in order to do so you must use all your cunning. All your guile. You must summon all your courage and swordsmanship. You must … Chop Chop!\nConan Chop Chop is the most epic and realistic stick figure game ever to be set in the world of Conan the Barbarian, thus there will be an excessive amount of gore and flying limbs. Be warned that this may in turn lead to uncontrollable outbursts of joy and/or profanities, usually depending on which end of the sword you are on.1-4 playersPlay solo for the ultimate thrill of a roguelike or have your buddies along with you in couch co-op mode.\nBecome Conan… or someone else!  All brawns, no brain? No worries! Choose between a diverse cast of badass warrior gods, and add weapons and items to match your style!\nEmbark on quests of pure epicness!You are about to save the world! The merchants are still going to charge you for their wares, and some townsfolk may even pester you with tasks of their own. But fear not, some of them will make it worth your while.\nExplore in every direction! Brave the shifting sands of Koth, explore the dark woods in Darkwood, move valiantly through the searing land of Hyperboria and see the icy world of Vanaheim. Conan Chop Chop lets you explore to the left, right, up and down! A skilled player may even find himself jumping, dashing, or moving diagonally, resulting in the ultimate 3D experience.\nLoot, loot and more loot! Master the fine art of delicately bashing your enemies’ heads in with a broom and turning them into chop suey with a bastard sword. Conan Chop Chop contains a wide variety of different weapons, trinkets and legendary items, each suited to tailor any kind of violent playstyle you can think of.\nMaster astonishing combos!  Perform the breathtaking 360° spin-attack to crack skulls all around you. Dash forward with the speed of light. Swing your sword both longways and sideways in a game that will have you gasping for air as you struggle to grasp the pure awesomeness of your fighting moves.\nRuthless bosses!  Before facing Thoth-Amon, you must defeat bosses such as The Giant Sand Worm of Koth and The Frost Giant of Vanaheim, neither of which are particularly sympathetic to your cause. Instead they will attempt to destroy you with killer moves like Lava Reflux, Tail Whip and Loogie Glob.\nInfinite replayability!  Completely random maps and tons of weapons and abilities to try out ensure that every new game will be a whole new experience. You are bound to die more than once, but you can unlock new weapons that will be available for your next play-through.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mighty Kingdom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":19172,"name":"Tex Murphy: Under a Killing Moon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ed/7ed968d481ce28c3e0d4a455a02d44c4.jpg","description":"Enter the virtual world of Under A Killing Moon, where it is December 2042, and you, as Tex Murphy, must stop the forces of evil before they destroy mankind and rob you of your next unemployment check. This thrilling and hilarious adventure is unlike anything you've seen before.\nThe graphics quality, the fascinating, believable characters, and complete freedom of movement will make you feel like you've actually walked through the screen and become the main character in a rich, intriguing mystery movie.\nAccess Software's Under A Killing Moon features:\nFour CDs of unparalleled graphics and sound.\nFull freedom of movement, explore where, when and what you want!\nBe part of an exciting comedy thriller!\nTop-notch Hollywood talent.\nExtensive built-in hints.\nAn interface that makes interaction intuitive and simple.\nFull fidelity 16 bit 22Khz sound.\nStarring Brian Keith, Margot Kidder, and Russell Means. Features the voice of James Earl Jones.\nAlmost 2.4 gigabytes! Simply the biggest and best entertainment CD product ever produced!","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Access Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17282,"name":"Anno 2205","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73d/73dcd185cc3f9506cdfacb4adb4128d3.jpg","description":"Ultimate Edition\nGet the full Anno 2205 experience including all update and add-on content. Develop your civilisation on earth, in space and on the moon to stay in the race for ressources and influence.\nThe Ultimate Edition is the best way to discover human-kind's next step into the future.\nThe Ultimate edition includes the 3 free DLCs, Wildwater bay, Veterans and Big Five, and 3 premium DLCs :\nTundra DLC:\n- Discover new gameplay tactics as you will need to dry the marshes before settling.\n- Manage all-new production chains and unlock a space-wide module type to improve farms and factories in all regions.\nOrbit DLC:\n- Conquer space by building, expanding and managing your own modular space station.\n- Go even further in expanding your conquest and manage Nexus, a powerful AI controlling the newly accessible space station modules.\nFrontiers DLC:\n- Unveil the synthetics, a man-machine new faction\n- Discover three new sectors\n- Fight enemy invasions in regular sectors\n- Unlock new customisation options\nAbout the GameAnno 2205™ – the beloved city builder takes off into space!\nIn Anno 2205™, you join humankind‘s next step into the future with the promise to build a better tomorrow. You conquer Earth, establishing rich, bustling cities and grand industrial complexes, but to secure the prosperity of your people, you must travel into space.\nA scientific breakthrough in fusion energy promises to revolutionise all aspects of society. The necessary isotope, helium-3, can only be found in harvestable quantities on the Moon. Venture into space and settle on the Moon in the thrilling race for resource and power.\nAnno’s masterful economic gameplay is back and taking strategic city-building simulation to new heights, launching into space!\nTHE ACCLAIMED CITY BUILDER REACHES FOR THE STARS\nAnno 2205™, the sixth title in the award-winning city-building franchise, expands into space. Colonise continents on Earth, establish bases on the Moon, and mine the Moon’s resources to transform your cities into thriving metropolises.\nUNLIMITED CITY BUILDING\nThousands of hours of accessible and challenging gameplay let you go beyond the story and ultimately grow monumental cities with thousands of buildings. You control your growing corporation simultaneously on multiple locations on Earth and the Moon. Gameplay brings a revolutionary session mode that lets you play on multiple islands, instantaneously connecting different regions. Anno 2205™ is the biggest in the series, offering unlimited replay value on islands five times bigger than in previous games.\nINDULGENT GRAPHICS BRING YOUR CITY TO LIFE\nThe new game engine offers a true sense of grandeur and brings an unprecedented level of detail and immersion. Your city comes to life with flying cars and more than a million thriving citizens alongside churning factories, grinding mines, and amazing wildlife, all completely animated and driven by your actions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"}]},{"id":17029,"name":"YOU DON'T KNOW JACK MOVIES","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44e/44eea54af26d0b3c6970f2c5349484db.jpg","description":"YDKJ: Movies is considered the most challenging game in the series – are you up for the challenge? Test your movie knowledge from back when movies were movies, and movie candy didn't have high fructose corn syrup!\nIf you've always wanted to see your name in lights, albeit lights from your computer monitor, then YOU DON’T KNOW JACK Movies is the trivia game for you! YDKJ Movies covers everything from Fred Astaire to Freddy Krueger, and all the Freds in between. With all the irreverence, humor and style of the original award-winning YOU DON’T KNOW JACK, YDKJ Movies will have moviegoers rolling in the sticky aisles.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Jackbox Games","platforms":[{"id":0,"name":"PC"}]},{"id":14565,"name":"Time of Dragons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/158/158c7831d47b893c98c483e21bb801cb.jpg","description":"This is an MMO shooter where you ride dragons armed with missiles and lasers!\nThe plot of the game unfolds in an imaginary universe, where two highly advanced races, Neils and Atlans, fight against each other.\nTheir battle units are gigantic flying creatures controlled by adopiants, their riders.\nThe game offers the following:\n- Multiple creatures with unique capabilities\n- A wide selection of weapons\n- Various combat modes\n- Freedom and beauty of dragon flights\n- Battles against players from all over the world!\nTake your dragon into the sky and prove that you are the best!\nAs developers, we love our game with all our heart and will continuously develop it, ensuring updates every two weeks. Join our community to keep track!\nIt's gonna be fun!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"4 I Lab","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11991,"name":"Coma: Mortuary","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac0/ac0eb85e5e6f160085da91949d16f273.jpg","description":"The story is about a guy who has lost meaning in his life, because of the tragic death of his girlfriend. Drunk and depressed, he got behind the wheel of his car, determined to commit suicide in the same spot where she died. Somehow he survived the accident, but fell into a coma, and his soul is now wandering the world of the dead where a new story unfolds.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nova Dimension","platforms":[{"id":0,"name":"PC"}]},{"id":708980,"name":"SUPER PEOPLE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/578/578dc93c4b968ae544f0e9af5017bc91.jpg","description":"WONDER PEOPLE proudly presents a battle royale shooter that will revolutionize how you think about the genre.In SUPER PEOPLE, take control of a super-soldier, each with their own unique skills and survive until you are the last one standing.SIGN UP FOR CBT!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Wonder People Co","platforms":[{"id":0,"name":"PC"}]},{"id":471011,"name":"Shin Megami Tensei III: Nocturne HD Remaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b97/b97f47949ef696b99ed9e9160e89fb12.jpg","description":"Reawaken your inner demon in a modernized version of the acclaimed ATLUS classic, Shin Megami Tensei III Nocturne HD Remaster.\n\n\n\nWhat begins as a normal day in Tokyo turns out to be everything but, when the Conception – an ethereal apocalypse – is invoked. The remains of the world are swallowed by chaos, as a demonic revolution descends into a broken city. Caught between a battle of Gods and demons, the choices you make can bring life, rebirth, or death, and determine who triumphs.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":391403,"name":"Path of Exile 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/547/5473d5c6bab9de2a4a4d5c195a57a1d2.jpg","description":"Path of Exile 2 is a new seven-act storyline that is available alongside the original Path of Exile 1 campaign. ... Path of Exile 2 retains all expansion content that has been created over the last six years and introduces a new skill system, ascendancy classes, engine improvements and more.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Grinding Gear Games","platforms":[{"id":0,"name":"PC"}]},{"id":373521,"name":"Hell Pie","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b4c/b4c351a2b627dce0d1240ba6e8907eee.jpg","description":"Hell Pie is a 3d-Platformer experience unlike most others. Play as Bowner, demon of bad taste, \"accompanied\" by Nugget the angel, sent to the overworld for the most important mission to collect ingredients for Satan's birthday cake. Use Nugget the angel like a grappling hook, a weapon and as your guide, to overcome tight platforming sections and battles against weird enemies. Your way will be paved with ugly characters, questionable events and tons of collectables.\nBecome a demon\nYou're Bowner, demon of bad taste, the 8th deadly sin. While not taken very seriously in hell, he is feared on earth (by some...a few...2-3 people at least).\nHeavenly support\nNugget the angel does not only look cute, he's also useful. Throw him like a grappling hook, use him as a weapon and let him be your guide.\nFreedom\nUse the extensive moveset to overcome obstacles the way you want.\nFilth\nIt might look cute, but there are violent characters, illicit drugs and sodomy.\nStuff\nCollect things! Lots of things!\nHell and above\nExplore 4 big worlds and survive challenging platforming levels.\nFashion\nBuy outfits. You're the demon of bad taste and should look the part.\nRandom bullet point\nDid you know? Necrophiliac ducks exist.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Sluggerfly","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":51326,"name":"MechWarrior 5: Mercenaries","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba2/ba27ddbd28606e4ef8f694298c0fd67f.jpg","description":"A single player MechWarrior game, fourteen years after the last mainline entry. Made by the developers of MechWarrior: Online, using Unreal Engine 4.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Piranha Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":31482,"name":"Driver (1999)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/28b/28b088364ecab7870dffc3b710104734.jpg","description":"In Driver, you are the wheelman in a series of Hollywood-style car-chases. A great getaway driver is only as good as his equipment, which is why Driver has a selection of performance-packed muscle cars, complete with realistic handling, damage modeling, and real-world physics reactions. Driver also comes fully equipped with a replay/director mode that gives you all the necessary tools to \"film\" their own car chase and multiple views that allow you to look around when you're driving. Put the pedal to the metal and be the best driver around.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Reflections Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":12491,"name":"Battlefleet Gothic: Armada","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b65/b655fbbc1d96a32034b3124b6ee86442.jpg","description":"Buzz\nTwitch Dev Session\nWatch the Replay\nAbout the Game\nBattlefleet Gothic: Armada is the RTS videogame adaptation of Games Workshop’s classic tabletop game, pitting the Chaos, Imperium, Eldar, and Orks against each other in visceral space-battles.\nDeveloped with Unreal Engine 4, Battlefleet Gothic: Armada offers deep management of every ship composing the player’s fleet, both during and between battles. From the fastest frigates to the gigantic, miles-long battleships, the player will customize all aspects of his ships: weaponry, defense and support sub-systems, but also crew, captains, and more... each customization affecting the very performances of the ship and the special abilities available during battle. From battle to battle, the admirals and crew of surviving ships will gain experience and promotions, improving the battle-readiness of the ships for future, bigger and more dangerous battles.\nAdditionally an extensive multiplayer mode with persistent fleets where up to 4 players can battle simultaneously, Battlefleet Gothic: Armada also features a big story campaign, taking place during the 12th Black Crusade and putting players in the middle of the Gothic War that raged between the Imperium and Abaddon the Despoiler. Players will be at the centre of every fight, commanding fleets of gigantic ships as the Chaos unleash a sequential chain of surprise attacks on Imperium worlds – the start of 20 years of warring in the sector.\nAn expansive single-player campaign across the Gothic sector.\nFour factions to command, each one with its own strengths and skills.\nTactical PVP multiplayer offering infinite replayability.\nA huge array of authentically recreated Battlefleet Gothic ships.\nA real-time strategy experience retaining many of the tactical Battlefleet Gothic elements.\nA plethora of lore-abiding skills to fill the player’s arsenal.\nUpgrade and apply skills at port Maw","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tindalos Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10138,"name":"Wild Terra Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4e/f4e3db5ffa5201c5fd824f72e8990981.jpg","description":"Wild Terra Online is a massively multiplayer life simulator in a fully player-driven medieval world.\nHere everyone will find an occupation that appeals to one’s soul: world exploration, hunting, crafting, home decorating, fights and castle sieges.\nStart as a survivor - become a medieval king!\nCore features:\nHuge open world based on a realistic medieval Europe.\nExplore a world that is completely created and driven by players. There are no pre-built castles, NPCs, or quests in the game. Only players themselves are able to build roads, cut down forests, found new towns … shape the server as they want!\nOpen world with the possibility to build wherever you want. It doesn’t matter whether it’s a campfire for one night or eventually an entire castle!\nDeep crafting system with different professions to indulge in: agriculture, animal husbandry, cooking, smithing, and more. There are lots of resources to gather and recipes to learn.\nSuccess in PvP depends on tactics and a player’s skill. Having a high level and upgraded equipment does not always guarantee a win. Wise usage of advantages such terrain and choice of one’s equipment are also keys to winning fights.\nServers for those interested in hardcore survival with full loot drop on death, destructible buildings, and PvP. There are also quiet servers for those who prefer a calm atmosphere and a non-PvP experience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Juvty Worlds","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":6905,"name":"Electronic Super Joy: Groove City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aed/aedd538af0823d985da3c7466d176c65.jpg","description":"A sequel to Electronic Super Joy! A brave new World, ending in an Epic Boss Fight!\nJump, dodge & dance among insane hazards, missiles, lasers & monsters!PlotA Giant Robot Stripper called JoJo has smashed Groove City! She's angry because Dr Swinger stole her Laser-Nipples!\nHelp JoJo reclaim her Laser-Nipples & defeat the Evil Plans of Dr.Swinger, with the help of Pope Boris the Super Sexy!Key Features15 Levels, including 2 full-length secret levels.\n19 Secrets & Secret Areas!\nNew collectible Stars, Missile Stars & Mega-Stars! Maximize your score!\n8 Challenging Achievements!\n6 new tracks from the musical Master, EnV!Praise for the original Electronic Super Joy\"Indie gaming with style\" - IGN\n\"Rock out and get your hardcore platforming on\" - Joystiq\n\"Prepare to die. A lot.\" - Destructoid\n\"Anybody else just fucking in love with this game?\" - Sevadus\n\"This game is... AWESOME!\" - iHasCupquake\n\"An epic sexy soundtrack to this epic sexy game\" - Markiplier\n\"This is probably the best story I've ever seen in an indie game\" - RageQuit, Rooster Teeth\n\"Oh Dude! I'm feeling Electronic Super Joy!\" - Game Grumps\nOwnership of Electronic Super Joy Classic is not required to play this game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Michael Todd Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":53945,"name":"Metal Gear","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/407/407b2f74d5c77ba4db91022051c64bd7.jpg","description":"Metal Gear is an overhead military action-adventure stealth video game originally released in 1987 by Konami for the MSX2 computer in Japan and parts of Europe. Considered to be the progenitor of the stealth game genre, it is the first video game designed by Hideo Kojima, who directed many of the later Metal Gear sequels. A reworked version was released for the Famicom a few months later, which saw a release in North America for the NES the following year, although this version featured drastically altered level designs among other changes, and was developed without Kojima's involvement. A more faithful port of the MSX2 version was later included in Metal Gear Solid 3: Subsistence for the PlayStation 2, as well as in the HD Edition of the same game released for the PlayStation 3, Xbox 360 and PlayStation Vita, with these newer ports featuring a revised translation and additional gameplay features.\nThe game revolves around a special forces operative codenamed Solid Snake who goes into a solo infiltration mission into the fortified state of Outer Heaven to destroy Metal Gear, a bipedal walking tank capable of launching nuclear missiles from anywhere in the world.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"NES"},{"id":0,"name":"Commodore / Amiga"}]},{"id":47396,"name":"My Memory of Us","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d9/0d91dc907f641f1a770429a501da594e.jpg","description":"Do you like stories? If so, then I’ll tell you one. But it won’t be just any old story. It’s going to be different, because it’s about real people, about events that are touching and horrifying even now. Let’s go back in time. It all began with a meeting between a boy and a girl who came from two different worlds. For a short time they had good laughs together, taking joy simply from each other’s company. Unfortunately, all good things must come to an end. War broke out – the Evil King plundered the city and his robot-soldiers appeared everywhere. Citizens were separated and some of them were marked and forced to move out of their homes and live in a place that was sealed off from the rest of the city by a huge wall. Fortunately the children were not alone – they had each other. Their friendship allowed them to stay together, even though fate seemed to try to tear them apart. That’s the story behind My Memory of Us, a game dedicated to those that were separated, but managed to find the strength to meet each other again.\n\n\n\r\nWhat makes My Memory of Us stand out is that the story is told from the perspective of two friends who complete each other. Each of them has their own abilities – she can run fast, he can sneak – but only when they work together as a team can they overcome all adversities. You just want to have fun with your friend. Go on then! Grab her hand and find out what adventures are waiting for you outside. Together, there’s nothing in the world that can stop you.\n\n\n\r\nFeatures:\n\r\n•A moving story about friendship and love in dangerous times\n\r\n•Beautiful, sketch-like graphics inspired by naïve art\n\r\n•Pair mechanics: take control of two characters with different skills and abilities, or control them as a pair\n\r\n•A grotesque tale mixed with bittersweet humor\n\r\n•The events shown in the game are based on actual stories from war\n\r\n•A dialogue system built around the language of symbolic pictures\n\r\n•Various logical puzzles in 2.5D\n\r\n•A story that offers deeper meaning, set in historical realities","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Virtual Programming","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]}]