[{"id":571,"name":"Warhammer 40,000: Space Wolf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f32/f3249ed24f4b98846ea80ef631716ff0.jpg","description":"WIN SPECIAL REWARDS IN NEW GAME MODE!\nAbout the Game\nPlease read this open letter from the devs to learn more the game and it's future!\nhttp://steamcommunity.com/games/553210/announcements/detail/240217815951193297\nTake command of a Space Wolves squad led by Valgard Twice Slain. Your Great Company’s Strike Cruiser fell into a trap set by Chaos Space Marines of the Word Bearers legion – causing you to make a forced landing on Kanak, a volcano-wracked feral world, inhabited by tribes of ruthless barbarians. Not only must you survive, but you must emerge victorious.Game features:\nDefeat the unrelenting enemies of the Space Wolves:\n• An epic campaign with branching storylines, spanning hostile environments on a distant planet.\n• Combat the Word Bearers - fanatical and deadly traitors who serve the chaos gods.\nBrutal Tactical Combat:\n• Lead your Space Wolves into fierce battles in glorious, diverse environments;\n• Challenge your Brothers in multiplayer and earn ultimate rewards by proving your leadership.\nChoose Your Path:\n• Grey Hunter, Wolf Scout or Wolf Guard – You decide which path to follow, to best match your own style, strategy and tactics.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"HeroCraft","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":376934,"name":"Pistol Whip","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/619/6196b2342cec75dcd0dad9f835485a14.jpg","description":"Inspired by God-mode action movies like John Wick and Equilibrium, Pistol Whip throws you gun-first into an explosive batch of hand-crafted action sequences each set to their own breakneck soundtrack. But unlike traditional music games, Pistol Whip has no line in the sand; you have complete freedom to shoot, melee, and dodge targets to the rhythm YOU see fit.\nFeaturesPair the pulse-pounding pace of an FPS with the flow-state energy of a music game in a cinematic symphony of violence.\nForm your rhythm and find your playstyle, from tactical to musical, then challenge your skill with friends and world leaderboards.\nInfiltrate a fever dream of hand-crafted sequences, from bank heists to android uprisings, each uniquely designed to music.\nTake it over-the-top with a variety of gameplay mods, such as Dual Wield, to enable the ultimate gun kata experience.\nConstant momentum and comfort-first design allows non-stop speed without the fear of motion sickness.\nFeaturing EDM artists from Kannibalen Records, including Apashe, HVDES, and Black Tiger Sex Machine; with more to come...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Cloudhead Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":59343,"name":"Persona 5: Dancing in Starlight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f58/f583a15f36b201e2d42685c552505bdf.jpg","description":"Face-to-face with enigmatic Velvet Room residents, the Phantom Thieves are forced to perform at a mysterious dance party. Test your rhythm based gameplay skills and steal some hearts on the dance floor!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Atlus U.S.A","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":19524,"name":"Call of Juarez: The Cartel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/32a/32a1a382602c31015e6a6828c82e10be.jpg","description":"Welcome to the new Wild West.\nThis first-person shooter brings the lawlessness of the Old West into present day. You’ll embark on a bloody road trip from Los Angeles to Juarez, Mexico immersing yourself in a gritty plot with interesting characters and a wide variety of game play options.\nExperience the lawlessness of the modern wild west as you hunt down the Mendoza cartel in a world where the ends justify the means. Your hunt for the Cartel boss takes you on an epic road trip from a meth lab in the Sequoia national forest to the Cartel headquarters in Ciudad Juarez. With over 10 distinct environments including urban LA brothels and back streets, gritty boat docks, a swanky yacht party, the open deserts in Arizona and New Mexico, a Mexican funeral and more.\nKey Features:\t\t\t\t\t\t*NEW* CO-OPETITION GAME PLAY\nPartner with 2 other teammates to achieve joint objectives, while sneaking behind their back to advance your secret personal agenda. Play the 20-mission campaign mode solo or with up to 3 friends Triple the replay value: Play the entire campaign with each of the 3 characters; each character has their own unique story and distinct ending.\nFUN MULTIPLAYER EXPERIENCE\nPlay up to 6 vs 6 in Team Death Match and Cops vs Gangsters. As you play, your character will evolve, unlocking weapons and gear.\nRICH STORY COMBINED WITH GAME PLAY VARIETY\nRelevant character-driven story that unfolds differently depending on which character you play. Game play is driven by variety: Punitive raids, witness protection, tough interrogations, undercover missions, shootings in crowd, car chases and more Choose between 30 weapons including pistols, revolvers, sub machine guns, machine guns, assault rifles, shotguns, sniper rifles, anti air weapons and more.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Techland","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":16170,"name":"Flight of the Paladin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66e/66ed41f8e24d34fe8f1d0bd205b0de87.jpg","description":"Flight of the Paladin is a fast-paced top-down shooter where you play as a knight of valor and light vanquishing the nightmarish creatures of darkness.  Shoot your way to victory as a lone champion of justice.\nIn Campaign Mode, though your quest begins easily enough do not be lax in your crusade, Paladin, or you may soon be surrounded and overwhelmed. Every second the path grows more treacherous and the minions of evil increase in number. But take heart, you have the protection of goodness on your side! Subdue your enemies quickly by unleashing that power on your foes. Each stage ends with a boss that needs to be vanquished to move on to the next area. Navigate through the deep Woods, take on the Hollow Path, and you might find yourself at the Castle Ruins of Dracula!\nIn Survival Mode face waves of challenging monsters and random bosses to try to survive as long as possible. Can you stand shoulder to shoulder with the best Paladins on the Leaderboards? Play now to put your skills to the test!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Grizzly Wolf Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13011,"name":"A Normal Lost Phone","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fe1/fe1732c263365f9af009cc3d4d5d6880.jpg","description":"A Normal Lost Phone is a game about exploring the intimacy of an unknown person whose phone was found by the player.\nThe game takes the shape of a narrative investigation: you have to search the phone’s text messages, pictures and applications, in order to learn about its former owner. Through this phone, you uncover Sam’s life, friends, family and relationships, until the evening when they turn 18 and mysteriously disappear.\nFeatures\nAn immersive and intuitive way of introducing the narrative through a fake smartphone interface.\nA game that bridges the gap between reality and fiction by letting players act as themselves. The game asks a simple question: if you close the app but still think about the game, have you truly stopped playing?\nA relatable story that helps build empathy with the characters, allowing to explore difficult topics.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":11786,"name":"Angeldust","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c64/c645d6e3ed531ea212a702347e6ac1df.jpg","description":"Adventure. Anywhere!Explore endless magical worlds and battle fearsome creatures alongside millions of friends. Unleash your imagination by crafting beautiful buildings.Be bold. Be a hero.Play as the quirky builder, the fearless fighter, the perky scout or the mysterious sorceress and become the legend you were destined to be! Every hero is voice acted, so you are never lost for words.All friends!Use your activated Angeldust account to play Angeldust online with your friends and millions of other players, or use the 'alone'-mode to build alone in your own game world. You can even customize your sign-in screen!All fun!Angeldust is unanimously praised amongst players of the game. Join the new gaming sensation and start your Angeldust adventure today!Angeldust. A magical game:More than 250 different creatures to discover and defeat\nMore than 200 beautifully designed materials to build with\nMore than 25 gorgeous landscapes to explore\n4 uniquely outfitted heroes to role play\n1 giant game world for everyone","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frank Lucas","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11109,"name":"Waves 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/220/220265e36dd6d5561935ca4beb6b7d78.jpg","description":"In The Neon Ballroom of Cyberspace There is Only... 404 File Not Found\nLog in to The GRID and engage in psychedelic virtual combat as you dive deep into Corporate Networks, steal their secrets and crash their servers.\nChoose your Character, Prepare your Rig and pick a side in the never ending war fought in Cyberspace.\nIt's your reflexes against the relentless assault of Bugs, Programs, Viruses and AI's in this Twin-Stick Shooter. Chain together kills to build your Combo and earn Adrenaline that can be unleashed in devastating Burst Attacks. Customize your Avatar's Loadout to match your combat style and explore synergies between the 36 Items to find the best combination for you.\nAI System Administrators adapt to your weaknesses and try to exploit your vulnerabilities as they defend their Networks both in the Arena and on the GRID.\nHack into Corporate Networks in the Roguelike GRID Campaign mode.\nCompete in 6 Arcade Arenas for Leaderboard glory.\nUnlock 36 Items that can be combined in up to 46,656 different ways allowing you to customize your Avatar for any play style.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Squid In A Box","platforms":[{"id":0,"name":"PC"}]},{"id":10532,"name":"99Vidas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6f/e6fd4ac77f0a9f16502f417725448f8a.jpg","description":"Every gaming generation had its hallmark -- and \"99Vidas\" recaptures them all!\nFinal Fight, Double Dragon, Battletoads, Streets of Rage… What do all of these games have in common? They all represent the glory of the \"beat 'em up\" genre, a staple of gaming in the 80's and 90's. Developer QUByte Interactive took inspiration from all of the the unforgetable notes from that game style to proudly bring you \"99Vidas\".\n\n\"99Vidas\" is a brawler set in a contemporary world, but that pays tribute to both the classic and the new in the gaming industry. Brought to you in 16-bit pixelated glory, chock-full of references to not only gaming but also 80's and 90's pop culture. \"99Vidas\" takes full advantage modern era gameplay mechanics, making it the best of both worlds.\n\n6 stages (with more to come) will take you on a journey to different parts of the world to face hordes of fierce enemies and relentless bosses, but you don’t have to do it alone: you can face this challenge with up to 3 other players in co-op play, both local and online.Key Features","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"QUByte Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":4392,"name":"Doc Clock: The Toasted Sandwich of Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a92/a92d0f13a9d58ca8f91dba0ee77812e0.jpg","description":"Fallen off a cliff? Burning in lava? Just had your latest invention crushed by a frozen polar bear? Avoid all this with Doc Clock's amazing Time Slider. Enjoy the first Doc Clock time travelling adventure! Invent almost anything out of everything you find, from catapults to incredible flying machines. Travel through time as Doc Clock battles mad, misguided robots to save his beloved cat and invent the perfect toasted sandwich machine.\nKey features:\t\t\t\t\t   Build amazing contraptions from scattered objects\nRewind time with the Doc’s incredible Timeslider\nHarbour Sack’s sarcastic wit as he helps the Doc on his journey\nComplete all the achievements of varying difficulties in order to master the game\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Stickmen Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"}]},{"id":3756,"name":"Master Reboot","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c6/1c66a844b198950de51edc36de1d81dd.jpg","description":"Imagine a world where death is no longer final, where precious memories are saved to enjoy forever, where your soul is immortal, welcome to the Soul Cloud. Upload your soul to our dedicated servers and relax knowing that a part of you will live on for eternity. That favorite holiday, happy moments from your childhood, meeting that special someone for the first time. All these memories saved for your digital soul for your family to revisit again and again. The Soul Cloud - saving your past to secure your future.\nMaster Reboot is a haunting first person sci-fi adventure game set inside the Soul Cloud. It's an exploration game with action and puzzle elements set across 34 unique environments. In the not-too-distant future exists the Soul Cloud, a giant server that holds the data of your soul and your memories when you die. The Soul Cloud is filled with floating islands, each island looks like a town, village or city filled with rooms, skyscrapers and houses that hold people’s memories. To house your Soul, a family member (or you before you die) must purchase an island on the Soul Cloud where the server will generate rooms, houses or skyscrapers that hold each and every memory from the deceased’s past.\nThe game features a distinctive visual style, intriguing story-line, psychological adventure-game action and a dynamic atmospheric soundtrack. Get prepared for upload......Where am I?.....Who am I?......It's time to piece your life......and death back together.\nFEATURES\n• Gorgeous visual style\n• Intriguing story-line\n• 34 explorable environments\n• Dynamic atmospheric soundtrack\n• Supports the Welsh Language","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Wales Interactive","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":398407,"name":"Dungeons & Dragons: Dark Alliance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/66b/66b463a0861b07e690fefcbeded4f6f1.jpg","description":"Dark Alliance is Dungeons & Dragons' new action-RPG from Tuque Games coming out in fall 2020 for PCs and consoles. It features Drizzt Do'Urden and the Companions of the Hall, the first time they've starred in a D&D video game.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Tuque Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":375199,"name":"Assemble with Care","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d5/6d5468dcdc0ce522418fe8214a83a65b.jpg","description":"From the studio that brought you Monument Valley, comes a story about taking things apart and putting ourselves back together.\r\n\r\nWhen Maria, a globe-trotting antique restorer, arrives in the sun-soaked town of Bellariva, she has no idea just how broken it will turn out to be.\r\n\r\nShe wants nothing more than to help the town’s inhabitants save their most beloved possessions, but when it’s their personal lives that are starting to fracture, she’ll need to find a way to hold them together, one spare screw at a time.\r\n\r\nMEANINGFUL PUZZLES:\r\nExplore the objects through Maria’s eyes and find a way to restore them.\r\n\r\nEVOCATIVE STORY:\r\nMeet the townsfolk of Bellariva. Come to love their quirks and help them reconnect.\r\n\r\nNOSTALGIC CHARM:\r\nRediscover the defining objects of decades past to the tune of the original soundtrack, inspired by the sounds of the 80s.\r\n\r\nHANDCRAFTED VISUALS:\r\nEnjoy gameplay rendered in a beautiful, impressionist style, alongside a completely hand-illustrated story\r\n\r\nThis game does not support MFi Controllers.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"ustwo games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":60884,"name":"Leisure Suit Larry - Wet Dreams Don't Dry","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47a/47ae04730cc685167bf0c67472ea5460.jpg","description":"Hey ladies, I’m back in business! My new adventure, Leisure Suit Larry - Wet Dreams Don’t Dry, takes me – whatever the route or twist of fate – from the end of the ’80s directly into the 21st century and wow, how the world has changed! While my view of the world and women from way back in the 1980s collides with modern reality harder than the breasts of a lusciously stacked blonde jogging along a beach, I’m all set to date my way across the modern world!\nIn a “point & click” adventure I’d call typical for the genre we mutually experience how I fall head-over-heels in love with Faith, the hot-to-trot assistant to the boss at Prune, a technology enterprise successful worldwide. Since even dating is done digitally nowadays, the first thing I have to do is to work on my score at Timber, the totally hip, can’t-get-anywhere-without-it dating app where I date women, satisfy their needs, and accordingly pick up points for my Timber profile. And whenever I get a chance in between, always briefly check out a few new bikini pix at Instacrap – the 21st century is gnarly smill!\nLeisure Suit Larry is coming in the 21st century – and no, there’s no word missing here\nExplore a lovingly designed, non-linear game world set in the modern world with over 30 handdrawn venues\nUse “Timber”, the ingame app, along with an innovative dating mechanism to date women, consequently improve your score at Timber, and ultimately clear the way to get to Faith, the women of your dreams\nSolve true-blue puzzles and interact with over 30 handdrawn characters","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":46066,"name":"Uurnog Uurnlimited","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c6c/c6c463e65e4e853e74154a6eddd6b5c0.jpg","description":"Enter the wacky & whimsical world of Uurnog Uurnlimited, where you have only one goal: find your way around the world, and steal all the animals! Why? Because they’re adorable, and because video games.\n\nUurnog Uurnlimited is a delightfully silly 2D platformer inspired by games like Super Mario Bros. 2, Lyle in Cube Sector, and Dyad. Play single-player or co-op, explore the world through its many mysterious doors, solve puzzles and gather the items and animals needed in your Save Room. Careful though — the Save Room also saves your mistakes (urr nurr!)\nWhat else does it have, you ask? Chaotic neutral NPCs that can mess with your game! Algorithmic music that adapts to the gameplay!\n\nIt's uurnbelievable! It's uurnexplainable! It's Uurnog Uurnlimited!\n\nKey Featuurnes:\n•\tCLASSIC 2D PUZZLE PLATFORMER:  Solve puzzles and collect animals, then bring them back to your Save Room.\n•\tCHALLENGING BOSS FIGHTS:  Survive long enough and you may even meet the Uurnog!\n•\tSWEET ALGORITHMIC MUSIC:  Adapts the melody, tempo, key, and more to the gameplay.\n•\tPLAY SOLO OR SHARED SCREEN CO-OP:  Real talk: everything is better when you’re playing with a friend as an adorable puppy, right?\n•\tMULTIPLE ENDINGS: Shhhh. I hear there may even be some secrets to discover… ;)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Raw Fury","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20291,"name":"Eldevin","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23b/23bf5104764f7ac9850b22f50cf8f0e7.jpg","description":"Eldevin is the award winning indie story-driven Free to Play MMORPG (Massively Multiplayer Online Role Playing Game) from Hunted Cow Studios. Join thousands of other players and explore the mystical lands of Eldevin. Featuring more than 160 realms, each filled with unique creatures and characters for you to encounter. Explore vast open plains or descend underground into hidden caves and dungeons, making friends or foes of the various factions as you carry out your epic quest to defend Eldevin Kingdom.Features\nRich storyline involving hundreds of epic quests.\nHuge world to explore with many cities, areas, dungeons and secrets.\n6 Talent Trees featuring over 200 talents.\nReal-time combat system.\nUse strategy and tactics to defeat epic Foes and Bosses.\nEngage in PvP combat with your friends and enemies.\nYour decisions and actions will affect future encounters and possibilities.\nClass-less combat system; players in Eldevin are free to learn any of over 100 unique abilities.\nTrain in 14 professions to craft your own weapons, armor, items and amenities.\n16 group-based dungeons and dozens of in-depth story-driven solo instances.\nHundreds of items, including over 40 unique sets, to obtain and collect.\nLevel up to 49 and enjoy awesome end-game activities.Lore\nEldevin Kingdom, for generations, has been a green and peaceful land. All that changed ten years ago with the discovery of the Elemental Spheres. Once thought to be mere legend, these powerful magical artifacts had an immediate affect on the kingdom, plunging it into confusion and chaos. The royal family decreed that the Spheres be scattered to the corners of the world lest they cause more destruction. They were too late. The presence of the Spheres corrupted the Champions protecting them. Now Tristan, Emperor of the Infernal Empire, has set his sights on conquering the Spheres. Only the Kingdom of Eldevin stands in his way.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Hunted Cow Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9472,"name":"Medusa's Labyrinth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/87a/87afd0c38c5a5a3dff8d48798a78c7dc.jpg","description":"Medusa’s Labyrinth is a mythological first person horror game set in ancient Greece. It takes myths and legends that have stayed with us for over 2000 years and mix them together in a game that blends horror with stealth into a unique experience.\nThe player will have to carefully pick their path through the abandoned hallways on Temple Island, through winding catacombs and dark corners to solve the mysteries that lurk within the labyrinth.\nThe game was originally planned to be a part of a much larger game, but we decided to launch this version as a short free adventure, so anyone with a Steam account can play it without paying a dime. We really hope you will enjoy the experience, as we made it public for just that reason: For you people to get a glimpse of what Medusa could have become with a longer production time and additional funding.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Guru Games","platforms":[{"id":0,"name":"PC"}]},{"id":6214,"name":"Dink Smallwood HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e0/0e05b5ea70efa45576d6eb42a8cdbe4d.jpg","description":"\"Dink Smallwood is a perfect example of the refined basics of classic RPG and adventure games…enjoy the hearty dose of something simple, silly, and special.\" - Jordan Thomas, Avault.com\n\"The main hook in this game has to be the sense of humor that permeates it... the difference is that this game is beautiful, gory, and has a wonderful (and twisted) sense of humor.” - T. Byrl Baker, Computer Gaming World\nIt all began in a world where dragons roamed the land and knights fought with valor and honor.\nAnd then there was Dink. Can a simple pig farmer thrust into an epic journey of magic and adventure save the world?\n\nDink Smallwood HD is the newly remixed version of the classic RPG brought to you by the original creators featuring:\n•Now includes full in-game DMOD support!  300+ user made quests/stories available\n•Supports the iCade controller\n•Supports the 60beat® GamePad (on iOS 4+)\n•Three add-ons included: Mystery Island, Agatha's Will, and Furball\n•The complete re-mastered original CD soundtrack\n•Speed up' button to fly through dialog and cutscenes at your own pace\n•Automatic full state save/restore whenever you quit/restart the game\n•Auto save and Quick save/load feature\n•Upgraded and optimized engine, Dink never looked or sounded better\n•Two control methods, directional pad and “drag anywhere”","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Robinson Technologies","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Web"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":5648,"name":"Rocksmith","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8d5/8d548f836913dab6867884804f8ab3ea.jpg","description":"Rocksmith™ Real Tone CableThe Rocksmith™ Real Tone Cable is not included with the purchase of Rocksmith™ on Steam and must be purchased separately.  Please see your local retailer or many online stores to purchase the Rocksmith™ Real Tone Cable.\nRocksmith™ requires a unique 1/4\"-t- USB cable, that is the first of its kind, which allows users to plug any real guitar with a quarter-inch jack directly into their console or PC.\nDeveloped exclusively for Rocksmith™, this revolutionary cable turns the guitar's signal from analog to digital, allowing it to be recognized and played through video game consoles or PC for the first time.\nThe use of a second Rocksmith™ Real Tone Cable allows for simultaneous split-screen cooperative play while playing Rocksmith™.\nAbout the GameRocksmith™ is the first and only game that you can plug into any real guitar or bass with a 1/4\" output jack.\nNothing plastic, nothing fake, just the most authentic and complete guitar experience in music gaming. By plugging into your PC, you’ll develop real skills and real styles while playing absolutely real music.\nFeaturing gameplay that automatically adjusts to your personal ability, Rocksmith’s innovative game design makes playing music visually intuitive and will engage experienced musicians as well as those who have never picked up a guitar in their lives.\nUnlock mini-games to hone specific skills. You’ll also be able to choose from a large catalog of songs in different styles. You’ll experience it all with an honest-to-goodness guitar or bass. Nothing compares to playing a real instrument.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":3828,"name":"Super Motherload","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82a/82a78c81a3bead7c2400a9a892e9d8f7.jpg","description":"Set on Mars in an alternate Cold-War era, Super Motherload is a 1 to 4-player couch co-op digging adventure with storyline by Image Comics' Kurtis Wiebe, a fully voiced cast of Soviet and American characters, and a procedurally-generated world that changes each time you play. Purchase powerful upgrades and supplies for your mining pod as you progress and prosper, as well as rare Specials Abilities with random availability.\nYou, the player, work for Solarus Corporation, an inter-planetary mining operation that has developed the infrastructure needed to harvest the precious resources of Mars to meet demand back on Earth. Soon after being dropped on Mars, you begin to discover that things aren't quite as they seem.\nIncluded free with the Steam version of Super Motherload is Motherload Goldium Edition, the 2004 cult classic that inspired games like Infiniminer.\nKey Features:\nUp to 4-player co-op, perfect for Big Picture (local-only)\nStoryline by award winning Image Comic's writer Kurtis Wiebe of Peter Panzerfaust & Green Wake fame\nFull Voice Overs and a Full length original score by indie electronic artist Eric Cheng\nRPG-inspired mechanics, including upgrades, quests & special abilities\nBranching storyline choices with Multiple Game Endings\nOver 150 Explosive-based Puzzles to solve\nAn Epic Boss Battle\nNormal and Hardcore game modes, for new players and fans of the original\nSupport for 4 simultaneous Gamepads -- ideal for Big Picture\nRuns at 60FPS in Full HD (1080p)\nSuper Motherload is the sequel to XGen Studios' original hit Motherload, and is available on Windows, PS4, and PS3\nIncludes Motherload Goldium Edition","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"XGen Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1283,"name":"King of Dragon Pass","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b2/3b2243fbedd4373d1d4154c586723465.jpg","description":"Special Edition\nAbout the GameA unique, remastered mix of RPG and strategy: everything in King of Dragon Pass is about choice and control.\nCreate your own epic saga of conflict, mythology and community! Rule your own clan, take important strategic decisions, win battles and expand your influence. Choose your counsel carefully, sign diplomatic agreements or declare war on nearby clans.\nThis acclaimed game of magical storytelling blends interactive stories and resource management.\nImmensely replayable, thanks to nearly 600 interactive scenes. Short episodes and automatic saving mean you can play even when you only have a minute or two. The built-in saga writes down the story for you and advisors with distinctive personalities help you rule your clan.\nBecome the King of Dragon Pass!\nGame Features\nOne of the Top 100 best mobile games of all time (Metacritic)\nThe legend is back with new content never published before\nEpic saga of conflict, mythology and community\nImmensely replayable\nHand-painted artwork\nInteractive story with an ultimate level of complexity\n-----------------------------------\nKeep track of HeroCraft game news and updates!\nhttp://twitter.com/herocraft\nhttp://youtube.com/herocraft\nhttp://www.facebook.com/herocraft.games","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"HeroCraft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":492223,"name":"Scott Pilgrim vs. The World: The Game – Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b23/b2375c9b0b01394bb55093269b36168c.jpg","description":"Scott Pilgrim is back! Team up with friends to battle your way through waves of tough enemies to fight for love. Share health and coins, compete in mini-games like Dodgeball, and challenge each other to an epic-last-one-standing duel.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":328004,"name":"Contra Anniversary Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b89/b89f1c48fca99fb6742a43f8880b4a8e.jpg","description":"The Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players.\nGrab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test. Also included is a digital Bonus Book with tons of concept documents and sketches, the official chronology of the franchise, an exclusive interview with the veteran producer of the series, and more!\nAlone or with a friend, Contra provides hours of nail biting action. In a pinch make sure you know the code!\nContra (Arcade)\nSuper Contra\nContra (NA)\nContra (JP)\nSuper C\nContra III: The Alien Wars\nOperation C\nContra Hard Corps\nSuper Probotector Alien Rebels\nProbotector\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1-2 players\n700MB minimum save size\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©Konami Digital Entertainment","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":28573,"name":"Hydro Thunder","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/551/5512abb988369ddaef4f80bb464cfd2e.jpg","description":"(ONLINE INTERACTIONS NOT RATED BY THE ESRB)  This all-new sequel to the legendary arcade hit features amazing dynamic water physics, transformable rocket-powered boats, gorgeous visuals and over-the-top interactive environments.  Single player games include Race and Championship, and two brand new modes: Ring Master and the explosive Gauntlet.  Combine local 4-player split-screen and online multiplayer games with 8 players over Xbox LIVE.  There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Vector Unit","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":18037,"name":"Unforgiving Trials: The Space Crusade","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbc/bbcd47f8c7530f09b300cc908a951819.jpg","description":"STORY\nThe world is dying. Many years after the banishment of the evil that plagued the land, the world was hit by waves of unbearable heat. Crops are withering, rivers and wells drying and the cattle is slowly dying out from illness.\nDuring his desperate work to save his family farm from the heat, young farmer named Jory was suddenly visited by a mysterious stranger claiming that the land could be saved and that he is the one who can help save it.\nDespite his skepticism, in desperation he accepted the strangers offer and was instantly transferred to a strange flying metal contraption where three other people waited.\nThe stranger explained to them that the thing that plagues this world is not a natural, but man made disaster. An evil and immortal tyrant, together with his evil legions from times past is manipulating the Sun that heats their world and the very fabric of time. All to fulfill his goal of utter time and space domination. Coming from a time where the tyrant already established domination, the stranger known as Cooper came back in an attempt to rewrite time and thus save both present and the future from utter destruction.\nHe explained to his four guests that even though they are not warriors they all carry genes of great heroes of the past. Using his superior technology he can make Jory and his new friends capable of combating any threat that comes their way.\nGAMEPLAY\nEach character will choose his own unique class among the rich variety that \"The Space Crusade\" offers. Despite this, they will not only be defined by their class of choice, but also with their inherent abilities (i.e. farmer Jory will be more sturdy then his companions, while grifter Laura will be more agile then the rest). Every class will be able to use a wide variety of abilities that will enable them to combat their more technologically advanced foes. The number of possible encounters is fixed, so there will not be any tedious level grinding. After each level up the player will choose new skills, and with it the way their characters develop combat-wise. Goal of the game is to reach the Sun where the tyrant resides while combating his legions, both human and mutated monstrosities.\nCHARACTERS\nJory - small town farmer with a wild youth, but after his father died he settled down to run his family farm in his honor.\nDante - young scholar with an interest in engineering. He accepted Cooper's call to observe his advanced technology.\nLaura - grifter from the Capital City that joined Cooper to flee the guards chasing her after her last scam.\nVictoria - initiate in a secluded temple yearning for adventure and an opportunity to help her fellow man.\nCooper - time-traveling stranger from a ruined future. He traveled back in time to stop the problem at its root. Pilot of the vessel \"Solarius\", and leader of the team.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":16009,"name":"Caravan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cf/6cf3a52c8c104624c1da433afb21f347.jpg","description":"Many myths and legends have been woven about the Arabian Peninsula. One of these legends tells of Iram, City of Pillars, and its exceptional destiny.\nBeing the heir to the throne you lived a life of splendor and never worked one day of physical labor – until one day, the winds of fate turned.\nDays passed and the storm did not fade, if anything its strength and ferocity only grew. You would do anything to bring back only a spark of your mother's joy. And so, one night, when the kingdom sleeps and the moon smiles, you embark on a journey …\nCaravan combines strategy with RPG elements resulting in a trading and exploration game packed with suspense and challenges. In a pre-medieval Oriental setting players will send their caravan from town to town. On their way, they will experience dangerous, mystical adventures, embark on rewarding quests in towns, and fight against dangerous bandits, beasts, ghoulish creatures and djinns.\nGenre-Mix: diverse gaming experience through a mix of strategy, trade, and RPG elements\nPlayers manage their own caravan\nSetting based on history and geography of the Orient\nCultural authenticity through regional folklore and stories of the ‘Arabian Nights’","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"it Matters Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12935,"name":"Drayt Empire","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4b9/4b914cf2b20ceb58e0935c7ac112285b.jpg","description":"Drayt Empire - Features:Classic side view, turn based battle system.\nAt least 8 Hours of Gameplay.\nSeek out, collect and equip up to 20 Crystals that will boost your power and abilities or give you special items.\nEnjoy mini games, go digging in the desert for treasure or do a spot of fishing.\nAll new animated Menu System.\nA stunning soundtrack by Snowflake.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"RPG Video","platforms":[{"id":0,"name":"PC"}]},{"id":12475,"name":"Deep Space Dash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1af/1af8d0c797f0ff42126f456af85ecc31.jpg","description":"Deep Space Dash is a third person futuristic space runner that will challenge your focus and dexterity.\nYou're a convict in an Intergalactic High-Security Prison, at an unknown location.\nYou have managed to escape your cell and you discover an unmanned security shuttle, jump in and don't look back!Deep Space Dash has 3 game modesClassic Runner Mode - Travel as far as possible, build up huge high scores and make your friends jealous.\nChaser Mode - The security drones are on your tail. Dodge the skulls and travel as far as you can.\nMaze Mode - You'll need to be focused and ready to turn corners at a moments notice!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Delusional Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11071,"name":"Spikit","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46d/46dcb6d70d72daefc0ecdc2a7a42df60.jpg","description":"Spikit is a bullet hell game developed by a single developer, Igor Petrović. With a soundtrack composed by Dario Malešević. In this game, the player will have to dodge a constant barrage of spikes coming from the side of the screen. Not only will the player have to evade the spikes currently on the screen, but they will also need to keep an eye out on the next wave of spikes and position themselves accordingly.\nThe longer the player manages to stay alive, the higher their end-score will be, with difficulty gradually increasing as time passes. As the game progresses, there will also be the chance of a box appearing. Boxes are the 'currency' of the game - collecting enough of them allows the purchase of new skins and themes, both mostly aesthetical features.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blastoid Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":521738,"name":"SuchArt: Genius Artist Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/45f/45fdc1200e4336e2119bbffb14d230c5.jpg","description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1293180\nAbout the GameWhat would you do if you were provided with your very own art studio? SuchArt: Creative Space gives you an opportunity to find that out!\nLet your imagination run wild and paint whatever you want, complete commissions, decorate the studio with your art and furniture, buy tools and experiment with them — you’ve got 3 rooms and an infinite amount of time, and only you decide how to handle them!\nREALISTIC PAINTINGPainting in SuchArt feels just like in real life, but without the downsides. Colors mix as you would naturally expect them to, so you can easily achieve the result you dreamed about. Paint has a realistic texture, and each instrument alters it a bit with different strokes. There’s plenty of instruments to choose from: brushes, palette knives, stencils or even flamethrowers to create your next masterpiece.\nSELL YOUR ARTSell your paintings at the marketplace, fulfill all your clients' orders, and receive a generous commission, or maybe a gift!\nBUY VARIOUS ITEMSSpend your hard-earned credits in the brand new shop, where you can get multiple painting tools, furniture and decorative items.\nDECORATE YOUR STUDIOPaint the walls and the floor, place  furniture and decorative items wherever you want, and turn the space you own into something completely new — make yourself at home!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"hypetrain","platforms":[{"id":0,"name":"PC"}]},{"id":388383,"name":"Spirit of the North","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ea/9ea4638d6f9edf881aa6bafee0a40711.jpg","description":"Spirit of the North is a single-player 3rd-person adventure game inspired by the breathtaking and mysterious landscapes of Iceland. The story takes root from various pieces of Nordic folklore. The game is unique in that it purposefully has no dialog or narrative. Players must breathe in their surroundings to solve various puzzles and speculate the meaning of a lost ancient civilization. Play as an ordinary red fox who’s story becomes entwined with the guardian of the Northern Lights, a female spirit fox. As you journey over the mountains and under red-stained skies, you’ll discover more about your companion and land left in ruin.\n1 player\n9GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nSpirit of the North © 2019 developed and published by Infuse Studio LLC. All rights Reserved. Infuse Studio and Spirit of the North logos are trademarks of Infuse Studio LLC. All other trademarks and trade names are the property of their respective owners.  Original Soundtrack by Joseph Gifford licensed exclusively to and published by Infuse Studio LLC.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Infuse Studio","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":18625,"name":"Gabriel Knight 3: Blood of the Sacred, Blood of the Damned","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/582/582e9a48a8ff0ef68eb1401e9428e45b.jpg","description":"One frightening truth.\nWelcome to the remote French village of Rennes-le-Château. Gabriel and Grace arrive in this town in pursuit of a kidnapped child, but a deeper, far more frightening story begins to unfold. Whispers of a sacred bloodline, vampires and a boundless treasure set the shadow hunter and his companion on an inescapable path. Their ultimate destiny is to solve a dark mystery held secret for thousands of years.\nPlay as both Gabriel Knight and Grace Nakimura as you learn more about what is hidden in the hills of France. But beware your life, your faith and your soul. For once the truth is found, there is no erasing it.\nEncounter intricate puzzles critical to solving this ancient mystery.\nFind, acquire (and steal) a vast inventory of clues, tools, cash and more - using your clever and devious sleuthing skills.\nInteract with an eclectic cast of characters - each with their own agenda. Who can you believe?","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sierra","platforms":[{"id":0,"name":"PC"}]},{"id":1311,"name":"Boson X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/23a/23afed6df8fa04eb3f326fd1d73fe5de.jpeg","description":"Quantum jump your way to critical velocity in Boson X: the rotational runner set in a particle collider.\nBuild up speed inside a massive particle accelerator and generate high-energy collisions to discover strange new particles. Use precise timing and fast reflexes to navigate a subatomic world where floors and ceilings don't exist. Be fast enough to find the elusive Boson X.\nFeatures:\nFast-paced, unforgiving gameplay\n18 challenging levels to master\n3 highly qualified physicists to play as\nSteam leaderboards and achievements\nNo superfluous powerups, coins or XP systems - just deadly serious scientific research\nWARNING: This game contains flashing lights.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ian MacLarty","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":42044,"name":"Heroes of the Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/994/994af944846343d8f6eb4d23f4db62a4.jpg","description":"This free-to-play online team brawler assembles a diverse cast of characters from Blizzard’s far-flung realms of science fiction and fantasy, including the Warcraft, StarCraft, and Diablo universes, and challenges them to compete in epic, adrenaline-charged battles. Heroes of the Storm solicits players to customize heroes to suit their style and then team up with friends for some all-out mayhem. The game features an array of gameplay modes for players of every skill level, including Cooperative, in which players team up against computer-controlled opponents, and Quick Match, an accessible way to jump in and play versus others. Experienced players can also join forces against other teams of players in highly competitive, draft-style ranked play.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17792,"name":"Highway Blossoms","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/285/28557d8706a9d1bbaa98576e82ace34a.jpg","description":"Highway Blossoms is a short yuri kinetic novel set in the American Southwest. After an old gold rush miner's journal is discovered, supposedly detailing where he hid parts of his stash, a nationwide craze begins as would-be prospectors try to solve its clues and strike it rich.\nAmber couldn't care less. Wandering the desert in a recently-inherited motorhome, she mourns the loss of her grandfather - indifferent and unaware of the hunt happening around her. It's not until she meets Marina, a young hitchhiker lost in New Mexico that the girls get swept up in the rush.\nAt least tens of words, maybe even hundreds. Although the last word count puts it around 90,000, so expect 6 or so hours of reading.\nGrand, hand-painted vistas of actual landmarks in the western United States, all in glorious 1080p detail.\nA huge soundtrack featuring the works of Anna Logue, Jake Abernathie, Able Kirby, and other friends of AlienWorks. Sounds right at home on your in-dash cassette tape player.\nAccessibility options for days, including the ability to skip through everything in less than five minutes. But who would wanna do that?\nAchievements, although to be honest, they might be stretching the definition of \"achievement.\"\nAlternate silly content for second readthroughs that AlienWorks let the programmer write. This may or may not have been a good idea.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"AlienWorks","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":15771,"name":"Bloodsports.TV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ac/9ace621f75acf4727200a91297c16551.jpg","description":"Featured DLC\nAbout the GameTeam up Gladiators! New volunteers are incoming.\nBloodsports.TV is a co-op top-down Hero Defense game. In this spin-off set in the world of Krater, take on waves of incoming enemies and bosses in this old school, fast-paced approach to strategic co-op games. Protect the glorious Missile Silo - locked on and ready to be fired at villages for a fresh supply of volunteers.\nTeam up with your friends and form a murderous crew from a variety of Gladiators, each with their own unique abilities and styles. Shoot, smash, stomp, electrocute, drain and melt your enemies (and occasionally heal your allies) to become a legendary Gladiator. Achieve higher scores and climb global leaderboards with your friends to become the greatest crew of Gladiators in the world.Core Features:8 Diverse Gladiators: Choose your favourite and team up with your friends to find the best strategies and survive the longest.\n90+ Items: Customize your Gladiator to your liking with a plethora of items.\n8 Arenas: A vicious sport of gladiators needs an arena. Bloodsports.TV features six arenas with tactics to master and beasts to slay.\nDetailed Leaderboards: Track your performance against the global rankings or compare with your friends.\nPath to Glory: Achieve your way through titles and unlocks to reach the ultimate honor - the title of Grand Master!\nCo-operative Multiplayer: Play with your friends! Bloodsports.TV supports up to five players.\nDrop-in, Drop-out: Reconnect a left session or join a group of friends as they are playing.\nScaling Difficulty: The difficulty of the game is based on the amount of players in the session, never worry about not having enough players.\nEndless Mode: Up for a real challenge? See how far you can get in this mode of infinite carnage!\nAPOCALYMPICS: For the hardcore Gladiators out there, the peak of difficulty is contained within the legendary APOCALYMPICS. Only the best will survive this beast of a challenge.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fatshark","platforms":[{"id":0,"name":"PC"}]},{"id":13127,"name":"PRICE","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a20/a2041d8510c1f6cd11aa0e93de5a0ad5.jpg","description":"The hero Ivry wakes up from a nightmare and finds himself in a weird room. To escape from fear and darkness, he has to search and explore on his own until he discovers the truth and finds his sister Iva.\nIvry:\nGentle and sensitive;dislikes insects, dirty hands and blood; has a great talent for music; popular young musician.\nIva:\nSparky and outgoing, sometimes mischievous; often said to be a tomboy. Turned calm, quiet and more ladylike after going through the family's misfortune, but is still as straightforward and resolute as before. Good at drawing.\nStoryboard performance: In the game, standing pictures and dialog boxes don’t have fixed positions. The performance takes on the storyboard widely used in comics, in which a large amount of pictures form a rich visual performance.\nClue Integration: To avoid boredness brought by long monologues, apart from making regular uses of items to solve puzzles, players also need to search through the map to find clues and then integrate them into new clues, so as to push forward the plot.\nOriginal BGM: The only BGM in this game was composed by independent musician TetraCalyx, which consists of five voice parts, namely P, R, I, C and E. They will be unlocked one by one in the new game+ by solving puzzles.\nAn updated decoder is recommended for a better experience, since there're 11 video performances to cover the whole story.\n【translator】\n三月疯兔子\n【German translator】\nStealth （Thank you very much for this player =3=）","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"YETU GAME","platforms":[{"id":0,"name":"PC"}]},{"id":11251,"name":"Istrolid","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b24/b24cc198e5d04d5fa5fc3035a45a07a8.jpg","description":"In Istrolid you design your own unique spaceships from a large number of parts to fit your strategy and play style. With no set units or factions you are free to create a fleet where each ship has its own balanced strengths and weaknesses, from basic fighters and bombers to hulking battleships and speedy destroyers.\nChallenge your strategies and stretch your creativity, perfecting your spaceships' designs before taking them onto the proving grounds of battle. Jump straight into tense fights for territorial control where you maneuver your ships to best use their energy, ranges, firing arcs, turn rates and firepower.\nConquer an entire galaxy in the single player campaign, where you collect the parts you need to build bigger and meaner ships. Use them to defeat increasingly tougher and more complex opponents. Test the strength of your designs in multiplayer combat, fighting solo or with allies. Face custom AIs with their own fleet lineups or even design your own AI that fights by your side.\nAre you ready?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"treeform","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3586,"name":"Fairy Fencer F","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d6/6d6caeae16f880aefbfc74cdb60c6a76.jpg","description":"Long ago, the Vile God and the Goddess waged war with each other. Equally matched, they were sealed away in another world…\nNow a lazy young man named Fang somehow finds himself a key part of this war he’d really rather not deal with, but fate beckons in this uncommon RPG!\nKey Features\nMore Flash & Flair! The world of Fencers and fairies gets updated with a 1080p graphic overhaul! Fairizing never looked so good.\nReally Reluctant Hero With a hero more interested in his next meal and a fairy partner who will have none of it, this saving-the-world narrative is injected with oodles of madcap humor!\nHigh Tension! Increase the Tension gauge in battle by dealing and receiving damage. The higher it is, the more damage you’ll dish. Once it’s high enough, you’ll be able to Fairize – combining with your fairy to create a super-powerful form!\nFairy’s Fate Find fairies to join you in your quest – only they can grant you special abilities, and by leveling them up you’ll also increase your effect radius in…\nWorld-Shaping! Pull Furies from the Goddess and Vile God and place your fairies in them. You can then stab those Furies into the world map for new effects in nearby dungeons like EXP boosts or enemy changes - be careful though, because not all effects are good!\nThe following DLC packs are included with download of the main game:\nFairy Fencer F: Beginner's Pack, which includes the following packs: Beginner's Synthesis Kit, Emergency Pack, and Assortment of Rare Materials.\nFairy Fencer F: Secrets of Shukesoo's Tower Pack, which includes Secrets of Shukesoo's Tower 1, 2, 3, 4, 5, 6, 7, and 8.*\n*Upon activation, this DLC cannot be disabled. Disabling may cause the program to be unstable and possibly result in a forced shutdown of the game. Before activating, please ensure that you wish to keep the content throughout the remainder of the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"NIS America","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":2088,"name":"Card City Nights","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40f/40fee8fed4bc26960004731a549578eb.jpeg","description":"Card City Nights is an adventure through a city filled with card-nuts and lunatics. Battle for the 8 legendary cards to enter the biggest competition this city has seen yet.\nCCN is not a traditional card-trading game. It's an adventure game with zany characters to meet and weird locations to explore. In the center is our new card battle system that breaks away from the fantasy TCG mold with connecting cards to form combos.\n* 8+ hours of gameplay in a singleplayer adventure\n* Connect cards to form combos\n* 180 unique cards with characters from the Ludosity universe\n* No IAP's in this game! You collect booster packs by simply playing the adventure from start to finish\n* An amazing soundtrack in a blend of Jazz and Hiphop","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ludosity","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]}]