[{"id":19218,"name":"Rabiez: Epidemic","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94a/94a2293bc6d1e573d5b68de2ac3ab3d4.jpg","description":"'Rabiez-Epidemic' is a realtime tactical game in zombie apocalypse setting, where the couple of survivors have to fight against hordes of the infected.\nBrought to you by the developer of 'AI: Rampage' - the well-received robot apocalypse survival game!\nGuide your band of survivors as they attempt to escape the epicentre of the infection!\nSafe places are hard to come by; danger is everywhere! Do you choose to merely survive, or attempt to stop the epidemic in this territory?Main Features Original combination of tactical elements and Arcade gameplay\nRealistic survivor AI\nWide range of level types and settings\nBuilt on the custom, acclaimed engine that powers AI: Rampage!\nSteam Achievements & Steam Cloud","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sekerin Productions","platforms":[{"id":0,"name":"PC"}]},{"id":19041,"name":"Mind Spheres","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/658/6587dbd154405aaa9fcba2e30e47a4b4.jpg","description":"Inspired by two not so different worlds, Mind Spheres brings you an exclusive and awesome experience. A physics puzzle with minigolf + pinball unique mashup. Figure out puzzles in order to proceed to the next level.\nInteractive objects and physics simulations;\n50 different maps, difficulty increases every level;\nSmooth piano music, relaxing sound design and visuals.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Microblast Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17198,"name":"Storm Of Spears RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/7138398d70970b032de22dbc247c925f.jpg","description":"The once peaceful world of Galager has become enslaved under the rule of the cruel and unjust Queen. Lead by their leader Sura, a band of mercenaries are the only hope left to save the world. After the death of her brother, Sura became an active part in the rebellion in order to get revenge for her brother's death. As the leader of the rebellion, she's tasked with building an army of anyone willing to risk their life for the good of the kingdom, even prisoners and those whom have never held a weapon.\nThe world of Galager is large with lots of quests and side quests that can leave any adventurer with over 10+ hours of game play.\nCan you unify the people and build an army that can defeat the Evil Queen?\nCan you avenge the death of Sura's brother?\nOnly conquest and victory will decide who will be the savior in the Storm of Spears.\nFeatures:\n- Extensive Quest Tracking System\n- 10+ hours of quests\n- 3+ hrs of optional side quests\n- Huge world to explore","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Warfare Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10116,"name":"Summoner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5c6/5c646883470b27cf245ad5f947bab54f.jpg","description":"Summoners have toppled empires and challenged gods. They are venerated as saviours and feared as destroyers. With rings crafted by the ancient Khosani, the gifted can call forth demons, dragons, and elementals, but only the strongest can control the forces they unleash.The Story:Born with the mark of the Summoner, Joseph possesses a power greater than emperors and gods. As a child, he summoned a demon to save his village, and watched in horror as those he loved were destroyed. Nine years later, the armies of Orenia invade, and Joseph must confront the prophecy he was born to fulfill.Key Features:Traverse a beautiful, completely original world spanning two continents.\nUp to 16 different creatures to summon and control in combat, such as minotaurs, golems, dragons, and original fantastical creatures.\nCast spectacular spells. Wield an arsenal of weapons. Clad yourself in the armour of a warrior.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Volition","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"}]},{"id":736427,"name":"Lust from Beyond: M Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a45/a45a2608a5490849547ed5a8c1465987.jpg","description":"Lust from Beyond: M Edition is a new version of the cult survival horror Lust from Beyond. This edition is tailored to the preferences of players who love the genre of Lovecraftian horror for its mystery, narrative, and atmosphere rather than explicit content.\nWe invite you to another world. A world fueled by desire, fascination, and fear. A world inspired by the disturbing works of H.P. Lovecraft, H.R. Giger, and Zdzislaw Beksinski.\nYou are Victor Holloway, an antiquarian tormented by visions of a sinister land, where there's no difference between pain and pleasure. To unravel the true meaning of your dreams, you join the esoteric Cult of Ecstasy.\nTaste the cultist's life from within. Get lost in its blasphemous customs. Find out what happens when the pleasures of this world stop being enough.\nDiscover the gates to Lusst'ghaa, the mythical Land of Ecstasy, beyond the borders of reality or comprehension. Face what lurks there. Fight, hide, solve puzzles, find your answers… and survive.A New Take on the Fan-Favourite Horror\nNew, more accessible version of the fan-favorite Lovecraftian horror\nFocused on the beloved story and gameplay, with less shocking content\nStory told from a cult member’s perspective\nRun, hide, sneak or fight using survival horror mechanics\nSetting and style inspired by the works of Lovecraft, Giger, and Beksiński\nMeaningful choices and elements of RPG-like progression\nMind-bending puzzles to test your wits\nSound recorded on-location in derelict period buildings\nChanges in the M Edition\nThe original Lust from Beyond is an Adult Only experience. The M Edition is the same game tastefully tailored for a wider audience. M stands for the new Mature rating, but also for the many motifs of the Lust universe. The omnipresent Mystery, the iconic Masks, and overwhelming Madness.\nThe M Edition contains the following changes from the Adult Only edition:\nNudity has been covered by outfits appropriate to the themes and setting.\nSome scenes have been rearranged to keep their meaning but reduce the explicit factor.\nSome animations, scene framing and models have been changed to meet the Mature rating requirements.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Movie Games Lunarium","platforms":[{"id":0,"name":"PC"}]},{"id":366852,"name":"The Touryst","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef9/ef932227105f9a8fa3f8848050b76230.jpg","description":"You are just arriving at the Monument Islands. Want to go swimming? Or rather take a dive into the deep sea? Or do you want to visit the amusement arcade, do some shopping, dance at the beach party? Fancy some surfing? Or will you talk with the strange old tourist and listen what he has to say about these ancient mysterious monuments..","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Shin'en Multimedia","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":327244,"name":"Trials of Mana Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c94/c94a425492edbb2d22867bd6150bdbc2.jpg","description":"A full 3D remake of Seiken Densetsu 3, now known as \"Trials of Mana\".","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Square Enix","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"}]},{"id":286485,"name":"SteamWorld Quest: Hand of Gilgamech","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/697/697a3eb39ddc26bdaa3e0447c0855f2b.jpg","description":"SteamWorld Quest is the roleplaying card game you’ve been waiting for! Lead a party of aspiring heroes through a beautifully hand-drawn world and intense battles using only your wits and a handful of cards. Take on whatever threat comes your way by crafting your own deck choosing from over 100 unique punch-cards!\n\nWhat awaits you is a luscious treasure chest filled with gold, dragons, vivid worlds, magic, knights in shining armor as well as XP, turn-based battles and all that good RPG stuff! The game’s humorous mix of traditional fantasy and steampunk robots makes for an unforgettable experience with lots of laughs.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Image & Form","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":261316,"name":"MLB The Show 19","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e66/e6683904582e35ad06b7431c86475300.jpg","description":"Game contains In-Game Purchases.\n1 player\nNetwork Players 2-8\n53GB minimum save size\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nOnline multiplayer requires a PlayStation Plus membership.\nOnline features may be terminated at any time.\n©2019 Sony Interactive Entertainment LLC.\nMajor League Baseball and Minor League Baseball trademarks and copyrights are used with permission of Major League Baseball Properties, Inc. and MLB Advanced Media, L.P., as applicable. All rights reserved. Visit MLB.com, the Official Site of Major League Baseball and MiLB.com, the Official Site of Minor League Baseball. The Baseball Hall of Fame and Museum trademarks and copyrights are used with permission of the National Baseball Hall of Fame and Museum, Inc., as applicable. Visit the official website of the Hall of Fame at BaseballHall.org. Officially Licensed Product of Major League Baseball Players Association-MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA’s written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web. Official Licensee-Major League Baseball Alumni Marketing, Inc. © MLAM. All trademarks are the property of their respective owners. Appearance in this game does not imply sponsorship or endorsement.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":44725,"name":"When Ski Lifts Go Wrong","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83b/83b2c4cf04c84b0c23c6e450b17f33c0.jpg","description":"Design and build ski lifts, jumps and bridges in this physics based puzzle game.\nCarried Away flips the classic bridge building genre upside down to create entirely new challenges! Watch with amusement as the fearless passengers put your creations to the test.\n\nConstruct ski lifts, jumps and bridges from a range of building materials to help your passengers navigate the peaks and dips of the treacherous mountain landscape. Tight budgets, cutting corners and poor design will compromise the safety and comfort of your passengers.\nTravel the world's mountains; start in the rolling foothills and journey up to the jagged and exposed peaks. Puzzle over carefully designed scenarios to help skiers, snowboarders and mountain goers reach their destination in all seasons. Build increasingly impressive structures as you progress through the campaign, but keep an eye on your budget!\nCreate your own puzzles in the easy-to-use level builder where only your imagination is the limit. Customise the mountains with the procedural generation tool and bring it to life with your choice of scenery and settings.\nShare your proudest and most audacious replays with the community in our online gallery. Challenge your friends with your epic creations, or try out the best designs and hardest puzzles that the community has to offer.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hugecalf Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":23754,"name":"Kung Fu Panda: Showdown of Legendary Legends","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/052/0522f89c19e05aecf2e91de8d808c9e1.jpg","description":"It is an age of Kung Fu heroes, warriors, and best of all, LEGENDARY \r\n      LEGENDS! Face-off alongside or against Po, Tigress, Monkey, Tai Lung, \r\n      Master Shifu, and all of your favorite Kung Fu Panda characters in the \r\n      Showdown of Legendary Legends. Up to four players clash in iconic \r\n      locations throughout the Valley of Peace and beyond. Compete in an epic \r\n      Tournament where all Kung Fu warriors contend for honor and glory. Who \r\n      will reign on top as the mightiest warrior in the land?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vicious Cycle Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":17167,"name":"Project CARS - Pagani Edition","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a0/9a0b2e3e5709466cf1ab1098fde2bcda.jpg","description":"Project CARS - Pagani Edition\nWelcome to this special free edition of Project CARS, featuring a select group of Pagani vehicles and three locations to drive them at.\n'Project CARS – Pagani Edition' Features the Pagani Huayra, Huayra BC, Zonda Cinque, Zonda R, and Zonda Revolucion, and three intricately modeled tracks — the Nürburgring and Nordschleife combo, Monza GP, and Azure Coast — along with two game modes, and full VR support on both Oculus Rift and HTC Vive, as well as support for 4K screens and traditional displays.\nThis free, PC-only game has been built around the market-leading Project CARS simulation, and is the result of a unique collaboration with legendary Italian car-maker Pagani Automobili.\nDesigned to showcase both the very best examples of Pagani’s eponymous supercars along with the world-class technology that underpins the best-selling Project CARS simulation, 'Project CARS – Pagani Edition' is an invitation to encounter the digital integration of high-octane hypercars with cutting-edge racing-game technology.\nVehicles\nHuayra\nHuayra BC\nZonda Cinque\nZonda R\nZonda Revolucion\nTracks\nNurburgring+Nords combo\nMonza GP\nAzure Coast\nGame modes\nQuick Race Weekend\nTime Trial\nThe full version of Project CARS is available here: http://store.steampowered.com/app/234630.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Slightly Mad Studios","platforms":[{"id":0,"name":"PC"}]},{"id":14068,"name":"Crowntakers","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc4/cc4599e4cbf5d1f062609eed06a20649.jpg","description":"In an ever-changing world, heroes are the only constants.\nDark times are imminent: the king’s abduction throws a once peaceful land into turmoil. Being the chosen one elected by the king himself through one of your dreams, you embark on an adventurous journey to free him from the hands of the evil duke and go down in history as the kingdom’s greatest hero. But time is of the essence…\nCrowntakers combines turn-based strategy with RPG elements and takes you at the behest of the crown into a medieval fantasy world full of challenging encounters and epic adventures. With its randomly generated world, Crowntakers offers a varied gaming experience every time you set out to fight evil. As a hero on a mission, you’ll have to assemble a group of brave mercenaries to take on cruel enemies like barbarians, ferocious animals or deceitful thieves. Embark on challenging quests, gather vital resources and finally banish evil from the world.FeaturesRoguelike turn-based strategy meets RPG in a beautifully created fantasy world\nOn every game start the world is rebuilt with different environments and encounters; encouraging players to try different strategies\nMore than 4 diverse and procedural environments ranging from mountain passes to shadowy castles\nHire 9 individual mercenaries to take on bandits, wildlife and malevolent knights on a hexagonal battlefield. Utilise the unique class skills of the archer, wizard, scout and others\nGather resources, level-up your companions, collect mighty equipment and consume helpful potions to survive until your quest is complete\nAlternative endings: will you save the king before the time runs out?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kalypso Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13875,"name":"Eastside Hockey Manager","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a7b/a7b3ec6e62e970a42fe99f0e3016203f.jpg","description":"Just UpdatedEastside Lights The Lamp with First Official Data Pack\nSports Interactive has teamed up with the UK's Elite Ice Hockey League (EIHL) to bring official packs for data, logos and faces to Eastside Hockey Manager, all of which are now available on Steam Workshop. Fans of Elite League teams can now take control like never before with an authentic EIHL feel.\nAbout the GameEastside Hockey Manager (EHM) has emerged from Steam's Early Access programme and is now available for full release.\nEHM offers fans the most realistic, in-depth and immersive simulation of hockey management available, giving them the chance to manage either club or country in any of the world’s top hockey-playing nations.\nEHM allows you to take full control of your roster – you decide who to sign, who to trade and who to draft. You assemble the perfect coaching team and then, with everything in place, you can choose to either employ a head coach to guide your team from behind the bench, or take control of the coaching duties yourself. Whichever you choose, you can follow the action ‘live’ or watch the game highlights afterwards through the realistic ‘top down’ 2D game engine.\nTo mark its move from Early Access to full availability, EHM now offers a number of new and updated features, including: a greater number of playable domestic leagues and cup competitions; Steam Workshop integration; additional screen resolutions and a multiplayer option which allows up to 30 players to compete against one another and many more improvements inspired by user feedback.Eastside Hockey Manager – Key Features\nDynamic 2D Game Engine\nFollow the action in either your own games or those of your rivals through the advanced ‘top-down’, 2D game engine, which incorporates state-of-the-art physics modelling (including realistic deflections and shot-blocking) and convincing player AI. There’s even a zoom mode for those who want to get closer to the action.\nRealistic Contemporary Game World\nA detailed game world where players can manage and coach in more than 30 playable domestic leagues and cup competitions from across the globe, each of which features up-to-date rules and league structures.\nMultiplayer Action\nUp to 30 players can compete head to head in in the same online game world.\nSteam Workshop Integration\nEHM includes support for the inclusion of user-generated content (such as custom databases and graphics) through the easy-to-use Steam Workshop system.\nComplete Roster Management\nFull control over the building and management of your roster, including everything from offering contracts to scouting, drafting promising players and trading with other teams.\nComplete Personnel Management\nFull control over non-playing personnel, including the ability to sign coaches, scouts and physios.\nTotal Tactical Control\nCoaches can get the best out of their roster by creating and managing detailed tactics that can be configured to an entire team, an individual unit or even a single player.\nLifelike Trade Negotiations\nManagers can gauge interest to trade proposals from their opposite numbers as well as getting feedback from their own assistant. Each team has their own needs and some are ready to offload prospects for that key veteran that makes them a true contender whilst others might be looking to move high-earning veterans in order to rebuild through the draft.\nIntuitive User Interface\nThe centralised navigation bar makes management easier and more intuitive with all key management controls incorporated into the main menu bar.\nImproved Player Progression\nPlayers develop and age naturally, with new players coming through the junior systems and older players eventually retiring or moving on into non-playing careers. Furthermore, the role-based attribute modelling makes players more realistic and more varied.\nInternational Management\nEHM includes the opportunity to manage international teams (including U20s) in all of the key tournaments – and many less high-profile competitions too.\nDatabase Import\nThe database format allows the importing of user-generated up-to-date rosters and even historical starting databases (created for earlier versions of EHM).\nAnd Much, Much More…\n…including detailed financial modelling of player contracts, salary caps and player budgets; a nation overview screen which allows you to view all of the top leagues, clubs and players for each country; player/non-player profiles; an option to start the game with a fantasy draft; all-star games with skills competitions and many, many other features.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":12869,"name":"Lost Moon","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ffd/ffde1672f6f0e10410432574c9803f2d.jpg","description":"This is a platform game that challenges you with puzzles, upgrades and action.\nFeatures\nhard Puzzles\nfree Exploration\nweapons\nskills\nsecretsIntro historyCommander Trevor is lost on a strange moon that formed in a mysterious way, surrounded by hostile creatures, trying to unveil the secrets of ancient technology. He fights to stay alive, and one day return home.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Eplixe","platforms":[{"id":0,"name":"PC"}]},{"id":11342,"name":"Prime World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc4/fc4ca870701836ac1034e0b0501593fa.jpg","description":"Prime World is a free online game in RPG / MOBA genre with a unique universe where tactical session battles, castle management, and hero development are mixed together.\nPrime World brings the MOBA genre to a new level:\nplay in different modes;\nimprove your heroes not only on the battlefield but also in your own castle;\ngather and create lethal combinations of skills;\nuse these combinations in battles to defeat your enemies.\nAn incredible amount of talents and skins allows you to build up a one of a kind character depending on your preferences!\nThe game is based on the conflict of lords, who fight in the endless battle for control over prime - the most important resource, the possession of which can change the alignment of forces. Prime is magic and a source of technology, a dangerous alien substance, which can change the world and give power over it - everyone needs it. The one who controls the prime, controls the whole world!\nGather a collection of exclusive talents and create an army of invincible heroes. Attack the enemy towers and conquer new territories. Conclude profitable alliances with other clans or subordinate them in battle. Become the first in the world of Praya!\nEvery hero in the world of Praya can become one of a kind with the help of the talent system.\nPrime World features an exclusive terramorphing system, which allows you to capture lands by raising your faction’s flag over it. Native terrain beneath hero’s feet makes him more powerful.\nThere are few combat modes in the game, which are a bit different from each other. Check the schedule of the modes being online in the special thread in our Community Hub!\nEvery hero has multiple individual skins, which are made limited timed to different special occasions. Choose a suitable look for your hero, it’s up to you, how it will look like! What is more, skins provide suitable voice-overs and can even change the hero’s gender.\nPrime World combines tactical fights with strategic elements. You can become a powerful commander and a magnificent ruler of your castle at the same time!\nThe game is based on the conflict of lords leading constant battles for prime with the help of their Heroes - warriors with unique abilities who can return to battle after being defeated again and again.\nPrime World offers its players a rich social system: players can join clans and develop them together, capture clans of other players.\nThere are numerous ways to upgrade your character in battle sessions, from farming creeps to playing mini-games on the base. This makes PvP part of the game even more diverse.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":5675,"name":"The Beatles: Rock Band","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/633/6336fa12fffe38dde84b880763390f4d.jpg","description":"Experience The Beatles™ music and legacy like never before, utilizing the core Rock Band™ game play. Follow the legendary career of The Beatles™ from Liverpool to Shea Stadium to Abbey Road.  Play drums, lead guitar, and bass guitar and sing three-part harmony with up to three microphones.  Feel what it’s like to perform The Beatles’ classic songs, on stage and in the studio.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":801623,"name":"Cocoon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/153/153e8d78ac19e959214dadefb8c27310.jpg","description":"From Jeppe Carlsen, the lead gameplay designer of LIMBO and INSIDE — COCOON takes you on an adventure across worlds within worlds. Master world-leaping mechanics to unravel a cosmic mystery.\n\nWorlds within Worlds\nCOCOON is a unique take on the puzzle adventure genre, where each world exists within an orb that you can carry on your back. Wrap your head around the core mechanic of leaping between worlds—and combine, manipulate, and rearrange them to solve intricate puzzles\n\nAlien Machinery\nInteract with alien environments and biomechanical devices left behind by an ancient civilization. Journey through unique and diverse biomes, from industrial structures to massive organic caverns, and discover how they are connected to one another.\n\nOrb Abilities\nEach orb has an ability that can be unlocked, thereby turning the orb into a unique tool for you to utilize within other worlds. Use these abilities to uncover hidden pathways and objects, fire projectiles to trigger switches, and more.\n\nMonstrous Guardians\nMighty guardians protect every world, and you must face them in fierce battles. Each fight is unique and requires you to master new and satisfying mechanics.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Geometric Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":484912,"name":"Record of Lodoss War: Deedlit in Wonder Labyrinth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5a7/5a74c02d95b963ca2a9a8e40e53a2721.jpg","description":"Record of Lodoss War: Deedlit in Wonder Labyrinth is a 2D action adventure game.■StoryDeedlit awakens suddenly in a mysterious, unknown place.\nWhere am I? Why am I here?\nWith nobody around to respond, her questions are met with only silence.\nSeeking answers, Deed eventually sets off on foot, alone...■Game FeaturesSword and Arrow Attacks\nUse your sword for powerful melee attacks against enemies within range, or employ projectile attacks using your bow and arrows against those farther away.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Team Ladybug","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":368145,"name":"Our Life: Beginnings & Always","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b06/b064062d63b7c8d28d5085273a58fc7d.jpg","description":"Our Life is a nostalgic Visual Novel where you create your own character and grow from childhood to adulthood with the lonely boy next door. It's currently in development by GB Patch Games.\n-A slice-of-life story with comedy, romance, drama, and many wonderful memories to make\n-4 different periods of life to experience; childhood, adolescence, teenaged, and adulthood\n-Name, appearance, personality, and pronoun customization for your character\n-The option to change your character's details however you like as you grow, including transitioning to new pronouns\n-A choice-heavy Visual Novel with frequent opportunities to shape your personality and preferences\n-1  main love interest, Cove Holden, whose personality, interests, and  appearance will develop in a custom way over the years  based on his  experiences with you\n-Decide for yourself how quickly or slowly  the relationship develops between you and Cove by setting a unique dynamic that can change over time\n-6-8 hours of content that's free for everyone, plus optional paid DLCs that can increase playtime\n-Partial voice acting for every character, excluding the MC\n-Light animation effects. The sun shines, characters blink, and more (animations can also be turned off)\nJamie Last (name can be changed) has spent the last couple weeks on a summertime high. At eight-years-old nothing is better than what feels like endless days of school-less adventures, especially when you live walking distance from the beach. While coming home under a scorching sunset one fine evening, Jamie is approached by a stranger. The man is looking for a kid who can do him a favor, and he’s even offering to pay for it. He wants Jamie to please be friends with his only child. The person is Mr. Holden, Jamie’s new neighbor as well as the father of the odd, and oddly named, boy Cove. Whether Jamie wants to play along or not, Cove isn’t going anywhere. He's present in Jamie's life for far longer than they ever would've guessed.\nAnd somehow the long days of vacation finally come to an end. Summer may not be able to last forever, but Jamie can take comfort in knowing it will come back again someday…","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GB Patch Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":67623,"name":"Modern Combat 5","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c4/0c49e011d57a84fe32c142fd1733db0a_Bjyaqvl.jpg","description":"Modern Combat 5 is an intense FPS that puts you in control of one of 10 unique soldier classes, each packing their own unique arsenal, skills and personality -- but they all share the same thirst for victory!\nKEY FEATURES\n> Completely customize your combat style by first choosing a class to play as, then unlock new skills as you level up, and equip advanced tactical suits and weapon attachments to fine-tune your capabilities.\n> Play the complex solo campaign or join hardcore multiplayer battles.\n> Watch other players battle in Spectator mode; perfect for picking up new tactics, or just to enjoy cheering your friends to victory.\n> Live-chat with friends and teammates in the Global and Squad Chats.\n> Level up your character by playing either the offline story mode or online PvP.\n> Watch your name rise to the top of the leaderboards, and even win exclusive rewards in limited-time events!\n> Enjoy flawless graphics, music and voice acting with seamlessly integrated cutscenes as you make your way through an intense story filled with unique challenges in which you travel the world to stop a global terrorist plot.\n> Edit the controls to perfectly fit your playstyle.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gameloft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":45486,"name":"Dead Maze","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c49/c499f75e41604c3186f2912138936621.jpg","description":"Dead Maze is a 2D isometric massively multiplayer game, set in a destroyed contemporary world, filled with zombies.\nIn order to survive, you need to work together to explore what is left of the world after the zombie apocalypse, monitor your health and food, scavenge for resources, and craft as many life-saving supplies as possible.Play with thousands of other players and help each other\nDead Maze is a massively multiplayer cooperative game, where you can only help the other players to access to a better future. Cooperate to restore civilization, improve your own camp, and unveil the dark narrative of the apocalypse.Pick anything to fight hordes together\nScavenge the world for any of the 500+ potential weapons in the game (yes, even that old teddy bear will do), and fight the hordes of infected together in a hit and run way. Don't engage bigger than you can chew!Manage your hunger, thirst and fatigue\nScavenging the world is pretty tiring. You do not deplete your jauges as time goes by, but depending on the amount of actions you choose to make in the game, allowing for better control over your health without sacrificing chatting with your fellow survivor friends.Build your own camp and furniture\nEstablish your camp and build and furnish your own home as you wish. Plant seeds and tend to your vegetable gardens or breed animals to gain access to extra food sources such as milk and eggs.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Atelier 801","platforms":[{"id":0,"name":"PC"}]},{"id":20492,"name":"Teddy Floppy Ear - The Race","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cff/cffdb95554798b1864403558b1614e3c.jpg","description":"People of Animalville got a carting fever and you must help one of them reach for the championship. Take the wheel, choose a kart, decide which character from 'Teddy Floppy Ear’ universe you want, and start the wild ride! Compete all day long on nightly and daily tracks that span around the beautiful and colorful countryside. Play in one of many modes including Time Attack and Racing Season. Use power ups to gain advantage or slow down your opponents. Improve your vehicle’s appearance by tuning.\nFeatures:\n✔ Split Screen multi-player competition\n✔ Five daily and five nightly tracks set in the different parts of Animalville\n✔ Ten kart models based on the popular cars from behind the \"iron curtain\"\n✔ Five game modes for diverse experience\n✔ Four levels of difficulty\n✔ Thirty hats to change your appearance\n✔ Collectable power-ups and attacks during the race\n✔ Tuning to improve kart appearance\n✔ Vehicles such as a unique Syrena Sport or… a Tractor\n✔ Hours of entertainment included\n✔ Over a dozen of achievements\nGame modes\nSINGLE RACE: You just want to have a quickie? Choose a track, kart and a character, to instantly start the racing joy.\nTIME ATTACK: In mood for a bigger challenge? Race against time or yourself in this classic mode.\nCOLLECTOR'S SLALOM: It's the best place to learn the tracks. The stars are placed on the optimum path so you can learn the curves and shortcuts. Finish the race before the time ends and collect as many stars lying on your way as you can.\nRACING SEASON: Take part in a rally season. Compete on yet unlocked tracks and win a place on the podium to advance to higher and more difficult league.\nFLOPPY CUP: Fight for a cup in a playoff 1 – on – 1 races. Defeat all your opponents to advance.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Forever Entertainment S. A.","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19163,"name":"Shadow Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9c7/9c784a59766bec3f5eb034d8d25ce518.jpg","description":"He is coming, stalking criminals in the spirit world and the real world. A possessed man is coming, a voodoo mask in his chest and lines of power in his back. Shadow Man is coming, trailing evil from Liveside to Deadside. To stop an apocalypse. To save your soul.\nStalk criminals across two worlds: Explore crime scenes in the Louisiana, Swamplands, a New York tenement, a Texas prison, the asylum and many other locales.\nSend Evil back to darkness: Go in armed with high-caliber guns or soul-destroying voodoo powers.\nUnravel the Mysteries of Deadside: Gather sinister voodoo artifacts in order to solve puzzles.\nLive the Nightmare: Over 40 immersive cut-scenes and hours of in-game speech.\nBonus Content Included: *NEW* Free Comic Book Offer, Soundtracks, Map and a 162-page Strategy Guide included with the game (Check your SteamApps/common/ShadowMan/ folder after downloading the game)","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Acclaim Studios Teesside","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Nintendo 64"}]},{"id":16747,"name":"Demigod","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d22/d222b8ed36da38e06746c11fa4e06e6a.jpg","description":"The all father has vanished, creating an opening in the pantheon. To fill the void, Demigods from across from the mortal world must wage war against one another in a bid to ascend to true godhood.\nSet in a magical world where gods walk among mortals, Demigod blends action, strategy and role-playing elements into a thrilling new experience. Select the Demigod that will lead your minions into battle and unleash the dogs of war against your rivals. Your Demigod will do whatever it takes in order to ascend to true godhood.\nOnce in the Arena, each Demigod will be joined by support troops that fight to the death as you struggle to seize key control points and slowly turn the tide of war in your favor. And your Demigod will level up during the course of each battle, becoming even more powerful as you unlock new abilities and powers. It's a brutal conflict of Demigod versus Demigod, where the very ground beneath their feet will tremble and quake.\nDemigod is a real-time, tactical strategy game that includes extensive role-playing elements. Choose from several Demigods, each poised for battle with their own unique capabilities and awe-inspiring powers. Vanquish other would-be gods as you gain levels, increase in power, unlock the power of mystic artifacts and slowly battle your way closer to joining the Pantheon.\nKey features:\t\t\t\t\t\tRevolutionary strategy/action game that combines tactical prowess with role-playing depth.\nYour Demigod is the focus of your power in the arena. Each of the 8 included Demigods has unique powers and abilities.\nLike a role-playing game, players can purchase equipment for their Demigod, add new powers to their Demigod as it gains experience, acquire artifacts that remain persistent between games. Each Demigod plays differently enough that it provides a diverse gaming experience.\nLike a strategy game, players have strategic objectives in each arena that, when captured, provide resources that give access to better units and some Demigods have the ability to summon their own minions that they can individually control. There are gold mines that can be captured to give more resources, artifact shops that, if captured, make their resources available to your team.\nBattle in a persistent online world in multiplayer or play single player either in a skirmish or in the virtual tournament.\nThe on-line pantheon allows players to \"skirmish\" against other players of similar skill or take part in the on-line Pantheon tournament where players choose the path of light or darkness and earn favor points to help their faction win the tournament. Players can also play on the LAN or play custom games with friends on the Internet.\nPlayers earn favor points through victory with different awards given for different achievements during the game. These favor points can be used to purchase special items that exist from game to game.\nIncrease your Demigod's powers and abilities by leveling up during each battle.\nIn each game, your Demigod will start at level 1. As you kill enemy grunts and Demigods and capture flags, you gain experience which will cause your Demigod to gain experience levels. When a new experience level is gained, the player can add new skills and abilities to their Demigod to make him or her more powerful.\nWage massive, earth-shattering battles across a series of awe-inspiring Arenas.\nDemigod makes use of the same awesome technology as Supreme Commander. However, it has been greatly enhanced with Gas Powered Games' new \"mesh\" technology that allows the game to have incredible visuals even on older video cards. The arenas in Demigod are not your typical \"maps\". Instead, they have each been crafted as a full blown 3D model unto itself in which players battle on the surface of them.\n[/list[b]Seize key, strategic positions on the map and turn the tide against your enemy. Push deep into their base and destroy them once and for all.[/b]\nKey resources in an arena are controlled by capturing the flag associated to that resource. When a player controls that resource, the entire team benefits. Controlling flags also generates war points which are added to your team's war score. When enough war points are collected, new upgrades in the team's Citadel become available for purchase.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"PC"}]},{"id":15896,"name":"Replica","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f9f/f9fd255f048e899da8486ee9bb846978.jpg","description":"\"This country needs more than a building right now. It needs hope.\" - Evey Hammond\nReplica is an interactive novel game played through a cellphone and social media.\nYou are given a cellphone of an unknown owner. You must look for evidence of terrorism by hacking into the cellphone owner's account, under governmental coercion. Then inspecting the cellphone usage history and social media activity records.\nThe insane experience of peeping into someone's private life through a cellphone will transform you into the state's greatest patriot.Features\n12 Multiple Endings\n8 Achievements","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Somi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":14560,"name":"Trapped Dead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/06a/06a61034d525d9806d7f4d006008a46c.jpg","description":"Trapped Dead is a tactical real time strategy game in the tradition of classics such as \"Commandos\" and \"Desperados\". You and your friends control your characters in a 3rd person isometric view through a mature Zombie survival scenario inspired by the successful horror films of the early '80s. A co-op mode for up to 4 players is included as well.\nThe story takes place in the early 80s in a small town names Hedge Hill near Kansas City, Missouri. The sowing of a new genetically modified type of corn caused the existence of a new virus which mutated through the natural food chain. A dog bite of an infected animal caused a local outbreak of the virus which rapidly infected the inhabitants of the idyllic provincial town. Mike and Gerald, two college boys, are thrown into the middle of a terrifying horror scenario. Having pulled over to a gas station near Hedge Hill during what was meant to be an enjoyable road trip, they are unaware of the virus which has already reached the gas station and its staff…\nKey Features:\t\t\t\t\t\tTerrifying, cinematic game atmosphere\nTactical gameplay with numerous shock and surprise elements\nHighly detailed locations such as mall, jail, scrap yard & many more\n6 playable different characters\nThrilling online and offline multiplayer co-op mode\nInteractive and dynamic game environment including various traps\nManifold weapons, gadgets and other items\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Headup Games","platforms":[{"id":0,"name":"PC"}]},{"id":12668,"name":"Hyperdimension Neptunia Re ; Birth3 V Generation","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48b/48be2aa27c914731a43792583a6ecc97.jpg","description":"神次次元ゲイム ネプテューヌRe;Birth3 V CENTURY\n+1 to Combos! Customize attack combinations with up to five moves, opening up a whole new array of ways to defeat your enemies!\nNew Story! Play through new story and scenarios when someone else joins the Console War fray and refuses to play by the rules!\nBring a Dungeon Buddy! The realtime mini-game Stella’s Dungeon is back, and this time she can bring friends! Each is equipped with special skills that lend their support to Stella in her items quest, so choose wisely!\nRemake in your Image! Modify the world of Gamindustri to your liking by creating “Plans” that alter dungeon treasures, enemy difficulty, and more!\nGet Crafty! Customize powerful equipment that can unlock the true power of the CPUs, opening up a world of new skills for them to use!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Idea Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":11448,"name":"Eon Altar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0c/e0cfdeeca24662069e7684a8b0f9ecb6.jpg","description":"Mobile EnhancedEon Altar requires each player to download the free Controller App to play, available on the App Store and Google Play.\nLocal Wifi is required to connect the Controller Apps to the Eon Altar core game. Internet Access is not required.\niOS: iPhone 4s or later, iPad Mini, iPad 2 or later. Requires iOS8 or later.\nAndroid: 512mb of RAM and Jellybean 4.1 or later.\nEpisodicPurchase the Season Pass to unlock Episode One, Episode Two and Episode 3 (available now).\nFor those who've yet to try Eon Altar, we now allow folks play the Prelude for free! Check out the demo link on the side of the store page to grab the game and try it right now!\nChapter 1 - The Portal Obsinate\nChapter 2 - The Wolf of Yriel\nCombat Arena - The Hall of Penitence\nChapter 1 - Together We Fall\nChapter 2 - The Safehold\nCombat Arena - The Cultist Rising\nChapter 1 - The Paths of Madness\nChapter 2 - Hall of the Builders\nAbout the GameA Mobile-Enhanced Local Co-op RPG for 1-4 Players\nExplore the lavish dungeons and tunnels that stretch below Tarnum Fortress and conquer dozens of unique quests and challenges. Prove your worth on a tactical battlefield, and overpower your foes with strategy, magic and martial prowess. The Eon Altar’s defenders are many and they are deadly.\nChoose to cooperate with your allies or deceive them. Engage them in player to player dialogue to expose the truth in myths and legends, and guide your hero to their ultimate destiny or defeat.Your smartphone is your characterReceive personalized secret thoughts from your character direct to your smartphone\nChoose whether to share personal information with your friends or use it against them\nUpgrade and manage your character without interrupting other players\nControl the action from your smartphone with context sensitive informationCouch co-op role-playing gameConnect your mobile devices to a central platform to coordinate tactics and movement\nPlay together with up to three friends, or play by yourself in solo mode\nWork with your friends, or betray them as you race to fulfill your destiny\nDefeat legendary enemies in exciting tactical turn-based combatAn epic story of friendship and betrayalExperience an epic quest in nine episodic installments filled with action and surprise\nExplore a deep, compelling, and original sword-and-sorcery fantasy world\nInteract with enemies, allies, and your friends by acting out your character's lines\nMake impactful choices and forge your own destinyFully-realized, immersive gameplay experienceGorgeous art and atmospheric environments\nIntricate, ancient, and original fantasy setting\nNPCs are fully voice acted, but you voice your own character\nEpic soundtrack by composer Tom Salta, known for his work on the Halo series\nAn ancient, malevolent presence stirs within the depths of the Eon Altar, and only a small band of heroes can stop it from consuming the world. What mysterious force brought you here together? Are you strong enough to stand up to your gods?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Flying Helmet Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":4435,"name":"MotorStorm RC","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/825/82575be8cc9ea947a10dbdfd45c3b4d8.jpg","description":"Let go of the steering wheel, grab a remote control and let rip on a whole host of new tracks from classic MotorStorm® locations. Build up and customize a collection of remote control vehicles from different classes like the nippy Superminis, marauding Monster Trucks and the sleek Supercars. Take part in a series of events in the re-scaled MotorStorm® Festival and compete to win medals, break records and unlock more tracks and vehicles.\nFeatures\n• Take on your friends in four player split screen races.\n• Show off your best times via the Pitwall and challenge PS Vita and PS3™ players to beat your records.\n• Take your vehicles on a freestyle spin around the Playground; get some big air on the skate park or score goals on the sports field.\nCompatibility Notices: 1-4 Players; 710MB minimum space required; DUALSHOCK®3 Vibration Function; HDTV screen resolution: 720p, 1080i, 1080p; Network Features; 3D Support; Simulview™.\n© 2012 Sony Computer Entertainment Europe.  MotorStorm is a registered trademark of Sony Computer Entertainment Europe. Developed by Evolution Studios Ltd.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":21561,"name":"Planet Alcatraz","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71a/71a4bd1f21a4d8bcb8c9947436b6dfba.jpg","description":"Planet Alcatraz is a 3D role playing game with isometric projection. The player travels through the game world and fights against enemies in the real-time mode. In a general sense Planet Alcatraz can be portrayed as a non-linear adventure with lots of shooting. Several genres are mixed in this game but despite that fact it isn't stuck between them and appears to be a classical RPG that is based on a specially developed system.\nThe action takes place on prison planet Alcatraz. Its inhabitants are inveterate criminals that were banished there for the life term for their terrible crimes. The main objective of the game is to control a sabotage group that consists of the only one person in the beginning and enlarges through the game. The player has to use all sorts of resources and means to accomplish the mission.Key features:Absolutely unique universe\nCreation of the main character allows changing basic characteristics and appearance including facial animation based on LifeMode technology\nTense atmosphere determined by deep immersion to planet's criminal world\nComprehensive dialogue system allowing the player to choose the way of behaving and communication on his own\nMore than 100 kinds of cold steel and firearms\nMore than 200 characters involved in dialogues\nMore than 80 original monsters, including flying and poisonous\nFights and adventures with different behavioral and battle options\nOriginal sounds and music","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":11829,"name":"Husk","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e4/2e425e4b53d45d815f4ba89bbfafde75.jpg","description":"Husk is a down-to-earth survival-horror, about harm, pain and seeking forgiveness in Shivercliff, a town abandoned for unknown reasons.\nA tribute to classical thrillers like Silent Hill or Twin Peaks.\n\nIt's 1995, you’re Matthew Palmer and you’ve just woken up after a train crash. There's nobody around you. Especially, there’s no trace of your wife and daughter.\nThe only sign indicating where you are says:\nWelcome to Shivercliﬀ.\nFeatures:\nDown-to-earth storyline touching problems of violence and alcohol addiction\nImmersive narration\n90's climate with a lot of references\nInspired by titles like Silent Hill or Alan Wake\nDifferent locations of Shivercliff town and its surroundings\nDifferent types of monsters and boss fights\nClassical survival horror\nDedicated soundtrack created by Arkadiusz Reikowski\n4-5 hours of gameplay\nPowered by Unreal Engine 4","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"UndeadScout","platforms":[{"id":0,"name":"PC"}]},{"id":6240,"name":"Dungeon Hearts","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/177/177597ee68f288406e67037547aaca9f.jpeg","description":"Dungeon Hearts fuses the strategy and pattern matching of puzzle games with the kinetic pace of action games. Align magical runes as they flow along the Fatestream to attack, defend, and conjure magic in frenetic battles against a bestiary of fantastic creatures out to use those same runes against you. Chain together multiple attacks and unleash powerful combos or call upon each hero's special attacks to devastate your enemies to survive the twists and turns of Dungeon Heart's evolving gameplay. Strike down all that stand in your way and level up your brave warriors as each foe grows more powerful than the last, culminating in the final battle with The Dark One himself!\n\"Four spirits race across the land, burdened with tragedy. Within each lies the specter of guilt and fear, which The Dark One bends to his will to enact his resurrection. They realize the deception too late as the promise of salvation turns to betrayal. A black wind washes over the planes, turning all to ash. As the fallen heroes face the engulfing void, a spark of hope clings to life. When the demon peered into their hearts to learn their secrets, so too did they learn his...\"Features\nPuzzle/RPG Hybrid – Quickly align runes within the rapid match-three puzzle system to wield devastating attacks, defend against enemy offensives, and unleash multi-hero combos.The Fatestream – Plan your strategy under pressure with dozens of different runes linked to each hero and defend against powerful attacks and dreaded hexes cast by enemies against your heroes. Four Unique Heroes – Balance the individual skills of each hero and level them up to unlock and unleash a dozen different special powers for new attacks, healing magic, and time-altering spells. Limitless Adventure – Face a randomly generated battle sequence with every new adventure and battle against a bestiary of over 40 creatures and 7 bosses lurking around ten unique environments. Brimming with Secrets – Each defeated enemy reveals a sliver of the world's lore and the heroes' history. A Vibrant Soundscape – Unlock 4 bonus soundtracks, each in a different musical genre.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Devolver Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":55526,"name":"Leisure Suit Larry 5: Passionate Patti Does a Little Undercover Work","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd1b7fa3f34b2fd7b4b6a81b3903740a.jpg","description":"Leisure Suit Larry 5: Passionate Patti Does a Little Undercover Work is the fourth entry in the Leisure Suit Larry series of graphical adventure games published by Sierra On-Line. It is the first title in the series to have 256-color graphics and a fully icon-based interface. The title of the game is misleading, as there is no Leisure Suit Larry 4. It was re-released in 2017 on Steam with Windows support.","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Assemble Entertainment","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":52623,"name":"Tetris (1984)","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/637/637d7dc2f44d0f6ddd3ee2c0b1366962.jpg","description":"Tetris (Russian: Тетрис [ˈtɛtrʲɪs]) is a tile-matching puzzle video game, originally designed and programmed by Russian game designer Alexey Pajitnov. It was released on June 6, 1984, while he was working for the Dorodnitsyn Computing Centre of the Academy of Science of the Soviet Union in Moscow. He derived its name from the Greek numerical prefix tetra- (all of the game's pieces contain four segments) and tennis, Pajitnov's favorite sport.\r\nTetris was the first entertainment software to be exported from the Soviet Union to the US, where it was published by Spectrum HoloByte for Commodore 64 and IBM PC. The Tetris game is a popular use of tetrominoes, the four-element special case of polyominoes. Polyominoes have been used in popular puzzles since at least 1907, and the name was given by the mathematician Solomon W. Golomb in 1953. However, even the enumeration of pentominoes is dated to antiquity.\r\nThe game (or one of its many variants) is available for nearly every video game console and computer operating system, as well as on devices such as graphing calculators, mobile phones, portable media players, PDAs, Network music players and even as an Easter egg on non-media products like oscilloscopes. It has even inspired Tetris serving dishes and been played on the sides of various buildings.\r\nWhile versions of Tetris were sold for a range of 1980s home computer platforms as well as arcades, it was the hugely successful handheld version for the Game Boy launched in 1989 that established the game as one of the most popular ever. Electronic Gaming Monthly's 100th issue had Tetris in first place as \"Greatest Game of All Time\". In 2007, Tetris came in second place in IGN's \"100 Greatest Video Games of All Time\". In January 2010, it was announced that the Tetris franchise had sold more than 170 million copies, approximately 70 million physical copies and over 100 million copies for cell phones, making it the best selling paid-downloaded game of all time. On 14 March 2014, The Tetris Company announced a deal to bring Tetris to two of the latest hardware platforms, the Xbox One and PlayStation 4, in partnership with Ubisoft (publishing) and SoMa Play (development), to coincide with the franchise's 30th anniversary.","review":"","timePlayed":0.0,"releaseYear":1984,"developer":"Various","platforms":[{"id":0,"name":"Atari 2600"},{"id":0,"name":"Atari ST"},{"id":0,"name":"NES"},{"id":0,"name":"SNES"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Boy"}]},{"id":52037,"name":"Basingstoke","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/953/953ecce8fe9a44264f432e113148c7c2.jpg","description":"Basingstoke is a tense and brutal roguelike that mixes stealth and arcade action. Explore the smouldering ruins of apocalyptic Basingstoke, UK, a world of extreme peril where reanimated undead and ferocious alien monsters roam!\nScavenge and Craft\nLoot and craft as you explore. Lob a tasty sausage roll as a diversion, or poison a kebab for bait. Sneak up and knock a monster out with a whack from a cricket bat, or slice them up with a chainsaw. Tranquillize them with a dart fired from a homemade blowpipe, or set them alight with a DIY flamethrower. There's over a hundred useable items to loot or craft!\nNo Second Chances\nUse stealth to sneak, weapons to attack, or if all else fails, run! But be very careful - one bite and you'll be ripped apart to become a tasty snack for monsters! Violence is your last resort. Sneaking, skullduggery, and ambush are your tactics.\nWhat is Basingstoke?\nBasingstoke is a town in England, renowned for its charming mix of hand crafted and procedurally generated features. Explore, above and below ground, and enjoy its many attractions. Rob a parking ticket machine, vandalise a keep left sign, go shopping at the OMNImart24/7... or if things get a bit much, hide in a wheelie bin.\nUnlockable Characters\nAs you progress you'll unlock new characters. Start as a Tourist and capture those special moments with your selfie stick or splurge at the shops with your OmniBank GoldCard. Play as the Thief and use your Locksmith gadget to crack security panels and break safes. Each character has specialist equipment, unique crafting recipes... and hats!\nWelcome to Basingstoke!\nCOMING SOON!\nWe're currently adding Steam Achievements and Trading Cards!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Puppygames","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28218,"name":"Shadow Complex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b11/b11b0621e8a91655107ddd425819f951.jpg","description":"The next evolution in downloadable games, Shadow Complex marries the quality and depth of a full retail title, the stunning visuals of Epic Games' industry-leading Unreal Engine 3, and a classic side-scroller. Set in the world of Orson Scott Card's best-selling novel, Empire, Shadow Complex introduces a compelling universe in which you collect items and power-ups and evolve your character into a force of destruction.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Chair EntertainmentEpic Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":17522,"name":"Miasmata","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab0/ab0c46933e3306d45b6ad7cee1c1c953_Tf9EAlf.jpg","description":"Steam Greenlight\nAbout the GameMiasmata is a first-person survival/adventure game, developed from the ground-up by brothers Joe and Bob Johnson. You play as Robert Hughes, a plague-stricken scientist on a journey to discover a cure. Your adventure begins on the shores of a remote and mysterious island. Long ago, the island was inhabited by a group of indigenous people, whose extant monuments still decorate the island landscape. The island is now home to a scientific research outpost and it is your hope to reunite with your colleagues working there. Unfortunately, you'll soon discover that something has gone terribly wrong.\nDuring your adventure, you will encounter a mysterious and deadly creature. This creature can stalk you for miles, lurking behind grasses and vegetative cover. By treading carefully and with stealth, you may be able to elude the creature. If you are careless, however, you will be forced to confront the creature head-on.\nKey Features\nExperience: An engine built from the ground up, featuring voxel-based volumetric clouds, advanced water reflection and refraction, volumetric light-shafts and atmospheric scattering simulations.\nExplore: A lush and incredibly detailed natural world. The island landscape is covered by forests with lush canopies. The terrain surfaces are blanketed by tufts of moss and grass. The forest floors have thick undergrowth and are littered with fallen leaves, rotting logs, stumps and sticks.\nDiscover: Dozens of camps, outposts and ruins. Find maps, notes and clues that lead you on your adventure.\nSurvive: A deadly world. Discover plants and fungi and synthesize them into life-saving medicines. Find water and shelter to stave off fever, dehydration and exhaustion. Use stealth and cunning to escape the deadly creature.\nCreate: A map of the island using an innovative cartography mechanic. Use a true-to-life triangulation system to pinpoint your location on the island and construct a map of the its boundaries, contours and landmarks.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"IonFX Studios","platforms":[{"id":0,"name":"PC"}]},{"id":275,"name":"Grim Legends: The Forsaken Bride","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c09/c09f3a034a5c96da751004e9aa0c496c.jpg","description":"Enter an enchanting world of legends and magic, filled with gloomy forests, forbidden temples, and abandoned castles; a realm of dark secrets, where your destiny was written long before your birth...\nWithin the shadow of an ancient forest, on the bottom of a foggy valley, stands the lonely village of Ravenbrook. The folk there are cheerful and diligent, yet warily superstitious. They surround the village with countless charms to keep the evil spirits at bay, for on the other side of the forest, there lies a seemingly bottomless pit, known as the Abyss. It is the place the villagers of Ravenbrook fear most...\nOn this night, a young woman is returning home for her twin sister’s wedding. The sisters haven’t seen each other in years. Yet the invitation was strange, almost as if someone else wrote it, other than her twin. But still she comes, ignorant of the danger that awaits...\nFor just before the wedding, amidst the happiness and reverie, a stranger arrived in Ravenbrook...\nFeaturesThrilling story, full of intrigue and adventure\nFuzzy sidekick – the cutest kitty helper you’ve ever met\n24  versatile mini-games and 14 hidden object scenes\n38 beautiful, hand-painted locations\n11 intriguing characters with different passions and dark secrets\nThe Book of Elusive Objects tells the story of local legend\nCollect 30 Spirits of the Forest for your Faerie Meadow\nAdditional, intriguing story\n24 achievements to unlock","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":264721,"name":"Draugen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a3/7a3735e31b7b69af172e0839fa54eb0b.jpg","description":"From the studio that brought you Dreamfall Chapters, and the creative team behind The Longest Journey and The Secret World, comes a first-person psychological mystery set in 1920s Norway.\r\n\r\nThe year is 1923. You play Edward Charles Harden, an American traveller who's come to Norway to find his missing sister. But you're not alone: at every step of the way, Edward's accompanied by his ward, Lissie; a gregarious, independent and enigmatic young woman. Together, you must explore this scenic coastal community — nestled amongst the fjords and mountains of rural Norway — in your search for Edward's sister, and unearth the darkness that lies beneath the picturesque surface.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Red Thread Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]}]