[{"id":13275,"name":"Anarchy Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df5/df56a09e387179476dab78ba5d24ceab.jpg","description":"Anarchy Online\nAnarchy Online – the first ever science fiction MMO – is finally on Steam! Compete and cooperate with thousands of player simultaneously on a vast, alien world. Join humanity nearly 30,000 years in the future in a world of perpetual conflict and scientific marvel.\nCreate\nChoose from 14 character classes across four races and deck them out with an array of weapons, armor, clothes, and accessories. Play as an elusive agent, a war-beaten soldier, or an enterprising trader. Customize your skills, abilities, and capabilities through nanotechnology and surgical implants.\nBattle\nJoin other players and delve into the secrets of Rubi-Ka, or accept contracts for cash and gear by tackling unique missions filled with challenges and surprises. You can even claim territory for your organizations and battle other players over the precious resources!\nExplore\nExplore a breathtaking and diverse world, filled with locations such as jungles, deserts, and sprawling cities with towering skyscrapers. Beam up to alien space ships, visit other dimensions, and travel anywhere you want with personal vehicles, planes, and even mechs!\nLive\nConstruct entire cities for your organizations, engage in global trade, or just kick back and relax with your friends in your very own apartment! Anarchy Online is a living, breathing online world, filled with things to do alone or with friends!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Funcom","platforms":[{"id":0,"name":"PC"}]},{"id":1218,"name":"WE ARE DOOMED","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f3/7f357aa677f386cfe70cfc3569bb2127.jpg","description":"WE ARE DOOMED is a twin-stick shooter where you zap polygon baddies with an absurdly overpowered laserbeam. Dive head-first into the action with reckless ambition, charge the SUPERBEAM, and zap everything out of existence in an instant. Chase high scores or just enjoy the beautiful explosion of geometry, color and light.\nPure arcade action. No cutscenes, storylines, or lengthy tutorials.\nAn overpowered laserbeam weapon, and the more ridiculous SUPERBEAM.\nWaves mode: 30 waves that range from chill to hyper-intense.\nEndless mode: An endless barrage of baddies. How many zones can you survive?\nQuick to start, and quick to restart for \"just one more\" game.\nA vibrant world of neon colors, bold shapes, and glitching geometry.\nA beautiful, chill, and occasionally glitchy soundscape.Press Quotes\"We Are Doomed is a fantastic take on the twin-stick shooter\" - Hardcore Gamer (4/5)\n\"All about that Doomed chill\" - Giant Bomb, Quick Look\n\"We Are Doomed is one of my fave shooters of the past few years\" - Rob Fearon, Take This Machine","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vertex Pop","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":684,"name":"Space Overlords","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eb3/eb392d9fdc148254d1d3ba271106535f.jpg","description":"Erupting from the shackles of your prison, you are an Overlord, an ancient life form of immeasurable power who seeks revenge against the evil Kesedihan.  Wipe out entire planetary forces, destroy cities and fight bosses as you seek to eliminate all existence of Kesedihan’s kin from the universe.FeaturesSmash, shoot and stomp your way through entire cities and planetary defences\nPVP Multiplayer mode (online and offline)  for up to four players\nCreate your own planets using the build in Planet Editor\nSix enemy types with stronger variations to face & defeat\nFour playable characters\n56 story mode levels\n4 Multiplayer game modesThe four Space Overlords are:\nA fire giant with the ability to send out flaming heat waves from his hands. He is incredibly skilled in close quarters combat, robust, violent, and has a variety of physical attacks to crush any resistance.\nA water type overlord, Terbang is equipped with gravity emitters that allow her to float.  While the fastest overlord, her attacks are not as strong as her brothers. She uses projectiles to attack and is able to charge her attack to create a massive power attack.\nOne of the strongest overlords, Phemus does not travel at high speeds, but due to his four arms is able to deal massive damage at close range.\nA hulking walking armour with two massive arms and tentacle-like protuberances as hair, he has a devastating spin attack which can be incredibly dangerous combined with a boost at the right time.Other titles from Excalibur Games","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Excalibur Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":896703,"name":"Outpath: First Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6df/6df1c3bc3461c4c438779f393882681a.jpg","description":"Wishlist The Full Versionhttps://store.steampowered.com/app/2237970/Outpath/\nAbout the GameThis Prologue includes the first 2 biomes of the main game 'Outpath'.\nTaking Satisfactory, Minecraft, Forager and the gratifying gameplay loop of clicker/idle games as references, Outpath would be just that. Exploit your environment, craft, build and automate your base in this 3D first-person platformer!\nGather. Craft. Build. Explore. Relax. No time limits, no pressure, play at your own pace and style.\nGather, collect and manage resources.\nCraft useful items.\nBase building, automate everything.\nBuy islands to expand and exploit!\nFishing.\nLevel up skills and unlock new blueprints.\nPlay active or idle, you choose!\nMusic reacts to your actions.\nUncover the secrets of this styliced place.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"David Moralejo Sánchez","platforms":[{"id":0,"name":"PC"}]},{"id":850705,"name":"Tekken 8","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ed3/ed3a5e9fab79022979de9ef420137f73.jpg","description":"GET READY FOR THE NEXT CHAPTER IN THE LEGENDARY FIGHTING GAME FRANCHISE, TEKKEN 8.\r\n• 32 FIGHTERS FOR A NEW GENERATION\r\nCompletely redesigned character visuals. Elaborate, highly-detailed models built from the ground and high-fidelity graphics break the limits of new-generation hardware by adding a new weight and atmosphere to TEKKEN’s signature battles. Vivid environments and destructible stages combine to create an overwhelming sense of immersion, creating the ultimate play experience.\r\n• NEW GAME, NEW RIVALRY\r\nFist Meets Fate in TEKKEN 8. Holding a record for the longest-running video game storyline, the TEKKEN series begins a new chapter as TEKKEN 8 continues the tragic saga of the Mishima and Kazama bloodlines, and their world-shaking father-and-son grudge matches starting from 6 months after the closure of the last match. The story of Jin Kazama's growth and determination marks a new chapter in the timeless saga.\r\n• THRILLING OVER-THE-TOP BATTLES EMBODYING AGGRESSIVENESS & DESTRUCTION\r\nThe new battle system, Heat, dials up the aggressive nature of battles, while maintaining the play feel and tactics unique to the TEKKEN series. The intensity of battles is greatly enhanced by the destructable stages. Unleashing super move-like Rage Arts is sure to enthrall both players and spectators alike. All of these hard-hitting mechanics come together to make TEKKEN 8 the most exciting installment in the series to date!\r\n• ENJOY YOUR TEKKEN LIFE!\r\nIn the new single-player mode Arcade Quest, craft your own unique avatar and embark on your new TEKKEN life. Battle your way through a variety of rivals across multiple arcades as the story unfolds, all while mastering the basics and practical skills in TEKKEN 8. Unlock a variety of customization items for characters and avatars as you progress.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":576504,"name":"A Space for the Unbound - Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/49f/49fe8509f39b0d6b42e4dd6533f95988.jpg","description":"Wishlist the full game here!https://store.steampowered.com/app/1201270/\nAbout the GameExperience the prologue chapter of A Space For The Unbound\nThis is the prologue chapter and proof of concept of A Space For The Unbound, an upcoming slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\nThis is the proof of concept prototype expanded from Mojiken Studio's internal game jam session. We are still trying to figure out the full game's experience, so your feedback and review on this Prologue will help us a lot in shaping the final game.\nKey Features Prologue chapter with 15-20 minutes of play.\nThrowback to the 90s! Let us take you to Indonesia in the late 90s.\nExplore rural Indonesia and enjoy its relaxing atmosphere with a hint of supernatural events.\nChat and interact with other townfolks and listen to their personal stories.\nDive into people's minds Inception-style.\nListen to beautiful music composed by Masdito \"Ittou\" Bachtiar","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mojiken","platforms":[{"id":0,"name":"PC"}]},{"id":471025,"name":"Avowed","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d3/3d33abf32d9fb92b9f242917abe276ba.jpg","description":"Welcome to the Living Lands, a mysterious island filled with adventure and danger.\nSet in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment.\nYou are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands - an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder?","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":362880,"name":"The Last Spell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc6/cc6c768a71fed84682e326a8bbce3718.jpg","description":"What if Final Fantasy Tactics & Dynasty Warriors had an illegitimate daughter?\nThe Last Spell is a turn-based tactical RPG immersed in roguelite mechanics in which you lead a team of hardened heroes to defend the last bastion of humanity against hordes of monsters.A Dark Fantasy Tactical RPG with Rogue lite elements\nThis is the end. War and a bunch of crazy mages provoked The Cataclysm. A mysterious mist filled with hellish monsters enveloped most of the world. They said that those who entered the mist were killed, driven mad, or even turned into monstrous abonimations themselves. Only a few Havens keep up the fight against the Hordes of bloodthirsty monsters that come out at night from this strange purple mist.\nDays were quiet and peaceful: they could take time to organize themselves, heal their wounds and search the surroundings for anything useful. But the nights… The mist thickened and from their bowels unleashes hordes of mutated monsters, craving for blood and magic.\nIn this glorious mix of pixel art and dark fantasy setting, you lead a group of hardened warriors whose only purpose in life is to desperately defend the last of the mages while they try to cast The Last Spell, and banish all magic from this world. And maybe save us all. Maybe.Features\nTurn-Based Tactics:\nManage your squad of hardened heroes\nScarce resources: use Mana wisely to survive\nClass-less skill trees and bonus perks\nHordes of Evil:\nTons of enemies to slay, burn, shock and slice!\nDozens of enemy types with different behaviors\nImpressive skills to help you slaughter ’em all\nProtect the City:\nRebuild a safe Haven from the remains of civilization\nBuild walls, traps and watchtowers\nProtect the circle of magic at all costs!\nRoguelite Elements:\nYou will fail… but everytime you do, you’ll grow stronger\nProcedurally generated Enemy waves, Maps, Characters and Weapons\nNasty bosses","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"CCCP","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":74668,"name":"Bloons Adventure Time TD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c3d/c3d7d53450a188bfc6f78e36fab64fed.jpg","description":"The Bloons have invaded the Land of Ooo and it’s up to Finn, Jake and the monkeys to stop them! Bloons Adventure Time TD is an awesome crossover between the award-winning animated series Adventure Time and the #1 Tower Defense game, Bloons TD!\n\nGET YOUR HERO ON!\n*Pop Bloons as your favorite Adventure Time characters like Finn, Jake, Princess Bubblegum, Marceline and more!\n*Recruit brand-new monkey heroes like Captain Cassie, C4 Charlie, and Sai the Shadow!\nA NEW ADVENTURE!\n*Play your way through over 15 adventures and 50 maps!\n*Original story featuring the voice cast of the animated series!\nMAKE THE BLOONS GO BOOM!\n*Equip your heroes with 200+ weapons and items from Adventure Time and Bloons TD history!\n*Build your defenses with over 50 allies including fan favorites BMO, The COBRA, and Lumpy Space Princess!\n*Unleash over 30 awesome, Bloon-shredding powers!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":52936,"name":"Final Fantasy (1987)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/656/6566c32aebb7b23af0573091132c2f2c.jpg","description":"Final Fantasy is a fantasy role-playing video game developed and published by Square in 1987. It is the first game in Square's Final Fantasy series, created by Hironobu Sakaguchi. Originally released for the NES, Final Fantasy was remade for several video game consoles and is frequently packaged with Final Fantasy II in video game collections. The story follows four youths called the Light Warriors, who each carry one of their world's four elemental orbs which have been darkened by the four Elemental Fiends. Together, they quest to defeat these evil forces, restore light to the orbs, and save their world.\nFinal Fantasy was originally conceived under the working title Fighting Fantasy, but trademark issues and dire circumstances surrounding Square as well as Sakaguchi himself prompted the name to be changed. The game was a great commercial success, received generally positive reviews, and spawned many successful sequels and supplementary titles in the form of the Final Fantasy series. The original is now regarded as one of the most influential and successful role-playing games on the Nintendo Entertainment System, playing a major role in popularizing the genre. Critical praise focused on the game's graphics, while criticism targeted the time spent wandering in search of random battle encounters to raise the player's experience level. By March 2003, all versions of the original Final Fantasy had sold a combined total of two million copies worldwide.","review":"","timePlayed":0.0,"releaseYear":1987,"developer":"Square","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation"},{"id":0,"name":"NES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii"}]},{"id":39513,"name":"Grand Theft Auto IV: The Ballad of Gay Tony","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/962/962dccbf5734909e1fe4f6d6a53ac576.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Rockstar North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":23860,"name":"Super Mario 64 DS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/da4/da4ade8921158396e2f3513069ad714d.jpg","description":"Mario, Luigi, and Wario set out for a party at Princess Peach's castle\nbut arrive to find it empty except for Yoshi. They soon discover that\nBowser has stolen the Power Stars and imprisoned the Toads. Enter all of\nthe castle paintings, and save the day! Then try out some action-packed\nminigames!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":21660,"name":"Manhunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3e/a3e6fad517ad03ce059b541b221fe2e1.jpg","description":"When John \"Striker\" Gullivan left the SAS, he's been far from thinking about retirement. A skilled sniper, veteran of many covert operations, he was ready to take on the less legal side of the \"business\".\nWorking closely with his friend Max - one of the best hackers there are - he quickly earned his fame among other mercenaries and private agencies. Yet, he was cautious enough to avoid standing openly against any legal government. He was even taking semi-official jobs that were too dangerous or too politically risky for any government agenda. This was an easy life.\nUntil now.Features:First Person Perspective dynamic adventure shooter powered by the advanced Argon 5 technology.\nPlay the role of a famous mercenary through 5 large, different chapters (14 huge levels total): Iranian hidden nuclear materials' processing plant, Moscow Trade Center where the trouble begins, City Dockyard hit-and-flee mission, Baykonur Cosmodrome shootout, and Iraq terrorist cave search for a missing VIP.\nGame reflects John's sniper expertise. At the beginning of each chapter he is given 2 sniper rifles - a silenced Arctic Warfare as a primary weapon and additionally one specialised rifle that fits the chapter best, selected from a variety of choices. Additional rifles range from a very fast, semi automatic Saiga with sniper scope to a heavy and deadly Barrett .50.\nGame simulates bullet ballistics depending on gravity, wind and bullet initial velocity for more realistic experience.\nUsing silencer on the Arctic Warfare or on John's personally modified P99 pistol may be useful at times, as the enemies fully depend on their eyes and ears - and they cannot chase what they don't see nor hear.\nPlaying the game as a \"standard\" shooter using automatic rifles and pistols taken from dead enemies is of course possible as well - still using sniper tactics over longer distances is easier.\nSophisticated enemy AI allows them to fight in groups, using different weapons and explosives, alarming and supporting each other, using terrain and objects in their tactics.\nGame is powered by advanced technology and renderer that produces beautiful images, full of light, beautiful atmospheric effects, realtime water, reflections, shadows and different, realistic surface materials complete with vivid, living environments with animated plant life, insects and birds.\nConvincing storyline and action objectives. The player is constantly in contact with his HQ, which feeds him with data and changes mission objectives as he goes.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Silden","platforms":[{"id":0,"name":"PC"}]},{"id":20777,"name":"Tribloos 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/003/003daa4ba898f693fad516479beeec45.jpg","description":"The Tribloos 2 is the sequel to the best-selling time management game, The Tribloos.\nTrey's village is under threat once more. Before there was only one storm to worry about, now there have been many and Matilda the dragon is being tired out trying to blow them all away!Can You Help Trey Save His Island?\nAs always, Brainy has an idea, a wild fantastic idea that will definitely work...this time...he promises! But it's going to take real team work, skill and strategic planning to make it succeed. Are you up to the task?\nThis time the Tribloos will be travelling far away from their island home and deep into the unknown as they discover that the storms are not naturally occurring!\nBeautiful Hand Drawn graphics\nOver 90 levels for you to beat\nFully original soundtrack","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"BumpkinBrothers","platforms":[{"id":0,"name":"PC"}]},{"id":20732,"name":"WRC 4 FIA World Rally Championship","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/044/04440487ab1adef5e8050aa71f6242f2.jpg","description":"Show off your style and win the FIA WORLD RALLY CHAMPIONSHIP 2013 season!\nExperience the 2013 season with the drivers, cars and courses of the WRC, WRC2, WRC3 and, for the first time, Junior WRC championships. Take advantage of an improved graphics engine and play online against your friends morning, noon and night on one of the 78 available courses, each tougher than the last.\n• The official 2013 FIA World Rally Championship videogame\n• 65 official cars and colours\n• 78 courses in 13 different countries\n• An incredibly authentic and immersive career mode\n• All weather conditions and road surfaces\n• Online multiplayer mode for up to 16 people","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Milestone","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":17893,"name":"Midnight Mysteries: Salem Witch Trials","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95e/95e31b355f4bd4c12e0eb0f1e9e0bf55.jpg","description":"The famed writer Nathaniel Hawthorne has died during a freak snow storm, and his ghost has come to you, asking for help.  There’s more to this case than first appears, and only you can help free his spirit.  Why was it snowing in May?  Could Hawthorne’s powerful friends and the Oval Office have something to do with the author’s untimely death?  How do legends of witchcraft play into the death of a writer 170 years later?\nTravel back and forth in time from the scene of the author’s demise to the 17th century, where a town is going mad with rumors of witchcraft and a woman is facing accusations and the gallows.  Unravel the secrets of Salem’s accused witches and solve the mysterious death of Hawthorne in this Midnight Mystery!Key Features:Complete 10 Adventure Missions\nExplore the spooky terrain and structures of Salem village inside and out, interview apparitions, solve brain-teasing puzzles, and collect hidden objects\nUnravel the conspiracy of the Salem Witch Trials\nCollectible clovers let you unlock an unlimited hidden object mode!\nHawthorne guides you through time to unravel his mysterious death\nSequel to the hit Midnight Mysteries: The Edgar Allan Poe ConspiracyCollector’s Edition Features:Collector’s Edition includes detailed, illustrated Strategy Guide\nFind two hidden Easter Eggs to play special hidden object modes\nArtful character sketch index to explore\n***Please note, to use Achievements you must select the Achievements tab under beta. This version is not compatible with all Win7/8 machines.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"MumboJumbo","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":16323,"name":"Murder Mystery Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32a/32af3811642510c433f4e6e2719a13df.jpg","description":"Murder Mystery Adventure tells the suspenseful story of a chilling murder committed in a mysterious mansion upon the hillside at the outskirts of town. Only you can solve the crime. Only you have the wits to solve challenging puzzles to unveil critical clues. Only you have the investigative knowledge to interact with possible suspects to decide who is lying and who are innocent. Combining the very best of point-and-click adventuring with Hidden Object discoveries, your task is to search for clues and possible murder weapons throughout the house. Find missing keys to locked doors. Discover lost weapons. Look for secret corridors. Play mini-games to gain access to restricted areas. When you know who the murderer is, your final task is to call the police identifying the true suspect. Enter the mansion if you dare …KEY FEATURESSuspenseful Point-And-Click Adventuring\nHidden Object Discoveries\nSecret Corridors\nNotebook For Hints And Clues\nNumerous Murder Suspects\nDangerous Weapons\nChallenging Mini-Games","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16319,"name":"Mahjong Deluxe 2: Astral Planes","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68d/68d56f5b196a72dc14245a1f5f9d0a4b.jpg","description":"Mahjong Deluxe 2: Astral Planes is an out-of-this-world Mahjong game produced by award-winning game developer EnsenaSoft, challenging you to complete increasingly complex mahjong puzzles rendered in glorious 3D. Match and rotate 3D tiles and test yourself to solve 84 mind-bending puzzles. Four levels of difficulty are included adding to the fun. Puzzles are laid out using random tile orders allowing you to replay each mahjong layout many times with a new experience each session. An exciting scoring system, great sound effects and relaxing music adds to the fun. Suitable to players of all ages and experience levels, Mahjong Deluxe 2: Astral Planes offers an extraterrestrial rendition of the popular Chinese classic, and is a must-have game in your collection today.Key Features84 Mahjong Puzzles To Solve\n4 Levels Of Difficulty\nRichly Rendered 3D Environments\nRandom Tile Layout\nGreat Graphics, Audio & Score","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":13975,"name":"Rabbit Hole 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3c/e3c097c0ddd609a4035ff56c4e42db00.jpg","description":"Find out how deep the rabbit hole goes!\nRabbit Hole 3D: Steam Edition is a minimalistic retro puzzle game.\nThe game features 3D word puzzles based on Chapter 1 of Alice in Wonderland by Lewis Carroll. Players must navigate through keywords generated from the book’s initial chapter.Features Supports SteamPlay. Play it on Windows, Mac, and Linux!\nContains audio clip of Alice's Adventures in Wonderland (Chapter 1 - Down the Rabbit Hole)\nDynamic procedural graphics with a minimalistic retro look\nRetro chiptune soundtrack\nSteam Leaderboards and Achievements unlock! Compare your scores with your Steam friends!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Somi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10922,"name":"Mainlining","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62f/62fb9a613aafad50b16c52f27e9307ab.jpg","description":"Mainlining Deluxe EditionMainlining Deluxe Edition includes:\nThe full Mainlining game.\nThe complete original digital soundtrack by Telltale Games' award-winning composer, Jared Emerson-Johnson.\nThe complete digital art book, \"The Pixels of Mainlining\"\nPlay the first two cases for FREEhttp://store.steampowered.com/app/454980\nAbout the Game\n\"Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say.\" - Edward Snowden\nMainlining is a thrilling point and click hacking adventure that mixes dark and dry humour with a gripping narrative that will have you hooked from the very first case. Following the government's introduction of the BLU Pill Act and the Secret Intelligence Service's reintroduction of MI7, all online personal data is accessible by the powers that be. Mainlining questions techno-ethics and whether it is acceptable for an organisation to have the power to look at personal data. What if someone else got the key to that?\nMainlining and its BLU Pill Act mirrors what's happening in our own world. On November 4th 2015 the The Draft Investigatory Powers Bill was discussed in the British Parliament's House of Commons for the very first time. It’s likely that the bill will be passed sometime in 2016, meaning that domestic mobile and broadband providers will be forced to assist authorities with gathering data and storing it for a year. The police and security services will have access to the top line of the UK’s population browsing history, as well as knowing what apps have been used.\nReferred to in the popular media as “the Snooper’s Charter” and opposed by a number of civil and human rights organisations, the Investigatory Powers Bill is positioned to aid security forces in tracking terrorists and serious cyber criminals who use increasingly sophisticated online methods.\nMainlining is a refreshing take on the traditional point and click adventure. The entire game takes place on the simulated desktop of the protagonist’s computer. Assuming the role of a newly recruited MI7 agent and working within the remit of the Blu Pill Act, the player must use their skill, judgement and cunningness to gather evidence by hacking suspects’ computers and phones.\nAs a MI7 operative your primary objectives are to ensure the perpetrator’s arrest and that the courts have sufficient evidence to hand out the longest custodial sentences possible. However, you’ll also have to make judgements on whether the case you're working on is complete. Move in too quickly and you may miss leads linking your case to much higher profile cyber-criminals. Act too slowly and your suspect may detect you and escape.\nIn excess of five hundred known criminals are known to operate within your jurisdiction, who will you investigate?\nThe driving force behind Rebelephant is British-born developer and designer, Sam Read. Highlighted by internationally renowned publication Develop as one of the 30-under-30 to watch out for, Sam has already tasted success as a key member of the HyperSloth team and their critically acclaimed first-person adventure, Dream. Owner of Rebelephant, Sam is responsible for the design, direction and coding of Mainlining.\nTo fit in with the game's 2009, feel Rebelephant has called upon the artistic talents of Dave Grey who, in his own words, \"Makes things with pixels. Like games and stories and things\". Dave's previous collaborations include Microsoft and HBO.\nMainlining relies heavily on an energetic narrative that draws the player into the game, blurring the lines between reality and the imaginary world of MI7. Rebelephant wasted no time and called upon one of the best scriptwriters in the business, Canadian novelist Jill Murray. Jill was nominated for Writers Guild Award for Outstanding Video Game Writing for her work on Assassin's Creed IV: Black Flag and won the award for scriptwriting on Assassin’s Creed III: Liberation.\nFor the final part of the jigsaw Rebelephant has drafted in the sublime audio talents of Jared Emerson­-Johnson. BAFTA nominated, Jared's scores include Telltale Games' Sam & Max series, The Walking Dead, The Wolf Among Us, Tales From the Borderlands and Game of Thrones.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Rebelephant","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5709,"name":"Wanted: Weapons of Fate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9b/f9ba5ed4bac72874b0edfd829bcffdc5.jpg","description":"Set directly after the events of the film, Wesley continues his transformation into a full-fledged assassin and heir to a legacy of a secret fraternity of assassins. He continues his quest with a new mission to seek out the French chapter of The Fraternity, hunt down The Immortal and finally discover the truth about his family.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Warner Bros. Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":5205,"name":"Manhunt 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2a8/2a8e6acdf8cde8915920f568bd6f86b0.jpg","description":"An experiment at a secret research facility has gone catastrophically wrong. Daniel Lamb and Leo Kasper are the only surviving subjects. The Pickman Project will stop at nothing to hunt them down and stop the truth from getting out.\nDemented screams echo around the dark asylum that has caged you for the last six years. You open your eyes. A white-coated body slumps to the floor through your shaking hands. A bloody syringe slips from your arm. Waves of confusion and paranoia crash over you. You have no idea who you are or how you got here.\nThe door to your cell is open. One choice. Once chance. They took your life. Time to take it back.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© 2005-2007 Rockstar Games, Inc.  Rockstar Games, R*, and Manhunt 2 are registered trademarks of Take-Two Interactive Software, Inc. The ratings icon is a trademark of the Entertainment Software Association.  All other marks and trademarks are properties of their respective owners.  All Rights Reserved.\n\nThe content of this videogame is purely fictional, is not intended to represent or depict any actual event, person, or entity, and any such similarities are purely coincidental. Unauthorized copying, reverse engineering, transmission, public performance, rental, pay for play, or circumvention of copy protection is strictly prohibited.\nUse of this software is subject to license available in the game manual and online at rockstargames.com/eula. Any online features require internet connection, may be retired on 30 days notice, and may not be available to all users.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Rockstar North","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":1608,"name":"The Nightmare Cooperative","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65f/65fc3788dca7c5983b39aceb9770e3f3.jpeg","description":"The Nightmare Cooperative is a strategic roguelike where you lead a group of unlikely comrades through some rather difficult situations. Your village has fallen on hard times (due to some rather reckless spending by the Village Council) and it’s up to you to bring back some gold. Or even just try and survive for a bit.\nEach member of the Cooperative will bring a different power to your group; the Warrior fights hard (despite her moral objections), the Miner overcomes deep psychological issues to dig you out of sticky situations, the Necromancer is pretty creepy.\nA tricky thing, though: you have to control them all together. Move left, and the whole group moves left. Activate the special power, and every member will jump into action.\nAnd please, do your best to bring home some gold, the Village could really use it.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Blazing Griffin","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":528836,"name":"Cloud Climber","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/475/47598db3bfd3b1523f9e5384da83c13a.jpg","description":"If you like Cloud Climber, be sure to check out my other game!https://store.steampowered.com/app/1036700/My_Beautiful_Paper_Smile/\nAbout the GameA thousand years ago it stopped raining, and all Earth's water evaporated into the clouds.\nFor over a hundred years people have been building towers to attempt to reach the clouds, so they can get the water they need to survive.  And for over a hundred years they've failed.  It's been a long time, but you're not done building yet.\nCloud Climber is a short narrative adventure game, that can be completed in 10-15 minutes.  You must explore each tower, to uncover the full story of what happened, and find a way to the last tower to continue builder higher.  The game is a casual thought provoking experience, that tells a unique and compelling story.\nFeatures:\n-Fully hand-drawn graphics\n-Casual exploration based gameplay\n-Fully voiced narration\n-A short, yet satisfying experience\nExplore the last monuments of humanity, as one of the only people alive, while coming to terms with the bleak reality that lies ahead.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Two Star Games","platforms":[{"id":0,"name":"PC"}]},{"id":334520,"name":"Last Year","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a78/a7871bc8e98d1c2ec3a3820af5282c33.jpg","description":"FACE YOUR FEARS\nTeam up with four other Classmates to survive against a sixth player controlling  a dreadful, horrifying Fiend, in this evolution of multiplayer horror games inspired by classic horror stories.\nWELCOME TO THE NIGHTMARE\nFor these Classmates, their last year of high school might be their last year of life.  After being transported to a nightmarish copy of their hometown through an occult game of cards, six classmates soon find out that they are not alone, and that to escape, they’ll have to work together against all manner of Fiends lurking in the shadows.\nKEEP YOUR FRIENDS CLOSE\nWhich Classmate will you pick? Choose from 6 Classmates, and assign them a Class to get special skills. The more you work well with your Classmates, the better your chances of survival. And the more you survive, the more Arcane Secrets you learn, unlocking powerful magical abilities to take the fight to the Fiends.\nWITH FIENDS LIKE THESE...\nSupernatural entities living in The Nightmare, the dreadful Fiends take the form of quintessential horror archetypes, and each have unique powers, weapons and play-styles. Decide whether to attack the Classmates head-on, or meticulously plan your attacks by setting up traps, preparing ambushes, and toying with your prey.\nA NEVER-ENDING NIGHTMARE\nFree content updates in the form of Chapters will bring new, terrifying Fiends and ever-more-dreadful areas inspired by different genres of horror, and more, changing up the gameplay and making Last Year the ultimate multiplayer horror experience.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Elastic Games","platforms":[{"id":0,"name":"PC"}]},{"id":323064,"name":"Garden Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9a/b9a203cb4751842e6cdf4c20ce7b0e59.jpg","description":"Garden Story is a social sim and adventure RPG where you play Concord, a newly appointed village guardian. There’s lots to keep this helpful adventurer busy; not only do your neighbors need assistance, but a mysterious Rot has seeped into the foundations of the once flourishing island! Fortunately, Concord won’t be working at this alone. Help your friends with their struggles, and they’ll help you through yours. Balance caring for the environment, exploring new regions, and fostering new friendships as you solve puzzles and help restore the Grove to glory!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Picogram","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":288671,"name":"Littlewood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d54/d54f13f25299c3c3a6ac7e966ff33daa.jpg","description":"Littlewood - A Peaceful RPG\n\n\"You defeated the Dark Wizard. The world of solemn is finally at peace, but at what cost? You can't quite remember..\" \n\nExplore the vast world of Solemn. Enchanted Forests, Bustling Fishing Towns, & Dark Mining Caves are some of the few places to visit.\n Meet Townsfolk and convince them to stay in your town. Perhaps meeting people will unlock your memories of the past…\n Collect rare items and materials found across the world and bring them back to your town for selling and crafting!\n\n\"Littlewood starts off as a jumble of trees, rocks and weeds. You'll need to unlock new tools to harvest these materials for building and upgrading your town!\"\n\nHarvest materials by chopping wood, mining ores, catching bugs, and fishing in rivers and ponds! \n Unlock new structures to build by meeting new Townsfolk. Want a Tavern or a Lumber Mill? How about a Fishing Hut or a Magical Library? Your town's design is all up to you!\n Fulfill your Townsfolk's requests. Some may want to live on a higher elevation, others may want to be surrounded by trees and water. Fulfilling the requests of your Townsfolk will earn you their hearts and unlock new relationship paths.\n\n\"Become an expert Fisherman. Cook delicious food for you Townsfolk. Craft a Golden Axe and cut down every tree. You decide what each day holds!\"\n\nGathering: Whether you’re picking fruit or picking weeds, your gathering skill will level up! The Gatherer’s Glove is needed to unlock this ability.\n Mining: Looking for shiny ores to collect? Interested in rare materials for crafting? Then mining is for you! \n Woodcutting: Those pesky trees and debris that keep popping up all over town needs to be chopped! Wood is an essential material for building new structures and furniture.\n Bug Catching: Craft a Bug Net and catch all sorts of critters. Be sure to go bug hunting during each season and at different times of the day!\n Fishing: There's nothing quite like relaxing by a pond with a fishing rod in hand. You can sell fish for a decent price at the Shopping District, or use them as ingredients for new cooking dishes.\n Farming: Plant some seeds in tilled soil and wait a few days. Veggies are an essential ingredient to many cooking recipes! Also, they make your town look pretty.\n Cooking: Once you've built the Tavern and have become good friends with Bubsy, you'll be able to start cooking delicious meals for your Townsfolk! Maybe you can attract rare Townsfolk by serving unique dishes...\n Crafting: There are tons of structures, decorative monuments, and furniture to craft. Often times your Townsfolk will request specific objects that they would like to be placed in their home. Make sure you gather enough building materials!\n Merchanting: Selling items at the Shopping District will net you large sums of Dewdrops, which is the main currency in Solemn. As you become a better Merchant, rarer items will appear for you to buy!\n Tarott Master: Once the Dark Wizard was defeated, all of his monsters were sealed away into Tarott Cards. Many Townsfolk collect and battle with these cards, and there is even a big competition held each year in Dirboros. Get collecting!\n\n\"Once you convince a travler to stay in your town they become a Townsfolk! You'll talk, hang out and build long lasting relationships.\"\n\nWillow: A cheery young girl who wants to rebuild Littlewood. She found you in the middle of the forest and took care of you for 3 days while you were unconscious. She likes working with tools and is quite proficient at building things.\n Dalton: A ditsy boy who loves going on adventures with you. Despite his forgetfulness and silly demeanor, he actually can tell some very clever jokes. He enjoys fishing, catching bugs, and shopping for cool hats.\n Lilith: A Wizard who graduated at the top of her class at Alexandria's Magical Academy. When she's not reading a book she's mixing random things together to make potions that may or may not explode. Also, she is your biggest fan.\nAnd many more!\n\nInfluences: Animal Crossing, Dark Cloud and Runescape 2007.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sean Young","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":57422,"name":"Mega Man X (1993)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e5db3cb9bc5e74293a344998207a22c.jpg","description":"Mega Man X, known in Japan as Rockman X, is an action-platform video game developed and published by Capcom for the Super Nintendo Entertainment System (SNES). It was the first Mega Man game for the 16-bit console and the first game in the Mega Man X series, a spin-off of the original Mega Man series that began on the SNES's predecessor, the Nintendo Entertainment System (NES). Mega Man X was first released in Japan on December 17, 1993 and was released in both North America and Europe the following year. Taking place a century after the original Mega Man series, Mega Man X is set in a futuristic world populated by both humans and \"Reploids\", robots capable of thinking, feeling, and growing like their human creators. Because of these complex attributes, many Reploids are prone to destructive, criminal activity and are thereafter referred to as \"Mavericks\". The plot of the game follows the protagonist Mega Man X, an android member of a military task force called the \"Maverick Hunters\". With the help of his partner Zero, X must thwart the plans of Sigma, a powerful Maverick leader wishing to bring about human extinction.\nWith the transition to more advanced gaming hardware, series artist Keiji Inafune explained that the development of Mega Man X involved reinventing Mega Man through gameplay expansion and a more mature storyline while still maintaining the basic concepts on which the franchise was built. Much like the NES Mega Man games that came before it, Mega Man X is a standard action-platform game where the player takes control of the eponymous character and must complete a set of eight, initial stages in any order desired. Defeating the boss character at the end of each stage grants the player one new weapon that can then be toggled and used at will for the remainder of the game. However, Mega Man X adds a number of new features and makes radical changes to the original gameplay mechanics of previous releases in the series. These include allowing the player to dash along the ground, scale walls, and obtain armor attachments which grant special abilities.\nMega Man X has met with positive reviews for its gameplay, sound, and graphics, as well as its attempt to augment the aging Mega Man franchise. A longterm commercial success on the SNES, Mega Man X has since been ported to personal computers (PCs) and mobile devices, included in the North American Mega Man X Collection for the Nintendo GameCube and PlayStation 2 (PS2), and released on the Virtual Console download service for the Wii, the Wii U, and the New Nintendo 3DS. The game also received a remake on the PlayStation Portable (PSP) titled Mega Man Maverick Hunter X. Nintendo re-released Mega Man X in the United States in September 2017 as part of the company's Super NES Classic Edition.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Capcom","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"SNES"},{"id":0,"name":"iOS"}]},{"id":20690,"name":"Into The War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"null","description":"Into The War is a Parkour FPS which is still in Development. It is made by Small Town Studios and has a long road of work ahead of it. Please hop into the discussion and suggest any features you would like to see in this game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Small Town Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18238,"name":"9.03m","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c3/6c30f29e9c0b0afc7ec44d19dd5a4b7d.jpg","description":"9.03m, is a short, first person, art/empathy game for PC. Not a game in the traditional sense of the word; it aims to humanise, and remember the victims of the 2011 Japanese tsunami. The media is quick to put figures to death tolls in such disasters, and 9.03m tries to remind people of the individuals behind those figures.\n9.03m is set on Baker Beach in San Francisco, where debris from the tsunami has washed ashore in the years following the tsunami.\nTo play, you must find the butterflies.\nAll royalties (as of 19/12/2013) are donated to charity. Half of all received Space Budgie royalties go to Aid For Japan (http://www.aidforjapan.org.uk), a charity that helps children who lost their parents in the tsunami. The other half goes to Redr (http://www.redr.org.uk) a charity that helps in disaster scenarios.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Space Budgie","platforms":[{"id":0,"name":"PC"}]},{"id":13845,"name":"Crown and Council","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20a/20ac4e414db047240b9651c940030523.jpg","description":"Originally a jam game, Crown and Council is a casual strategy game of geopolitical drama. Conquer, expand, build and develop your kingdom, until all your foes are crushed!\nCrown and Council relied on procedural generation for the 75 included maps. The generator is built into the game, and you can generate new maps on the fly.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Mojang","platforms":[{"id":0,"name":"PC"}]},{"id":6434,"name":"TinyKeep","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/068/068d1a7afdd48182611cf5d3f25c42f0.jpeg","description":"In TinyKeep players will embrace the role of a hopeless prisoner held deep in a forgotten dungeon who one day wakes up to find themselves mysteriously released. Their savior is nowhere to be seen, but the cell door is broken and ajar, tempting them with the sweet scent of freedom. With nothing but a flickering lantern and a strange letter left behind by their in-mate, they must venture into the darkness and escape TinyKeep!\nLure monsters into traps, knock over fire torches to set the dungeon alight and set prisoners free to help you on your way. Enemies will work together in groups to hunt you down, and some will flee from threats. You can also take advantage of monster rivalries and lead them against each other, while you wait behind a corner as the resulting chaos ensues. There are many ways to survive in TinyKeep.FeaturesProcedurally generated random dungeons – no playthrough is ever the same!\nWatch your step as it can be your last! Extremely challenging Permadeath gameplay\nExplore a variety of beautiful but deadly environments. From the cold slimy walls of the dungeon to the hot fiery pits of hell, TinyKeep is a visual treat.\nBattle a variety of intelligent enemies, each one determined to make your escape as difficult as possible. Creatures work together to chase you down, flee from threats and fight each other for dominance.\nUse traps and environmental hazards to your advantage - fire, spike pits and rotating crushers hurt your enemies as well as you!\nCollect coins from fallen foes to purchase random player-altering Buffs that just might give you the advantage you need to make it out alive.\nRescue other captives to fight along side you, but beware as you never know which ones have gone crazy trapped up in the Keep.\nExperience 3 separate endings to the game, depending on how you play.\nHours of gameplay with Secrets that extend the experience – Discover items and weapons that can slow down time, render you invincible or provide secret saves.\nNew Game+ mode for players that prefer the extra challenge!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Phigames","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":674190,"name":"Destroy All Humans! 2 - Reprobed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0bc/0bccb296edb7f1757bd0923252fa95b5.jpg","description":"Crypto is back with a license to probe. The alien invader returns, groovier than ever and now with genitals! Experience the swinging ‘60s in all its chemical-induced glory and take revenge on the KGB for blowing up your mothership. As you uncover the schemes of your enemies, you’ll have to form alliances with members of the very species you came to enslave.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":644752,"name":"The Ramp","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/541/5418738decb6c1a343a86c39d212c541_IApqwon.jpg","description":"THE RAMP SUPPORTS KEYBOARD INPUT, BUT IS BEST PLAYED WITH A CONTROLLER.\nYou crave for flow? You just want to shred through a halfpipe without all the boring stuff? Say no more, The Ramp is your jam!\nYES:tons of flow\nsatisfying & unique skateboarding gameplay\neasy to learn, hard to masterBUT:NO unlockable stuff\nNO score, NO missions\nNO guns, explosions and helicopters\nA quick note from the developer:\nWhen thinking about buying The Ramp, please keep in mind that it is a very small game. Maybe not even a game, but rather a digital toy. It was created by a single developer (hi that’s me, Paul) to scratch a very specific itch.\nThe Ramp captures the unparalleled feeling of real life vert skateboarding and that’s pretty much it. There is a lot this game doesn’t feature. What it offers you are the 15 minutes of flow that make a boring day great, at the price of a medium sized cinnamon pistachio latte to go.\nPlease don’t hesitate to get in touch if you have feedback, questions or problems with the game. I’ll do my best to get back to you as quickly as possible. Also let me know if you enjoyed The Ramp, because that really makes my day!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Crescent Moon Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":34729,"name":"Silent Storm","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d7/3d70e6e61b9ea764bac9a29b809be306.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":22468,"name":"Shadowgate: MacVenture Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/598/5985f3e09038d2932ba9b5cb57a1a3ae.jpg","description":"The wind whistles shrilly through the halls as you step gingerly over the threshold. You’ve just entered Shadowgate, a once shining fortress, now a dark smoldering ruin. Swallow your fear and take up your torch. In your hands lies the fate of your land... freedom and sunlight, or the dark domination of the Warlock Lord. Only you, the last of an ancient line of kings, can hope to stop the evil one from his dread purpose: the raising of the titan Behemoth and the destruction of all you hold dear.\nThe original Macintosh AND Apple IIgs versions have been restored to their original glory! Come see where the world of first-person fantasy adventures started and experience the classic adventure as it appeared in 1987.\nPlay the completely updated Shadowgate (2014) by clicking here: http://store.steampowered.com/app/294440/Shadowgate: MacVenture Series Key Features\nTwo Original Versions: You get BOTH the Macintosh and Apple IIgs versions, restored to their original glory!\nFirst Person Adventuring: Over 50 game rooms of fantasy adventure.\nDrag and Drop: Utilize the classic, groundbreaking windows-based, drag and drop object system.\nPuzzles: Tons of great puzzles.\nCustomized UI: Move the UI around to suit your needs and resize the retro graphics to full screen.\nSave System: Save your progress at any time – create as many save points as you wish.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zojoi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20040,"name":"Jesus Christ RPG Trilogy","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/990/990ee6adc3010b188e39cb9b3e1ad913.jpg","description":"Jesus Christ RPG deals with the period between the baptism and the transfiguration of Jesus Christ. Like many other Role Playing Games, this one features turn based battles. You also must undertake tasks as Jesus Christ, Mary Magdalene, Simon Peter and Judas Iscariot.\nThis game is for anyone who enjoys playing role playing video games or history or religion or any of the previous options.\nPlayable Characters in Jesus Christ RPG:\nJesus Christ - regarded as the Messiah by many, he's on a mission to save the world from itself. Curing the sick people and exorcizing demons, he's also in conflict wit the local authorities who see him as trouble-maker who's on a quest to become king.\nMary Magdalene - a woman who was possessed by demons and later joins the party. She anoints Jesus and give him strength to fight even more battles against the forces of evil.\nSimon Peter - \"The Rock\". He's a strong man who's Jesus' greatest ally. Nonetheless, he will also have his trials to overcome as his faith is tested against his self-preservation instinct.\nJudas Iscariot - A misguided man who thinks too much of material things and loses sight of the big picture. His obsession with status and money-making prove to be his own downfall.\nCharacters playable in BJC RPG\nVirgin Mary - Chosen by God to deliver the Messiah to the world, she must fight against an army which is out to kill her newly born child.\nJoseph - A foster father to Jesus and a carpenter by trade, he will go out of his way to protect his son.\nBaby Jesus - Still a toddler, he will help the party the best he can. His skills may be limited for now, but he will grow into a remarkable person one day.\nGaspar, Melchior & Balthazar - The three wise kings face a perilous journey to the west, where they hope to find the baby Messiah. Fighting against spirits, robbers and foreign gods, will they ever reach Judea?\nCharacters playable in RJC RPG\nJesus Christ - regarded as the Messiah by many, he's on a mission to save the world from itself. Curing the sick people and exorcizing demons, he's also in conflict with the local authorities who see him as trouble-maker who's on a quest to become king.\nMary Magdalene - a woman who was possessed by demons and later joins the party. She anoints Jesus and give him strength to fight even more battles against the forces of evil.\nSimon Peter - \"The Rock\". He's a strong man who's Jesus' greatest ally. Nonetheless, he will also have his trials to overcome as his faith is tested against his self-preservation instinct.\nJudas Iscariot - A misguided man who thinks too much of material things and loses sight of the big picture. His obsession with status and money-making prove to be his own downfall.\nMalchus - A soldier tasked with accompanying Judas on his mission to apprehend Jesus Christ.\nLonginus - A centurion who takes prisoners condemned to death by crucifixion to Golgotha, where they meet their demise.\nGesmas - The unrepentant thief. He mocks Jesus at the cross while sharing the same fate. A tough man who does not have compassion in his heart for anyone.\nDismas - The repentant thief. Dismas realizes his predicament is bad yet caused by his actions. He argues with Gesmas and ends up reaching Heaven.\nAngel Gabriel - The messenger. Here, he helps Jesus on the Lord's last mission before resurrection.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Wholetone Games","platforms":[{"id":0,"name":"PC"}]},{"id":18560,"name":"Fake Colours","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa5/fa517ab20835c5c5377ab7c22190f4c9.jpg","description":"Designed around the RBG colour scheme, Fake Colours is a 3D cube rolling puzzle game in which the player must move three coloured blocks to their corresponding target squares. Don't be fooled by the simple, yet beautiful art in the game, Fake Colours is all about the puzzles. Game Blocks are able to roll on top of each other but are unable to roll onto tiles that are not their respective colours. The opening 10 levels won't take you too long to get through and learn, but don't be fooled into thinking this game is short or easy. The remaining 20 levels will take you hours and many cases days to complete. These puzzles grow in difficulty as the game progresses and later includes mini-coloured cubes that change the original cube’s colour once it moves through the mini-cube. Although simple to learn, Fake Colours is quickly becoming one of the most memorable puzzle games since Tetris. The ambient music and excellent vibrant graphics help create the foundation that makes Fake Colours addicting and fun!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Forthright Entertainment","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17734,"name":"ChuSingura46+1 S","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/312/312d90a78c505bde3aa2d27499b04b11.jpg","description":"ChuSingura46+1 is an award-winning visual novel that puts you in the shoes of a high schooler who gets transported back in time into the body of a Samurai. However, in this timeline, all the Samurai are inexplicably female. You can get to know the “intimate” side of the characters from the classic Japanese tale of the 47 Ronin while playing a visual novel ー all without any of the dangly or rough bits of the original!\nThis visual novel has been adapted from a sound novel based on the actual historical facts of the Ako incident. In adapting the story to visual novel format, most of the main characters of the 47 Ronin have been turned into females, and parts of the core story have been polished into a lighter literary style that also incorporates fantasy elements.\nThe story goes something like this…\nOn the 14th day of the third month of Genroku 14 (1701 CE), an incident occurred involving the ruler of the Ako Domain, Lord Asano Takumi No Mikami shedding the blood of Kira Kousuke No Suke in the Corridor of the Pines in Edo Palace.\nThis incident that would later become known in Japan as the famous Ako incident.\nUpon hearing of this incident on the same day, the fifth shogun of the Tokugawa dynasty, Tokugawa Tsunayoshi, became enraged.\nIt was ruled that that very same day, Lord Asano should be sentenced to seppuku, after which his lands were to be scattered and his house broken up. Meanwhile, Kira Kousuke No Suke received no no rebuke whatsoever, going against the tradition set by the first Shogun of punishing both parties in a fight.\nUnable to comprehend this harsh and shocking punishment, the loyal Samurai retainers of Ako start to move to restore honour to their master by commencing a vendetta against Lord Kira.\nMeanwhile, Fukami Suguha is transported from present day Japan to the Edo-period Ako domain, where he gets to know the Ako Ronin.\nWhat will become of Suguha as he throws himself to the mercy of the cogs of history, and will he ever be able to return to his own time?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Inre","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17411,"name":"Vendetta - Curse of Raven's Cry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1fe/1fe5974a7744c646365f315a71b3d9f7.jpg","description":"In the darkest corners of the Caribbean, an old evil is rising again.\nIt's been years since Christopher Raven's family was brutally murdered by Neville “the Devil” Scranton and his bloodthirsty gang, the Devil's Tines. Orphaned and missing a hand, Christopher is rescued by Marcus, an ex-slave and rum-maker who nurses Christopher back to health and takes him under his wing.\nGrowing up with a black bitterness in his heart, Christopher drowns his demons in rum and violence, brooding endlessly on the revenge that was stolen from him when the Devil’s Tines disappeared in the monstrous quake that sunk half of Port Royal. When a string of brutal and all too familiar murders occur, Christopher’s chance for revenge is suddenly within his grasp. Neville and the Tines are back, and nothing on earth will stop Christopher from claiming their heads.CONTENT OF THE DIGITAL DELUXE EDITIONA brand new location waiting to be explored, with additional 60 minutes of playing time\nTwo exclusive in-game items: the Grim Ripper figurehead and the mighty cutlass \"Merciless\". Both exclusive in-game items increase the respective abilities of Christopher and his ship when used\nThe digital Artbook: Enjoy 72 packed pages of original Raven's Cry artwork (PDF Format)\nAn extended version of the Official Soundtrack (MP3 Format)\nAll classic pirate songs, including Whisky in a Jar, Hanging Willie aka Drunken Sailor, La Bamba, Da-YO aka Bananaboat Song and more\nA digital Songbook including all of the Tavern songs with both the lyrics and the musical notes (PDF Format)\nExclusive WallpapersGAMEPLAYVendetta: Curse of Raven’s Cry is a third person, open world action-RPG that combines fast-paced swordplay with thrilling naval battles and exploration. Assume the role of dread pirate Christopher Raven and take your revenge on Captain Neville Scranton and the men who killed your family. Loot, sail, shoot and stab your way through myriad missions and side-quests, and explore the sprawling West Antilles by land or by sea. Hand pick your crew, upgrade your skills and your ship, and gain a reputation for either savagery or mercy, influencing how your friends and foes interact with you.  Every choice has a price, and your decisions will bring you closer to your ultimate revenge. Getting there with your soul intact is up to you.FEATURESA Brutal World: Dozens of missions and side-quests are spread across the 18th century Caribbean. From white, sandy beaches crawling with deadly wildlife to dark and stormy seas infested with pirates, the world is your battleground.\nKnow Your Enemy: Hundreds of colorful characters await you; pirate gangs, cannibals, government factions and even ferocious wildlife all stand in your way as you loot, kill and pillage your way across the stunning archipelago.\nFill Your Coffers: An extensive economic system allows you to make your fortune in a variety of ways; search for lost treasure, trade goods in local ports, gamble in taverns or head into the jungles for a hunting expedition.\nOnly the Strong Survive: Upgrade your skill tree to learn new attacks and combos and use dozens of historically accurate firearms and blades in tandem with your fearsome hook.\nScourge of the Sea: Handpick your crew and set sail. A wide variety of ships can be purchased and upgraded, and different ammunition types allow you to strategically cripple enemy ships for looting, or blast them to the bottom of the ocean.\nEvery Choice Has a Price: The notoriety system allows you to influence the world around you; earn a reputation for pure brutality as you laugh in the faces of those that come after you, or show mercy while manipulating your enemies and turning them against each other.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]}]