[{"id":52011,"name":"Amorous","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9e/c9ea6cf4907a657a86f4689a8543044d.jpg","description":"Thrust yourself to the front of the line of Amorous, a bustling furry night club that invites you to explore it's neon lights and eccentric characters. Immerse yourself with a fleshed out character creator and treat yourself to a varied cast of potential dates to explore!What makes Amorous special?Amorous is a furry dating simulator which aims to provide a high quality graphic novel experience for free. Shake up the formula with animated NPCs, sandbox environments, real choices and interactive mini-games to keep you engaged. Avoid the normal pitfalls of dating games with an incredibly varied roster. Ranging from foxes to felines, male to female and everything in-between.So what's in it for me?9 fully datable characters\nThousands of lines of dialogue with branching trees for replayability\nSeveral mini-games and novelties\nFursona Maker / Character Creator with content for all gender, body-type and personality preferences.What does the Steam version offer me?Steam Trading Cards (Coming soon)\nSteam Achievements (Coming soon)\nSteam Cloud (Coming soon)How can this be free? There must be a catch!No catch! No depleting in-game currency every time you attempt to date a character, no in-game shop prompting you to buy more parts for your character. It's all there for you to enjoy for free.\nThis game has seen many years of spare-time development, and all of it wouldn't have been possible without the support of our loyal Patrons. A free release on Steam is our way of thanking them and making sure the game will always remain available for everyone to enjoy.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Team Amorous","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":43516,"name":"Equilinox","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba0/ba0571819e460af4e536eb0854e8fb33.jpg","description":"Equilinox is a relaxing nature simulation game which allows you to create and nurture your own living ecosystems. To create an ecosystem you place plants and animals into the world, each of which has its own life-cycle, behaviour, and requirements so you need to make sure each species has a decent habitat with sufficient resources. Having healthy, happy animals in your world will earn you points, which can be spent on buying more wildlife for your world. You can also use these points to genetically modify your current species and evolve them to unlock more exotic plants and animals. You can think of it like a city-builder game, but instead of cities you're building and managing ecosystems!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Thin Matrix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":24808,"name":"Dragon Ball Z: Budokai Tenkaichi 3","genre":"Fighting","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc9/bc9943e7402b865fbe00a27208b6a5a4.jpg","description":"Dragon Ball Z: Budokai Tenkaichi 3 offers online multiplayer play, more\nthan 150 playable characters, more than 30 battle stages, and upgraded\nshading techniques providing enhanced and devastating effects.\nFurthermore, the Wii control system has been fine-tuned, allowing\nplayers to easily direct characters, mimic their favourite DBZ moves,\nand execute explosive attacks.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Spike","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":22812,"name":"Sid Meier's Alpha Centauri Planetary Pack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/887/8876838e539c9dad5e8d4c2fcc51ac2d.jpg","description":"Sid Meier's Alpha Centauri™ Planetary Pack includes the original Alpha Centauri and the expansion, Alien Crossfire.\nMankind begins its most monumental task – the colonization of space. A crew of internationally renowned scientists and security strategists, with wide-ranging convictions and diverse ethics, embarks on a mission that will change the world.\nOne Planet. Seven unique factions. Which will you lead?\nEach faction has its own agenda, each leader a final goal. You must play to each strength and exploit each hidden weakness in your quest to rule the future.Great spin-off of the legendary Civilization series, in a refreshing Sci-Fi setting\nDesign your own units. Balance their speed, power, and toughness to suit your current tactical needs\nSeven factions to chose from, each with its own artificial intelligence model that creates a very suggestive feeling that you are up against real people","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19184,"name":"Fancy Skulls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/950/9509e83e96e1e5dddb40756923d54562.jpg","description":"Fancy Skulls is a challenging first person shooter with procedural generation, permanent death and distinct art style.\nIntense and tactical combat, unique weapon mods and items that change the way you play.\nFoes different not only in visual design but also in their behavior. For example there is an enemy that will teleport every time you hit it, or enemy that leaves bombs that home on you, but you can shoot those bombs to use them against it.\nUsable items and power ups, like friendly sentry, an eye that lets you transmute items, kite that lets you fly, matchbox that ignites all foes around you, and much more!\nEach weapon is different from another, and every weapon can be modded with options that provide interesting game experiences like \"walk backwards to get ammo\", \"12 hits with no misses give you money\", \"last two bullets in a magazine do double damage\", \"don't spend ammo while in the air\", \"shoot lightning bolts with shotgun\".","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"tequibo","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18661,"name":"BlackShadows","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/920/920f289dbe6610ad92540c4b47ec098f.jpg","description":"When I wake up, a dark and eerie shape towers over me...standing still... and it moans, “Black Shadows are watching you”,  before suddenly evaporating into nothingness...\nBlackShadows is a survival horror game. You'll assume the role of a young scientist who is fighting against her most terrifying nightmare. Explore creepy rooms, keep your cool in the strangest of atmospheres, and make sure to find all the keys if you want to escape before it's too late! Are you brave enough to venture further? This is your one warning: Stay away from Black Shadows...\n\"Super game! I love the atmosphere! First game I’ve rated a 5. Great Job 😀\"\nFrom Karakins Games on Gamejolt\n\"Awesome game! the atmosphere is really amazing! 😀 5/5 Great job!\"\nFrom Poweryan on Gamejolt\n\"This is a pretty fun horror game. Batteries are key because if you run out of light you are totally boned! It adds to the tension that the flashlight dies so fast. You just have to run headlong into each and every terrifying hallway because hesitation means less flashlight power. It's well worth the $3\"\nFrom Evilpeopleinc on Desura\n\"Game looks amazing! The atmosphere is tense...I like it. Can't wait!. \"\nFrom  CrazyCahill on Steam Greenlight\nIn order to run properly the game, you'll need :\nDirectX 9.0 or later : https://www.microsoft.com/en-us/download/details.aspx?id=35\nMicrosoft Redristibuable C++ 2010 or later : https://www.microsoft.com/en-us/download/details.aspx?id=5555","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"IceGames Studios","platforms":[{"id":0,"name":"PC"}]},{"id":18015,"name":"CreaVures","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/545/545779f03062a9832945c98385f34958.jpg","description":"Take control of five cute, mystical creatures of miniature proportions called CreaVures.  CreaVures always travel in pairs, and they must use their special abilities to help each other solve interesting platforming puzzles.  Set in a world with beautiful phosphorescent colors, these tiny creatures journey to save their homeland and restore light to their dying forest.\nKey Features:Guide 5 CreaVures, two at a time, through beautiful and magical habitats & discover their unique abilities\nJump, glide, swing, roll, and bounce through 18 levels of interactive, physics-based puzzle platforming as well as epic boss battles\nUse CreaVures together to complete puzzles in different ways\nImmerse yourself in the enchanting world of CreaVures\nAtmospheric music\nLovable characters in whimsical cutscenes\nCreavures now speak 6 different languages!  English, Spanish, French, German, Italian, and Dutch","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Muse Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15648,"name":"Action Alien","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fc/5fc5c22e34d502858dfb80cdf9cdea29.jpg","description":"Jump into the action and battle your way through hordes of aliens from canyon deserts to tropical islands inside fully destructible environments !\nComplete the 3 large open world maps guided by story lines set in different places to unlock upgraded weapons and perks for achieving the maximum fire-power, or play the survival mode in 2 survival maps and try to resist against aliens for as long as possible !\nFight different species of aliens with bosses by using different tactics and weapons to defeat them in a fully destructible environment as much by the player as by the aliens.\nGrab and upgrade the 8 weapons of the game, ranging from the revolver, the tommy gun to the grenade launcher with each one having 2 levels of upgrade to increase their efficiencies. Take advantage of the perk system using credits points earned during playing to increase health, speed, jumps, melee kicks, etc...\n19 achievements to unlock, with support of Steam trading cards and Steam cloud to keep all progress available on any computer. Also playable with Xbox-like gamepads and in Ultra HD (4K).\nAction Alien was formely known as The Alien Wasteland, here is a blog post explaining the reasons of the change : http://steamcommunity.com/games/382080/announcements/detail/840296458592791633","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Devdan Games","platforms":[{"id":0,"name":"PC"}]},{"id":13307,"name":"In Verbis Virtus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/18a/18a0d46f70a8574e10f1202d786495c3.jpg","description":"Use your real voice to cast spells in In Verbis Virtus, a fantasy adventure unlike any other.\nStep into the shoes of a wizard in search of an ancient power. Explore a lost temple, making your way through forgotten chambers brimming with unspeakable beauty and terror. Unlock spells and use them to solve the temple’s enigmas and battle the monsters that lurk in its depths.\nBuilt on the Unreal Engine, lose yourself in the breathtaking world of In Verbis Virtus, possibly the most unique and immersive game you’ll play all year.\nKey Features\nCast spells in Maha’ki, the language of the gods, using your own voice.\nDiscover and learn multiple spells, each with its own purpose and power.\nSolve challenging puzzles, escape traps and battle monsters with magic.\nExplore a lost temple, uncovering the secrets of its mysterious past, as well as your own.\nExperience stunning graphics powered by the Unreal Engine.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Indomitus Games","platforms":[{"id":0,"name":"PC"}]},{"id":10044,"name":"Serious Sam VR: The First Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eba/eba0ed37667bd4f6d1e542380e761357.jpg","description":"Just UpdatedGood news, everybody. SSVR: The First Encounter is now a full release. For a complete list of changes in the latest update, please visit this thread: http://steamcommunity.com/app/552450/discussions/0/133261124637972402/\nAbout the GameSerious Sam VR: The First Encounter is a frantic arcade action FPS, featuring singleplayer and co-op campaign modes, various multiplayer modes, all presented in glorious VR with Croteam's new Serious Warp movement system.\nSee what Sam sees, feel what Sam feels, and find out what it's like to BE the legend!KEY FEATURES:\nSerious Locomotion - Explore the levels using trackpad movement (if you are brave enough), go with safer built-in teleportation system and move quickly to avoid charging enemies with the help of Sam's personal translocator device or tweak and adjust the way you move through the VR space to best suit you playing style with using our own Serious Warp (tm) locomotion.\nDouble the Gun, Double the Fun – Let go of the keyboard and gun down enemies in VR, one weapon in each hand, or dual-wield them, quadrupling your stopping power. Combine different guns or just grab two of the same, but whatever your style, remember: Mental must be stopped!\nOld School, New Engine - Hordes of enemies and non-stop action set against the expansive and visually stunning backdrop of ancient Egypt - all powered by the latest Serious Engine 2017 to create one of the most impressive VR experiences yet!\nSteam Workshop Support - where you will be able to submit your content creation or download new player-created modifications.\nSerious Sam Fusion 2017 integration - receive free updates for this game through the central hub. Oh, and play cross-platform with players of the \"flat\" version to find out what's the ultimate combo: hi-tech motion controllers or good old keyboard & mouse\nSINGLE PLAYER:\nLevels - Serious Sam is sent back through time to ancient Egypt to battle, explore and seek wisdom in 15 huge Egypt levels that also have over 80 secrets hidden and waiting to be discovered, in what is considered to be one of the most visually enjoyable VR experiences!\nWeapons - Play with a classic arsenal of 10 serious weapons including Colt, Chainsaw (!), Shotgun, Minigun and Cannon!\nEnemies -  Go head to head against various enemies, including Sirian Werebull now charging at you in VR, while hearing Beheaded Kamikaze scream somewhere near by.\nTHE Boss - Witness being VR stamped by almighty warlock giant Ugh-Zan III, who somehow managed to sneak behind you!\nDifficulty Settings - Choose between 5 difficulty settings to satisfy everyone, from FPS beginner and all the way to serious players!\nMULTIPLAYER:\nUp to 16 Players - Plunge into chaos with up to 16 players in various cooperative and versus modes, some playable in campaign levels, some in unique versus levels and some also in teams!\nClassic Co-Op - Plunge into chaos with up to 16 players in 15-level cooperative campaign mode, which is also fully customized like choosing difficulty, increasing enemies strength per player, turning on friendly fire or infinite ammo, setting respawn credits and much, much more!\nCoin-Op Co-Op - Play entire co-op campaign levels in classic 80's arcade style with limited lives!\nBeast Hunt and Team Beast Hunt - Compete against other players, or teams in Team Beast Hunt, hunting down various enemies to see who can get the best score at the end of each campaign level!\nSurvival and Team Survival - Alone or with other team members, try to stay alive as long as you can against endless enemy attacks in specially designed survival map!\nDeathmatch and Team Deathmatch - Watch all hell break loose against other players or teams in classic deathmatch style!\nMy Burden - Get highest score from collecting the points by holding the item, while others chase you to get hold of that item!\nLast Man Standing and Last Team Standing - Playing with only one life against each other, or as part of a team, try to be the last one alive!\nCapture the Flag - Grab a flag from other teams' base and bring it to your base for a score, while also defending your own flag!\nInstant Kill - One shot and you are gone!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3872,"name":"WWE 2K14","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e1a/e1aaa4fa45c9e2a907c8a109dea9ecb9.jpg","description":"FINALLY. 2K Sports' lineup of premier simulation titles expands with the company's first release in the flagship WWE videogame franchise, WWE 2K14. The most electrifying, authentic and comprehensive WWE video game experience to date has arrived. Become Immortal.\nNOTE: All multiplayer servers for WWE 2K14 will be shutdown as of 10/31/2015. After that time, all game functions requiring online servers will no longer function.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© 2005-2013 Take-Two Interactive Software and its subsidiaries. 2K, the 2K logo, and Take-Two Interactive Software are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. Developed by YUKE’S Co., Ltd. YUKE’S Co., Ltd. and its logo are trademarks and/or registered trademarks of YUKE’S Co., Ltd. All WWE programming, talent names, images, likenesses, slogans, wrestling moves, trademarks, logos and copyrights are the exclusive property of WWE and its subsidiaries. © 2013 WWE. All Rights Reserved. All other trademarks, logos and copyrights are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"2K","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":544033,"name":"hexceed","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5faf787daf5b1dd13aa4c48f972b6d92.jpg","description":"Play A modern twist on a classic puzzle game! Progress through hexes to uncover which spaces are safe and which spaces hide danger!\nRelax and be rewarded!\nNumbers show you how many dangers lie around the hexagon!\nPlay with just your mouse! Each click reveals even more information for you to progress through the level!\nMechanics Learn about the special tiles that give you knowledge in new and intriguing ways!\nLines for directions, walls for blocking, and more for you to discover!\nFind out what each mechanic gives you, as well as what it takes away!\nLogical Answers Every single tile has an answer!\nUse your own critical thinking combined with the revealed information to correctly place each and every click!\nWatch out if you click in the wrong hex!\nHours of content! 100s of levels!\nEach level has its own unique layout, bringing a fresh puzzle for you to complete!\nAs you progress you will map out the world!\nEither race to the end by collecting all the milestones, or take the scenic route to visit each and every one of the side levels along your way!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"ToastieLabs","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":450238,"name":"Project CARS 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e6/2e653aff8df0c5e28d2ad5100f93c410.jpg","description":"Get ready for Your Ultimate Driver Journey. Own, upgrade and customize hundreds of elite-brand road and race cars. Personalize your racing hero persona. And then race your way up from weekend warrior to racing legend in stunning global locations.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Slightly Mad Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":437050,"name":"Madden NFL 21","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/151/151207c420827db4645b4f675e4c2fc5.jpg","description":"A new generation is leaving its mark on the NFL. Will you rise to the occasion? Change the game, and take control of your own legacy.\n\nMadden NFL 21 delivers new features and modes including:\n\nFace of the Franchise: Rise to Fame — Rise to fame and become immortalized in Madden NFL 21 as you transcend NFL history and shape your own path to greatness.\n\nTake Control — Master innovative running enhancements and live playbooks to run up the score.\n\nX-Factor 2.0 — New X-Factor abilities, fresh out of the lab, are designed to elevate the stars of a new generation in Madden NFL 21.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":349671,"name":"Gedonia","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78d/78d8ce2a67eb3741d4974655f864e83e.jpg","description":"Gedonia is an open world roleplaying game, inspired by oldschool classics. Become a simple traveller and adventure seeker,  explore huge world of Gedonia, progress your character any way you want, discover hidden treasures and mysteries and fight vast array of enemies.\nThe vast world of Gedonia is a beautiful place with a lot of unexplored areas, and you are just a simple adventurer, who leaves home village in the search of a better life. But no matter which faction will you join, you are starting to notice strange events happening, that might bring something very bad to this world.\nComplete freedom of building a character in any way, you can be a powerful mage, strong warrior, agile assasin, charismatic leader, skillful crafter or anything in between.\nJoin different factions with their own lore, characters, stories and quests\nExplore and conquer scary and mysterious dungeons, find rare loot, defeat powerful bosses\nFind and recruit unique allies to your party\nHunt, gather, craft materials to survive in harsh wilderness\nMultiple ways to complete one quest! Use raw strength, charisma or stealth skills to complete the objectives.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Kazakov Oleg","platforms":[{"id":0,"name":"PC"}]},{"id":306139,"name":"Jump King","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d5/7d56326ef688d4159ee75f85d77e546d.jpg","description":"\"Tactical Leaping Adventure - Jump King: There is a Smoking Hot Babe at the Top!\" is a challenging climbing-platformer about the struggle upwards in search of the legendary Smoking Hot Babe! Jump along the vertical path to the top in this test of your courage and fortitude!Gameplay:The game is built on a single iconic mechanic: charge the height of each jump by holding down the button and release to leap away! But beware - once you are in the air there is no way to turn back! Though you cannot die, your progress is fragile - a single missed jump could lead to your fall and much progress lost...\nLeap through an intriguing world, meeting curious characters along the way. The hand-drawn backgrounds and distinct animations paint a rare picture, reminiscent of the old classics! The blend of retro sfx, beautiful arrangements and high definition ambiences give a peculiar atmosphere - thanks to composers/sound designers Nils Eklöf and Elias Thörnlund.\nThis game is a trial that demands skill and willpower, mastering the jump and reaching the top will test the limits of your ability! Do you think you have what it takes to defeat this game!?Features:The only way forward is up, and your only enemy is yourself!\nSimple but iconic jump-mechanic, charge each jump just right!\nOnce you leap away there is no retreat.\nTactical platformer; the obvious path is sometimes not the best...\nMysterious world with characters that you will learn to love and hate.\nThe higher you jump, the harder you fall!\nAll your progress (and each setback) is saved automatically!\nThat jump which you so easily cleared a moment ago has somehow turned into the hardest jump in the game - what are you going to do? Cry about it? You only have yourself to blame! He he he...\nClassic graphics - painstakingly hand drawn backgrounds.\nTough but addictive gameplay\nTough but addictive gameplay makes you come back for more even after you fall on your face for the 100th time!\nChallenge your friends to see who can first master this test of resolve!\nHours of nail-biting suspense await you!\nFull controller support and freely rebindable keys.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nexile","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":288699,"name":"Pumped BMX Pro","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6f/f6fb955f0ac35fca6701ba4c3a1dc5aa.jpg","description":"Ready to go Pro?\nPumped BMX Pro puts you back on the seat for another high adrenaline, fast-paced trickathon where chaining massive combos could put you at the number one spot on the global leaderboards.\nPump your way through 60 levels of ever increasing difficulty, making sure you’re racking up those platinum medals by completing Trick Challenges along the way.\nChoose from 15 riders with predesigned bikes, or get creative and design your own in the easy to use bike designer.\nPumped BMX Pro features;\n- 15 characters, each with their own spectacular bike!\n- 40+ radical tricks, from outrageous spins to insane grinds!\n- Over 200 challenges, each harder than the last!\n- 60 beautifully designed levels, from high top mountains to swampy depths!\n- Ragdoll physics, just in case you miss the ramp!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Yeah Us!","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":255897,"name":"The Horus Heresy: Legions","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/ada4b28eb7ccf70bf47a9ba4415868bc_yRJj281.jpg","description":"THE GALAXY IS BURNINGBased on the New York Times bestselling novel series, uncover the epic origins of Warhammer 40,000 in The Horus Heresy: Legions. The galaxy is in flames after Warmaster Horus turns against his father, the Emperor of Mankind. The Great Crusade to unite all of humanity has exploded into a civil war between the traitors that sided with Horus and those still loyal to the Emperor. At the heart of the conflict are the galaxy’s most fearsome weapons: the Legiones Astartes, genetically enhanced Space Marine armies, clad in the best power armor and wielding the most deadly armament from the Forge Worlds of the Mechanicum. The mighty Astartes will face each other in battle with the fate of the galaxy resting on their shoulders.THE ROAD TO TERRA IS OPENGrab your bolter, board the Thunderhawk… and play cards! The Horus Heresy: Legions will take you on an epic journey through one of the richest settings of Warhammer 40,000’s history. Play cards to field troops, execute tactics and embody the heroes and villains of The Horus Heresy. Join a Lodge and plot your way to take over the galaxy with new friends. Make history fighting in time-limited events with game-changing consequences.\nWith an ever growing collection of hundreds of cards and dozens of Warlords to lead your decks, the path to victory will always shine with new strategies to build powerful decks of unstoppable Space Marines.\nPlay in Ranked and Friendly modes with your best deck or master Sealed Deck events using cards you might not own yet. Need more practice? Duel any member of your Lodge easily, go solo against the AI, or issue a challenge to any player you know.\nAre you ready for this time of reckoning?FEATURES 45+ playable Warlords to collect, each fully voiced and with a unique set of abilities.\n600+ unique cards. Expand your card collection as new Space Marine Legions from the Warhammer 40,000 lore are added, each with a flavorful card list and strategy.\n10 Legiones Astartes and 3 neutral factions: Imperial Army, Mechanicum and Chaos. Even more Space Marine legions will join in future expansions.\nBuild a deck from your card collection and play in PvP Ranked and Friendly modes, or practice solo against AI opponents.\nRack up rewards, play with cards you don’t own yet and influence the future of the game in PvP Sealed Deck time-limited events, where two factions compete for one game-changing effect. It could be the choice of abilities for a new card, fighting for the addition of a new Warlord from your favorite Legion, or even deciding which new Legion will be featured in the next expansion!\nJoin a Lodge and coordinate with your new friends to master each event, come on top of other Lodges and collect bigger rewards. Discuss strategy and try your decks with other Lodge members.\nChallenge any player and add your friends to know when they’re online to play!\nCross-platform. Play on PC or mobile sharing your progress.CHOOSE YOUR LEGIONEach Legion has its own play style in tune with their history and key characters:\nSons of Horus: the Warmaster’s own legion, specializing in decapitating strikes against the enemy warlord.\nEmperor’s Children: pursuers of perfection, rewarded with powerful bonuses from playing perfect turns.\nDeath Guard: masters of attrition and chemical warfare, increasingly corrupted by the Chaos God of Decay to become immortal.\nWorld Eaters: war dogs that do away with the nuances of strategy in favor of fearsome charges and close combat massacres.\nIron Hands: relentless and growing stronger the longer they stay in the field, building up overwhelming momentum that tramples everything in their path.\nRaven Guard: guerrilla experts that excel at hit-and-run tactics and stealth operations, emboldened by a thirst of justice against the enemies they sentence to death.\nSalamanders: innate survivors, they can overcome punishment that would wipe out other Astartes, and then burn those who dared fight them.\nIron Warriors: tempered and dispassionate, they approach warfare with cold logic and excel in siege warfare, disregarding their own losses as long as victory is achieved.\nAlpha Legion: Secrecy is their weapon. It’s hard to tell who you’re fighting, as they all claim to be Alpharius. Watch out, they may have agents in your ranks...\nNight Lords: They come unseen and terrorize their opponents so that they can’t fight back.\nIn addition, three Neutral factions provide support for all Legions that want it:\nChaos: the Chaos Gods are aiding Horus and his allies, but the Loyalists aren’t immune to corruption. The power of chaos, however, can be fatally unwieldy.\nImperial Army: the countless men and women unable to compete against the Astartes in single combat, but who can overwhelm them with sheer numbers and ingenuity.\nMechanicum: seekers of knowledge from the Dark Age of Technology who supply weapons and vehicles, as well as aiding with their own armies and Titan Legions.\nMore Legions will come in future expansions!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Everguild","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":43432,"name":"World of Warcraft: Legion","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e61/e61f516a8a17eaa80ce484e5fd751e5b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":28312,"name":"Shadowrun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/518/518331effd6a9252c90d94fe64d55c37.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish, Japanese, Korean and Chinese. First-Person Tactical Team-Based Multiplayer Shooter","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"FASA Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":27564,"name":"Donkey Kong Country 3: Dixie Kong's Double Trouble","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89e/89e8e75cfae65a24b478e0382a841b9d.jpg","description":"Donkey Kong and Diddy Kong have gone missing! As Dixie Kong checks in\nwith the rest of the family, she gets stuck with babysitting duties! But\nthat won't stop her from going on her next adventure!\n\nPlay as Dixie Kong or Kiddy Kong solo, against a friend, or with a\nfriend! Take advantage of each of their unique abilities as they throw\neach other into action in over 40 levels. There are plenty of\ncollectibles—including Bear Coins, which grant access to the services of\nthe Brothers Bear, and Banana Birds, which Wrinkly Kong has a deep\nfondness for. You can also call on Funky Kong to build some wild\nvehicles for you to try to get to places that seem far out of reach. Not\nto mention there are animal friends to fight at your side! The final\nshowdown takes place in a cliff-top laboratory at the End of the World.\nThings could get seriously ugly, so you'd better be ready!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Rare","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"SNES"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Wii U"}]},{"id":20362,"name":"Cruel Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d89/d89daec6355e5d963ec0ea4fabfe9191.jpg","description":"Cruel Arena is a classic arena survival zombie game.\nFace endless hordes and survive as much as you can,\nThrough The Doodles and The Frames!!\nWill you do the best record among your friends?\nA few tips:\n-Press S to buy something.\n-Always, Always, Always keep yourself in movement! Learn how to move and they will never catch you!\n-WASD to move, left mouse to shoot, and right one to throw a granade!\n-P to PAUSE.\n-That's all, get ready!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"xXarabongXx","platforms":[{"id":0,"name":"PC"}]},{"id":17740,"name":"Alien Carnage / Halloween Harry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/455/4552eaf193b07df593acdbb40c102e99.jpg","description":"Earth is on the verge of a takeover by aliens intent on turning humans into mindless slave zombies, who can be used in their conquest of the universe. Harry's called into action to Space Station Liberty and given orders to penetrate the alien ship which has burrowed itself under a high-rise city.\nIn addition to the flamethrower, Harry can use weapon dispensers, giving him access to weapons like the photon cannon, guided missiles, grenades, shields, micro nukes, and the very powerful Omega bomb. It's an arsenal that will have the aliens shakin' in their slimy shoes.Features\nKill in Color: Incredible VGA graphics and animation with 256 colors and over a dozen cinematic sequences.\nGame Over, Man: Huge \"boss\" aliens in each of the four missions.\nPage Turner: A compelling and sometimes-comical narrative prior to every mission.\nArea 51: Many secrets and bonuses to discover - lots of replay value.\nSave Your Game: Games saves, cheat mode, three skill levels and more.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Interactive Binary Illusions","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17653,"name":"Garshasp: Temple of the Dragon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41a/41a600f0b32e72fd51d835de67f365a4.jpg","description":"The mighty mythological hero, Garshasp, travels into distant lands in search for the secrets hidden in the temple of the dragon, unaware of the hidden dangers and creatures awaiting him in the cursed lands.\n\nYou play as the mighty Garshasp in this hack and slash expansion pack for the original “Garshasp: The Monster Slayer” game taking place before the original story.Key featuresDeep hack and slash combat system with various combo moves\nCinematic in-game camera following the epic journey\nFantasy mythological world filled with ferocious monsters from ancient literature and Persian Mythology\nEpic environments\nMythology based story","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Dead Mage","platforms":[{"id":0,"name":"PC"}]},{"id":16831,"name":"TRI: Of Friendship and Madness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ce3/ce32109b5ccee88ad88443beee35a6a5.jpg","description":"Digital Deluxe Edition\nThe Deluxe Edition includes TRI, the Original Soundtrack and the Artbook. Files will be downloaded in your Steam folder – play through Library > Music or click 'Show In System' to view folder.\nAbout the GamePrepare for a mind-bending first-person adventure, as you enter the world of the Odd Gods and discover the magical power of the TRI! Master abilities that let you create your own path through an immersive universe full of unknown wonders.\nWith every twist of a corridor, every raised gantry over your head, every new floor of towers and dungeons in the Odd Gods’ world, TRI challenges you to think outside the box. Empowered by the TRI artifact, you place anchor points on the walls around you and conjure triangular platforms which can be climbed on, walked over and otherwise employed to negotiate the levels ahead. They’ll help you solve puzzles, reach otherwise impossible ascents, reflect light beams and even walk up walls… once you discover how to do it, that is!\nA real test of spatial awareness, TRI is a mix of first-person and puzzle gameplay that will push your mind to the absolute limit!\nGame Features\nThe Power Of TRI – Create your own path through each level by conjuring triangles out of thin air, then use them to solve puzzles scattered throughout the world of the Odd Gods.\nGo Anywhere, Everywhere – Careful planning and thought can see you go almost anywhere using the triangles; think about where you place them and hunt for the mystical fox statues that allow you to move on!\nNew Abilities – There’s always something new to learn, always a new power to be earned. Want to walk on walls? Redirect light rays? Use teleportation? It’s all waiting to be discovered!\nReplay Value – Finding your way through each of TRI’s 16 stages is taxing enough, but you can also hunt for hidden idols, beat the best time or meet fewest triangle targets, against other players on the in-game leaderboards of the Challenge Mode.\nThe hidden idols also unlock bonus content like making-of pictures and developer commentaries!\nFirst-Person Puzzling – TRI is a thinking gamer’s FPS; there’s no violence or killing, only the joy of exploration, puzzle solving and triangle conjuring. It’s a true test of skill and spatial awareness!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Rat King","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12248,"name":"Glitchspace","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/631/631b45cb83881b6aba402142a6e0590d.jpg","description":"A Reprogrammable World\nGlitchspace is about reprogramming the game to solve puzzles. Trapped in an abstract cyberspace world, your way forward uses visual programming to edit environmental geometry, whilst unlocking key programming concepts along the way. Stretch, scale, rotate, manipulate and create, explore a world of reprogrammable geometry as you discover your way home, ever distant on the horizon.Features\nA Reprogrammable World - Explore a cyberspace world of reprogrammable geometry.\nA Reprogrammable Tool - Enhance your toolbox through the functions you unlock, allowing you to craft your own programs.\nA Programming Experience - Discover key programming concepts through the puzzles you solve.\nA Brian Eno inspired score, coupled with a lifelike soundscape.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Space Budgie","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11063,"name":"Verdict Guilty - 유죄 평결","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/593/59324f4c2b9dc149f9aa6b1173b00913.jpg","description":"Verdict Guilty is a 90's style fighting game featuring unique hand and gun combat set in the dangerous city of Neo Seoul.\nNeo Seoul has been hit with a wave of terrorist and crime attacks, only a few good officers remain willing to battle this new evil. Discover the dark secrets of Neo Seoul as you fight your way to uncover the truth. Choose your side cop or criminal, as you battle your way to unmask the evil syndicate crimelord himself.\nVerdict Guilty is part of our new 'Epic value' range which retail at the competitive price of just $2.99.\nGame Features:\n- Eight unique fighters to choose from,\n- Choose to fight on the police side or as a criminal,\n- Story mode, unique for each character,\n- Easy to perform special moves,\n- 60FPs lightning fast gameplay,\n- Unique gun combat, employ machineguns, pistols and grenades,\n- Fully animated and detailed backgrounds,\n- Awesome music by Bossfight and Truong-Son Nguyen,\n- 16:10 and 16:9 widescreen support,\n- Dual controller support,\n- Steam leaderboards, trading cards and achievements,\n- Small download, works on netbooks and old pc's also,\n- Epic value,\nVerdict Guilty is now available on Steam for the low price of $2.99,\nPaul\nPaul Stephen-Davis\n@Bluestargeneral\nCeo Retro Army Ltd","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Retro Army","platforms":[{"id":0,"name":"PC"}]},{"id":8308,"name":"Potion Explosion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a43/a434df5ae5f4c5554563fd04ac7a0b45.jpeg","description":"The official adaptation of Potion Explosion, the award-winning puzzle board game.\nPlay this game solo or against players from all over the world with Solo, Online and Local Pass & Play modes!\nIn Potion Explosion, you will explode ingredients, trigger chain reactions and gather it all in your caldron. You will then use your hard-earned unicorn tears, fairy dandruff and whatnot to craft powerful mixtures with wacky effects! May the best wizard win!\nHOW TO PLAY\nAt the beginning of the game, each player is given potions to complete with specific effects and ingredients. You will have to select ingredients in the dispenser; once your selected ingredient is removed, the ingredients above will slide down. If two ingredients of the same nature collide, they explode and you get them too! You can then use your ingredients to cook up your potions. You only have a limited tank space to store remaining ingredients from one turn to another, so choose carefully! Once a potion is completed, you score points, get to use its powerful effect and pick another potion to craft. The wizard with the most points wins!\nPREPARE FOR THE POTIONS EXAM IN SOLO\nPlay against up to 3 adjustable AIs to sharpen your potion crafting skills!\nOR PROVE YOUR MASTERY IN MULTIPLAYER MODE!\nPlay against wizards from all over the world online and get to the top of the worldwide leaderboard!\nTo sum up, the game features include:\n• The magical universe of the board game, fleshed out and digitally enhanced\n• A tactical gameplay, allowing for different playstyles and strategies\n• A Solo mode against up to 3 adjustable AIs\n• An online Multiplayer Mode with a worldwide leaderboard","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Asmodee Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":6760,"name":"Bloons Monkey City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/389/3897af793af89e5d6b68abc9591ae6d5.jpg","description":"Create, upgrade, and customize your very own Bloons Monkey City in this groundbreaking blend of city building and tower defense awesomeness!\nUNIQUE SIMULATION + STRATEGY GAMING\nTake back the wilderness from the invading bloon hordes and pop your way from a modest settlement to a thriving metropolis. Attack bloon-infested territory adjacent to your city, win a short tower defense game, and add the captured territory to your city as a space on which to build. Buildings are the heart of your city, and each one has a specific purpose - individual monkey towers for battle, upgrades for those towers, farms and banks to drive your economy, power to supercharge your city, epic buildings for epic powers, and decorations to make your city more awesome. Every time you build, your city looks cooler, you increase your power potential in tower defense play, and you open up even more rewards and challenges.\nAMAZING DEPTH AND VARIETY\nAll 21 of the fully awesomized and carefully balanced Bloons TD 5 towers are available within Monkey City, with completely new unlock mechanics. More than 130 buildings and decorations give you endless strategies and city design options. Explore the wilderness to find treasure tiles and uncover 11 powerful special items like the Banana Replicator and the Dark Temple Idol. Burst bloons on 55 all new tower defense maps or test your mastery on 13 wildly challenging original special missions. Either way, be ready to encounter all new bloon waves and special bloon attack patterns like Cash Starve or Fast and Furious.\nREINFORCE YOUR FRIENDS\nConnect with Facebook and Game Center friends, then help each other win and expand. Send Supply Crates back and forth for bonus starting cash. Visit friends' cities to check out their strategies and their city design skills, and while you're there root out any bloon spies to win a reward for both you and your friend.\nSHOW OFF YOUR SKILLS\nBuild up the strongest lineup of monkey towers possible and compete with other players for the best score in weekly Contested Territory events. Use the latest in monkey science to send player vs. player bloon attacks, then see whose defenses are the strongest and earn extra rewards for victory.\nDownload for free and play Bloons Monkey City now!\nPro tip: You can move your buildings when they are not upgrading or damaged - just tap and hold then move to a free captured tile!\nPlease Note:\nBloons Monkey City is free to download and play (aside from internet, carrier, data, device, and other services for which the player is financially responsible), but some in-game items can be purchased with real money. You can turn off the payment feature by disabling in-app purchases in your device's settings, or reach us at support@ninjakiwi.com for help. City data is organized individually, so if you share multiple cities on one device through multiple Game Center or Facebook logins, do note that your IAP will only apply to the city active during purchase.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ninja Kiwi","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":678680,"name":"Despot's Game: Dystopian Battle Simulator","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/139/139bd653d9980c906497b1411b7a912f.jpg","description":"Prepare to die, humans!A group of people wake up in a strange post-apocalyptic labyrinth — naked, with no memories and with a bunch of weapons. Is this a joke, a crazy experiment, or... a game? You'll find out soon enough, just try not to die first!\nGet your pretzels readyYour puny squad is capable of much more. Choose your loot and transform the squishy humans into wizards, cultists, ninjas and dozens of other heroes, including the mythical stale pretzel throwers. With perks and class combos, there are thousands of ways to build your army. The man-eating cabbage will appreciate the variety in its diet!\nCrush your rivalsIf you can survive the labyrinth, you'll meet THE UNSTOPPABLE END-GAME BUILDS OF OTHER PLAYERS! You'll beat each other to death and only one will be spared by d'Spot. No offense, but in his own game he writes the rules!\nIndirect combatPrepare your warriors and let them fight it out on their own! Indirect combat allows you to focus heavily on tactical considerations rather than reflexes. Strengthen your front line with fridge-movers, aim your food-throwers and look after your Forbidden Summoners!\nEndless exploration The dungeons are generated from scratch every time, and there is no chance puny humans will ever find the way out! And even if they strike lucky — don't worry, there are endless ways to die in Despot's Game!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Konfa Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":407553,"name":"Wasteland Remastered","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bee/beee405ab29d38db7cc6064e4dafbbaa.jpg","description":"The RPG classic rises from the nuclear ashes on February 25 for Windows (Steam, Windows Store, GOG) and Xbox One—also available with Xbox Game Pass on Xbox One and PC.\n\n \n\nWasteland Remastered is an overhaul of the 1988 title that brought the post-apocalypse to video games. The Remastered title brings new graphics, audio, music, and digitizes the physical paragraphs book from the original with brand new artwork.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"InXile Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":398416,"name":"Surgeon Simulator 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d80/d80d9a16e44937b66ab725735537e2ef.jpg","description":"It’s a good day to save lives, but you can’t save them all alone. Now with the help of other ‘skilled’ surgeons, break the boring order of mundane medicine and embrace the chaos only a bunch of inept people can create together. Malpractice makes perfect!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":262507,"name":"Volcanoids","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b25/b25617184d627b0ac2267426edbe5d67.jpg","description":"Set in the steampunk era, you take on an expedition to a forsaken island that you once called home. But sudden eruptions triggered by a mechanical race of beings turned the wondrous place into an apocalyptic wasteland. In order to survive the island’s natural elements, you have to outsmart these creatures and capture one of their drillships. Use their own technology against them as you upgrade the machinery and reclaim your homeland.\nTake the vantage point, stay safe underground or choose a material-rich location and explore. The drillship is one of a kind base capable of joining you on every journey.\nExperience the tension and thrill of surviving volcanic eruptions. Time between each eruption is your most valuable resource. Use it to roam the island gathering materials, finding new technology and utilizing production.\nDeal with a hostile race of robots that use the volcano as a source of energy. Their units are scattered all around the island’s surface as well as below it.\nCustomize your drillship from the inside out with colors, symbols, gadgets and more. Automate production, research technologies, set up defenses and turn the drillship into an unbreachable powerhouse.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Volcanoid","platforms":[{"id":0,"name":"PC"}]},{"id":61200,"name":"Midnight Ghost Hunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63c/63c4a015b210150afdeab74844cda4af.jpg","description":"MIDNIGHT GHOST HUNT IS A MULTIPLAYER HIDE AND SEEK GAME THAT PITS A TEAM OF GHOSTS AGAINST A TEAM OF GHOST HUNTERS.\nGhost players have the ability to transform into household furniture and hide in plain sight.\nAt the stroke of Midnight, the Hunt begins! The Ghosts must survive until the time runs out.\nThe Ghosts may also attempt to gather Ectoplasm and sabotage the Ghost Hunter’s energy source to force an early victory, although this is risky.\nThe team of Ghost Hunters must work together to protect the energy source and eliminate all hidden Ghosts in the area before the time runs out.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mellowsoft","platforms":[{"id":0,"name":"PC"}]},{"id":61111,"name":"Meeple Station","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dc5/dc55bcfa9cafd4f0d3526050a823158f.jpg","description":"Meeple Station is a cooperative Space station Simulation game. Strongly inspired by Dwarf Fortress and Rimworld (with a hint of Space Station 13). Where the complexity of a simulation game blends with the friendly and satisfying nature of a Real-Time-Strategy game.\nMeeple are simple creatures. They're not human, nor are they incredibly intelligent. They're a race of space fairing creatures who enjoy industry, work, and exploration. But they need a lot of guidance, YOUR guidance, in fact.Unique Meeple RolesThey come in various shapes, sizes and colours. And each Meeple has their own role, so you'll need to recruit the ones best suited for the jobs you need. Miners, engineers, refiners, janitors, guards or lab workers, there are plenty of jobs to be done.\n\nMeeple are very fragile creatures, and if not taken care of properly, can be prone to any number of possible fatalities. If you're not careful, they could easily fall victim to starvation, suffocation, implosion, explosion, decapitation, electrification, incineration or just unlucky enough to get sucked out of an airlock or gobbled up by an alien.\nBuild it your way! There is a wide range of paraphernalia for a space station. From simple furniture, like bedding and seating, to complex machinery, life support and power grids. You choose where and how to build it all, and your Meeple will have to adjust to your changes.\n\nYou will also be responsible for rigging up the main power grid, making sure everything is plugged in, and that you are creating enough power to keep everything alive!\nYou don't control individual Meeple, your job is to give them orders and create designations. They will always do their best to follow through on the jobs you create, unless of course they're being pursued by a giant electric man-eating space squid... although they may still attempt it.\n\nSpace is a dangerous place, putting aside natural disasters, solar flares and stray meteors, you also need to worry about pirates!\nMeeple pirates are bent on destruction, they simply want nothing more than annihilation of everything non-pirate. That includes you and your Meeple!\nIf there are pirates near your station, they wont be able to resist the chance to create havoc. Defend yourself with trained Meeple, and combat turrets, otherwise your station will soon be a floating assortment of scrap.\n\nA bustling station will bring in a lot of trade and commerce, traders will fly in from all over the quadrant to dock at your station. Which is fortunately very lucrative for you!\nThere are also plenty of resources just floating around. You can order your mining crew to get out there and salvage it. You can then refine the minerals you collect to construct and develop new components for your station.\nUndertake a campaign, building difficult stations and meet pressing deadlines. Or sit back, relax and run your own little station, at your own pace, moving around the quadrant, exploring nearby planets and being a centre for trade and commerce.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Vox Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":53196,"name":"Bomberman (1983)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/797/797791e8fe14e5af187d2cdd401c6da9.jpg","description":"Bomberman (ボンバーマン, Bonbāman, also known as Dyna Blaster in Europe) is a strategic, maze-based video game franchise originally developed by Hudson Soft and currently owned by Konami. The original game was published in 1983 and new games have been published at irregular intervals ever since. Today, Bomberman has featured in over 70 different games on numerous platforms (including all Nintendo platforms save for the 3DS and Wii U. One was planned for the 3DS, but was later cancelled), as well as several anime and manga. This franchise is one of the most commercially successful of all time. At the Nintendo Switch Presentation on January 13, 2017, Super Bomberman R was announced as a Nintendo Switch launch title.","review":"","timePlayed":0.0,"releaseYear":1983,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"NES"},{"id":0,"name":"PC"}]},{"id":49417,"name":"Wytchwood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/058/058544caa3abdd324b09c5a8bec1f899.jpg","description":"Wytchwood is a crafting adventure game set in an expressive land of gothic fables and fairytales. As the mysterious old witch of the woods, you will explore a strange countryside, collect magical ingredients, brew sorcerous enchantments, and pass your twisted judgement upon a capricious cast of characters and creatures.\nAfter all, how will they ever learn if you don’t teach them the moral of the story?\nLovingly rendered storybook art style\nGather, collect, grow and craft bizarre ingredients: Toxic toadstools, eye of newt and bottled fear.\nResearch and concoct devious spells and sorceries. Turn the greedy into frogs! Trick the wicked with cunning curses!\nExplore an allegorical world of tall tales, uncovering colourful personas and fantastical narratives.\nUse your wit and guile to solve puzzles and best the strange monsters of the forest.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Alientrap","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":21040,"name":"Alpha Kimori 1","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d8/2d8bdf3d2ba834fd6a725ba0f1dd65c3.jpg","description":"Alpha Kimori™ Great Doubt™ Episode One is the first of a trilogy of bright and colorful Japanese Anime inspired story-driven episodic 2D Role Playing Games, which feature an intricate action-adventure epic story with a delightful mix of sci-fi and fantasy elements.\nThe story of Alpha Kimori™ is set 50 years after the alien invasion of Earth when the newly discovered planet Kimori plays host to two warring human factions – the Bidarians, who want to reclaim Earth, and the Jinrians, who are contented with their new home. Even as the Bidarians destroy with their mighty Robotic Intelligent Cybernetic Armor (RICA) technology, the Jinrians defend the planet with the ability transmute into colossal indigenous creatures. Amidst the turmoil, young Bidarian warrior, Rick, falls in love with Jinrian princess, Yuki.\nPlease download the free demo at http://www.AlphaKimori.com\nThank you to our supporters on Steam Greenlight for getting Alpha Kimori™ greenlit at http://steamcommunity.com/sharedfiles/filedetails/?id=93036357!\nWant to win a free copy of Alpha Kimori™ 1 on Steam? Post your best Alpha Kimori™ fan art or other creative content at http://www.Facebook.com/AlphaKimori. If it is featured at http://www.AlphaKimori.com/forum, you will receive a free Alpha Kimori™ 1 Steam Key!\nFeatures:\n1) Cute Japanese anime inspired graphics with full sprite battle animation.\n2) Engaging sci-fi-fantasy love triangle interactive novel storyline with lots of twists and turns.\n3) Life bars and escape option during combat.\n4) Classic Japanese RPG Turn Based Battle gives players time for strategy.\n5) Ki Skill animation and battle elemental special effects.\n6) Four visible party members and switchable lead character.\n7) Avoidable combat with visible enemies.\n8) Player is never lost with quest journal.\n9) Theme song sung by the popular Vocaloid character, Hatsune Miku ( composed by Yossy http://www.Studio-Misty.com ).\n10) 5 hours of average gameplay time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sherman3D","platforms":[{"id":0,"name":"PC"}]},{"id":20855,"name":"IGT Slots Paradise Garden","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/93d/93d9aad4d01349853d9190c21709b116.jpg","description":"The Ultimate Collection of IGT® World Famous Slots!\nReel in the fun with IGT® Slots Paradise Garden™. A brand new slots collection from the world’s leading slot machine manufacturer.\nEnjoy the heart-racing thrill of true casino excitement on your PC/Mac. Try your hand at 15 slots that bring real life sights and sounds into your own home, including: Paradise Garden, Gold Bar 7s, 100 Wolves, Dakota Thunder, Desert Spirit, Eskimo Money, Fire Rubies, Fish in a Barrel.\nPlay a whole new kind of slots game with winning results. Enjoy cutting-edge, new features that bring slots to life like never before:\nSingle-line or multi-line wagers: Play up to 100 lines\nEight wager amounts: 1¢, 5¢, 10¢, 25¢, 50¢, $1, $5, $10\nTwo modes of play: Career and Free Play\nAchievement levels during gameplay\nTake in the sights and sounds of two brand new casinos•View both the top and bottom of the slot machines either up close or further back\nEnd2End™ Action and Bonus Free Games\nMultiwayXtra™ feature adds 1,024 ways to win\nAll video bonus machines include fun and interactive features and rounds\nYou'll reel in a fortune of fun with IGT® Slots Paradise Garden™. Go wild and win your way to high roller status!\nPractice in the Free Play casino\nBuild your bankroll\nBecome a high roller in Career mode\nWhich machines are lucky for you? Use the detailed player stats to find out:\nYour Largest Single Win\nYour Favorite Machine\nNumber of Bonuses Played\nYour Longest Win Streak\nNumber of Winning Spins","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fugazo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20593,"name":"World of Soccer online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/238/2380e1c17768a033cd27beb5e6da2f43.jpg","description":"World of Soccer online is a multiplayer online football game.\nUnlike other similar football games, the user controls a single player instead of an entire team.\nYou can join different teams and compete in matches against other teams and in league or you can just have a practice match online.\nKEY FEATURES:\n-Online multiplayer football\n-Control just one player\n-Fast paced arcade football\n-Create or join to team\n-Compete in league","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Johannes Eski","platforms":[{"id":0,"name":"PC"}]}]