[{"id":5678,"name":"The Elder Scrolls IV: Oblivion","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/615/61503312a95d451198d80d9bae275f79.jpg","description":"The Elder Scrolls IV: Oblivion is an action RPG, a part of The Elder Scrolls series, which follows TES: Morrowind and proceeds TES: Skyrim. You take on the role of a hero that needs to stop an ancient cult from opening gates in the demon world called Oblivion. Your character is completely customizable: the game features multiple human and anthropomorphic races to choose from, different skills you can obtain and develop and abilities to improve through the game. The specification of skills you choose will affect your playthrough: the character can be more efficient in melee combat or magical abilities as well as stealthy complete some quests.\r\nThe game is set in an open world, so it's up to you whether to follow the storyline or focus on numerous side quests. You can explore the world of Oblivion freely on foot or use the fast travel system that allows moving instantly to every visited location. The game doesn't stop after completing the main story and lets you explore the world as long as you want.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":4571,"name":"Dungeon Defenders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/321/3213f56333ca5e92a620f41bd3365637.jpg","description":"Dungeon Defenders is a multiplayer Tower Defence/Action RPG hybrid game developed by Trendy Entertainment.\n\nOnce upon a time, a battle with the forces of evil came to Etheria. Titans known as the Old Ones were defeated with their power being locked away inside Eternia Crystals. Bored apprentices decide to play with the Crystals and unleash the evil forces once again.\n\nThe game currently has 12 different classes to choose from. Each class has a unique playstyle. For example, the Adept is a good tower character while the Countess is a tank.\n\nThe players have to fight off the hordes of enemies. In order to do it, the players have to build up defenses which are different for each class. Players can also upgrade their equipment and get new weapons and armor. It is also possible to summon a personal pet which grants a buff to characters abilities and can repair the defenses.\n\nEvery game mode is playable in both multiplayer and singleplayer, yet some events are online-only.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Trendy Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"}]},{"id":11214,"name":"Northgard","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/725/725d08c4174c129ce5275c43cd0347c6.jpg","description":"After years of tireless explorations, brave Vikings have discovered a new land filled with mystery, danger and riches: Northgard.\nThe boldest Northmen have set sail to explore and conquer these new shores, bring fame to their Clan and write history through conquest, trading, or devotion to the Gods.\nThat is, if they can survive the dire wolves and undead warriors roaming the land, befriend or defeat the giants, and survive the harshest winters ever witnessed in the North.\nBuild your settlement on the newly discovered continent of Northgard\nAssign your vikings to various jobs (Farmer, Warrior, Sailor, Loremaster...)\nManage your resources carefully and survive harsh winters and vicious foes\nExpand and discover new territory with unique strategic opportunities\nAchieve different victory conditions (Conquest, Fame, Lore, Trading...)\nPlay against your friends or against an AI with different difficulty levels and personalities","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":9831,"name":"Conan Exiles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c9e/c9e47fd222f631084879d395eee07d66.jpg","description":"Now includes THE FROZEN NORTH expansion update\nFar to the north, a vast new land has been discovered. A cold and rugged landscape where snow-capped mountains and dark, haunted forests stretch as far as the eye can see. Here, between the desperate howls of wolves and thundering footsteps of Frost Giants, the beating of kettle-drums can be heard as savage tribes of northmen worship Ymir, their Lord of Storm and War.\nNow you must journey beyond the burning sands of the Exiled Lands and survive, build, and dominate in this cold new world full of danger and opportunity.\nThe Frozen North is a huge, new expansion update freely available to all Conan Exiles players on both PC and Xbox One. It ushers in the second stage of the Conan Exiles Early Access adventure, introducing an entirely new environment to explore, new features, and many new improvements to core aspects of the game. Conan Exiles is now bigger and better than ever before!\nThe Frozen North features:A HUGE, NEW LANDThe world of Conan Exiles is now 70% bigger! Climb towering mountains, explore deep forests, fight your way through massive new dungeons, and discover new people, cultures, and settlements.WEATHER AND TEMPERATUREIn the north, rain and snow can make you freeze to death and in the desert, the burning sun can be equally deadly. Make sure you dress for the weather to stay cool or warm. Camp fires, torches, drinks, and more can also help you control your temperature.NEW BUILDINGS AND RESOURCESHarvest new resources such as star metal, black ice, and more. Build new homes and entire cities with all new building pieces and furniture, and make sure to use the right materials to either keep your home warm or cool.NEW RELIGION AND AVATARDedicate your work and worship to Ymir, the Lord of Storm and War. Summon his avatar and use his giant battle-axe to crush your enemies!NEW ENEMIESEncounter towering Frost Giants, hungry wolves, aggressive mammoths, and many other new enemies. You must also go head to head against new dungeon bosses such as Tyros the Deathbringer.BREWING AND COOKINGThese two new crafting systems lets you brew different drinks and cook up a variety of juicy meals. Make mead, wine, absinth, bug soup, demon blood sausage, and more. You can even trap fish and practice beekeeping!BETTER THAN EVERThe expansion update brings with it a host of improvements such as better combat, better artificial intelligence on human enemies, and more. This is in addition to the 28 updates worth of additions rolled out over the past six months including climbing, siege equipment, avatar defenses, dying system, and much more!NEW ARMOR AND WEAPONSFind and craft three new material types: Star Metal, Black Ice, and Hardened Steel. Equip many new kinds of equipment, including the Vanir Fur Armor that will protect you from both cold temperatures and enemy strikes!\nAbout the Game\nConan Exiles is receiving frequent updates with new content and improvements during Early Access. Check out the update overview here.\nYou are an exile, outcast and downtrodden, sentenced to walk in a barbaric wasteland where the weak are crushed and only the strong can live. Here you must fight to survive, build, and dominate the world alone on your own server, or with enemies and allies in online multiplayer.\nJourney through a vast, seamless world filled with the ruins of ancient civilizations and uncover its dark history and buried secrets as you seek to conquer and dominate the exiled lands yourself. Start with nothing but your bare hands and forge the legacy of your clan, from simple tools and weapons to gigantic fortresses and entire cities. Enslave the bandits of the exiled lands to do your bidding by breaking them on the grueling Wheel of Pain. Sacrifice the beating hearts of your enemies on the blood-soiled altars of your god to seize true power and glory. Summon the colossal avatar of your god and see them lay waste to your enemies and their homes.\nJust remember: in this brutal land of vengeful gods, bloodthirsty cannibals, and vicious monsters, survival is more than tracking down food and water. Explore mysterious ruins in search of treasure and knowledge, but beware the risk of your mind being corrupted by the dark forces of the world. Traverse vast sand dunes and seek shelter from scouring sandstorms sweeping across the burning sands. March into war against your enemies and unleash your savage fury in brutal combat. Go in unprepared and it will be your head rolling and limbs flying.\nConan Exiles is not an empty sandbox. It is a world rich in history where you must discover the knowledge and secrets of ancient civilizations as you struggle to build your own.SURVIVE THE BARBARIC WASTELAND\nIn the world of Conan the Barbarian, survival is more than being well-fed and hydrated. Here you must weather scouring sandstorms, save your mind from being corrupted and going insane, and fight vicious monsters from the darkest holes of the earth.BUILD YOUR LEGACY IN A VAST, SEAMLESS WORLD\nJourney through a huge, seamless world filled with danger and opportunity, exploring everything from sand dunes to towering ruins. Harvest resources to craft tools and weapons, then build everything from a small settlement to entire cities.DISCOVER THE DARK HISTORY OF ANCIENT CIVILIZATIONS\nExplore shadow-haunted ruins of ancient civilizations and discover great treasures and knowledge. Learn about the people who inhabited this world before and what led to their demise through inscriptions, wandering NPCs, and the environment itself.CALL UPON THE POWER OF THE GODS\nCut out the hearts of your enemies and sacrifice it upon the altars of your god to earn their blessing. Summon and take direct control of huge, towering avatars and wreak havoc on your enemies as you crush their homes and drive them from their lands.DEFEND YOUR LAND WITH AN ARMY OF SLAVES\nEnslave the criminals of the exiled lands and force them to join your cause and defend your territory. Put them through the grueling Wheel of Pain to break their will, then turn them into archers, crafters, entertainers, and more. Find rare thralls for the greatest rewards!DOMINATE YOUR ENEMIES\nMarch forth to war against your enemies, use explosives and see their fortifications crumble to dust, then unleash your savage fury with brutal attacks that will see heads rolling and limbs flying. Find or craft a wide range of weapons and armor.PLAY TOGETHER OR ALONE\nPlay alone locally or fight for survival and dominance in persistent multiplayer on public servers. You can also host your own server and invite others to join you in a world where you have full control of the rules and settings. Want to play with just handful of friends? Try co-op mode!CONTROL YOUR EXPERIENCE\nWhen playing alone locally or on a server you are the administrator of you have access to a range of in-game tools. These allow you to change progression speed, spawn monsters, turn yourself invisible, deactivate avatars, and much more. Be the dungeon master of your own server!PLAY WITH MODS\nDownload Conan Exiles mods directly from the Steam workshop to customize your game experience. You can also download the custom Conan Exiles Unreal Editor and start creating your own!\nConan Exiles Twitter: https://twitter.com/conanexiles\nConan Exiles Facebook: https://www.facebook.com/ConanExiles/\nConan Exiles Reddit: https://www.reddit.com/r/ConanExiles/\nOfficial website: http://www.conanexiles.com","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Funcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":59197,"name":"F1 2018","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1c/a1cea552040aecf9414548e209f9c0d8.jpg","description":"F1® 2018 HEADLINE EDITION Buy F1® 2018 HEADLINE EDITION to get F1® 2018 and the F1® 2018 ‘HEADLINE CONTENT DLC PACK’\nAbout the Game MAKE HEADLINES in F1® 2018.\nF1® 2018 is the official videogame of the 2018 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Become immersed in the world of Formula 1® more than ever before. Build your reputation both on and off the track, with time-pressured media interviews that influence your F1 career path. Do you exhibit sportsmanship or showmanship? Will you develop your team to the top or send your agent to target a rival team and driver? F1 2018 puts you in control of your destiny.\no More classic F1 cars than ever before\no Stunning graphics and new circuits for 2018: Paul Ricard and Hockenheim","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Codemasters","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":16543,"name":"LEGO Batman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9f7/9f750cb69a31a42648f45e3681abed3a.jpg","description":"LEGO Batman: The Videogame is a part in the series of LEGO adaptations of popular franchises. It is based on DC Universe and follows its famous superhero, Batman. It was the first LEGO game to be based on an original plot rather than being an adaptation of an existing story.\n\n###Plot\nThe game is set in Gotham City. A group of supervillains once again escaped the ever unreliable Arkham Asylum. They formed three separate gangs led by Batman’s arch-enemies Joker, Riddler, and Penguin, respectively. Each gang has a chapter of the game dedicated to it. Riddler’s plan is to rob Gotham's gold reserves. Penguin is going to use his robotic minions to conquer Gotham. Joker wants to poison the whole city with his laughing gas. Batman and Robin have to disrupt the villains’ plans.\n\n###Gameplay\nThe game is divided into the heroes’ and villains’ missions. In the heroes’ missions, you play as Batman or his aides Robin, Batgirl, and Nightwing, while the playable villains change over the course of the game. Between missions, the characters reside in their respective hubs, Batcave and Arkham Asylum. Each character has his or her unique abilities, such as special weapons, double jumps, mind control or immunity to certain attacks. The player can also change the suits of the characters to use their specific effects. For example, a Glide suit allows Batman to fly short distances, while Robin can use Magnet suit to climb metal surfaces. Since it’s a LEGO game, the player will also have to build certain constructions from LEGO bricks.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Traveller's Tales","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox One"}]},{"id":3863,"name":"How to Survive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73a/73a2c7af85d51bbdb20516bf2128fd7d.jpg","description":"How to Survive is survival horror action role-playing with a top-down perspective. The players gain control over the three survivors who, after the shipwreck, were trapped on the archipelago full of zombies. Three main characters are representing three different ways to play the game: Kenji is the most balanced handyman, incredibly fast Abbie and fighter Jack.\n\nIn the game, two game modes: story campaign and challenge mode, you can both go with a company of two friends. The essence of the Challenge mode is that the heroes need to get to the opposite part of the island, where they are waiting for the boat. \n\nTo survive the calamity, players need to collect materials and craft weapons - do everything to survive on a hostile island. As the hero level ups, new skills will be available. Players are not limited in time and can perform all tasks at their own pace. For an additional difficulty, the game has Ironman mode.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":295019,"name":"GreedFall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c68/c6842e7b1e4a8c5fdff79504b7284e49.jpg","description":"GreedFall is the latest RPG from Spiders, currently in development for PlayStation 4, Xbox One and PC. Set in a 17th century setting embedded in magic, Greedfall has a unique visual identity inspired by European Baroque art, depicting grandiose sceneries in muted warm colors and dark undertones.\r\n\r\nExplore a fresh new world as – along with many other settlers, mercenaries and treasure hunters - you set foot on a remote island seeping with magic, rumored to be filled with riches and lost secrets. A grand journey filled with mystery follows, as you find yourself in the middle of ever-increasing tensions between the invading settlers and the locals, who are protected by manifestations of the island’s earthly magic in the form of supernatural beings.\r\n\r\nWith a strong focus on its core RPG identity, GreedFall follows Spider's experience in building intricate worlds filled with mysteries to discover, weaving deep character interactions, and offering players freedom to achieve quests and objectives in many different ways – through combat, as well as diplomacy, deception or stealth. The island of GreedFall is a living, ever-evolving world. Your actions, from seemingly trivial choices to the most important political decisions, will influence and alter its course, as well as the relationship between the different factions established on the island.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Spiders","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":22790,"name":"Serious Sam: The Second Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/68e/68e7d64c8b37ae0de3616aca74cc4bba.jpg","description":"Serious Sam: The Second Encounter is the second and last episode of well-known video game Serious Sam. It starts right there where The First Encounter ended. Sam is going to Sirius with SSS Centerprice starship but Crotem crate-but accidentally hits Centerprice and it falls down to Earth, in Central Amerika in the Mayan age. Lucky Sam, the Sirians left a starship on Earth in case SSS Centerprice couldn’t make it. Not so good news - that this back-up starship is located in a different era and time, so Sam has to go through various portals in order to reach this starship. He travels through Mesopotamia, Mesoamerica and Medieval Europe. During this journey, Sam fights two Mental’s (who is the main antagonist of the game) portal guardians: Mayan spirit called Kukulkan and the Wind God Exotech Larva. At the end of the game in front of the Cathedral of Sacred Blood Sam fights Mordekai the Summoner which is the last obstacle to reach the Holy Grail. \nThe Second Encounter has not only new locations compared to the first game, but also adds new weapons and new monsters to shoot.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Croteam","platforms":[{"id":0,"name":"PC"}]},{"id":17179,"name":"Resident Evil 0 / Biohazard 0 HD REMASTER","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/955/9554440f1c17236c0233b644e47909d2.jpg","description":"Buzz\nAbout the GameBe prepared to relive the first nightmare in Resident Evil 0, a remastered version of the popular prequel to the original Resident Evil game. This remastered version takes the fear-inducing atmosphere from the original 2002 release and transforms it with stunning new HD visuals, improved sound, widescreen support and an optional modernized control system and more. It’s the best way to experience the story of what really happened before the iconic mansion incident that was the catalyst for the entire Resident Evil saga.\nThe story of Resident Evil 0 takes players back to 1998. Reports have been mounting about unusual murders on the outskirts of Raccoon City. The city’s Special Forces division, S.T.A.R.S., sends their Bravo Team - including rookie cop member Rebecca Chambers - to investigate. On route, the team’s helicopter suffers engine trouble and is forced to make a crash landing, where they find an overturned prisoner transport vehicle. Splitting up to search the area, Rebecca discovers the Ecliptic Express, a train stopped dead on the tracks. Inside, she meets death row convict and ex-Navy lieutenant Billy Coen. Throughout the game, you will take control of both Rebecca and Billy, at times switching between both characters in order to proceed. Learning the advantages of each character is the key to solving puzzles and surviving the nightmares that lie ahead.FeaturesReturn to the series origins – Discover the truth behind what led to the horrors at the Mansion in Resident Evil in this fan-favorite and popular prequel title to the series.\nCompletely enhanced visuals – New high-resolution textures have been created from scratch, including 1080p support on next-gen consoles, while still preserving the classic appearance of the original release.\nFully remastered sound effects – 5.1 surround support provides a more experiential gaming atmosphere that best matches players’ listening environments.\nExperience the horror in the classic 4:3 ratio or newly added 16:9 widescreen mode.\nPlay with the classic control scheme, or enjoy a new alternative scheme where the character moves in the direction of an analogue stick.\nFan-favorite Resident Evil characters – Rookie S.T.A.R.S. member Rebecca Chambers and wanted criminal Billy Coen combine skills and buddy up to survive the undead and infected nightmares that await them.\nWesker Mode - After completing the main storyline, you will be able to take control of series antagonist Albert Wesker, and use his superhuman abilities to power through the missions.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":693,"name":"The Last Guardian","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/276/2769b1982cd132a60c69dc5d574445fa.jpg","description":"The Last Guardian is a brainchild of Fumito Ueda, who also created Shadow of the Colossus. The game spent almost a decade in development before it was complete. The Last Guardian is defined by its spectacular mountain landscapes, eerie music, and a heartwarming mood.\nThe main protagonist is a nameless boy, who is kept as a prisoner in cyclopean castle ruins and has to escape. While in captivity, the boy’s first task is to befriends his cellmate, a fantasy creature named Trico, who is a gigantic half-bird, half-cat hybrid that slightly reminds a hippogriff. Trico is the second main character and the mascot of The Last Guardian; the creature’s animation is incredibly detailed, and its behavior is modeled after real animals. The two form an unlikely symbiosis. The boy needs the creature’s strength and ability to fly to overcome obstacles and fend off guards who try to bring the characters back to their cells. Trico, in turn, needs the boy’s wits and agility to sneak, solve puzzles, feed the creature and heal its wounds. The player only controls the boy, while Trico needs to be manipulated into performing certain actions. Over time, the characters develop a strong emotional bond that adds to the game’s impact on the player.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SIE Japan Studio","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":966,"name":"Sonic & All-Stars Racing Transformed","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c1/0c1c9965ba59166ab986a663ab2252dc.jpg","description":"Sonic and the All-Stars cast line up on the starting grid once again to battle for supremacy in the ultimate race. Compete across land, water and air in incredible transforming vehicles that change from cars to boats to planes mid-race.  It’s Not Just Racing.  It’s Racing Transformed!Key Features:Play as over 20 legendary All-Stars each with their own transforming vehicle.\nRace across 25 tracks and arenas.\nWorld Tour, Grand Prix, Battle Arenas, and more.\nUnleash ingenious weapons or utilise your character’s unique All-Star Move.\n4 Player split screen and up to 10 player online events.  Plus even take split screen gaming online.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sumo Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":11887,"name":"Hero Siege","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71c/71c015df012029897e87ac00b7a8de4c.jpg","description":"Hero Siege is a Hack 'n' Slash game with roguelike- & RPG elements. Annihilate hordes of enemies, grow your talent tree, grind better loot and explore up to 7 Acts enhanced with beautiful Pixel Art graphics! This game offers countless hours of gameplay and up to 4 player online multiplayer!\nWe developers are interested in your feedback. So if you choose to get the game see you on the forums! - Vexorian\nIn the depths of Tarethiel a group of monks united the four pieces of the brimstone talisman, waking up the slendering demons below... The Act was fortold in the Ancient Book of Revelations and that Satan would raise from Hell to rule the earth... Someone needs to stop him or else the mankind will soon face extinction!\n- ONLINE MULTIPLAYER with up to 4 players!\n- Randomly generated levels, items, dungeons, bosses, secrets and events. Every game session you play is different!\n- Over 170 unique crafted items that are either passive, usable or orbiting.\n- Over 80 different enemies with the possibility to spawn as rare or elite with extra hp/damage and abilities, but dropping better loot and giving more exp!\n- Over 30 Achievements to unlock!\n- Customize your character with over 60 different hats!\n- 4 Acts to play through! Extra acts come with Expansion sets!\n- Random Dungeons and Crypts to explore and clear from loot and enemies!\n- 7 playable classes! Extra classes come with Expansion sets!\n- 6 different difficulty levels to unlock!\n- Tons of random! Start discovering all the wonderful secrets and content!\n- Loot system with: normal, superior, rare, legendary, mythic and satanic loot!\nHero Siege has full controller support!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Elias Viglione","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3400,"name":"Battlefield Hardline","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d2b/d2b33b26e0d61aca35d434c8a69e3711.jpg","description":"Sometimes in order to be fresh, famous video game series take another path and tell a different story. Battlefield Hardline also tried to refresh series and instead on focusing on military warfare, Hardline is about crime, heist ant policing elements. The game takes place in the streets of Los Angeles and there are two main factions in the game - Special Response Units of police and criminals. As in the other Battlefield games, players have an option to use various vehicles and weapons. As in Battlefield 4, Hardline uses the “Levolution” mechanic, which lets players completely destroy various buildings, and this mechanic is almost in every mission of Battlefield: Hardline. There are also new game modes, including Heist, Rescue, Hotwire, Blood Money and Crosshair. \r\nBattlefield: Hardline is the last game made by Visceral Games. It was promised prior to the release of the game that the main single-player campaign will not be linear – it features episodic crime dramas, where players have to choose how they want the story to go.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":965,"name":"Sherlock Holmes: The Devil's Daughter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8c3/8c33e956567aae5cfa839e8b4bb1fb39.jpg","description":"Sherlock Holmes: The Devil's Daughter is a detective game created by Frogwares. It is the direct continuation of Sherlock Holmes: Crimes and Punishments - another game made by the same studio and is the eighth part of a  series.\n\n###Plot\nFive cases are present in the game. These cases are detective stories, that are linked with each other and continue the stories of the previous Sherlock Holmes games. The game follows Sherlock Holmes and his companion, Doctor Watson, and their daily lives solving the mysterious crimes.\n\nThere are five different, yet interconnected, criminal cases are available for the players to investigate and solve. Some of these cases continue the story of the previous games.\n\n###Gameplay\nThe game's gameplay is mostly the same as the same as the previous game, Crimes & Punishments. The game takes the players at the crime scenes, where one examines it, finds clues while using several helping items, such as a magnifying glass, talks to witnesses and suspects, interrogates other characters and interacts with items. There is a mini-game which resembles Holmes' deductive method, which helps the players make an assumption. \n\nThe players can now inspect any character they meet in-game and analyze their look. This is used to create a psychological portrait of the encountered character.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Frogwares","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":13199,"name":"Graveyard Keeper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/066/066eb1b7a3f332b8089645fbf8c3ebdc.jpg","description":"Graveyard Keeper is the most inaccurate medieval cemetery management sim of the year. Build & manage your own graveyard while finding shortcuts to cut costs, expand into entertainment with witch-burning festivals, and scare nearby villagers into attending church. This is a game of capitalism and doing whatever it takes to build a thriving business.\n\nFace ethical dilemmas. Do you really want to spend money on that proper hotdog meat for the festival when you have so many resources lying around?\n\nGather valuable resources & craft new items. Expand your Graveyard into a thriving business, go ahead and gather valuable resources scattered in the surrounding areas, and explore what this land has to offer.\n\nMake business alliances. These dead bodies don't need all that blood, do they? Why not sell it to someone who can put it to good use. Same for body parts. Hey, it's being efficient with recycling!\n\nExplore mysterious dungeons. No medieval game would be complete without these. Take a trip into the unknown and find useful new ingredients which may or may not poison a whole bunch of nearby villagers. Capitalism.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"tinyBuild","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":4154,"name":"Dead Space 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/568/5689c58278e807c1574ceefb8dec026b.jpg","description":"The third part in the Dead Space series. Like the previous installments, Dead Space 3 is a science fiction horror game in the vein of Alien film series.\n\n###Plot\nThe game is set in the year 2514. The humanity has discovered alien artifacts, the Markers. They can be the source of powerful energy but also provoke outbreaks of Necromorphs, the undead monsters. The radical Unitologists movement wants to spread the Necromorph infestation.\n\nThe main protagonist of the series, Isaac Clarke, resides at the Moon after he destroyed Markers in Dead Space 1 and 2. His ex-wife Ellie Langford went missing with her expedition on the frozen world of Tau Volantis. John Carver, the secondary protagonist of Dead Space 3, asks Isaac to travel with his team to Tau Volantis. This world may be the key to the secret of Markers.\n\n###Gameplay\nThe player assumes the role of Isaac Clarke on his quest. The game introduces the ability for Isaac to roll over and take cover to avoid being hit. Monsters and weapons from the previous games make a return, and there are new enemies like Nexus or Unitologist soldiers. The game also introduces the Weapon Bench system that allows to craft new weapons and upgrade them.\n\n###Multiplayer\nDead Space 3 was the first in its series to include an online cooperative multiplayer. In this mode, the second player assumes the role of Sergeant Carver and can accompany Isaac in the story campaign. Co-op mode unlocks additional missions that are unavailable in the single-player mode.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":22961,"name":"Hitman: Contracts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/07b/07b5abbe6330a76d6b30636d3aa5e0f3.jpg","description":"Hitman 3: Contracts is an assassin simulator game developed by IO Interactive. It is a third installment in the Hitman series.\n\nBleeding out Agent 47 tumbles into one of the rooms in an unknown Paris hotel. He passes out and starts hallucinating about his previous contracts. Each of these memories is a single mission that has to be completed by the player.\n\nIn contrast to the previous game, the detection can be avoided much more easily. The enemies barely notice the Hitman dressed in someone else's clothing. They can still notice you if you stand in front of a guard for too long or openly carry a knife. Players have a lot of options for killing their target. Environmental kills are now much more common. For example, in one of the missions, the player has to eliminate a target using a pillow. \n\nThe game now features a much more gritty tone. It usually takes place in foggy, rainy or snowy environments. There are many locations in a game ranging from a gothic manor to a meat processing plant where a BDSM party is held. 7 of the game's 12 levels are remakes of Hitman: Codename 47.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Square Enix","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":10602,"name":"Dino D-Day","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/711/7115f17fd8453b9d4d93536446247404.jpg","description":"Dino D-Day is based on a completely absurd premise: what if Adolf Hitler used battle dinosaurs in his conquest of Europe, and what if they were actually effective against XX century weapons? Of course, such a setting can not be taken seriously, so the game is full of humor and Jurassic Park references.\n\nThe game is oriented towards online multiplayer gameplay. The players have to pick one of two teams, Allies or Axis. Both teams can compete in a traditional frag-counting deathmatch mode, a \"king of the hill\" mode, or complete specific objectives to win. Each side has multiple character classes, but most dino classes are on the Axis side, including such spectacular specimens as fast-ambushing Velociraptor, machine-gunning Tyrannosaurus and a Triceratops with a mounted tank turret. While dinosaurs are technically stronger than humans, they have trouble reloading their firearms and can be distracted by an Allied rabbit released on the battlefield. Still, the sides are not perfectly balanced, and battles can often become chaotic.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"800 North and Digital Ranch","platforms":[{"id":0,"name":"PC"}]},{"id":46399,"name":"Regions Of Ruin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2cc/2cc8e0cfe5df94b586ad42f4319514e9.jpg","description":"Ever wonder what would happen if Kingdom met a broad, skill based open world RPG? Welcom to Regions of Ruin.\nRegions of Ruin is a 2D side-scrolling RPG with town-building where you are introduced to an open world that progressively challenges your hero and settlement the further you delve into the vast continent.\nYou will discover a foreboding land ravaged by hundreds of years of hardship. Where, kingdoms have risen and fallen, settlements have been laid to waste and overrun by warring groups, and great mysteries lay hidden and waiting to be unearthed - assuming you can defeat their jealous guardians.\nMain Features include:\n• Styled combat system with stats and levelling\n• Skill tree to focus your fighting style\n• Extensive loot and rare items to discover\n• Forge your own equipment or smelt it for resources\n• Open world exploration with a hand crafted environment, no randomized maps or levels, everything you see has been made with care\n• Customised town building and expansion\n• Rescue and recruit dwarves for your township (save them from extinction!)\n• Send workers to harvest resources from explored regions\n• Hire Mercenaries to help in battle\n• Multitude of Quests and a main storyline","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Vox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":37669,"name":"Marvel Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/37f/37f6c595ddfc5050a02f0f95d8805d77.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gazillion Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":10724,"name":"Crossout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a6/7a6f90e85a2e264c3b440bb4787cf378.jpg","description":"Crossout is a post-apocalyptic vehicular combat game, where players can create battle machines from scratch.\n\n\n###Plot\nThe game is set in the universe of Hard Truck Apocalypse (aka Ex Machina), a game from the same Targem Games developer, and serves as its prequel. The game takes place 20 years after an apocalyptic event called Crossout. In 2027 a viral disease pandemic swept across the Earth, driving most people insane. Some committed suicide, some died when nuclear bombs were set off. Many of the survivors have mutated, became aggressive and formed gangs to patrol the wasteland on their hand-made vehicles.\n\n\n###Gameplay\nThe player has to fight enemy characters (in PvE modes) and other players (in PvP battles) using armored cars. Victories increase the player's reputation and allow him or her to join various factions and craft their deadly weapons. There are missions the player can complete to earn more fame, money, and spare parts to customize his or her car. The game features advanced damage model, which means that any part of a vehicle can be shot off during a battle. For example a player can lose all wheels and get his car immobilized.\n\n\n###Customization\nThe game offers a variety of options for customization. Every player can assemble his or her unique car from scratch from dozens of spare parts. The cabin and the frame are the only two obligatory parts, the rest is up to the player. He or she can enhance the vehicle with weapons, armor, accelerators and other devices to fit his or her driving style. However, the design has to be practical and balanced at least to some extent. Awkwardly built vehicles can lose control or flip over. The blueprints of crafted vehicles can be shared on the 'Exhibition', where players can like and download them, to create a similar car or improve the original design. Game also offers automatic vehicle craft system, which will build a battle machine from the parts in player's storage.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Targem Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":1612,"name":"Super Hexagon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/112/112c9ecfe850e318bb999660361782bb.jpeg","description":"The game from the independent developer Terry Cavanagh. The final version is based on the prototype gameplay from the same developer.\n\nA player is a miniature arrow that rotates around a central hexagon. The main task is to avoid collision with hexagon limits. The position of the limits varies depending on the difficulty level. The game is considered complete after player survives for 60 seconds. Everything moves with incredible speed and the task to keep up is not a simple one. The game increases the difficulty depending on how long the player lasted.\n\nThe atmosphere of the game is already aggressive, there is a lack of an easy level of difficulty and rhythmic music and a constant screen-flickering. The combination will wake anyone. Initially, the game was released for mobile devices, after it was ported to the PC.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Terry Cavanagh","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":9811,"name":"DayZ","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d7/7d7c89793578f721df56022c6cf53bb0.jpg","description":"What once used to be a mod for the Arma 3 became a standalone title with the same name. DayZ is an open world survival game, which is based on gathering food and water for survival and weapons and clothing for self-defense. Players are dropped inside the 225 km2 of the fictional former Soviet Republic of Chernarus. Starting with nothing, but simple clothes, flair, and a rug, players will have to scavenge for items, transport, and weapons, while running away from either zeds, bandits or hostile players.\nDayZ can be played as a single player game, but most of the current player base is using multiplayer servers in order to form groups, clans and survive together.  In order to make the survival aspect more realistic, aside from thirst and hunger, several diseases have been added to the game, with specific cures for each effect. The game supports text and voice chat for communication, with a system that allows not only for a player-run radio station but secure two-way radio, without nearby players to hear it.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":58758,"name":"Dying Light 2 Stay Human","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/73d/73db43df633477d4604c7248292f34b2.jpg","description":"Dying Light 2 brings to life a unique post-apocalyptic vision of the Modern Dark Ages - a brutal, bleak and unforgiving reality where you are as likely to perish at the hand of a human as you are by the infected. \r\n\r\nIn this exhausted world, your quick thinking, exceptional parkour abilities and brutal combat skills are the only things that let you dive into darkness and emerge alive. Make morally grey decisions and witness how they impact the world at multiple levels, shape the transformation of the City, and ultimately decide its fate.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Techland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":47326,"name":"OKAMI HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a38/a3857b2445c70ac5dbe73b210a827ad8.jpg","description":"Okami HD is a remaster of the original Ōkami released for PS2 and Wii in 2006. While the original game has only visited PS2 and Wii, the HD Remaster is playable on all the current generation consoles.\n\n###Remastered\nWhile the original game has only visited PS2 and Wii, the HD Remaster is playable on all the current generation consoles. The updated version differs from the original in texture quality, HD does not feature some songs and include trophies.\n\n###Key features\nThe whole narrative in the game circles around Japanese stylistics: folklore tales, agitated myths, and well-known country legends mix up in the game's storytelling. The title also features unique stylistics inspired by Japanese ink-wash painting called Sumi-e. All of the game's visuals are rendered via cel-shading.\n\n###Plot\nThe game tells a story of Ōkami Amaterasu — the wolf representing the Japanese goddess of the sun. At the beginning of the game, she is going out for an adventure to seal the Orochi — demon who was unleashed by Susano, the great warrior.\n\n###Gameplay\nThe game presents itself as a mix of puzzle and platformer. Throughout the game, the player follows the main story. However, the side quest is also available. Apart from the exploring sections, the protagonist also participates in multiple battles. The main weapon-style used in battles is brushing, which is used for the wide variety of the actions including wielding the weapon.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":20466,"name":"Worms Armageddon","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/96a/96a48ac7487d9db9179d83170afcb16a.jpg","description":"Worms Armageddon is a 2D artillery tactical shooter with turn-based gameplay. It follows the visual style of the series, and you control a team of cartoonish worms that fight with real-based weapons. While the game was developed in the late 90s, the newest version is available on Steam since 2013.\n\nThe core gameplay is focused on turn-based PvP battles. Each player can perform an action during their turn. You have numerous possibilities: you can move your worms, attack opponents, use different items and so on. The goal is to defeat other players.\n\nThe only stat a worm has is its health. On the contrary, there is a huge variety of weapons and constructions that can be used during the fight. Weapons have different parameters and unique abilities. Some of them, such as flamethrower, are based on real models, while the others, like explosive moles,  are completely fictional.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Nintendo 64"}]},{"id":10342,"name":"RaceRoom Racing Experience","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c02/c02c64324edc2045ea1fc0601cdaaa0c.jpg","description":"RaceRoom Racing Experience is a free-to-play racing simulator. It houses official race series such as DTM, WTCC and ADAC GT Masters, but to get access to all content players are bond to excruciating grind. It can be avoided by paying for each little piece in the in-game currency that players purchase for the real money. \n\nSimulation in this game is on the point: developers worked with real racecar drivers to fine-tune the small details such as tyre modelling and suspension physics. You can compete using with bots in singleplayer sessions and fight real racers during multiplayer ones on 25 real-world tracks. The park of cars consists of major brands: BMW, Mercedes-Benz, Audi, Chevrolet, Ford, McLaren, Pagani, RUF, Radical, Volvo, Saleen and developers plan to enlarge it. To properly feel the speed players might need a gaming wheel: the game still supports all kinds of inputs, but the most compelling experience is with the wheel.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sector3 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10545,"name":"Warface: Ice Breaker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/12a/12ab4965b0b871b61d5e8568df27be46.jpg","description":"Warface is a free-to-play online multiplayer only FPS, brought to the market by Crytek. Players are able to pick one of 4 classes, each with an individual combat role, like reviving dead teammates, repair armor, giving additional ammo or merely providing long-range fire support. Every class has a specialty weapon that can be customized with necessary attachments. Warface provides not only a PvP experience, but allows players to join forces in the PvE matches, and Ice Breaker is just that.\nWarface: Icebreaker is a survival mission, where up to four players have to go through the series of missions, focusing on gradual progression towards the artillery ship. Ice Breaker mission is a direct continuation of another similar set of survival maps, called Black Shark. After the event of Black Shark, enemy faction Blackwood went for the full frontal assault on the Warface HQ, and General Wharton has to defend it with the help of the players. Icebreaker consists of four acts and seven stages total, with a boss fight against the Blackwood Flagship.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Crytek","platforms":[{"id":0,"name":"PC"}]},{"id":10056,"name":"Kane and Lynch: Dead Men","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bef/bef072bb5a968347f40cbeefcf7b80db.jpg","description":"In this crime thriller, Kane and Lynch are hardened gangsters who are soon to be executed. Instead, they are released from the prison by a gang that believes Kane stole its money. The gang has Kane’s family as hostages and wants the money back. Kane, Lynch, and other criminals they will hire have to gather the required sum by robbing banks, kidnapping people for ransom, and completing other criminal tasks. Gameplay in Kane & Lynch is slightly reminiscent of GTA series with its third-person cop-shooting massacres. However, instead of the open world, there are consecutive levels with a mission in each, like in Hitman series (which was made by the same studio). \nIn the story mode, Kane is the only protagonist under the player’s control. Lynch and other members of the gang are AI-controlled, though Kane can order them to move, follow, or attack. In the co-op mode, the other player can assume the role of Lynch. Playing for him is a little different because Lynch is a psychopath who sees hallucinations. There’s also an online multiplayer mode called Fragile Alliance that includes several new maps. In this mode, the team of players tries to survive the police assault and reach their getaway car.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":10980,"name":"Serial Cleaner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/439/4397f836727bdd13bd38deeb4f7355bb_GacwmJ9.jpg","description":"Can you dig it?\nStep into the polished shoes of The Cleaner, a professional crime scene cleaner for the mob. There's no business like the cleaning business, and right now business is booming…\nSneak around crime scenes avoiding detection from the guarding cops as you vacuum up blood, hide bodies and remove evidence in this 70's styled, fast paced, 2D action/stealth game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Curve Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13925,"name":"Prince of Persia: Warrior Within","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/459/459ac8745027643ed7338516c0025cf7.jpg","description":"Prince of Persia: Warrior Within is an action adventure game and a part of the vast Prince of Persia series which includes ten titles overall. Sands of Time precede it and followed by The Two Thrones\n\n###Gameplay\nAll the big titles in the series feature pretty much the same mechanics: 3D platforming with a heavy focus on the fighting elements and parkour. The game is the first in the group to have a non-linear structure with the protagonist returning to the previously visited areas and opening hidden paths with the new tools acquired along the way. \nThe fighting system presents wielding two weapons at a time with the latter being divided into two main categories: melee — primary weapons and throwable — secondary ones. \n\n###Gameplay\nThe events depicted in the game take place seven years after the previous game in the series — The Sands of Time. The narrative centers around the antagonism of the protagonist of The Prince and Dahaka — the mystical beast, hunting him because he released the Sands of Time in the previous installment. \nThe game features two endings: a canonical \"good\" one the storyline of which is transferred in the next chapter of The Prince's journey and the \"bad\" one. The difference lies in the Water Sword achievable through gathering all the collectibles for upgrading the life meter.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Ubisoft","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":14422,"name":"Condemned: Criminal Origins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/98d/98deaf99f06aa3d7e54e1fa69e4a9060.jpg","description":"Condemned: Criminal Origins is a grim crime thriller that lets you play the role of a detective and investigate the murder of a young woman. The game features a dark and paranoid atmosphere with some disturbing imagery. The player controls the protagonist, an FBI agent Ethan Thomas, who was summoned to a crime scene in an abandoned building. His job is to collect the evidence, such as fingerprints and fluids, and send it to the FBI forensic laboratory to find clues to the mystery. Thomas will use the information he gathered to solve puzzles and access new territories of the fictional Metro City. His goal is to track down the murderer who is likely a famous serial killer. The job proves to be dangerous, as Thomas has to visit some of the darker places in the town and fight thugs and psychos, while the main villain seems to keep an eye on him.\nThe combat system in Condemned: Criminal Origins is more realistic than in most first-person shooters. Here, firearms are able to kill people in one hit, however, they are seldom used, and the ammunition is very scarce. Ethan Thomas mostly uses improvised weapons, like shovels, wrenches and even a mannequin arm. Melee weapons also allow you to block enemy hits, and mastering timely blocks is essential to avoid being killed.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":4466,"name":"Catherine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a91/a917f41bb87e4b9e7a762ac87d97a9dc.jpg","description":"Catherine is a platformer/visual novel developed by Atlus for PS3 and Xbox 360 in 2011.\r\n\r\n###Plot\r\nThe plot follows the adventures of Vincent Brooks, who is choosing between the two girlfriends — Katerine and Catherine with the opposite personalities. While making relationship choices throughout the daytime, Vinet is forced to participate in realistic nightmares at night. The setting of a title is two narratives folded one into another: on the outer layer, the game has TV-Show \"The Midnight Versus\" which tells the story of an inner layer — the adventures of \"Catherine\" world.\r\n\r\n###Gameplay\r\nThe gaming process consists of two stages, according to the protagonist's activities. While the ventures during the day resemble the usual visual novel mechanics: walking, listening to dialogues and watching cinematics pieces, the action gameplay reveals itself in the night. There Vincent has to climb a set of stairs by removing and climbing blocks to avoid traps. If he fails — the protagonist dies in real life.\r\n\r\n###Reception\r\nThe game journalists generally liked the game but were disappointed by the sexists and misogynistic stories found within it. The title obtained commercial success, and thus there is a remaster coming out for PS4 and Vita. The remaster was half-ready in late 2017.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Atlus","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":9997,"name":"Arma 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a2/7a2d3c0883f01e43bff02f0d124d4642.jpg","description":"Arma 3 is an open-world tactical shooter with RPG elements and a heavy focus on realism. The game is set on fictional Greece-themed islands in the near future during the war between NATO and Iran. In the campaign mode you take on the role of Corporal Ben Kerry, who takes part in this conflict. There are three chapters in the campaign but you can complete separate missions during the multiplayer mode.\n\nArma’s key feature is its realistic battles. It’s not another military shooter where you can get an upgraded gun and go kill dozens of enemies. Instead, the game suggests you feel like a real soldier with all dangers and difficulties you can experience. That’s why you need to think over your tactics and protection, be patient and ready for long runs. Arma 3 provides you with a great amount of weaponry suitable for your playstyle.\n\nArma 3 is the third main installment in the series. It’s a follower to ARMA: Armed Assault, ARMA 2 and their multiple DLCs, and is extended with nine expansions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":392019,"name":"Half-Life: Alyx","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/855/8552c056d729f34c951c30f3cfef9da8.jpg","description":"Half-Life: Alyx is Valve’s VR return to the Half-Life series. It’s the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2.\n\nPlaying as Alyx Vance, you are humanity’s only chance for survival. The Combine’s control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth’s greatest scientists: you and your father, Dr. Eli Vance.\n\nAs founders of a fledgling resistance, you’ve continued your clandestine scientific activity—performing critical research, and building invaluable tools for the few humans brave enough to defy the Combine.\n\nEvery day, you learn more about your enemy, and every day you work toward finding a weakness.\n\nABOUT GAMEPLAY IN VR:\n\nValve’s return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life.\n\nImmerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat.\n\nLean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier.\n\nExtra content for Index owners\n\nCustomers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year:\n\nExplore environments from Half-Life: Alyx in your SteamVR Home space\nAlternate gun skins to embellish Alyx's arsenal\nSpecial Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2\n\nCommunity-built environments\n\nA set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve’s level authoring tool, has been updated with all of the game’s virtual reality gameplay tools and components.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Valve Software","platforms":[{"id":0,"name":"PC"}]},{"id":3374,"name":"Stealth Inc 2: A Game of Clones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ff/2ffe731b3388bd795f94c38e9afed60f.jpg","description":"A sequel to Stealth Bastard (a.k.a. Stealth, Inc.), in which the player controls a group of identical clones. They are being used as test subjects on a PTi Industries factory. But now one brave clone learned his real purpose and is going to escape to freedom. \nGameplay in Stealth Inc. 2 is centered around stealth action, for which the game was even compared to the Splinter Cell series despite huge stylistic differences. The clone has to move swiftly and silently to avoid security cameras and sentry robots. Its time is limited, however, and the player has to find the balance between speed and safety. Level design in Stealth Inc. 2 reminds of Metroidvania-style platformers. The factory is split into areas, consisting of eight test chambers each, all of them interconnected in the manner called overworld. The player will have to solve puzzles to open new areas. Every area introduces a gadget that should be equipped and is essential to use to move forward. Some of the puzzles are deadly traps that are only solved through trial and error. On the first walkthrough, they will almost inevitably kill the clone and send it back to the checkpoint.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Android"}]},{"id":9911,"name":"Dungeon Defenders II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ef8/ef8201008461d1c102b6c11c4114d08e.jpg","description":"Etheria is under attack! Build mighty defenses to freeze, burn and disintegrate your foes -- then grab a sword and jump into the action! Level up a team of heroes, deck them out in loot, and destroy the hordes by yourself or in four-player online co-op!\nCreate a Team of Heroes\nWizards! Robots! Thieves! Recruit a cast of characters to join you on your quest to save Etheria. Each hero brings unique abilities and defenses to the battlefield. Swap between your heroes on the fly to use all of their tools -- even in combat!\nBuild Your Defenses\nConstruct a deadly grid of laser beams. Drown your foes in quicksand. Build a wall of flamethrowers and watch the world burn, you sicko. A wide variety of defenses are at your disposal, and you'll need them all to protect the Eternia Crystals from the Old Ones' army.\nShoot and Loot\nLeap into battle and get your hands dirty! Grab a sword, a bow or a laser shotgun to blast through hordes of enemies. As you play, you'll find loot and Shards to equip and customize your heroes with. Just beware of the goblin blood. As much as you scrub, the smell never goes away.\nSee the Sights\nIn your journey, you'll visit ancient forests, massive castles, haunted temples, active volcanoes, and a surprisingly small number of dungeons for a game named Dungeon Defenders II.\nBring a Friend (or 3)!\nDungeons aren’t meant to be defended alone! Invite your friends to join you in Etheria for four-player online co-op.\nMore Updates on the Way!\nAs we did in Early Access, we're going to add more heroes, maps, loot and things to do, and we'll continue to listen to you about how to improve Dungeon Defenders II!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Trendy Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":29658,"name":"The Elder Scrolls: Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef8/ef823f3c46ff1e00803888b5c4476e10.jpg","description":"The imperial battlemage Jagar Tharn betrays the Emperor Uriel Septim by imprisoning him in an alternate dimension, then assuming the Emperor’s identity and place on the throne. A lone prisoner must travel to Tamriel’s most famous and dangerous sites to collect the shattered Staff of Chaos, save the Emperor and free the Empire.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":15851,"name":"Star Wars: Dark Forces","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5ad/5ad8b055d14c14fd626d5eb42f218bc6.jpg","description":"STAR WARS - Dark Forces uses the Jedi game engine which was developed for this game exclusively. At the time the game presented new features of first person shooter genre, one of which is the ability to look up and down and also it presented the new approach to level design with multiple floors. \r\nThe main protagonist of the game is a mercenary Kyle Katarn, who works for Rebel Alliance. The story takes place when he discovers the \"Dark Trooper Project\" of Empire. One of its segments is the development of a series of powerful battle droids and armored stormtroopers. \r\nCritics praised the MS-DOS and Macintosh versions because of its innovative level design and technological advances, while the PlayStation version was highly criticized for bad graphics and low FPS rates. A sequel called Star Wars Jedi Knight: Dark Forces II was released in 1997.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]}]