[{"id":842402,"name":"Dredge","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2c/c2c9f1c026b6c1be5bc2160baf7224ea.jpg","description":"An unusual fishing RPG with a sinister undercurrent. Catch more than 125 deep sea denizens and pack them into your cargo hold for maximum profit. Dredge the seabed for valuables and relics. Get acquainted with the locals of Greater Marrow, just one of dozens of islands in the archipelago.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Black Salt Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":16668,"name":"Fallen Enchantress: Legendary Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b8f/b8f5ee9d6c5322f4f9901397a8846d7a.jpg","description":"Fallen Enchantress: Legendary Heroes is an add-on to fantasy strategy game Fallen Enchantress developed by Stardock. \n\n###Plot\nThe game is set in Elemental. This fictional world was once used as home to many civilizations. It has been torn by war and Titans, immortal gigantic creatures that fight for world domination. The game tells the story of a few survivors that try to rebuild their lives in a completely new world.\n\n###Gameplay\nThe add-on does not change the base game's gameplay much. The game is nonlinear, featuring sandbox gameplay. While not participating in campaign quests, the players are free to interact with other factions either waging war upon them or making new allies. At the beginning of the game, the player chooses whether to create a new sovereign or play as a pre-set one. \n\nWhile building up their kingdom, the players have to keep an eye out on their resources, technology research, and development of their own sovereign using magic spells. \n\n###Legendary Heroes features\nThe add-on adds two new factions; a fame system, that now allows the champions to spawn based on your amount of fame; a revamped character leveling system; new huge maps; several new monsters; refined graphics engine and UI; several new quest branches and items with them.\n\nAll these changes do not drastically affect the gameplay, yet the add-on's features are a welcome addition to the game. It was given free of charge to the players that pre-ordered the game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Stardock Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":1744,"name":"Whispering Willows","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bca/bca26f6a8d42f59f8c23456ae9f731ce.jpg","description":"Young Elena Elkhorn embarks on a harrowing journey to find her missing father and discover the secrets of the Willows Mansion. Aiding her journey is a unique amulet, she received from her father, which allows her to astral project her spirit into a ghostly-realm and communicate with the dead. Play as Elena to find her missing father, use your astral projection to solves the mansion’s tricks and puzzles, help the lingering souls and discover so much more in Whispering Willows.\nGame Features\nImmerse yourself in a beautifully hand-drawn 2-D world as you traverse the Mansion grounds\nAllow the haunting music and chilling sound effects to send goosebumps across your neck.\nLet the history of the Willows Mansion draw you into a plot full of twists and betrayal.\nExplore the vast Mansion and unlock its puzzling secrets as you search for your missing Father.\nDeluxe Edition includes:\nDigital Art Book - A 56 page Digital Art book exploring the concepts and style used to create the art of Whispering Willows\nSoundtrack - 10 Tracks of original music from Whispering Willows\nWallpaper - 1920x1280 Wallpaper of Elena Elkhorn","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"}]},{"id":43608,"name":"Deliver Us the Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c0/4c00f2f0436cde8c5eaecbf7607aff7c.jpg","description":"Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future where Earth's natural resources are depleted. In an effort to solve the energy crisis, global powers created the World Space Agency and secured a promising new source of energy on the moon.\nThe World Space Agency colonized and operated from the moon until one fateful night all communications with Earth ceased and the energy source was lost. Now, years later, you assume the role of Earth's last astronaut on a do-or-die mission to investigate what happened and save humanity.\nDuring this adventure, your only companion is a small robot named ASE. Together you will traverse the moon, explore abandoned facilities, gather clues and ultimately uncover the secrets and hidden agendas of those long gone!\nWill you save mankind or be forgotten in the dark abyss of Space?REAL WORLD THEMESThe narrative focuses on topical issues, like climate change and the depletion of the world’s natural resources\n\nMULTIPLE GAMEPLAY STYLES\nExperience sequences of 1st and 3rd person play, as Deliver Us The Moon takes you on a genre busting narrative adventure\n\nBE AN ASTRONAUT\nLaunch a rocket from Earth, journey through the WSA space station and explore the open lunar landscape with weightless freedom - by foot, rover or monorail\n\nUNCOVER THE PAST\nRuins of previous lunar missions have many stories and secrets to tell. Use your Astrotool to uncover the history of the lunar colony\n\nSUIT UP WITH SPACE AGE TECH\nWith the ASE drone as your sole companion, utilise the greatest technology mankind has to offer from new age space-suits, cutting lasers, rockets and robot arms\n\nSURVIVE HAZARDOUS ENVIRONMENTS\nWith oxygen tanks running out and the never-ending void of Space staring you down, staying alive won’t be so easy\n\nCRACK THE CODE\nOvercome obstacles, dangers blocking your path and uncover the secrets of the past by using various tools and all of your wits to solve intricate puzzles\n\nFEEL WEIGHTLESS WITH A BREATHTAKING & ATMOSPHERIC SOUNDTRACK\nInspired by the greatest works of Sci-Fi in cinema, Deliver Us The Moon has an awe inspiring soundtrack to rival the movies with three hours of original music\n\nPOWERED BY UNREAL® ENGINE 4\nDeliver Us The Moon uses Unreal® Engine 4 to deliver incredible gameplay and stunning graphics","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"KeokeN Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":30406,"name":"Eye of the Beholder 3: Assault on Myth Drannor","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a2/9a204481dba4a1a2cfe3f1c282903bde.jpg","description":"Is the third game in the series and takes place just after the heroes victory over Dran Draggore in the Temple Darkmoon. A mysterious man enters the tavern where the heroes are resting and pleads with them to go to Myth Drannor and rescue the town from an evil Lich.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Strategic Simulations","platforms":[{"id":0,"name":"PC"}]},{"id":21371,"name":"Heretic: Shadow of the Serpent Riders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56f/56f97dea13615f7a3347b5d00880377c.jpg","description":"In a twisted medieval dimension, undead creatures and bestial horrors have done the unthinkable--callously slaughtering your entire race. Your friends. Your family. Eliminated. But the nightmare has just begun. Wielding ungodly weapons such as the Firemace and Hellstaff and casting spells from the Tomes of Power, you must seek your vengeance. Or die trying.\nSupports up to four players via network, two by modem. Adventure through the game with a friend or crack their skull in a bloody deathmatch.\nWalk. Run. Fly. Look all around you, even up and down.\nChoose from among 7 weapons (from the simple staff to the awesome Phoenix Rod).\nUse arcane artifacts to unleash unearthly power on unsuspecting foes.","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"id Software","platforms":[{"id":0,"name":"PC"}]},{"id":10950,"name":"Vanguard Princess","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/534/5341c6a2fd7f15e0a61278006eb9819c.jpg","description":"Apparel\nVanguard Princess Apparel Is Now Available! Select from apparel in various colors and sizes for Men, Women, and Youth. All transactions are managed by Amazon.\nAbout the Game\nGovernment experiments on a young girl triggered a cosmic shock wave that gifted many young girls with mystical powers. She re-emerges into the world and vows to destroy all of mankind in an act of revenge. A brave group of girls who embraced their powers head to the battlefield to confront her; not just for the sake of the world, but to pursue their own personal motives and dreams.\nChoose from ten girls with unique fighting skills and pair them with a powerful partner to form an unstoppable team.Navigate the adventures of a Vanguard Princess in the Story Mode or engage in head-to-head battles in the Versus Mode.\nhttp://store.steampowered.com/app/311500/\nhttp://store.steampowered.com/app/329150/\nhttp://store.steampowered.com/app/406440/","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tomoaki Sugeno","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":1012,"name":"Destroy All Humans!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/78d/78da51d43def2bc49d7c446f2421dd6e.jpg","description":"This is your chance to experience the other side of an alien invasion. Take on the role of alien Cryptosporidium 137 and terrorize the people of Earth to harvest their DNA in the most brazen action-adventure you've ever played. Take over all of humanity using a variety of alien weaponry on land or in the air.\n\nTake over all of humanity using a variety of alien weaponry such as a ray gun, an anal probe gun, the Ion Detonator, the Zap-O-Matic, the Sonic Boom, the Quantum Deconstructor, a powerful nuclear weapon that can launch radioactive bombs, and more – on land or in the air. \n\nCrypto can use Telekinesis to throw cars, trucks and cows to create even more of a turmoil or disguise himself as a puny human. \n\nFor transport, use a jet pack for short distances or your UFO for travelling long distances and abducting or destroying humans. \n\nTake one giant step on mankind!\n\n1 player\n3GB minimum save size\nDUALSHOCK®4\n\n  Software subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n\n© 2016 THQ Nordic AB, Sweden. Developed by Pandemic. Destroy All Humans, THQ and their respective logos are trademarks and/or registered trademarks of THQ Nordic AB. All rights reserved. All other trademarks, logos and copyrights are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox"}]},{"id":370290,"name":"Legend of Keepers: Prologue","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e07/e074c262ea938000b19c8b64e11aa7ea.jpg","description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/978520/Legend_of_Keepers_Career_of_a_Dungeon_Master/\nAbout the Game\nLegend of Keepers: Prologue is a free playable alpha demo of Legend of Keeepers. It's a tactical dungeon defender where you play as the bad guys! You're the CEO of this dungeon and need to protect it against pesky heroes. This version of the game contains around 2 hours of gameplay and introduces Legend of Keepers mechanics, lore building and game strategy.Features\nPlace traps, launch spells and slay the pesky heroes looting your dungeon\nFight with your monsters and discover their unique abilities\nHire monsters, manage your employees and your stock of traps\nDeal with employees strikes and other fun eventsRogueDefender\nEach run will be different but players will keep some bonuses for their master between runs. Our game is a mix between a Roguelite and a Dungeon Defender. How did we achieve that? We've run many tests to find the perfect mix between a management and a dungeon phase!\nDungeon Phase\nFirst, you will have to plan your defense against a group of adventurers. Check their stats and resistances, then place the best traps and monsters to defeat them! When you think your dungeon is ready, let the crawl begin!\nYou will then be able to watch those heroes die! It's a reversed dungeon crawler, heroes will move through your dungeon and will trigger the traps you've placed. When a group of adventurers meets a group of monsters you've positioned in your dungeon, a turn-based fight will happen!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Goblinz Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":47594,"name":"Raji: An Ancient Epic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/50a/50a8647c2bb13202ec663b20eb42554a.jpg","description":"Raji: An Ancient Epic is an action adventure game set in ancient India. Raji, a young girl is chosen by the gods, to stand against the demonic invasion of the human realm. Her destiny to rescue her younger brother and face the demon lord Mahabalasura.\n---Key Features---\nBreathtaking Hand Painted Environment\nHand Painted art style\n\nEach and every corner of Raji: An Ancient Epic is hand painted, this utilises the use of several softwares, dedication and countless hours. The environment is inspired by the medieval architecture of Rajasthan, which was the pinnacle of architectural achievement during the medieval era of India.\nThis inspired us and thus the art style naturally went down a route of hand painting each and every texture, which can be reflected in every pixel of the game. All thanks to our environment artist, since she comes with a Fine Art background and special expertise that suits the game.\n​\n\nUnique Character Artstyle\nReflecting Southeast Asia in an Indian game\n\nOur character art style reflects inspiration from Southeast Asia, the art team went to Bali, Indonesia to study more about the mythology and the background of the island. The art team were heavily influenced by the demonic statues and sculptures that were later infused within the characters of the game.\n​\nA Story Of Siblings\nA sister on a rescue mission, against all odds\n\nRaji: An Ancient Epic takes you through an intense and emotional story of Raji, who is determined to find her brother and bring peace to the human realm. The story of Raji: An Ancient Epic is a witness of how Raji evolves through the atrocities of war and the loss of loved ones. She takes upon herself to find an end to this reckless war, which can only happen if she manages to break down the might and the stratagem devised by the great lord of demons, Mahabalasura.\n\nGritty and Fluid Combat\nChoose your weapons and gods\n\nThe combat of the game offers a mix of fluidity in movement and attacks going against powerful and mystical enemies. The combat is empowering, making one feel like a demigod, but beware, her vulnerability as a human is never far away. The game offers you choices from various weapons as well as god powers gifted to Raji allowing for diversity and letting the player explore their own style of gameplay. Raji will also come across several demon types and subtypes, including mini bosses and epic boss battles.\n\n\nThrough the Ranks Of The Enemy\nThe bad and the ugly\nAll the demons in the game have their ranks among the army. While Raji can come across a demon from a specific race who gripped a stone mace, she might meet the same demon type later with full fledged armor and advanced weaponry. Not only that, one will come across well equipped demons, several subtypes with varying abilities and mini bosses that can be found lurking in the game.\n\n\nExplore Ancient Forts and Solve Environment Puzzles\nForts and Fortresses, secret locations, puzzles and environment storytelling\n\nThe story of the game takes you through various levels which were inspired by gigantic forts of the medieval era, built by Rajput kings of Rajasthan. Not only that these forts allow for tightly packed arenas for combat they also take the player through the massive scale and breathtaking views the forts provide. The levels will also feature secret locations where one might wonder, what would they stumble upon..friend or foe, treasure or trap?\n\nEach of the handcrafted levels will ask the player to surpass challenges one after another. Various “Mandala” puzzles play an important role in environment storytelling, these were designed to give the player a breather in-between the challenging combat. Certain level locations will be telling their own story, which is upto the players to decipher, our artists and level designer has made these locations keeping in mind the context of the level and the lore of the universe.\n\nMyths and Culture\nA grand game which inspires from Hindu and Bali mythology\n\nThe setting of the game allows us to seep in small fragments of Hindu and Bali mythology here and there. Various level locations, demons, bosses and characters will be representing distinctive features which draw inspiration from both Hindu and Bali mythology. The team at Nodding Heads Games wants the world to be a witness of the grandeur and bizarreness of a game coming from India, which has never been seen in the gaming industry to date.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Netflix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":25924,"name":"The Legend of Zelda: Majora's Mask","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b3c/b3c209cd49aae8a469a59b79b54dc599.jpg","description":"Link must save the world! This time, he finds himself trapped in\nTermina, an alternate version of Hyrule that is doomed to destruction in\njust three short days. Link must race to recover the Ocarina of Time\n(which allows him to manipulate time in multiple ways), defeat\nchallenging bosses in dungeons spread across Termina, and discover the\nkey to the mystery of Majora’s Mask. Along the way he’ll obtain new\nweapons and items and help other characters (some strangely familiar) in\ntheir everyday lives. In addition, Link must utilize a wide assortment\nof masks scattered throughout Termina, each with its own specific use or\npower. Never before has three days offered so much in the way of action,\nmind-boggling puzzles, and depth—The Legend of Zelda: Majora’s Mask is\nan adventure unlike any other!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Wii.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 64"}]},{"id":2012,"name":"Eufloria HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a64/a64ec8e88e63e7d17628c44269cb5850.jpeg","description":"Eufloria HD is an indie real-time strategy developed by Alex May, Rudolf Kremers and Brian Grainger.\n\n###Story\nIn a distant story, deep down in space, a new form of life appears. Growers produce seedlings, that take over asteroids for the growers to turn them into flower-infested island-like structures. The growers are controlled by an entity called the mothertree. The greys start attacking the mothertree's colonies with an alarming rate. The player has to repel the attacks and figure out why they happened in the first place.\n\n###Gameplay\nThe game begins with the player having only one tree on one asteroid. The game revolves around a certain life cycle, where the trees create seedlings, which in turn create more trees on other asteroids. The trees in the game are procedurally generated, yet it does not affect the gameplay much.\n\n10 seedlings around the asteroid are needed to create more trees. The players can send seedlings to other asteroids or make them fight with other seedlings. Several types of trees are available for the players, with the main tree being the dyson one, which shoots the enemy seedlings, which is accompanied by a defense tree, which produces mines.\n\nAlmost every aspect of the game is procedurally generated, starting with the trees themselves and ending with the sizes and shapes of asteroids.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Omni Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"}]},{"id":60012,"name":"Pathway","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5be/5bef7d4db9d5ba2e83d94160baf3dcbc.jpg","description":"FROM THE MAKERS OF HALFWAY...\nTHE YEAR IS 1936...It is a time of global unrest as German military influence is spreading throughout Europe and the Middle East. Rumors of frantic excavations and strange artifacts, not to mention ghastly occult rituals, have begun to surface across secret communication channels...THEY TOOK OUR FRIEND...Morten has vanished. The Nazis took him because he interfered with their occult research. We have to rescue him before it's too late. And afterwards, who knows what other adventures await?\nKEY FEATURES:\nTHRILLING VISUALS - Classic 16-bit pixel art enhanced with unprecedented depth, lighting and shadows using Pixel/Voxel Hybrid Technology.\nDYNAMIC ADVENTURES - No two adventures are the same; each campaign generates a new procedural map and a different set of unique story encounters.\nTOUGH CHOICES - Every location you visit presents a new hand-crafted story event to explore. Search the well? Save the villagers? It's up to you!\nDECISIVE CONFLICTS - Use cover and positioning in exciting turn-based squad combat. Learn to maximize your items and abilities, as well as your team members' strengths, in ruthless and clever ways!\nHIDDEN TREASURES - Discover rare artifacts to unlock new content and adventures! Recruit from 16 unique companions, each with their own starting equipment and skill trees!\nWith soundtrack by the critically-acclaimed composer, Gavin Harrison of Halfway fame!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Robotality","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9896,"name":"Marvel's Guardians of the Galaxy: The Telltale Series","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c06/c06edf54c45016c6e5edc2235a29c7d3.jpg","description":"Marvel’s Guardians of the Galaxy: The Telltale Series delivers a brand new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who is the last of her kind, and who will stop at nothing to tear it from their hands.\r\nFrom Earth to the Milano to Knowhere and beyond, and set to the beat of awesome music, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure, told in the unique and award-winning Telltale style, where your decisions and actions will drive the path of the story you experience.\r\nIncludes access to all five episodes (Episode 1-3 available now, Episode 4-5 coming soon) in this all-new series from the award-winning studio, Telltale Games.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Telltale Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":9672,"name":"Riders of Icarus","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f9/3f91ed2b09ad06c8f5b3d1981f53b2e7.jpg","description":"Shady Warrens Update Now Live\nDeep in the mountains of Windhome Canyon lies the home of the Rabbinis of Midellas. The Rabbinis have retreated into their domain, hoarding precious metals and materials of the land. Within this domain, conventional combat and skills are negated, forcing Riders to adapt and utilize whatever means are available to them. Dive into the surreal and see how far the rabbit hole takes you!\nRead the full patch notes here: http://icarus.nexon.net/en/news/article/23310\nAbout the GameTake the battle to the sky with fantastical flying mount combat unlike anything you’ve seen before in Riders of Icarus, the new unprecedented action-adventure MMORPG experience that lets you ride and fight on the back of the realm’s most dangerous winged beasts… dragons.  As a Rider with legendary combat abilities, you will explore a majestic world to tame, collect and train hundreds of different wild beasts as your very own mounts each with unique special abilities.  Master the skills of aerial combat with other battle-ready heroes as you fight your way through an epic experience filled with massive boss battles by both land and air.\nRule the Skies in Battle: Become a legendary Rider of Icarus and master wild beasts to rule the skies.  Ride fearsome winged mounts into explosive aerial battles as you scorch the skies of enemy legions and protect mankind from an ancient invading evil.\nCollect Mythical Beasts: Explore fantastical lands filled with non-stop action and adventure to build your collection of mythical beasts. With hundreds of ground and aerial mounts to collect and train the sky is no longer the limit.  Tame your destiny as you level up your mounts to become deadly weapons with special combat abilities.\nExplore an Epic World: Let your imagination soar as you coordinate strategic aerial strikes with other heroes of all classes, both from afar with devastating magic or up close and personal with the game’s action-oriented melee combo system.  Descend to the battlefield using ground mounts and conquer theatrical boss battles to acquire treasures and experience to upgrade your mount and rider.\nFly and Fight for Free:  Immerse yourself in an action adventure free-to-play MMORPG where collecting wild beasts, riding combat-ready dragons, exploring an epic world and battling the most dangerous bosses with your friends is as FREE as the air you soar through.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"WeMade","platforms":[{"id":0,"name":"PC"}]},{"id":46403,"name":"Lonely Mountains: Downhill","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e9/5e9ae0e011afd5f199c8473cb67e07cc.jpg","description":"Just you and your bike - take it on a thrilling ride down an unspoiled mountain landscape. Make your way through thick forests, narrow trails and wild rivers. Race, jump, slide and try not to crash - all the way from the peak to the valley!\n\n# TRAVEL TO THE LONELY MOUNTAINS!\n\nExplore the rich mountain worlds at your own pace or face the ticking clock. Each mountain features several trails - ride along quiet mountain lakes, majestic forests and steep canyons. A custom physics system lets you carefully drop from boulder to boulder, sprint over abysses or slide through muddy grounds.\n\n# FIND YOUR OWN WAY DOWN\n\nIt’s all up to you! Take the relaxing scenic route or go off-road to find the fastest way to the finish line! Master the tight and responsive controls to make your way to hidden resting places and secret shortcuts. No audience, no barrier tapes - experience a beautiful nature unspoiled by men.\n\n# CAN YOU MASTER ALL THE CHALLENGES\n\nUnlock new difficulty modes and prove your speed-running talents on the leaderboards! Train your skills day and night to ultimately compete with the best riders in the world in the risky Free Ride mode! Each bike handles differently, so find the perfect one for your playstyle and make your way down the mountain to unlock dozens of paint jobs and outfits!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Megagon Industries","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":18000,"name":"King's Bounty: Dark Side","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be2/be2217d6f6e315a2121771b3cc91288e.jpg","description":"Time has come to join the Dark Journey to the other side of Teana and visit a mysterious part of the world never before seen by royal bounty hunters.\nFor the first time in King’s Bounty series, players will be able to choose their hero’s race as well as class. Become a fearless Orcs warrior, lead and heal your troops as a Demoness, or use dark magic as a fearsome Vampire.\nThe world is in turmoil. After winning the battle of Tristrem, arrogant elves plunder Orcish villages, desecrate holy shrines, and massacre the innocents. Orc-Baghyr, the greatest living Orc warrior, is forced to flee with a handful of loyal followers. He vows to return with a stronger force and retake his homeland!\nArmies of human knights invade the land of Atrixus. A young Demoness named Neoleene, still mourning the death of her royal father, and her small unit of devoted imps is all that stands in the way of the invading horde.\nCastle of the ancient Morton clan is threatened by an army of vampire hunters. Young Daert leaves home to seek allies among the other Dark races. All must join him or perish.\nFates of the three heroes are sealed. They come together in the depths of the Black Cave, where many centuries ago races of Light imprisoned Ancient Evil. The heroes exchange vows and share antique artifacts, then gather their armies and march to fight for the very survival of their race.  They must unite against the Light or face extinction!\nNew companion system (different companions for each character);\nNew battle companion;\nNew units, artifacts, and rage abilities;\nOver 100 new quests and 15 new locations.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"1C-SoftClub","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16905,"name":"Venetica - Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a47/a476b93337376c64c577ae678b1c02ca.jpg","description":"Set in the fantastic world of long ago Venice, the young Scarlett falls victim to a terrible mystery, which begins with the murder of her companion by a secretive alliance of mighty necromancers. Thus fate takes its inevitable course and threatens to throw the world out of order.\nScarlett finds out that she is the daughter of death incarnate and is blessed with his ultimate powers. She is the only one who can stop the gruesome powers that threaten to destroy the entire living world.\nNow it’s your chance to reverse fate! Get ready for a fast-paced adventure set in an epic world filled with dark dangers and merciless adversaries. Arm yourself with mighty weapons, rally together powerful allies and master the dark powers of death. Can you conquer the powers that threaten to inescapably destroy the world of the living? Follow your path down into the deepest abyss to death itself – and back again, if you are worthy!key Features:\nExperience a visually stunning action RPG with a unique and captivating atmosphere\nFollow the hero journey of Scarlett through a rich and original story\nConquer a host of merciless nightmarish creatures that pounce on the threatened world in a raged frenzy in action-packed battles and ultimately confront their masters\nExplore palaces, villas and numerous dark alleyways in a living dynamic Venice filled with merchants, rogues, allies and traitors\nLearn how to use the powers of the “Twilight World” and wander between the worlds of the living and the dead. Put the ultimate powers of death to your advantage in battle.\nUse the advantages of the “Twilight World” and the ultimate powers of death\nExperience an open game world with dynamic night and day cycles\nClear, easy to pick up rule system and intuitive game-play\nExperience a dynamic and open game world in which you can freely develop your own character and decide on different game strategies yourself.\nTo become death in Venetica is a calling, fulfilled by a man of flesh and blood – equipped with special supernatural skills in order to be able to carry out the duties of the office. A new death is selected regularly by “Corpus”, a secret council. This time however Corpus really makes a wrong decision: The “new” death, Victor, turns out to be a crazed necromancer who manages to turn himself into an overpowering undead with seedy tricks and dark rituals and thus attains almost unlimited power in addition to immortality. As it is strictly forbidden for the chosen death to devote himself to necromancy, the committee revokes Victor’s nomination immediately and declares a new death in his stead without delay.\nThe power-hungry Victor however does not want to relinquish his position again. He continues to practice the dark arts in order to gather numerous dark and dangerous creatures and tainted souls from the underworld around him. He thus succeeds in eliminating the newly designated death and takes over his power for his own purposes. The effects on the world’s balance are calamitous and – should Victor be able to keep himself in power – its dark consequences are irreversible. Only a person who has the same mighty powers as Victor can prevent his prevailing and vent him his deserved punishment.\nScarlett, the daughter of the real death does not know anything about her ancestry and the hidden talents which slumber within her. She is immersed suddenly in this story due to the brutal attack on her home village and the tragic loss of Benedict, the love of her life. It is a story which she now begins to write herself, a story during the course of which she unleashes her capabilities, a story in which she tries to save Benedict from the world of the dead and a story in which she must protect the world of the living from the dark threat posed by Victor and his henchmen.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Deck13","platforms":[{"id":0,"name":"PC"}]},{"id":15730,"name":"The Pedestrian","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/789/789144172022eb539a9fe76e5ca61527.jpg","description":"The Pedestrian is a 2.5D side-scrolling puzzle platformer that takes an interesting twist on the genre. It's a build-your-own-solution game with a unique art style centered around public signs, e.g., male & female bathroom symbols, elevator symbol, etc.Key FeaturesPuzzlesPlanning, moving, connecting, adjusting, tweaking, winning! Puzzles are simple - get from the start to the end, but as they say, “It’s not the destination, it’s the journey.”\nEnvironmentsThe adventure takes The Pedestrian through signs located in a variety of environments\n-Modern office building lobby\n-Dark and musty warehouse\n-Sprawling subway system\n-Bright expansive city\n-Sparkling art gallery\n-Damp sewer\n-Stormy construction site\nWordless ExperienceNo more walls of text! All puzzle mechanics are taught using symbols and animations, while story elements are portrayed around gameplay.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Skookum Arts","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":10156,"name":"Aliens: Colonial Marines Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2f/e2f77c0b293b8e0ea5ba551599e95556.jpg","description":"You and your friends are the deadliest killers in the galaxy.  Another glorious day in the Corps.\nBuckle up, soldier! Welcome to Aliens™: Colonial Marines. Created by Gearbox, the critically acclaimed and fan-favourite developers of Borderlands and Brothers In Arms, you and your friends will become the most badass military outfit in the galaxy – the US Colonial Marines. It’s up to you to not just survive, but wipe out the Xeno infestation.\nKey Features:\t\t\t\t\t\tEnlist in the Marine Corps.\nBringing you a true sequel to the classic Aliens film, get tooled up with classic Marine weapons including pulse rifles, motion trackers and\nflamethrowers.\nThe most authentic Aliens experience ever.\nUsing authentic environments inspired by the film series including Hadley’s Hope, the Sulaco and LV-426, you will be immersed in an eerie, atmospheric\nworld where any moment could bring your death.\nDrop-in/Drop-out co-operative gameplay.\nThe masters of co-op bring their expertise to the Aliens universe. Xenos getting too tough? Call up your buddies so they can drop in with extra\nfirepower. The whole campaign can be played with a squad of up to four players, dropping in and out as necessary through self-contained missions\nwithin an over-arching narrative.\nLoadouts and upgrades.\nCreate your perfect killing machine. An extensive upgrade system allows players to customise their characters to play the way they want. Earn experience to get perks, new weapons and new looks for your squad.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":9785,"name":"Robot Roller-Derby Disco Dodgeball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ab5/ab57d64b67d0c06e6cdaf5584df46248.jpg","description":"Steam WorkshopSubmit items to the game and earn sales revenue!\nAbout the GameDisco Dodgeball combines the one-hit-kill projectile combat of classic dodgeball with flowing skateboard-style movement and neon-drenched dance club arenas to create a unique, exhilarating, and incredibly fun FPS sports experience.\nDodge, deflect and catch enemy fire as you perform ridiculous aerial stunt shots with your mustachio'd unicycle robot. Play a wide variety of classic, expert, and custom game modes in offline singleplayer, local multiplayer, or online multilpayer matches.Includes:21 different multiplayer modes & solo/co-op challenges to test your skills and teamwork - like Hoops, Grand Prix racing, and of course classic Elimination.\nDeep game mode customization with in-game rule editor allows you to mutate & remix gameplay with near-limitless possibilities\nOffline singleplayer challenges, bot matches, and randomized Arcade mode where you battle waves of bots & bosses using clever combinations of superpowered perks\nOnline multiplayer servers provided at no extra cost. Easily create your own public or unlisted online rooms without any server knowledge required.\nNo online queues - jump into a match and start playing within seconds of game launch\nSplit-screen Local Multiplayer PvP and co-op challenges with up to 4 players\nCosmetic hats, robot bodies, heads, wheels, decals, sunglasses, moustaches, and ball FX that can be crafted or earned from random in-game drops\nPowerups like Jetpacks, Huge Dodgeballs, Laser Balls, and Boomerang Balls. Pick them up randomly or enable as permanent arena modifiers.\nCo-op challenges that let you team up with friends, equip scenario-specific powerups, destroy bots and aim for leaderboard high scores.\nRandom loot drops that you can craft into rare cosmetic items, trade with other players, or sell on the Steam Marketplace.\nLAN support\nSteam Workshop support to submit your own cosmetic items for inclusion in the game\nCapture and share your best shots as replay GIFs\nAn amazing electronic music soundtrack and playback of audio files from your own computer. Arena lights pulse dynamically to the beat of the music.\nA monster truck announcer\nAlienFX-equipped computers glow and pulse to match the arena lights\nPersistent stats and achievements\nStill being regularly updated with new content and features based on community suggestions!\nPHOTOSENSITIVITY WARNING: This game contains lots of flashing lights. You can enable photosensitive mode in options / video. This will disable lasers, bright explosions and other lights that pulse to the beat of the music.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Erik Asmussen","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":2266,"name":"Full Mojo Rampage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b13/b13b1699645fb8baa1551d070ab2a100.jpg","description":"Full Mojo Rampage is an indie rogue-like top-down action game developed by Over The Top Games.\n\n###Plot\nYou are a Voodoo doll fighting evil in the Voodoo world. Fight the hordes of zombies, complete quests, and clear out the Voodoo dungeons.\n\n###Gameplay\nFull Mojo Rampage is played from the bird's eye view. The players select one out of several Voodoo classes and their specialization by choosing their parent god and Voodoo pins. The game features a sophisticated customization system which allows the players to create completely unique characters.\n\nAfter creating their character, the players are put into the game's hub world, where they can take quests and upgrade their equipment and abilities. Most of the quests focus on specific item retrieval and hostage rescue. While on a quest, the players can freely explore the procedurally generated dungeon and find new equipment and weapons.\n\nBeing a rogue-like game, all the loot the player finds before exiting the level can be lost upon death. There is no way to recover the loot you lost.\n\nA four-player cooperative and eight-player competitive multiplayer modes are present in the game. In co-op mode, the players descend into the dungeon altogether with the game adjusting its difficulty. In multiplayer, two teams of four players fight each other in a variety of multiplayer modes, such as Team Deathmatch, Capture The Point, and so on.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nicalis","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":244741,"name":"Katamari Damacy REROLL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/842/8420626eee4e070554b7c975fbd27883.jpg","description":"When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure to restore the stars at home or on the go – now in full HD!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"MONKEYCRAFT Co","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":59796,"name":"Coffee Talk","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4d9/4d90960bbb1c92966b8ec7a4f11864a7.jpg","description":"Coffee Talk is a game about listening to people’s problems and helping them by serving up a warm drink out of the ingredients you have in stock. It is a game that depicts lives as humanly as possible, while having a cast that is more than just humans.\nImmerse yourself in the stories of alternative-Seattle inhabitants, ranging from a dramatic love story between an elf and a succubus, an alien trying to understand humans’ lives, and many others modern readers will find strongly echo the world around them.\nThe game features:\nTales of people from an alternative-Seattle, a city where elves, orcs, mermaids, and many other fantasy races live together with humans in a modern world we will all find familiar\nBranching storylines, where the branches are determined not by the dialogue options you choose, but from how you serve your café customers\n90’s anime-inspired pixel art visuals and chill vibes-inducing color palette help to immerse you in the game’s world\nSelection of jazzy and lo-fi music to accompany the late night warm drinks and conversations\nAn experience to make you think, feel, and rest both your body and your soul","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Toge Productions","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2764,"name":"Agatha Christie - The ABC Murders","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c15/c1504d3d18ba8011499d37b6d57261f8.jpg","description":"Agatha Christie - The ABC MurdersYour weapon is your knowledge. Your wits will be put to the ultimate test!\nThe ABC Murders is an adventure and investigation game adapted from the classic Agatha Christie novel. The player embodies the famous Hercule Poirot in a 3rd person perspective adventure game packed with mysteries. Once again, the private detective will find himself up against a mysterious opponent who goes by the name of \"ABC\".Your intelligence will never have been so challenged!You will have to explore many crime scenes in various cities set in beautiful surroundings across the United Kingdom. Leave no stone unturned when it comes to cross examinations and deadly puzzles!\nObserve, question and explore everything possible in order to make the smartest deductions and understand the murderer’s plans!KEY FEATURES :Examinations: The player can collect information by examining suspects and paying attention to what they say, how they say it and how they feel.\nPuzzles: The player will have to solve puzzles in order to obtain more clues.\nBrain Deductions: Depending on the clues collected, the player will be able to make deductions and find out more about the murderer.\nTimeline: As the player draws conclusions and progresses through the story, he can use Poirot's Timeline. This means that Hercule Poirot can build a timeline with all the relevant events revealed during the investigation.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":302836,"name":"AI: The Somnium Files","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e03/e035196b873383c7cb7d868f2a73a24c.jpg","description":"In a near-future Tokyo, detective Kaname Date is on the case of a mysterious serial killer. Date must investigate crime scenes as well as dreams on the hunt for clues. From the mind of Kotaro Uchikoshi (Zero Escape series director), with character design by the Yusuke Kozaki (NO MORE HEROES, Fire Emblem series), a thrilling neo-noir detective adventure is about to unfold.\n\nSTORY\n\nOne rainy night in November, a woman's body is found at an abandoned theme park, mounted on a merry-go-round horse. She had been stabbed repeatedly, and her left eye was gouged out.\nKaname Date of the Metropolitan Police Department arrives on the scene. He recognizes the woman. Suddenly, he hears a noise from inside the merry-go-round.\nHe breaks into the merry-go-round's central column to find a young girl. And in her hands, she grips a bloody ice pick...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Spike Chunsoft","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":23762,"name":"Pokémon Red, Blue, Yellow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/356/3566c06f8e5d3b45f4163dec1d9968a2.jpg","description":"With classic graphics and music, Pokémon Red and Pokémon\nBlue Version stay true to the originals released nearly 20 years\nago. You'll feel like you're playing them just as they were, but now you\ncan trade and battle Pokémon using local wireless on the Nintendo 3DS\nfamily of systems! Revisit these timeless games, or play them for the\nfirst time!\n\nExperience the original journey that started the Pokémon phenomenon\nnearly 20 years ago, but now on the Nintendo 3DS family of systems as a\ndigital download! Relive the feeling of catching your very first Pokémon\nfrom the original 150, complete with monochromatic pixel art and 4-bit\nbackground music. You’ll take on the role of a Pokémon Trainer and\ntravel across the land searching for amazing creatures called Pokémon.\nCatch, battle, and trade as you face Gym Leaders and try to stop Team\nRocket! If you want to catch the original 150 Pokémon, you’ll need to\ntrade wirelessly with your friends.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Game Freak","platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Nintendo 3DS"}]},{"id":22695,"name":"Total Annihilation: Commander Pack","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70f/70f9574ddf8d15ffac6c63184169a148.jpg","description":"What began as a conflict over the transfer of consciousness from flesh to machine has escalated into a war that has decimated a million worlds. The Core and the Arm have all but exhausted the resources of the entire galaxy in their struggle for domination. Choose your side, build an army, and crush your enemies on huge, three-dimensional battlefields. And remember, there is no such thing as \"too many guns\"!Includes Total Annihilation and both its expansion packs - The Core Contingency and Battle Tactics\nA timeless classic that has won over 57 awards!\nEpic battles with hundreds of units accompanied by frantic music composed by Jeremy Soule and hundreds of available mods","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Cavedog Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15689,"name":"The Deer","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/edc/edcc5b73fe333c9ebb110e439801e25d.jpg","description":"The Deer is an indie history education game developed by Fabio Ferrara and Giulia Airoldi.\n\n###Story\nThe game follows a deer living in the Pleistocene epoch that goes through the world's woods and gathers provisions to survive the winter.\n\n###Gameplay\nThe Deer is a purely educational experience designed mainly for children. The players control a deer that goes through the woods. No enemies are present in the game at all. All the game's assets are hand-drawn as well as hand-animated. \n\nAs the players go through the woods of the Ice Age, floating tooltips will appear on the screen, telling them about different aspects of life and nature during that historical period. At some points of gameplay, the players will encounter puzzles, which help the players memorize various facts about the Ice Age. The players will also witness several time periods as they progress through the game, starting with Spring that is followed by Summer and Autumn, and Winter, which finishes the game. \n\nThere are no bad ending present in the game, as the players will get the provisions necessary for the deer in any way. There is a little degree of interactivity present in the game, as the only thing the players can do is to move the deer, solve puzzles, and admire the game's drawn environments.\n\nThere are no T-Rexes in the game, as they have already gone extinct several millions of years before the events of The Deer.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10513,"name":"Expeditions: Viking","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e45/e4566a370840894a0693de27711e395e.jpg","description":"Get ready for an adventure in history! Logic Artists, the makers of Expeditions: Conquistador, are pleased to bring you Expeditions: Viking.\nPrepare for a grand adventure\nAs the newly appointed chieftain of a modest Viking clan, you’ll have a village of your very own. But to carve your name into the runestones of history you’ll need great strength, and great wealth to grow your village’s prosperity and renown. There is little left to be gained from the Norse lands and so you must set your sights on the the seas to the West, where tales speak of a great island filled with treasure ready for the taking.\nSeek your fortune\nYour trusted huscarls will follow you to Valhalla if that be the order of the day, but you’ll need more than loyalty to leave a legacy that will be remembered for a thousand years. Now assemble a worthy band of warriors, build a ship, and seek your wealth and glory across the sea. Britannia awaits in Logic Artists’ Expeditions: Viking.\nMain features:\nCreate your very own Viking chieftain! Carve out your character from our unique character system, where stats, skills, and abilities define your character’s role.\nRaiding or Trading? Vikings were known not only as violent warriors, but savvy tradesfolk. How will you find wealth, with the carrot or the stick?\nWar and Politics: Side with various factions be they Norsemen, Picts, or Angles.\nReputation: Be mindful of your choices, the stories of your actions may bring others to fear you, but will they trust you?\nStep into the pages of history: In a beautiful and visceral telling of the Nordic history.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Logic Artists","platforms":[{"id":0,"name":"PC"}]},{"id":18452,"name":"Princess Remedy In A Heap of Trouble","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e4/2e4941ad773a5cd78bf41015fa48a0f6.jpg","description":"An enormous Boss Tower has sprung from the ground, lifting entire towns up with it. People got used to it and kept living on the tower, but they’re starting to contract all sorts of mysterious illnesses. Princess Remedy, still in Saturnian healing school, must use her powers to heal everyone and defeat the Boss Tower!\nThe theme of love is back, and this time Remedy can date anyone she's healed to have them accompany her on her travels. Each companion offers a different ability in Healing Mode, such as Dash, Homing shots and Injection.\nMore bosses! More secrets! A dance ball! In A Heap of Trouble is the prequel to the critically acclaimed Princess Remedy In A World of Hurt (98% positive rating here on Steam). Still unsure? Play the first Princess Remedy for free:\nhttp://store.steampowered.com/app/407900\nXOXO\nLudosity team","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ludosity","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":301549,"name":"VirtuaVerse","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f3e/f3e071b86356f53011d4a2bd48069c87.jpg","description":"In a future not so far away, one Artificial Intelligence prevailed above all other AI’s and their governments. Society has migrated to a permanently integrated reality connected to a single neural network which continuously optimizes their experiences by processing personal data.\r\nNathan, an outsider still refusing to comply to the new system, is making a living off the grid as a smuggler of modded hardware and cracked software. Geared up with his custom headset, he is among the few that can still switch AR off and see reality for what it is.\r\nHe shares an apartment in the city with his girlfriend Jay, a talented AR graffiti writer whose drones have been bit-spraying techno-color all over the augmented space in the city. Waking up one day, Nathan finds Jay has disappeared overnight, breaking his custom headset and leaving a cryptic message on their bathroom mirror.\r\nDisconnected and determined to find out what happened to Jay, he finds himself tangled up in an unexpected journey involving Jay's hacker group and a guild of AR technomancers.\r\nTravelling around the world, he'll have to walk across hardware graveyards, deal with digital archeology, tribes of cryptoshamans, and virtual reality debauchery.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Theta Division","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19994,"name":"HunieCam Studio","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/429/4296f25b91bb55893460e6f1cf4273ab.jpg","description":"Courtesy Warning: The sexual themes in this game are mostly for fun/humor and don't make for particularly great fapping material.\nIn HunieCam Studio players take control of a sleazy cam girl operation. Rake in stacks of filthy internet money and attract as many disgusting fans as you can in this fast paced, click happy and thoroughly perverted take on the business tycoon / management sim genre!\nRecruit cam models from an eclectic cast of cuties who have probably made some poor life choices. Manage your girls' daily errands/activities to keep them stress-free and productive. Invest in various aspects of your business to improve functions and expand operations. Optimize your cam shows by promoting girls who match popular trends/fetishes. Abandon your morals and disappoint everybody who cares about you!\nUp to 18 unique cam girls covering a wide variety of perverse preferences!\nSend your models to the strip club to increase their talent, the photo studio for more exposure, the day spa to relax a bit, etc...\nAnalyze important stats on your fans and performers to maximize revenue!\nPurchase sex toys and other kinky accessories to aid the girls' performances and boost viewership!\nPromote your studio on other adult sites and fetish communities all over the web!\nContract up to six horrific STDs including chlamydia, syphilis and gonorrhea!\nA massive wardrobe of over 140 hot new outfits and hairstyles to unlock!\nGrow to become a hugely popular cam site and earn some DOPE ass dick trophies!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"HuniePot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":349367,"name":"Before We Leave","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e9/4e9929d08aa0789e5913b68c83d753ad.jpg","description":"Before We Leave is a non-violent city building game set on multiple planets in your own cozy corner of the universe.\nYour people emerge from a long period hidden underground and they’ve forgotten the world above. Rebuild civilization back to what it once was by building huts, harvesting potatoes and expanding your reborn society to other continents and eventually other planets. Manage resources, discover ancient tech and create a multi-planet network of colonies to thrive in your solar system.\nBut the universe is not always a safe place. Ancient guardians, remnants of your ancestors, will demand your attention and challenge your cities. The planets you inhabit are scarred by the disasters that forced your forebears underground, and those disasters will still plague you if not managed properly. And most of all, watch out for vast planet-eating space whales coming to graze on your planets!\nBefore We Leave is a (mostly) non-violent game. There are no weapons, no fighting your neighbours for control of resources and unless you fail to handle an incoming space whale, your people will not die. Play, expand and chill out at your own pace in your own solar system of rehabilitated planets!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Balancing Monkey Games","platforms":[{"id":0,"name":"PC"}]},{"id":11364,"name":"Ape Out","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b0a/b0a72481e578a70abb8940827ccf1d2d.jpg","description":"Ape Out is a wildly intense and colorfully stylized smash ‘em up about primal escape, rhythmic violence, and frenetic jazz. Build up nearly unstoppable momentum and use your captors as both weapons and shields to crush everyone on your procedurally generated path to freedom.\nStylish Escape: Embrace bold colors and a dazzling perspective as you rush through tight corridors, open areas, and twisting labyrinths on a mad dash for freedom. Overcome all manner of human opposition, nefarious traps, and breakable obstacles to find each exit and escape captivity.\nGrab and Smash: Unleash your primal instincts and incredible strength to overpower your captors. Hold them steady to create a human shield, smash their feeble bodies into walls, or throw one into another in a violent explosion of humanity.\nDynamic Soundtrack: Find your rhythm in the chaos as a dynamic soundtrack of drums, cymbals, and decapitations drive the action to the edge of mayhem.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5926,"name":"Democracy 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f69/f690eafb7cbb29778d129aac3772d433.jpeg","description":"Democracy 3 is a government simulation video game developed by Positech Games in 2013. This is a sequel of Democracy which was released in 2005. \n\n###Plot \nThe player’s goal is to create a democratic government while performing as a president or a prime minister. For the sake of it, he can implement and develop tax, economy, foreign and other policies, which affects the society. Smart policies can attract future voters and help win the elections. The player should also deal with appearing problems such as homelessness, strike actions, and crises. \n\n###Gameplay \nThe player can choose the nation to play for. Then his first aim is to win the elections; it includes building a strong campaign, winning the factions support, making up the electorate, and hold power in the government. New events and dilemmas keep happening during the game, so the player should also be able to refocus and deal with a situation; otherwise, an event might have ongoing consequences. \n\n###Key features \nThe player can change the flyers to change the amount of funding, regulate taxes or laws of a particular area. It is important to balance the government budget through the whole game as to change policies; one should spend political capital held by ministers. Each political decision requires funding and has its aftereffects. There are 21 electorate groups, and as the player makes political decisions, each group changes its attitude towards him.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Positech Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20966,"name":"Gun Metal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/861/861780e580119b036c8b99044bd55b90.jpg","description":"Gun Metal is a futuristic first-person shooter developed by Rage Software. It was released on different dates in different geographical regions.\n\n###Plot\nThe game's core story revolves around a human colony on the distant planet of Helios. Extra-terrestrial entities invade the planet, causing the planet-wide mobilization of its armed forces. The player controls a soldier, who is sent to repel the alien attack in his trusty mech suit.\n\n###Gameplay\nThe game combines both a shooter and an aerial combat simulator.\n\nThe mech that is controlled by the player is developed as part of a Gunmetal project. These mechs stand twelve meters tall in their default configuration and are equipped with numerous weapons and force fields, that absorb an enormous amount of damage.\n\nUpon transformation, the mech becomes a modern reactive hypersound plane, similar to the American F-22 Raptor series of combat planes, that is equipped with a set of advanced sci-fi weaponry, including napalm, impulse cannons, harpoons, and ballistic rockets, yet it loses the ability of using its force field, thus rendering the plane mode much less sustainable to damage. \n\nThe players can choose the set or armament that is installed on their mech, with 12 weapons present in the game. Each weapon has its own up's and down's hence why it is necessary to pick them carefully.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Rage Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"}]},{"id":12735,"name":"Shakes and Fidget","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b29/b29afd3220bb853a0f9104047bd439af.jpg","description":"Shakes and Fidget is a fun fantasy RPG satire and an award-winning role-playing game at the same time! Sounds crazy? Over 50 million players make it one of the most popular online games in the world!\nCustomize your own comic book hero and conquer the top slot of the Hall of Fame! It’s not an easy task with real players standing between you and victory in the PVP arena. Together with your pals from your guild you become stronger, more invincible, and find lots of epic loot! Accept quests, complete exciting adventures, level up, collect gold, obtain honor, be \"overpowered\" and become a living legend!\nFEATURES:\n* Free to Play\n* Award-winning multiplayer RPG\n* Unique comic book look\n* Tongue-in-cheek humor\n* Guild fights, friends-chat and messaging system\n* Easy to learn, easy to use, ingenious gags, regular updates\nAND EVEN MORE FEATURES:\n* 8 selectable races and three classes\n* PvP against other real players\n* Thousands of weapons and magical equipment\n* Exciting quests and creepy dungeons\n* Fully customizable character image in comic book look\n*December Update 2015: Shadow world with 150 tricky enemies\n*October Update 2015: \"The Fortress\", 14th Dungeon, bigger backpack","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Playa Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":604,"name":"Prominence Poker","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e81/e81dce2619c78b1cc045f078658590b8.jpg","description":"Welcome to Prominence Poker, a game that pits players from around the world against each other--and devious AI--to build the rep, prestige, and bankroll needed to be, and beat, the best of the best.\nRich World\nSet in the city of Prominence, a gambling paradise founded by crooked folks looking to go straight, players will face down four factions as they play their way solo to a final showdown with \"The Mayor\"--the mysterious town founder who will guide the player through their career.\nRobust Community\nBeyond solo play, gamblers will find a deep multiplayer experience with regularly scheduled events, daily challenges, tournaments, ranked modes, and even more as the game evolves over time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":573124,"name":"Necromunda: Hired Gun","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/759/7598ff65521e54fc58cb4578c5f2134c.jpg","description":"Necromunda: Hired Gun is fast-paced and brutal, giving you endless options on how to engage your enemies. Wall-run, double-jump, use your wrist-mounted grappling hook to rush towards, disarm, or avoid enemies - and that’s before your upgrades. Everything from your brain to your legs to your pet dog can be enhanced as you gather money from your contracts.\n\nYour cyber-mastiff is your only true companion - half-dog, half-robot, and ready to kill for you in exchange for treats. He warns you of enemies, can insta-kill them with a bite to the neck, and generally watches your back. In return, you can keep him hale and healthy with the best augments money can buy.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Streum On Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]}]