[{"id":14949,"name":"BASEBALL STARS 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/257/2574e487c7b45000559de02f8acc42ab.jpg","description":"Lace up your cleats, and step onto the diamond with the pros of “BASEBALL STARS 2” on Steam! You’ll find everything you’d expect in a classic game of baseball, but with an arcade feel and intense action that distinguishes it from the pack. MAIN FEATURES・1P PLAY:\nPick one of six unique teams from cities around the world, and take on the CPU in a 15-game tournament!! Think you have what it takes to win the pennant?\n・1P VS 2P:\nSquare off in local play against a friend in nine innings of excitement and enjoy split-screen views and close-up shots worthy of any highlight film together!\n・SETTINGS:\nConfigure your controls, display language, video and audio settings at your convenience for the best “BASEBALL STARS 2” experience on PC!\n** WILL NOT RUN ON Windows XP **","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"DotEmu","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":10043,"name":"Serious Sam VR: The Second Encounter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aff/affa7ba39835366b20637acea64e35cc.jpg","description":"Serious Sam VR: The Second Encounter is a sequel to Serious Sam VR: The First Encounter – a frantic arcade action FPS, featuring singleplayer and co-op campaign modes, various multiplayer modes, all presented in glorious VR with Croteam's new Serious Warp movement system.\nGrab your VR headset and explore Sam's chaotic world of extreme violence and endless fun.KEY FEATURES:Serious Sam Fusion 2017 integration - receive free updates for this game through the central hub. Oh, and play cross-platform with players of the \"flat\" version to find out what's the ultimate combo: hi-tech motion controllers or good old keyboard & mouse\nMoves like Jagger - Serious Sam VR: The Second Encounter features a built-in (blink) teleportation system that allows you to move quickly and avoid charging enemies with the help of Sam's translocator device. You can tweak and adjust the way you move through VR space to best suit your playing style by using our own Serious Warp (TM) locomotion. Feeling much more hardcore than that? Use the smooth trackpad/analog stick movement and go full locomotion.\nNot another single-weapon game – Keyboards are for typing, so keep your fingers off. Grab a weapon, one for each hand, and boost your stopping power with Sam's new toys: Sniper Rifle, Flamethrower and Chainsaw! Use different weapon combinations or dual-wield two of the same to defeat Mental or use your arsenal in a deathmatch against \"flat peasants\".\nOld-school, but nice and shiny – Visit South America, ancient Mesopotamia and Medieval Europe, uncover over 130 hidden secrets and lose yourself in one of the most impressive VR experiences yet, all powered by the latest Serious Engine 2017.\nSteam Workshop Support - where you will be able to submit your content creation or download new player-created modifications.\nFull blast singleplayer action – Go back through time and use all of the available firepower to go head to head against five new enemies and three nasty bosses. Choose between five difficulty settings that can satisfy everyone - a gentle flower looking for some casual fun or a death machine ready to spread mayhem in virtual reality.\nPick your poison - Plunge into chaotic 16-player versus multiplayer modes, some unique and others based on campaign levels, or enjoy the classic co-op action in a 12-level cooperative campaign mode featuring several difficulty settings, increased enemy strength (based on player count), friendly fire/infinite ammo options, and much more. Play the entire co-op campaign in classic 80's arcade style with limited lives.\nFREE DLC - SSVR: The Second Encounter includes the DLC Legend of the Beast, available for free with the VR version.MULTIPLAYER MODES:Beast Hunt and Team Beast Hunt - Compete against other players, or teams in Team Beast Hunt, hunting down various enemies to see who can get the best score at the end of each campaign level!\nSurvival and Team Survival - Alone or with other team members, fight off endless enemy attacks in a specially designed survival map, and try to survive for as long as possible!\nDeathmatch and Team Deathmatch - Watch all hell break loose in free-for-all or team based battles with classic deathmatch rules!\nMy Burden - Hold the special item and protect it from others in an attempt to get the highest score and secure your victory!\nLast Man Standing and Last Team Standing – Use your wits and reflexes to help your team or yourself to be the last man standing in these single-spawn modes.\nCapture the Flag - Infiltrate the opposing team's base, steal their flag and secure it to get points, while also defending your own.\nInstant Kill - It's simple - you get hit, you die!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3808,"name":"Zen Pinball 2","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3b6/3b6fa6310fc32399539c57b0bbe23ce1.jpg","description":"All of your favorite pinball tables are now available on PlayStation®4 system! Download the free Zen Pinball 2 platform and access to the best pinball library available.\nThe fantasy themed Sorcerer's Lair table is available for free play for all players!\nDownload your Zen Pinball 2 PlayStation®3 system purchases on PS4™ at no additional charge!\nIf you already own Marvel Pinball, Marvel Pinball: Avengers Chronicles, Star Wars™ Pinball, Star Wars™ Pinball: Balance of the Force, Plants vs. Zombies, Earth Defense, Epic Quest or Paranormal, we invite you to import these to PS4™ at no extra charge!\nThere will be more tables added to Zen Pinball 2 soon!\nVideo output in Full HD 1080p requires 1080p native display.\n3D display with compatible 3D active glasses (sold separately) required for 3D features. Visit www.us.playstation.com/support/3D for details.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStation®Plus subscription.\n2-4 players\n11MB minimum save size\nDUALSHOCK®4\n3D Game\n1080p HD Video Output\nOnline Play (Optional)\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n'Zen Pinball' and 'Zen Pinball 2' are trademarks of Zen Studios Ltd. © 2007-2013 Zen Studios Ltd. All rights reserved","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Zen Studios","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"}]},{"id":743401,"name":"Super Monsters’n Girls","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb7/bb7b646861bf2040f5c9d1386ace625b.jpg","description":"- A pixel art side-scrolling action game\n- The protagonist is male, while all enemies are monster girls\n- 28 enemies\n- 56 H animations (as of April 30th 2021)\n- Please test the trial version before purchase to confirm compatibility.\n- Slowdown may occur when running the game with security software in the background","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":387292,"name":"Book of Yog","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/849/849c6a84011b79c48e8279673d8817a2.jpg","description":"From Game DevelopersWe are a small independent game team, and we hope to create a rich-content and energy-saving idle & simulation game.\nWhat we want to present is not only current systems such as role collection, skill matching, equipment manufacturing, line-up combination, resource allocation etc., but much richer playing methods through continuous development. For example, the simulation construction system in “ARK: Survival Evolved”, etc.\nBecause it can't be presented as a perfect form in a short period, the team decides to open the game in a free mode to let players participate in the continuous production and improvement process. The game will have weak internal purchase content, thank you for the understanding and support of all you players.\nFrom the beginning of Early Access, we will keep updating every 2-3 weeks. We hope that we can steadily add content to the game for 3 years or even longer, because this is a business mode that supports our pursuit: stable updates bring healthy consumption mentality and endless joy to the players, pleasant players recommend the game to their friends, and new players continually join the game, which provide us with the fund to perfect the game.\nAbout the Game\nCollect heroes, develop kingdoms, and explore one of the most in-depth idle RPG ever!\nYou can call heroes to form a team, and lead the army against the ancient evils on the mainland, develop your own camp into your empire, and finally explore the hidden secrets behind this disaster world.\nEven if not online, you can earn resources. You can make a free combination with a large number of heroes, skill gems, equipment, talents, and seals. Come and create the strongest hero and the strongest team that belong to you!\nMain feature\n1. With the effort-saving design that allows automatic gaming, plus the complex equipment, skill & hero system, there is no need to waste time on meaningless fighting and upgrading. The only thing you need to consider is your strategy and the combination of heroes, and the game itself will take care of the rest!\n2. There are more than 40 heroes (16 open in the EA version) available for choosing, which fall in 6 categories: guardians, cabalists, pioneers, auxiliaries, snipers & assassins. There are multiple heroes to be chosen in each category, and each hero has his unique skills, fighting modes and growth systems. Enthusiasts of simulation games must not miss this!\n3. Players can collect skill gems and match them freely according to their needs to create a variety of interesting skill combinations, which greatly improves strategic complexity and fun of the game！\n4. The game has plenty of team combinations, as well as flexible and changeable level settings, which makes the game strategically challenging!\n5. With numerous ways of collection, players can collect materials to make their desired equipment, props, and even heroes!\n6. Monsters& equipment are randomly generated, which makes every battle unexpected and interesting!\n7. Players now can experience the fun of drawing cards on computer, without having to buy credits nor to play the game for hours and hours. Just start the game, and you can draw cards!\n8. With the sandbox house construction system, players can DIY their own homes and enjoy a relaxing time! （In development, not been opened yet）\n9. Plenty of playing methods and level systems will continue to be released！","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"QiHeShe Technology Co.Ltd","platforms":[{"id":0,"name":"PC"}]},{"id":366894,"name":"Shantae and the Seven Sirens","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/be6/be6a548f22fb9e2d2da35e43dfdeb6e4.jpg","description":"Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there’s trouble in paradise. As Shantae gets caught up in the island’s sinister secrets, she’ll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she’ll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae’s powers to suit their own style of play.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":62526,"name":"Zup! 8","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/116/1161fe28634c03d938de7b3d2b92bb03.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ 2220 Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nExtended panels of Steam's backgrounds were invented by Aevoa\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":52214,"name":"Little Witch Academia: Chamber of Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44e/44e7b3cd697d7092bc2304f9135b6eea.jpg","description":"Uncover the mysteries at Luna Nova Academy and experience the magical world of Studio Trigger style Japanese animation.\nJoin Akko and her friends to work as a team – exploring dungeons, casting magical spells and using witchcraft to ultimately discover the seven wonders and solve the mysterious shift in time.\nBelieve in the magic and utilize power and friendship in this side-scrolling action RPG beat ‘em up.\n• Studio Trigger Style Animation – Get a glimpse into the world of Little Witch Academia from the world renown Studio Trigger, with Exclusive cutscenes made directly be the Anime Studio!\n• Simple and Fun Gameplay – RPG elements and side-scrolling action allows fans to level-up their characters and find drops that enhance builds while exploring.\n• Live the Anime – Follow the familiar storyline, a Heart-warming, funny and cute story for the entire family.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":45693,"name":"Another Lost Phone: Laura's Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e1/7e1b423930d9bd781c9c13c0d791c08c.jpg","description":"Another Lost Phone is a game about exploring the social life of a young woman whose phone you have just found.\nThis game is shaped as a narrative investigation: you have to link elements from the different applications, messages and pictures to progress. Scrolling through the phone’s content, you will find out about Laura’s life: her friendships, her professional life and the events that led to her mysterious disappearance and the loss of this phone.\nFeatures\nCombine your findings from the phone’s apps, messages and photo galleries to uncover the mystery surrounding Laura’s disappearance.\nDelve into the professional life, relationships & social habits of a young adult in the digital age. Experience a relatable story which helps build empathy with the characters, allowing to explore difficult topics and social issues.\nAct as yourself in a game that bridges the gap between reality and fiction. If you close the app but still think about the game, have you truly stopped playing?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":30520,"name":"Age of Mythology","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/584/584f4c934f490c17462cbd43477fa965.jpg","description":"A spin-off from the Age of Empires series, Age of Mythology shares most gameplay elements from AoE except that it derives from mythology instead of history. Players lead a civilization, same as AoE, but now players can train and maintain mythological creatures like Hydras, build fantasy buildings like the Gaia Forest and wield powerful spells and curses obtained from worshipping gods. The game features a single player campaign and multiplayer modes through LAN.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"PC"}]},{"id":25465,"name":"Iron Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02d/02d9794a728e08aff562774535103fb8.jpg","description":"\"Tony Stark had it all: a genius mind, fame, and even a multinational\ncorporation. But his life would soon change forever. During a routine\nweapons test in the Middle East, power-hungry militants led a violent\nambush against Tony and claimed him as their prisoner. Armed with Stark\nIndustries weaponry, Tony’s new foes demanded he construct a new\nultimate weapon for them. Instead, with the help of fellow captive\nYinsen, Tony built his own ultimate weapon – a powerful suit of armor\nthat served as the key to his heroic escape.\n\nAfter returning home, Tony’s near-death experience drastically altered\nhis outlook on life. The attack against Tony – with his own creations,\nno less – inspired him to cease production of all Stark Industries\nweapons, despite the protests of longtime family\n\nfriend and mentor Obadiah Stane. And that wasn’t all. Aided by his\ncharming assistant, Pepper Potts, and equipped with a new suit even more\nadvanced than the one used in his escape, Tony took it upon himself to\ndestroy all Stark weapons in enemy hands – personally. He became more\nthan a man. He became Iron Man.\n\n\"\n\nBecome a one man army as the unstoppable Iron Man! Customize your suit\nand battle against armies of fighter jets, tanks, armored Super Villains\nand more. Blast into hardcore shooting action and explosive combat from\nthe film as well as exclusive content created just for the game.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Secret Level","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"}]},{"id":22440,"name":"Dreamscapes: The Sandman - Premium Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/690/690aa315cd35ac92cf71686b5f3a5a00.jpg","description":"As a child, father often told Laura that she is special. But Laura's father died before her full age, and Laura didn’t knew what her father had said about her speciality. In memory of her father Laura kept as remembrance an amulet “the Dream catcher” - her father gave it to Laura since she was a little girl, as Laura complained that she has nightmares.\nSuddenly her favorite Dream catcher disappears, and Laura falls asleep during her concert. The doctors shrug their shoulders - she fell into a liturgical dream, and in spite of all their efforts she’s not coming back to life. There it was the Professor Sanders offered his services.\nWe play for an Professor’s Assistant - volunteer, who offered himself to participate in the experiment, and bring Laura back to life.\nWith help of Professor’s invention - “the Dreams Machine” - the player will have to make the dangerous journey through the subconsciousness of Laura, find her, and try to get to wake up getting to know about the reasons why she fell into a coma.\nDestroying Laura’s nightmares one after another, the player realizes that Laura guides him to her, leaving the pages from her diary and tips. Laura becomes stronger with every destroyed nightmare - it is seen by the fact that scary world transformes little by little.\nGradually, the player learns about the Sandman, the Dream Guardians, and the fact that Laura is chosen, the world was waiting her appearance for many years.\nHaving collected all Dream catcher, Laura plans to destroy the Sandman, and to interrupt the dreaded rite.\nNow when Laura got her Dream catcher, the Sandman has no control over her, but he is furious and promises to revenge. And his next victim – Tim – the best friend of Laura. To be continued.Key features: Original game world\nAn intriguing plot\n50 game locations\n16 mini-games\nMore than 50 3D movies and cutscenes\nUnique meta-game on the beholders’ search (Hidden Object’s variation mechanics)\nMeta-game on Dream catcher’s search (puzzle)\nMeta-game on diary pages’ search with gaming events’ background\n2 game modes (normal and advanced)\nAchievements’ System","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":21352,"name":"Airport Simulator 2014","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e8/3e8816a93164e48735d08d620d3596b1.jpg","description":"Booming turbine noise, kerosene smells in the air and constant change and new challenges: The daily life of a large airport is perfectly presented  and is a particular challenge in this professional and economic  airport simulation.\nWhether refueling  super jumbos, or coordinating  air traffic controllers and technical staff, or even organizing perfect catering: The Management of this airport will always have new challenges for you!FeaturesThe most detailed and comprehensive simulation of the events at an international airport\nMany management and business options for the expansion of terminals and extension of runways\nCountless missions and tasks that the player has to fulfill in order to guarantee a successful airport","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"United Independent Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":21213,"name":"OMG Zombies!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ca/9ca0aa0433ed71dc67fd9dddec743dda.jpg","description":"OMG! Alert! Alert!  The City of Redfield has been hit by an outbreak of exploding zombies!  For cool and unimportant reasons these suckers literally explode when shot, showering their zombie brethren with gore and causing chain reactions of showering zombie gibs with just a single bullet!\nAs a lone cop armed only with bare wit, a large-calibre sniper rifle and bullets coated in a zombie-exploding pathogen, you are the last man standing at the epicentre of a zombie outbreak.  Your mission?  To succeed where the police and army failed by clearing the streets of 8 different strains of bloodthirsty zombies and stop Armageddon in its tracks!\nUse your sharpshooting skills to vanquish 100 branching levels of zombie hell across 40 unique environments in this hugely addictive chain reaction shooter.  Earn 400 shiny medals and cold hard cash to buy 100 different upgrades, all designed to MAKE THOSE ZOMBIES EXPLODE!\nOMG Zombies is an awesome reimagining of a genuine classic: the critically acclaimed OMG-Z, a top-ten all-time Metacritic rated PSP game and ranked as Metacritic’s best action title ever released on PSP!  The guys at Push Square gave it 89% and called it “a must buy” game, Escape Rope claimed it’s “...one of the best zombie games in recent memory” and Defunct Games gave it an A rating saying it’s “so addictive... I still can't get enough of watching the explosive chain reaction caused from a well-placed bullet.”\nNow the new and improved OMG Zombies features completely redrawn HD graphics, more gore, more levels, more upgrades and all-new content including 12 trophies, 100+ leaderboards, a 20-stage ‘Prestige’ system and 5 beautifully illustrated endings.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Laughing Jackal","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":19657,"name":"Spate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a65/a65f5feb889d1d470d9b1640d1e82f47.jpg","description":"Spate is a surreal experience set in a world that seeks to draw the player into its reality. Spate is a dark, brooding, and beautifully crafted emotional journey that is seen through the eyes of a struggling addict.  Created by former Disney & Jim Henson artist Eric Provan, this artistic game is a story about one man's struggle and descent into madness. Fueled by absinthe hallucinations and haunting memories, Spate delivers a deliciously eerie adventure as the main character deals with the tragic loss and grim reality of the death of his daughter.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Eric Provan - Ayyo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17196,"name":"Unearthed: Trail of Ibn Battuta - Episode 1 - Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/439/43919cbc98463693afa57694ae751636.jpg","description":"Introduction:Unearthed is an episodic third person Action Adventure game set in modern day Middle East. The game is available in full Arabic and English voice over and features 21 Languages for Menu and Subtitles.\nThe game features the voiceover talents of Troy Baker (The Last of Us, Bioshock Infinite), Jeff Rosick (Friday Night Lights, Metro), Tara Platt (Resident Evil: The Umbrella Chronicles, Naruto, Halo 2, Charmed) and David Lodge (COD:MW2, World of Warcraft, Fallout 3)Story Synopsis:When fortune hunter Faris Jawad and his sister Dania receive a call to visit Morocco they embark on an exotic adventure throughout the middle east on the trail of the famous Muslim explorer Ibn Battuta.\nThe trail won't be clear however as Faris will have to overcome an unholy alliance of a militia army leader, a weapons dealer and a wealthy antiquities smuggler who are after the same goal.Key Features:Travel across the Middle East from the wild life of Moroccan Atlas mountains to the alleys of old Damascus through the port of Alexandria and the metropolitan city of Dubai.\nUnique mix of platforming, melee fighting, shooting and stealth gameplay.\nPresented in a TV style episodic format along with recaps of previous episodes and teaser cliff hangers of what lies ahead.\nUnlockable Survival Mode: Battle against endless waves of enemies (Mummies, Zombies, Ghouls) across 8 varied maps featuring three exclusive maps designed for PC and Mac.\nUnlockable Extras: Concept Art, Renders, Animatics, Cutscenes, Character Gallery, Treasures\nAvailable in 21 languages for menus\\subtitles. Voice-over in Arabic and English.Gold Edition Features:This Gold Edition contains over 120 fixes to the console version based on the reviews and player feedback, they are summarized as below:\nGeneral: A restructured tutorial level to better introduce the game mechanics, No more colliding with ragdolls and small objects such as broken pot pieces which allows for easier movement, invisible walls to prevent falling from high surfaces, clear font size for hints and facts in the loading screens, re-recorded all the Arabic voiceover to remove the extra echo.\nHand to Hand Combat: Fully revamped hand to hand fighting system with brand new animations, full camera orbit control, more fluid response and streamlined special moves .\nShooting System: Re-balanced all the weapons to allow for weapon specific range, accuracy, reverb zones, recoil, auto, semi-auto and manual targeting, and brand new weapon SFX.\nDriving System: Improved car handling, no more flipping when turning at very high speeds, orbit camera, Better driving enemy AI, Tire tracks, Full Physical Damage Model for the player car with smoke, sparks on colliding with other cars, props and buildings.PC/Mac Exclusive Features:Supports Full HD 1920X1080 at 60 FPS\n4X the texture resolution of the console version\nHigh Quality Anti Aliasing\nVery High Resolution Shadows\nMotion Blur\nScreen Space Ambient Occlusion\nAmbient Obscurance\nScreen Space Reflections\nVignetting\nChromatic Abberation\nLens Dirt Layer\nFog effect\nAnaglyph 3D Glasses Support\nExclusive \"Tangier Night\" survival level\nDamage effect shown on the player car when hit by other cars or objects[/list]Follow Us:For more information and to receive exclusive updates about Unearthed:\nWebsite: http://www.unearthedgame.com\nFacebook: http://www.facebook.com/UnearthedTheGame\nTwitter: http://www.twitter.com/UnearthedGame\nYoutube: http://www.youtube.com/UnearthedGame\nE-Mail: info@sema-phore.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Semaphore","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15344,"name":"Reassembly","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72f/72f47e11d7649611d85f571fcc8ee519.jpg","description":"And through the Kickstarter gauntlet we have arrived. Yes, we have a procedurally-generated universe to explore. Yes, we have eye-gogglingly gorgeous vector-based gameplay coupled with particle effects so effortlessly effervescent that you won't have time to wonder if \"effortlessly effervescent\" means anything coherent. And yes, we have noises and musical moods that take a warm soapy sponge to your brain and massage it into cerebral splendor.\nBUT YOU DON'T HAVE TIME FOR THAT!!!\nYou're too busy crafting the perfect vessel, a spaceship pristine and precise and, perhaps, powerful, agile, and envy-inducing. Your shapes and colors will induce both fear and wonder into the electronic hearts of whatever insectoid, angley, squarish, plantlike race of alien ships that you come across in your digital safari.\nAnd then you grow. And it changes everything. Now your left wing must become your right wing in a lopsided arrangement of fancy new weaponry and mega-buffed shields. You recall thinking when you last were destroyed (and you will be destroyed), that you really needed to buff up that armor. Right? Definitely.\nAnd then you grow again. And again. And now you're a battleship capable of producing your own fleet, and each member of your fleet can spawn it's own fleet, and you need it. Your enemies are constantly changing shapes, sizes, and intensities as ships created and honed through the experience of a thousand battles find their way from their creator's computer to yours, leaping into your universe with all the mercy in the world of NONE AT ALL.\nIt's time to visit the electronic tide pool.Reassembly Gorgeous Vector-Based Graphics\nProcedurally Generated Universes\nRidiculously User-Friendly Spaceship Designer\nA Beautiful and Haunting Soundtrack by Peter Brown (Peaks)\nMore Particle Effects Than You can Shake a Stick At\nVery Smart and Reactive AI\nPhysics that Give Weight to Your Creations\nAsynchronous Multiplayer: Universes Populated by Fellow Players","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Anisoptera Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14567,"name":"POLYWAR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/83b/83bd77cdd99ec4ff66cc5d8320ae0853.jpg","description":"PolyWar is a free online FPS-based PvP game. Launch the game, create a server, or join servers created by others to jump straight into the fun. You can play with up to 4 friends. For now, in this game where you can only play PvP with your friends, players try to get the most kills within 5 minutes, and the player with the most kills becomes the winner of the round. With its low-requirement graphics, you will enjoy a sweet yet action-packed gaming experience – and it's completely free!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"exagongames","platforms":[{"id":0,"name":"PC"}]},{"id":10678,"name":"Kindergarten","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1e6/1e60365829fba7da449c8472713b6310.jpg","description":"Kindergarten is an abstract puzzle adventure game. You play as a student in a school that’s a bit…off. The teacher is trying to get rid of her kids. the janitor is frequently seen cleaning up blood. The cafeteria is serving the same slop over and over again. Kids are walking around with strange devices planted on them after visiting the principal, and one of your fellow classmates has gone missing. It’s up to you to figure out what’s going on, because your life might depend on it.Classic Kindergarten fun!Take part in show and tell!Play house with Cindy!Get beat up by the school bully!Talk to the weird kid!Destroy school property!Get poisoned!Solve a missing person's case!\nYou know...all the things you did while you were in Kindergarten.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SmashGames","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"}]},{"id":846314,"name":"RUNGORE: Beginner Experience","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/94c/94cae6d3851bf90083914ba3ada3ca28.jpg","description":"Card game mechanics - check. Real time battles - check. Silly humor - check. If this isn't the game of your dreams i don't know what is (Also we have hidden memes everywhere lol)","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"YOUR_MOM'S_HP","platforms":[{"id":0,"name":"PC"}]},{"id":327214,"name":"Just Dance 2020","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/731/73167faf2a17fd45aee90510840bdc88.jpg","description":"ust Dance® 2020 is the ultimate dance game with 40 hot tracks from chart-topping hits like “Old Town Road (Remix)” by Lil Nas X Ft. Billy Ray Cyrus and “God Is A Woman” by Ariana Grande. Keep the party going for hours with songs for the whole family to enjoy!\n\n40 Hot New Tracks: Keep the party going with the latest hits like “Old Town Road (Remix)” by Lil Nas X Ft. Billy Ray Cyrus.\nFree Just Dance® Unlimited: Dance to 500+ of your favorite songs!  A free one-month trial is included with every purchase.\nChoose Your Favorite Songs: Create your own playlists to customize your Just Dance parties!\nKids Mode: Enjoy eight new kid-friendly songs, offering a fun experience for our youngest players.  \nPlay Co-op with Friends: Dance to our newest universes and beat the high score together.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox One"}]},{"id":282828,"name":"STEINS;GATE 0","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/309/3098871f6c34615173edca785ebbf1d3.jpg","description":"A new story in the critically-acclaimed STEINS;GATE series. From the depths of despair--explore a whole new world line. Your favorite characters return alongside a brand new cast!\n\nKey Features\n\n- STEINS;GATE 0 continues the time travelling theme - but adds artificial intelligence as its central hook \n- Help a group of young students bend time to their will and prevent the onset of World War 3 \n- Beautiful artwork and engaging story for an unforgettable experience \n- Tells the story of an 'Alternate Worldline' - what happens if players failed the original story \n- Interact with the story using your smart phone - answering (or not!) your phone, and your responses, will determine the outcome to the story","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nitroplus","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":272526,"name":"Steel Circus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/302/3023872fcbc948d8b829318da203fb43.jpg","description":"CLOSED ALPHA TESTWe'll be holding our Closed Alpha Tests for Steel Circus very soon and we're going to need your help! Become one of our very first players and sign up here: https://www.playsteelcircus.com/AlphaTest We look forward to seeing you in-game and hearing your valuable feedback! Stay tuned for upcoming announcements.\nFAQWhen will the game launch?\nCurrently our goal is to enter Early Access on Steam early next year.\nWhat is the current status of development?\nSteel Circus is currently in pre-alpha, meaning production of the game and content is still ongoing. In this stage of production, you can expect regular updates and changes to core mechanics of the game, new features introduced and tested, as well as a noticeable amount of instability and bugs, which we are addressing and improving thanks to the valuable player feedback we receive from our awesome community of Early Access player (thank you!)\nWhat are the next milestones?\nThe game is currently being tested internally. The next big milestone will be the beginning of closed public alpha testing within first half of 2019.\nThe easiest way to stay up-to-date is to join the Steel Circus Discord community, follow Steel Circus on social media, and to sign up to our newsletter, where you’ll be the first to know about testing events, giveaways, and the latest news about Steel Circus.\nSteel Circus Facebook: https://www.facebook.com/playsteelcircus\nSteel Circus Twitter: https://twitter.com/playsteelcircus\nSteel Circus Discord: https://discord.gg/cMGsJ7Z\nCan I expect regular updates?\nAbsolutely, we have big plans to support “Steel Circus” with regular content updates and new features. There will be new champions, arenas, customizations and most importantly competitive events in the future. It’s our goal to include our players in the future progress of Steel Circus and we’re happy to invite all of you to join on us on Discord and share your thoughts, feedback and suggestions!\nHow many champions will there be in the final game?\nWe’re currently working on 5-7 champions during our upcoming testing phase, and our long-term goal as we approach launch next year is to feature 15 to 20+ champions which we’ll regularly introduce to the game, along with new content updates like customization features and new arenas. During this phase of development, we’re focused primarily on delivering a balanced and fair gameplay experience for our players while introducing new content.\nHow many Arenas can I expect?\nThere will be 5 to 10 factions in Steel Circus, each represented with at least one arena. We also plan on having multiple playfields with different layouts and gameplay elements per arena. For Early Access we plan on having 2 arenas with 2 variations each, meaning 4 different arena playfields.\nWhat about other game modes?\nFor now we’re concentrating on the core competitive game mode, with our goal being to make gameplay as fun and interesting as possible from your 1st to your 1000th match. That being said we do have plans to add different game modes that add exciting variations of the core gameplay after Early Access.\nWhat will be the business model of Steel Circus?\nDuring Early Access there will be a few premium packages available to purchase Steel Circus. All packages will include every current and future champion for the lifetime of the game. In addition to that, there will be in-game transactions for unique cosmetic content which will not affect the core mechanics of the game. We will not include any mechanic affecting paid features, or any form of pay to win or loot boxes in the game.\nAbout the Game\nGame\nSteel Circus is the solar system's largest sporting event. Players control one of several champions with unique abilities in competitive online matches. Throw, pass, tackle and dodge to score goals in a game where skill, team play, and tactical decision-making pave the road to victory!\nWorld\nThe game is set in the year 2350. After a long period of open conflict and war there is frail peace in the solar system. Every year the most powerful factions meet as the Solar Council behind closed doors to discuss politics while Champions, representatives of each Faction, compete against each other at the Steel Circus in front of roaring crowds.\nSteel Circus is a gigantic spectacle every soul in the solar system is watching closely. Champions are celebrated heroes, beacons of hope and a demonstration of power as they clash in the arena.\nChampions\nBefore each match, you need to choose a champion to play. Each champion has a unique playstyle and two special abilities.\nSome champions are great at supporting their team with buffs and heals while others are brawling powerhouses or specialists in wearing their opponents down from afar.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Iron Mountain Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":61899,"name":"Music Racer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/09c/09cccb3440a7e86cc4c2899aa36f2cfd.jpg","description":"ATTENTION! YOU NEED YOUR OWN MUSIC FILES (MP3, Ogg, Flac, Wav) IN ORDED TO PLAY THIS GAME!\nStreaming from youtube is available! Choose your favorite YouTube video and race it!\nRush along the fantasy track in your car or fly along the space tunnel to the sounds of your favorite music. Choose your favorite music files from your hard drive such as MP3, Ogg, Flac, Wav and play! Or choose a YouTube video and race it!\nGather beats, catch the rhythm. Get ready for a breathtaking race along the unique tracks of this game. Listen to your favorite music while driving. Each music track you select will influence the time of a round, length of a track and movement speed. Listen to the beats of music and maneuver in order to pick up beats flying by. Try yourself on different tracks.\nThe game may use music files on your device. We do not take responsibility for any copyright issues.\nGame supports: MP3, Ogg, Flac, Wav!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Sometimes You","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":54346,"name":"Animal Crossing","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9dc/9dc9fbd2c2054a3a9b7c33a906546bea.jpg","description":"Animal Crossing is a life simulation video game developed by Nintendo EAD and published by Nintendo. Another version, Dōbutsu no Mori e+, was released in Japan in 2003, adding the improvements made to Animal Crossing plus some additional features.\nAnimal Crossing is an open-ended game in which the player character moves into a village populated with anthropomorphic animals. Throughout the game, the player can interact with the animals as well as other players through the GameCube's memory card. The game is synced with the GameCube's internal clock and calendar, allowing the game to be played in real-time, which also follows seasons and holidays.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"GameCube"}]},{"id":45942,"name":"Midair","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/04e/04e48e9be89cca2db6d216449b08d3ba.jpg","description":"​*** FREE Progression Pass: Purchase of Midair during Steam Early Access will grant you a FREE Progression Pass on full release in Q1 2018. This means you unlock all gameplay in our progression system FOREVER, even if we add new weapons, packs, etc.\nMidair is a fast-paced jetpack shooter set in a breathtaking new sci-fi universe. Use movement and physics to your advantage, outwit your enemy from every angle, build bleeding-edge defenses, and fully customize the way you play. With up to 16v16 large-scale infantry and vehicle combat, you'll never look at a shooter the same way again.TRUE FREEDOM\nMovement in Midair is an art. It's a flow. It's a learned, practiced skill that when you know it… you just feel it. Using your jetpack and frictionless boots, launch high-speed airborne assaults, expertly dodge enemy fire, and soar from hilltop to hilltop. Free yourself from the ground or become a quick frag for your opponent.\nThe jetpack draws from your armor’s energy pool, so strategically manage your use of the jetpack and energy-based weapons to ensure your battle advantage. Depending on the situation, adjust your jetpack from pushing you upward to giving more maneuvering power. Veteran players know how to manage their jets and energy by instinct.TEAMWORK IS CRITICAL\nA team without coordination is like a shooter without jetpacks. In Midair it's critical that you coordinate your assaults for maximum effect. Take down their automated defenses one by one or sneak past the guards and destroy the generator to cripple their base and expose their flag for a quick grab.\nBut remember, you'll need to keep your flag home too. They'll start by using bombers and tanks to bombard your fortifications and break your ranks. Heavily armored attackers with explosive weaponry will follow, trying to deal critical blows to your infrastructure. After that, elite light-armored enemies who have spent hours studying the terrain and perfecting their movement will race in, grab your flag, and get out -- and FAST.\nRepel the attack by keeping your base's main defenses operational, deploying forward sensors to track their movements, strategically place turrets deal out some extra damage, and get some fighters in the sky to maintain air superiority. With the right team and friends you can depend on, this will be a breeze.CUSTOMIZE AND STRATEGIZE\nOne thing's for sure - when the situation changes, so should your strategy. Midair features complete customization and no preset classes. Pick your armor based on how fast you need to go and how much damage you need to take. Choose weapons to suit your play style. Packs gives you special abilities that can swing the fight in your favor during that critical moment, or help you deploy mobile defenses where it's needed the most.\nYour team composition matters. Before running into the fight, make sure your squad is prepared with the right firepower, support, and intelligence to do the job.THIS IS MIDAIR\nGet ready for a new experience in a shooter with a lot to offer. Suit up. Jets on. Fly free. We'll see you in Midair.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Archetype Studios","platforms":[{"id":0,"name":"PC"}]},{"id":38663,"name":"Runes of Magic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea586ef97b72ffcbccfdb9b698b076b2.jpg","description":"EPIC ADVENTURESUnravel the history of Taborea in over 5,000 exciting quests. Fight against the forces of darkness with your hero and triumph over other players in thrilling siege battles. Unimaginable treasures and magical items beckon in reward.\nPERSONALIZED AND MAGICALHumans, elves or dwarves – the choice is yours! Specialize your character with a range of ten different classes which can be combined with one another to unlock special abilities. Upgrade your gear with the most powerful runes and shape your hero to your own personal tastes.\nMAKE YOURSELF AT HOMEYou are master of your own four walls! Personalize your home and guild castle and use it to celebrate your victories, or prepare for the next great battle with your friends.MINIGAMES AND MORECountless minigames with great prizes await, both for solo players and guilds! Win races, solve puzzles and much more!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Runewaker Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":36514,"name":"Age of Empires III","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27d/27daaa55b3833db3f236ab86e171c0df.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ensemble Studios","platforms":[{"id":0,"name":"PC"}]},{"id":21512,"name":"Planet Alcatraz 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b86/b86a31408855878d0002f1612695829e.jpeg","description":"WARNINGPlease note that the game is available in Russian language only.\nAbout the GameThe sequel to Planet Alcatraz tells the story of sergeant Hartman, the leader of the Ghoul strike unit, who remained MIA in the original game.From Sergeant Hartman record:Age: 38 Earth years. Heigh: 190 cm. Weight: 100 kg.\nBody marks: knife scar on the right cheek.\nGraduated specialist in hand-to-hand combat and usage of cold and Imperial weaponry. High achiever.\nHartman was appointed commander of the reconnaissance and sabotage unit Ghoul. During the insertion to the prison planet Alcatraz the group has been attacked by unknown enemy force. Four cadets where captured, but later escaped the planet thanks to exemplary relief operation. Sergeant Hartman remained MIA.\nSergeant Hartman is the main hero of the sequel to Planet Alcatraz adventure RPG.\nChoose between two gameplay modes: in a new ultimatistic Goblin mode Hartman is a seasoned soldier with nearly maxed combat skills from the start of the game, letting you to concentrate on the story. A regular RPG mode provides a more classic RPG experience like in Planet Alcatraz.\nRandom encounters and improved enemy AI.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":21023,"name":"//SNOWFLAKE TATTOO//","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73c/73c639f978ed8160d607c21d849ca04f.jpg","description":"****EPILEPSY WARNING***** (flashing images throughout)\nStraight from the maths paper of the British bedroom programming scene into your imagination.\n//SNOWFLAKE TATTOO// is a harrowing and stark vignette; a neo - noir exploration of the character and motives of the merciless \"sentient plasma sniper\" of //NPPD RUSH//.\nSet years before, you play the roles of both that sniper and a mysterious, prototype human/bike hybrid she has hacked.\nTogether you traverse and plunder a maze-like frozen storage ship that has been disabled by a huge solar storm.\nIt's here you find your ill gotten reward.\nThis is what your life has amounted to; you traffic in human beings through a trans-dimensional trading post called the abstraction, in the hope you will find your missing sister.\nWhat will you do?, sell these sleeping beauties off for the abstractions crude experiments, leave them to be cut up and turned into other bike hybrids, or save them ?\n- Music collaboration between Dylan Barry and F.tyler fusing the genres of experimental noise, modal ambient and electro.\n- 70's minimalist \"Ghett-ro\" crafting, survive by crafting health  and sentient plasma from biological waste such as Collagen, enamel, unknown and even the \"dollsteak\" you came to steal.\n- perma-death /arena shooter  crossover gameplay with a late 70's early 80's minimalism.\n- You choose your hiscore, do you take pleasure in trafficking these sleeping beauties for big money, or saving as many as you can","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rail Slave Games","platforms":[{"id":0,"name":"PC"}]},{"id":20016,"name":"Black Rose","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4d/f4d8c9a2af840b86a499b9049e94f8cf.jpg","description":"Black Rose is a first-person survival horror game in which you assume the role of Linda, an average girl who heard rumors about an old abandoned funeral home being haunted. No one knows what happened to many of the people who used to work there, but legend says they were murdered. By who? Linda wants to find this out for herself, so she goes to the secluded funeral home. But not long after entering, things go horribly wrong.SCORE\nYour score will be based on 'Close Calls'. Close Calls are achieved by getting close to the enemy without letting them catch you. When your score starts increasing, the enemy is dangerously close. Try to get as many Close Calls as possible to bring up your score, but be aware that you should not let your Close Calls with the first enemy last for too long. This enemy is particularly volatile, and will quickly catch you if you are close for too long.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sir Bedlam Productions","platforms":[{"id":0,"name":"PC"}]},{"id":18065,"name":"SweatShop","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a57/a57c474930bf0eab1d79f64e75dd1fc6.jpg","description":"One day you decide to change your life and open up new business related to the production of clothing. Dark basement, which do not penetrate the sun's rays, cheap tables from KIEA and bought on sale of equipment that barely works. Only hard work separates you and your employees from wealth and fame now. What are you waiting for?\nSweatShop is a incremental game where you're the owner of a sweatshop, you have to hire more staff to work for you and sell products to gain more money. Buy many different upgrades for your workers and make even more money than before. Get as far as expanding the store to get more workspace and even more workers.\nMain Features:\n- Hire more staff\n- Sell Products\n- Expand your shop\n- Catch bonuses\n- Buy upgrades\n- 53 STEAM achievements included","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Duck","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17716,"name":"MISSING: An Interactive Thriller - Episode One","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/190/19056c3db2fbd99dff6039c0f1bbca40.jpg","description":"MISSING is an episodic series bringing the 90's FMV games and classic adventure together in a unique experience. In the first episode you play David Newcastle, the victim. Kidnapped for no clear reason, Dave will have to find his way out and elude captivity while trying to figure out who his captor is. Meanwhile, Detective Lambert investigates a series of mysterious disappearances in the city. Use your brain to solve puzzles, find items and use reflexes in action sequences to help the characters progress in the story.\nThis game includes episode one only.  Future episodes aren’t available yet and will be sold separately.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Zandel Media","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17533,"name":"Real Warfare 1242","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0df/0dfab32308683e729ad2dce1423ea8b2.jpg","description":"Russia during the XIII century was a huge state, much larger than any other European country. Split by internal conflicts, and yet standing strong against numerous outer threats, it was attacked by the infamous Mongol Horde. They came suddenly and pierced through the country like a blazing arrow. The native people fought valiantly, led by a fierce warrior and prince, Prince Alexander Nevsky. Real Warfare: 1242, is a realistic real-time strategy game based on authentic historic events. It invites you to experience the glorious times of princes, knights and vast battles.\nThe player’s goal is to direct Alexander Nevsky through meticulously recreated historic battlegrounds and achieve the greatest of victories by repelling the attacks of Teutonic and Swedish knights, bringing Lithuania to peace and eliminating every single invader in 1242.Key features:\t\t\t\t\tThe engine incorporates state-of-the-art technologies used in real-time strategy titles\nVivid, lifelike real-time graphics\nCarefully maintained historic realia\nVast territories to conquer and control\nSignificant level of depth and in-game freedom\nImproved unit animation (with the transition to motion capture)\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Unicorn Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16965,"name":"Esenthel Engine","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/612/6126cd85188b336264b3a9a27cb9a475.jpg","description":"Esenthel Engine is a Next-Gen Computer Game Engine.\n\"Esenthel\" is a mix of words: Essential and Essence.\nThe engine is free to try in demo mode, however using it requires purchasing a license, there are 2 options available:\n11.40 USD / month\n114 USD / year (20% savings, 9.50 USD / month)Supported Platforms:Windows\nWindows Phone\nXbox\nMac\niOS\nAndroid\nLinux\nWebIn development: Since Year 2000.Used by: Hundreds of Developers Worldwide.Key Features:Very Easy to Use\nAdvanced Graphics and Physics\nHigh Performance\nUnlimited Sized Worlds\nCollaborative Development\nAuto Publishing\n100+ Tutorials and 90+ Documentation Pages Included\nFrequent Updates\nRock Solid - Zero Bug Tolerance\nFree to Try!Collaborative Editor:The Editor is designed from the ground up to be collaborative, which allows to instantly see any changes that other team members make to the game.\nThe Editor can be used in offline mode as well, any changes to the project will be synchronized once it gets online.Advanced Graphics and Physics: Engine supports a wide range of devices, from browsers, mobile phones/tablets, laptops and desktop computers.\nIt can be configured for low quality / fast performance setting, and high quality for more powerful GPU's.\nPowered by Nvidia PhysX allows complex physics simulations having thousands of dynamic objects on the scene real-time.\nSupports plenty of graphical effects, such as - Bloom, Real-time Dynamic Shadows, Ambient Occlusion, Motion Blur, Depth of Field, Glow, Sun Rays, Fog, Cel Shading, Normal Mapping, Parallax Mapping, Relief Mapping, Tessellation, FXAA / MLAA / SMAA Anti-Aliasing and many more!Dedicated Cross-Platform Programming Solution: Esenthel features Code Editor functionality, allowing to edit game codes, exactly the same way on all platforms. Code Editor is integrated in the Engine's Editor, and automatically handles compilation for all platforms (it is integrated to work with Visual C++, Xcode, NetBeans and Android Toolchain). You can write codes once, and they will work on all platforms!\nEsenthel's Code Editor features a unique ability to write C++ codes -without- having to create .h header files.\nThis single feature greatly speeds up programming process, as you don't need to waste time on making header files, rearranging your classes/functions as the Code Editor does that automatically for you.100+ Tutorials and 90+ Documentation Pages Included: Esenthel Editor comes preinstalled with more than 100 tutorials included, additionally you can browse the documentation online here: http://www.esenthel.com/?id=docHeaps of other Features: You can see the vast list of features over here - http://www.esenthel.com/?id=feature_list\nWindows version creates games for Windows, Android and Web.\nMac version creates games for Mac, iOS and Android.\nLinux version creates games for Linux and Android.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Grzegorz Slazinski","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14809,"name":"Project RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7fd/7fdaf53fd687c7ab8ba7833752034bee.jpg","description":"Storyline:\nYou wake up and find you have no idea where you are. Worse, you barely remember anything. The only thing you're holding onto is your sons voice, yelling your name helplessly, and your wife screaming she loves you, but you cant make out what was happening during the time. Ahead of you is a dirt path, so you follow it. You walk right into a village. You look around to see if anyone can help you, but no one looks interested in helping unless you have copper to pay them in return. You go and talk to the ammunition dealer, and he makes you a deal. If you can complete a series of risky quests for him, he will pay you for them individually - Along with taking the time to collect copper, you also set out on your journey to look for your wife and child.\nHow far are you willing to push yourself to remember what happened?\nFeatures:\n- Multiple weapon choices\n- Free to roam map areas\n- Buying, selling and trading with marketers\n- Zombies! (A.k.a Ghouls) - Beware the outside walls of the village\n- Quest choices\n- Bounties\n- Trading cards, badges, backgrounds, emojicons\n- MORE!\nThere are still more features in the game. We are also interested in seeing what the community would like to see!\nMore Info:\nProject RPG is mainly an open world role-playing game, but it also consists of many different genres for example horror, action, story telling and mystery. We wanted to ensure the game has a little something for a larger variety of people, so the quests, depending on how you choose to play the game, will vary from being guided with help to find your family, to being left to find out where to go on your own, to how much of the game you view before completion. There are many sites you will get to explore for example the ghoul invested asylum. Also depending on the quest, and the villager who assigns it will depend on the bonuses you receive after. For example weapons, or unlocked doors.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Acuze Interactives","platforms":[{"id":0,"name":"PC"}]},{"id":14788,"name":"Lords of Xulima","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cf0/cf02ca006dabef5942de6b39430f7e16.jpg","description":"Lords of Xulima  is an original Fantasy RPG set on the mythical continent of Xulima, where Gods and humans once walked side by side. Become the Herald of the Gods and travel to an uncharted land to fulfill your mission of restoring balance in the known world.The Talisman of Golot EditionThis edition includes the game Lords of Xulima and the Talisman of Golot DLC.The Deluxe EditionThis Deluxe Edition includes the game Lords of Xulima, the Talisman of Golot DLC and the Special Digital Rewards DLC. More than 100 hours of authentic Role-Playing Experience   Looking for a challenging adventure?\nIn Lords of Xulima, we do not hold your hand through the journey. We have created a world of diverse regions that are as vibrant with life as they are fraught with danger; from the alluring Golden Woods, through the Great Desert of Pernitia, to the daunting icy peaks of Karraga. You are free to explore and choose which path to follow, but be careful about where the adventure takes you. Your success or failure in Lords of Xulima all depends on your strategies and ability lead your customized party. Immerse yourself in the playability and depth of old school classics, presented through modern visuals and a user-friendly interface. A Tale of Gods and Humans   Discover one of the most epic stories ever written and follow it to its twisted conclusion\nLegend has it that many years ago, people lived in peace on the great continent of Rodinia; a peace that would not last. Soon, the Great War broke out, dragging every kingdom and village down an endless spiral of ruin and desolation. The people prayed for salvation from the Nine Gods, whose unreachable homeland lay beyond the Great Sea, on the forbidden continent of Xulima.\nEventually, the conflict came to a point where it threatened to ruin all creation. Thus Golot, Lord of Works and Dreams, appeared to Gaulen, a seasoned Explorer who lived on a remote island off the coast of Rodinia. The Lord of Works appointed Gaulen to be his Herald on Earth and to set sail for Xulima, so that balance could be restored to the world. Thus begins the adventure of our young protagonist.\nCreate your group of characters  Create and customize five characters to accompany Gaulen on your journey.  With 9 character classes and over 100 useful skills, the possibilities are endless.  Each group will be unique. Who will you decide to take with you? Choose among familiar classes such as the Mage, Cleric, Barbarian, Soldier, Thief, Bard and Paladin or try out the Arcane Soldier and Divine Summoner. Develop your characters’ abilities to suit your play style as they gain experience and grow stronger to face the trials ahead.\nStrategic, fluid, turn-based combat   Discover an addictive combat system. Over 100 unique types of enemies roam the wilds of Xulima , each capable of posing their own kinds of threats to your divine mission. There are thousands of possible strategies to lead the group to victory, including the use of scrolls and divine blessings. Will you be able to match the strength of Nilfonte, the Ocean Titan? Or survive an encounter with Xabraluz, the Demon King of Vilak?","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Numantian Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11095,"name":"Emporea: Realms of War and Magic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5b/f5b5cc183c836ea459b65d4eb6fd09f9.jpg","description":"Are you interested in MMORTS fantasy oldschool wargame? Take part in the strong cooperative features, trade with other kingdoms, conquer and defend your provinces and lead your alliance to victory!\nYOUR CITY\nchoose one of four different races (Orc, Elf, Dwarf, Undead)\ncreate powerful economy\nresearch new units or spells\nSTRATEGY\nconquer new territories\ndefend your fortresses\nsetup alliance, create pacts, destroy enemies\nPVP (strong teamplay element)\nPVE (regular events)\nHERO\n90+ unique artifacts\n90+ hero skills to choose from\n20+ spells\nWORLDS\nnew realm starts every two weeks\n97-day long server ending with a challenging bossfight\nmany special events with unique artifacts and units\npossible to play on web / iOS / Android","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Pixel Federation","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9994,"name":"BATTLECREW Space Pirates","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21c/21ca7cd56b877571fbecff374a0b88f2.jpg","description":"JOIN THE CREW, RAID THE WORLDS\nBATTLECREW™ Space Pirates is a fast-paced competitive multiplayer shooter that offers a really dynamic and nervous gameplay.\nChoose your hero, call a few friends and join in on the fun!\nEach character has unique abilities (attack, defense, and movement attributes) that not only change the entirety of your playstyle but also the way in which you navigate the maps! It's up to you to find the one that suits you best!\nCreate your own crew of pirates and lead your team into intense and epic battles! Steal as much of your ennemies' gold as you can in Gold Rush mode or turn them into space dust in classic Team Deathmatch mode!\nBetween battles, dock at Tortuga, a space station that has become the lair and meeting-place of the worst buccaneers in the galaxy! Find new team members or invite your friends to play, check the leaderboards, and take part in the ongoing community challenges…\nBATTLECREW is more than just a shoot 'em up - it's alive! Players can unlock new content like environments, taunts, skins, emotes and game modes by winning regularly-updated community challenges!Features\nFast and addictive gameplay designed for competition: in BATTLECREW, games are based on skill and cooperation with up to 8 players!\nGold Rush 4vs4 mode in which you and your team have to collect as much gold as possible to win!\nTeam Deathmatch 2vs2 mode in which you have to kill as many of the enemy pirates as you can to claim victory!\n4 character classes, each with entirely different playing style! A richly-colored cast of cool and charismatic pirates!\nPirate Bounties & Pirate Points: BATTLECREW regularly challenges the community! Earn Bounties Points and Pirate Points (XP) to unlock new content (maps, skins, taunts…)\n18 unique maps already unlocked, 9 maps for the Gold Rush mode and 9 maps for the Team Deathmatch mode. More to unlock by the community through our Pirate Bounties system\nTortuga, the game community’ hub, is where pirates can meet, chat, check the game statistics and leaderboard, customize their avatar, check the community challenges, and launch games.\nCrews (Unlimited version only) - Create your own squad of 4 players for the Gold Rush mode or 2 players for the team Deathmatch mode. When your crew is complete, you will enter your own Tortuga.\nTutorials & Training mode Player vs. Bots – BATTLECREW’s fast-paced action can be daunting for newcomers, but that shouldn’t be a problem anymore thanks to a tutorial that introduces novice players to the core concepts of each character’s gameplay and skills.\n20 unique Steam Achievements are now waiting to be unlocked!\nSteam Item Trading – BATTLECREW now supports the Steam Inventory and Trading systems, where players can trade 8 BATTLECREW cards.\nWebsite : http://battlecrewgame.com\nFacebook : https://www.facebook.com/battlecrewgame\nTwitter : https://twitter.com/BATTLECREWGame\nYouTube : https://www.youtube.com/battlecrewgame","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DONTNOD ELEVEN","platforms":[{"id":0,"name":"PC"}]},{"id":4167,"name":"Mass Effect Trilogy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/036/036b0631f855ec96a4a2065511635116.jpg","description":"As Commander Shepard, rise to become the galaxy’s most elite soldier and lead an all-out war to stop an ancient and ruthless enemy: the Reapers.  With over 75 hours of content and more than 300 awards, one of gaming’s most acclaimed franchises comes to the PlayStation®3 computer entertainment system as a complete set.  Experience all three Mass Effect games for an amazing value, including the original Mass Effect for the first time ever.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\n© 2012 Electronic Arts (Studio and Publishing). All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Electronic Arts","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]}]