[{"id":15360,"name":"Gun Done","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/918/9189ec7108c43419522c9cd757db8ce4.jpg","description":"Gun Done - it's a timekiller arcade game about brave heroes, which fight against each other under the scorching sun and cold rain. You know these heroes, do you? And there's a beautiful pixel locations, weather effects, excellent sound. Many game modes and you can play any of them, different cowboys to play too! Gun Done: Road to West - this is a game that is not ashamed to gift to a friend! Enjoy, friend! :]\n-Play alone or against friend (hot seat) ^_^;\n-Many heroes to play;\n-Lots of guns to unlock;\n-Various duel types;\n-Achievements and cards;\n-Gradually increasing difficulty;","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Azamat Xageu","platforms":[{"id":0,"name":"PC"}]},{"id":15162,"name":"Uebergame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b35/b35043882fd1f05b5c264e040c478baf.jpg","description":"A truly free and open source multiplayer shooter, no strings attached.\nHave casual deathmatch matches on various scenarios.\nBuild your own levels with the ingame editor and assets that come with the game, or just play around and use it as a sandbox.\nFeatures:\n-Free.\n-Open source.\n-No pay to win.\n-No ads.\n-Modding friendly.\n-Easy to use ingame editor.\n-A big variety of levels and game-modes.\n-Fully transparent development process.\n-Community based, so everyone can make suggestions.\nSome additional notes for all who actually read the description:\n-This is an indie game and developed by mostly one person (me).\n-This game does not use Unity or Unreal engine or any products bought from asset stores.\n-This is an experimental volunteer project and not a final product, but a continous work in progress.\n-This could/should have been labeled as early access, but I pressed the wrong button, so this option is gone now, deal with it.\n-This project is an attempt to bring back the good old days.\n-This is the attempt on offering an alternative for those who want one, if you are happy with the current commercial aaa titles, this game here is likely not for you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Duion","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":11047,"name":"Heroes of SoulCraft - Arcade MOBA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf7/bf76b85d5b60a83b8d899014c7a2f013.jpg","description":"Heroes of SoulCraft (HoS) is the best Arcade MOBA. Play a great MOBA in max 5 or 15 minutes on your PC, mobile phone or tablet against each other with mouse, gamepad or mouse/keyboard.\nHeroes of SoulCraft (HoS) is an Arcade MOBA in which 2 teams fight against each other in fast-paced, tactical matches full of action and fun.\nAngels vs. Demons team battles in quick, tactical games full of action and fun\nIf you like our previous games SoulCraft 1 & 2 you will love Heroes of SoulCraft\nPlay 5 or 15 minutes with instant matchmaking.\nNeed to leave the game early? No problem - we will join a new player into the running game.\nChoose your hero\nSelect one of 12+ heroes: play the melee dwarf \"furious axe\" Grimnor, the range fighter \"loose cannon\" Keely, the mage supporter \"flower princess\" Dalia or many more.\nEasy to learn\nHeroes of SoulCraft makes it very easy to learn the basics within a minute. Over time you can choose to do more things manually like skilling or item-buying for the full MOBA experience.\nUnleash your titan\nEver wanted to take a huge fire dragon or a big rock golem into the battle? Now you can! Choose your titan to accompany you and customize your Hero by pre-configuring your item-deck.\nHeroes of SoulCraft is now available as a first Alpha Version. Download now for free on Android or Windows and help us improve the game by giving us feedback in the forums.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"MobileBits","platforms":[{"id":0,"name":"PC"}]},{"id":4283,"name":"Ratchet & Clank: Up Your Arsenal","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d06/d06ba76b7383b5e6a9a3534d1dc7e754.jpg","description":"Experience the classic adventures of the universe’s favorite Lombax, Ratchet and his robotic sidekick Clank in this classic PlayStation®2 game now fully remastered in high definition! Wield the original tools of destruction as you travel from planet to planet unraveling their original story and explosive adventures in this PS3™ exclusive.\r\nOutput in HD requires cables and an HD compatible display, both sold separately. This game will play on displays ranging from standard definition to 1080p.\r\nPS3 system software v3.65 or higher, HD 3D display with compatible 3D active glasses and highspeed HDMI cable (sold separately) required for 3D features. Visit www.us.playstation.com/support/3D for details. This item is being licensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.This item may be used with up to 2 activated PlayStation® devices associated with this Sony Entertainment Network Account.  Please see software description for device compatibility. ©2004, 2012 Sony Computer Entertainment America LLC.  Ratchet & Clank and Ratchet & Clank: Up Your Arsenal are trademarks of Sony Computer Entertainment America LLC. Developed by Insomniac Games.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PS Vita"}]},{"id":1389,"name":"David.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/62f/62ffa88bda2ddf991835f583fe7d4bef.jpeg","description":"Summary\nDavid is a game. A game about physics and enemies. A game about struggles and life. A game about David.\nThis game is designed to be difficult. I poured myself into developing this game for nights and nights and nights. It's almost tough to share. I hope it feels strangely personal.DescriptionYou play David, an awfully small abstracted chosen hero tossed into a blissfully simple world overrun by giant culminations of evil physics-beasts. As David, you are given a slingshot-esque gift that you will have to use to conquer your colossus foes. Hold, aim, and fling to attack (Angry Birds™ style!).Featuresa 9-level Campaign, 3 Additional Levels, a Survival/Arena/RPG mode, a Secret Basket-ball-pit Minigame, and hats!SoundtrackA six song EP soundtrack is included with purchase \"...that feels like FEZ and is similarly wonderful!\" - Laser Dog","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fermenter Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":645,"name":"Feist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d75ca1f69abb3a592cac3810d23f5cb.jpg","description":"A desperate, savage survival experience full of stunning visuals, dynamic creatures, and a haunting soundtrack. Follow strange beasts through lonely forests, hazardous mountains, dark caves, and glowing swamps. Watch out for dangerous creatures that react to your movements and decisions, and cleverly concealed traps that will test your ability to survive. Over six years in the making, FEIST is a gorgeous hand-made adventure unlike anything else, with a cinematic presentation reminiscent of The Dark Crystal or Hedgehog in the Fog, and a tense original soundtrack by Tomek Kolczynski.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Finji","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":973786,"name":"Deep Rock Galactic: Survivor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1eb/1ebae240bdf6275a169e81b551e44e67.jpg","description":"Official Discord Server\nRoadmap\nAbout the GameWelcome, Survivor!DEEP ROCK GALACTIC: SURVIVOR is a single player survivor-like auto-shooter. Wield the full arsenal of Deep Rock Galactic, take on hordes of lethal aliens, mine riches, and unlock powerful upgrades. It's one dwarf against all of Planet Hoxxes!REVERSE BULLET HELL, WITH MININGKill bugs, upgrade your gear, and delve ever deeper into the lethal caves of Hoxxes. Collect and assemble a devastating array of guns, unleash hell upon wave after wave of alien monsters in fast and frenetic combat, and tunnel your way to collect precious riches from deep within the cave walls. Each mission is unique, using procedural cave generation and enemy waves, just as you've come to know from Deep Rock Galactic.COMPLETE MISSION OBJECTIVES TO BECOME STRONGERDelve deep, Miner! Once the Drop Pod releases you into the oppressive darkness, you are on your own. Complete the mission objectives set forth by the Company, and make it back to the Drop Pod in time to try your luck at even more deadly and lucrative encounters. Progress deeper and deeper into the planet while you grow ever stronger, survive all the way to the very end of your assignment, and finally get extracted alongside your hefty sack of loot.DEEP ROCK, FROM A WHOLE NEW PERSPECTIVEThe universe of Deep Rock Galactic is loved by millions of players, and now you can experience it in a whole new single-player-focused way! Play each mission from a top-down perspective, navigating the caves of Hoxxes as you've never seen them before. Greybeard Deep Rock veterans will recognize much from Deep Rock Galactic, and if you are a recently joined Greenbeard: Welcome! We are thrilled to have you on board. You will like it here. Management demands it!\nInitial release on early access includes:\n4 classes\n40 weapons\n20 enemy types\n3 biomes\nA deep progression system of class mods, artifacts, and upgrades\nThe finished version will contain even more content, and other features - all to be determined as we receive and review feedback from the community during Early Access.\nROCK AND STONE!","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Funday Games","platforms":[{"id":0,"name":"PC"}]},{"id":759884,"name":"Deliver Us Mars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bdd/bdd410bf4cad84ca04101e6fa6e94b43.jpg","description":"Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward.\nA BOLD NEW MISSION\nTen years after the Fortuna mission, humanity is closer than ever to extinction. After a mysterious distress call from Mars, join the Zephyr and its crew as they journey to the red planet and seek to recover the ARK colony ships stolen by the mysterious Outward, and with them, ensure the survival of the human race.\nOUT OF THIS WORLD GAMEPLAY\nJourney from Earth to the surface of Mars and endure its harsh and unforgiving terrain as you hope discover the secrets of Outward. Use both brains and brawn to overcome mental and physical challenges, find the ARKs, and uncover the motivations of those behind the distress call that brought you here.\nA HANDCRAFTED EXPERIENCE\nExperience a highly polished and absorbing narrative experience packed with engaging gameplay. Every moment is handcrafted, delivering a suspense-filled, emotion-fuelled narrative alongside music from award-winning composer Sander Van Zanten, state-of-the-art motion capture, stunning graphics and real-time ray traced shadows and reflections, powered by Unreal Engine.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"KeokeN Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":758591,"name":"Ozymandias: Bronze Age Empire Sim","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/563/5636a7ebb60830858bbe32c3cb51a25a.jpg","description":"At the dawn of history, Bronze Age kings built the first empires. Strategize their rise to power in a uniquely streamlined 4X. Expand your borders, build cities in tactical locations then raise armies to defend them. Each turn, you receive opportunities but must choose only one, complete the objective to earn the reward. Random victory conditions make every game different; custom victory conditions support different styles of play.DISTILLED DESIGN Focus on strategy over tactics, we’ve stripped the busywork out of 4X gameplay.\nCombat abstracted into an innovative Power system, you only move armies and fleets.HISTORICAL MAPS 8 handmade maps charting Bronze Ages around the world.\n52 empires to play, traits give each a unique set of challenges.SINGLEPLAYER Learn how to play in a short story campaign about explorer, Gertrude Bell.\nClimb the difficulty ladder against our data-driven AI, which doesn't cheat to compete.MULTIPLAYER Players take their turns simultaneously so there’s no waiting around.\nPlay well to earn Treasure in ‘live’ (short turn timers) or ‘asynchronous’ (long game timers).","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"The Secret Games Company","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":302917,"name":"Hentai Girl Karen","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b0/2b05915020dc4ce098874be22edd98fc.jpg","description":"<h3>Introduction</h3>Hentai Girl Karen is a puzzle game,you only need to swap the bricks to restore the pictures.<br/>The game support cheating mode and browsing pictures with one hand  that you can unlock all pictures in just one minute.<br/>There is no time or star limit in the game, you are supposed to enjoy the relaxing experience.<h3>Characteristics</h3><ul><li>Cheat Mode (F)</li></ul><ul><li>The gallery can be operated with one hand</li></ul><ul><li>100 achievements worthy of being collectible</li></ul><h3>Tradingcards &amp; Background</h3><br/><br/><br/>","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"GirlGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":56124,"name":"Metroid Prime 2: Echoes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/852/85222e407cba4c699ae7e6f4742b8b1a.jpg","description":"Metroid Prime 2: Echoes is a first person action-adventure video game developed by Retro Studios and published by Nintendo for the GameCube video game console. It is the seventh published game in the Metroid series, a sequel to Metroid Prime, and the first game in the series with a multiplayer feature. Echoes was released in North America, Europe, and Australia in 2004; and in Japan under the name Metroid Prime 2: Dark Echoes in May 2005.\nThe story of Echoes follows bounty hunter Samus Aran after she is sent to rescue Galactic Federation Marines from a ship near Aether, a planet inhabited by a race known as the Luminoth. There, she discovers that the troops were slaughtered by the Ing, a race that came from an alternate dimension of Aether. Samus must travel to three temples to ensure the destruction of the Ing, while battling Space Pirates and her mysterious doppelgänger called Dark Samus.\nRetro decided to make the game different from its predecessor by adding more focus on storyline and including new gameplay elements. Nintendo launched a viral marketing campaign to promote the game that included several websites written as if taking place in the Metroid universe. Echoes' single player mode and graphics were praised by critics, while its steep difficulty level and multiplayer components were met less positively. Since its release, Echoes has received several video game industry awards, as well as spots on \"top games\" lists by Nintendo Power and IGN. Over 800,000 copies of the game were sold worldwide. In 2009, an enhanced version was released for Wii as a standalone game in Japan and as part of Metroid Prime: Trilogy internationally.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Retro Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"}]},{"id":51128,"name":"Hero of the Kingdom III","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/08e/08e82348a09fc9b01220c931c1f09d44.jpg","description":"Travel through the four valleys to save the kingdom from the ancient evil.\nYour uncle Brent raised you as a skilled hunter. Fate, however, gave you a different path than a peaceful village life. An ancient evil awakened, shattering the whole kingdom. Dark monsters climbed out of holes and people died under the falling mountains. You are left alone to face the great evil. You must set out on a long journey through the four valleys and save the kingdom on the brink of destruction. Your courage and your skills will forge a new hero of the kingdom.\nExplore the beautiful country of the four valleys.\nHelp people and fulfill many interesting quests.\nFight monsters and advance in many skills.\nFind hundreds of useful hidden items.\nObtain many achievements.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Lonely Troops","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":42336,"name":"Grand Theft Auto Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bbd/bbd7af2d6dab31e0b3bbfb5f63575ab8.jpg","description":"Grand Theft Auto Online is a dynamic and persistent open world for 16 players that begins by sharing content and mechanics with Grand Theft Auto V, but continues to expand and evolve with content created by Rockstar and other players. Taking the fundamental concepts of open-world freedom, ambient activity and mission-based gameplay and making them available to multiple players in an incredibly dynamic online world, we offer players the freedom to explore alone or work cooperatively with friends to complete missions. Residents of Los Santos band together to participate in activities and ambient events, or compete in traditional game modes with the entire community, all with the personality and refined mechanics of Grand Theft Auto V.\nYou start by creating and developing a unique character from the ground up and can invest in your potential criminal by customizing his or her appearance, improving their stats, owning customized vehicles, purchasing personal property, and taking part in Jobs, Missions and activities that continually open up new opportunities to rise through the criminal ranks.\nGrand Theft Auto Online will continually expand and evolve over time with a constant stream of new content, creating the first ever persistent and dynamic GTA game world.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Rockstar North","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":29239,"name":"Skull & Bones","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/097/097a3191f8d9bd75068e89f50f1b021c.jpg","description":"It is the Golden Age of Piracy. Renegade captains command the most powerful weapons on Earth: warships. In Skull & Bones™, you are an insatiable, upstart pirate captain who has refused the king’s pardon. Having nothing to lose, you sailed from the Caribbean to the Indian Ocean, an exotic and untamed frontier full of lavish riches.\nHowever, these rich and idyllic waters are also a battleground where far-reaching colonial empires, powerful trading corporations, and ruthless pirate gangs are fiercely competing for their share of these valuable treasures.\nDuring your journey to become the ultimate pirate kingpin, you will build a fleet of ships you can customize, prey upon lucrative trade routes, and take down rival pirate captains, memorable characters, or other players. In order to survive in this ruthless ocean, you will have to ally with other pirate captains to form the most influential pirate gang, becoming too big to fail and joining the endless struggle for supremacy of the Indian Ocean.\nFROM UPSTART PIRATE CAPTAIN TO LEADER OF YOUR OWN GANG\nChoose your own pirate captain and grow into the fierce legend that you have always wanted to be. Select your pirate ship class based on your preferred playstyle, evolving it with a rich RPG system. From the safe harbor of your hideout, recruit your crew, customize the ship of your dreams, and pick up on the latest rumors before you set sail to leave your mark on the world. With each successful heist, as your wealth and reputation increases, the world and other players begin to challenge your ascension. Sailing alone becomes a dangerous gamble. Your long-term survival depends on your ability to form the most powerful pirate gang in the Indian Ocean.\nREDEFINING NAVAL COMBAT\nExperience unparalleled naval gameplay delivered by the studio who pioneered and designed naval combat for the Assassin’s Creed franchise. Live the thrills, brutality, and intensity of naval combat as you fight for domination of the seas. Harness the innovative wind system in order to navigate more quickly, shoot further, hit harder, escape deadly blows, and position yourself to decimate your victims. Stalk your enemies and use your spyglass to identify weaknesses. Rally your gang to hunt and overpower large merchant ships and outsmart powerful rivals. Approach combat your own way with a wide number of tactical options at your disposal.\nPLUNDER TRADE ROUTES SOLO OR CO-OP\nExplore a systemic shared world that reacts to your actions and challenge your ascension across multiple parts of the Indian Ocean. Choose your path: engage in combat solo, or team up with other players to take down vicious predatory factions and well-defended convoys. The rewards are yours to share, or steal, if you are willing to face the consequences of betrayal and become a target for other players. There are even rumors of horrifying dangers lurking beneath the surface…\nINTENSE MULTIPLAYER ACTION\nTreacherous disputed waters separate the unique regions of the Indian Ocean, where pirate gangs compete for riches in explosive naval battles. Confront rival players in competitive 5v5 matches, and experience the ultimate pirate fantasy in a variety of game modes while you plunder the most valuable loot from the Indian Ocean’s richest trade routes and grow your influence.\nA CONSTANT CHALLENGE\nFighting your way to the top will attract greater challenges for you and your gang. As the world evolves, Skull & Bones will continuously test the heights of your skill, the depths of your greed, and the resolve of your alliances. Vast new regions to explore, powerful ships, devastating weapons, and daring enemies, along with greater rewards, will tempt you from across the four corners of the Indian Ocean. Every victory will bring you closer to glory and raises the price on your head.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Ubisoft Singapore","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":29037,"name":"Deadly Premonition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e3e/e3ea3605b67d99a12b1c09619f531d5c.jpg","description":"Deadly Premonition is a third-person survival horror action game which puts players in the role of the intuitive FBI Agent Francis York Morgan. In the process of investigating a murder, players will examine a series of interlocking mysteries in a remote rural town and will encounter an array of complex characters pivotal to the unraveling of the storyline's mystery. Suspenseful action sequences will force players to make strategic moves, gliding by enemies in the shadows or engaging them with long-range weapons or hand-to-hand melee combat. From the unparalleled atmosphere, music and mysterious storyline to driving vehicles and exploring the entire town, Deadly Premonition will offer players a unique and haunting interactive gaming experience unlike any other.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Access Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28363,"name":"UFC Undisputed 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9dd/9dd76d1eaf1e989ce0826fc4a1da7037.jpg","description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, French, Italian, German, Spanish, Potuguese.  The best-selling franchise returns to take players inside the Octagon™ with UFC® Undisputed™ 3,  delivering UFC action focused on intense toe-to-toe combat, impressive visual presentation and increased accessibility. Featuring the addition of PRIDE Mode, a new submission system, new ways to finish the fight and increased accessibility, players will experience intense combat every time they step inside the Octagon.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Yuke's Co","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":27168,"name":"Dr. Mario","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05f/05f7d385e48f9f384cd4d496855029cd.jpg","description":"Feeling under the weather? Well, Dr. Mario has the cure for you! Help\nhim fight bodies of nasty viruses with multi-colored vitamins,\neliminating those germs faster than they can multiply. Rotate the\nvitamins as they drop, and gain a higher score by aligning multiples of\nthe same color. Clear all of the viruses to move on to the next round.\nBut watch out as the vitamins start dropping at a faster rate! Not\nenough of a challenge? Try competing against a buddy, and prove that\nyou're just what the doctor prescribed!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":1990,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"NES"},{"id":0,"name":"SNES"}]},{"id":21955,"name":"WWE SmackDown vs. RAW 2010","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c16/c16bd19fdaec1de4ef100c919d2157e7.jpg","description":"WWE SmackDown vs. RAW 2010","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"THQ","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":20996,"name":"Reverse Crawl","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70a/70aac8a220c7d24c4e7a391007d57e8f.jpg","description":"A dungeon crawl where YOU are the monsters! Lead your minions in tactical turn-based combat against the pesky heroes, and unlock a variety of evil Powers. With a dynamic campaign system and a branching storyline, \"Reverse Crawl\" lets you experience an RPG from a whole new angle!\nFEATURES\n- Tactical turn-based combat system, where you control the dungeon's minions!\n- A dynamic campaign that will be different each time, complete with a branching storyline\n- Artwork, coding and animation by one person (!) in that unique Nerdook style\n- Unlock new minions, traits and powers as you play, depending on your choices during the campaign!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20858,"name":"Aqua Kitty - Milk Mine Defender","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb2/cb20ef935f2eb18c73e382ee6c3e00b4.jpg","description":"Aqua Kitty is a fast paced retro styled submarine arcade shooter with optional 2 player local Co-op.\nBlast through hordes of mechanical sea monsters in your kitty sub and defend the deep sea milk mining kittens!\nTHE MILK MUST FLOW!\nStoryDue to a sudden shortage of milk, cats around the world are forced to seek out new sources to get their fix.\nYou and your team of milk mining kittens have overcome a fear of water to drill down under the ocean seabed and begin extracting vast reserves of what seems to be naturally forming full-fat milk.\nGet ready for fast paced submarine action, defending the kittens from disruptive mechanical sea creatures.Key Features\nOptional 2 player local CO-OP.\nBranching map progression of levels.\n3 Main Game Campaign Modes\nNormal Mode - the standard game of branching levels full of mechanical enemies with differing behaviours.\nEasy Mode - a version of Normal mode in case you found it too hard, with more health and easier enemies.\nArcade Mode - a special survival mode where you must collect gems to purchase powerups.\nDepth based power-up systems which gives partial control on the type and location of the power-ups created (allowing tactical advantage).\nClassic infinite mode milk-free level, that never ever ends - for the hardcore challenge.\nDual firing submarine with a rechargeable secondary weapon that needs to be managed carefully (upgrades through game progress in Easy and Normal Modes, but upgrades via a shop system in Arcade Mode).\nVarying sea depths per level which subtly affect gameplay.\nChain kill combo system allowing the more skilled player to maximise score.\nSteam online leaderboards to challenge and achievements to obtain.\nHand drawn pixel art graphics, displayed at a crisp 720p.\nAwesome chiptune music taking inspiration from the best of the C64 and Amiga days.Development historyHello, here is a short history of this indie games' development which we hope will be of interest.\nAqua Kitty was made by a core team of two people with audio created by Electric Cafe and the game box art by artist David Hankin.\nIt began as a small modern-retro styled PC game, designed to run at a crisp 1280x720 it was created with a love of the 16bit gaming era and late 80s video arcade games.\nThere were originally 3 core versions of the game available of different hardware - PC, XBox360 and Sony PSM.\nSony version is the oldest and smallest version. A critically acclaimed launch title for PSM (Vita).\nXBox version is the Sony version with extra added levels + enemies + refinements.\nPC version is the most feature rich and improves on the XBox one with new Weapons + Gradius style Arcade mode + yet further refinements and extra details (with the Steam version being unique in having online leaderboards and achievements).\nAll the new things we have added to the Steam version will also be rolled back into the other PC versions unless Steam specific (ie Online leaderboards, achievements, trading cards are STEAM ONLY).","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tikipod","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":20840,"name":"The Apogee Throwback Pack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f5e/f5ea01aa57fd3d820856307da25eb26e.jpg","description":"The Apogee Throwback Pack is a collection of four classic Apogee Software titles all in one kick ass package.  Blast your way across the galaxy as British Special Agent Blake Stone in \"Aliens of Gold\" and \"Planet Strike\", then take on an ancient evil menace as the H.U.N.T in \"Rise of the Triad\".Key Features:\nFour classic games that offer hours and hours of nostalgia ridden gameplay. Full widescreen support for modern Windows and Mac operating systems. All wrapped up in one sleek package that allows for easy modding.\nBlake Stone: Aliens of Gold\nBlake Stone: Planet Strike\nRise of the Triad\nExtreme Rise of the Triad\nMany players wondered how Apogee would follow the success of Wolfenstein 3D in 1992. The answer was \"Blake Stone: Aliens of Gold\"! Where Wolf3D took you into the past; thrust into a world at war - Blake rockets you into the future where a sinister madman, Dr. Pyrus Goldfire, is using genetics to create an army of bizarre creatures and wage war on Earth.\nIn \"Planet Strike\", once again, British agent Blake Stone will find himself in a life or death struggle for the control of humanity's future.  After a five year manhunt for the elusive Dr. Goldfire, the search has finally ended on Planet Selon at the abandoned STAR Institute Training Complex.  If the reports are correct, then Dr. Goldfire is alive and has once again created a fiendish army of evil mutants.  Blake is going to need all his wits, skill, and the best firepower money can buy to put an end to Goldfire's plans.\n\"Rise of the Triad\" thrusts you into the world of an elite group of operatives called the HUNT (High-Risk United Nations Taskforce).  Together you must stop a maniacal cult leader from killing millions of people.\nWhile scouting a remote island, you are suddenly surrounded by enemy troops with guns blazing. In the distance you see your boat--your only chance to escape--explode into matchsticks. In front of you is a huge fortress monastery, and your only way out... is in. You're equipped with awesome, high-tech weaponry like heat-seeking missiles, split missiles, and the Flamewall cannon, which leaves a trail of charred skeletons in its wake. You'll also find magical instruments and weapons so incredible they defy description.\n\"Extreme Rise of the Triad\" ups the ante with over 40 new levels as the HUNT returns to take on even more maniacal Triad madness.  Not enough for you? There's even a RandROTT level randomizer so the ludicrous fun never ends!  What are you waiting for?!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Interceptor Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20119,"name":"Adventurer Manager","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0a/f0a054f3c932eaa9f45e9ecc0734edb1.jpg","description":"The evil Illusionist Miraj has murdered your parents, the King and Queen, and has taken control of the Kingdom of Adventuria. Playing as the King's sole heir, you must recruit local Adventurers to complete Adventures to regain the loyalty of the various races in the realm. Only through reuniting your kingdom will you have the power to defeat the evil Illusionist Miraj!\nFeaturesCreate Your Ruler to begin your story!\nRecruit Randomized Adventurers from 7 races and 13 classes each with their own bios, benefits, and drawbacks!\nUnlock Secret Party Bonuses by organizing your Adventurers into 4 separate parties and arranging their formation front to back!\nSend Your Adventurers on Adventures to over a dozen different locations on a large world map!\nAutomatically Complete Adventures and...\nManually Complete Adventures for bonus rewards!\nTurn-based Combat with dozens of skills and spells!\nLevel Up your Adventurers with attribute points!\nTons of Skills from unique skill trees!\nEndlessly Generated Loot to equip your Adventurers ranging from common, uncommon, rare, legendary, unique, and mythical items!\nDozens of Monsters each with...\nResistances and Weaknesses to exploit!\nRare Monsters and Monster Packs each with randomized mutators!\nUnique Boss and Miniboss monsters to challenge your toughest Adventurers!\nCraft and Salvage Equipment to create the perfect equipment!\nUpgrade Your Castle to impart benefits to all of your Adventurers!\nMonster Invasions where you must defend your subjects!\nGain Your Subjects' Allegiance to receive upgraded Adventurers and more!\nAdventurer Endurance that needs time to recover!\nAdventurer University where you can educate and train your Adventurers!\nBestiary that tracks your Monster kills to unlock information and gain bonuses against them!\nHarsh Death Penalty where resurrecting your Adventurers isn't cheap!\nRetire your Aging Adventurers to impart fantastic benefits to younger Adventurers!\nIronman Mode where when your Adventurers die, they stay dead!\nAchievements to track all the things!\nOriginal Retro-inspired Soundtrack to groove to!\nSteam Trading Cards to collect!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Vigilant Addiction Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19539,"name":"Restaurant Empire II","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a80/a80617ad448257f97fa2214357174c53.jpg","description":"The sequel to the widely popular Restaurant Empire game takes you further into the depths and delights of the culinary universe than ever before.\nTake part in an exciting world where the customers are fickle and the bounty in your cash register changes as quickly as their tastes. With two handfuls of cash and a dream of stamping a legacy, build, cook and hire your way to the very top of the gastronomic biz, where tasty food is king and smart management reels in the cash. And if you're lucky, you just may go further than any other before you and cement your status as a true legend of cuisine...\nKey features:\nA brand-new 16-mission campaign that gives us a look at the ongoing story of the Leboufs, as they try to tiptoe through the minefield of marriage and the unique circumstances of professional success.\nA superior graphics engine brings to life the cities, characters and restaurants that populate the world of cuisine using advanced techniques such as real-time reflections to give unprecedented realism. Food has never looked so good.\nTwo new enterprise categories: Coffee Shop and Dessert House that complements the existing Restaurant enterprise; with each category having over 130 unique delicacies, beverages and recipes to choose from.\nNew themed restaurants ranging from the aquatic deep, exotic rainforest and motor racing takes the idea of \"themes\" to unprecedented heights. You've never seen restaurants looking this amazing before.\nOver 700 new interior objects, bringing the total number to 1400. There is more variety and fun than ever before in setting up, decorating and managing your very own restaurant.\nIntroducing the new German cuisine category of restaurants complimenting the existing foods and architectures of the French, Italians and Americans. Over 600 total recipes.\nMunich, in addition to the triumvirate of Paris, Los Angeles and Rome is now yours to select as a destination to set up shop and expand your burgeoning business.\nHire live performers to perk up your restaurant's atmosphere, varying from concert soloists to rock bands and indoor circus performers, and set up their scheduled stints to entertain your valued guests at the right time of day.\nWith the new Recipe Research feature you can now actively invest into improving the quality of your food as well as gain invaluable knowledge in the formulation of new delicious recipes.\nAnd finally, Armand awaits for you with a secret mini-game inside.\n\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Enlight Software","platforms":[{"id":0,"name":"PC"}]},{"id":16511,"name":"Sound of Drop - fall into poison","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e51/e51bb6eab620dbb50ad4f24b9824351a.jpg","description":"Nestled in the heart of Tokyo, the quaint little aquarium, Manten Aquarium.\nNumerous urban legends have arisen from here.\nOn the night of the full moon the waters turn to blood and man faced fish lurk within.\nJunior high school students Mayu and Himeno came to Manten Aquarium to investigate these urban legends.\nIn the beginning it was fun, but then.\nThey see a glimpse of Mayu’s missing littler sister, Mari.\nThe wheels of fate begin turning as they chase after Mari’s shadow.\n--Before she realizes it, Mayu finds herself alone and lost in the crimson aquarium.\nHow to play\n・Proceed through the story from Mayu’s point of view\n・Make choices through the game and choose your fate.\nContains\n・3 main story routes\n・Over 30 endings (Mostly bad)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"aiueoKompany","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":14522,"name":"Woof Blaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89d/89d565dc346e2b540c375a814ecc6f6c.jpg","description":"Woof Blaster is an action packed shooter featuring a dog with a gun and jet boots in search of a magical pizza which holds the key to becoming King of the Dog Planet. Destroy waves of enemies with an array of weapons, power-ups and the ability to transform into different monsters such as a T-Rex that shoots rockets from its mouth!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fabian Jarrett","platforms":[{"id":0,"name":"PC"}]},{"id":12803,"name":"Defense of Egypt: Cleopatra Mission","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/618/6182e157030e7052795099359b59985f.jpg","description":"A game of the genre \"Tower Defense\" ( TD ) in the setting of ancient Egypt.\nColorful graphics, exciting pilot, interesting gameplay!\nBuild powerful weapons, plan protection strategies.\nGreat battles with a huge number of units on every level.\nMany tactics, different levels of difficulty of passing.\nUnique sysmet of improvement of guns and spells.\nEpic Battle of Egypt and Rome will not leave you indifferent.\nThin calculation, quick response and assistance of the Egyptian Gods allow you to defend the independence of Egypt,\nmanaged by the beautiful Cleopatra.\nFeatures List:\n-Non-linear storyline!\n-More than 60 levels, several difficulty levels\n-The setting of ancient Egypt\n-16 types of enemies\n-6 types of fighting weapons with a variety of system upgrades\n-5 types of established gears for influencing the characteristics of combat vehicles, with an option to improve them\n-Exciting quests\n-Ability to personally intervene in the fighting, using grenades, Tribolos, lightnings, fire, frost.\n-English, French, German, Spanish and Russian languages.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"First Games Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11999,"name":"LEAVES - The Journey","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/588/588e0701e0614274ad09d9e19219e7e9.jpg","description":"\"LEAVES - The Journey\" is an artistic exploration and puzzle-adventure full of real sculptures in a surreal dreamscape.\nCollect and combine information and solve a huge variety of challenging puzzles and mini games.\nYour sudden arrival on the high plateau of the Stony Mountains caused quite the commotion among the Treefruities. They even forget holding on to the leaves of their home tree and so the calamity ensues. A gust of wind scatters the leaves all across the lands of Mononino.\nHelp the Treefruities to get their lost leaves back and look forward to an amazing journey. Explore the fantastic land of Mononino where strange creatures and secrets are waiting to be discovered.\nArtistic puzzle design in the tradition of games like Samorost, Machinarium und Rhem\nChallenging puzzles and unique mini games\nExplore four vast worlds\nAtmospheric soundtrack by award winning composer Gary Marlowe and Daniel Hoffknecht","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ZAR 21","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":8277,"name":"Krosmaster Arena","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4d6/4d699d2e0ec85772113b646745497d65.jpeg","description":"DISCOVER THE MULTIPLAYER GAME WHICH BRINGS ALL THE GREATEST FIGHTERS TOGETHER ON ONE BOARD! BECOME MASTER OF THE KROSMOZ!\nTake on the biggest bosses in the Krosmoz in an adventure mode filled with unique challenges, battle players from all over the world in the PvP Arenas in this tactical board game, a mixture of strategy and epic battle with eye-popping animation and black humor.\nTO BECOME THE MASTER OF THE KROSMOZ... YOU'LL HAVE TO THINK LITTLE\nChallenge players from the world over in a tactical board game that seamlessly blends strategy and epic battles! Discover more than a hundred COLLECTIBLE fighters, ready to face down your enemies in ruthless battles where anything can happen! CREATE YOUR TEAM of heroes and prepare to rule the battlefield. Against the Krosmaster bosses or player versus player, plan your move... and HIT HARD!\nPVE ARENAS FULL OF CHALLENGES...\nYou’ll have to defeat 6 Krosmaster Arena bosses to find out whether you are a strategic mastermind! But do you have what it takes to stand up to these tough guys?\nPVP ARENAS FULL OF DANGEROUS SURPRISES! Want to pit yourself against Krosmaster Arena’s greatest players? Arena mode was made for you. Select your best Krosmasters for your team, and take on a real challenge. Your opponent might be on the other side of the world... but that won’t mean they’ll spare you! Surpass yourself and become master of the Krozmoz!\nMORE THAN 100 FIGURINES TO COLLECT\nIn addition to collecting them, there are seemingly infinite ways to combine fighters into elite teams to dominate the arena! New figurines are added regularly – there are even real, physical figurines available in stores who can swell your ranks thanks to a code which unlocks their virtual in-game versions!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ankama Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":3793,"name":"Truck Racer","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed0/ed0503fb44e3a1ee8ca6cbb3b91e6435.jpg","description":"Take control of five tons of metal and power, and floor it until you reach the finish line!\nDrive fully destructible trucks in Championship, Time Attack, Elimination and Quick Race. Get rid of opponents trying to block your way and make a reputation for yourself! Customize your vehicle from the engine to the paint, choose among 48 tracks and face your friends in Online or Local multiplayer for maximum destruction!\nDrive on 10 different environments and 48 tracks\n6 truck categories with distinct styles, thousands of paint jobs and 54 possible upgrades!\n4 game modes including Championship mode with 13 events\n2 Multiplayer modes: Local split screen for 2 players and Online mode for up to 4 players\nRealistic and localized damage","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Kylotonn Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":2814,"name":"TRON RUN/r","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81d/81d026887f3719bff0ecf67b94d3aac7.jpg","description":"Special EditionsTRON RUN/r Deluxe Edition\nThe TRON RUN/r Deluxe Edition/Season Pass includes the core game, a Season Pass to all planned add-on content and an award of in-game currency. Deluxe Edition purchasers will receive 18 additional levels, 8 additional STREAM track elements (STREAM combination multiplier), 6 light cycles and 3 suits for the core game, an award of in-game currency, PLUS the massive OUTLANDS Pack featuring an alternate game theme, 16 additional levels and 20 new STREAM track elements.\nTRON RUN/r Ultimate Edition\nThe TRON RUN/r Ultimate Edition includes the core game, a Season Pass to all planned add-on content, an award of in-game currency and adds an exclusive eight-song soundtrack featuring remixes of Giorgio Moroder and Raney Shockne’s mighty score and a second “giftable” install of the core game.\nAbout the GameReturn to the world of TRON with TRON RUN/r, a new lightning fast, action-adventure racing game with a twist! Blaze through dynamic circuits, facing-off against virulent adversaries while taking on all challengers.\nPack your loadouts with dozens of combinations of cycles, suits and powerups. Hone your DISC and CYCLE skills on the 32 included levels, then challenge your friends to the grueling STREAM program that throws endless combinations of modes and levels at you until you crash - how long can you survive? The one who outlasts all tops the leaderboard!\nNew music from EDM godfather Giorgio Moroder and Raney Shockne, and remixes by Autechre, Bibio, patten, Joywave and others power you through this dazzling TRON universe. Just when you think you’ve mastered it all, you’ll discover there’s more here than meets the eye . . .\nFor additional information about our practices in the United States and Latin America regarding children’s personal information, please read our Children’s Privacy Policy at https://disneyprivacycenter.com/kids-privacy-policy/english/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2104,"name":"Ape Escape 2","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/470/470088e83d5801250617c4aabf6db884.jpg","description":"What do you get when you combine 300 monkeys with one little mix-up? Discover the mayhem as the Specter, an evil monkey, leads troops of riotous monkeys in a revolution. You must chase down each monkey and stop its plans for world domination by using a variety of wild gadgets, vehicles, and unlockable items. In Ape Escape 2, you can capture monkeys around the world, explore new environments, and play through several new minigames.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"}]},{"id":316861,"name":"CSC | Space MMO","genre":"Massively Multiplayer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59f/59fa8dc815d2354d9dbde5f17909bb24.jpg","description":"CSC is an open-world, sandbox-style space MMO that features a Play-to-Own Economy. Players can mine, harvest, craft, and explore in a quest to help humankind colonize the cosmos. Experience a free-market game economy for the first time with the ability to buy, sell, and trade without limits. Any items found, crafted, or earned in CSC can be moved freely both inside and outside of the game universe. As a Commander in the CSC Universe, you'll have true freedom, and savvy players will discover endless opportunities.\nUniverse of Oppertunities\nYour journey begins as an adventurous miner hunting rare resources in the depths of Fringe Space. Become a master crafter of high-tech modules, equipment, starships, or even a fully player-owned station. Perhaps you'll focus your attention on supporting the growth of the Galactic Federation by transporting consumer goods, resources, colonists, and workers to new outposts, earning valuable credit.  Or you could armor and equip your starship to hunt for pirates and other treasures in dangerous and unsettled space. Keen on building a business empire? Then dominate the markets by buying, selling, and trading valuable goods from around the cosmos. The choice is yours... What destiny will you choose?\nJoin the community and learn more about CSC in our Offical Discord Channel\nCommunity\nCSC has been in development for over a year with a playable client and community since late 2018. During this time, over 16,000 Commanders have signed up, mined over 30 million tons of resources, completed over 26,000 mining missions, acquired a space station, formed clans, and claimed hundreds of ships as their own. In addition, we have had several events that have brought our community and developers together in glorious space combat. And all this is only the beginning... imagine what the future holds.\nOverview\nCSC starts players off as newly-recruited Commanders of the Galactic Federation. As Commander of your very own starship, you'll undertake missions, discover resources, and regularly acquire new skills in your quest to dominate the galactic frontier. Players can travel to different star systems to explore the vast expanse of deep space, mirroring our real-world corner of the Milky Way. Star systems are vast and rich in resources, blueprints, and new technologies just waiting to be salvaged by you. But be warned, the further you travel from Sol, the greater the danger.\nStarships\nAs a Commander, you can own a fleet of starships, but you can only command one at a time. Starships are specialized, and some are better suited to specific tasks than others. Build a fleet that suits your needs, whether that's mining, combat, trade, or exploration. Each starship in CSC can be endlessly customized with equipment modules, which add or upgrade weapons, shields, and nearly any ship stat. They can also add unique functionality to starships such as cloaking, scanning, or even instantaneous singularity jump drives. These modules can be acquired through crafting, missions, player trades, or event drops.\nFringe & Core Space\nSpace in CSC will be divided into two regions: Core Space and Fringe Space. Core Space allows players to explore with relative safety and will have limited PvP (Players vs Player) interaction. While Core Space offers players a safe zone for research and exploration, certain resources may be more difficult to find. Fringe space is akin to the wild west, where laws are merely suggestions and players are at the mercy of local player-controlled governments. Fringe space makes up most of the explorable universe, but it's much more dangerous than Core Space. Those brave enough to venture deep into Fringe Space will find abundant and rare resources, higher bounties, and more lucrative quests.\nCrafting, Refining & Discovery\nAlmost everything in the CSC universe can be crafted.\nThe crafting system is uncapped, allowing players to continually improve on the quality of their crafted items. Specialization is encouraged by the CSC crafting system, rewarding players for focusing on specific skills or items, creating truly unique and valuable in-game assets.\nRefining allows players to convert raw ore or harvested resources into usable crafting materials. Refining rigs are available in GFI-controlled stations but can also be created, customized, and offered as a service by other Commanders.\nPlayers possessing the necessary skills and resources can begin the process of crafting items. They'll spend real-world time researching how to craft modules or ships, and as they craft more items and improve their skills, their odds of discovering new variations will increase.  These variations can prove to be valuable commodities in the Player Owned Economy, since these items are ONLY provided by players and never the Galatic Federation.\nTravel & Transportation\nIn CSC, all starships come equipped with a base FTL (faster-than-light) drive, capable of traveling vast interstellar distances in a matter of hours (1 LPH = 1 light year per real-world hour). The average speed of the initial batch of starships will be 1 LPH. As a general rule of thumb, smaller ships will be faster than larger, heavier ships. This base speed can be improved significantly with module upgrades and various crafted items. To help facilitate early exploration, the Galactic Federation provides an instantaneous travel option via Jump Gate. Jump Gates will facilitate system-to-system travel and will require Trilite Concentrate Fuel (TCF) to operate. TCF can be crafted from the rarest resource in the CSC universe, Trilite, or can be purchased from GFI Stations.\nPlayers will also have the ability to create their own transportation networks. Hangar modules will be available for large and capital starships. Players who focus on transportation as a career path can train skills to boost their LPH speed far beyond what the GF can offer. Ultimately, a player who acquires or creates a large class ship with a singularity jump module will become an economic powerhouse capable of moving starships, cargo, and players around the universe instantaneously.\nMining & Resource Collecting\nResources are spread throughout the universe and are primarily distributed throughout asteroid belts. Players can locate resources using a scanning mechanic, and once they're discovered, properly equipped ships can mine until the resource is depleted. Pools of resources will regenerate over time, and the rarest and most valuable resources can found in Fringe space.\nIn CSC, resource scanners come in a variety of styles, each with their own advantages, disadvantages, and levels of quality. Differences in quality will affect a scanner's accuracy, range, and number of resources recognized in a single scan.\nContracts and Economic Development\nCSC is designed to facilitate all facets of economic gaming. From the traditional gamer looking for a deeper, more immersive experience to the game entrepreneur looking to grow and develop game economies—all players can succeed with enough skill and wit. The contracts system in CSC will allow for complex actions and trustless cooperation between Commanders.\nFor example, a CSC industrialist might see the opportunity to sell a Prometheus class vessel in Wolf 359. This savvy player may not have the skill or time to collect the necessary resources or craft the item, but they may have the funds to get it done. This player could choose to set up a series of contracts, beginning with a resource contract that triggers a crafting contract on fulfillment and ending with a sale contract when the ship is created. Once the player sets these contracts up, the blockchain and our Scarcity Engine Technology will enforce the collection of resources, distribution of currency to players, and creation of a marketplace listing for the completed item.\nThat savvy player will have discovered an opportunity in the universal economy, created jobs for other players to complete, and profited from the sale of the created goods. This open economic system creates a symbiotic relationship between players and play styles.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Lucid Sight","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":274764,"name":"Dragon Age: Dreadwolf","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4c5/4c5a391237b78ea96aeff8206f63d3f5.jpg","description":"The Dread Wolf Rises\nI suspect you have questions.\n\nThe world of Dragon Age needs a new hero – someone who can take on the evil forces threatening Thedas. Get a first look at some of the new locations you’ll discover and the factions fighting by your side in the next chapter of Dragon Age.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"BioWare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":60069,"name":"Adera","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e85/e85efae91d263c074b97aecbd4bd7c2f.jpg","description":"World class adventurer Jane Sinclaire will face her greatest challenge yet in the mysterious city of Adera. Help Jane solve exciting puzzles, collect hidden artifacts, and explore the environments to unlock the secrets of this new-found civilization.\nThis episodic story begins when Jane receives a desperate message from her long-missing grandfather. Using nothing but her wits and a strange stone orb to guide her, Jane sets out to find her grandfather before it’s too late.\n- Dozens of unique puzzles and fantastic environments to explore!\n- AAA production with incredible 3D graphics, captivating story, professional voice acting, and more!\n- Over 10 hours of gameplay and hundreds of hidden objects to collect!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Hitpoint Studios","platforms":[{"id":0,"name":"PC"}]},{"id":59816,"name":"Workers & Resources: Soviet Republic","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/05d/05d1f624e9d4bb2a8c16aae476525456.jpg","description":"Manage all aspects of your own republic with planned economy, including mining resources, manufacturing goods, construction, investments, and citizens too.\nCreate your own industrial complexes with loading and unloading stations, storage, warehouses, and factories.\nBuild the infrastructure and manage its traffic, including roads, railways, sidewalks, conveyors, wiring, and pipelines. Wisely place and connect factories, houses and warehouses, and make the most efficient connections.\nPlan and build the living areas with everything your citizens may need to live their happy life, such as playgrounds, cinema s, taverns, and shops.\nSend your citizens to the mine to get coal, iron and other natural resources; or send them to the fields to pick up the crops; or take them to factories to produce manufactured goods.\nSell and purchase resources and goods from western countries or other soviet countries to get dollars or rubles and buy the products or resources you need ... or invest in new infrastructure or buildings.\nEnjoy authentic soviet buildings and vehicles, as well as realistic landscapes of the 60's to the 90's.\nPlay the way you want! You can focus on getting natural resources or products and trade them for money; or you can build a self-sufficient republic; or you can just use the easy sandbox mode with unlimited money/resources and just enjoy building something live.\nEconomic simulation. Prices of resources on the global market are changing over time as you play –one day you can sell or purchase steel for a $100 per ton, but in a few months the cost can rise to $200 or decrease to $50. The price of everything is connected to the cost of work and resources.\nIncreasing difficulty.As prices change, the demands of the citizens also change, and you will need more resources to keep them happy and force them to work.RESOURCES & INDUSTRY\nThere are, right now, over 30 commodities you can mine, transport and manufacture. If you want to get clothes you will first need to get resources to create a fabric, then you will need a clothing factory where the clothes will be manufactured from this fabric. You can then transport the finished clothes into shops where your citizens can buy them.\nEvery commodity has a specific requirement,so if you would like to load oil into the tank train-car you will need a special pumping loading station. If you need to load gravel into a dumper truck you need a special loading station where the gravel comes from conveyors into the truck. Liquid resources like oil or fuel can be stored only in tanks, while resources like wood, steel, or prefabricated concrete panels can be stored outside in the open space. Using a crane for these will increase loading/unloading speed. Goods like clothes, food, etc. can be stored in warehouses.WORKERS AND THEIRS DEMANDS\nEvery worker/citizen goes to work each day. If they work for you, they have demands. At the start of the game they are satisfied just with food, but as a time goes on they may have more demands like meat, clothes, alcohol or electronics. Also, to have happy workers you need places where they can spend their leisure time – cinema, playgrounds, taverns, etc.\nEvery worker has an education level. They can go to school or college to improve this level. If their education is too low they cannot work; if their education is high enough they can be a teacher, or researcher, or work in factories with special requirements.TRANSPORTATION\nYou have many options for how you will manage resources and goods transportation. If you get raw iron ore from a mine, you need to process it. Then you need to transport it somehow into a steel mill to produce steel. You can build the processing plant and steel mill near to the mine and transport it all by conveyors, or you can transport iron ore into a steel mill by train fora longer distance.\nIt is up to you to decide from where the workers will go into the factories. You can create residential zones and transport workers by buses or trains to industrial areas. You can also build residential buildings near the factories so that workers will able to walk to the factory. But don't forget that a worker will need to purchase food and enjoy their free time, so again it is up to you to decide whether to build those facilities near their home or whether you will transport them somehow to shops or places to spend their free time.ECONOMY SIMULATION\nThe game simulates the economy system. There are no fixed prices! Costs of everything are defined by the economic situation. For example, the cost of steel is calculated from the price of iron, coal and work, and also partially from the cost of steel mill construction.\nYou purchase or sell commodities for money (dollars or rubles). But be careful, as it is possible that if you buy or sell for high values you will affect the price of the commodity on the market. You may be able to purchase for a higher price or sell it cheaper.\nAs time increases, so does complexity. Some resources or products may become more expensive (as, for example, less human work is needed with advanced technologies), so later with more complexity, it may be necessary to be as self-sufficient as possible.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"3Division","platforms":[{"id":0,"name":"PC"}]},{"id":59354,"name":"My Hero One’s Justice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3b/d3bf5fdcc86ed61032d90022b2c13196.jpg","description":"Whether you want to see the destruction of humanity or believe heroes should defend those in need, fight to prove your justice in MY HERO ONE’S JUSTICE.  The popular Weekly Shonen Jump manga series comes to life, as players experience the abilities of fan favorite characters such as Izuku Midoriya, Katsuki Bakugo, Tomura Shigaraki, and many more in this arena brawler, where you’ll get to choose between hero and villain in your path to justice. \r\n\r\nUtilize Quirks and call upon your side-kicks to activate powerful attacks where your environments are at your disposal in total field destruction. The battle doesn’t just confine you to the ground - take the fight upwards where buildings and walls become a part of the action. \r\n\r\nPlus Ultra! – Based on the hit weekly Shonen Jump manga series\r\n\r\nHeroes or Villains – Choose between fan favorite characters like Deku, All Might, Tomura, and many more in your path to justice\r\n\r\nTotal Destruction – The environments are at your disposal as players can destroy their surroundings in fierce battles \r\n\r\nJoin Forces – Choose up to 2 sidekicks to unleash powerful combos\r\n\r\nUnleash Superpowers – Utilize each character’s Quirks to plant explosive attack","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":23264,"name":"All Walls Must Fall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b7e/b7e0e61120b18694ef40f90b86a1d135.jpg","description":"Berlin, November 2089: The Cold War never ended. For 150 years both sides have used time manipulation technology to observe and counter each other’s every move. Now this fragile state of affairs is approaching a breaking point, as a rogue nuclear strike will send the world into turmoil. Both sides have scrambled to send agents back in time to find who is behind the attack and how to prevent it. If they fail, the whole world will turn to ash, forever.\nAll Walls Must Fall is an isometric tactics game where actions happen to the pulsing beat of the music. You control time travelling secret agents as they jump and loop through a single night in the city of Berlin. Using a pausable real-time system, carefully plan your decisions and use powerful time manipulation abilities to your advantage, as you carry out your mission in the shadows or in plain sight. Levels are procedurally recombined, giving All Walls Must Fall a highly replayable campaign structure, while still offering individually crafted components and set-pieces.\nAll Walls Must Fall takes inspiration from genre classics like X-Com, Syndicate and REZ, as well more recent indie games like The Banner Saga, Braid, SUPERHOT and Crypt of the Necrodancer.\nIsometric action-tactics game for Windows, Mac and Linux\nHybrid real-time / simultaneous turn-based tactical gameplay\nProcedurally generated levels and campaign that plays different every time\nSci-Fi noir Berlin as a divided city in which the Cold War never ended\nMind-bending time manipulation abilities that allow you to experiment with possible futures and rewind to the past.\nSynaesthetic nightclub environments and audio\nA simulation sandbox featuring crowd simulation and destructible objects\nA parable that reflects on free will, moral ambiguity and the meaning of freedom\nDeveloped by a team of former AAA professionals using Unreal Engine 4Original Soundtrack\nAll Walls Must Fall features a killer soundtrack that reacts to the gameplay, and features original music from talented artists drawn from both the Berlin club scene and the world of video game music:\nJukio Kallio (Nuclear Throne, LUFTRAUSERS, Bleed 2)\nBen Prunty (FTL, Darkside Detective, Into the Breach)\nKuedo (Knives, Planet Mu)\nThe Orion Correlation and Lost & Found (Voidance records)\nMona Mur (Kane & Lynch 2: Dog Days, Velvet Assassin)\nmuuutsch (inbetweengames)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"inbetweengames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":20797,"name":"Depths of Fear :: Knossos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0b/c0bef721f102f02a02f74cd11954bd87.jpg","description":"Depths of Fear :: Knossos is a Greek-themed 1st person adventure game with stealth, action and edge-of-your-seat elements within rogue-like procedurally generated levels. You will run. You will hide. You will fight. You will die.\nThe fate of Athens is in your hands as you step into the role of legendary Greek hero Theseus. Offering yourself for tribute unto the corrupt King Minos, you embark upon a perilous quest deep beneath the city of Knossos to slay the twisted mythical beast - The Minotaur. But, before you can complete this hero's journey you must steadfast the trials of ever-changing creature-filled labyrinths. Collect gold to deal with Daedalus, building up your armory whilst seeking out the mythological medallions that unlock a master sword, the only weapon known that can pierce the Minotaur's cursed flesh. May the gods of Greece be with you, son of Poseidon!\nAn ever changing Labyrinth: Each stage in Depths of Fear is crafted to never be the same twice creating a constant state of tension of the unknown.\nFace the Beasts of Ancient Greece:  Survive encounters against 8 immortal legendary creatures: Saytr, Cerberus, Centaur, Manticore, Griffin, Medusa, Hydra and the horror of the Minotaur.\nDiverse Gameplay:  To survive one must learn when to sneak through the shadows, when to run and when to engage in combat as they attempt to survive each rung down into in the darkness.\nKnowledge is Power:  Appease the gods by finding their books and earning their favor for special powers such as lightening from Zeus, Speed from Hermes, Earth shaking might from Poseidon or the illuminating light of Apollo.\nBuild an Arsenal: Loot the labyrinths for gold to purchase 8 trusty weapons that range from Blades and Clubs to the Trident and Crossbow. Use these weapons to secure the 8 creature medallions that unlock the only weapon known that can slay the legendary beast Minotaur.\nChallenge the Unknown: When the adventure ends, the game has just begun. Beneath the skull a never-ending challenge awaits in the entrance of the unknown that provides countless replay value. How far down can you make it?\nUnique & Adaptive soundtrack:  Featuring a tension-based music system, the soundtrack (recorded with mind-altering 70’s era synthesizers) adapts to your situation.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Dirigo Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20423,"name":"Small Town Terrors: Galdor's Bluff Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/193/1930745ad227a6aa64e913c5e668ba6a.jpg","description":"You've been cordially invited to attend the performance of Thurman the Magnificent, one of the world's greatest illusionists. His entire career rests on the success of this trick, and Thurman is worried someone may be sabotaging it. He wants you to watch for anyone suspicious at the premiere. Will his performance bring down the house, or will his toughest rival top his act with something even more spectacular? The Master of Flames will soon learn that when you play with fire, you get burned.\nA magical tale of deception and illusion awaits as you investigate and look for answers.\nOver 50 morphing items to find\nDiscover secret clues and solve magical puzzles\nBackstory of Addington and Thurman in the bonus chapter\nWallpapers, concept art and achievements\nOption to skip hidden object scenes and play pyramid solitaire instead\nSix bonus solitaire games","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":20349,"name":"Gold Rush! Anniversary","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc5/fc5083988e2706088cead9b5f8deab81.jpg","description":"In 1988, Rush appeared with Gold! in one of the most comprehensive adventure games of the 1980s. Now, the fondly remembered game, Gold Rush! has been developed anew, to today’s highest standards. No aspect of modern gaming has been overlooked.  You can experience the famous California Gold Rush with high-resolution graphics, speech synthesis, a superb sound track and modern user interface features. Optimized game-flow will enhance your traveling and interactions with other characters of the period.\nGold Rush! takes you back to the year 1849, when gold was discovered in California. It was certainly one of the most exciting times in American history. Gold Rush! includes the three routes tens of thousands took to the gold regions.  Become Jerrod Wilson and experience each trek as you travel from New York to California.\nWhichever route you decide to take, you will see many historical sights. Try going overland across the Great Plains and huge mountain ranges, crossing the Isthmus of Panama, or rounding Cape Horn on the tip of South America. If you survive and arrive at Sutter’s Fort, the adventure is still only half over!  Many other puzzles remain to be solved before you achieve your goals in California.Features:Over 130 pre-rendered images and animated scenes in full HD\nThree different routes west (3 adventures in one game)\nHigh quality voices and new recorded music\nSubtitles in English or German (Point & Click!)\nOptimized game-flow (minimizing dead-ends and random perils)\nTwo possibilities for controlling (original parser as well as a new intelligent Point&Click control)Bonus item: (Normal Edition)Historical map of the three routesBonus item: (Special Edition)Historical map of the three routes\nOver 90 unpublished original concept drawings of the developer from the 80s, as png\nBooklet with unpublished original concept drawings of the developer from the 80s, as pdf\nMaking-of booklet, as pdf\nGold Rush! Classic version (only PC!)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sunlight Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]}]