[{"id":19011,"name":"Freddi Fish and Luther's Maze Madness","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GameDive in to help Freddi Fish and Luther navigate a labyrinth of underwater caves and collect the scattered kelp seeds!\nOver 50 maze-crazed caverns to explore. Junior Arcade games are jam-packed with fast-and-furious gameplay that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.\nProduct Features:\nChallenging, arcade-style games for kids ages 3 to 8 (and children of all ages)\nAction with all the quality you would expect from Humongous Entertainment\nSave your game after each level and track the scores of up to 75 players\nThe easy-to-use Custom Level Builder allows kids to make their own a-maze-ing levels\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/cad/cad8784db35103a8b5b42ebf75110ed9.jpg","releaseYear":2013,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":17089,"name":"Unrest","genre":"Adventure","price":0.0,"description":"Set in a fantasy interpretation of ancient India, Unrest is an adventure RPG focused on story and choices. Play as five ordinary people who are struggling to get by in the famine-stricken city-state of Bhimra.\nBrave poverty, disease, treason, political and social upheaval. Face unique burdens and gripping dilemmas as you struggle to survive in each chapter...but choices made to help one character may well make life harder for another.\nIn Unrest, there are no heroes of legend, there is no mystical quest, and fate has not chosen you.\nYou're on your own.Key Features\nDiverse Characters: Play as a peasant girl faced with an arranged marriage, a priest troubled by his radical temple, a slum dweller with a dangerous past, an ambassador from a militant nation, and a mercenary captain far out of his depth - all as part of the same narrative.\nReactive Storyline: Hard decisions made in one chapter have consequences in the next. A choice made as one character may well determine the fate of another.\nNo Right Answers: There are no fail states in Unrest - if a character dies or fails in their objectives, that becomes part of the narrative. You can play in Iron Man mode to ensure there are no second chances, or save/load if you wish (not that we recommend it).\nComplex Conversations: Unrest's dialogues are organic, branching exchanges designed to offer an unparalleled level of control and involvement to the player. You'll always know exactly what you're saying and how you're saying it, and you'll be able to see how much the person likes, fears, or respects you as a result.\nViolence is Rarely the Answer: Combat in Unrest is rare and always avoidable. When faced with the possibility of death, it's up to you to decide how much you're willing to risk.\nLush Art & Music: Unrest's hand-drawn sprites and environments call to mind a living canvas, while the classical Indian soundtrack perfectly echoes the narrative's emotional core.\nMod Support: Create and share your own worlds and adventures.Notable MentionsUnrest is a game that makes me think of Bede, of transience and loss...Unrest captures something of the lives of people rather than the bombast of heroes and protagonists.\n- Rock Paper Shotgun\nOne of Time Magazine‘s games to watch for summer 2014\nPyrodactyl’s promises of deep interactivity and role playing freedom have, in fact, been fulfilled - The Cloud Monster\n[Unrest] tells the kind of story that very few games are willing (or able) to tell... - New World Notes\n…seems really cool. I’m so thrilled that [Unrest] even exists – Jesse CoxSpecial Edition Content The Unrest OST, a 12-track instrumental album inspired by Indian classical music. (Preview)\nA novella set in Bhimra, written by Rutskarn of Chocolate Hammer. (Preview)\nHigh-res digital posters, including a concept map of Bhimra\nBehind the scenes developer footage\nConcept art & Design documents","imageUrl":"https://media.rawg.io/media/screenshots/7c8/7c83742f84e2c1b13e93f4bb36caade1.jpg","releaseYear":2014,"developer":"Pyrodactyl","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16768,"name":"Booster Trooper","genre":"Action","price":0.0,"description":"Booster Trooper is the future of multiplayer platform shooters.  It provides tons of fun with its fast paced action and larger-than-life weapons. You can run or fly around the map, blasting your enemies to bits with bullets, rockets, grenades, magma and other weapons from your arsenal.\nWhether you play it against the BOTs or a live player, Booster Trooper will constantly keep you on the edge! Rankings, co-operation, tactics and split second decisions will deliver hours and hours of online multiplayer entertainment!Key features:\t\t\t\t\tFast paced, adrenaline packed game play.\n12 Player Multiplayer.\nMore than 15 Maps\nVarious weapons, ranging from assault rifle, shotgun, sniper rifle to minigun, magma thrower and more.\nEach weapon is unique, requiring different approach & tactics.\nOnline ranking boards.\nMore than 250 Achievements\nSingle player vs. bots supported.\nDeathmatch, Team DM, Capture the Flag, Destroy the base and more…\nShips with dedicated server software\n","imageUrl":"https://media.rawg.io/media/screenshots/9c6/9c622d129e6313ecc442ac31ddafa3cb.jpg","releaseYear":2010,"developer":"DnS Development","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15631,"name":"HEBEREKE!: March! Red Army Girls' Brigade","genre":"RPG","price":0.0,"description":"On September 1939,\nThe biggest war in the history, WWII broke out.\nYou are a commander of Soviet Union Independent Girl Brigades.\nFight over 5 years battle against Nazi, and bring Victory to the mother country!\nУрааааааааааааа!!!\nHardcore SLG, user friendly RPG and Dating Sim are combined into one Tactical RPG!\nEastern Front with huge battlefield and Various weapons are expressed by cute pixel arts.\nIn tactilal phase, develop strategy, purchase weapons, and train officers.\nIn the battle phase,  command units according to the various elements, Stealth and Search,  Zone Of Control, Direction, Air support etc…\n8 cute and sexy characteristic heroines.\nVoices by Japanese voice actress.\nAbout 70 existent weapons!\nT-34, Mosin-Nagant, Katyusha, etc…\nAbout 20 Maps!\nMaps are based on famous battles in Eastern Front, such as Battle of Moscow, Battle of Kursk, etc…\nSchool Phase between chapters.\nHeroines teache you Russian History, Weapon, and miscellaneous knowledges about Russia.\nComedy story, that fools hell of the war!\nAdjustable difficulty.\nBGMs are arranged Russian martial songs.\nAbout 15 hours total playtime (till the 1st ending).\nAdditional maps and Addtioanl challenges.\nSupport gamepad.\nFREE TO PLAY.\nNo charge from game start till ending.\n*1 All the characters in this game are older than leagal drinking age!\n*2 This game supports only Japanese language at the morment.\n*3 This game cntains some Mature Contents(service scenes).","imageUrl":"https://media.rawg.io/media/screenshots/684/684213ad3abf3dd4a28dd6f05d809360.jpg","releaseYear":2016,"developer":"Japan War Game Development","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":14976,"name":"Sonic 3 and Knuckles","genre":"Platformer","price":0.0,"description":"Dr. Eggman’s (AKA Dr. Robotnik’s) Death Egg was once again blasted by Sonic, crash-landing on the peak of a volcano on the Floating Island.\nDr. Eggman is still at large, and Sonic can’t allow him to get his hands on the Master Emerald and repair the Death Egg. Sonic must also keep Knuckles off his back but Knuckles has problems too. As guardian of the Floating Island and all the Emeralds, Knuckles must do his part to keep the island safe. While they’re going the rounds with each other, who will stop Dr. Eggman?","imageUrl":"https://media.rawg.io/media/screenshots/9ab/9abb9fbe806ff02a3c36093d2c78817f.jpg","releaseYear":1994,"developer":"SEGA","libraryGames":null,"platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"PC"}]},{"id":14028,"name":"Strange Night","genre":"Indie","price":0.0,"description":"S  T  R  A  N  G  E     N  I  G  H  T\nis a psychological horror game in first person, the player controls cameras monitoring, and need to make periodic rounds.\nThe game begins after a mysterious man hiring a night security firm to work in her apartment.\nBut the staff did not expect, fear and madness behind this place.\nStrange Night is an inspired game in the atmospheric environment of P.T.,\nand working with the cameras, brings a bit of FNAF's tension.\nFor a better user's experience, the game will only work from 22 pm until 07 am.\n_________________________________________________________________________________________\nS  T  R  A  N  G  E     N  I  G  H  T\né um jogo de terror psicológico em primeira pessoa, o jogador controla o monitoramento de câmeras, e precisa fazer rondas periódicas.\nO jogo começa depois que um homem misterioso  contrata de uma empresa de segurança noturna para trabalhar em seu apartamento.\nMas a equipe não esperava, medo e loucura por trás deste lugar.\nStrange Night é um jogo inspirado no ambiente atmosférico de P.T.\ne trabalhar com as câmeras, traz um pouco de tensão da FNAF's.\nPara melhor experiência do usuário , o jogo só funcionará partir 22h até 07h.","imageUrl":"https://media.rawg.io/media/screenshots/7ab/7abedfb5cb7b47787c87c77bea764e8c.jpg","releaseYear":2016,"developer":"LB","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":13941,"name":"Sea Dogs: To Each His Own","genre":"RPG","price":0.0,"description":"1654 AC. The Caribbean. A place of opportunities and mysteries. Take a role of Charles de Maure - a young French noble who arrived to the New World to assist his brother. What seemed to be a simple family matter, turned into a lifelong adventure. This is a story of the noble idler who became the most powerful man of the Caribbean. Riches, titles, power, romance - the ultimate booty awaits, it is up to you how to get it all. Become a pirate and terrorize the archipelago, take prizes in the sea and plunder cities. Or try to keep hands mostly clean - trade both goods and information, work for the state and help the folk. Get a ship, arm yourself, gather a crew of your dream and find love. The New World is way too vast, too dangerous to explore it alone and there are always consequences for the choices you make!\n\nKey Features:\n- Naval warfare, both challenging and rewarding\n- Self-reliant and replayable story mode (over 70 hours of gameplay)\n- Remastered in-game art and improved visuals (textures, models etc.)\n- Challenging AI, crafting, trading, fighting, gambling\n- Freeplay mode, endless as an ocean\n- Hundreds of items and weapons","imageUrl":"https://media.rawg.io/media/screenshots/8fb/8fbac9d5057bbee6359343a03a15f8e8.jpg","releaseYear":2016,"developer":"BlackMark Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10984,"name":"Lost In Woods 2","genre":"Action","price":0.0,"description":"You wake up in woods unknown to you. No people nearby, no car, no telephone. You are completely alone. You need to get out of the forest alive, which will be hard because of wild animals wandering around; you also need to find food, stay warm in the cold and find a place to spend the night at. If you don't succeed, you will die lost in this strange place. And don't think that you'll find so easily the door you've been looking for...\nThere are two difficulty levels: the normal green forest and the winter forest. Survival in the winter forest is more difficult due to some resources being more scarce. The entire game world is [randomly] generated, but its size is limited. It is populated by most diverse wildlife and filled with useful and useless items, many of which are needed to create tools and weapons or just tasty dishes... All these things will help you to survive and to find an exit from the forest.","imageUrl":"https://media.rawg.io/media/screenshots/7a0/7a0683c9647fa4e5c11c1460e653328f.jpg","releaseYear":2016,"developer":"Crouching Fox","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10849,"name":"Jaunt VR - Experience Cinematic Virtual Reality","genre":"Desconocido","price":0.0,"description":"Experience the widest array of premium cinematic virtual reality experiences with Jaunt's re-imagined fully immersive app. Jaunt delivers unparalleled and all enveloping VR experiences anytime, anywhere.\nMUST SEE VR EXPERIENCES:\n- Follow #1 male model Derek Zoolander around a ridiculously good looking virtual photoshoot\n- Let the queen of happy, Lilly Singh, take you on a trip to Unicorn Island\n- Come celebrate Disneyland's 60th Anniversary celebration on Main Street, USA\n- Get an exclusive behind-the-scenes view of the 2016 Grammy Awards with CBS News\n- Experience the excitement, energy, and passion of the 2016 Bridgestone NHL Winter Classic in Foxboro, Massachusetts!\n- Be on stage with Jack White as he performs “Freedom At 21” at The Bleacher Theater at Fenway Park in Boston, MA","imageUrl":"https://media.rawg.io/media/screenshots/4e6/4e69af95ffb913838d163ff757d3b3fe.jpg","releaseYear":2016,"developer":"Jaunt","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10264,"name":"Bohemian Killing","genre":"Adventure","price":0.0,"description":"Steampunk Paris, set against the background of the late 19th century, torn between tradition and modernity. Class differences and pervasive racism finally lead to a tragedy. A year later you find yourself on trial, accused of a brutal murder. How far will you go to exonerate yourself? Will you lie, seek evidence to prop your testimony or, perhaps, pretend to be insane? Your imagination is the limit. OVERVIEWBohemian Killing is a narrative-driven courtroom drama, offering players almost unlimited possibilities of solving the lawsuit, thanks to the complete integration of gameplay and narrated story. It is also the first law-themed game made by a real-life lawyer!STORYLINEWelcome to Paris of the late 19th century. The aftermath of the Great Revolution offered a new start for each and every citizen, regardless of social class. Alfred Ethon, a young inventor of Gypsy origin, benefits from the change, becoming a symbol of success thanks to his hard work and innovative projects, well ahead of their time.\nSoon, a young woman is brutally murdered - a maid working for an impoverished Lord, a relic of the old French regime. Is Alfred Ethon to be blamed for the murder? The evidence points towards him... But you can change that.\nAs you stand before the court, all you can count on is your own intellect and creativity. But how does that look in practice?GAMEPLAYGameplay in Bohemian Killing is a combination of a courtroom drama, and a walking simulator. It can be classified as a first person experience, or a first person interactive story adventure game.\nThe story is set within two time frames. In the present, you find yourself locked up in the courtroom. You're getting acquainted with the evidence, witness testimony and questions posed by the Judge. Each question triggers a flashback - and begins your testimony. During the flashback you find yourself in a Parisian district, with each of your decisions, interactions and action affecting Alfred Ethons' testimony and the final verdict.\nTo help you in your testimony, you'll have access to all the evidence gathered on the case - expert opinions, reports and witness testimonies. Each of them can be (but doesn't have to be!) refuted in a number of different ways.\nIn the Evidence menu you can familiarize yourself with testimonies of witnesses, forensic expertises, physical evidences, etc. They are grouped into appropriate categories, making them easy to find.\nSample:\nA neighbor testified that at approximately 10 p.m. he passed you in the entrance of the tenement house, noticing that your clothes were covered in blood? Try testifying that your neighbor lies and prove that he has a reason to do so. Or maybe you'll get into a bar fight just a few minutes before, so that you can testify that the blood the neighbor saw was yours, and not the victim's? Or maybe you will cut yourself while shaving, covering your clothes with blood that the neighbor sees later? But what if the court finds your time of shaving conspicuous and torments you with even more questions? How will you get out of this?\nWith a wide range of possibilities that can lead to several standard endings and one additional hidden one, the game doesn't consider any path \"a bad one\", ensuring that each playthrough will be different.\nTo adjust the game to the preferences of each player, two modes are available:\nIn the Standard mode, the outcome depends entirely on your creativity and ability to solve logical problems. You will suffer the consequences of your own actions.\nIn the Story mode, your attorney will advise you as you progress along, commenting on your decisions and choices, preventing you from acting in a way that might prove to be harmful in the eyes of the court. VOICE ACTINGThe main character of the game is played and dubbed by a world-class film and voice actor, Stephane Cornicard!\nStephane Cornicard studied in France, at the prestigious Colby College in the US, and at Goldsmith College in the UK. He played in numerous blockbusters such as “Spectre,” the most recent Bond film, or Steven Spielberg’s “Saving Private Ryan”.\nHis career as a voice actor is no less impressive and includes Syphon Filter, Primal, Metal Gear Solid, and the Dragon Age and Total War series. He currently teaches drama at the Actor’s Centre in London.\nAWARDS","imageUrl":"https://media.rawg.io/media/screenshots/d4f/d4f6e342bc8fda57d66dac40155b8807.jpg","releaseYear":2016,"developer":"The Moonwalls","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":8730,"name":"Spectrum","genre":"Action","price":0.0,"description":"If you love colours, you'll love Spectrum: a relaxing colour sorting game in three dimensions which tests your skill in matching tints, shades, value and hue.\nThe Challenge: to re-assemble the cube, putting each block in its place between the corners. You'll never play the same cube twice!\nFeatures:\nInfinite levels\nTools: Build Frame, Pop, Scooch\nSave progress\nEject any misplaced blocks\nSearch through the floating blocks with vortex\nMistakes can be easy to find with an outline option\nCompatible with Razer Chroma keyboards. VR gameplay coming soon\n","imageUrl":"https://media.rawg.io/media/screenshots/a06/a0633cc6fd6f24c61b6ee278673fdb67.jpeg","releaseYear":2015,"developer":"Digerati Distribution","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":6609,"name":"6180 the moon","genre":"Action","price":0.0,"description":"Let's super high jump through the screen!\n6180 the moon is a platformer game with a unique mechanic. It offers a fresh, unseen game play style by connecting the top and bottom of the screen. This allows in a mechanic with delightfully long jumps and no fear of \"slipping\" to death.\nIn addition to the unique gameplay, 6180 the moon delivers a unique storyline. The Sun has gone. The Moon sets off on a journey to find the Sun. Along the journey will be hazardous courses and deep realizations.","imageUrl":"https://media.rawg.io/media/screenshots/a44/a4420824339435aa23948c2c04f59033.jpg","releaseYear":2014,"developer":"Turtle Cream","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":5405,"name":"The Last Guy","genre":"Action","price":0.0,"description":"Earth has been struck by a mysterious purple beam of light and everyone touched by it has turned into a giant zombie. You are the chosen one, a zombie hero from the Himalayan mountains, and it is up to you to rescue the last survivors on Earth by leading them to safety through zombie-infested streets. Make your way through 15 detailed real-world cities, shown from a classic arcade style overhead view, and lead the remaining survivors to the Escape Zone before time runs out in this frantic, addictive game.\nDownload the full game today!\nKey Features:\n•\tClassic, Addictive Gameplay - Overhead view and simple controls make it easy to learn and hard to put down.\n•\tReal Cities - Each of the 15 stages is brought to life with real aerial photography of the actual city, including Los Angeles, Tokyo, and London.\n•\tSpecial Abilities - Utilize special powers such as dash and thermography heat vision.\n•\tPower-Ups – Take advantage of five kinds of power-ups to help complete each stage.\n•\tTrophy Support - Unlock a variety of challenging Trophies to add to your collection.\nThe Last Guy is a trademark of Sony Computer Entertainment America Inc.  © 2008 Sony Computer Entertainment Inc.\nUse of this item is subject to the PlayStation®Network Terms of Service/User Agreement. If you do not wish to accept all these terms, do not use this item.\nVideo output in HD requires cables and an HD-compatible display, both sold separately.  This game supports displays ranging from standard definition to 1080p displays.","imageUrl":"https://media.rawg.io/media/screenshots/843/8437f3c3973445f8e00a3b3721d6c070.jpg","releaseYear":2008,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4253,"name":"New Little King's Story","genre":"Strategy","price":0.0,"description":"Based on the classic action adventure RPG, players can enter the role of King Corobo and experience his incredible journey to win back his kingdom.\nFeatures:\n•\tBrand New Storyline – Fans and new players alike can experience a re-imagining of Little King’s Story, featuring King Corobo!  Save royal princesses, travel unknown lands and conquer your enemies!\n•\tEnhanced PS Vita System Graphics and Features – Experience an ever-changing 24-hour world filled with upgraded 2D and 3D visuals and utilizes intuitive touch controls..\n•\tLead Massive Armies and Build Your Kingdom – Make your plan of attack!  Use your scouting ability to organize your citizens based on their job skills and lead your army’s battle formations.\n•\tNew Online Functionality to Enhance Your Game Play Experience – Enjoy a myriad of newly added online features including downloadable content, item combining co-operative play, and online leader boards!\n1 player(s)\nNetwork Features\n6144KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service).\n© Konami Digital Entertainment","imageUrl":"https://media.rawg.io/media/screenshots/d1c/d1cbcf3955dbf0156424ec5a2590bec0.jpg","releaseYear":2012,"developer":"Konami Digital Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"}]},{"id":3659,"name":"XBlaze Code: Embryo","genre":"Adventure","price":0.0,"description":"Set 150 years before the events of BlazBlue: Calamity Trigger, XBlaze Code: Embryo is a visual novel that follows Touya Kagari, a high school student whose world is turned upside down when he is attacked by a seemingly otherworldly being and saved by a mysterious girl named Es. Delve deeper into the BlazBlue mythos and learn about events prior to Ragna the Bloodedge’s epic journey!","imageUrl":"https://media.rawg.io/media/screenshots/d5a/d5af4557d628d8d47d84a2123e6c421b.jpg","releaseYear":2013,"developer":"Arc System Works","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":605,"name":"Super Mario Run","genre":"Action","price":0.0,"description":"A new kind of Mario game that you can play with one hand.\nYou control Mario by tapping as he constantly runs forward. You time your taps to pull off stylish jumps, midair spins, and wall jumps to gather coins and reach the goal!\nSuper Mario Run can be downloaded for free and after you purchase the game, you will be able to play all the modes with no additional payment required. You can try out all three modes before purchase: World Tour, Toad Rally, and Kingdom Builder.\n■World Tour\nRun and jump with style to rescue Princess Peach from Bowser’s clutches!\nTravel through plains, caverns, ghost houses, airships, castles, and more...\nTo reach Bowser’s Castle, clear the 24 courses located across 6 worlds. There are many ways to enjoy the courses, such as collecting the 3 different types of colored coins or by competing for the highest score against your friends. You can try courses 1-1 to 1-4 for free.\n■Toad Rally\nShow off Mario’s stylish moves, compete against your friends, and challenge people from all over the world.\nA challenge mode where the competition differs each time you play.\nCompete against the stylish moves of other players for the highest score as you gather coins and get cheered on by a crowd of Toads. Fill the gauge with stylish moves to enter Coin Rush Mode to get more coins. If you win the rally, the cheering Toads will come live in your kingdom, and your kingdom will grow.\n■Kingdom Builder\nGather coins and Toads to build your very own kingdom.\nCombine different buildings and decorations to create your own unique kingdom. There are over 100 kinds of items in the Kingdom Builder mode. If you get more Toads in Toad Rally, the number of buildings and decorations available will increase. With the help of the friendly Toads you can gradually build up your kingdom.\n■What You Can Do After Purchasing All Worlds\n・ All courses in World Tour are playable\nYou can play all 24 courses over all 6 worlds. Why not try out the bigger challenges and thrills available in all courses?\n・ More playable characters\nIf you complete course 6-4 to rescue Peach, and build homes for Luigi, Yoshi, and Toadette in Kingdom Builder, you can get them to join your adventures as playable characters. They play differently to Mario, so why not put their special characteristics to good use in World Tour and Toad Rally?\n・ More courses in Toad Rally\nThe types of courses available in Toad Rally will increase to seven different types of courses, expanding the fun! In the new additions, Purple and Yellow Toads may also come to cheer for you.\n・ More buildings and decorations in Kingdom Builder\nThe types of building available will increase, so you'll be able to make your kingdom even more lively. You can also place Rainbow Bridges to expand your kingdom.\n*Internet connectivity required to play. Data charges may apply.","imageUrl":"https://media.rawg.io/media/games/7e2/7e25146beabf26e6de6b83e85c8ce7f2.jpg","releaseYear":2016,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":987121,"name":"ANOMALOUS COFFEE MACHINE","genre":"Simulation","price":0.0,"description":"Anomalous Coffee Machine is a unique visual novel interactive simulation style game where you encounter a mysterious girl that, for unknown reasons, asks you to use and explore her mysterious and seemingly anomalous coffee vending machine (like SCP-294)!\n\nOf course, as the name implies, it's no ordinary vending machine. Instead, the coffee machine can dispense any cup of liquid, whether it's possible or impossible.","imageUrl":"https://media.rawg.io/media/screenshots/1ad/1adc887a4345dfcfc4ea939b8064798c.jpg","releaseYear":2024,"developer":"Desconocido","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":985592,"name":"Dungeonborne","genre":"Action","price":0.0,"description":"Discord\nEvent\nAbout the Game\nDescend into the treacherous corridors of Clouseau Castle or brave the multi-floored labyrinth of Sinner's End. Prepare a death from above with unique landscapes that express a sense of verticality. Discover hoards of priceless artifacts and conquer the monstrous guardians that stand in your path. Then lead your party to safety, before these walls become your tomb.\nEmbrace your role as a Fighter, Priest, Rogue, Swordmaster, Pyromancer, Cryomancer, Death Knight, or Druid. With first-person clarity, feel the power of each spell, the weight of your weapons, and the strategic impact of every decision. Charge into battle, unleash devastating skills to disrupt enemy formations, cast life-saving buffs on allies, or use tactical throwables to turn the tide. Dungeonborne seamlessly blends the immediacy of first-person action with iconic fantasy class design for an unparalleled experience.\nWith over 10 unique weapon pairings, every duel becomes a dance of death that brings a fluid, back-and-forth action combat experience. Parry, block, and riposte in a high-stakes fight where skill determines the victor.\nDiscover equipment with over 80 item affixes that synergize perfectly with your playstyle, or completely change the way you play. Trade items in a user-friendly auction house, then hunt for dozens of legendary and unique items designed to help you sculpt the ultimate build. In Dungeonborne, the thrill of finding rare loot is accessible to all, not just the most dedicated players.\nStep into the competitive Arena mode, where you can challenge fellow adventurers, revel in the thrill of combat, and strategize for victory without risking your hard-earned gear. With Dungeonborne's Seasons system, expect frequent updates that introduce fresh content, ensuring that each chapter of your journey is filled with new challenges and rewards.","imageUrl":"https://media.rawg.io/media/screenshots/8bd/8bdab6fac960a378a8a01f29e0fe8541.jpg","releaseYear":2024,"developer":"Mithril Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":854488,"name":"SpiderHeck","genre":"Action","price":0.0,"description":"\nYour goal is simple: try and survive fights to the death.\nSpiderHeck is a fast-paced couch co-op brawler where spiders battle it out in a deadly dance of chaos. Choose to take on waves of ferocious enemies as a lone wolf (spider), or join forces with your friends, then challenge them to a duel afterwards so you can gleefully watch them do a neat trick before they launch themselves face-first into the lava.\nFEATURES\nBattle it out, have fun, or… uh... suffer\nWhat mode are you in the mood for today? Cut down waves of enemies or create modded duels; fight one-on-one or try to make it through the challenges—then try again, and again, and again… Alternatively, you can just spend your time putting cute hats on the spiders.\nPlay alone or get the squad in on the action\nSure, you can play with your friends: co-op or against each other, local or online… But what if you don't have any friends? Don't worry, we're here to give you a big hug and let you know that there are tons of solo modes, too. And if you feel like making friends so you have someone to play with, use the quick search to find random opponents or visit our Discord channel. We've got everyone covered.\nLimitless potential for gravity-defying stunts\nThe physics system here is so much more than just swinging from webs: do a somersault, push off of your opponent, swing your sword 360°, get stuck, wiggle your way out, and deal the killing blow as you land on your enemy's head. Now imagine all that but in zero gravity (yes, there's a level like that!).\nCombine different survival tactics\nEach arena has its own unique features, and while some may help you, others will bring the pain. You're welcome to come up with a strategy in the beginning and stick to it, but you don't have to—just let inertia and random chance make your gameplay unpredictable.\nCrush your enemies with a mind-blowing variety of weapons\nUse shotguns, rocket launchers, mines, and single-bladed or double-bladed laser swords to slash, crush, blow up and… oh, hang on, there's something else… it only takes one hit to kill in this game, which means that with certain weapons you might be offing yourself along with your enemies. We just figured we'd mention that, ya know.\nCustomize your spiders\nThere are plenty of default colors available and you can earn hats by unlocking achievements (to make things more interesting, we suggest you try and find them yourself).\nHave we mentioned that these SPIDERS… wait for it… HAVE LASER SWORDS?","imageUrl":"https://media.rawg.io/media/screenshots/bee/beea5f46e8243fba43fdfec0504703ff.jpg","releaseYear":2022,"developer":"Neverjam","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":830271,"name":"Sherlock Holmes The Awakened","genre":"Adventure","price":0.0,"description":"Experience a nerve-racking Lovecraftian adventure, rebuilt from the ground up with modern graphics and gameplay. Become Sherlock Holmes, and find yourself at the heart of the terrifying Cthulhu Mythos as you investigate a series of mysterious disappearances in Europe and the US.\nA Lovecraft meets Sherlock Holmes crossover, The Awakened puts you up against the legendary Cthulhu Mythos. Investigate a series of mysterious disappearances, apparently linked to a dark cult that worships an Ancient God. Whatever their plan is, you must put a stop to it… or face unspeakable consequences.\nFor the first time in his life, Sherlock is truly afraid. A man of rationale and reason, he faces an otherworldly entity that defies all logic, and this discovery is as enlightening as it is shattering. The pursuit of the truth pushes Sherlock to the verge of madness, and it’s the only story that Watson will never publish.\nTaking place in 1884, The Awakened lifts the curtain on how Sherlock and John, mere roommates at the time, became the world-famous crime-solving duo.\nKey pillars\nInvestigate the Cthulhu Mythos as imagined by H.P. Lovecraft and face Eldritch horrors beyond human comprehension\nFight encroaching insanity as you pursue answers to questions that have no rational explanation whatsoever\nFind clues that will lead you through the famous Baker Street in London, a haunting psych ward in Switzerland, the perilous Louisiana wetlands and more\nA reimagining of the 2008 title: Rebuilt from the ground up in Unreal Engine, The Awakened boasts modern graphics and animations, an expanded storyline, numerous side quests and new mechanics including unique insanity gameplay.","imageUrl":"https://media.rawg.io/media/games/ced/cede44bc5df6d77540f585f24bc4ecda.jpg","releaseYear":2023,"developer":"Frogwares","libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":826856,"name":"Autonauts vs Piratebots","genre":"Strategy","price":0.0,"description":"Join Our Discord\nAbout the GameGrave news! Piratebots are kidnapping Autonauts and taking over our automated settlements! Only you can remove the invaders, recover your resources and resume control!\nYou are Captain of the Autonauts Defence Force. You receive a distress signal from a nearby planet: a Piratebot invasion! You arrive to find that Piratebots have obliterated the base camp and taken control of the working outposts and industries.\nTo win, you must destroy the Space Pirate Boss - “The Dread Pirate Robot” - whose heavily-defended stronghold lies on the other side of the world. Standing between you and the ultimate showdown are hundreds of scurvy Piratebots commanded by The Dread Pirate Robot’s trusted Boss Mates.\nRescue the innocent. Rebuild the settlement. Reclaim the world.\nFEATURES:Autonauts... Automate!\nAutomate a farming business to earn gold and fund your defence campaign. Use industrious Workerbots, your ingenuity and all the natural resources you can harness to craft the tools and machinery needed to run a bustling settlement while commanding a successful defence campaign to conquer the invading Piratebots.\nCode, Command & Conquer!Build squads of special Defencebots including Warriors, Archers and Knights, then use tactical combat programming to take on swathes of swarthy Piratebots and their Bosses.\nPrepare to repel boarders!\nCreate and command your Defencebot squads to engage in intense Boss battles with the crazy Long Bot Silver, the diabolical Botbeard and the brutal Botbarossa, culminating in a fullscale assault on the Dread Pirate Robot's formidable fortress\nPillaging Piratebot\nMerciless Piratebots raiders regularly storm your growing base to vandalise and pillage. Set up vigilant guard patrols, erect mighty defensive walls and deploy armed towers to stop marauding Piratebots in their tracks.\nCollect new technology from the black-hearted Piratebots to drive them from the land and free your fellow Autonauts!\nYou may have played Autonauts before, but never like this. It’s a whole new game of automation and strategy for novices and veterans alike!\nAutomate to defend! Defend to automate!","imageUrl":"https://media.rawg.io/media/screenshots/e8d/e8d58ee0feea7d7ed38c963065edc87e.jpg","releaseYear":2022,"developer":"Denki","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":559041,"name":"ALTF4","genre":"Action","price":0.0,"description":"ALTF4? The Way You Play Games Is Simple!!Become a somewhat clumsy Knight and overcome Trap!!But the way to get there won't be simple.Will you be able to overcome the various traps and irritating terrains in your way?\nTest your controls!\nSave systems are not supported!!\nIt's full of exciting background music and annoying traps!\nYou feel like you can do better after you die, don't you?\nA variety of traps will continue to drive you to death!\nThink about the thrill of overcoming those traps and clearing the game!\nAfter you clear the game for the first time, try to succeed without dying from beginning to end!","imageUrl":"https://media.rawg.io/media/screenshots/274/274942dd79c286f534ec56fc45c121b8.jpg","releaseYear":2021,"developer":"Autosavegame","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":430311,"name":"Haiku, the Robot","genre":"Action","price":0.0,"description":"Haiku is a little robot who wakes up in an unknown, virus-infected world.\nExplore the depths of a post-apocalyptic world where lifeforms no longer exist and travel through an interconnected world of machinery, weaponized robots, and more.\nDeep dive into the recesses of this large, labyrinthine world in order to learn its secrets. Discover different weapons, items, and abilities that will help you navigate through the depths and defeat the virus infecting all the machines.\nClassic side-scrolling action in the retro pixel art style.Sharp and precise character movement and attack abilities.Hand drawn pixel art brought to life with frame-by-frame animation.Metroidvania. Heavily focused on the exploration and being rewarded for exploring.A vast interconnected world with secrets, enemies, and quirky little robots.\nHi, I'm Mister Morris, an indie game developer. It's always been a dream of mine to make a game, and one day in the summer of 2019 I just decided to do it.\n(Insert Shia Labeouf's \"just do it\" meme here).\nI've already come a long way. I've made multiple mobile games and some game jam games which have helped me learn a tremendous amount about game development, Unity engine, pixel art, and animation. But from the very beginning, I have wanted to make a commercial release around Haiku and his world.","imageUrl":"https://media.rawg.io/media/screenshots/1f0/1f03437c01964351b6d102f7f853c8e9.jpg","releaseYear":2021,"developer":"Mister Morris Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":428315,"name":"West of Dead Beta","genre":"Action","price":0.0,"description":"Add Full Game to Wishlisthttps://store.steampowered.com/app/1016790/\nAbout the GamePurgatory, Wyoming, 1888.\nA place of gun smoke and darkness, sin and damnation, wendigos and witches. A shifting, chaotic world that takes its form from the memories, culture or beliefs of the souls who pass through. When a dead man awakens with only the memory of a figure in black, he sets into motion a chain of events that have truly mythic consequences.\nStep into the boots of the dead man William Mason (voiced by Ron Perlman) and descend into the grim and gritty world of Purgatory in this fast-paced cover shooter which combines the fluidity of twin-stick controls and tactical cover usage. Put your skills to the test - Dodge behind cover as you try to outgun your enemies in the unknown procedurally generated hunting grounds. The Wild West has never been this dark.","imageUrl":"https://media.rawg.io/media/screenshots/c19/c1969d33f9992b1c8b3720ac8f76b6a6.jpg","releaseYear":2020,"developer":"Upstream Arcade","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":427484,"name":"Pretty Neko","genre":"RPG","price":0.0,"description":"Introduction In the game, your goal is to  swap the bricks to restore the pictures. Features   Complete levels quickly   Browse the gallery with one hand   100 achievements TradingCards","imageUrl":"https://media.rawg.io/media/screenshots/2ba/2baa91bfeb45d6923ee78300f6f34195.jpg","releaseYear":2020,"developer":"GirlGame","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":51849,"name":"FeArea","genre":"Action","price":0.0,"description":"FeArea is a non-grinding next generation MOBA where players battle each other using tanks, battle robots, and vehicles. The teams must use the weaponry of the future to achieve victory over their enemies. Both equipment and terrain have to be considered to be successful – every map has its own special features and a well-chosen position can secure victory for even the weakest units.\nJoin huge battles without boring mob farming and enjoy quick upgrades! Turn the beautiful landscapes of faraway planets into charred wastelands!\nEnjoy realistic physics and destructible terrain! Develop your war machine and set it up to fit your style of play!\nKey game features:\n-\tSet in an original sci-fi universe\n-\tThree classes of military equipment – tanks, robots and vehicles with completely different styles of play and battlefield roles\n-\t5x5 team battles without boring minion farming!\n-\tHigh-definition world and equipment graphics based on Unreal Engine 4\n-\tRealistic physics that affect equipment and the reaction of the environment\n-\tAn upgrade system that allows you to adapt each unit to your unique play style\n-\tVisual display of the level of your military equipment – the higher the level, the cooler your war machine looks!\n-\tClassic Team Deathmatch and Control Points game modes, with the option of another way to win by destroying the enemy base\n-\tBattlefield skills that are unique for each class and type of military equipment. Unique skill development for equipment types and specific units\nWar of future scale! And a really awesome and exciting future.\nIt's waiting for you, pilot! FeArea choses only the best! Are you ready?","imageUrl":"https://media.rawg.io/media/screenshots/251/2513c6480dd512d68858c0bfaee557af.jpg","releaseYear":-1,"developer":"MUVGAMES","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50569,"name":"deep space waifu: FLAT JUSTICE","genre":"Action","price":0.0,"description":"This is a stand alone expansion of the original game DEEP SPACE WAIFU.\nFLAT IS JUSTICE!!\nYou are a member of the F.L.A.T.\nFABULOUS LAW APPLICATION TASKFORCE of the METROLOLITAN POLICE.\nIt's up to you save the poor babe-ilicious beauties from the corrupted alien police threat!\nLive the King Bear’s search for JUSTICE, on a quest to recover lost dignity and FIND the PERFECT FLAT WAIFU!\nAll while kicking the alien police butt.\n- ONE HAND MODE !\n- AN ACTUAL PLOT\n- NEW GALLERY MODE\n- 60 PIECES OF CLOTHING TO DESTROY!\n- 40 MILESTONES TO THE PERFECT SCORE!\n- 15 NEW CORRUPTED COP ENEMIES!\n- 12 GIRLS WITH UNIQUE POSES\n- 12 STAGES\n- 10 UNIQUE BOSS FIGHTS\n- 6 POWER UPS!\n- 5 NEW MUSICS!\n- 3 MOTORCYCLES!\n- 1 SNEAKY BEAR!\nHave a nice day OFFICER!","imageUrl":"https://media.rawg.io/media/screenshots/da5/da559f11feddd7d3086a718e7d9d7e78.jpg","releaseYear":2017,"developer":"Neko Climax Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":44800,"name":"Helium Rain","genre":"Action","price":0.0,"description":"Build your fleet, trade, explore and conquer\nHelium Rain is a single-player space simulation that places you at the helm of a spacefaring company. Trade resources, buy ships and stations to fulfill contracts ! Dock at stations to buy and sell you wares or upgrade your ship, upgrade your technology to be more efficient and militarize your fleet to prevent piracy.\nYou will need to master both real-time action and long-term strategy: destroying a freighter has a direct impact on the economy, while declaring war will make your spaceflight environment slightly more hostile...\nA world that feels real\nYour ships have generators, radiators, weapons, engines, cargo bays or life support systems - they all work together. Every thruster on your ship plays a role. Aim for engines to pin down your enemies, or send them spinning around by destroying power stations. Most ships have more than thirty individual parts ! You can customize the most important parts of your ships - your main engines, attitude control thrusters, weapons and hull colors.\nYour competitors are independent factions, companies with the same goal as yours - ruling the system. They will try to undercut you, or even attack you if you become a threat to them. But don't be too quick to destroy them, as war can break the supply of resources you depend on ! Attacking freighters will destroy resources, making them costlier, with the potential to cause an economic crisis.\n12 playable ships with weapon and engine upgrades\nBuild and fly fleets of fighters, bombers, cargos, corvettes or capital ships. Buy new engines and weapons.\nFast-paced combat with a Newtonian flight model, full joystick support\nThere is no speed limit in Helium Rain. You can fly at half a mile a second while aiming backwards. Beware of asteroids.\nRealistic economy model\nTake advantage of an accurate simulation of space trade to be the most competitive company. If diplomacy fails, blockades are in order.\nLocalized damage model for spacecrafts\nAim for critical systems in order to disable ships, kill their crew or capture targets.\nA planetary system to explore\nExplore around 25 sectors orbiting the gas giant Nema and its moons.\nProcedural contracts, world exploration, technology upgrades\nPick contracts and build your empire to become the largest company.","imageUrl":"https://media.rawg.io/media/screenshots/5a9/5a94142a021b076c609d05596c57d5e6.jpg","releaseYear":2017,"developer":"Deimos Games","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":24075,"name":"Shin Megami Tensei IV","genre":"RPG","price":0.0,"description":"The Eastern Kingdom of Mikado is a city of the chosen, sitting on high\nand protected all around by towering walls. Yet its people are at risk\nfrom an ongoing demon threat that the player as a newly appointed\nSamurai is duty-bound to fight against. Throughout the player's journey,\nthey must choose their own path. The choices will affect them, other\nNPCs, and the overall outcome of the story. Decisions the player makes\nthroughout the course of the story will have lasting repercussions, as\nthe fate of the world hangs in the balance.\n\nIn-game content available for purchase using stored account funds.","imageUrl":"https://media.rawg.io/media/screenshots/7ab/7ab2f6174eb5fc86b8f0a1f175118779.jpg","releaseYear":2013,"developer":"Atlus","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"}]},{"id":23410,"name":"Hanako: Honor & Blade","genre":"Action","price":0.0,"description":"Journey Across Feudal Japan, on a symbolic campaign representing a personal trial of life and death of a lost loved one. Experience multiple levels and game modes to bring peace or chaos, in (up to) 24 player online battles.\nChoose Warriors destined to decide the future of Japan: The Kenshi (Swordsman), Naginatashi (Pikeman), Ninja (Assassin) or Ite (Archer). All featuring their own style of combat, movement and weaponry.\nMaster Combat through discovery of different attacks, abilities and combos. Our combat system features multiple offensive stances driven by your movement, defensive techniques (such as the grappling hook) and abilities (ranging from acrobatic combos to multi-enemy sweeps to fire arrows).\nWhat kind of gameplay is this game offering?\nWe plan to offer a multiplayer experience with several modes of gameplay taking familiar elements and expanding them to fit the game's backstory and to introduce fun and engaging new experiences. Combat is based on your movement direction and supplemented by abilities ranging from strong stunning dashes, to multi-hit combos and Master level abilities.\nAny customization for the different character classes?\nWe are planning on adding some customization to the characters & weapons. Like all things this will be determined by effort needed/budget. We will likely add weapon skins before characters since our content team is limited.\nWill the game have any single-player gameplay?\nNo this version won’t have any single player gameplay going on. That does not mean we don’t have plans for any just not for this title. The tutorial is single-player and you can play any map with/against AI.\nAre you planning on bringing the game to other platforms?\nOther systems is something we would like to strive for. If we can do it, what other systems we would go onto are still \"up in the air\" questions. Our first and foremost goal is making this game the best it can be for Steam.\nWhat languages will this game be in?\nWell English first and foremost but we plan to do at least 3-4 others. In fact we put out a survey to collect answers from you as to what language do you play your games in which you can fill out at language.hanakogame.com\nWhere can I get more information about the game?\nWe always welcome feedback/questions. If you post them, we will answer as promptly as possible. Here are just a few ways to get in contact with us\nOfficial Site: playhanako.com\nTwitter: http://twitter.com/playhanako\nTwitch: twitch.tv/hanakogame\nFacebook: facebook.com/playhanako","imageUrl":"https://media.rawg.io/media/screenshots/104/10450bc17d44ce5a95dbc42d72fe9f01.jpg","releaseYear":-1,"developer":"+Mpact Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":23388,"name":"Detective Butler: Maiden Voyage Murder","genre":"Adventure","price":0.0,"description":"Visual novels are story-based games, displaying characters on the screen while playing sounds and music in the background to create an immersive storytelling experience. Although most visual novels include branching paths and choices that affect the outcome of the story, Detective Butler: Maiden Voyage Murder has just one outcome. The only choice is how you choose to solve the mystery.\nIn 1962, a popular cruise ship goes out of business after the accidental deaths of two of its passengers. The ship remains a tourist attraction, until it sets sail again half a century later.\nThe CEO of a wealthy company takes his closest employees and son Gilligan on board for the maiden voyage. Gilligan happens to meet Detective Butler during the cruise, and as the two of them delve deeper into the ship's history, another incident occurs... Will Detective Butler find the culprit before it's too late? And will you be able to solve the mystery before the solution is revealed?Meet the crewThrough the eyes of Gilligan, you'll get to know the members of his father's company, the workers of the cruise ship, and Detective Butler himself.Enjoy the atmosphereHundreds of photo-filtered backgrounds and 29 lively music tracks create the backdrop for a mysterious cruise on the Pacific Ocean.Review your notesDuring the game, your journal will update with any relevant information regarding the suspects and any evidence found.Solve the mystery!Just like any classic fair-play detective story, the case can be solved through careful observation and deduction.","imageUrl":"https://media.rawg.io/media/screenshots/b4c/b4c5de88d5ff6998b7ca742a44c8feed.jpg","releaseYear":2015,"developer":"Goldbar Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":22866,"name":"Ultima IX: Ascension","genre":"Action","price":0.0,"description":"Prepare to embark on the final adventure in Ultima--the best selling role-playing saga of all time that has nurtured generations of gamers. Answer the call and return to Britannia for your last epic quest. As the heroic Avatar, only you can save Lord British and his people from the evil Guardian who has devastated and corrupted the land. Valiant combat, magical prowess, and knowledge of the eight virtues are your weapons against evil in Ultima IX: Ascension.\nThe ninth installment of the Ultima series takes a leap into a vivid, detailed 3D environment that adds a whole new level of interaction to the exploration of the realm. Britannia was always one of the most life-like, well-developed, king-sized virtual lands, but this new perspective makes the experience of “living” in it much more immersive. The combination of a story of epic proportions, solid mechanics--true to the classic cRPG spirit, and that achingly familiar Ultima setting, Ultima IX: Ascension a memorable title that all role-players should experience for themselves.\nAscend to the realm of myth and legend in the final single-player Ultima game!Dive into the rich and extensive fantasy world that is a worthy setting for the extravagant finale of the genre-changing, award-winning Ultima saga!\nWitness the final chapter in the chronicles of Britannia--a story so epic that its script takes hundreds of pages in writing.\nTake up the mantle of the Avatar one last time and free the land of Guardian’s curse using an incredibly vast assortment of weapons, armor, items, and spells.","imageUrl":"https://media.rawg.io/media/screenshots/f94/f946c70f60aa0a9f5cc290798be83b84.jpg","releaseYear":1999,"developer":"Origin Systems","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21353,"name":"Chris Sawyer's Locomotion","genre":"Strategy","price":0.0,"description":"Explore a vast and detailed world and build a Transportation Empire! Lay down tracks, roads, and bridges. Use railroads, trucking lines, buses, airplanes, and ships to outmaneuver ruthless competitors who will try to take business away from you, and see who is the best at meeting the needs of a growing metropolis. Cash in on a world of opportunity moving raw materials, goods, and people efficiently from one destination to another. Rake in huge profits as the years advance from 1900 to 2000 and beyond. Experience different world variations, difficulty levels, and complete goals of different scenarios. Run the world your way!","imageUrl":"https://media.rawg.io/media/screenshots/bab/bab1a41aea4d07e1c636e79596582f7c.jpg","releaseYear":2004,"developer":"Chris Sawyer","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":19015,"name":"Let's Explore the Jungle (Junior Field Trips)","genre":"Casual","price":0.0,"description":"No place on Earth is more mysterious or exciting than a jungle. Explore the dim interior of an Amazon cave. Dive into a river and take a swim with a hippo. View the inner workings of an underground ant nest. With Let's Explore the Jungle, children become involved and intrigued from the very first scene.\nSpellbound and entranced, the only limitation to your child's involvement with Let's Explore the Jungle is their own endless curiosity and imagination. Travel through over 30 jungle places. Explore 215 detailed jungle descriptions. Interact with as endless array of click-points- see for yourself what happens when they click on the orchid-mantis, the flying fox, or the orangutan. Your child is in control.\nJunior Field Trips turn kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to visit The Jungle again and again. It's a place where curiosity and knowledge are the keys to fun and adventure.\nLet your child begin a fascinating and educational journey to the jungles of the world.\nBuzzy the Knowledge Bug is your guide to fun.\nYou're in control from the very beginning, with Buzzy the Knowledge Bug along for the ride. This trusty blue companion appears at the click of a button, telling jokes, pointing out interesting facts, and talking about more than 200 plants and animals.\nIt's three jungles in one!\nDiscover the plants and animals of the world's three major jungles: Africa, Amazon and Asia. From the depths of a river to jungle canopy high above, hundreds of entertaining click-points are waiting to be discovered.\nInformation is just a click away.\n215 Detailed descriptions of jungle plants and animals are available at the click of a button. Learn where chocolate comes from, why the giant anteater walks on its knuckles, or how the flying snake flies.\nLearning is more than an adventure- it's great games too!\nGo on a jungle scavenger hunt, improve your spelling, paint jungle pictures, or test your knowledge of jungle lore. Multiple difficulty levels make the games challenging and fun for everyone.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/617/6175b8cdde69c99e45b5e471ad4e9154.jpg","releaseYear":2015,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18691,"name":"RFLEX","genre":"Action","price":0.0,"description":"RFLEX is a fast-paced and challenging neo-arcade game. Frantically dodge your way to the high score in a series of rage-inducing levels while enjoying a kickass, original soundtrack. Experience trippy visuals while being pulled into a never-ending abyss of addicting, non-stop action.\n5 insanely challenging levels\nEons of addicting gameplay\nSimplistic, trippy neo-arcade aesthetic\nRapid electronic soundtrack by Valiant (AKA Adhenoid), RollingFacade, and ForeverBound\nObsessive global / friend leaderboards\nFull joystick support\nGeometrically accurate inter-polygonal warfare\nRealistic drunk mode\nAnd much much more.Follow @_wessles_ on Twitter.\nFor those with photosensitive epilepsy, an epileptic friendly mode has been added. If you are not satisfied with this option, and are unable to play this game, you are entitled to a refund.","imageUrl":"https://media.rawg.io/media/screenshots/4a5/4a530a4e9e72d021c542160284e5598c.jpg","releaseYear":2015,"developer":"Wesley LaFerriere","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":18552,"name":"Sound Shift","genre":"Action","price":0.0,"description":"Sound Shift is a VJ style music visualiser mixed with a simple arcade shooter.\nShoot targets to earn credits which can be spent to unlock new videos and FX.\nMusic is streamed directly from your computer's audio output, so you can use sound from any source including on-line streaming services.","imageUrl":"https://media.rawg.io/media/screenshots/f06/f067f9faffaee1571d1e2cb619e54ad5.jpg","releaseYear":2015,"developer":"Matthew Brown","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":18394,"name":"1 Moment Of Time: Silentville","genre":"Adventure","price":0.0,"description":"Our latest gameshttp://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other adventures:http://store.steampowered.com/app/431260/\nhttp://store.steampowered.com/app/347430/\nhttp://store.steampowered.com/app/326190\nTry other adventures:http://store.steampowered.com/app/326180\nhttp://store.steampowered.com/app/396790\nAbout the Game\nSilentville was a small, undistinguished town. But most of all, it was silent. Nothing special ever happened there, until...\nOne sunny summer day, when, as usual, nothing unusual was happening, a very unusual storm came out of nowhere...\nIt's the kind of thing you don't quickly forget. Rumbling thunder, lightening... at times it appeared that the heavens themselves had fallen to the ground.\nFrom that moment on, the people in Silentville started disappearing - one by one. Even the visitors suddenly disappeared without a trace.\nAirplanes and birds, trains and pedestrians, drivers, tourists and even bicyclers - all of them have vanished!\nThis is the story of Silentville - a town with no future, no past and no present. A town lost to forever - unless someone can solve the mystery and release Silentville from its cursed non-existence.\nBut should that someone fail, they will be trapped in Silentville... forever!\nP.S.\nFor all players we'll offer a bunch of adorable collection of collectible items - 10 trading cards, 10 backgrounds and 10 amazing emoticons!","imageUrl":"https://media.rawg.io/media/screenshots/85e/85e1c346e7cb08ba397063171324bd27.jpg","releaseYear":2016,"developer":"2 Monkeys","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17784,"name":"Hunters Of The Dead","genre":"Strategy","price":0.0,"description":"“Hunters of the Dead” is a survival/roguelike tower defense game with some micro management elements. You have to rescue your fellow Hunters and with their help locate and destroy Dracula. Dracula has raised an army of undead and has taken the whole city. You must defend your base while in the meantime you have to explore the buildings around and salvage what you can. However, better stay close to your base because as you get further and further you will be finding harder and more frequent battles.\nYou can send your hunters to get healed in the hospitals or trained in the graveyards, but you won’t be able to use them in the battle. That means that you will have fewer units to defend your base in case a battle occurs! So you should manage your Hunters with caution. In case your base gets destroyed, you shouldn’t be discouraged. You will be able to use what resources you have acquired to make upgrades and restart stronger.\nHappy Hunting!\nFeatures:\n•\tPermadeath\n•\tRandomly generated city, quests, weapons, hunters…. Pretty much everything\n•\tDozens of different quests\n•\t16 upgrades\n•\t2 unlockable difficulty levels\n•\tBattle and map micromanagement of your Hunters\n•\t5 hunter classes","imageUrl":"https://media.rawg.io/media/screenshots/61e/61e2c756db63afcf83a10b69e91a05c0.jpg","releaseYear":2014,"developer":"Traptics","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17133,"name":"Pretty Girls Mahjong Solitaire","genre":"Casual","price":0.0,"description":"Watch Pretty Girls go wild in the all-new “Mahjong Solitaire”\nClear the tiles to reveal Pretty Girls in sexy costumes!\nDo you have what it takes to clear all the tiles for your Pretty Girl surprise?!\n■ Classic Mahjong Solitaire rules\nFind pairs of tiles to delete them.\nDelete all tiles before time runs out to clear a round.\nThink strategically when deleting tiles, or you might run into a dead end!\nOver 50 patterns of tiles.\nThe tiles get shuffled every time you play, making it fun to play again and again.\n■ Pretty Girls are waiting for you to come play!\nFive characters appear in this game.\nOnce you make it to the third round, a girl in a sexy costume begins to reveal herself as you delete tiles...\nAs you clear stages, the girls get sexier and sexier!\nAll characters have recorded voices!\n■ Character Introductions\n• Rin Nakajo\nA classic, old fashion-type girl who’s got a talent for sword fighting. She’s also a rich little princess.\n• Risa Amemiya\nShe can come across as a bit stand-offish, but she secretly enjoys cosplay.\n• Erina Kuwashima\nA kind-hearted teacher with a charitable spirit. She’s also in charge of the swimming club.\n• Ayame Kirishima\nA tomboy with a strong sense of justice. But she’s actually quite shy.\n• Kanon Matsuura\nA young and famous pop star. A little spoiled and likes to do things her own way.\n※This is a puzzle game with sexy characters (no nudity). Characters and character images used under license from their respective owners.","imageUrl":"https://media.rawg.io/media/screenshots/556/556d8ff972c2ed85caa85005396fabcb.jpg","releaseYear":2015,"developer":"Zoo","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15783,"name":"Sunset's Ashes","genre":"Casual","price":0.0,"description":"Experience the short story of Alex and Nic as they share memories with each other while climbing a mountain together for the first time. For years, Alex has been going for climbs, and trying to get Nic to join. Outdoor trips for her always meant renting a live-in recreational vehicle, but she’s leaving her comfort zone and do this one climb. It’s a chance for them to remember their lives together and know why this climb is so important.\nIt features multiple scenes as they climb through different parts of the mountain to reach the summit. There will be an option to travel up a certain path during the experience, which provide different story elements between the characters.","imageUrl":"https://media.rawg.io/media/screenshots/7af/7afd47b1d68d16eae64d99230c301b68.jpg","releaseYear":2016,"developer":"Fifth One","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]