[{"id":10879,"name":"Ultimate Chicken Horse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c6/7c6d6a357059121a3c672a795e432374.jpg","description":"Ever wish you were a wall-jumping, arrow-dodging, trap-setting horse, besting your animal pals in a race through a peril-laden obstacle course that you all built together?\nWish Granted!\nUltimate Chicken Horse is a party platformer where you and your friends build the level as you play, placing deadly traps before trying to reach the end of the level. If you can make it but your friends can't, you get a point! Play online or locally with your animal buddies and experiment with a wide variety of platforms in all sorts of strange locations to find new ways to mess with your friends.Key FeaturesOnline and local play\nUnique game flow, from strategic block placement to twitch control platforming\n10 levels with different features (for now)\nSave and share what you build\nHuge library of blocks to create an infinite variety of levels\nPlay as a chicken, horse, sheep, and other wonderful animals\nFun, cartoony art style\nSweet funky soundtrack\nPlease note: there is no \"single-player\" version of this game. There is online multiplayer, where you can join random lobbies with friends or strangers, so you can still enjoy the game alone! We have also added \"Free-play\" mode, which allows you to play by yourself, but is only useful for building levels and attempting to run through them.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"NVIDIA Lightspeed Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":43855,"name":"Argo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2e/a2ecf055ac9339d3a58808842c44a9b7.jpg","description":"Argo (formerly known as Project Argo) is a free-to-play multiplayer conversion of a military simulator ArmA 3 and was developed by Bohemia Interactive Studio.\n\n###Setting\nThe game takes place on a fictional island of Malden where the players fight over a crash-landed satellite.\nMalden is a 62 square kilometer island and is a new iteration upon Bohemia Interactive classic map design. The island features both urban environments and wide open plains.\n\n###Gameplay\nAs far as the gameplay goes, Argo does not differ much from the base ArmA 3 as it is just a toned down version of the game. Two teams of PMCs oppose each other in the featured game modes. \n\nThe game features several game modes. Both PVP and PVE modes are available in the game. Apart from that, Argo allows the players to create their own game scenarios using the ArmA 3 scenario editor which has been severely watered down.\n\nThree competitive game modes are present in the game: Clash, Link, and Raid. In Clash, two teams fight over territory control. In a round of Link, your objective will be to capture several control points before your enemy breaks the link between the points. And last, but not least, Raid where one team sets out to find a data terminal which can be spawned at one of three locations, while the other team has to defend it.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bohemia Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":4420,"name":"Closure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/405/40567fe45e6074a5b2bfbd4a3fea7809.jpg","description":"This game is both a puzzle and a platformer. The plot and the gameplay are based on the game with light.\nThe player plays like a little man, who is in almost total darkness. A spot of light snatches from the darkness a small part, in which the little man can move. The space for movement is limited by a spot of light, but sometimes outside of this spot or on the border of light and darkness it is possible to move quite freely - for example, even to pass through walls or fall through floors / ceilings. Sometimes it is not enough to be in a spot of light or in darkness for movement. The path is sometimes blocked by various obstacles, or this path simply needs to be found, it is necessary to understand how and where you can move - the goal of the game is to find the final exit.\n\nAmong the puzzles are the search for various keys and ways to apply these keys, finding and moving light sources and other things. The game assumes that sooner or later the player will master the relationship with the light and will be able to use this understanding to achieve the ultimate goal.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Eyebrow Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":1036,"name":"The Jackbox Party Pack 3","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/137/137544a823a3b16a226878a9e5506c0c.jpg","description":"The threequel to the party game phenomenon features FIVE new sense-shattering games!Quiplash 2 (3-8 players)The say-anything sequel. Play all new questions or make your own!Trivia Murder Party (1-8 players)A deadly quiz show where you match wits with a trivia-obsessed killer.Guesspionage (2-8 players)The brain-battering data-mining guessing game.Tee K.O. (3-8 players)The t-shirt slugfest where you battle your custom t-shirts to the death!Fakin’ It (3-6 players)One of your friends has something to hide in this sneaky game for tricksters.\nPlay using your phones, tablets, or computers. No extra controllers needed!\nAll games support up to 10,000 audience members playing along!\nPlus tons of NEW features just for streamers! It’s a digital box full of actual fun!\nNOTE: The Jackbox Party Pack 3 is in English only.\nNOTE: This game is local multiplayer, but can be enjoyed over streams with remote players.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":59925,"name":"11-11 Memories Retold","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/411/4113ab8e04810de3243b512e3eed32cb.jpg","description":"11th November 1916, a young photographer leaves Canada to join the western front in Europe.\r\nThe same day, a German technician is told that his son is missing in action.\r\nBoth want to preserve their humanity and come back alive to their loved ones.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":597,"name":"Edge","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/601/60141c5480a9ccec225c16d5ff5216e6.jpg","description":"Edge is an isometric puzzle platformer. You control a cube and need to lead it through levels to the goal, collecting light prisms and trying not to fall off the map. You see the map from the isometric perspective, and the cube moves diagonally. There are 45 main and 3 unlockable levels in the game. \n\nThe key feature of the gameplay is the ability of the cube to balance at the certain angle. You need this to complete the most difficult parts of the route. When rolling is not enough, you can climb a moving block to overcome an obstacle or perform any other maneuver. However, these tricks are not easy to master.\n\nHowever, Edge challenges your reflexes more than your ability to solve puzzles. The game usually gives direct hints about where to go and what to do to pass the level but it’s quite difficult to perform this safely. Problems can appear only with collecting all the prisms as they can be hidden. In general, the entire game is created in simple polygonal style so nothing distracts you from completing levels.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Two Tribes","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PSP"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"}]},{"id":275611,"name":"Samorost","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ba/2ba37c3516b73e4b67bb3c1a69bb6478.jpg","description":"Explore the beginnings of the Samorost series in the space gnome’s original bite-sized adventure, formerly released in 2003. Now with remastered sounds, enhanced graphics, and new music by Floex.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Amanita Design","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Web"}]},{"id":50165,"name":"Neverwinter Nights: Enhanced Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2fd/2fd22c97f779363102e7a5d8e4306ebf.jpg","description":"Neverwinter Nights: Enhanced Edition adds all-new enhanced features to the content of Neverwinter Nights Diamond Edition.\nSlink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarven paladin... whatever hero you create, incredible adventures await.\nDiscover magic, wonder, and danger at every turn on your own or with friends in these classic Dungeons & Dragons adventures.Enhanced Features:Improved Display: Your portrait, combat bar, inventory, and other UI elements adjust in size based on your chosen resolution including 1080p and 4k.\nAdvanced Graphics Options: Pixel shaders and post-processing effects make for crisper, cleaner visuals. Enable contrast, vibrance, and depth of field options as preferred.\nCommunity Endorsed: Original developers have teamed with key members of the Neverwinter Nights community to curate important fan-requested improvements to support players, storytellers, and modders.\nBackwards Compatibility: Works with save games, modules, and mods from the original Neverwinter Nights. A galaxy of community created content awaits.All the content of Neverwinter Nights Diamond Edition:The original Neverwinter Nights campaign: Find yourself at the center of intrigue, betrayal, and dark magic in Neverwinter Nights. Journey through dangerous cities, monster filled dungeons and deep into uncharted wilderness in search of the cure for a cursed plague ravaging the city of Neverwinter.\nTwo expansion packs:\nShadows of Undrentide: Another adventure begins in Shadows of Undrentide! Charged by your master to recover four ancient artifacts, travel from the Silver Marches to unravel mysteries of a long-dead magical civilization.\nHordes of the Underdark: Continue the adventure started in Shadows of Undrentide and journey into the ever-more bizarre and hostile depths of Undermountain to challenge a gathering evil.Three premium modules:\nDiscover over 40 hours of new stories, then go on to sample the hundreds of modules created by community members just like you.\nKingmaker\nShadowGuard\nWitch’s Wake The Aurora Toolset: Build your own world full of unique monsters, items, traps, encounters, and settings, then share your creation with the rest of the Neverwinter Nights community. (Windows only)\nDungeon Master Client: Become the storyteller! Control monsters, creatures, and characters your players will meet over the course of an adventure.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BioWare","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":46410,"name":"Wandersong","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2de/2deb8efe0d2e79a29c2c71f2c19de382.jpg","description":"A musical adventure where you use singing to save the world! Play as a silly bard who embarks on a globe-trotting journey to learn about the mysterious Earthsong, said to be able to prevent the universe’s imminent end. Along the way there’s a huge cast of characters to meet, puzzles to solve and songs to sing!\nIn Wandersong you're a walking musical instrument, and you use song to interact with everything. Different things respond to your music in different ways, so it's up to you to sing your songs, unlock the world's secrets and make new friends!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Humble Bundle","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":420977,"name":"DOOM 64 (2020)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fa/0fa9e2b8397b332902d3b56c73888d52.jpg","description":"DOOM 64, originally released on the Nintendo 64 in 1997, is now available for the first time on PC.\nFight against demons in your crusade to hunt down the Mother of Demons and stop Hell's invasion. As you battle through more than 30 action-packed levels, be on the lookout for enhanced weapons and secrets to help you put an end to the demonic threat.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"id Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":52790,"name":"Castlevania: Symphony of the Night","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/45d/45da4dc311d84b79230317d7b24a3dec.jpg","description":"Castlevania: Symphony of the Night is a platform-adventure action role-playing game developed and published by Konami in 1997 for the PlayStation. It was directed and produced by Toru Hagihara, with Koji Igarashi acting as assistant director. It is the direct sequel to Castlevania: Rondo of Blood taking place four years later. It features Dracula's dhampir son Alucard as the protagonist rising from his slumber to explore the Dracula's castle which has re-appeared after Richter Belmont has vanished. It marks a break from previous games in the series, introducing exploration, non-linear level design and role-playing elements.\nInitially, the game was unsuccessful – particularly in the United States where it was meagerly publicized – but thanks to praise by critics, it gained sales through word-of-mouth and became a hit. It has been re-released on several consoles and is considered a sleeper hit, a cult classic, and one of the best video games ever made.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"}]},{"id":4469,"name":"Jak and Daxter: The Precursor Legacy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c17/c17f265300a6adca4cde82562829cd92.jpg","description":"The game that started Jak and Daxter series is a mixture of 3D platforming and puzzles delivered in a cartoonish visual style.\n\n###Setting\nJak and Daxter’s world is a distant fantasy planet. It is dominated by the ruins and technologies of an ancient civilization, the Precursors. This civilization also created eco, a type of energy that comes in different colors and can be used to various effects. There’s the dark eco that can distort life, and its Dark Sage, Gol Acheron, is going to unleash it on the world. He sent his servants, the Lurkers, to gather eco for him.\n\n###Plot\nThe player assumes the role of Jak, a mute yet troublemaking teenage boy. His best friend is a boy called Daxter. When the two explored the forbidden ruins, the Lurkers attacked them. Daxter came under the influence of dark eco and mutated into a mixture of otter and weasel he calls “ottsel.” He can still talk, however, and will comment on Jak’s actions throughout the game. Jak learns that only Gol Acheron can bring Daxter back to normal. The boy, accompanied by Daxter on his shoulder, sets out on a dangerous journey to save his friend and the world.\n\n###Gameplay\nMuch of the gameplay is centered around collecting items and resources. On each level, Jak has to obtain power cells to activate Precursors’ machines and advance to the next area. Other collectibles, such as eco particles, improve the protagonist’s attacks, health, or speed. Jak’s attacks are mostly hand-to-hand, but yellow eco allows him to shoot bolts.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Naughty Dog","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 2"}]},{"id":3656,"name":"GRID Autosport","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/973/973b8b5538d064a73f0c3b745827254c.jpg","description":"Grid Autosport is a racing game with a variety of in-game maps. It is the ninth part of the TOCA series,  which follow a wide assortment of motorsports with a center on touring racing.\n\n###Gameplay\nThe Autosport's gameplay resembles natural playground for all titles of its kind — the player is coursing between the different championships in which they can race the other AI-controlled enemies or participate in online events. \n\n###Plot\nDifferent from many projects of its sort, Grid Autosport resembles some narrative — the player follows into the footsteps of a racing professional with the different opportunities to express themselves. One may take the career ladder to get various rewards throughout the multiplayer, practice in the split\\screen mode with a friend or proceed into the usual course of actions in the racing game — the singleplayer mode. \n\n###Key features\nThe emphasis in the game is given to the realistic collisions display. One may customize their vehicle in five parameters each corresponding to the different characteristics and choose out of four classes of cars to play with. \n\n###Special edition\nThere are two versions of the game: standard and special edition. The only latter's difference is Mercedes Benz SLS AMG vehicle added.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"}]},{"id":9499,"name":"Pressure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e74/e743e4663ca848a2e3078e48760acb09.jpg","description":"The game is a classic example of arcade racing shoot-em-up with a top-down camera. It tries to mimic Japanese bullet-hell games with a more casual approach. The player takes control of the buggy and joins La Resistance to prevent the Count Soap crimes and the use of stolen water. The buggy can be customized to your taste, using more than 35 upgrades.\n\nLike the plot, the gameplay in Pressure is designed primarily for kids. This is indicated by the casual complexity, an abundance of bright colors and a specific sense of humor. Add here a variety of weapons, upgrades, and enemies; the output will be an excellent timekiller for a couple of evenings. The game features several levels of difficulty, achievements and the ability to go through a story campaign from more than 30 cards together with a friend using the capabilities of a split-screen local coop. All results are published online.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Chasing Carrots","platforms":[{"id":0,"name":"PC"}]},{"id":933,"name":"The Sexy Brutale","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74e/74eea1248bb2a1ef3e229bf363d82d8f.jpg","description":"The Sexy Brutale is a puzzle-adventure game with investigation elements.  \n\n###Plot \nThe game takes place in a luxurious mansion called The Sexy Brutale where a big masquerade party occurs. The story follows Lafcadio Boone — a preacher who becomes a witness of the series of mysterious murders and finds out that the mansion is stuck in a 12 hours long time loop.\nA mysterious woman appears and gives Boone an ability to pull himself out of this anomaly by manipulating the time inside with magical pocket watch. Now Lafcadio must save his friends from the death and identify the killer.\n  \n###Gameplay \nThe game is divided into several 12-hour periods. In each of them, your goal is to save one of the guests from the murderer. You explore the mansion, discover its secrets and learn about the partygoers. Because of your abilities to avoid the effects of the time loop, you have to sneak behind the guests without being seen. The gameplay heavily focuses on the puzzle-solving. To save the partygoers, you usually have to investigate the murder set, decide which objects you can manipulate to prevent the crime, rewind the time and execute your plan without being noticed. With every character saved, Boone gets new powers that improve his skills such as lockpicking or hearing. The game has a secret ending that you can unlock by collecting all of the 52 hidden cards.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tequila Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":449164,"name":"Townscaper","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ae3/ae336267c9dfa6732f66619b375ce0af.jpg","description":"Build quaint island towns with curvy streets. Build small hamlets, soaring cathedrals, canal networks, or sky cities on stils. Block by block.\n\nNo goal. No real gameplay. Just plenty of building and plenty of beauty. That's it.\n\nTownscaper is an experimental passion project. More of a toy than a game. Pick colors from the palette, plop down colored blocks of house on the irregular grid, and watch Townscaper's underlying algorithm automatically turn those blocks into cute little houses, arches, stairways, bridges and lush backyards, depending on their configuration.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Raw Fury","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":44093,"name":"Diablo III: Eternal Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1e7/1e788787a5f0708b47cf5c7193816383.jpg","description":"Return to the mortal realms with deadly new powers of blood, bone and essence.  The Rise of the Necromancer pack unearths a trove of new content, including the Necromancer hero class and two additional character slots.  Plus, it grants Necromancer-themed content for all your characters, including Wings of the Crypt Guardian, a Half-Formed Golem pet, a portrait frame, a banner shape and sigil, and a pennant.\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-4 players\nNetwork Players 2-4\n26GB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nDiablo® III: Eternal Collection™  © 2017 Blizzard Entertainment, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Desconocido","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":17337,"name":"Contagion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9f2/9f2aedaacf7b754a09185d83f4ad8385.jpg","description":"Contagion is an MMO horror game about surviving in a zombie apocalypse. It was inspired by Zombie Panic! Source (2007). \n\n###Zombies\nThe game's portrayal of zombies was borrowed from John Romero's The Living Dead film series. This kind of zombies is faster, smarter, and very aggressive. They are easily attracted by the loud sounds, which makes use of firearms dangerous. The game also includes melee weapons for silent kills, but they are weaker. \n\nA unique feature in Contagion is that the dead players respawn not as humans but as an even stronger and faster type of a zombie. They join the other side and can help the AI-controlled undead.\n\n###Game modes\nThere are three main modes in Contagion and an additional Flatline mode. Hunted mode is competitive and pits the players against not only zombies but also each other in a classic deathmatch. The last survivor wins the game. This mode allows up to 16 players to participate.\n\nThe other two modes are cooperative and are only that allow the single-player walkthrough. Escape mode requires the players to survive together as a team of up to eight players. They enter a level and try to complete a series of quests while fighting off an AI-controlled zombie horde. Their main objective is to escape the level alive. Extraction is a stronghold-type mode. It tasks the players with searching the human NPCs on a map and protecting them from a wave of the undead.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Monochrome","platforms":[{"id":0,"name":"PC"}]},{"id":5868,"name":"Five Nights at Freddy's","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bdc/bdcb4e528bdd91bc4b3ab75fedb31f7b.jpg","description":"Welcome to your new summer job at Freddy Fazbear's Pizza, where kids and parents alike come for entertainment and food as far as the eye can see! The main attraction is Freddy Fazbear, of course; and his two friends. They are animatronic robots, programmed to please the crowds! The robots' behavior has become somewhat unpredictable at night however, and it was much cheaper to hire you as a security guard than to find a repairman.\nFrom your small office you must watch the security cameras carefully. You have a very limited amount of electricity that you're allowed to use per night (corporate budget cuts, you know). That means when you run out of power for the night- no more security doors and no more lights! If something isn't right- namely if Freddybear or his friends aren't in their proper places, you must find them on the monitors and protect yourself if needed!\nCan you survive five nights at Freddy's?\n\"For all the simplicity of the game’s controls and premise, Five Nights at Freddy‘s is frightening. It’s a fantastic example of how cleverness in design and subtlety can be used to make an experience terrifying. Simple still images and proper character design steal the show in this game, and show that Scott Cawthon knows quite a lot about the secret fears people feel when looking at creepy dolls and toys. It’s elegant in how it sows fear, and is a must-own for anyone who likes scary games.\" -Joel Couture IndieGameMag.com\nThis game was created using Clickteam Fusion!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Scott Cawthon","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":17022,"name":"Revenge of the Titans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ca3/ca31ca841afd79e9af9eeea0592b0e2f.jpg","description":"Revenge of the Titans is a sequel to Titan Attacks!\nIn the previous game, aliens who arrived from Titan on huge spacecraft to destroy us, were successfully stopped. But they flew again - to avenge the defeat. This time they prepared a full-scale landing on the surface of the planet. We have nothing left but to play the invisible commander of all the forces of mankind, to throw out the enemies and destroy them not only on our land, but also on their own planet Titan.\n\nLike its predecessor, the game is built around the same principle - the defense of the \"tower\", the command center. The goal of each level is to protect the command center from destruction. The Titans are trying to destroy the tower. And they do it for several dozen missions, the action of which unfolds on many planets.\nFor defense, you can take a variety of actions. You can fight with various weapons, you can build buildings for various purposes, use the technologies that are to be opened. For all this, resources are needed, they must be extracted and their consumption calculated. Enemies are diverse, in addition to ordinary \"aliens\" there are super-powerful bosses - to win they have to invent special strategies.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Puppygames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":58084,"name":"DRAGON QUEST XI: Echoes of an Elusive Age","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e04/e041cc430f6b6681477580d3bcddf29f.jpg","description":"DRAGON QUEST® XI: Echoes of an Elusive Age™ follows the journey of a hunted Hero who must uncover the mystery of his fate with the aid of a charismatic cast of supporting characters. They embark on a quest taking them across continents and over vast oceans as they learn of an ominous threat facing the world.\r\nDQ XI brings a massive, gorgeous world to life in a style that blends stylistic cel-shading with photorealistic detail.\r\nEngage in a turn-based battle system that eases players into combat, featuring mechanics simple enough for novices but with enough depth to satisfy long-time fans.\r\nDQ XI features tons of side-quests and mini-games, providing enough content to keep you playing for well over 100 hours.\r\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\r\n© 2017, 2018 ARMOR PROJECT/BIRD STUDIO/SQUARE ENIX All Rights Reserved. ©SUGIYAMA KOBO ⓅSUGIYAMA KOBO\r\nDRAGON QUEST, ECHOES OF AN ELUSIVE AGE, SQUARE ENIX and the SQUARE ENIX logo are trademarks or registered trademarks of Square Enix Holdings Co., Ltd.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo 3DS"}]},{"id":3882,"name":"God of War: Ascension","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c13/c13815d4923dc9778ff959985ad4dd43.jpg","description":"This prequel to the very first game in the God of War series and the seventh game in the franchise. It is exclusive for the Sony PlayStation 3 console. The game still uses the ancient Greek mythology as visual inspiration and the primary story source.\n\nThe player takes control over the warrior Kratos. At the beginning of the game, the protagonist was imprisoned after he violated the blood oath given to the god of war Ares. One of the three goddesses of revenge Megera tortures Kratos, but he manages to break free and start the path to revenge on the gods of Olympus.\n\nKratos still uses the dual Blade of Chaos. They can be improved, but this is not the only weapon in the game: other weapons are available for purchase thanks to the new World Weapons mechanics. The gameplay is no different from the other games of the series: the player still needs to connect the attacks in combos and arrange hack and slash mayhem. This is the only game in the series, in which multiplayer is available for eight people: the main task is to seize control of the card and get a reward from the gods.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":11112,"name":"Double Action: Boogaloo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a2/9a2f6de94df289b7bb446af002540818.jpg","description":"Double Action: Boogaloo is a comedic free-to-play multiplayer shooter developed by Double Action Factory.\n\n###Gameplay\nThe game features a sophisticated movement system that allows for diving, flipping, and sliding. The game is heavily inspired by the classic action flicks, such as The Matrix, and movies by John Woo.\n\nDouble Action is a third-person shooter which revolves around fast-paced combat and fluid movement, which can be found in Max Payne. Influenced by Max Payne, the game features the bullet time system which slows down the in-game passage of time that helps the players land much more precise shots. \n\nThe objective in the match of the game is to become the most stylish player with the highest number of style points. The style points are awarded for killing enemies while diving, doing flips, attempting slides and attempting such tricks. Slow-motion seconds are also awarded for stylish gameplay.\n\nThe game does not feature objective-driven matches, yet from time to time a special objective may be activated, such as Capture the Briefcase, Kill the Wanted One, Race to the Finish. Should a player complete the special objective, they are allowed to execute a special style move that acts as all the style moves combined. That adds a whole another layer to the gameplay.\n\nThere are nine weapons present in the game: two pistols, several SMGs, a shotgun, two rifles, your own fists, and a grenade. The pistols can be dual-wielded.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Double Action Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13834,"name":"Epistory - Typing Chronicles","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/007/00769c75b7c44b5974d20204a27e9293.jpg","description":"Epistory - Typing Chronicles is an action-adventure with a heavy focus on a typing mechanics. This is the only game within the IP.\n\n###Gameplay\nEvery action in the game is tied with the typing words on the keyboard. Thus, the game cannot be ported onto consoles. Unlike the games similar to this genre, Typing Chronicles utilize every adventure-game mechanics to be adapted to typing words.\nFor example, enemies may not die from one hit, so there are several words above their heads. The meaning of the written information often corresponds to the situation on the screen.\nApart from battles, the protagonist may solve puzzles and explore the world. \nThe gameplay is the main attraction of the game — however, it turned its back on the players when it comes to the replayability. The title is monotonous with no gameplay sections without having to type the words.\n\n###Story\nThe plot tells a story of a poet who sent his muse into the world of unfinished tales to seek for ideas to the next story. The text of the ultimate masterpiece unravels, as Muse proceeds through the levels on her three-tailed fox, changing the environment around her. Somewhere in-between the levels, the semantic idea of interconnecting the meaning with the object faints a little, but the ending is set to explain this minor inconvenience.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17093,"name":"Chroma Squad","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/104/104603a5c863d6fa6be4d4bb1fed6db6.jpeg","description":"Chroma Squad is a tactical role-playing video game. The game is influenced by tokusatsu TV shows, particularly the Super Sentai and Power Rangers.\n\n###Tokusatsu\nThe genre of tokusatsu TV shows is briefly defined as “a fantastic movie with special effects about superheroes”. It originated in the 50s and exists primarily in the form of serials, rather than individual films.\n\nThe tokusatsu genre is characterized by a story about one or more heroes endowed with superpowers - technological or magical.\n\nA hero or heroes use their forces, ordinary and unusual, to battle with various evil forces — aliens, terrorists, monsters from the depths of the ocean, demons, and so on.\n\nBattles with enemies are abundantly present on the screen, filled with numerous special effects.\n\n###Plot\nThe game has a team of stunt actors who have ceased to like their work and they decide to create their own company that will shoot TV shows in the genre of tokusatsu.\n\n###Gameplay\nWhen the company is founded, the player must find the actors and conclude contracts with them. For each actor a separate contract is drawn up with special conditions, in accordance with their roles in the team.\n\nThe action in the game develops from episode to episode, each episode of the game corresponds to one episode of the series, which the company produces. And in the episodes of the series, the heroes fight with the villains, sometimes other characters adjoin the villains.\n\nThe series is shown on TV. He collects a certain audience, gaining (or not gaining) rating. Receipts in the company depend on these indicators. Money is needed for the company to maintain and develop activities.\n\nThe episodes are grouped into seasons, and if the company for one reason or another fails to finish the season, the game ends.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":17004,"name":"Woodle Tree Adventures","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a4/1a48ea96c60737594422c75e7c3af3a2.jpg","description":"The hero of this game is a small tree that can independently travel, walk and jump, carry useful things in its backpack and do various useful things. The main purpose of his travels and research is to find the tears of fairies. These tears can quench the thirst of the whole world, bring harmony and balance. Travel and search is at different levels. There are six levels. Each level offers several platforms and objects. The player can meet different magical creatures - and they will have to fight! The player has a weapon - he can swing his magic leaf.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14000,"name":"Penumbra: Black Plague Gold Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66c/66cd2b671d923769b61a8bf11fe0af05.jpg","description":"Penumbra: Black Plague Gold Edition is a survival horror puzzle game developed by Frictional Games. It is a bundle of the second and the third games of the series.\n\n###Plot\nThe game begins with Phillip sending out an e-mail to his friend begging to end the thing he started. All the events after that scene are Philips flashbacks.\n\nAfter the ending scene of the first game, where Philip got knocked out by an unknown man, he awakes in a locked room which he escapes through a vent. It is revealed that the mines that led the main character to where he is now are just a cover-up for a secret research base stationed in Greenland. The complex is deserted, all of its employees are dead or turned into mutants. Philips has to find a way out.\n\n###Gameplay\nThe gameplay has not changed since the first game. Black Plague is still a first-person survival horror, yet it puts more focus on the horror aspect of the game. Most of the quests present in the game were cut down and replaced by the item search puzzles. \n\nThere is no combat system present in the game. The players have to either run away from their enemies or stick to the shadows. It is impossible to stop the enemies, as they can break down doors. Throwing crates at the enemies does not help much, as they are only distracted by that for a few seconds. \n\n###Gold Edition features\nThe only feature of the Gold Edition is the addition of the third Penumbra game, Requiem.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Frictional Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":12893,"name":"Hard West","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/296/2965907923a45648d265b98a4fdf5942.jpg","description":"Collector's EditionThe Digital Collector’s Edition of Hard West comes with a comprehensive Digital Artbook, Original Digital Comic Book, and Full Original Digital Soundtrack which was mastered and composed by Marcin Przybylowicz (The Witcher 3: Wild Hunt).\nAbout the GameWelcome to the Wild West like you’ve never seen it before. When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those who wronged him. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive in a world full of hard choices and even harder consequences. Because in this world, death is a constant presence and the black pacts which you make with forces beyond human comprehension will forever haunt all those around you.\nFight and survive through 8 unique story-based scenarios, and try your hand at 40 individually designed turn-based combat missions. Journey deeper into the world of Hard West and meet a colorful cast of playable characters whose fates are intimately intertwined with yours. Together you will need to make divisive choices to uncover the ultimate plans of the ancient powers at play, as you unravel a deep narrative storyline featuring multiple endings depending on the choices you make during the game.Game Features\nA Unique “Weird” West World: Explore a world where Western legends meet demons, arcane rituals and satanic cults and where the dead can walk the Earth again. For a price.\nCompelling Turn-based Combat: Control 1-4 squad members in thrilling turn-based combat encounters and master a range of powerful western-inspired special abilities, from feats of gunslinging to survivability against all odds, to take out your opponents in a series of original tactical maps with unique story-based objectives.\nCollect and Combine Special Abilities: Obtain new special abilities by collecting and equipping unique cards which are earned throughout the game by completing main- and optional objectives, exploration , bartering, treasure hunting and more. These cards can be combined to create even more powerful combos, and provide additional options in combat.\nChoice and Fate: Experience a deep story where decisions made during and between combat scenarios will resonate through future events and change the ultimate fates of a divisive group of colorful characters\nLuck of the Draw: Use a combat system that goes far beyond pure probability by featuring luck as a unique guardian of engaging and challenging combat\nDynamic Cover: Change the flow of combat thanks to an extensive cover system which allows for the creation of effective cover from objects in the environment, making flanking and maneuvering during battles a truly powerful tactic\nShadow Spotting: Exploit the Blazing western sun to Locate out of sight enemies by the shadows that they cast, along with the sounds they make\nRicochets: Utilize Metal objects to allow master gunslingers to shoot beyond the line of sight for increased tactical combat options, and diversified planning\n40 Historically Inspired Weapons: Equip and employ an eclectic collection of deadly shotguns, rifles, pistols and sniper rifles, all based upon real outlandish prototypes, designs and ideas from the era","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Good Shepherd Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":302369,"name":"Neon Abyss","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/977/97759451a8b0fcb16ac9357c24140008.jpg","description":"Neon Abyss is a frantic roguelike action platformer features unlimited item synergies and unique dungeon evolving system. Each of your raids diversifies the dungeon experience and every choice you make alters the ruleset of the dungeon. You will die a lot in this game, and every time you die, you're just a step closer to your ultimate goal: to find the cure for your immortal curse.\nBattle your way through an underworld eternally in flux, crush the new gods of bitcoin and nightclubs, combine your loot to achieve awesome power, and find the cure for your immortal curse. During your journey, you will gain powerful items, find adorable pets, meet strange passers-by, and discover countless secrets.\nThere is a unique and expandable underworld. You can choose a personalized upgrade path to expand your dungeon and unlock new rooms, bosses, items, special rules, and new endings. Each of your adventures will expand the content of the dungeon, and every choice you make will change the rules of the game.\nWe love builds! Passive effects between items will stack and affect each other, and there is no limit to the number of effects you can apply to your character. No one knows what will happen, or what you’ll create.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -Massive Content (with continuous updates)Dynamically generated maps, over 400 items, dozens of monsters with different styles, and countless secrets ensure that every adventure is completely fresh.Egg Hatching & EvolvingAs you descend into the abyss, you’ll find eggs you can take care of which will hatch into a random pet. Each pet has a special ability and most can evolve as you play.Mini-GamesThere are many unique rooms in the dungeon, each one with new mechanics and rules. Take part in Piano Performances, Dance Competitions, Fight Clubs, and much more.Multiple Playable CharactersThere will be multiple unique characters with different abilities for players to choose from.Costume ChangesAll the items will change your character’s appearance! Some are cool, some are ridiculous, and when put together, you’ll look hilarious… and be hilariously powerful.Neon GodsThe God of Power. Gods of Bitcoin and Video. Today’s obsessions are transformed into new gods, and you are the one who dares to challenge their rule.Incredible SoundtrackAward-winning composer Min He, whose past credits include Princess Eun Hwa, Rift, and How to Get Away with Murder, has composed a dark-style electronic soundtrack to fit a war waged against Neo-Gods.The BarAfter each death, you will wake up in the Day’s End, where you can have a couple of drinks, listen to music for a while, and plan your next assault on the underworld.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Veewo Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":51081,"name":"Beholder 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/05e/05e938bd5870afa289ced252d3103a1b.jpg","description":"Every citizen of our great State dreams of working at the Prime Ministry!\nYou are lucky, intern – your dream has come true!\nWhile you are at the bottom of the career ladder, that is more than many of your fellow citizens will ever achieve!\nHave you already decided what you're going to become?\nWill you become a diligent and responsible officer decorated by the Wise Leader himself? Or will you become a hardline careerist capable of destroying anyone who stands between you and the Prime Minister's seat? Or maybe you are just a whistle-blower? If so, who sent you? And why?\nWhatever the case, you are now part of the Ministry!\nFrom this moment on, no one beyond these walls has ascendance over you! You are free to shape your own future!\nSo, what are you going to become?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17949,"name":"Dead Rising 2: Off the Record","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f55/f55ccd12602be8643a3510498f1e32ed.jpg","description":"Dead Rising 2: Off the Record - the third game in the line of games started by the game Dead Rising and continued by Dead Rising 2.\n\nThe action of all three games (and there is the fourth one - Dead Rising 3) takes place within the same line of events.\n\n###First photo shoot with zombies\nIn the first game photojournalist Frank West, arrives in the town of Willamet, Colorado, to investigate why this town was closed by the authorities. Frank enters the city by helicopter, the helicopter pilot is told to return to Frank in 72 hours. Frank quickly finds himself in a shopping center, where a crowd of people are trying to hide from the zombies - as it turns out, it was zombies that caused the closure of the city.\n\nOver the next 72 hours (this time is one of the strict conditions of the game), Frank must survive, save a few people and understand where the zombies came from. Along the way, he fights with zombies, seeks solutions, makes weapons and takes photographs - he is still a photojournalist. For successful shots, he gets more experience, which is appreciated in the game.\n\n###Wheelchair with machine guns\nThe second game \"forgets\" about Frank, it features a motorcyclist Chuck Green, who arrives in Willamet after all has settled down. There is a drug against turning into a zombie now, it is expensive, but effective. However, the new invasion of the zombie is still happening, Chuck drives around the town on a wheelchair with a pair of rifles, shooting hordes of zombies and simultaneously showing a touching concern for his daughter, who is somewhere nearby and needs a cure for zombification.\n\n###Zombies give a second chance\nThe third game \"resurrects\" Frank, who after success in the first game managed to fall to the bottom of life. In search of a new chance to succeed, Frank returns to Willameth, who seems to have been cleared of zombies twice, but Frank is very lucky - zombies capture the city for the third time. This time there are more enemies, among them many new ones. There are also more types of weapons - those that you need to do yourself from improvised means. Frank will visit places in the city that he did not suspect. Especially impressive will be a visit to the amusement park - \"Uranus Zone\".","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Capcom U.S.A","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"}]},{"id":14983,"name":"Napoleon: Total War","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0e7/0e7ed2d1f5666fbb7083a7f554d5376b.jpg","description":"Napoleon: Total War is a turn-based strategy game with real-time tactic elements.\n\n###Plot and setting\nThe game takes place in early 19 century, during the conquests of Napoleon Bonaparte. There are four playable campaigns, wherein two, the player can choose between different countries of interest, and lead their troops in the Wars of Coalition, and the other two smaller campaigns focus on Napoleon’s earlier conquests. Each campaign has a set of missions to accomplish, with different objectives and varying difficulty.\n\n###Gameplay\nAs with other games of Total War series, there are two main game modes, the geopolitical turn-based mode, where the player has to build up his cities, recruit armies and plan their conquests, and the battle mode, where the player can manually command his troops to outplay the enemy in tactics. There are many variables in combat, as units may take attrition, can have lower morale according to the current situation on the battlefield, and so on.\n\n###Graphics and other features\nThe game features a multiplayer mode, where players take control of the different countries from the period, and face against each other, engage in diplomacy, forge unlikely alliances, and many more. The engine of the game redefines battles, as the physics have improved, leaving a great impact on how the game looks. Cannon strikes leave craters, guns fire in unison; troops fall from a successful flanking, everything in battle now has a certain feel, as if you are really on the field.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Feral Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20958,"name":"Street Racing Syndicate","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/002/002c8c5f9eb52d936bbc02f4c943a8c0.jpeg","description":"Street Racing Syndicate is a game about underground street racing. The player's goal is not only to win races, but also to become famous and attract girls.\n\n###Modes\nStreet Racing Syndicate offers a variety of modes. Street Mode is the traditional career option. The player starts as a newcomer who was hired by a sponsor to win a race. Victories grant the player money to purchase better cars. There are also Roll Up Races, in which a random car challenges the player to a race. Another type of races is Respect Challenges, in which the player has to earn respect to attract women. There's a multiplayer mode that only allows two players.\n\n###Cars\nWhen not at a race, the player can navigate through a city map to visit important places. Among them is Garage that stores the player's cars, Warehouse that allows buying spare parts, and Showroom, where the player can obtain new vehicles. Street Racing Syndicate includes 50 cars from the famous manufacturers such as Mitsubishi, Subaru, and Volkswagen. There are many options for upgrading and customizing cars. The player can buy a regular ride and make it unique.\n\n###Style\nThe game features a distinct \"neon\" aesthetics. Most races are set in the seaside US regions like Florida and California, and often take place at night, in the background of a big city. Controversially, the game also includes strip girls. Respect Challenges reward the player with a sexy woman to accompany him or her and perform go-go dances.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Eutechnyx","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":20828,"name":"Serious Sam Double D XXL","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81b/81b39cfee9f2e49f81d4edd7969e075c.jpg","description":"One of the spin-offs of the famous series of games about Serious Sam in the genre of 2D side scroll shooter. This is one of the games released by an independent studio and timed to the release of the big Serious Sam 3: BFE. Version XXL game. Two years after the original release in 2011 as XXL version of the game was released as a free patch for all the owners of the original game.\n\nThe game takes place in the same universe as all other games. The developers have tried to recreate as accurately as possible the original gameplay, which is Serious Sam famous for. And this is an enormous mob of monsters, attacking the protagonist from all sides. At levels, the player can find first-aid kits, weapons, and ammo. The game's arsenal includes both guns that were already in the game universe and entirely new weapons. Each can be upgraded, and new upgrades significantly simplify the completion of the game.\n\nStructurally, the game is divided into three episodes. At the end of each player faces a boss. Sometimes the game process is diluted by simple puzzles. One of the distinctive features of the game is the Gunstacker mechanic, which allows you to attach different types of weapons to each other to increase the lethal power. In addition to a single story campaign, the game has a local cooperative for two players.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Mommy's Best Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":16972,"name":"200% Mixed Juice!","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b4/1b47e2036af844b37876e0f75e2a0cc7.jpg","description":"Special Offer\nAll owners of 200% Mixed Juice! will unlock a free bonus character in 100% Orange Juice on Steam.\nAbout the Game200% Mixed Juice! is the 10th Anniversary game of OrangeJuice, an old school RPG featuring a 200% mix of OrangeJuice characters.\nAt certain points in time and space, many fun worlds exist. Each world was created by a smart little fairy named Navi for the sake of the sleeping princess with nothing to do.\nA world where you're able to experience a lively school life.\nA world where you can see the skies crowded with airplanes.\nA world that has fallen to ruin from endless wars...\nIt's time for the sleeping princess to wake up and start her adventures in those worlds.Features:Over 80 characters to do battle with\nCutting-edge graphics to amaze your friends and neighbors with\nA stunning digital soundtrack\nOnline multiplayer","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Orange_Juice","platforms":[{"id":0,"name":"PC"}]},{"id":3594,"name":"Danganronpa 2: Goodbye Despair","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a6c/a6cd31267a20a615d35f618e766208fc.jpg","description":"Jabberwock Island – once a popular tourist destination, this now uninhabited island remains oddly pristine. You and your classmates at the elite Hope's Peak Academy have been brought to this island by your super-cute teacher for a “lovey-dovey, heart-throbbing school trip.” Everyone seems to be having fun in the sun...until Monokuma returns to restart his murderous game! Trapped on this island of mutual killing, your only hope of escape rests in solving the island’s mysteries. But be warned—sometimes the truth can be its own despair...\nKey Features\nDeadly Island Vibes: Murder is the only means of escape when you’re trapped on this island paradise. As your fellow classmates start dropping like coconuts, you’ll need to delve into each murderous incident, forage for clues, and interview your classmates to reveal the opportunity, motive, and means behind each killer case!\nTribal Council: You’ll go head-to-head in all new minigames with the other students during the Class Trial, shooting down their false truths and using your evidence to uncover what really happened. But watch out! If a student is unconvinced, they'll challenge you to a one-on-one Rebuttal Showdown and force you to defend your argument!\nSurvival of the Keenest: Match up your evidence with your fellow classmates’ arguments and determine who’s really telling the truth. Once you’ve got a suspect in your sights, turn up that tropical heat in a variety of timing and reflex-based game systems to reveal the ultimate truth and escape with your life!\nSteam Features: Supports Steam Achievements and Steam Cloud with plans to add Steam Trading Cards","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Abstraction Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":545033,"name":"Resident Evil Re:Verse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d8d/d8dd3610968f15a78816494ecef9c562.jpg","description":"A fight to the death that all Resident Evil fans can enjoy!\n\nIn Resident Evil Re:Verse you can test your skills against other players in four to six-person deathmatch battles. Play as beloved characters from the Resident Evil series and turn the tides of battle with powerful bioweapons.\nTake part in 5-minute Deathmatches, where the player with the most points wins! Use the weapons and items you find to take down even more powerful enemies!\n\nTurn the Tides with Bioweapon's Revenge!\n\nWhen your character is taken out, their body transforms into a powerful bioweapon which can be used against other players. Pick up multiple Virus Capsules to transform into even stronger bioweapons. Getting revenge with a bioweapon is also a great chance for more points!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":457729,"name":"Crash Bandicoot 4: It’s About Time","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/54a/54a14917b3298bbaacdf9873c3af7229.jpg","description":"Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco are here to save the day by reuniting the Four Quantum masks and bending the rules of reality.\r\n\r\nNew abilities? Check. More playable characters? Yep. Alternate dimensions? Obviously. Ridonkulous bosses? For sure. Same awesome sauce? You bet your sweet jorts. Wait, are they actually jorts? Not in this universe!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Beenox","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":21126,"name":"The Basement Collection","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a90/a90962a8dc8079954a197045b224bd39.jpg","description":"The Basement Collection is a compilation of flash titles by game designer Edmund McMillen. The games are different in their genres and settings. Especially for the compilation the games were upgraded.\n\nThe main collection features seven games: Triachnid, a spider simulator with realistic physics; Coil; Meat Boy, a predecessor to Super Meat Boy, another McMillen’s project; Aether, a space adventure game, Grey-Matter; Spewer and Time Fcuk. Completing these games you will unlock six more titles: The Lonely Hermit, AVGM, Meat Boy map pack, The Box, Thicker Than Water and The Cheats. Four additional games can be found under steamapps/common/basement/moregames.\n\nIn fact, The Basement Collection is the compilation of McMillen’s early works that show his unconventional mind and creativity. Many ideas and experiments held with these titles got their continuation in McMillen’s most successful works: Super Meat Boy and The Binding of Isaac.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Edmund McMillen","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19530,"name":"Tesla Effect: A Tex Murphy Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e31/e315a1a1fbdc0035e8a7f390eee52539.jpg","description":"Tesla Effect: A Tex Murphy Adventure is a detective game with a high amount of attention given to plot unraveling. It is the 6th game in the corresponding series: with the five titles preceding it and one succeeding in late 2018. \nThe game very much resembles the tradition of point-and-click adventures. One of the core narrative features is a 3D realistic background and live captured videos instead of usual cutscenes. All of the games within a series feature the self-titled protagonist with a setting in 2050. Tesla Effect uncovers the story of a Chelsee Bando disappearance. The first part of the title cues the players into realizing the role of Nicola Tesla in the narrative.\nIt is little to invent in the point-and-click genre, but the development of Tesla Effect: A Tex Murphy Adventure is presumably cut into two parts: actual cutscene and backgrounds filming and composing it all into the game content. The game features 5 endings and branching paths within the characters' arcs. The choices within those arcs influence the ending outcome.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Big Finish Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]