[{"id":491003,"name":"Mini Motor Racing X","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/487/48738846b7b745a9b626199c9b75ffca.jpg","description":"Welcome to the world of Mini Motor Racing X! Strap yourself in, or strap on your VR headset, and jump into a nitro fuelled world where little cars mean BIG fun! Spanning across reclaimed ruins and scorched outbacks through to rain soaked docks and sunkissed tropical islands - Mini Motor Racing X will take you on a micro driving journey across the globe like no other.\nTackle the massive career mode as you upgrade and fine-tune your garage of vehicles through four unique championships spanning the diverse landscapes offered throughout. Take the journey solo or complete the entire campaign with a friend via local couch co-op or online.\nFeeling more like a quick blast with more friends or some online randos? Tackle any of the 52 tracks in up to 4 player online races. Or, if you’re feeling extra frisky, try any of the multiplayer party modes on offer such as Bumper Ball or Micro Motor Racing!\nFEATURES:\nHUGE CAREER: Collect dozens of cars and race on over 50 tracks in hundreds of races with vibrant, rich visuals, day and night and in varying weather conditions.\nUPGRADE YOUR RIDES: Pump your hard earned winnings into upgrades to help give you the edge.\nPLAY IN FLATSCREEN OR VR WITH CROSS PLAY: Full support for VR and non-VR gameplay with multiplayer cross play between them as well as several other platforms.\nRE-IMAGINED FOR VR: Play the entire game in VR as MMRX has been re-designed and tuned for VR to bring the full game experience to life in new dimensions and with additional play modes.\nMULTIPLAYER: Online multiplayer with up to 4 friends for campaign co-op or competitive racing.\nSPLIT-SCREEN ACTION: Play couch co-op split-screen with up to four people or take them on in any number of competitive races.\nPARTIES ARE BETTER WITH FRIENDS: Take on friends online in several party mode games designed to bring out the worst in you.\nULTRAWIDE SUPPORT: Featuring support for 4K and Ultra-wide resolutions.\nPlease note that Steam users whom purchased 'Mini Motor Racing Evo' will receive 'Mini Motor Racing X' for free on their Steam account.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"The Binary Mill","platforms":[{"id":0,"name":"PC"}]},{"id":372593,"name":"Soda Dungeon 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d4/7d451c7589ae2677923fd8806d1fc0c3.jpg","description":"Your favorite fizzy dungeon crawler is back! The Dark Lord has locked all sorts of legendary items, loot, and goodies up in his castle behind a seemingly endless guard of monsters, traps, and treachery. Daunting? Not for you— You’ll be safe in the tavern hiring Soda Junkies to do the dirty work for you. Take the loot they bring back to upgrade your tavern, town, and armory to attract stronger adventurers, then repeat. Build your town, assemble a mighty team, and see if you can make it through the dungeon to the next dimension and beyond.\nAlong the way your band of merry, soda-fueled minions will encounter trumpeting skeletons, angry chefs, Dark Lords, Darker Lords, and a fairy that is just really, really trying her best. The only thing they won’t find is timers, lives systems, or a paywall. Everything can be bought with in-game currency because that’s just the Soda Dungeon way.\nCustom AI Patterns! - Sick of dumb-as-rocks NPC allies? We are too. Create custom behaviors for you party using Soda Script! Even when you're not looking over their shoulders they're doing exactly what you want.\nCraft Gear - Craft new armor and weapons for the adventurers you hire. Find rare materials deep within the Dark Lord's castle to make all new items.\nPlay While AFK - Have a life outside Soda Dungeon? No problem. Earn Battle Credits while you’re away and redeem them for loot when you come back. Even when you're not playing, you're gathering resources!\nBuild Your Home Base - Assembling the best party will take more than a tavern this time around. Build a blacksmith forge, a wizard’s shop, an arena, and more to unlock your party’s true potential.\nAlways More To Do - We heard you. You wanted more mountains to climb. You wanted more goals to accomplish. You... wanted to help people clear rodents from their property ¯\\_(ツ)_/¯ Lucky you, because the NPCs in Soda Dungeon 2 are ready to cough up strangely valuable rewards in exchange for completing an assortment of side-quests!\nIf you find yourself asking 'What's a Soda Dungeon' This is the section for you!\nSoda Dungeon is a turn-based dungeon crawler where you recruit a team of adventurers to raid dungeons on your behalf. With the loot they find you’ll build up your town, attract better heroes, and find out just how deep the dungeon-hole goes.\nExperiment with Confidence - Mix and match classes, try out loads of gear, and send them off to fight. But fear not, everyone comes home safe with all your hard-earned loot. Defeat is just part of the game :)\nFree and Fair - Everything can be earned with in-game currency. No loot boxes. But if you want to level up a little faster, we may have some special upgrades for you to peruse.\nCross-Platform Play - Play on your mobile phone, tablet, or Steam and take your save file with you wherever you feel like playing. We’re told it’s in “the cloud”.\nOptional Auto-Combat - Feeling lazy? We get that. Set up your party, flip on the auto-combat and let the spoils of battle roll in. You deserve a break.\nANProductions is a one man studio that has been developing games of all types for over a decade. Poxpower would like it known that he too has been developing games for a long time, possibly even 11 years.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Armor Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":38298,"name":"Tom Clancy's H.A.W.X.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3fb/3fb75e17d466ccb5f14aa6f49d24feb2.jpg","description":"Tom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations become increasingly dependent on private military companies (PMCs), elite mercenaries with a lax view of the law. The Reykjavik Accords further legitimize their existence by authorizing their right to serve in every aspect of military operations. While the benefits of such PMCs are apparent, growing concerns surrounding giving them too much power begin to mount. The Enhanced Reality System is the backbone of the HAWX flight experience: radars and incoming missile detection, anti-crash system, damage control system, tactical map and information relay, and weapons trajectory control. E.R.S. also allows players to issue orders to their squadron, making this system as iconic to HAWX as the Cross-Com system is to Tom Clancy's Ghost Recon Advanced Warfighter. Players can ease into their flight missions and gain a level of comfort with the use of the assistance mode. Once employed, players can take full advantage of their technological support through the E.R.S and gain maximum piloting security. If the situation calls for the player to unleash the full potential of the aircraft, the assistance mode can be switched off and all safety features will be deactivated. For the first time ever in the air-combat genre, players can experience the entire solo campaign in four-player JUMP IN co-op mode. In PVP mode, players can challenge up to 15 friends in intense dogfighting sessions and find out who's the top gun. Winning players are rewarded with experience points and money to unlock more weapons. Players have the opportunity to take the throttle of over 50 of the world's most famous aircrafts, as well as being able to dogfight over realistic modern landscapes that have endured years of post-war trauma.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":30231,"name":"Haegemonia: Legions of Iron [I]","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7f6/7f673789d953ee7572eca538f43015f8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Anuman Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":20927,"name":"Ultimate Tic-Tac-Toe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f61/f6189cf4dd3a2cc987f0e7f604e2122e.jpg","description":"Ultimate Tic-Tac-Toe takes the classic game of Tic-Tac-Toe and adds a strategic layer to it.Description\nEach square of the 3x3 game board contains another, smaller, 3x3 game board.\nWhere you make your move in a square of any small board, you send the opponent in the respective square of the big board.\n3 in a row in a small board wins the small board and the big square.\n3 small boards in a row wins the game.\nStrategize your play, plan your next move, let the opponent win some small boards, while you win the game!\nOn the Forget game subtype, each 4th move of the same player in a board will erase his oldest move.FeaturesClassic and ultimate tic-tac-toe games.\nEach of the classic and ultimate types can also be played in Forget mode.\nSingle-player.\nHot-seat, a multiplayer mode from the same PC.\nMultiplayer, through LAN or Steam.\n3 levels of difficulty.\nRankings: play with users closer to your skill level.\nLeaderboards.\nAchievements.GameplayWhen the game starts, the player with the X piece will move first, and can place his piece wherever he wants. To let the opponent (AI or friend) place the first piece, you can choose to play with O. Placing the first piece will not give the player such a big advantage as in the classic tic-tac-toe game, he still needs to create a strategy in order to defeat you.\nNext, your opponent will have to play the board respective to the square that you've just filled.\nYour next move will be in a board that your opponent sends you to, given by the square that he just made his move on.\nWhat happens if the opponent sends you to an already won or draw board? Then you can go wherever you like, but be sure not to send your opponent to a closed board, because he would have the same advantage.\nAfter playing a little, you will see that, even though you could win a small board easily, the fact that if the move you make would put your opponent at an advantage, you could chose to not win that board at the time, or perhaps forfeit it, if it will give you an advantage to complete other 3 boards in a row and win the match.\nA draw board will not count for either X, nor O.\nYou can also play on the Forget mode, which erases your 4th oldest game piece, thus having another strategic element which you must focus on, and there won't be any boards that end-up in ties.\nWhen playing against the AI, you have 3 choices of difficulty:\nEasy: The AI tries to send you to boards where it's most difficult for you to make a move, even though he could win others.\nMedium: The AI will always try to win small boards.\nHard: The AI will win small boards, if it doesn't give you an advantage on the next move; it tries to create a balance between winning and not giving you the upper hand. It also has a random element to it, so it provides more diversified plays overtime.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Shere Khan","platforms":[{"id":0,"name":"PC"}]},{"id":19435,"name":"Oknytt","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4db/4dbd4922839246a1c1dd4e951db70fba.jpg","description":"Oknytt is a point-and-click adventure game where the player takes the role of a small, seemingly insignificant creature, leading it through a dark world riddled with obstacles to help it find a place to belong. The game takes place in a Norse medieval world and contains a number of beings and areas inspired by Swedish folklore.\nOknytt's gameplay is comprised of classic point-and-click puzzle solving combined with the usage of four runes located at the bottom of the screen. These runes can be activated at any time to trigger various changes and events in the area around the protagonist. Each rune has a specific element tied to it which have different areas of use depending on what can currently be seen in the environment.\nFiguring out what the runes can be used for and how to utilise their affect on the environment together with the items at your disposal is key to you being able to progress through the game world.\nFeatures\nManipulate the environment around you using elemental forces\nA unique art style inspired by the famous Swedish painter John Bauer\nExperience and collect lore about creatures and monsters from Scandinavian folklore\nFully voiced by the talented Brian Hall\n6-7 hours of puzzle solving","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nemoria Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":18600,"name":"Theatre of War 2: Africa 1943","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d8/5d8e6330c71c79e32a19a33faafda2fb.jpg","description":"Theatre of War 2: Africa 1943 covers the events of 1943 in Tunisia, North Africa. Recovering from their losses after the crushing defeat and subsequent retreat after the Second Battle of El-Alamein, the German Afrika Korps - reinforced and now supported by the Italian Army - prepare once more to put steel against steel with the Allies. The Axis forces, under the command of the legendary General Erwin Rommel, have an all too brief opportunity to seize victory from the clutches of their earlier failures. Players will lead Rommel’s Afrika Korps in their last full-scale military campaign and command the English and American armies as they try to push the Axis forces out of Africa once and for all.\nHouse to house urban combat\nAnimated hand-to-hand fighting\nAnti-air vehicles and stationary anti-aircraft mounts to control\nSmoke screens\nDifferent types of trenches, sand bags, road blocks and barbed wire emplacements are now available (to defending units only) and can be placed by the player before the battle starts\nAdvanced unit formations control\nImproved soldier A.I. (e.g. soldiers will independently search for cover and share heavy weapons ammo)\nImproved complex infantry damage system\nNew advanced visual spotting system accounts for observation angles and smoke screens\nOnline Game Server Browser\nImproved visuals and sound, with new soldier and vehicle models, new sounds and music, and all new explosion effects and animations.\n15 missions in three campaigns – German, American and British - including famous battles such as Kasserine Pass, Sidi Bou Zid, Sbeitla and Tebessa.\nMission Editor to create your own scenarios\nInteractive Tactical Battle Map\nOver 50 different vehicle types\nOver 30 new unique buildings","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"1C Company","platforms":[{"id":0,"name":"PC"}]},{"id":12258,"name":"Ys VIII: Lacrimosa of DANA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3c/d3c42a40030d2c80aa37824914026052.jpg","description":"Ys returns with a brand new adventure for the first time in 8 years! Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island. Amidst this, Adol begins to dream of a mysterious blue-haired maiden living in an unknown world. Join Adol as he unravels the riddle of the cursed isle and the blue-haired maiden Dana in Ys VIII: Lacrimosa of Dana!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":20287,"name":"Victory: The Age of Racing","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5a/e5a44af04fda6df981f09fdd351e01d4.jpg","description":"Victory: The Age of Racing is a unique online racing game with spectacular car handling and user generated cars inspired by the different ages of racing. Victory offers a thrilling racing experience through multiplayer events, competitions and an addictive team career.\nVictory: The Age of Racing is now FREE!\nWe’d like you to join the competition and prepare yourself for Racecraft the new Procedural Sandbox Racing Experience by Vae Victis Games.\nRacecraft is 25% off this week for the Steam Summer Sale, so GET ON BOARD NOW!\n*** WINDOWS 10 USERS *** please read this thread on our Technical Assistance forum if you get the error message “d3d9.dll is missing” trying to run Victory on Windows:\nhttp://steamcommunity.com/app/264120/discussions/3/451851477889583591/ (accessible only to Victory owners).\nYou can be a ruthless driver by pushing your car beyond the limits, a talented designer by creating unique cars and a highly skilled technical director by improving your car settings tweaking it for maximum performances. Join the competition and race to win!\nAn Internet connection is required to play Victory: The Age of Racing.\nBuy the Victory Deluxe Pack for exclusive contents!Victory Deluxe Pack\nThe Deluxe Pack gives you a handful of Gears Credits and three exclusive cars you can use on ordinary tracks and all events. This pack includes:\n3 exclusive Special Deluxe Racing Cars (super fast 60PI cars: 1 Legend car, 1 Classic car and 1 Formula car)\n15000 Gears Credits (you can speed up your multiplayer career or create several racing cars from scratch)\nVictory is a fully featured multiplayer online racing game you can enjoy in multiple ways.\nIn Victory: The Age of Racing, cars can be USER GENERATED: players have an unprecedented degree of freedom in choosing car blocks, parts, colors, decals and shapes for their own customized car. We also created the block system, where you can switch different parts of your racing car until you have reached your favorite design.\nYou can control your car choosing between gamepad, keyboard and steering wheel.\nKeyboard controls with assisted steering\nFull gamepad compatibility with force feedback support\nFull steering wheel compatibility with force feedback support\nMouse controls (move the mouse to steer, left/right click to throttle and brake)\nWe've also worked hard to create the best keyboard controls available on the market for a racing game. An integrated artificial intelligence helps you steering, braking and throttling, with a simulation of analog controls even when you're using the keyboard.\nVictory is an arcade racer with realistic physics specifically tuned to give an unprecedented car handling and an addictive racing experience. We started with a top-notch car physics engine developed in collaboration with Stefano Casillo, the author of the acclaimed racing simulator, Assetto Corsa and then we added improved assisted driving systems, so you can experience the game as you wish, enabling or disabling driving aids whenever you like to.\nPvP competitions with multiple game modes and multiplayer live events for inactive players.\nEvents, championships, daily races, different game modes. Everything is created in real time based on the status of connected players: a central server checks who is online and what he is doing, then creates live events which pop up on your main screen.\nIn Victory you can be active and choose what you want to do or just wait for the game to propose you new ways to race online and have fun.Game Modes\nHotlap (single player mode)\nHotlap Party (multiplayer hot lap mode, up to 100 players, usually lasts 1 hour)\nHotlap Championship (multiplayer hot lap mode, can last for days, with online rankings in real time)\nQuick Race (multiplayer race)\nHandicap Race (multiplayer race, the winner gets an handicap for the following race)\nLAN mode supported: create a LAN Party and race with your friends!Race Zones & Tracks\n3 different racing zones around the world\n15 different racing tracks\nCar attributes and setups, different engines, tires, accessories and more: this is your personal customized car!\nLike in a role playing game, you have to spend Performance Points to reach the perfect combination for your driving style and racing conditions. You can have multiple cars in the game and customize them for different game modes or tracks!\nChoose from different teams and start your racing career. Each of the three car classes in the game has a dedicated World Championship where different racing teams are looking for the best driver: are you ready to put the pedal to the metal and wear the colors of your team on the track?\nEach team will offer you different racing cars and you will have to unlock multiplayer achievements to progress in the team career, unlock other new cars and reach the top of the rankings.\nAchievement system with rewards (money, widgets, driver titles) and over 300 different achievements to unlock\nFully integrated website with real time rankings and statistics of almost everything in game: check your rankings, different stats, every single car created in the game can be shared and voted!\nIntegrated Social Bar with race chat, race log, \"last played with\" panel, public chat, race invites, integrated friend system, online status settings and more!\n7 different game cameras: choose your favorite one when playing","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vae Victis Games","platforms":[{"id":0,"name":"PC"}]},{"id":302,"name":"Ninja Pizza Girl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe3/fe356c2c94aa4a7bab58b635014dae08.jpg","description":"Ninja Pizza Girl is a serious game about self-esteem, bullying and resilience – and pizza delivering ninjas!\nIts deeply-woven story follows Gemma, a sixteen-year-old girl working as a pizza delivery ninja for her father’s independent Pizzeria. In a world where slums teeter on top of skyscrapers, where powerful mega-corporations exploit the poor and where quality pizza is hard to come by, Gemma must fight to keep her ideals, her family and their business intact in face of the most merciless enemies known to any teenage girl – other teenagers.\n\"Deftly tackling bullying, self awareness and self acceptance, not to mention the challenge of keeping a pizza hot, Ninja Pizza Girl is a beautiful and important game.\" - Rhianna Pratchett\n\"Ninja Pizza Girl is a beautifully presented, challenging-but-not-brutal platformer that delivers not only pizza, but important messages about self-worth and bullying. Any young people in your lives—and you!—need this game!\" - Karin Weekes\nAccessible flow-based gameplay that welcomes beginners while challenging speedrunners.Face enemies that shove, trip, throw garbage in your hair and upload videos of their abuse.Unique \"health\" system that tracks the player's self-esteem A mind-melting original soundtrack by the amazing Max Maars who was featured on Triple J's \"Unearthed\"The only videogame to feature the phrase \"No Pants. No Pizza.\"\nNinja Pizza Girl. For Honour. For Family. For Pizza.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Disparity Games Pty","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":962137,"name":"Jusant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6fc/6fcd3a3192df9abeb281f6e936fc1b80.jpg","description":"Enjoy meditative vibes in Jusant, an action-puzzle climbing game. Scale an immeasurably tall tower and ascend to new heights alongside your watery companion. Master your climbing tools, find your way up through diverse biomes, and piece together the tower’s past.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"DONTNOD Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":302822,"name":"Creature in the Well","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/403/403a11d0d0f716d774a88d66df466dbc.jpg","description":"Unlock the power of an ancient facility and face the ominous, all-seeing Creature in this unique pinball-inspired hack & slash! Creature in the Well is a top down pinball inspired hack and slash dungeon crawler. As the last remaining BOT-C unit, venture deep into a desert mountain to restore power to an ancient facility, haunted by a desperate Creature. Uncover and upgrade powerful gear in order to save the city of Mirage from a deadly sandstorm.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Flight School Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":41607,"name":"Farming Simulator 2013","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/543/543e6c13569e47b8d31a291a80b07df2.jpg","description":"Welcome to the largest and most exciting farming simulator ever made!\nFarming Simulator will challenge you to take on the role of a modern day farmer. Animal husbandry, crops, sales… It's up to you to manage and grow your own farm in two huge environments: typical European and American environments.\nProgress in your career to complete different missions and control more than a hundred farming vehicles!\n1 player\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n© 2013 GIANTS Software GmbH. Published and distributed by Focus Home Interactive under license of Giants Software. Farming Simulator, Giants Software and its logos are trademarks or registered trademarks of Giants Software. Focus, Focus Home Interactive and its logos are trademarks or registered trademarks of Focus Home Interactive. All manufacturers, agricultural machinery, agricultural equipment, names, brands and associated imagery featured in this game in some cases include trademarks and/or copyrighted materials of their respective owners. All rights reserved. The agricultural machines and equipment in this game may be different from the actual machines in shapes, colours and performance.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Giants Software","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":20765,"name":"Alpha Polaris: A Horror Adventure Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/448/4485c62121c417eef8eeaf100a924681.jpg","description":"In the midst of the snowfields of Greenland lies Alpha Polaris, an American oil research station. High above, the ion storm of the century is gathering, bringing about a strange intermixing of reality and night terrors...\nAlpha Polaris is an old-school adventure game focusing on character-driven horror and environmental themes. Previously released worldwide in retail, the game features professional voice-acted dialogues, hand-drawn dialogue portraits and an original soundtrack.\nAlpha Polaris was developed by Turmoil Games, an indie game studio situated in Finnish Lapland, making the game an authentic Arctic production. Developed during two long and dark Finnish winters, inspiration for the game was drawn from such sources as inuit legends, Cthulhu mythos and the very real blight polar bears face today.\nThe Steam edition includes:\n* Expanded resolution support (MINIMUM RESOLUTION 1280x768)\n* Steam achievements & trading cards\n* Minor tweaks & bug fixes, tweaked dialogues\n* English voice acting, ingame texts available in English, Russian, German and Polish","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Turmoil Games","platforms":[{"id":0,"name":"PC"}]},{"id":19173,"name":"The 11th Hour","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/951/9511ec09b2ff5cee0053c59a5ea877de.jpg","description":"IN THE 70 DESOLATE YEARS since the horrifying murders chronicled in The 7th Guest, the town of Harley has been ominously silent.\nOnly when journalist Robin Morales vanishes while investigating the rotting abandoned mansion of the legendary toy maker Henry Stauf, do events resurrect a malignant past.\nAS ROBIN'S COLLEAGUE and lover, Carl Denning, you come to the ravaged estate to find her. What you uncover in its decaying chambers embroils the entire town in a deadly legacy of madness.\nWEAVING A FEATURE-LENGTH, powerfully graphic video through The 11th Hour: The Sequel to The 7th Guest, the renowned developers at Trilobyte have created the most cinematic challenge to date. A wide array of games, puzzles and quests cleverly underscores the time-bending, contemporary adult mystery. only the deepest horrors of the mind could spread such terror in the night.\nFEATURES\nFully Explore over twenty-two beautifully-rendered rooms with faster, smoother 3-D graphics than ever before.\nParticipate in a suspenseful interactive drama directed by David Wheeler, written by The 7th Guest author, Matthew Costello, featuring first-rate actors and a new musical score by The Fat Man.\nSolve three CD's worth of diverse and perilous challenges.\nGet on-screen hints instantly with the GameBook, No backtracking necessary.\nWatch high quality, full motion video without any additional hardware required.\nEVERY MOMENT is riddled with intrigue. Three mysterious women are your only guides. Will you find Robin and unearth Stauf's fate at last? Or seal your own forever? It all must come together at The 11th Hour.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Trilobyte Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14696,"name":"Broken Sword 4 - The Angel of Death","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbe/dbe582022cb94e056f48860b52572e72.jpg","description":"After reluctantly battling dragons, Mayan gods, and becoming a knight of a long lost Holy Order, unwitting hero George Stobbart determines to settle down to a life of mundane 9-5 office work. Who would have thought that a mysterious and beautiful woman would enter his life; a woman whose sudden disappearance draws him into a desperate search for a nefarious artefact of great and terrible power?\nAs forces of ancient worlds and past forgotten myths clash, current emotions will conflict with past regrets. Emotion, humor, and puzzling combine to draw the player into a dark world of conspiracy theories, daring adventures, and ancient societies. For George, it looks like the world needs saving. Again.\nKey Features:\nThe fourth installment of the legendary series – available in stunning 3D\nFeatures a rich, evocative soundtrack and top quality voice acting\nThe atmosphere of mystery and danger will accompany you throughout the whole adventure\nThe engrossing story-line and witty dialogue will keep you hooked throughout","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Sumo Digital","platforms":[{"id":0,"name":"PC"}]},{"id":14086,"name":"Charlie's Adventure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/588/5887d03a10b09d7fcf8105c8f19de04d.jpg","description":"Take on the role of Charlie and enter a strange and mysterious world filled with nightmarish hordes of zombies, dangers and many surprises.\nIn this easy to play and hard to master platform you will slay zombies, avoid as well as use deadly traps, and unleash your true potential through a variety of skills and abilities.\nCharlie's Adventure will take you on a journey through 12 unique levels as you face off against legions of zombies. Help Charlie cleanse his world of these vile creatures!\nFEATURES:\nwork your way through 12 levels of zombie infestation\ndozens of scary but not so smart zombies\ndeadly traps that can kill you and your enemies\nuse the environment against the enemy\neasy to play, hard to master type of a game\n3 difficulty levels\nfull controller support\nkeybinding support for : keyboard, mouse or any joystick\nUltra HD resolution supported (4K)","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Just1337 Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10578,"name":"Brawl of Ages","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed1/ed1a64926de72b9530c1d7fffb0476a8.jpg","description":"Brawl of Ages is a free to play, multiplayer Collectible Card Arena game that draws elements from the most fun, exciting and competitive gameplay aspects of several different genres, including CCGs, MOBAs, RTS & Tower Defense.\nFast-paced 1v1 arena battles.\nMatchmaking & Ladder rankings.\nFull Featured Brawl Clubs (clans): Text & Voice Chat, Friendly Challenge with up to 50 Club members. Compete in the Club v Club Ladder and earn extra free content together.\nBuilt-in VoIP and text chat in Smash Parties where you & your friends can challenge each other and compete for the bounty rewarded to the final champion.\nRobust crafting system allowing players to directly craft the cards they desire most.\nGameplay modes & experience that caters to both highly competitive & casual gamers.\nBrawl of Ages was designed with several factors in mind: for all types of gamers to be able to have a fun time competing against each other in fair & balanced matchups, without having to deal with some of the more recently prevalent game models that feature  power multipliers, gated content, slow & painful progression, and unfair matches where their opponents could have stronger cards than them because they chose to pay for a power advantage. BoA’s gameplay balance is  for the highly competitive gamer and free of any pay-to-win mechanics.\nChoose 10 cards from a large collection featuring unique & exciting gameplay mechanics from some of the most popular competitive multiplayer genres. Tailor your deck to match your own personal gameplay style & strategy. Challenge your opponents to 1v1 battle arenas. Use your cards to summon units, build structures and cast spells. Execute your attack strategies & manage your resources with precision timing to destroy your opponent’s base. With a short duration and the action gets ever more frantic, will you be the one standing victorious at the end?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BNA Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":10450,"name":"Youtubers Life","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9b5/9b500837b7dbd289ccec169fe102d1c0.jpg","description":"Youtubers Life is the ultimate life simulation/tycoon videogame in which you can become the world’s greatest content creator in history by editing videos, expanding the number of fans and turning yourself into a wealthy fellow. Create your character and start making your first broadcasts in the cosy room at your parents’ where you have grown up since you were little. Keep an eye on daily tasks and socialise yourself to increase your popularity while you have to deal with fans, friends, family and time management!\nBecome the most important gamer on Internet ever! Attend presentations of new games, buy new and classic consoles, purchase your favourite titles online, get them delivered at home and start recording your gameplay sessions right away!\nHave you ever wished to become a music star on Internet? Play up to 30 different instruments and master every music genre —there are more than 10! Publish cover videos, music lessons, duets and be the focus in a live concert.\nEnjoy the new Cooking Channel in which you will record the best cuisine-themed videos online! Buy ingredients, choose the appropriate kitchen tools and create recipes. Giving cooking advices has never been so fun!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"U-Play Online","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":754881,"name":"Hard West 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0fc/0fc7cf3eb2594857e6c5839d48f5841e.jpg","description":"he Wild West and occult collide in Hard West 2, the supernatural sequel to turn-based strategy game, Hard West. \"Out here in the West, they say the heroes are long dead... But you're no hero, are you?\"","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"CreativeForge Games","platforms":[{"id":0,"name":"PC"}]},{"id":51209,"name":"Blade Runner 9732","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/023/02334e20efef4ff9435c1c1d59a243c1.jpg","description":"BR9732 is a Virtual Tour inside Deckard's apartment.\nWant to have a drink at the balcony watching the streets from the 97th floor?\nAlways wanted to start the Esper Machine by yourself and play the piano?\nEnjoy 3D sound effects and Vangelis ambient music through your VR headset (or not) right now and take a walk inside this mythic Cyberpunk atmosphere!\nAt this stage, the experience offers a simple virtual tour.\nYou can walk around, look at details, pick some objects, play the piano, take a shower, start the Esper machine and enjoy the rain falling on the balcony.\nThe interactions are quite simple for now because I focused on exact replica modeling of the whole place to get the best immersion. I really wanted to push attention to details and reproduce the lighting and sound atmosphere of this movie.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Quentin Lengele","platforms":[{"id":0,"name":"PC"}]},{"id":26076,"name":"Kingdom Hearts 358/2 Days","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c8/4c81708193fab89bd38e3d3094a890ab.jpg","description":"In KINGDOM HEARTS, Sora turned the Keyblade on himself in order to\nrelease Kairi’s heart, but his heart was also released in the process.\nThis brought about the creation of Roxas, Sora’s Nobody. Unlike most\nNobodies, however, Roxas has no memories of his past. He joins\nOrganization XIII and slowly begins to discover the truth behind his\nexistence and the Organization itself. He meets and befriends the\nfourteenth member of the Organization, who also has no recollection of\nher past. What will Roxas see during his time\n\nin the Organization? What is the connection between him, Sora and the\nfourteenth member? And what becomes of them? Dive into the heart of the\nKINGDOM HEARTS storyline’s biggest secrets.\n\nUncover the events that took place during the year Sora was asleep\nregaining his lost memories. KINGDOM HEARTS 358/2 Days revolves around\nRoxas, the \"other\" hero from KINGDOM HEARTS II, and his days as a member\nof Organization XIII. Follow Roxas and the rest of Organization XIII\nacross the various Disney Worlds, and discover the connection between\nhim, Sora, and the mysterious 14th member, and the reasons behind his\neventual departure from the organization. KINGDOM HEARTS 358/2 Days also\nfeatures a multiplayer mode for the first time, allowing players to\ncontrol their favorite Organization XIII members!\n\nFeatures\n\n• Familiar action-packed KINGDOM HEARTS gameplay that has captivated\nfans worldwide\n• “Panel System” – a brand new system that allows you\nto customize Roxas’ arsenal by placing abilities, items, and weapon\nparts into allotted slots\n• A series-first multiplayer mode, allowing\nup to 4 players to control any Organization XIII member\n• Learn about\nthe origins of the “Organization XIII” name\n• Get to know\nthe members of Organization XIII, including the mysterious fourteenth\nmember\n• Finally experience the KINGDOM HEARTS storyline’s missing\nchapter","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"}]},{"id":23419,"name":"F1 2017","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e83/e83713396a250b37971155d79fb48398.jpg","description":"F1 2017 Special Edition\nF1 2017 Special Edition includes F1 2017 Game and F1 2017 ‘1988 McLAREN MP4/4 CLASSIC CAR DLC’. The Special Edition will be available until October 17th 2017.\nAbout the GameMAKE HISTORY\nWin the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. With an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline, F1 2017 is the most complete and thrilling F1 videogame ever.\nF1 2017 gives the player unprecedented access to not only the on-track excitement of F1, but also the off-track dealings and vehicle development that goes along with it. The acclaimed career mode is updated to include additional practice programmes to help the driver hone their skills, an expanded Research and Development tree to provide greater depth and control over the development of the car, and the ability to manage engines and gearboxes over the course of the season.\nAlong with some stunning new locations and compelling characters to interact with, these enhancements all combine to provide the most complete experience in the world of F1 yet. MASSIVELY EXPANDED CAREER The expanded career mode allows players to make history as they hone their skills and develop their car over multiple seasons. Delve deeper than ever before into the new vehicle management features that require the player to balance resource to improve performance, keep the car reliable, and avoid punishing grid penalties.\nManage the six key components which each make up a modern F1 power unit and work to develop team skills such as pit stop times, Research and Development speed and new part reliability.\nThere are also new Practice Programmes to master and earn resource points from, ‘Fuel Management’ and ‘Race Pace’, and stunning new and updated career locations form the immersive back drop to the off-track negotiations. The classic cars also take centre stage in the enhanced career mode as you are invited to race them in the new ‘invitational events’.\nOther enhancements to the career mode in the new game include the addition of female driver avatars for the first time, new helmet designs from community competition winners, the ability to change car number and helmet design during the season, and the much-requested option to assign the prestigious number 1 to your career car when you win the Driver’s Championship. NEW CLASSIC F1 CARS The game includes twelve iconic F1 cars of the past from five historic teams – Ferrari, McLaren, Red Bull Racing, Renault and Williams, which are available to race across a variety of game modes. The classic cars are also integrated into the career mode, and can be raced in both Single Class and Multi Class Races.\nThere are also new ‘invitational events’ with a variety of exciting gameplay modes that include: Overtake, Pursuit, Checkpoint Challenge and Time Attack. ENHANCED MULTIPLAYER Players will race online with a full grid of 20 cars in either public or private sessions, with two dedicated ‘spectator’ spots added too. With improved multiplayer matchmaking, new online stats and a levelling system, and all multiplayer session types will allow the option of racing either the 2017 cars or the classic cars.  The ‘Event mode’ has also been expanded to feature across all three platforms, along with a new competitive scoring system. NEW ‘CHAMPIONSHIPS’ MODE AND NEW GAMEPLAY TYPESA new ‘Championship Mode’ allows the player to experience some unique race events that follow different rules and structures from the official Championship, allowing players to experience new and varied content within a championship structure. ALTERNATIVE TRACK LAYOUTSA first for the franchise, as well as the 20 official circuits, there are four additional track variants added to the game: Britain Short, Japan Short, USA Short and Bahrain Short, whilst Monaco at Night has also been created in stunning fashion.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":20205,"name":"Without Within","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/969/969472ff73af52ab4e077b0b8acecf8b.jpg","description":"Vinty has been getting nowhere with her calligraphy. Her confidence has sunk to an all time low.\nAs life pressures her toward giving up, will she forget why she pursued this craft in the first place?\nWithout Within is a short visual novel that explores the creative mind. The game was released for free in Christmas 2014 as thanks to everyone for supporting my endeavors thus far. For those who kindly appreciate the experience and wish to make a contribution, there is an Extra Edition DLC that includes the soundtrack, a digital artbook, as well as three inspirational chase cards.\nUnfortunately, being a free game, Without Within is unable to feature trading cards. Sorry Vinty!\nThank you! I hope you will enjoy the read.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"InvertMouse","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16638,"name":"Three Dead Zed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/633/6331f24929a5cdcf6b6fbda4294df466.jpg","description":"Three Dead Zed is an action/puzzle-platformer in which you take control of an experimental zombie that can transform into three unique and distinct forms. With quick reflexes, a little problem solving, and some rescued kittens, players make a violent exit that won't be forgotten by their captors. This is a zombie game that brings out your inner child, then chews on its brain.\nFeatures\nLighthearted visuals and storyline infectiously brings a smile to your face\nGamepad and keyboard support with custom keyboard rebinding\nChallenge Stages will test your skills after completing the main game\nCharming hand drawn characters, animations, and effects\nAchievements and trading cards\nDigital art book showing a sample of our creative process\nCats In tinfoil hats\nNote: Linux version does not contain Steam achievements at this time.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Gentleman Squid Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15257,"name":"Red Trigger","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df3/df32529756c9f0cf15548c1ac6992f27.jpg","description":"Red Trigger is a First Person Shooter (FPS) Puzzle game.\nThe player incarnates a virus called Red Trigger and tries to corrupt a computer system. You have the ability to shoot red blocks to expand or retract them, but you can only expand three at a time, so you must manage your energy wisely. The red blocks can be used in many different ways, like for example, making platforms, but also blocking lasers, holding doors open, powering systems and propelling yourself.\nThe game lasts for about 40 minutes to 1 hour+, depending on the player, and was developed by me in Unreal Engine 4, as my final project at NAD university in Montreal. I've worked on the game 7 days a week for 15 weeks.\nRed Trigger also won the prize of \"Choice of the Industry\" at ImagiNAD in May 2016.\nTo see any updates on patches or new games I make, you can follow me on Facebook or\nTwitter\nThe soundtrack is available here\nEnjoy!\nCredits :\nDeveloper - Maxime Vézina\nSound Designer - Gabriel EssiambreMentor - Maxime ChapleauWeapon Animations - Florin PopescuVoice - Lydia GosselinCommunity Badges/Emotes - Gabriel Fleury","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Maxime Vézina","platforms":[{"id":0,"name":"PC"}]},{"id":14448,"name":"Giants: Citizen Kabuto","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f05/f057c3ea9e16df0622f2a21c81d5fb28.jpg","description":"Before man climbed down from the trees to shop in megastores and drink cappuccino, before the Earth wadded itself into a cool blue ball, before the Moon even existed, there was the Island. The Island, a massive fragment of a long-lost planet, hurtling blindly through space. Upon the surface of this paradise wanders the giant, Kabuto. Little does Kabuto know that the Island was home to others before him. In the oceans, there dwells a matriarchal race called the Sea Reapers. In their pride, they created Kabuto, as a defense against intruders. But Kabuto became conscious of himself, his loneliness, his pain - and he went berserk.\nSpace castaways, the Meccs piloted their ship through space, looking for their missing friends. If you haven’t guessed already, they ended up on the Island. Faced with yet another unscheduled layover while on their way to Planet Majorca, the Meccs decide to make the best of their temporary home. Just their luck - the natives are already embroiled in their own little war, and the Mecc visitors are most unwelcome!\nMeccaryns... Sea Reapers... Kabuto... One island isn’t big enough for the three of them.\nThree unique races, each with a totally different gameplay experience\nBawdy humor that will keep you laughing throughout the game\nOne of the most original games ever created\noriginal version from 2000","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Planet Moon Studios","platforms":[{"id":0,"name":"PC"}]},{"id":13575,"name":"InMind VR","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c19/c192b66ef53e26bbb130a9a939be8d87_j8WENxs.jpg","description":"About the Game\nInMind is a short scientific adventure with arcade elements designed for the Oculus VR.\nThis first demo allows the player to experience the journey into the patient's brains in search of the neurons that cause mental disorder. Submerge into the microworld and experience the miracles of the human mind.\nThe future is nigh. The humanity is standing upon the brink of a new era where modern healthcare makes tremendous scientific advancements. With the help of nanotechnologies a surgical prototype bathyscaphe allows its operator to shrink to a microlevel and travel inside the patient's body.\nA unique experimental project made by Nival to test the opportunities of the new Virtual Reality provided by Oculus Rift.\nFeatures\nEnter the microworld inside the human brain.\nPacify disordered neurons to stop them from spreading wrong synapses to other neurons.\nReplay to increase your rating.\nA very comfortable VR experience.\nSupports Windows (VR), Mac and Linux versions.\nKeys\nEsc - exit\nSpace - recenter camera\nH - disable helmet\nM - disable VR-to-Screen mirroring\nTips & Known issues\nOculus Rift is not supported in linux and mac version\nDirectX 9 not supported for Oculus Rift DK2\nThere is known issue with DK2 black screen on Windows with AMD Mobility Radeon HD Series  (we are working with Unity3D devs to fix it)\nThere is known issue with linux version, application sometimes crashing right after the launch on Kubuntu 14.04 (we are working with Unity3D devs to fix it)Other VR games by Luden.io\nhttp://store.steampowered.com/app/522220/\nhttp://store.steampowered.com/app/396030/\nhttp://store.steampowered.com/app/588560/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nival Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":552,"name":"Hatsune Miku: Project DIVA Future Tone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca7/ca7a4d4175897ef1abea2fd28bb5fd84.jpg","description":"Explore the infinite world of Hatsune Miku through the most comprehensive Project DIVA game ever released!\nHatsune Miku: Project DIVA Future Tone Prelude comes with two songs and modules to customize.  To unlock the full potential of Future Tone, purchase the two packs bursting with 220 songs:\n'Hatsune Miku: Project DIVA - Future Sound' includes a collection of songs spanning past Project DIVA titles, including the original PlayStation®Portable series (never released outside Japan) and the F series on Playstation®Vita and PlayStation®3.\n\n'Hatsune Miku: Project DIVA - Colorful Tone' is a collection of songs from the Project DIVA Arcade, many of which are unique to the arcades, as well as songs from the super popular Project Mirai DX.\nIn addition, purchase of both expansions will unlock Survival Courses and Hairstyle Customization!\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1 player\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n© SEGA. SEGA, the SEGA logo, Project DIVA and Future Tone are either registered trademarks or trademarks of SEGA Holdings Co., Ltd. or its affiliates. All rights reserved. SEGA is registered in the U.S. Patent and Trademark Office. All other trademarks, logos and copyrights are property of their respective owners.\n© Crypton Future Media, INC. www.piapro.net","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":281841,"name":"Fractured Minds","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/027/027229b19554020ed219994f5a2c12a3.jpg","description":"Fractured Minds is an immersive artistic short game, exploring anxiety\nand mental health issues.\n\nWinner of a 2017 BAFTA Young Game Designers Award, Fractured Minds is a\ngame created by 17-year-old Emily Mitchell, with the hope of aiding\nunderstanding and awareness of mental illness.\n\nEmbark on a journey through the human psyche and experience six\natmospheric and thought-provoking chapters, each symbolising a different\naspect or challenge associated with mental health issues; from isolation\nto anxiety, with everyday situations being distorted beyond recognition.\n\nRaw, emotive and earnest, Fractured Minds demonstrates that video games\nare capable of communicating vital messages in imaginative ways. It is a\ngame that seeks to encourage empathy and champion support for the\nmillions living with mental health issues.\n\nFractured Minds is proud to support Safe in our World, a gaming industry\ninitiative striving for mental health awareness.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"EmilyMGames","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":28814,"name":"Motocross Madness","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/71e/71e4136c93fee3d76bb0e94fe0fd2d08.jpg","description":"Motocross Madness is back! Take your bike freeriding across massive environments, from the deserts of Egypt to the snows of Iceland. Drift, trick and turbo boost your way across 9 expansive offroad tracks in single player events, ghost challenges and 8-player multiplayer races. Combine stats with your friends in Bike Club to unlock rewards then compete across all events to reach the top of your club.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Rainbow Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":23188,"name":"Learn to Fly 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/893/893baec333e28956a8a6850c4fc313f8.jpg","description":"In Learn to Fly 3, you have to build, customize and upgrade a spaceship to reach space in an arcadey environment. Each playthrough earns you new parts to mess around with and assemble new exciting contraptions.\nThe game offers 4 different modes:\nStory Mode, where you have to earn money, upgrade your ship and make it to space. Try to beat the time challenges or just take it at your own pace.\nPayload Mode, where you have to build a much stronger ship that is able to pull heavy payloads along with it and carry them all the way into space. Light ships may be able to get to space in story mode, but it's going to take a lot more power to get those payloads off the ground!\nClassic Mode, reminiscent of the previous Learn to Fly games, where the goal is to fly as far as possible horizontally. It forces you to use parts differently and think of new strategies to favour distance over altitude.\nFinally, Sandbox Mode allows you to mess around with many game and physics constants. Infinite fuel, 100x gravity, over-powered thrusters, a gazillion obstacles in the air... you're free to do whatever you want!Key featuresBuild crazy spaceships from a combination of over 100 unique parts, each with their own distinct flavor and mechanics\nHalfway between realistic physics and a simpler arcade feel for an easy to learn yet deep experience\nPick from 24 stages, 18 launchers, 24 boosts and 23 bodies, and each can be upgraded multiple times\nResearch upgrades that affect all sorts of different aspects of the game and carry through play sessions\nOver 80 in-game achievements, each with their unique rewards\nCustomizable HUD with all sorts of relevant information\nCustomizable character and ship color\nCustomizable music\nEvery playthrough unlocks new items and bonuses for you to work with\nPenguins","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Light Bringer Games","platforms":[{"id":0,"name":"PC"}]},{"id":21368,"name":"Alien Shooter: Revisited","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/771/7710cf12827ae54e2b04060dbea76028.jpg","description":"Crowds of blood-thirsty monsters, crawling from every corner of the secret research base. Gloomy basements and modern labs, darkness changing into blazing bulbs. The only usual thing is: you're in a bad place alone, and there's no one to help you!\nAn improved version of a cult 2003 game which won hearts of the huge army of players worldwide. Complete game missions, earning more and more cash for weapons and inventory, use stationary weapons in the hottest places, eliminate monster spawning places with dynamite and increase your firepower with implants and drones.\nYou've saved our poor little planet so many times... but the real hero never stops!\nGo ahead, great deeds are waiting for you!\nAbout 1,000 monsters on each map, showing up to 100 monsters simultaneously on one playing screen\n3 game modes: Campaign, Survive and Gun Stand\nFull-on-action male or female character\nCharacter upgrade facility\n9 weapons of mass destruction\nRed or Green blood selection\nHighly imaginative selection of enemies\nReactive music which helps to drive the action\nUseful gadgets - flash lights, medkits, battle drones\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":20864,"name":"Fiesta Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e0/5e01436b8c45e3482fde196f65cf8482.jpg","description":"Fiesta Online is a unique free to play anime MMORPG played by an active and friendly community. In a magical and colorful world, players assume the role of a fantasy hero and brave powerful enemies and challenging quests.\nWith regular updates and more than 115 levels, hundreds of hours of gameplay content await you!\n\nFeatures\n•\tANIME MMORPG\nChoose your fantasy hero among five different character classes. Each class is equipped with different skills and plays a different role. You are not limited to only one character. You can change and experience the game in a new perspective.\n-\tFighter\n-\tCleric\n-\tArcher\n-\tMage\n-\tTrickster\n•\tQUESTS & ADVENTURES\nEveryday new adventures await you thanks to a Daily Quest System rewarding you with fame and bonuses. You can also take part in epic Kingdom Quests to help your character make friends and level up.\n•\tGUILDS & DUNGEONS\nBecome a member of a guild and have fun while playing Fiesta together. Fight together mighty bosses in dungeons and become the most powerful guild!\n•\tMASTER & APPRENTICE SYSTEM\nLearn a new type of team play to progress easily and fast in the game! Gain levels faster as Apprentice and pass on your knowledge as Master.\n•\tEVENTS & WEDDING SYSTEM\nParticipate in numerous in-game events and organize parties where you can dance with your friends. Find a partner who will stay on your side throughout your adventures and get married.\nJoin the fun with us, thousands of players await you!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Onson Soft","platforms":[{"id":0,"name":"PC"}]},{"id":16413,"name":"Dracula 3: The Path of the Dragon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f91/f91644bb4d1db3c22627c0b3da80d33c.jpg","description":"The trilogy continues as the Prince of Darkness rises again.\nSeptember 1920, the Vatican appoints Father Arno Moriani, the \"Devil's Advocate\", to investigate a potential candidate for Sainthood in Transylvania. But in the shadows of the disturbing ruins that were once Vlad the Impaler's castle, his investigation takes an unexpected turn...\nThere is obviously no such thing as vampires... at least according to the official line of the Catholic Church. But how can  you be so sure, standing in the swirling mists of Transylvania?  Carry out your investigation amidst tales of bloody deeds and ancestral fears.\nKey Features:\nHigh Definition graphics and movies with full panoramic views to see every unnerving detail\nUnlocking puzzles will require a test of your skills across sight, sound and taste (the taste of blood that is)\nSpecial hidden bonuses lurk in the darkness but well worth the reward if you dare to solve it\nMoody music, fear-inducing darkness and environments, an investigation that proves the further you dig, the deeper you sink into this diabolical occult adventure","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microids","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":15009,"name":"If My Heart Had Wings","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed9/ed9289fa04fbf65e6ffef8e2c75c72a5.jpg","description":"After a bicycle accident shatters his dreams of becoming a racer, Aoi Minase returns to his hometown, depressed and defeated. With seemingly no hope left for the future and no idea what to do with himself from here on, Aoi meets Kotori Habane―a young girl stuck in a wheelchair with a flat tire. It is on that windmill-dotted hill that Aoi's somber yet touching story of youth, friendship, and flight begins.\r\nUpon witnessing a glider soar overhead, Aoi sets off on a journey to realize the dream everyone has as a child: the dream of flight.\r\nWorking together with Aoi’s childhood friend, Ageha Himegi, the main characters of this visual novel begin rebuilding the Soaring Club, which is on the brink of disbandment at the hands of an uncaring school board. These beginners take hold of their passion, overcoming failures, obstacles, and interference from the school to put everything they have into building their own working glider.\r\nTheir ultimate goal to fly through the legendary \"Morning Glory\"―a rare and stunning weather phenomenon producing a special type of roll-shaped cloud that appears in the morning when the conditions are just right.\r\nJoin Aoi on this journey as he learns about the sky, his new friends, and much more.\r\nTotal Play Time: 20 to 30 hours\r\nFive character-specific story branches to play through\r\nFull voice-overs throughout the game for all characters","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"MoeNovel","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":11033,"name":"Delver","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/582/58271bce3250b733343ab301fcc3b8de.jpg","description":"Delver is a first person action roguelike dungeon crawl with crunchy pixels.\nTake the role of an adventurer that tries their fate in the dark dungeons (and probably dies horribly). Fight monsters, grab loot, hoard potions, and level up!\nQuest for the Yithidian orb at the darkest depths of the dungeon and attempt to bring it back to the surface - getting to it may be the easy part.\nLevels are randomly generated in each playthrough so you'll never know quite what's around the corner.\nDelver is in an unfinished beta state at the moment and has it's share of bugs and rough edges that need filed down, but it's very playable even in this unfinished state. Help us guide the direction of the game with your early access help and feedback. Our future plans are to revamp all of the art and sound, increase the depth of the RPG system, add special events and minibosses to the random dungeon generator, implement full gamepad support, and add a ton of new content. Help make Delver the best game it can be!Key Features Fast paced action rpg gameplay\nPermadeath - once you're dead, you're dead\nRandomized levels - never the same game twice\nLoot hoarding\nChunky pixels!\nModding support - the desktop version lets you make and share your own monsters, items, and texture packs\nLevel editor included!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Priority Interrupt","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10311,"name":"X Rebirth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a9/8a992504434a967afb3b9ef9a6a5178b.jpg","description":"Collector's EditionThis Collector's Edition of X Rebirth includes the following items:\nDLC: The Teladi Outpost\nDLC: Home of Light (new!)\nSoundtrack Volume 1 (MP3)\nExclusive: Soundtrack Volume 2 (MP3)\nOptional download: X - The Space Opera - Per Musica ad Albion (Video)\nBonus download with artworks and X encyclopedia\nThe bonus content will be placed in your X Rebirth installation folder:\n...Steam\\SteamApps\\common\\X Rebirth\\Bonus Content\nAbout the GameIn the distant future, the X universe faces a period of profound and irrevocable change. While the universe stumbles towards an uncertain future, countless adventures await as new enemies rise in search of power. Enter a young adventurer and his unlikely female ally traveling in an old, battered ship with a glorious past - two people alone against the galaxy, playing a key part in the events to come. The fate of the universe rests in the hands of the player...\nX Rebirth represents a spectacular new beginning for the X series, offering loyal fans and newcomers alike a vast, vivid and extremely detailed universe to explore throughout the game. Varied gameplay elements such as action-packed space combat, detailed trading mechanics and high-speed space exploration with fast travel allow players to experience a truly unique space saga that will keep them hooked for dozens of hours. X Rebirth features a whole new user experience - it is easier than ever to start with, and remains as deep as fans expect it.FEATURES\nTRADE! A fully simulated economy that means your actions really do matter. Travel the space highways to ﬁnd proﬁt in gigantic space cities, swarming with ships and drones.\n++ Every ship you see has a task. Stop a freighter from reaching its destination and its cargo will be stopped too, causing prices to rise. ++\nFIGHT! From small scale skirmishes to epic ﬂeet encounters, battles in the X Universe know no limits. Choose to ﬁght for the military, work for the police or be a lawless pirate, or if you prefer just ﬁght when you need to defend yourself - it's up to you.\n++ Take the action right into massive structures. Target turrets and shield generators to weaken your enemy, damage engines and jump drives to prevent their ships from escaping, or stop their factories producing to cripple their economy. ++\nBUILD! Create your own empire! From trading stations to large factories, farms to hightech military complexes, everything can belong to you. Build for trade and proﬁt or to strengthen your military presence and dominate your enemies.\n++ Extend and upgrade your stations to make them operate more efﬁciently, with every element visible in glorious animated detail. Harvest your own resources to keep your empire running smoothly. ++\nTHINK! A rich, detailed history and a deep complex plot await you, but you are free to decide when and where to take part. Explore the universe at your own pace - choose your own path and create your own destiny.\n++ Get up-close and personal with aliens and humans alike. Land on stations, meet people, then accept missions from them or hire them as crew members for your ships. ++\nTRADE, FIGHT, BUILD, THINK... in the X Universe - the biggest sandbox this side of the galaxy.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Egosoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":5290,"name":"Fat Princess","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ff/8ffe21d043312b43eb7ab3e2a2b26b8a.jpg","description":"Frantic and fun, Fat Princess pits two hordes of players against each other in comic medieval battle royale. The player's goal is to rescue a beloved princess from the enemy castle. There is a catch, though; the adversary has been feeding her with the cake that grows in a nearby forest to make her heavier to carry. Therefore, it's going to take most of your army working together to carry her back across the battlefield. Luckily, Fat Princess supports up to 32 players online simultaneously so plenty of help is available. Team balance and strategy is crucial in Fat Princess, one of the PlayStation Network's most anticipated titles ever, as players can switch between five different character classes literally at the drop of a hat. The name of the game is cooperation, whether it's flinging another player over the enemy's walls with a teeterboard, healing him while he charges into battle, or adding your muscle to carry the princess faster.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Tritan Studios","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":4180,"name":"Disney Epic Mickey 2: The Power of Two","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0af/0affd676990f5b2ee4dbae6ed9dfc976.jpg","description":"In Disney Epic Mickey 2: The Power of Two, gamers will play as Mickey Mouse and for the first time ever,  Oswald the Lucky Rabbit, Walt Disney’s first cartoon star, in an all-new adventure of creativity and  discovery. Created by industry luminary Warren Spector and Disney Interactive’s Junction Point game  development studio, Disney Epic Mickey 2: The Power of Two returns the franchise through PC. Disney Epic Mickey 2: The Power of Two returns Mickey Mouse and Oswald the Lucky Rabbit to  Wasteland, an alternate world filled with 80 years of forgotten Disney characters and theme park  attractions.  But for the first time, Mickey and Oswald will join forces as true partners – Mickey with his  magical paint brush that wields paint and thinner, and Oswald with his powerful remote control that  allows him to command electricity.   This new co-op play combined with enhanced in-game physics will  further enhance the idea that “PlayStyle Matters” – a unique approach to gameplay pioneered by  Warren Spector where players dynamically tackle different challenges in order to explore all possibilities  and storylines, but with consequences for their chosen actions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Junction Point","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"}]}]