[{"id":16558,"name":"UBERMOSH Vol.3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24c/24c8b3a4a9eef4d0dc6dcdb040d33deb.jpg","description":"The third volume of the arcade series UBERMOSH.\nVol.3 brings the UBERMOSH combat to open field: no cover, borderless terrain, wider view and even more enemies. The extra classic thugs will join a digital swarm entity that hunts the character. Achievements are divided in Resilience and Destruction to keep track of your survival and damaging skills. The faster pace, freedom of movement and updated class mods create a hardcore reflex based experience, shaped by community feedback on each volume of the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Walter Machado","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14652,"name":"Invasion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b86/b867c4a03844a92cd3dd518ec8ac3f02.jpg","description":"INVASION  - is the simplest 3D shooter with surviving elements in which you must survive on an unknown planet. The main idea is simple. You explore different locations where a key is hidden. The key will help to open the door to the next level. Don't think it won't be hard. Every location is full of various aliens who want to destroy you. You have a perfect gun helping to kill the enemies. Collect ammos, medical kits, door keys, kill opponents. The game will be thrilling for you! Good luck!\nKEY FEATURES:\n- Pixel graphics.\n- Simple gameplay.\n- Huge locations.\n- A variety of enemies.\n- An exciting atmosphere.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Hipix Studio","platforms":[{"id":0,"name":"PC"}]},{"id":11100,"name":"Chronicon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66b/66b247d0535b91ee2d0adeb8cc4ea10c.jpg","description":"Gems & Sockets just added!Read more in the official roadmap!StoryWhat happens in a world where the last evil lies dead, the last quest is completed, and the last chest has been opened?\nIn this world, the long-dead Heroes of Old are forever remembered and honoured through a great magical device. This device, known only as the Chronicon, is capable of opening a portal into the memories – the very souls – of the Heroes of Old. Each year, a handful men and women are given the great honour to re-live the old tales.\nAnd this year, you have been chosen…\nNote: Trailer footage and screenshots are of high level characters with decent equipment. Expect a slower pace at first.Game Features\nThe first 3 full acts to play through, with 2 additional acts coming soon\n4 unique classes: The Templar, Berserker, Warden, and Warlock\nProcedurally generated dungeons and areas – each playthrough is different\nLocal co-op up to 4 players (same machine, requires 1 Xbox 360 controller per additional player)\nOver 600 items with randomized enchants & qualities, and powerful set items!\nOver 900 skills and abilities to learn and improve\nInfinite character progression\nBasic crafting - Enchant and gem your equipment to its maximum potential!\nFull Xbox 360 controller support (optional)Planned Features (in no particular order)2 Additional acts\nHardcore mode\nMore items\nMore quests\nMore everything!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Subworld","platforms":[{"id":0,"name":"PC"}]},{"id":969003,"name":"Divine Knockout (DKO)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b6a/b6a70174f4c056a8a56bfd3daa9803f4.jpg","description":"Damage enemies to make them vulnerable, then knock them out of the arena with a mighty blow! Enjoy combat inspired by 2D platform fighters, but brought into a unique third-person perspective.\nEach arena features a new mechanic that players must master to win. Some crumble over time, while others feature deadly traps.\nHurl boulders as Hercules, swing Excalibur as King Arthur, or wield Mjolnir as Thor. Unleash each god’s devastating abilities at the push of a button.\nIn DKO’s core 3v3 mode, each round is a new adventure – and a new mode like Knockout or King of the Hill. Or play intense 2v2 and 1v1 duels, focused entirely on combat.\nWith full cross-play and cross-progression, you can play anyone, anywhere.\nCustomize each god to play exactly how you want, and to show your unique style.\nNew gods, maps, cosmetics, and modes are released regularly.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Red Beard Games","platforms":[{"id":0,"name":"PC"}]},{"id":452664,"name":"A Juggler's Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3b7/3b7a7c8a0fee3dfdc55be5295fcd04d0.jpg","description":"\"Ladies and Gentlemen! Come in, come in! In the mood for a story, are we?\"\nAbby is an artiste held captive at a circus: She spends her days entertaining the audience and her nights in a cage, longing for freedom. One day, she escapes the circus and gets to explore a mystical world.\nAlas, freedom comes at a cost and Abby soon finds herself dragged into the dangers this world has to offer: In a war-torn, medieval fairytale, surrounded by ravaged, starving citizens and hunted by the relentless cut-throat Tonda, Abby has to cross raging rivers, make it through bandit camps and around traps. Her adventure is always accompanied by the lyrical rhymes of puppet master Jack, who is telling her story while holding the strings of his puppets firmly in his ever-helpful hands.\nWho can Abby trust? Can she find a way to truly break free? Despite dangling from her threads, will Abby learn that she can still influence her destiny?\n\"Abby, can't you see? The strings holding you up also hold you back!\"Features:Solve fascinating puzzles using the unique string puppet gameplay mechanics.\nLive through an intense story of hope and empowerment.\nExplore a beautiful and grim fairytale world.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"kaleidoscube","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":285650,"name":"Rayman 3 HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a4/2a48f4629cac886473ee026d15a8be1e.jpeg","description":"Embark on a fantastic and humorous journey with Rayman and Globox to save the Crossroad of Dreams. Masterfully enhanced with eye-popping High Definition visuals and sounds, Rayman 3 HD is the definitive version of the Rayman classics “Rayman 3 Hoodlum’s Havoc”, and a must-play for all Rayman fans and platform adventure game enthusiasts. Run, Jump and punch your way through the 2 first levels of the game battling the mysterious Hoodlums and their minions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft Shanghai","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":91642,"name":"En Garde!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/32e/32ec3c0a53bf3ff458211ea45d8a3bdb.jpg","description":"A swashbuckling adventure!\nEn Garde! is a swashbuckling action-adventure game set in 17th century's Spain. Play as Adalia de Volador, a noble & impetuous swordswoman! Your palace has been seized by a mysterious mastermind and his hoard of guards - you will have to defend your family's honor!\nFight with your rapier and acrobatic moves against numerous opponents, and use the environment to your advantage in an intuitive way (every object is interactive, from tables to chandeliers!). You can even use your sense of repartee to taunt your opponents. Combat is a spectacle and should be done with panache!\nThis En Garde! prototype features story-driven action in an open level (the Volador's Palace) for a total play time of about 30 minutes.\nCredits\nEn Garde! was made as a student graduation project by a team of 8 students from Supinfogame Rubika (France). The game is powered by Unreal Engine 4.\nAdrien Poncet - Game director, producer & sound designerValentin Capitaine - Game designer & AI designerCorentin Mangé - Level designer & level builderSylvain Schmück - Gameplay programmer & 3C designerPierre Chapelet - Gameplay & AI programmerTim Guthmann - Animator, technical artist & level artistAnaïs Simonnet - Character artist & level artistJulien Fenoglio - Art director, concept artist & level artistLudwig Wu - Music composer (from MAAAV Lyon 2)\nSpecial thanks to Ilse Zamarripa, Jordan Jaminet, Valentin Picard, Maxime Conquy, Thibaut Moitel, Loup Druet, Guillaume Faguet and everyone who helped us with the game!\nUseful information\n/!\\ Please note that you need a good PC to run En Garde!. The current version might be poorly optimized for your PC, or there might be some bugs. We are sorry for any inconvenience you may encounter. We will try to release a better version soon.  /!\\\nThe game plays better with a Xbox gamepad. Gamepad Controls are explained and displayed in-game.  However, if you don't own a gamepad and would like to play with your mouse and keyboard, here are the controls you need to know:\nWASD/ZQSD - Move  Left mouse button - Attack Right mouse button - Parry Space - Dodge F - Kick R - Repartee Hold Shift - Sprint/Freerun E - En garde (manual lock) Esc - Pause game","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Supinfogame Graduation Projects","platforms":[{"id":0,"name":"PC"}]},{"id":46058,"name":"X4: Foundations","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f8/0f80a86c622ed14aca701cb2e26117cd.jpg","description":"## Freedom to personally fly all ships:\n\nX4 will allow you to fly all ships personally. From small scouts over a wide range of ship classes up to the biggest carrier, everything can be piloted from the cockpit or an external view. Additionally some drones and utility vehicles in X4 can be remotely controlled by the player.\n\nA big focus in the development of X4 has been to achieve a seamless and immersive experience when moving between ships. You can leave a ship, climb down a ladder, walk over the dock of a large space station into another ship you may have parked there and replace the pilot that was working for you just by clicking on his chair.\n\n## Modular stations and ship upgrades:\n\nBuilding space stations and factories has always been a foundation of the X games. After gaining enough money through fighting or trading, most players want to establish their own economy and start influencing the universe on a larger scale. In X4, it is now possible to be completely free and creative. Stations can be constructed from a variety of modules, be it production modules, living sections, docks or many other types of parts. The powerful new map system allows you to drag and connect modules using a connection system to design your own unique creations.\n\nShips also offer a variety of upgrades. Engines, weapons and other equipment can be added in a graphical editor and actually seen on the ship.\n\n## Most dynamic X universe ever:\n\nX4 will be the first X game to allow our races and factions to freely build and expand their empires; the same flexibility the player enjoys in creatively designing space stations from modular building blocks is also available to them. Races expand their empire based on supply and demand, which leads to an extremely dynamic universe where every action the player makes can influence the course of the entire universe.\n\n## Managing your empire with a powerful map:\n\nOnce you have more ships and many NPCs working for you as pilots, crew or station managers, the map will be your preferred method of managing it all. Ships can be ordered with simple clicks and through drag-and-drop operations to set their future path and commands.\n\nGraphically plan your trade routes, coordinate attacks with your entire fleet, manage the hierarchy or send ships on remote exploration missions.\n\n## Most detailed X economy ever:\n\nOne of the key selling points of X games has always been the realistic, simulated economy. Wares produced by hundreds of stations and transported by thousands of ships are actually traded by NPCs and prices develop based on this simulated economy. This is the foundation of our living and breathing universe. Now with X4, we have taken another, massive step. For the first time in any X game, all parts of the NPC economy are manufactured from resources. Ships, weapons, upgrades, ammo and even stations. You name it. Everything comes out of the simulated economy.\n\n## Research and Teleportation:\n\nThe seamless change from ship to ship and from NPCs controlling your empire for you continues on a higher level. Once you own a larger fleet, you will be very interested in researching a technology from your HQ: Teleportation. Once you've unlocked teleportation, you can jump from ship to ship a lot quicker and experience all the critical situations your NPCs encounter first hand.\n\nEvery order you have given to a ship before turns into a mission objective when you pilot the ship yourself. The moment you leave again, your pilot takes the helm and continues with their previous orders.\n\n## Get into the game:\n\nIn X4, you can start your journey from a number of different gamestarts and as a number of different characters, each with their own role, set of relationships and different ships and technologies to start with. No matter how you start, you are always free to develop in any other direction. Focus on exploration, make money with illegal trading and theft, command large battle fleets or become the greatest entrepreneur ever. It's all up to you to decide.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Egosoft","platforms":[{"id":0,"name":"PC"}]},{"id":38991,"name":"Saw: The Video Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10d/10d066aec891b24b3049b82543120cd8.jpg","description":"The Games on Demand version supports English, French, Spanish.  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".  Jigsaw has killed your partner and destroyed your life. Now he has trapped you in an abandoned insane asylum that he alone controls. If you can defeat his brutal traps and survive, you may just discover the truth behind what drives this twisted serial killer. SAW is a third-person perspective, survival horror game based on the SAW film franchise. The game features many of the deadly mechanical traps seen in the film, as well as terrifying new ones.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Zombie Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":28458,"name":"Alien Hominid HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa2/fa288ed3b6eb6e40df71c9094519978c.jpg","description":"Alien Hominid HD, the award-winning 2D side-scroller from The Behemoth, is now available for Steam! With hand-drawn graphics, excitingly fast gameplay, and the humor that started it all, loading up this title is like traveling decades back in time, with improved visuals and the same hardcore gaming experience.\nNavigate your surroundings by jumping, dodging attacks, grabbing agents, and digging underground! Use your trusted blaster to shoot at anything in your path and hurl grenades towards your enemies for epic explosions! Catch agents off guard with your knife in close-up combat, or chomp their heads off if that’s more your style.\nWhether you’re playing solo or 2-player local co-op, Alien Hominid HD is back with the three classic difficulty options:\nEasy - 7 lives and continues, with two shields from weapon pickups\nNormal - 5 lives and continues, with one shield from weapon pickups\nINSANE - 3 lives and continues, one hit kills\nTired of chomping heads? All of the original mini games are here for any aliens wanting a quick break, including:\n201 levels of PDA Games\nSuper Soviet Missile Mastar\nAll You Can Eat\nNeutron Ball\nPinata Fiesta\nChallenge Mode\nAnd that’s not all – the game is complete with Steam achievements, in addition to weekly and monthly leaderboards for all three difficulties! Come back to the game that started it all for The Behemoth while crossing your fingers and hoping you remember those pesky boss patterns…","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"The Behemoth","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":26174,"name":"Pro Evolution Soccer 2010","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bea/bea83848cf71a819319bb9e321b4aff1.jpg","description":"\"Get even closer to the action on the football field with PES 2010 - Pro\nEvolution Soccer for Wii. The latest version of the hit soccer\nsimulation crams in new features to make the 2010 season more realistic\nthan ever, tweaking the groundbreaking control scheme to let you dictate\nthe flow of play with increased precision.\n\nOnce again boasting an officially licensed UEFA Champions League mode,\nPES 2010 places you in the boots of the brightest soccer stars on the\nglobe as you assume control of your favorite club and national sides in\nleague and cup competitions. Stake your claim for a place in the\nChampions League by toppling the opposition in the Master League, or\nhead online to play opponents around the planet – using the team you’ve\nbuilt in Master League, Champions Road or My Team modes for the first\ntime to make victory taste even sweeter.\n\nPES on Wii has always been a unique experience. Send players on decoy\nruns, thread cutting passes through the defense or mark loitering\nstrikers using the motion-sensing power of the Wii Remote and Nunchuk.\nBy tracing lines on the pitch, pointing at players or making\ncontext-sensitive movements with the controllers, you can orchestrate\nthe flow of the game with unmatched satisfaction. This time, an enhanced\nFree Run system means players won’t vacate their patch of grass when\nanother team-mate makes a Free Run into that area – increasing your\nattacking options as you move the ball up the field. Free kicks have\nalso changed, and are now taken from the player’s perspective and\ndirected via the Wii Remote pointer. With spectacular set-pieces more\nlikely, your opponent might think twice about hauling you down on the\nedge of the box next time! If you prefer a more traditional control\nscheme, all the action on the pitch can also be controlled using the\nClassic Controller.\n\nFurther enhancing the gameplay is a new stamina meter which affects\nplayers’ ability to constantly out-run the opposition or make countless\nball-winning challenges. Instead of simply monitoring a single stamina\nmeter for each player on your team, you’ll also have to keep an eye on\ntheir “instantaneous stamina”, which is drained when players set off on\nepic solo runs or constantly battle to win the ball back. If you’ve been\nrelying on a flying winger or battling midfielder too much, it might be\ntime for a change of tactics!\n\nPES 2010 once again lets up to eight players compete together in online\nplay via Nintendo Wi-Fi Connection. Can you and your mates form a dream\nteam capable of conquering the best PES players out there? If you have\nyour Wii connected to the Internet, you’ll also benefit from updates to\nteam rosters in the summer and winter transfer windows – ensuring your\nfavorite team in the real world is accurately reflected in the game.\n\nPlay your part in the ongoing evolution in football games with PES 2010\nfor Wii.\n\nSpecial Features:\n\n• Take charge of your favorite club and national teams and compete in an\nofficially licensed UEFA Champions League mode.\n• Control all the\naction with motion-based controls to put you in total control. New\nadditions include an overhauled free kick system.\n• Compete with up\nto seven other players in online multiplayer and use your customized\nteams for the first time on Wii.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":20023,"name":"9 Clues: The Secret of Serpent Creek","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a9/3a96ce680e2f3e93c09eb017f45e0751.jpg","description":"9Clues: The Secret of Serpent Creek is an original hidden-object puzzle-adventure game, in which a unique Detective Mode enhances the gameplay. This thrilling detective drama merges horror elements with the look and feel of 1950’s USA.\n\nA paranormal private investigator is contacted by her friend – a reporter named Helen Hunter – who pleas for help in a terrified voice. She urges the protagonist to come to the coastal town of Serpent Creek at once.\n\nAfter reaching her destination, the detective finds no trace of Helen. And the manager of the nearby hotel, in which she supposedly stayed, claims never to have seen the blonde reporter.\n\nWeirder still, the town’s streets are crawling with snakes, the citizens seem to be sleepwalking through life, and the ground shakes with violent tremors.\n\nThis case will certainly challenge the protagonist’s detective talents. She must find clues and put them together quickly to uncover what is really going on in Serpent Creek and what fate has befallen her friend.\n\nThe only person who is willing to help her is the eccentric mayor Alister Braminus, but she is not sure if she should trust him.\n\nFeatures:\n    Unique Detective Mode: uncover clues and piece them together\n    Thrilling storyline set in 1950s America\n    Unique, varied locations\n    Hand-painted graphics\n    Map and journal that include current tasks and information about characters\n    40 locations,\n    13 minigames,\n    19 achievements to unlock","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tap It Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":20007,"name":"Heroes of Scene","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e32/e3262755a4ddc1280eec14dc12741c83.jpg","description":"Heroes of scene is a multiplayer strategy game with an indirect control. You are in charge of the Kingdom of live toys. Gameplay is based on the two general mechanisms. First one is the development of your castle. Second one is the attack and defense. You can summon toy warriors and spells from the magic cards. The summoning uses resources, which you can get from sawmills, textile mills and laboratories. Battle scenes in the Heroes of scene usually last less than 15 minutes.\n• Your deck – your regulations!\nCollect your own deck of heroes and spells. Plan your own strategy to win!\n• Fast gaming session.\nThe battle rarely overruns more than 15 minutes allowing you to play on the way home or during work breaks.\n• Build your castle!\nYou can build your own kingdom with a laboratory, a sawmill or even a forge.\n• One account for all devices.\nYou have one account which is playable on all your devices giving you the ability to play on a tablet or PC using your favourite characters and spells.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Icy Donut","platforms":[{"id":0,"name":"PC"}]},{"id":19344,"name":"Garshasp: The Monster Slayer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5bf/5bfb65634d2dfbbb1c4c581c1255342c.jpg","description":"Years after the confinement of Azhi Dahaka by Fereydun, the evil Deevs (Monsters) who were the commanders in the army of darkness led by Azhi Dahaka rose again in different parts of the ancient lands of Khunirath and rebelled against the humans who were celebrating the victory of the army of light.\nThis game is based on ancient Persian mythology bringing to life the epic battles of the mythological hero, Garshasp, in the ancient lands against the evil monsters. You play as Garshasp himself, the strongest man in Persian Mythology, in a journey to revenge and reclaim the legendary mace of his ancestors which is stolen by the Deevs. A journey which proves to unlock more significant hidden mysteries. The main mechanics of the game revolve around melee combat, platforming and exploration.\nKey features\t\t\t\t\t\tDeep combat system with various combo moves and upgradeable abilities throughout the game.\nRage attribute to slash more enemies as they bring you more scars.\nIntense combat engagements using Garshasp's special hand blade based on quick time events.\nCinematic in-game camera following the hero in the epic environments that are traveled in his journey.\nFantasy mythological world filled with ferocious monsters from ancient literature and Persian Mythology.\nPlatforming elements.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Dead Mage","platforms":[{"id":0,"name":"PC"}]},{"id":17939,"name":"Conquest of Champions","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e3/7e3c06110c373e22d26e16f9bfd2cb27.jpg","description":"Conquest of Champions is the perfect blend of Collectible Card Games and deep turn-based tactical strategy that only the creators of PoxNora could deliver. Think 'Magic the Gathering' meets 'Warhammer' or Chess.\nBuild your personal deck strategy and bring your cards to life by summoning fully animated creatures, casting devastating spells, and equipping powerful weapons all within battlegrounds that are reminiscent of tabletop miniature warfare.\nModesYou can choose to complete an entire match in real-time or you can take turns asynchronously and complete matches that extend over several days.\nConquest offers both PvP and single player options. In PvP you can challenge your friends or climb the leaderboards & compete in tournaments by battling ranked opponents. Currently our single player options are just practice battles but our development roadmap includes full campaigns and boss battles.Free to PlayConquest is free-to-play in that you are given a free Hero and starter deck when you register and then can unlock the other two factions at level 3 and level 6.  You will earn additional cards, components (used in crafting), gold, and experience just by taking ranked turns and completing matches and quests.  Everything in the game can be earned.  As you play you will be able to expand and customize your deck with the cards you unlock.\nFor those who do not want to wait, we offer a couple DLC bundles which allow you to acquire Hero decks at a bulk discount. The 'Starter' includes one hero from each faction for the price of two heroes. The 'Mega-Hero' includes every Hero in our release set and first expansion (this assumes you get to level 6 for the starter ones).\nFeatures  * 3 game modes: Single Player Campaign, Asynchronous PVP, or Real Time PVP.\n* Customize unique decks with over 200 cards (new expansions every 3-4 months).\n* 3 Factions to choose from: Stonehold (Dwarves, Constructs, and Barbarians), Briarwood (Elves, Beasts, Fibians, and Treefolk), and Embercult (Demons, Undead, and Dragonkin)\n* Each soldier has unique attributes and up to two special abilities such as ‘Double Attack’ or ‘Chain Lightning’.\n* Earn experience, gold, components, and cards by taking turns in ranked matches or completing friendly matches.\n* Global ranking system - play ranked games to climb the leaderboard.\n* Make cards more powerful by fusing them together.\n* Craft exotic rare cards by completing sets of components earned through gameplay.\n* Daily Quests and Achievements\n* Regular Tournaments scheduled seasonally\n* Exchange strategies with your friends via the lobby chat.\n* Cross-Platform play! Mac/PC and coming soon for iOS and Android tablets and mobile devices!\n* 3 Unique Map Backgrounds (Mountains, Forest, Caverns), each with multiple map layout variations.\nEarly AccessWe are excited to open the doors to the beta to give a sneak peek at what is coming with Conquest. While the game is very much playable we have a great deal of features to add. Some of which include:\n- Expansion Content:  We will be releasing regular expansions to add additional depth and strategy to the game.\n- Auction House / Trader\n- Tablet Build: With cross-platform support.\n- Guilds\n- Automated Tournaments: Round Robin, Draft, etc\n- Spectator Mode / Replays: Ability to watch others play. This was highly demanded during our first tournament and we can't wait to get it in.About UsKihon is comprised of the core PoxNora team and holds years of experience building a successful CCG community. We are small closely knit team based out of Tucson, AZ.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Kihon","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":898351,"name":"Banishers: Ghosts of New Eden","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/165/16538fa36e5667048fe0f2aab204abde.jpg","description":"New Eden, 1695. Antea Duarte and Red mac Raith are lovers and Banishers, ghost-hunters who vowed to protect the living from the threat of lingering ghosts and specters. Following a disastrous last mission, Antea is fatally wounded, becoming one of the spirits she loathes. In the haunted wilds of North America, the couple desperately searches for a way to liberate Antea from her new plight.\n\nImmerse yourself in a beautiful, intimate and powerful story between two fated lovers. As Banishers, enter the lives of New Eden’s communities and solve haunting cases in a mystical, lore-rich world plagued with supernatural creatures and ancient secrets. Use your wits or combine Antea’s spiritual powers and Red’s arsenal to defeat and banish the souls tormenting the living.\n\nChallenging decisions will lay on your path, dramatically impacting your story and the fate of New Eden’s inhabitants—be they living people or wandering souls. How much will you compromise your ghost-hunting vow for the sake of your lover who became one of such spirits?\n\nPlay as both Antea and Red, and battle supernatural forces with magic, weapons and spiritual powers\nUnlock new gear and abilities to unleash the full power of the Banishers\nUncover the ancient secrets and hidden mysteries of a mystical, lore-rich world\nCharacteristic of renowned studio DON’T NOD, make meaningful and morally ambiguous choices that affect the story, the world and the fate of all characters, dead or alive","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"DON'T NOD","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":558974,"name":"The Legend of Zelda: Skyward Sword HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/624/624ee5ea783877a9ad8ccf68b8d8300b.jpg","description":"The Legend of Zelda: Skyward Sword game soars onto Nintendo Switch!\n\nTake to the skies, draw your sword, and experience the earliest story in the Legend of Zelda series. Join Link in his high-flying quest to save Zelda, a childhood friend who must confront her destiny. Soar between floating islands and descend to the treacherous surface world in this updated HD version of the Legend of Zelda: Skyward Sword.\n\nMaster realistic swordplay that matches your movements\nSwing your sword and angle your slashes to uncover and break through opponents’ defenses using intuitive motion controls. Link will match the angle of each strike you make with the Joy-Con controller, creating immersive swordplay that relies on strategy and accuracy. Movements feel smoother and more immediate thanks to the Nintendo Switch system’s increased processing power and HD graphics. Take advantage of the newly-added button only control scheme—perfect for playing in handheld mode or on the Nintendo Switch Lite system.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":62238,"name":"THE LONGING","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbc/fbc9ba5c8cb24fabb86df6d91a235057.jpg","description":"A cavernous idle adventure game.\nYou play as the last servant of a king, who once ruled an underground kingdom.\nNow his powers have faded and he falls asleep for 400 days to regain his might.\nIt is your duty to stay in the cave alongside the king until he awakens.In utter loneliness, miles below the surface,it is now your task to... wait. Wait...For 400 days.In real-time.\n:THE LONGING: is part idle and part adventure game. As soon as you start, the game counts down the 400 days you need to wait - even when you stop playing and exit the game.\nYou can build your own little home next to the king and furnish it with items you find in the cave. You can draw little pictures with various gemstones, read books, play an instrument. With each upgrade of your home, time will progress faster and faster, as long as you stay inside.\nHowever, you can also try to get further and further away from your cozy vault and explore the dangerous parts of the cave that the king warned you of. After all, it is your decision what to make of your solitary existence, miles below the ground.\nFeatures:\nUltra slow-paced cave exploration\nDungeon Synth music\nVarious endings\nHandcrafted 2D graphics\nSolitude","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Studio Seufz","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":44791,"name":"Fallen Legion: Flames of Rebellion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2f/e2fa9394d2751dbcf840fcccd9fac59a.jpg","description":"Claim What Is Rightfully Yours.\nFallen Legion: Flames of Rebellion is an intense action role playing game where every battle is a heart-pounding fight and each gut-wrenching choice impacts the realm.\nTravel through a ravaged continent with Legatus Laendur and rally support to take back what the empire took from you. Explore gorgeous, hand drawn lands inhabited by rival soldiers and savage manticores. Fight enemy hordes with a team of living weapons and master devastating combo attacks to defeat challenging bosses with Fallen Legion’s deep combat system. Rule your empire between fierce battles, make difficult decisions, and witness the consequences of your choices. Will you side with a barbaric general for a defense buff or execute soldiers threatening to mutiny to revive one of your characters?\n1 player(s)\n20000KB Minimum\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One time license fee entitles play on up to 3 PlayStation® Vita systems activated by this account.\n© 2017, YummyYummyTummy, Inc. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"YummyYummyTummy","platforms":[{"id":0,"name":"PS Vita"}]},{"id":44215,"name":"CarX Drift Racing Online","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69e/69e01c60096717bc31c64cb68479de61.jpg","description":"CarX Drift Racing is a racing game dedicated to the motorsport of drifting. Legendary cars, detailed tuning settings and a real-time multiplayer mode in full HD at 60 fps. All this awaits you in the PC version of this popular mobile game!\nKey features:\n● Over 10 tracks designed specially for drifting\n● 30 cars with the option for detailed settings\n● Support for gamepads and racing wheels\n● Real-time multiplayer mode with up to 8 players per game session","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"CarX Technologies","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":22872,"name":"Urban Chaos","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa0/aa042192185dc638e57605c134d19e9c.jpg","description":"As the millenium draws to a close, a malevolent cult of the Fallen lurks in the shadows and sewers of Union City...waiting. Their unholy mission is to fulfill an ancient prophecy of apocalypse. Crime and subversion are their tools to wrest control of the city. Now gangas, hardened criminals, and violent cultists roam the streets looking for trouble to cause. As D’Arci Stern, a tough as nails UCPD rookie cop, you use her martial arts prowess and infiltration skills to unlock the diabolical intentions of the Fallen cult. Her only ally in an unfair fight against criminality is Roper, UCPD informant and ex-Special Forces grunt. Obsessively driven to purge the world of the Fallen menace, Roper speaks softly but carries a big shotgun.\nUrban Chaos throws you feet first into the cold, corrupt heart of a modern urban jungle at the turn of the millenium. To succeed you’ll need a deadly combination of stealth, physical agility, and martial arts skills as you interact with the city around you. Complete freedom to explore every area is granted and this freedom extends to gameplay - the future is in your hands as you fight to reclaim your city from the madness of the Fallen cult.\nInteract with a vast living city teeming with citizens - you can choose to assist NPC's to gain both information and new weapons.\nMultiple modes of combat and action including hand-to-hand fighting, heavy weaponry attacks, vehicle chases and building shoot-outs.\nEach street has random event scripting. For one mission, a street may be filled with holiday shoppers. For the next mission, a major gun battle between cops and a gang might be in full swing.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Mucky Foot Productions","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":20197,"name":"Delve Deeper","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d72/d724b50b620d944f878b9b68c612b3a6.jpg","description":"Delve Deeper is a turn-based Adventure/Strategy game for Windows that combines HD pixel art, tile placement, and RPG elements in a bright and humorous atmosphere. Up to four players take command of Dwarf mining teams in this fast and furious dungeon adventure meets devious puzzler, building the map as you play for an ever-changing, endlessly replayable strategy experience for you and your three best friends, or three devious AI teams.\nKey features:\nGorgeous HD Pixel art, quirky humor, and the ever-present King of Dwarves!\nPick your own team of 5 Dwarves from Fighters, Scouts and Miners\nBattle 20 powerful Monsters including Goblins, Evil Dwarves, and huge Dragons!\nNew! Level Builder allows you to create and share your own designs!\nChallenge your friends in up to Four Player Hotseat Multiplayer\nCollect over 100 relics to power up your Dwarves, and view them later in The Royal Gallery!\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Lunar Giant","platforms":[{"id":0,"name":"PC"}]},{"id":19918,"name":"Gunnheim","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb3/bb347a457d3d8f4e09b575f6cfaad0b0.jpg","description":"Guns+Vikings= Mayhem.Current FeaturesCollect an arsenal of epic weapons, ranging from mini guns to atomic bombs\nOnline and local co-op - Use co-op mode to team up with friends and accomplish your goal of knocking some sense into the devil, with room for some wickedly delicious friendly fire kills along the way\nBask in the glory of superior low-poly graphics and intense gore\nNo pixel art. No puzzles – And most importantly No zombiesStory\nThe Lord of Death hits the bottle hard on the Ragnarok of all benders and hell breaks loose- literally. Enter the unholy children of Gunnheim: gun-toting, skull-crushing Viking warriors born and bred for battle, summoned to restore the balance. Gunnheim is a 1-4 player top down shooter inspired by Viking mythology and the golden era of couch co-op gaming.\nIn Gunnheim, you’re bringing the term berserker to a whole new level, saving the day by dishing out carnage of hellish proportions. Armed to the teeth with all manner of modern weaponry, fight your way through hordes of hellspawn with your brothers and sisters at your side, survive epic boss fights against the biggest and baddest of the devil’s children, and watch with maniacal glee as your enemies are turned to bloody piles of pulp, fangs and horns. Put your goggles on, it’s about to get really, really messy.\nWith a cutting sense of humor, Gunnheim brings fast paced action, superior low-poly graphics, and more gore than you can imagine to this classic genre.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"SIEIDI","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19849,"name":"Pongo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bec/becd3c092ede1b375501e4696a08a547.jpg","description":"Pongo is a 3D action platformer that combines pogo stick jumps with strategic FPS combat. Grab your Pongo, a tool usable as either a pogo stick or a gun, to obliterate enemies and traverse the vast islands of Flubber. Balance rapid movement and high jumps with challenging combat, hordes of enemies, puzzles and traps at every turn. Grab your Pongo and let the adventure begin!\nFeatures\nLeap through over 45 challenging levels\nObliterate monsters with your Pongo\nAvoid deadly traps and slay huge bosses\nSolve challenging puzzles and explore islands\nEnjoy charming 3D environments\nJam to an exciting, quirky original soundtrack","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Drixy Games","platforms":[{"id":0,"name":"PC"}]},{"id":13908,"name":"On Rusty Trails","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/922/9222a4e83a145e96a72a7a81a3ae3f34.jpg","description":"You, a robot named Elvis, are living in a racist world that’s ever suspicious of appearances - just like its hostile inhabitants.\nEquipped with your Shifty Suit, you’re able to change your looks in seconds and take advantage of the environment’s reaction. If you don’t adapt, platforms refuse to work, save points don’t save, and jump pads become deadly traps.\nDiscover rusty suburbs, perishing cities, massive factories and mysterious machines. Experience the escalating conflict between two peoples, while running up walls, jumping across chasms and flying through streams of lava. Expect to be dazzled by an ever-changing environment with fresh mechanics. Play a lovingly crafted platformer adventure from the creators of Tiny & Big!FeaturesLook different, at the touch of a button. Influence how the world responds to your appearance.\nRun up the walls and along the ceiling. Get ready for an adrenaline rush from dastardly puzzles.\nGladden your eyes with finest comic panels, beautifully illustrated backgrounds, and 6 diverse worlds waiting to be explored.\nIt creaks, it cracks, it crunches! - A dark and melodic soundtrack with an eclectic selection of music. Haunting robotic sounds for your rainy days and the industrial revolution.​\nCompete with your friends on lightning-fast levels with high score leaderboards.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Black Pants Studio","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":269532,"name":"GrandChase","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bcf/bcf7adc4db65b3e9c68113b11aa2b128_mkTjKME.jpg","description":"Grand Chase is a side-scrolling online action RPG with anime inspired graphics.\nAnyone can join in on the action with arrow and Z keys with 20 unique and charming characters.\nThere are various dungeons in a fantasy setting and online real-time PvP.\nCollect equipment and learn skills to enjoy jampacked action in dungeons and PvP.\nMain Content\n20 Unique Characters\nExpand the available skills through changing jobs and create your unique skill tree to differentiate your character from others.\nDungeon Mode\nParty up with your friends to explore the vast lands. (Solo play also available)\n: Normal Dungeon – Follow the stories of the characters and the world of Grand Chase.\n: Heroic Dungeon – Clear each dungeon to obtain the best available equipment.\n: Event Dungeon – Enjoy a different kind of fun from other dungeons.\nPvP Mode\nWith your unique skill tree, play strategic matches against other players in various PvP modes.\nPlay together between 2~6 players.\nYou can play Item Match, Team Match, and Singles Match in Normal and Deathmatch modes.\nCustomization\nThere are various weapons, armor set, and accessories that allow you to customize your characters to stand out in a crowd.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"KOG","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":34811,"name":"Neighbours from Hell: Revenge Is a Sweet Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a8/5a82694b8549f4b6e2c1b987d26ff744.jpg","description":"Neighbours from Hell: Season 1\nCreep around your neighbour ’s house performing ever more elaborate tricks upon the unsuspecting resident.\nAs the star of a fantastic new TV show, cameras will track your every move as you set your fiendish traps. Your objectives are to create more and more disarray, increase ratings and maybe even winning prestigious awards. But beware of watchful neighbors and alert guard dogs; if they catch you then the show will be taken off air.\nKey Features Neighbours from Hell (Full Version of the game) :\n- 14 hugely varied episodes of anarchy\n- Use stealth, skill and style to perform the perfect ambush\n- Easy to use interface and controls\n- Superb cartoon-style graphics\n- Excellent soundtrack","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":20651,"name":"Cosmic DJ","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/066/0663ff3545a9eac50c6aa4da06ad6f5d.jpg","description":"Cosmic DJ is a quick, \"pick-up and play\" musical experience about the joy of music creation for budding intergalactic musicians of all skill levels. Set among the stars, you will strive to become the legendary Cosmic DJ through six musical adventures as you’re tasked with repairing the all-important “Jamtennas” and bring harmony back to the galaxy.\nEXPLORE\nCosmic DJ includes a campaign mode that allows you, \"The Cosmic DJ of Legend,\" to go through six adventures to repair the \"Jamtennas\" and bring musical harmony back to the galaxy!\nSEQUENCE YOUR JAM\nCreate your galactic beats with the intuitive, tap-based controls and the classic grid sequencer inputs with dozens of instruments from keyboards and drums to guitar and voice samples.\nCREATE AND SHARE\nA legendary DJ should not keep their creations for themselves so share your creations with the world by automatically creating and MP3 from your creations! Even create an album cover artwork with photos, stickers, and drawings to make it your own.\nFEATURES\nTap/Grid Sequencer - tap out your own beats from a set of funky instruments or align them using the grid sequencer for perfect rhythm..MP3 Conversion - export your musical masterpieces and share with other budding Cosmic DJs.Story Mode - repair the Jamtennas and bring the groove back to the galaxy.Quick Play - just let the music take over without anything getting in your way.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":20355,"name":"GameLooper","genre":"Educational","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/774/774b7f29c1ba764728cf8e9b93e9e788.jpg","description":"***GameLooper is a complete platform for easy game development***\nWith GameLooper desktop app, you can create any kind of 2D mobile games by using drag & drop user interface. Then you can simulate your games with GameLooper mobile app.\n***Share your game prototypes with friends***\nYou can share your GameLooper games with friends before they are ready to be published on the Apple App Store and Google Play Store. Anyone who has GameLooper installed on their device can play your games and give feedback when you share your GameLooper games. This is a great opportunity to show your game progress to your friends.\n***We're looking for your GameLooper games to make them featured***\nJust create your games with GameLooper desktop app and request publish through GameLooper mobile app. Our Q&A Team will be contacting you shortly. Then we will prepare your games for the Apple App Store and Google Play Store to publish.\nNow, go to www.gamelooper.com and download GameLooper mobile app for your Android devices to start creating awesome games!\n***Attention!***\nGameLooper requires internet connection to work properly. Don't forget to turn on your Wi-Fi on your mobile device.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"GameLooper","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17895,"name":"Escape Goat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/274/2746ffb98c19972c9f7c3f6e3fc9d709_weSNuQj.jpg","description":"Escape Goat is a puzzle platformer where you take control of a goat, who has been imprisoned for witchcraft, and overcome traps and obstacles to escape the Prison of Agnus. Fear not, for with your supreme agility, sturdy horns, and the help of a magic mouse friend, you can turn the tables on foes and use the environment to your advantage.\nTen unique zones to conquer. Can you reach and rescue the friendly sheep in each?\nTackle over 50 rooms of puzzles. Find hidden machinery and destructible elements to transform them and reach the exit!\nBuilt-in, fully featured level editor. Create, modify and share entire game worlds.\nEscape Goat reigned for 20 months at the #1 spot on the IndieGamerChick leaderboard (November 2011-July 2013)!\nThe sheep are slumbering... can you awaken them all?","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"MagicalTimeBean","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15745,"name":"One Thousand Lies","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c2/8c25c792a170b962b2d579a5774d8885.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Keinart Lobre","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14102,"name":"Sakura Santa","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/50c/50c7c0d8a3a683e3df8a75cf6b6781e2.jpg","description":"Koji is feeling a bit down. This year is the first Christmas he's spending alone. After moving away from home to attend the University of his dreams, he found his college life to be rather lonely.  Feeling distraught, he wanders to his local shrine to make an offering. His wish is a simple one:\n\"I want to have someone to spend Christmas with this year.\"\nShortly after making that wish, he meets three girls, all with unusual quirks. They want to spend time with him in the days leading up to Christmas, leaving Koji with quite the dilemma. Who should he spend Christmas with this year?\n*(This game does not contain any sexual content.)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13492,"name":"The Adventures of Tree","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df8/df8e079abd90e7dfd4c9f37001585efc.jpg","description":"The Adventures of Tree takes you on an open ended adventure to save your fellow species from the evil invaders!\nIn this cute and charming hand drawn game, you will have to make choices that effect your ending.\nWhether you're a fan of the hand drawn style or not, this game is a charming, cute and funny experience for everyone!\nWith over 30+ hours of gameplay, and huge replay-ability this is not a game you want to miss!\nThis game is open world, you can roam freely across the vast landscapes collecting epic treasures!\nKeep yourself laughing as you read thru the quirky and comical dialogue.\nSurvive the harsh winter landscapes or relax in the sun on the beach!\nGame Features:\n-Customize your character with over 100 possibilities!\n-Pick and choose from 40+ Quests to earn money!\n-Explore 15 exotic locations all containing unique creatures and items!\n-Choose your gear load out from over 50+ items!\n-Battle over 50 different types of creatures!\n-Defeat over 5 unique Bosses!\n-Make choices that effect your game ending!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tiger Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":3749,"name":"Yaiba: Ninja Gaiden Z","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/db9/db922a2e99af7f49af5a590583aef315.jpg","description":"Step into a living comic book in this new take on the Ninja Gaiden series. Brandishing his ninja sword and the mecha weapons in his cyber arm, Yaiba slaughters zombies with brutal, over-the-top abandon. Will you slice enemies to pieces, crush them with Yaiba's cyborg arm or just rip off a zombie’s arms to use as nunchucks?\n* The images are from an in-development build and may differ from the final version.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Team NINJA","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":827,"name":"Muffin Knight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75d/75db82b32d92aa732de344e2588a1c65.jpeg","description":"NEW GAME UPDATE – ALL THANKS TO YOUR GREAT FEEDBACK!!!Controller\nIt’s now easier to configure your controller inputs (both in main menu and during gameplay)\nAdded Controller presets for Xbox, Logitech and generic controllersGraphics\nYou can now choose the graphics quality\nHigh also includes AntiAliasing\nIf you ever have trouble and want to reset some settings, hold Alt when first launching the game in SteamMultiplayer\nSimplified Multiplayer matchmaking: Servers are searched automatically. If none is found, a new one is created for the user.\nOpen for multiplayer game toggle: You can play single player games while waiting to find a CO-OP multiplayer match. If a match is found, you jump out of single player automatically.\nAdded friend only/public matchmaking toggle to the options menu\nAbout the GameFertilize the forest with the unicorn, cover the sky with black holes, flood the world with candy, but just get the muffins back!\nMuffin Knight is an arena based action-packed platformer with stunning visuals and a myriad of fairytale characters, each with their own unique abilities, which gain strength as you advance.\nThis is the story of a little boy, on his journey to return the old fairy’s magical muffins. A strange curse was set on him: with each muffin he touches, he turns into a different creature. The old fairy promises to turn him back into a boy when he gets all the muffins back.\nFEATURES\n➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠➠\n★ FAIRYTALE GRAPHICS ★\nStunning 2.5D graphics, taking full advantage of the latest features in the Unity engine.\nDiscover a colorful and enthralling world, with magical hand drawn artwork\n★ CUTE AND CUDDLY ★\nPlay as 18 different characters, each with their unique special attacks\nMake your way through swathes of dragons, turtles, werewolves, ghosts, bats, goblins and other cute fluffy creatures\n★ DEPTH OF GAMEPLAY ★\nLevel up, unlock new characters and upgrade their abilities\n6 perks will bring you extra abilities during your quests for the muffins\n★ EPIC BOSS BATTLES ★\nIn the end, you’ll have to prove your skills by defeating the evil lava king\n★ CO-OP & VERSUS MULTIPLAYER ★\nPlay together with your Steam friends and enemies, in intense head-to-head matches.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Angry Mob Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":571689,"name":"Dread Templar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0d4/0d4ab33c89c9772db39ab67183a4a8f5.jpg","description":"Dread Templar is a fast-paced first-person shooter that combines elements from both modern retro shooters and classics from the 90s. You are a Dread Templar seeking his revenge deep in the evil realm. Explore the levels and solve puzzles to find hidden weapons and upgrades. Face hordes of demons and bloodthirsty fiends using ninja equipment, firearms, and infernal weapons that will make YOU the scariest thing in hell. Gain Dread Powers and customize your skills according to your playstyle, as they will help you in your battle against the dark forces.\n\n\n\nFeatures:\nDread Templar uses elements from both modern retro FPS and classic shooters such as fast-paced gameplay, dashing, headshots and bullet time so you can enjoy the old-school shooting games in a modern way!\nCustomize your weapon skills to fit your own playstyle and fight against the demon hordes.\nMore than 10 types of weapons in the game including katana swords, firearms and infernal guns!\nExplore side areas and secret places, solve interesting puzzles and get rewards.\nHandmade retro art style - all elements in the game including weapons, demons, and levels are done in a retro pixel art style reminiscent of the 90s shooters.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"T19 Games","platforms":[{"id":0,"name":"PC"}]},{"id":387242,"name":"Death and Taxes","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/70c/70c7c48270d5b2cb630b33203c35bcd4.jpg","description":"In this small Indie, 2D, narrative-based game, you take the role of the Grim Reaper... on an office job. Your job is to decide which people are going to live or die. Your choices will affect the world around you. Keep the chaos away or foil plots to destroy the world and rise through the ranks of Reapers all the way up to MIDDLE-MANAGEMENT, wow!\n\nDeath and Taxes is a game in the vein of narrative-based indie titles, such as \"Papers, Please\", \"Reigns\", \"Beholder\" and \"Animal Inspector\", to name a few. The consequences of your choices are yours to bear, while the mystery of your incarnation awaits revelation!\n\n- Have a.. totally normal.. office job\n- Talk to your boss\n- Get monies\n- Buy stuff from Mortimer’s Plunder Emporium(?)\n- Decorate your desk\n- Do some paperwork\n- Pet the cat??\n- Stare in the mirror and talk to yourself\n- Don’t let the existential dread set in\n- DONT LET IT SET IN (ONLY THE FATE OF HUMANKIND IS IN YOUR HANDS, IT'S 100% OK)\n- Listen to that one really catchy tune in the elevator\n\nFeatures:\n\n- Meaningful choices\n- Branching storyline with multiple [SECRET] endings\n- Make-Your-Own-Grim-Reaper!\n- Fully voiced NPCs\n- Original Soundtrack\n- Original artwork featuring watercolour graphics\n- Dialogue options\n- Upgrade shop\n- Twitch integration!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Placeholder Gameworks","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":295094,"name":"ONE PIECE World Seeker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5b/d5b20d49c2b0588ac9484d2c7756f846.jpg","description":"Pre-Purchase Offer\nPre-Order this edition and get the following content:\n• Bathing Suit Outfit\n• Battle Outfit\n• Island Exploration Mission\nDigital Deluxe Edition\nThe ONE PIECE World Seeker Deluxe Edition includes the game and the Episode Pass, which contains 3 additional episode packs and bonus items.\nAbout the Game\nLeave your compass behind and join Luffy as he embarks on a brand new action-packed adventure where you can experience the powers of the legendary Gum-Gum fruit to uncover hidden secrets on an original, never-before-seen island! Time to set sail!\nDynamic Gum-Gum Action\n• Take control of Monkey D. Luffy and explore the vast areas of this all-new island as you try to uncover its hidden secrets.\n• Experience an Original Story\nThe Straw Hat Pirates arrive on a mysterious island known only as \"Prison Island\" and they're soon caught up in a dramatic story full of twists and turns. Includes original characters designed by Eiichiro Oda himself!\n• Fierce Battles Between Popular Characters\nFace off against some of Luffy's well-known enemies from the ONE PIECE series. Use his Gum-Gum Fruit powers and powerful Haki abilities to take them down!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":22346,"name":"Cinderella Phenomenon - Otome/Visual Novel","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/814/814f3256e9c01c2a7f66d9547fc1d2f1.jpg","description":"The game is also available on itch.io! If you would like to donate to our team, you have the option here: https://dicesuki.itch.io/cinderella-phenomenon\n~~~~~~\nStory\nFour years after the end of the Great War and the loss of her mother, Crown Princess Lucette of Angielle is still struggling to come to terms with her new life and step-family. Cold-hearted and bitter, Lucette’s life is once again turned upside-down by the Fairytale Curse, she is thrown into a battle to regain her crown in a fractured kingdom where nothing is as it seems…\nFeatures\n235,636 words\nCustomizable Name\n5 Pursuable Bachelors, each with a unique storyline\n10+ Side Characters with their own backstories\n10 Endings\n60+ Unlockable CGs\n15+ Original BGs\nOriginal Theme Song\nRight Choice Indicator\nGAMEPLAY NOTES\nFritz's and Waltz's routes are locked at the start of the game. You will need to complete two of the three routes available at the beginning of the game to unlock them.\nIf you would like a recommended playing order in terms of the build-up of plot, here is our recommendation:\nRod\nKarma\nRumpel\nFritz\nWaltzThe right choice indicator may show up belatedly so be sure to watch for it.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dicesuki","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":21241,"name":"House of 1000 Doors: The Palm of Zoroaster Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/975/975514a2f16df6c87de2bbec9e03bc3a.jpg","description":"Summoned by the Spirits!\nReturn to a sinister, unsettled House ...very different than the one you remember. The power of a cursed gem has unleashed a murderous plague that extends far beyond the Houses walls; and you must employ your psychic abilities to stop these evil spirit using your seek & find skills.\nBreak the power of a cursed gem!\nTravel to exotic locations throughout the world in search of the artifacts that can destroy this wicked presence. Solve a massive array of cleverly designed puzzles and ingeniously hidden objects as you unravel in this story of supernatural intrigue, unbounded adventure and sweeping scope.\nThe House needs you.\nWill you answer its call?Features:\nDiscover dozens of hidden object scenes and ingenious mini games\nSearch for clues and return harmony to the house\nExplore stunning locations and experience amazing animations on your quest for the truth\nExperience indelible characters in a compelling story\nCollector's edition includes bonus gameplay, integrated strategy guide and concept art!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"PC"}]}]