[{"id":22702,"name":"Dungeon Keeper Gold","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b33/b3302320b181022698309395f415d1cc.jpg","description":"Being the Dungeon Keeper and all, this is your home, too. And it’s your business to take these loathsome creatures of darkness and hone them into screaming, frothing, clawing forces of destruction. You lure them in with food and the promise of dank and fetid places to sleep. You keep them in line with the back of your hand and the threat of dire consequences. You pit their scaly hides against the best that the Forces of Good can muster, and they die for you as they rip steaming entrails out of the hapless heroes.\nIt’s a degenerate and nasty job… And you love it. Yes, home is where you heart is. In a box. Packed in salt. That's right--Dungeon Keeper, Bullfrog's classic dungeon management strategy, gives you no extra credit for having any morals. After all, the underworld isn't black and white!Includes Dungeon Keeper and the Deeper Dungeons expansion.\nRevolutionary game packed with tons of dark humor, an impressive variety of hellish creatures, and highly addictive gameplay\nBuild your dungeon, protect it with a labyrinth of dark corridors, a web of deadly traps, an arsenal of powerful spells, and an army of bloodthirsty demons\nA refreshing title for someone tired of rescuing princesses, saving worlds, and all that love, happiness and political correctness junk. Just this once, be the bad guy!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Bullfrog Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9690,"name":"Pinstripe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/055/055a6115ef3b51d511b8454c4a4ee32b.jpg","description":"Pinstripe is an emotionally charged adventure through Hell created entirely by a one-man team over the course of five years. Play as Teddy, an estranged ex-minister forced to venture through the frozen afterlife in search of his three-year-old daughter Bo, and her perverse kidnapper. Discover the dark secrets of Teddy's past, and confront his sleazy, demonic nemesis, Mr. Pinstripe.\nThomas Brush, creator of award winning indie games Coma and Skinny, reveals a gorgeous art style, breathtaking score, and chilling story with influences from The Nightmare Before Christmas, Coraline, and Alice in Wonderland.\nExplore six hauntingly beautiful levels of Hell.\nListen to an immersive and unique soundtrack written by the game's creator.\nUse your slingshot to fight your way through bizarre beasts and interesting puzzles.\nHang out with your family pet George and sniff out clues.\nDiscover the mystery behind Teddy and Bo's death.\nFeatures a hilarious cast of professional voice actors and celebrity cameo performances!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Armor Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":19379,"name":"Super House of Dead Ninjas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/853/85312b836769229e2efbb39c4136e248.jpg","description":"Super House of Dead Ninjas is an action arcade game with roguelite elements. Race against a 30 second timer as you descend floor after foe-filled floor and attempt to unlock the secrets of this deadly tower!\nPlay as the fearsome Crimson Ninja, wielding an arsenal of deadly ninja weapons and attacks. Ninja magic generates every tower randomly, so no two adventures are the same! Based on the hit Flash game from developers Megadev and Adult Swim Games.\nNEW! Leaderboards Support: bask in the envy of others as you crush their high scores\nNEW! 16:9 Support: play in glorious widescreen\nNEW! 50 new rooms added to random tower generation\nNEW! 3 new enemies and hazards to slice and/or dice\nNEW! 10 additional Steam achievements\nNative controller support\nRandomly-generated levels means endless replayability\n230 custom rooms, 100 of which are new to this edition\nDozens of weapons and item upgrades, many seen here for the first time (like the flamethrower and baseball bat)\nSlay eight terrifying bosses and 52 dastardly enemies, including a deadly exploding mushroom\nTransdimensional Leakage: a bizarre new tower to explore\nUpgraded music and sound effects powered by the Ninjinity Engine\nMap Editor: design your own levels and share via Steamworks\nCustomize your ninja with new colors and outfits, with thousands of combinations\nSteam exclusive version of the game is bigger and better than the original!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Megadev","platforms":[{"id":0,"name":"PC"}]},{"id":5950,"name":"Oddworld: Munch's Oddysee (1997)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a1/6a18cc31c5662a272af468f7d85c7528.jpg","description":"Update 14Latest updates:\n- Higher quality pre-rendered cut-scenes\n- Fixes to camera inversion and targeting during real-time cut-scenes\n- A few new 'HD' character models\n- audio quality improved\n- sound effects from Munch's Oddysee HD added\n- brightness adjusted on first boot to better match Xbox version\n- video player now uses the original 4:3 aspect ratio\nAbout the GameNew port for 2016\nWe've reported the game for 2016, which now runs at 60 FPS, includes higher resolution textures, better quality cut-scenes, improved audio, higher poly models, numerous fixes and improvements, and trading cards, badges, emotes and backgrounds!About the game\nPlayers guide Mudokon champion Abe, and his aquatic Gabbit partner Munch, in Oddworld's third adventure, using special psychic powers, cool power-ups, and other special abilities to deliver payback as they reclaim the last gabbit eggs on Oddworld, which have been packaged in a can of gabbiar.\nKey features:Play as a team - players use Munch and Abe cooperatively to make their way through the trials of Oddworld. Leverage both characters' unique strengths:\nAbe- Abe can climb and jump to reach new areas, and then run to escape from dangerous enemies. When all else fails, chant to take control of the enemy's soul, and use their guns to clear a path to safety.\nMunch - Munch can swim around the new realms of Oddworld. When on the ground, zip along with a wheelchair power up. Need to move some yapping Slogs out of the way? Just use Munch's nifty remote control head port to fire up the crane and drop those Sloggies in their pen.\nSpecial psychic powers - Munch and Abe's psychic powers can extend their reach and get others to do the dirty work:\nAs Abe - Let Abe's chant roar to take possession of a gun-toting Big Bro Slig and clear almost anything out of the way. Abe can use spooce or spiritual power gained byharvesting SpooceShrubs to posses other creatures as well, but why think small?\nAs Munch - If Abe can't mesmerize someone into getting the job done, Munch can use his handy remote control head port to hijack nearby machines including cranes, and 50-caliber Anesthesia bots to tackle the really tough obstacles.\nPower-Ups – Every friendly character you can find becomes a fighting ally, Fuzzles, Mudokons…. Need to get somewhere quickly or get over a wall, like right now? Use Oddworld's consumer power-ups like Expresso and Bounce to amp up Munch and Abe's abilities to perform cool moves. For the more direct approach, possess high-caliber weapon toting enemies.\nOddworld, now in \"new and improved 3D!\" - it's a whole new Oddworld, with lush rivers, towering mountains and hundreds of trees that bloom or die.\nInteract with dozens of different oddball races - use GameSpeak® to get Oddworld's Inhabitants from the heavily armed Big Bro Sligs to the cute but ferocious Fuzzles) to carry out tricky tasks or just beat the crap out of enemies.\n\"Frustration Free\" gaming - Oddworld's new intelligent cinematic camera, auto-targeting system and no-stick navigation system makes playing a breeze! Plus with easy\nQuikSave® and limitless lives, players have plenty of chances to take on any situation…\nno matter how Odd!","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Oddworld Inhabitants","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":19576,"name":"The Blackwell Legacy","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5fa/5fa1bb27fe896a4a7872d72d0d41be96.jpg","description":"When Rosa Blackwell's only relative dies after twenty years in a coma, she thinks the worst is over.  This all changes when Joey Mallone, a sardonic ghost from the 1930s, blows into her life and tells her that she is a medium.  Whether they like it or not, it is up to them to cure the supernatural ills of New York in this critically-acclaimed series of point-and-click adventure games.\nWhen three NYU students kill themselves one after the other, nobody thinks that a sinister force is at work.  Nobody but fledgling medium Rosa Blackwell and her new spirit guide Joey Mallone.  It's trial by fire as they set these troubled spirits to rest.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Wadjet Eye Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":17423,"name":"ACE - Arena: Cyber Evolution","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e48/e48cab114776c3718c3c82a9053d8e98.jpg","description":"Arena: Cyber Evolution (ACE) is a futuristic physics-based sports game in which players confront each other in 3 vs 3 matches of wits and twitch reflexes. \r\n\r\nBy featuring a MOBA-like champion logic, ACE brings an unprecedented twist to the sports genre by allowing players to choose from a variety of super-powered heroes and what style of gameplay they prefer to build their own team strategies. Designed from the ground up around the mouse & keyboard, ACE was not envisioned only as a sport game, but really as a new sport. ACE’s ultra-precise control scheme allows players to analogically manipulate the disk using simple mouse gestures. Just like in real sports, this gameplay allows for super intuitive gameplay while proposing nearly infinite depth & skill cap.\r\n\r\n* An unique blend of action games, sports games and MOBA.\r\n* The closest experience to playing a traditional sport in a video game.\r\n* Dynamic physics-based gameplay that is both deep and accessible.\r\n* Innovative mouse gesture control allows for fluid and natural actions (passes, shots, intercepts and jukes).\r\n* Having all human players makes positioning meaningful and allow for infinite team strategies.\r\n* Several characters each with unique powers and play styles\r\n* Unlock implants (to improve and customize your characters), team boosts, upgrades, and special abilities.\r\n* Very fun to watch as a spectator - even without prior knowledge of the game.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spearhead Games","platforms":[{"id":0,"name":"PC"}]},{"id":236801,"name":"Encased: a sci-fi post-apocalyptic RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/861/8610924e8a65fbfccbe718494ffa330b.jpg","description":"Old-school isometric RPG;\n- Sci-fi and post-apocalyptic setting;\n- Turn-based combat system;\n- Single protagonist with companions;\n- Story campaign of approximately 30+ hours long with significant replay potential;\n- Dozens and dozens of side quests to adventure;\n- Gigantic open world via the global map with about 200 handcrafted locations to explore;\n- More than 75 unique random encounters.Story premise\nThe events of the game happen inside the Dome – an artificial construction of unknown origin. The Dome is indestructible. Technology, items, and relics can be extracted from it, but people who enter the Dome are not able to leave it. Beneath the ground yet more mystery awaits, as the Dome is just the tip of an enormous complex hidden beneath the sands. These ancient underground labyrinths contain artifacts, weapons and AI systems that control the complex… not to mention lethal traps and dangerous anomalies that guard the riches.\nResearch and exploration of the Dome are conducted by staff of the C.R.O.N.U.S. Foundation. To the outside world, little is known about the inner workings of C.R.O.N.U.S. Those that sign up for a life within the Dome do not speak of their experiences, and those managing the Foundation from outside speak even less. Thanks to the powerful artifacts extracted from within the Dome, C.R.O.N.U.S. have become powerful enough to hold sway over the leaders of the world. Now, the fate of the entire planet rests in the hands of the soldiers, businessmen, scientists and even criminals who comprise the ranks of C.R.O.N.U.S.\nIn the end, the Foundation’s political machinations led to nuclear war, the echo of which was heard inside the Dome. All communication means with the outside world were lost, and another power has now arisen – something that explorers never faced before. An intelligent entity has awakened in the depths of the underground complex, causing death and destruction. Within the Dome, the survivors will have to build a new civilization upon the ruins of the old one, and the player’s character is among them.Combat\nEncased combat is inspired by classic, tactical turn-based systems, with a grid overlay, action points, cover system, special abilities, various ammo and damage types, many different resistances, and more!\nThe player has direct control over his character only. You will manage the behavior and tactics of their your henchmen but their specific actions will be guided by the game’s combat AI system, introducing funny and interesting situations into your battles.\nThere are dozens of weapons to be found, many of which can be stripped and upgraded.Enemies and CreaturesThe world of the Dome has from its discovery been a place full of weird creatures and dangerous traps. There’s no telling what lies around the next bend in the road, or inside the twilit cave, or beneath the murky waters of the swamp. But who knows? Perhaps humans are the biggest threat in this bizarre land.\nMaelstrom\n- Impacting the narrative\nMaelstrom dominates everything, its telepathic rage sowing chaos in the minds of everyone trapped under the Dome. But the player, having “freed” the entity, enjoys a special relationship with it. The two of you have regular interactions, and Maelstrom may even grant “wishes” to the player... but be warned: every call for assistance will eventually incur a price.\n- Impacting the gameplay\nMaelstrom’s power grows stronger the closer you move to the heart of the Dome, and that is exactly where you must go to find the answers. There is a special stat influencing interactions with Maelstrom: Psyche. Resistance to Maelstrom’s negative effect can be developed in several ways, and develop it you must before you may venture deeper into the Dome. There is also a special skill branch related to Psychic abilities.Factions\nFollowing the devastating events of Maelstrom’s release, CRONUS splintered into multiple other, often warring, factions. The world has changed while you were in stasis, but has the nature of Man?\nTrapped inside the Dome like spiders in a jar, these factions will show the worst and best of humankind. Will you join them, or strike out on your own?\nEach faction has two unique endings. Likewise, there are two endings for those who choose to go it alone.Justice System\nIf the player chooses to commit crimes against society, he will incur penalties to his reputation, and earn titles ranging from ‘Petty Thief’ to ‘Enemy of the State,’ or even ‘Threat to Humanity.’\nCrime begets punishment. The player may be fined, imprisoned, and even executed. Luckily, there are several ways to deal with your arrest: bribe judges, organize a jailbreak, or return alive from the Labyrinth of Death (this last one may be particularly challenging).Global Map\nThe Dome is huge and for the most part is an open sandbox (if you are able to resist the psychic presence of Maelstrom). The map consists of more than 170 sectors, each carefully planned and handcrafted. There are abandoned bunkers, black caves, the complexes of the Forefathers, as well as wastes, swamps and other biomes.Random EncountersRandom encounters have been a standby of the old-school role playing game since the dawn of the genre. But Encased will bring them to a new level. Each encounter is a separate post-apocalyptic story, not just a bunch of critters attacking you. Want to participate in a game of Russian Roulette? Find a pathway through a deadly anomaly to find a rare relic? Defend an automated rail transport from raiders? Or end up a victim yourself? All this awaits you, in addition to more classic encounters like fighting bandit scum and haggling with caravan traders.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dark Crystal Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":14639,"name":"Secret Of Magia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03a/03a8161e806e6d68108485801097ba84.jpg","description":"Secret of Magia is an action RPG.\nA ruthless tyrant is seizing control of village after village.  Rather than prepare for this threat, your town's elders have decided to ignore it.\nYour story begins as your town is under siege by the tyrant's supernatural soldiers.  As your friends are struck down, you flee into the forest with the few possessions you can carry.  So your journey begins.\nAs you venture out into the world, you'll earn powers and skills.  You'll uncover hidden dungeons that house elementally-charged weapons.  Although you'll start a weakling, with the right combination of skill and luck, you'll return to your village a powerful and confident warrior, ready to take on the ultimate evil.\nExplore a huge world, level up, and gain the strength to free your people from the tyrant's grasp.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Lunatoid","platforms":[{"id":0,"name":"PC"}]},{"id":2923,"name":"Hardware: Rivals","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc2/cc23696a29992979fbc6d1b4f30d2db5.jpg","description":"Hardware: Rivals is an online multiplayer combat game where players perform as vehicles. This is the second edition of the series, the successor of Hardware: Online Arena. \n\n###Gameplay\nThe goal is to win races, survive through attacks, hit other vehicles and complete challenges. The player can either ride Tanks, also known as the Predators, or Fast Attack Vehicles, also known as the Wraiths.\nFAVs are fast and graceful but can’t carry much damage. Tanks are heavy and slow but can survive through lots of hits. There are three maps available: “Blister Lake,” “Quarry” (also known as “Jackson's Pit”) and “Lost Temple.”\nEach one has its challenges. They provide something different to do while the player is riding. For example, a challenge to drive through the underground bunker on Blister Lake as fast as possible; or jump over the temple on The Lost Temple as far as possible. The player can set a score for a challenge at any time during races. If he beats others' scores, he can be offered to challenge friends who also play Hardware. \n\n###Key features\nEach vehicle is equipped with a weapon that never runs out of ammo. The weapon is used to damage or even finish off opponents. Tanks have a shell that carries a heavy thrust but requires accuracy for each shot. FAVs has a turret mounted heavy machine gun that has a wide area of the shooting. The player can find a secondary weapon located around the arenas. These pickups are more powerful than the primary weapons.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":846303,"name":"Cyberpunk 2077: Phantom Liberty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/062/06285b425e61623530c5430f20e5d222.jpg","description":"Phantom Liberty is a new spy-thriller adventure for Cyberpunk 2077. When the orbital shuttle of the President of the New United States of America is shot down over the deadliest district of Night City, there’s only one person who can save her — you. Become V, a cyberpunk for hire, and dive deep into a tangled web of espionage and political intrigue, unraveling a story that connects the highest echelons of power with the brutal world of black-market mercenaries.\n\nInfiltrate Dogtown, a city-within-a-city run by a trigger-happy militia and ruled by a leader with an iron fist. With the help of NUSA sleeper agent Solomon Reed (Idris Elba) and the support of Johnny Silverhand (Keanu Reeves), unravel a web of shattered loyalties and use your every skill to survive in a fractured world of desperate hustlers, shadowy netrunners, and ruthless mercenaries. Built with the power of next-gen hardware in mind, Phantom Liberty offers brand-new gameplay mechanics, nail-biting courier jobs, gigs, and missions — and a thrilling main quest where freedom and loyalty always come at a price.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"CD PROJEKT RED","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":304320,"name":"Cat Quest II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cf5/cf58028a7a0b3415678d1b6aa94ee66e.jpg","description":"CAT QUEST II is a 2D open-world action-RPG set in a fantasy realm of cats and dogs. Under threat from a continuing war between the cats of Felingard and the advancing dogs of the Lupus Empire, CAT QUEST II tells the tail of two kings, brought together against their will, on a journey of paw-some discovery to reclaim their thrones.\nPlay as both a cat and dog as you explore their kingdoms solo or with a friend! Quest in a world filled with magic, curious monsters, and go on a catventure like never before!\nFollowing the success of the acclaimed CAT QUEST, developers The Gentlebros return to the world of Felingard to expand on the original with more explosive spells, expanded weapon options, an exciting new character switch mechanic, and local co-op!Features- Brand new story set in the world of Felingard - and beyond!\n- All new switch and co-op gameplay. Play as both cat and dog, either alone or with a friend!\n- New weapons types – Master swords, staves and more to become a fur-midable fighter!\n- More spells bring even more furry judgement to your foes.\n- New passive abilities, whose attributes can be mixed and combined for endless paw-sibilities!\n- Exciting, and varied dungeons filled with new traps and obstacles, making every pounce into the unknown a fresh experience!\n- Em-bark on a litany of side quests, each telling its own story and expanding the lore and universe of CAT QUEST!\nGo on the ultimutt catventure today!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"The Gentlebros","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":297287,"name":"Townsmen - A Kingdom Rebuilt","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0eb/0eb5d7425d47ef44a98f72886f5dc7a1.jpg","description":"Welcome, your Highness! A vast land awaits your settlers and is ready to be colonized. Send your architects and builders to plan and construct a city. But also send your craftsmen, to cut some wood and to mine ore. Make sure your fields are on fertile grounds, to get all the food for your hungry subjects! Townsmen – A Kingdom Rebuilt hands the crown to you: Guide your people from their first steps in a small village to a massive medieval metropolis with thousands of inhabitants.\nOvercome the challenges that lie ahead. Your citizens have various needs in order to stay happy. And you have to keep them happy, to keep the tax coins rolling which you need to build even more. Beware, as there are many things in the world that will disturb the happiness: Seasons will change the demand for certain goods – more water is needed during summer, more clothes in winter. Catastrophes may hit your prospering city, the plague, a large fire or an avalanche won’t make anyone happy nor will a bandit attack!\nA huge variety of houses to build and many different jobs for your subjects will keep you busy. The armory will produce weapons for your soldiers, to keep your citizens save from bandits. The bakery or the butcher’s workshop will provide food, the monastery, the juice manufacture and the vineyard will bring the drinks – and everything can be bought at the marketplace! Make sure to have an eye on the daily routines of your people – besides jobs & food, they also need a place for recreation like a park, houses to live and entertainment in the jousting grounds or the tavern!\nEach of your deeds is meaningful: If you order your folks to build a house, if you send them to a new job – everything will reward you with experience points. This progression system will allow you to research techniques that for example increase the amount of taxes you get or make your watchtowers more efficient. In every map you play!\nFEATURES\nCity-building gameplay set in medieval times\nComplex economy sim and deep production chains\nOver 150 different town- and production buildings\nSeasons and weather effects that influence gameplay\nCitizens have their own daily routines with different demands\nThe overarching “town level” brings player progression for every single deed – you’ll be a better sovereign each time you play the game\nDevastating disasters like fire, the Plague, drought and many more\n26 diverse scenarios and challenging tasks\nUnrestricted endless mode on 24 maps\nOptional military feature with soldiers and bandits\nNew townie language for livelier interactions","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Handy Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":59883,"name":"Temtem","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/439/439a0559c2519c12632b7a633d6eda6e.jpg","description":"Join our Discord\nAbout the Game\nEvery kid dreams about becoming a Temtem tamer; exploring the six islands of the Airborne Archipelago, discovering new species, and making good friends along the way.  Now it’s your turn to embark on an epic adventure and make those dreams come true.\nCatch new Temtem on Omninesia’s floating islands, battle other tamers on the sandy beaches of Deniz or trade with your friends in Tucma’s ash-covered fields. Defeat the ever-annoying Clan Belsoto and end its plot to rule over the Archipelago, beat all eight Dojo Leaders, and become the ultimate Temtem tamer!\nThese are the floating islands where Temtem and humans coexist peacefully. Each island is a whole different world, but there is something we all have in common – our love for Temtem and Temtem fighting! Intrepid tamers like yourself travel on airships to the furthest reaches of the Archipelago to find the best Temtem. Every young tamer dreams of becoming the best…\nBut not everything is fun and peace in the islands. Behind the scenes, Clan Belsoto is weaving a dastardly conspiracy against Temtem and humans alike. You will need all the friends and your best Temtem to defeat the wicked Clan Belsoto.\nStory Campaign: Journey across six vivid islands and embark on the adventure of becoming a Temtem tamer while fighting against the evil Clan Belsoto.\nOnline World: The days of traveling solo are over; in Temtem the world is a massively multiplayer one. Tamers from around the world can join and you will be able to see them around you, living the adventure with you and fighting to become the best Temtem tamer.\nCo-Op Adventure: You will be able to join forces with a friend any time and work together towards your next goal. Catch new Temtem, complete a Route, or face off against a Temtem Leader; all while fighting alongside your friend in dual battles!\nHousing: Buy your own house at Atoll Row and decorate it your way. Buy new furniture, color your walls and you’ll be ready to invite your friends over!\nCustomize: Customize your character to stand out from the crowd and get new cosmetics while you battle other tamers. Pick a silly hat, a comfy sweatshirt, some pants and you’re ready to go! Or maybe you prefer to wear a full-on cosplay of your favorite Temtem?\nCompetitive: Start by choosing 10 Temtem and the pick and ban phase will begin. Take turns with your rival to pick your Temtem and ban theirs. When all the decisions are made and the turns are ended, you will end up with a squad of 4 Temtem and the battle will begin.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Crema","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":58896,"name":"Might and Magic Clash of Heroes","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d46/d460c5c8a9e417ef302ebbc0bb946b26.jpg","description":"Might & Magic: Clash of Heroes is a spin-off installment of the Might & Magic fantasy franchise. It is a part of Ubisoft reboot of the series that features the new setting, Ashan, albeit similar to the original Enroth.\n\n###Plot\nClash of Heroes takes place in the medieval high fantasy world. It is set 40 years before the events depicted in Heroes of Might and Magic V. The game follows five heroes. Two of them already featured in HoM&M V (Godric the knight and Anwen the elf), while three others are original (Aidan, who commands demons, a wizard Nadia and a necromancer Fiona). They oppose the demon lord who is searching for an artifact called Blade of Binding. He is going to use it to open the portal into his demon world and unleash his armies on Ashan.\n\n###Gameplay\nIn the campaign mode, the player assumes the role of one hero of his or her choice. Each hero represents one of the five traditional HoM&M factions (humans, elves, demons, wizards, and the undead) and has his or her unique roster of units. Heroes navigate the map in real-time, but the battles are turn-based. Like in HoM&M games, the heroes command their armies rather than fight on their own. The combat system, however, changed dramatically. In Clash of Heroes, it resembles a puzzle game of colored columns and rows. \n\n###Multiplayer\nThere are both local and online multiplayer modes that allow two players to compete against each other, to cooperate against AI or the other team of two players.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo DS"}]},{"id":16503,"name":"Narcissu 1st & 2nd","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/75c/75cb9dd6da4a386087c6a968189800b8.jpg","description":"... on that blindingly bright day ...\n... on that very day of winter ...\nThis is a story of disease and suffering; of medication and adverse effects; of thoracotomy scars and cellular poisons; of the living who cannot help but to die and of the dying who cannot help but to live; of a resting place other than \"on 7F\" or \"at home\".\nThis is a story of so many things.\nBut most of all ...\nThis is the story\nof a girl whose heart was standing still\nand a boy whose breath was being stolen away,\nboth of whom die.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"stage-nana","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14473,"name":"World War II: Panzer Claws","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/578/578c4b9dfa70d564c59636a7a875b489.jpg","description":"WORLD WAR II: PANZER CLAWS [aka Frontline Attack: War over Europe] pushes back the boundaries of real-time strategy gaming!\nTake control of the Allied, German, or the Russian in the harsh reality of the battlefields of World War II. At your disposal are a vast number of vehicles and tanks, as well as ground troops and the ability to call in air forces when needed. All these elements must be used in order to obtain the ultimate prize: Victory!\nPANZER CLAWS II: In 1940, France fell beneath the dark tide of war. During the early days of the occupation, the French government capitulated, and formed a collaborationist state. While the country was under enemy control, resistance fighters took to the hills, and back alleys. These brave souls began mobilizing for a fight against their occupiers, and mis-directed government officials.\nPanzer Claws II offer the player the choice between one of the four sides in the conflicts: the Germans, the Russians or the Allies and the French Resistance.\nIncludes both parts: Panzer Claws I + II!FEATURES:3D maps enhance the gameplay experience\nFour campaigns with over 40 missions on the four sides in the conflicts: the Germans, the Russians or the Allies and the French Resistance.\nTrue to history, the campaign missions take place in various seasons of the year, greatly affecting your strategies\nTrue real-time: night and day will occur during your missions, changing light and visibility\n15 extra missions to play in Skirmish mode, 8-player Multiplayer over LAN and EarthNet™\nThe easy-to-use editor allows you to create your own missions to play single-player or multiplayer","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":11484,"name":"Wolcen: Lords of Mayhem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cee/cee0477e050dbed92db8a87fec52331b.jpg","description":"An Open World action-RPG in a corrupted world falling apart, beautifully rendered thanks to CryEngine technology.\nWolcen: Lords of Mayhem features a dynamic, fast-paced combat system with weapon-based combos and charged attacks. Dodge, Dash, Hack, Slash and unleash devastating spells on your enemies !\nThe game has no class restriction and uses a Resource Opposition System that adapts to any play-style.\nCo-op will be added, and players will be able to combine spells to create chain reactions, in order to overcome greater challenges.\nThere is a unique mechanic called Apocalyptic Form that allows players to shape shift into a highly customized character! You’re free to mold your character thanks to a deep and rich customization system. And thanks to our complex crafting mini-game and our housing module you will be able to make your adventure feel as YOUR adventure!\nYou are a former officer of army of the Human Republic, forced to flee the death penalty because of the magic powers you have unwillingly developed. Being tracked down by humans and hunted by the monsters of the Wild, you are recruited by a mysterious group of Templars. And thus an epic adventure begins in which you will wander the world to fight inhuman, mutated monsters and discover the terrible secret of the extinguishing mankind.\nKey features:\n* Under development and will be added to the game during the early access\nDynamic combat system: fast-paced combat system with weapon-based combos and charged attacks. Dodge, Dash, Hack, Slash and unleash devastating spells on your enemies !\nOpen World: Discover the world and enjoy it at your own convenience\nExploration and experimentation is rewarded with new powers, attributed according to your play style!\nFree character development - No class limitation. You have three resources: Rage and Umbra interact with each other, thanks to the Resource Opposition System, in order to balance gameplay.\nRotating Passive Skills Tree: A deep and innovative way to taylor your play style !\nCustom player: choose your gender and customize your player, skin color, hair, beard, eyes etc.\nRandomly Generated Dungeons for infinite replayability\nElement-based spells will react to the environment and to other active elements in the area. For example, lightning will spread in water and stun targets; Fire will spread unless water or frost gets in the way, ect.\nMultiplayer mode*: Dungeon Challenge and Co-Op\nApocalyptic Form*: According to your play style, you will develop special powers for your character, changing their abilities and look. Fierce melee warriors may gain a third arm to equip with a new weapon; a fire caster will have their skin turn into lava, healing from fire. Even wings and horns might appear depending on your actions!\nTons of Loot: Weapons, Armor, Potions and randomly generated magic effects for more gameplay diversity!\nAsymetric Armor System: We love asymmetric armor, and we want you to be able to customize your gear down to the finest details! You will be able to equip different shoulders and arm protection on the left and right side of your character, bringing a great number of personalization options!\nHousing: Create your own house and proudly showcase your special gear!\nRotatable and customizable Camera: Have a new point of view, choose the best angle and discover hidden details.\nDungeon challenge*: Transform a special part of your house into a dungeon and challenge other players to survive the onslaught!\nTime of day cycle with dynamic weather: You must adapt to the time of day. Some quests will only be achievable a certain hours, while the night is full of dangers. The rain will make your electrical powers more efficient.\nMature story full of secrets to discover exploring the world.\nKythera AI system: The automatic real time navigation adaptation of Kythera adapts to any change in the physics of the world, allowing us to create exciting scenes including large portion of levels collapsing or moving and fighting on the back of giant creature*, creating never seen before gameplay situations!\nSemi procedural Weaponry*: Blades, pommel and guard details can be randomized for more unique gear in the game!\nAdvanced Crafting mini-game*: Build your own weapons and armors thanks to a complex and challenging module in Wolcen: Lords of Mayhem","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"WOLCEN Studio","platforms":[{"id":0,"name":"PC"}]},{"id":861287,"name":"Need for Speed Unbound","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d7b/d7b45d416ca18bf86f9f1638ee331efa.jpg","description":"The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore's ultimate street racing challenge. Across 4 intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, and make your mark on the street racing scene while outdriving and outsmarting the cops. Pack your garage with precision-tuned, custom rides and light up the streets with your unique style, exclusive fits, and a vibrant global soundtrack led by A$AP Rocky and AWGE that bumps in every corner of the world. Express yourself to the fullest with the freshest new art styles and signature tags that represent what you're all about. With separate single- and multiplayer campaigns, this latest edition in the Need for Speed franchise from Criterion Games™ delivers hours of electric, adrenaline-pumping action.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Criterion Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":27036,"name":"Super Mario Galaxy 2","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4e9/4e928ff4b4e3c3f5acfda38b98a4cf65.jpg","description":"Mario is invited to Princess Peach's castle, and on his way notices a\nstrange light in the grass. As he peers cautiously through the reeds, he\nsees a small, lost Luma. With the baby Luma tucked safely under his cap,\nMario rushes on to the castle. But when he gets there, something\nunexpected is waiting for him...\n\nCollect stars as Mario travels from galaxy to galaxy, working through\nvarious levels—sometimes upside-down, sometimes floating from place to\nplace. Mario can also team up with his dinosaur buddy Yoshi, who adds a\nnumber of possibilities to the gravity-defying gameplay. Power-ups for\nMario and Yoshi will give them new abilities to help platform to\nunreachable areas, or defeat strong enemies. Skilled players will want\nto collect Comet Metals to unlock harder levels with even more\nchallenges. Play solo or partner up with a friend or family member as\nyou prepare for liftoff and discovery!\n\nPlease note that this game does not include Miiverse support.\n\nThe following controllers are required to play this game: Wii Remote +\nNunchuck.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Wii U"}]},{"id":371847,"name":"River City Girls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d8/7d8adae704e3c6c49e2ebbbf563422fe.jpg","description":"There's trouble once again on the mean streets of River City, but this time the boys are in over their heads! In this all-new entry in the legendary beat-'em-up series, hot-blooded heroes Kuni and Riki have been captured, leaving it to their hard-hitting girlfriends, Kyoko and Misako, to serve up some payback. As you punch and kick your way across town - either solo or with a friend in local co-op - you'll gain new skills, chow down on power-ups, wield an assortment of weapons, and unleash an arsenal of combos, throws, and special attacks that will leave the bad guys crying for mama - all in outrageous 16-bit style! The awesome action is punctuated by manga story panels, anime cutscenes, and an epic synth-pop soundtrack. It’s an old-school rumble for a new generation!\nKey Features:\n• Wild beat-'em-up action for 1 or 2 players!\n• Glorious anime and manga cutscenes!\n• Rockin’ synth-pop soundtrack!\n• Six large areas of the city to explore and fight in!\n• Loads of weapons and abilities!\n1-2 players\n5GB minimum save size\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nRiver City Girls, Kunio-Kun, Double Dragon, and all related characters, names locations, and assets are Copyright © 2019 by ARC System Works Co, Ltd. © 2019 WayForward Technologies.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":366110,"name":"First Class Trouble","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/510/51044509a3c55f107763f0593a89cb22.jpg","description":"First Class Trouble is an asymmetrical third person multiplayer co-operative game, about trust and deceit.\nWith First Class Trouble we want to invoke a super strong social experience, filled with trust and deception. Players are working together, but a few players are not who they seem and are actively working against you. With First Class Trouble we want to create situations where you can never fully trust your companions, but you will have to trust someone in order to progress through the game. This means that you constantly have to look over your shoulder, uncover information on players and in the end, you will have to figure out who the Synth players are to win the game. We aim to create a rich playground of possibilities fueled by social interactions with other players. This will result in a new player experience each time you press “find a game”.\nThe plot\nWe are on board the Alithea, a massive 2 km long space cruise ship, set for Proxima Centauri. Owned by the prominent Scandinavian Infinity Cruises, it is the most prestigious space project ever undertaken; a merger of wealth, power, and business in a newly technological world gone wild. Packed with all the latest tech, Alithea is also equipped with the latest in AI servants - Personoids. There had been some problem with maintaining the Personoids emotional state, but it had been solved before departure. The solutions were simply to reboot all the synths every 24 hours. But something failed – of course. Someone, or rather something in the system, didn’t reboot. Things spiraled out of control aboard the Alithea. Now it’s passing Jupiter at 1/8 the speed of light, with a robot rebellion. C.A.I.N. has already tried to eliminate all the passengers by turning the oxygen off, and only a couple of travelers with Oxygen Rebreathers are left - trying to escape. Luckily the Personoids, were purposely designed to be weaker than humans - because they are searching the ship for the last remaining humans. Hiding among them. Ready to finally ‘reset’ them for once.\nFirst Class Trouble varies from other titles with its engaging mix of cooperation and deception, using an in-depth proximity-based voice system, where players can communicate only when close to each other. It is through these close social interactions that intense and fun situations will arise.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Invisible Walls ApS","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":37751,"name":"Titan Quest: Immortal Throne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/02d/02d70f4bacfa1f03fbd1c5896a963084.jpg","description":"This expansion pack concludes the plot of the original Titan Quest with the fourth act that leads the player into Hades, the Greek underworld of the dead. Immortal Throne is not standalone and requires the original to be installed (unlike Titan Quest Gold, which contains both), and the main quest should be completed to reach Hades. \nThe game is a sword-and-sorcery fantasy set in Ancient Greece and strongly inspired by Greco-Roman mythology. The plot continues the story of the player’s character as a champion of mankind who fights against the evil titans. Due to his or her victories, the supreme god Zeus proclaimed that humanity is strong enough and Olympians don’t have to protect it anymore. \nGameplay in Immortal Throne is similar to any other hack and slash game with the point-and-click interface. Compared to the original, Immortal Throne introduces several new items and a new skill called Dream Mastery that allows the player to make enemies fight each other using illusions, or hypnotize them to sleep. All improvements can be used from the beginning of the game, not only in the missions from the expansion. There’s also a new multiplayer option that allows player-vs-player team-based deathmatches.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Iron Lore Studios","platforms":[{"id":0,"name":"PC"}]},{"id":59059,"name":"Override: Mech City Brawl","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df8/df8abfb2e160188f6462bc694fdbec9a.jpg","description":"Super Charged Mega EditionSuper Charged Mega Edition includes Season Pass, delivering 4 extra mechs and 16 new skins post-launch, as well as instant access to 12 legendary skins normally unlocked in the Standard Edition.\nAbout the GameNo gears, no glory! Control gigantic fighting robots and duke it out across fantastic cityscapes in this 3D mech-based brawler! Epic and explosive battles await with anime-inspired mechs in local and online versus game modes, party co-op with two to four players, and a single-player campaign.\nPilot a diverse roster of epic, skyscraper-sized mechs, each with their own play style, special moves, and finishers. Tower over your opponents and lay waste to entire cities underfoot. Destroy 3D arenas modeled after actual cities and countries, including Tokyo, Egypt, San Francisco, and Mexico. Challenge other players, gathering two to four friends to engage in dynamic co-op gameplay where each player is responsible for one part of a towering mech! Customize your mechs in the Garage, changing their accessories and skins to create your own unique style!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Modus Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":21097,"name":"Normality","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f7/8f7c2c06c592b6a3128d22c0e452fe88.jpg","description":"A sinister force now controls the city of Neutropolis. A once-thriving city full of beauty and light, Neutropolis has been reduced to a a stagnant pit of apathy. As Kent Knutson, a shameless dreamer and one of Neutropolis' most awkward citizens, you have been imprisoned for a week and are now under home arrest for that most sinister of crimes: whistling in public. You must get out of your home and explore the vast city of Neutropolis and solve the riddle of a nation’s apathy. Point and click with the unique voodoo doll interface and be rewarded by motion capture sequences as you gather clues and solve puzzles. Chuckle at the bizarre plot and chew carpet while your brain wraps itself around puzzles that are greater than the sum of their parts. If you manage to understand the mystery that shrouds Neutropolis, you're only halfway there...\nWhy is the city so controlled? Why does the most successful company in town make furniture? Why can't penguins fly? Who is Brian Deluge? How can you solve the riddle of the mystery of the clue of the puzzle that shrouds Neutropolis?Features:Explore the incredibly detailed city of Neutropolis that is anything but a normal place\nAmble freely through unique and surreal locations made with impressive attention to detail\nChallenging puzzles with multiple and sometimes twisted and bizarre, solutions","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Gremlin Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":249994,"name":"Reventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/152/152d5ca2f4a9e05d82a65856529749be.jpg","description":"An adventure with 100 different endings\nYou are a wannabe hero who is supposed to do hero-ish things but sometimes blows that off and does crazy stuff instead.\nFeatures:\nOne hundred different endings\nChoose your path, every decision leads to a new ending.\nWill you find the real one? Is there such a thing?\nOnly one way to know...\nLots of \"Aha!\" moments\nThe world doesn't change with each new game, you do.\nWell, actually it DOES change, but that's a secret for you to find out.\nA big bunch of unlockable stuff\nNew playable characters, hints, costumes, visual effects and more!\nBazillions of secrets and pop-culture references\nThey are, you know, secrets. So we won't spoil them here ;)\nMagic\nEven a simple-looking-yet-amazing game like this takes a lot of time and big piles of money to make, but you can get it for only a few bucks.\nHow's that for magic?\nTime travel, battle royale fights, mimics, permadeath, shotguns, mining, resource gathering, base building, global leaderboards, farming...\nOk, we may have had exaggerated on that one...\nOR HAVE WE???\nHumor\nYup, there's that too.\nAvailable in many flavours.\nA beautiful OST\nDon't believe us? Listen to it here.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Pixelatto","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":1480,"name":"JumpJet Rex","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dbb/dbbedafecf59e1f1f19464f0d2033eba.jpg","description":"Retro Platformer Flare\nJumpJet Rex features beautiful hand-drawn 16-bit graphics and classic chiptune music that transfers dino lovers back to the 2-D glory days of the early 90’s.\nSecrets and Collectibles\nWith dozens of items stashed across the Galaxy, and many secret areas to discover, JumpJet Rex offers plenty to do for the treasure hunters in the house!\nReplayability\nWith a time challenge twist, players can replay every level multiple times to prove their platforming prowess. Download ghosts to race against the best players in the world, or compete directly with your friends to see who can post the best times!\nKiller Old School Gameplay\nRemember when platformers were so tough that people would hurt their hands playing, but feel amazing after getting past a level? Relive those moments with JumpJet Rex’s strenuous platforming challenges and retro boss battles.\nCo-op Mode\nSaving all of dinokind from a giant asteroid barreling down on Earth is a pretty tall task for a T-Rex with tiny arms, so players can team up with a friend to take on challenges. Teammates must coordinate efforts in order to avoid mass obliteration.\nCustomization and Upgrades\nNo two T-Rex’s are alike and fans will be able to customize their character and upgrade their appearance with the loot they collect on their travels.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"LOOT™ Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":367176,"name":"MO:Astray","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eca/eca5a3a8061951cbca3c38141448637e_3wfi7Pu.jpg","description":"Game CharacteristicsNever before seen movements and abilities including sticking, ramming, parasitic takeover and even memory recall are used to further open up the story!\nWith a meticulous pixelated style and super-smooth movements, the game is set in a full-on otherworldly, science fiction atmosphere with stunning, life-like sound effects and music.\nOn the verge of death, players will need to use their minds to the fullest to find a way out. Wait, observe, plan out your path, and use your special abilities wisely.\nDon't think you can easily bully this jelly-like organism! In this sinister environment, using him to the fullest will be your greatest advantage.\nCollect key materials to unlock more storylines and piece together what is really going on...\nStick: Utilize the character's special trait to clear all the tricky traps\nSkill: Use your enemies to dodge attacks\nChallenge: Exciting Boss battles\nJump: Feel the sense of speed as you dash through the air\nChange: A control experience that changes according to the levelBackground StoryThrough the moist, pitch-black darkness the eerie sounds of giant machinery can be heard. In an advanced facility that has been invaded by otherworldly beasts and local inhabitants, the fully-automatic system controlled by the main computer is still operating like a mad man. Awakening inside an abandoned laboratory, the green, ambiguous lifeform MO discovers that it not only has to face an extremely hostile and sinister environment, but it also must face humans who, having been taken over by alien parasitic plants, are now stuck in the endless limbo between death and rebirth. What's more, there seems to be an eerie presence that's watching all of this from the shadows.  After groping around for clues, MO gradually becomes aware that it is responsible for a mission of immense importance. Under the guidance of the mysterious mutterings in its ear, MO is able to overcome one obstacle after another.\nWho caused this disaster? And on this path that leads to answers for every unsolved riddle, what sorts of trials and tribulations lie ahead?","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Rayark International","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":292843,"name":"Astral Chain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/75b/75b91d05160c819fa6bbafe920548300.jpg","description":"As part of a police special task force, it’s up to you to fight against mysterious, alien-like creatures who have invaded the world.\r\n\r\nIn the Ark, a multi-cultural city in the near future, disaster strikes when gates to another dimension suddenly appear! Dangerous creatures begin to emerge, attacking the people and polluting the land, and normal police forces are unable to compete with them. To stand up against these threats, a brand new, special police unit known as Neuron is formed.\r\n\r\nChoose between two playable characters – one male, one female – on your adventure. The character you don’t choose also appears as your younger twin, and a fellow member of Neuron.\r\n\r\nIn order to resist the creatures, humanity developed a special weapon: the Legion. The Legion acts as your partner, and helps with your investigations. However, it’s in battle where the Legion shows its real ability...\r\n\r\nWork together with the Legion and use all sorts of combat styles to fight your enemies. You could both attack the same enemy simultaneously, target different opponents, or send your Legion on the offensive while you support it with items. Use this synergetic action system to battle and explore together!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Platinum Games","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":58312,"name":"Distraint: Deluxe Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0c1/0c16bebacd247eadfe767ace1823f21d.jpg","description":"THE GAME\n_______________________________________________________\nDISTRAINT is a 2D psychological horror adventure game.\nYou step into the shoes of an ambitious young man named Price.\nIn order to secure a partnership in a famous company, Price seizes the property of an elderly woman.\nIn that very moment, he finds out the price of his humanity.\nThis is his story and the tale of his regrets...\n\n\nFEATURES\n_______________________________________________________\nDISTRAINT is a horror-novel style of game. It is dark and grim but also has its share of dark humor.\nThe story progresses quickly which allows for several settings and scenarios.\nYour journey will last around two hours!\nThe gameplay is simple but effective: You move left and right and solve puzzles to progress through the atmospheric story.\n• Side scrolling 2D with unique, hand drawn graphics\n• Atmospheric music and sound design\n• Minimalist interface so your focus never wavers from the experience\n• Delve into a unique story full of intriguing twists\n• One man effort - No asset flips or cheap tricks, just hard work!\n\nDELUXE\n_______________________________________________________\nDISTRAINT has been doing quite well thanks to the awesome community!\nDeluxe Edition is my thanks to you. Take a look at what's new:\n• Dynamic coloring - Goodbye gray, hello color!\n• Enhanced animation, graphics, and lighting effects\n• Refined audio for better atmosphere\n• Improved user interface","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Jesse Makkonen","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":57918,"name":"Harry Potter and the Sorcerer's Stone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fd6/fd6e2692bd4eeb470bccbf282155839b.jpg","description":"Harry Potter and the Philosopher's Stone (known as Harry Potter and the Sorcerer's Stone in the United States) is an action-adventure with platformer elements video game, developed by KnowWonder, Warthog, Griptonite, Argonaut, Eurocom and Westlake Interactive and published by Electronic Arts. It is based on J.K Rowling's novel of the same name and the film adaptation. Philosopher's Stone was initially developed for the PlayStation, Microsoft Windows, Game Boy Color, Game Boy Advance and Mac OS X in November 2001, and was re-made two years later for the PlayStation 2, Xbox and Nintendo GameCube in December 2003.\r\nThe story follows protagonist Harry Potter, who discovers he is a wizard, and is sent to Hogwarts School of Witchcraft and Wizardry where he makes friends and receives magical training, and along with his friends stop Lord Voldemort from returning to power. The game received mixed reviews. Critics commented on the game's accessible gameplay and its unimpressive graphics (2003 versions) while others said the game's license would be the only thing to draw in fans.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Eurocom","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 2"}]},{"id":18540,"name":"Hexcells Plus","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e75/e75d63f8b2fd11f80acad712c81f6a02.jpg","description":"Hexcells Plus is a standalone expansion to Hexcells that contains 36 new and more challenging puzzles.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Matthew Brown","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12201,"name":"Grimoire: Manastorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/352/3525d893fb0ab1a703bbebe6ba6fc54c.jpg","description":"Join our community!Grimoire is a game developed by a small indie team on a shoestring budget and because of that we rely on help from our players with bug reporting and feedback. Join our Discord or Forums for insider updates, Q&A, and twice weekly playtests with Devs on Wed @ 9 PM EST and Sat @ 6 PM EST! If you have ever wanted to help shape some awesome multiplayer combat now is your chance and we would love to hear what you think about the game and what we can do better!\nFree-To-PlayGrimoire’s Free-To-Play system is based around its classes, 2 of those classes and all of the game’s other features including game modes, spells, and maps are available for free to all Steam users. The 2 free classes will change every few weeks. The only paid content is the game’s classes which can also be unlocked using Arcane Points earned by playing Multiplayer. There are no Pay-To-Win items.\nAll free users start with access to two classes and can access more classes in four ways:\n1. Unlocking with 3000 Arcane Points.\n2. By purchasing individual class DLCs through Steam for $2.99 (Prices different for some regions).\n3. Purchasing a bundle of all 6 class DLCs through Steam for 25% off.\n4. Waiting a few weeks until the 2 free classes change.\nIn addition to unlocking classes, Arcane Points are also used to unlock new spells for each class. Arcane Points are awarded at the END of every Multiplayer game on an Official server. Players earn these points for minutes played, being the MVP (top points), and for winning or losing.\nWhat about people who already bought the game?\nAll Pre-F2P Early Access players have automatically received all class DLCs and a hidden Ultimate Pack so that they will also get any future classes for free. We very much appreciate the support of everyone who bought the game but the change to F2P is necessary for them to have people to play against.\nMore FAQ available at our website.\nFeature ListThese are the features currently available in the live build. There are many more planned which may be added depending on community interest and budget.\nArcane Points and Free-To-Play System. Earn points after each Multiplayer game and use them to unlock new spells and classes.\n2 Multiplayer game modes: Conquest and FFA.\n6 wizard classes each with 4 unique spell slots and 1 unique passive ability.\nCustomizable class system with 48 new spells - Mix and match each class’s 4 spell slots with 8 new spells to fit your personal playstyle.\nFurther customize each class with 8 inventive mobility and utility spells that range from teleportation to summoning unbreakable walls.\nSurvival - a simple single player wave survival game mode with 2 difficulty levels.\n12 fantasy-inspired maps including medieval cities, dark caverns, and towering cliffs.\nAbout the GameGrimoire: Manastorm is a multiplayer class based PC shooter where powerful wizards fight a war for territory and prestige. In Grimoire the standard ammo-counts, guns, and headshots have been replaced by magic, spells, and genre-blending mechanics. Inspired by popular games like Team Fortress 2 and Unreal Tournament, Grimoire is a fast-paced magic fueled experience set in a medieval fantasy world created by a small but passionate indie team.Gameplay\nChoose from six wizard classes and wield four primary spells in deadly magical battles, unlock eight more spells to customize each class to your specific playstyle. Then pick two additional abilities from a shared pool of spells that range from teleportation to a powerful kinetic blast that sends foes flying. Mix in passive abilities that increase your tactical options and you have a recipe for combat befitting a student of the Arcane Arts.\nMany spells are inspired by our favorite MOBA games like DOTA 2 and League of Legends. Grimoire's FPS spin on these strategic spells creates fast paced tactical combat unlike anything you've played before. Grimoire is not a game of instant damage and unavoidable death. Every spell has a counter… if you’re ready for it!Game Modes\nConquest - Magnus and Validus battle over control of key sources of magical energy known as ley-lines. The longer the ley-lines are held the more energy is gained including a large influx of power if one house can manage to take total control of an area. Destructible objects can reveal new territory or bring the environment crashing down on your enemies. Inspired by games like Day of Defeat, the Battlefield series, and Team Fortress 2; Conquest is a territorial battle that features large (8v8) teams.\nFree-For-All (Deathmatch) - Chaos reigns supreme in this fight to the death. This classic game mode is a great way to try out the game without worrying about objectives.\nSurvival (Singleplayer) - The people of Orinfell are under attack! Hold off waves of undead fighters, mages, and golems as the survivors escape through the city's catacombs. This game mode is great for testing out new spells and learning the basics of the game.The WorldTwo Families Fight for the Fate of a World\nThe northern land of Futhark is home to two great houses locked in a bitter struggle. As ruin rises from the south, each vies for the Grimoire, a powerful artifact of a lost age. It was the Grimoire that ushered in the Dawn of Magic, called forth the destruction of an empire, and which now heralds civil war.\nHonorable House Magnus clings to their charge of sealing the book’s secrets, willing to sacrifice Futhark if only to save the world from the horrors held in the Grimoire’s binding. Ambitious House Validus has little time for craven hearts and strives to brave the tome’s power to save the republic and lead it into a golden age who’s like has never been before seen. Yet the Grimoire is no idle prize to be fought for. That dusty tome has begun to glow, welcoming their dissent even as it spreads its pages, unleashing the Mana Storm in the battle to come.\nWar approaches.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Omniconnection","platforms":[{"id":0,"name":"PC"}]},{"id":3822,"name":"Escape Plan","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/183/183bd193be11348ef8467569dd90a383.jpg","description":"The award-winning survival-humor game for the PS Vita system is now available for the PS4™ system!Help hapless heroes Lil and Laarg interact with unique and twisted puzzles of each room. Only you can help them survive before their captor and nemesis, Bakuki, recycles them and turns them into his minions. Access 78 puzzle rooms and also receive access to Bakuki's Lair, featuring an additional 19 rooms. Caged among the chaos of Bakuki's Lair, Lil and Laarg are doomed without your help. Guide Lil and Laarg to safety by dashing past sausages blasted at your face, skipping over scalding hot cheese and avoiding a bevy of confusing death traps.\nFor one price, get Escape Plan™ on PS4™ and PlayStation®Vita systems. Purchase it on your PS4™ system and it will automatically appear for download on your PS Vita system at no additional cost.\nPlease Re-enter Text Here\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.sonyenteretainmentnetwork.com/terms-of-service). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2012 Sony Computer Entertainment America. Escape Plan is a trademark of Sony Computer Entertainment America LLC","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":704730,"name":"Blue Fire: Void Maker","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0f/d0f3e325366eeb8912b0f8752ed97606.jpg","description":"Create, Play and Share the Voids of Your Wildest DreamsBlue Fire's 3D action-adventure platforming keeps growing in the new Blue Fire: Void Maker!\nBut this time, it's all up to you. Discover the Void Maker, a full fledged 3D platforming level creator flooded with tools, assets, and so many options that open up a world of endless possibilities. Connect with other players, share your creations, browse, search and filter through the many levels to play the wildest Voids you could ever imagine!\n.Features:\nVoid Maker\nUse a vast number of tools and assets to unleash your creativity and make all sorts of interesting and original 3D platforming levels!\nShare your Creations\nShare your Voids, gather feedback and perfect them. Challenge your friends, rivals and the community to defeat your Void!\nProve your worth\nSearch, filter and choose from community-made Voids and prove your strength by mastering the best, most interesting and most challenging Voids made by others.\nThink outside the Void\nThe wide arsenal of tools, assets, visual, gameplay modes and options will allow you to create unique and very original ideas that expand outside of the core Blue Fire gameplay!\nHardcore Platforming\nLeap through deadly traps and master movement to navigate gradually demanding platforming challenges.\nCompletely FREE no strings attached\nWe love our community and want it to grow, so we've decided to release Void Maker completely FREE!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"ROBI Studios","platforms":[{"id":0,"name":"PC"}]},{"id":45691,"name":"Spintires: MudRunner","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/539/539f9d37b6b2ce4d4472bcb8c382207b.jpg","description":"/!\\ Spintires owners get a 50% off loyalty discount on top of the preorder offer /!\\\nSpintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme landscapes with only a map and compass as guides!\nA huge upgrade over its predecessor, this edition comes complete with a brand new Sandbox Map joining  alongside the original game's  5, a total graphical overhaul, a new Challenge mode with 9 new dedicated maps, 13 new vehicles and other comprehensive improvements. It’s not just an enhanced edition, it’s the ultimate off-road simulation experience!\nDrive 19 powerful all-terrain vehicles, each with its own characteristics and attachable equipment. Complete your objectives and deliveries by enduring perilous conditions across wild, untamed landscapes in extreme conditions with dynamic day-night cycles. Explore an immersive sandbox environment, enhanced by improved graphics. Overcome muddy terrain, raging rivers and other obstacles that all realistically react to the weight and movement of your vehicle powered by the game's advanced physics engine.\nWith your map, compass, winch, and your driving skills as allies, go solo or join up to three others in the coop multiplayer. Download mods created by the passionate community for truck-loads of content and an ever-evolving Spintires: MudRunner experience.\nThe ultimate version of the million-selling game Spintires\nA wider selection of 19 incredible all-terrain vehicles\nExplore an immense, untamed Siberian sandbox environment\nOverhauled graphics and advanced physics engine for extreme realism\nComplete perilous objectives and deliveries in extreme conditions\nNew game mode for a greater challenger available for solo and 4 player-coop\nDownload mods for an ever-evolving experience","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Saber Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":9651,"name":"Domina","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/18d/18d60c941138da3bce899fcf9bb7ce53.jpg","description":"Take charge of a ludus, acquire, train and upgrade gladiators, and pit them against your opponents in bloody arena battles.\nUse strategic political wranglings to win favor from powerful Romans to increase the odds of victory in the arena and elevate your family name, all while trying to keep a group of brutish warriors focused, alive, and victorious.\nDomina is a pixel-art strategy simulation vaguely based on Roman gladiator schools of antiquity.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"DolphinBarn","platforms":[{"id":0,"name":"PC"}]},{"id":15574,"name":"OutDrive","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f06/f06198cad770f3e5f4e5c23ab24483eb.jpg","description":"Gaming experiment in genre of music runner - not a game, aesthetic concept.\nPut the pedal to the metal or your girl will die!\nHer heart works with help of the car engine and it’s you who decide how much time she has.\nAnd it depends on you how many neon landscapes she will see -  the road to the sky has no end in the last trip.\nThe endless world in Retrowawe setting where you'll burn tyres of the car to the strongest tracks of Retowawe/Synthwawe composers.\nNeon landscapes with mountain chains and  beaches will be your companions in the fated race.\nIf the car engine stops working, she will die and her blood will be on your hands!\nExperience the atmosphere of the world inspired by 80s with their neon lights, VHS tapes and synth pop. Buckle up!\nSee you on the fluorescent road in your last ride towards the sunset!PS: Try to hold out for 8 minutes...","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Denver Productions","platforms":[{"id":0,"name":"PC"}]},{"id":4618,"name":"SkyDrift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9d/c9df100a9ee75f0ec510aa7262cd17b4.jpg","description":"Get closer than ever before to the world of adrenaline pumping sky-racing where flyboys can test and master their flying and combat skills against the deadliest opponents!\nAdmire amazingly detailed terrains. Unlock state-of-the-art planes and personalize them with unique racing skins.\nBe the first on the single and multiplayer challenges, where possibilities are limited only by your own imagination.\nThe goal is simple: If you can’t overtake them, shoot them down!\nKey Features:\t\t\t\t\t\tEight Modern Planes to Fly: Choose from eight modern, state-of-the art airplanes turned into killing machines, each with four different skins for a total of 32 unique racing skins.\nSix Power-ups!  Capture up to two different powers in your plane’s arsenal, then collect upgrades to increase the strength of those existing powers. Strategy becomes key as you must choose which powers to keep, which ones to upgrade and which ones to convert into Boost energy\nStunning Visuals: Race through scenic venues like the Grand Canyon, Alaskan Terrain and Hawaiian Islands, created with beautiful, vibrant colors.\n8-person Multiplayer:  Take your friends down online in this fast and furious battle.\nThree Unique Game Modes:  Power Race Mode is high-speed racing paired with power-ups; Speed Race Mode where players navigate the course through ring targets that accelerates plane speed and Survival Mode where pilots race against the countdown clock and each other.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Digital Reality","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3639,"name":"Entwined","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ab/3ab0b96d9457789e1ef2e007008d17fe.jpg","description":"In Entwined, the player has to control two souls to lead them to perfect harmony.\n\n###Plot\nThe main protagonists are the souls of an orange fish and a blue bird. They fall in love, but due to their incompatible environments, they can't stay together. However, if they become so entwined that they learn to move in complete unison, they can merge into a dragon. This creature can traverse any environment.\n\n###Controls\nThe player takes control of both protagonists at the same time. Being a PlayStation exclusive title, Entwined strongly relies on the console's controller analog sticks. With the right stick, the player guides the bird, while the left stick navigates the fish.\n\n###Gameplay\nThe two protagonists fly forward through a tube, similar to the old flight simulators like Tempest 2000. On their way, they have to gather collectible gems and avoid obstacles. The collectibles are color-coded orange and blue for the fish and the bird, respectively. Completing these objectives allows the player to fill two colored meters while hitting obstacles drops the meters down. Once they are full, the two souls begin to merge. They have to avoid being hit during the merger process. Otherwise, it will be interrupted. When the fusion is complete, the two characters become a dragon. The player can control the dragon and freely explore the final part of each stage, which turns into a 3D environment.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":59347,"name":"World War 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b70/b70855f1185b49213f3deff7876b5ded.jpg","description":"World War 3 is a multiplayer military FPS set in a modern, global conflict. Strong teamplay, national armed forces, real locations, full body awareness and a versatile customization system all contribute to the authenticity of the modern combat experience enhanced by other essential elements such as a robust ballistic system, advanced armors and life-like weapons. Produced in cooperation with military R&D centers and consultants, World War 3 shows the consequences of every battle in the context of a global war campaign on a strategic war map.\n\n\nKEY FEATURES:\n\nModern Battlefield Experience\nWorld War 3 presents a modern conflict with tactics, techniques and procedures inspired by true combat engagements. All of this packed into two exciting game modes. Warzone offers opportunities for dynamic, intense firefights in teamwork-focused battles of infantry and armored units over fortified points. The tactically-oriented Recon allows players to cooperate within small reconnaissance squads left on their own to survive and capture high-value targets in hostile territory. Together these modes create a coherent gameplay experience aimed at presenting the actual feel of modern warfare.\n\nReal Life Locations\nWe are proud to give you one of the most realistic levels in the history of FPS. Join the battle on the streets of Warsaw, Berlin and Moscow. Take advantage of the urban environment to surprise enemy forces and dominate the battlefield.\n\nVersatile Customization\nFind your own unique combat set fitted to your needs and style without being bound by classes or roles. Choose from hundreds of combinations of unique weapon parts, attachments, skins, camos and paints. Same rules apply to vehicles, tactical gear and uniforms. If it’s possible in real life, it’s possible in World War 3 - simple as that!\n\nNational Pride\nWorld War 3 is heavily grounded in military realism, offering accurate depictions of weapons, uniforms and equipment of national armed forces. All of it to inspire you to make the war effort personal and prove that your country is the dominant force on the battlefield. All maps are based on real-life locations such as the streets of Warsaw, Berlin and Moscow (more locations planned) recreated with an unprecedented attention to detail.\n\nStrong Teamplay\nWorld War 3 supports team-based gameplay rewarding the initiative in playing as a part of a squad. Responsible cooperation within a squad is the best recipe for combat effectiveness. Players can choose between assuming the role of an Attacker or a Defender, and use any gear available to support their playstyle – what matters is the victory.\n\nArmor vs Projectile\nThe most authentic bullet vs. armor system in the FPS genre to date, achieved through years of research and development with military professionals. Ballistics, a weight system, full body awareness, vehicle physics, and an extensive customization system all affect the gameplay in a meaningful way.\n\nStrategic War Map\nTo show consequences of every battle, player performance is rewarded with resources used to conquer or defend a territory. Gain additional bonuses via the metagame and turn the tide of war! Every destroyed vehicle, every kill, every bullet fired, every achievement affects the big picture presented on a constantly evolving, interactive war map eventually covering the entire planet.\n\nCommunity Driven Development\nWorld War 3 is being developed by competitive gamers who grew up playing FPS games. As an indie studio we strongly believe that community input is crucial in creating enjoyable and memorable games. We want to invite all of you to take part in the common effort of making World War 3 the game you always wanted to play!!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"The Farm 51","platforms":[{"id":0,"name":"PC"}]}]