[{"id":17831,"name":"Quake IV","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/242/242549402861ce32c9173e5a17c67bfa.jpg","description":"Quake 4 is a first-person shooter developed by Raven Software, the fourth installment in the series and the first Quake game not developed by id Software. \n\n###Plot\nStorywise, Quake 4 is a sequel to Quake 2 and continues the story of the war between humans and cyborg alien race Strogg. You play as a Marine Corporal Matthew Kane, a member of elite Rhino Squad. The squad participates in the invasion on Strogg's home planet, but their spacecraft gets crushed in the middle of the battle zone. Now the protagonist must reunite with his team and finish the mission.\n\n###Gameplay\nThe gameplay shares many similarities with previous entries in the series, however this time, the game is much more single-player focused. The single-player mostly consists of fighting with aliens in different locations on foot with occasional differences such as turret sections or mech missions. One of the most notable differences in the game comparing to the rest of the series is that most of the time you are accompanied by the squadmates that help you fight enemies. The player has 12 weapons to choose from, most of which are recurring from the previous games such as nailgun, shotgun, railgun, blaster.\nThe multiplayer includes six different game modes: Deathmatch, Tourney, Capture the Flag, Arena Capture the Flag and DeadZone.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":578,"name":"Star Trek Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a53/a533bac7350ea700022cf2be8e694c88.jpg","description":"Star Trek Online is an MMORPG set in a universe shared with the TV Show of the same name. The is a total of 56 video game titles in the Star Trek series which are weakly connected with each other so Online may be considered as a standalone episode. The game is the first MMO in the intellectual property.\n\n###Plot\nThe game follows a storyline of Star Trek: Nemesis is set in 2049 and tells a story of a war between the Klingon Empire and the United Federation of Planets. There is a total of four free add-ons — each of them added fractions, maps, and story arcs, pushing the story forward and connecting it to the 2002 film and the other fragments of the franchise. \n\n###Gameplay\nThe players are taking the role of the spaceship operator. In this role as the captain, they can craft materials useful for the ship construction and modify it in various ways — for example, add modules so it would gain additional features. There is also a time-management feature to this game: not all processes are executed, so the player has to control his resources and account factor carefully to maximize the profits.\nThe game transferred to the free-to-play model shortly after its release. Five years afterward it was remastered already in F2P model.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Cryptic Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":22749,"name":"Teenagent","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/835/835c59f7e6caa4f818cfe55f4170c06d.jpg","description":"In the middle of a beautiful summer day a teenager is captured by two men in dark glasses and long coats. This is going to be a very interesting day!\nIt's been six months since the super secret secret service agency - RGB - started investigating the mystery of the gold missing from the main European bank, to no avail. They are so desperate that they went to a fortune teller for advice and she told them to make you into an agent.\nYou are Mark Hopper, the average teenager, who becomes an RGB agent and the agency's salvation.\nYour rewards will be girls, because every girl loves the secret agent, don't they?One of the best Polish adventure titles\nJokes that will never get old\nNice graphics and witty dialogs","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Metropolis Software","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9540,"name":"Road Redemption","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e56/e56d73997fa600cea36a31ad34e58193.jpg","description":"Lead your motorcycle gang on an epic journey across the country in this brutal driving combat adventure.\nEarn money by completing races, assassinations, robberies, and other challenges in your path.   As you collect loot, you'll upgrade your character, your bike, and your weapons.\nOne Life To Live\nDriving a motorcycle at 100 mph while trying to hit someone with a pipe is dangerous, and death can come quickly.   Fortunately, every time you die, all the experience you've collected can be used to upgrade your character, your bike, and your weapons.\nIn the multiplayer mode, you can work with your friends or let out some road rage on them.  It's up to you.\nA Truly Epic Quest\nRoad Redemption takes place in a post-apocalyptic America, ruled by a brutal dictator.  Fans of Mad Max will feel right at home here.\nAfter years of bloody street warfare, the country's biker gangs have settled into an uneasy truce.\nThis period of peace is interrupted when the leader of the country's richest weapons cartel is assassinated, and a $15,000,000 bounty is put on the mysterious assassin's head.\nIt's up to you and your fellow gang members to chase down the assassin and claim this prize, but you'll have to drive through unfriendly territory to do so.  Every biker in the country wants a piece of that $15,000,000 bounty, and they won't hesitate to take out those who get in their way.\nOther Features\nSingle player campaign fully playable in multiplayer mode.\nTons of brutal weapons.  This is more Twisted Metal than it is Mario Kart\n4-player splitscreen co-op.\nOnline mode coming very soon.\nMassive, expandable skill tree. Rack in the loot to upgrade your character, your bike, and your weapons.\nA deep motorcycle fighting system with grabs, kicks, counters, critical strikes, and more.\nFull support for both mouse & keyboard and gamepad control configurations.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Saber Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"}]},{"id":11737,"name":"Eschalon: Book I","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c95/c95149393d6b02013fda036529adb360.jpg","description":"Eschalon: Book I is an old-school role-playing game that will take you across massive outdoor environments and deep into dozens of sprawling dungeons as you seek to uncover the mystery of who you are. It features a tile-built, turn-based game world where the result of absolutely every action is rolled, calculated or statistically determined. Hundreds of items and dozens of creatures await your discovery in this classically inspired RPG.\nA tile-built, turn-based game world where the result of absolutely every action is rolled, calculated or statistically determined. Strategy is paramount to success; careful skill management, equipment selection and magic usage will win your fights, not rapid button clicking. We are very pleased to say this is not another \"action RPG\".\nHundreds of items and dozens of creatures await your discovery. A combination of randomly generated treasure and carefully hidden goodies means that no two games will play the exact same way.\nUnlimited character development style: Choose from 24 unique skills to make the character you want and 8 base attributes that affect your character's every action throughout the game. The game world does not scale or adjust itself to match anyone's play style, so the ease or difficulty of the game is directly related to how successful you are at developing your character.\nCombat plays out at your pace. Eschalon: Book I features a turn-based system that allows you to roll through combat as fast or slow you want...make it fast and furious, or analyze every option for maximum advantage.\nA non-linear storyline means that the game world is open to explore as you desire. Follow the storyline or don't...it's up to you. Just be careful where you go and who you choose to trust- the world of Eschalon can be a deadly place for an inexperienced adventurer.\nAn epic adventure that you must face alone...a single-player RPG carefully designed to feel like the great old school RPGs of the past such as Ultima®, Might & Magic®, and Wizardry®","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Basilisk Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":20654,"name":"Tom Clancy's Rainbow Six Vegas","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4d3/4d36d90fd20f0c0e7e66a99fd624b03a.jpg","description":"The sixth game in a series of action-packed books/games about special forces from the maestro of the genre Tom Clancy. The plot of the game has nothing to do with the previous parts. The story tells of a new team that was relocated to Las Vegas to defeat international terrorist grouping led by Irena Morales, which attacks different parts of the city.\n\nThere were specific changes in the gameplay: now the player does not have a standard health meter, to restore strength you need to catch your breath in cover. A third-person camera was added, it is involved in shooting from the shelter. The game uses a checkpoint system, and there are almost no cutscenes. The whole story is told with the help of the display on the helmet of the operative.\n\nTo complete the story missions, the player needs to plan the attack on the Rainbow Six and help with its execution. Resist the attack will be wiser than in the past parts of the AI. In addition to the story campaign, multiplayer is available.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":423947,"name":"Mortal Shell","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b3/0b32976c5406a0a646cfc4cdc2297b17.jpg","description":"Mortal Shell is a ruthless and deep action-RPG that tests your sanity and resilience in a shattered world. As the remains of humanity wither and rot, zealous foes fester in the ruins. They spare no mercy, with survival demanding superior awareness, precision and instincts. Track down hidden sanctums of devout followers and discover your true purpose.\nPosses Lost Warriors\nThe dead litter this tattered landscape, but not all are without hope. The lost remains of defeated warriors are yours to discover. Awaken these Mortal Shells, occupy their bodies and significantly open your understanding to diverse masteries of combat.\nFace Haunting Foes\nYour path is guarded by desperate adversaries, devoted to inscrutable gods. Behold creatures both pitiable and grotesque, but do not let fear halt your journey. Muster your courage and face them down.\nIron Sharpens Iron\nCombat is strategic and deliberate. You must commit your sword only when an opportunity opens. Calculate your parries to unleash devastating counterblows. Temporarily entomb your Mortal Shell in stone to block attacks, or play aggressive and use your stone-form to add brutal weight to your own sword swings.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"PlayStack","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":3463,"name":"RESOGUN","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be0/be0d47d4bcf4e39de33c8d541dce94f8.jpg","description":"In Resogun, the player pilots a small futuristic airship trying to shoot down wave after wave of airborne enemies. Its graphics are based on voxels (3D pixels), which provide a simple yet colorful visual style reminiscent of Lego constructions or pixel art. All five levels vaguely remind neon-lighted, skyscraper-dominated metropolises at night. They are also based on an unusual cylindrical, ring-shaped design. The levels rotate when the airship moves right or left and scroll when you fly up or down. Each level ends with a boss fight. \nEliminating enemies is the main objective in Resogun, but there’s also an optional objective to save the prisoners from their cages. Rescuing humans earns the player additional points, which is essential to set the high score. There are three modes: the Arcade mode, in which you simply pass through the consecutive levels; the Single Level mode, in which your goal is to obtain the highest score on a certain level; and a cooperative multiplayer for two. The player can select one of three airships that have different characteristics. Difficulty can also be adjusted on a scale from Rookie to Hero.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":8845,"name":"Yu-Gi-Oh! Duel Links","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf8/bf87ef7d08a80006f0f65df6d30174e6.jpg","description":"Take on Duelists around the world with \"Yu-Gi-Oh! Duel Links\"!\n- Star-studded lineup includes: Yugi, Kaiba, Joey, Mai and more!\n- Voices from the anime heighten the Dueling experience!\n- Intuitive controls for beginners! The depth to satisfy \"Yu-Gi-Oh!\" veterans!\n- Signature monsters with stunning 3D animations!\n- Build your ultimate Deck and aim for the top!\nStep into a world that crosses dimensions and connects all Duelists. In Duel World, any location transforms into a Duel Field where heated Duels unfold!\n[FEATURES]\n-Duels\nThe \"Yu-Gi-Oh!\" TCG (Trading Card Game) can be played digitally with newly designed, intuitive controls optimized for your personal computer! Also, signature monsters like \"Dark Magician\" and \"Blue-Eyes White Dragon\" make their appearance with dynamic visuals!\n-Single Campaign (Duel World)\nDuel as your favorite characters from the \"Yu-Gi-Oh!\" world and complete Stage Missions to earn various rewards!\nNew cards can be obtained from the Shop!\n-Duelists\nChallenge Yugi, Kaiba, Joey, Mai and other Legendary Duelists! Complete specific Missions to unlock and these characters!\nEarn Skills and rewards by leveling up your favorite characters!\n-Online PvP\nWith \"Yu-Gi-Oh! Duel Links,\" engage in heated Duels anytime and anywhere against players around the world! Climb through the rankings and claim the title of King of Games!\n-Decks\nBuild your very own Deck with cards you collect in-game and take on opponents!\nStay tuned for future card additions!\n[ABOUT \"Yu-Gi-Oh!\"]\n\"Yu-Gi-Oh!\" is a popular manga created by Kazuki Takahashi that was serialized in SHUEISHA Inc.'s \"WEEKLY SHONEN JUMP\" from 1996. Konami Digital Entertainment Co., Ltd. provides a Trading Card Game (TCG) and video games, based on the \"Yu-Gi-Oh!\" anime series created from the original manga, that are enjoyed around the world.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Konami Digital Entertainment","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":1581,"name":"The Silent Age","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1e/b1ebb9c1d511bac55e4480ad422ea524.jpeg","description":"###Point-and-click quest\nThe game is a typical representative of the point-and-click puzzle genre, developed and released in two episodes by the independent Danish studio House on Fire. The game uses the Unity graphics engine and was ported directly to several platforms. Including mobile devices running Android and iOS. The game also was released on Kindle Fire. The first episode was released in 2012, two years later, gamers were able to try out the second and last episode of the game.\n\n###The plot\nThe game takes place in 1972 and in 2012. The player takes control of the main character named Joe. After serving in the US Army, the protagonist changes several workplaces and eventually turns out to be a cleaner in the fictional multimillion corporation Archon. The employer turns out to be unclean, and Joe soon finds traces of blood that lead to test labs. To prevent the tragedy, which he involuntarily became a witness to, Joe is forced to use the time machine and correct mistakes of the past.\n\n###The plot\nThe main gameplay is tied to the solution of the puzzles of different complexity, scattered in ten story chapters. The part of them uses the plot “device” - the ability of the hero to travel in time. In the PC version, all game dialogs are voiced, the ability to use UltraHD textures is added, and for the version on Steam more than 20 achievements are available and the ability to save the game in the cloud.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"House On Fire","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PS Vita"}]},{"id":12032,"name":"King's Bounty: Crossworlds","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/639/6397bb4efeaef93416b35e905a3a18c1.jpg","description":"###The king’s heroes\nThe Russian approach to the game King's Bounty released on the largest platforms back in the 1990s. The series is often compared with the universe of Heroes of Might and Magic, but the gameplay and other differences (for example, the lack of a turn-based movement around the game world). But games have one publisher - New World Computing.\n\n###The Russian way\nIn March 2007, the Russian company 1C bought the rights to use the trademark and game universe of King's Bounty. The development was entrusted to the Vladivostok studio Katauri Interactive, which are known for the series of games Space Rangers. The game takes place in the fictional world of Endoria. In 2009, there was an add-on for the main game under the name of Armored Princess, and apparently, because of the love of Russian to matryoshka, the company decided to release another add-on to the add-on of the original game.\n\n###The plot\nThe action of Crossworlds takes place in the world of Teana. The player takes control of Princess Amelie, as in the previous game, and guides her through two independent story campaigns. One of them is “Orcs on the March” - the remastered version of the campaign from the previous part, and two other absolutely new stories in the virtual universe. In addition to developer’s created campaigns, players are able to create their own adventures in the built-in editor. The play is possible only in a single mode, and multiplayer is not available in the game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Katauri Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":4418,"name":"I Am Alive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c75/c7538f6d44b674b9f29919384050da2a.jpg","description":"I Am Alive is an action game with survival elements set in the post-apocalyptic environment. You take on the role of Adam, who lost his wife and daughter during the earthquake in Chicago. Almost a year after the accident he starts looking for them around the semi-destroyed city.\n\nLike many survival games, I Am Alive includes resource management, crafting and fighting with other survivors over the loot. The unique parameter you need to take into account is Adam’s stamina: every action reduces his powers. The game provides an extensive combat system that features several weapon types and protection items along with the ability to frighten some enemies and to avoid the confrontation. All weapons you get at certain story points or completing special side quests.\n\nThe gameplay combines the survival aspect with constant fights and the necessity to explore every piece of locations in order to find useful items. As a result, I Am Alive receives the features of a tactical action genre that expand the gaming experience you get.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":1757,"name":"Reigns","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/69e/69ecbe81dd11f76c97d4b7c0a256429d.jpg","description":"Collector's Edition\nAbout the GameSit on the throne as a benevolent (or malevolent) medieval monarch of the modern age and swipe your royal controller either left or right to impose your will upon the kingdom. Survive the seemingly never-ending gauntlet of requests from your advisors, peasants, allies, and enemies while maintaining balance between the influential factions of your kingdom. But beware; each decision you make might have implications and unfortunate consequences down the road that could put your reign and family’s dynasty at risk!\nAn Unpredictable Kingdom: Each year of your reign brings another important – seemingly random – request from your unpredictable kingdom as you strive for balance between the church, the people, the army, and the treasury. Prudent decisions and careful planning make for a long reign but unforeseen motivations, surprise events, and poor luck can take down even the most entrenched monarch.\nDynasty Expansion: Extend your reign as long as possible, forge alliances, make enemies, and find new ways to die as your dynasty marches along through the ages. Some events will span on centuries, with an intrigue involving burning witches, scientific enlightenment, wicked politics and, maybe, the Devil himself.\nRoyal Challenges: Achieve specific goals set before you at the start of your reign to cement your legacy and unlock new cards and content within the kingdom.\nEclectic Presentation: An inspiring score from Disasterpeace compliment elegant gameplay and a bold art direction for a sublime experience as you rule over your people.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":19459,"name":"X-COM: Enforcer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d93/d937fb411129d54c152a7454d372ec79.jpg","description":"X-COM is more than a strategy game. This franchise has intricate lore and the setting that gathered a fanbase and formed a strong following. But not everyone can be a commander overseeing the combat from afar. Someone has to follow the orders. This is the case with X-COM: Enforcer, third-person shooter. Players take direct control over a combat robot, named the Enforcer. The game is set in the First Alien War, where the united governments are closing down the project of creating the ultimate warrior. But due to the lack of funds, the project was finished by the leader of the research, Professor Able Standard, and the result was unleashed on the invading forces.\nX-COM: Enforcer borrows the research mechanic, where players collect data points by killing enemies. Research upgrades between missions, and if any “Unresearched objects” was collected during the missions, the research branches will be extended. The game is focused on the continual action sections, but sometimes the player might encounter puzzles, obstructing the story progress.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"}]},{"id":10163,"name":"Rec Room","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35a/35a5b7aba92cb3cac5e3dde272336edf.jpg","description":"Feature ListOnline multiplayer so you can have fun with people from all over the world\nBe yourself - customize your appearance in the changing room\nFREE membership unlocks The Lounge, an invite-only space for you and your friends.\nHang out and play in the Locker Room, or choose one of our fun activities:\nPaintball\nCo-op quests - challenging adventures designed to be played with your friends\n3D Charades\nDisc Golf\nOr just choose \"Quick Play\" to jump into a random game\nRobust mute, ignore and moderation tools help you manage your experience\nA fantastic and growing community of players who will help you learn and have fun!\nAbout the GameWelcome to Rec Room, the virtual reality social club where you play active games with friends from all around the world. Customize your appearance, then party up to play multiplayer games like Paintball, 3D Charades, Disc Golf, and even four player co-op adventures! Or just hang out in The Lounge (free membership required).\nThings to KnowRec Room is an active game. Please use common sense and caution while playing!\nChildren under thirteen are not allowed.\nChildren between 13-18 must consult with a parent or guardian before playing.\nIn Early Access, Rec Room defaults to being a public experience. You will interact and voice chat with other people in real time. Rec Room offers mute, ignore and reporting features which we encourage you to learn and use. But even if you use these features, you still may be exposed to speech or behavior you find inappropriate.\nBy playing Rec Room, you agree to our Code of Conduct!Code of ConductRule #1: Be excellent to each other!\nNo sexually explicit behavior or language in the locker room or public activities.\nChildren under thirteen are not allowed.\nWhatever you choose to do in a private activity, still make sure everyone is cool with it.\nSexist, racist, discriminatory or harassing language is not welcome in Rec Room.\nDon't mess with other people's games! We don't want to implement a million rules to control your behavior in every game. Don't make us.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rec Room","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":22088,"name":"Nephise Begins","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a09/a09387c63a3e0101f03b985d797c3460.jpg","description":"Nephise Begins tells the player what happened at the time before Nephise was an orb collector. The main setting is forest again, but this time without snow, instead a more sunny and foggy weather. And there are more hills to climb.\nIt is a short and atmospheric puzzle game with narration.\nThe gameplay and puzzle system is similar to the original Nephise. There are animal skulls that you have to gather and then use on tall amphoras. You will be able to toggle the visibility of the HUD which will show you which animal skull and how many mushrooms you have gathered.\nThe music and atmosphere is relaxing like the original game. And the voice actor will be an elder one who will be narrating like telling the player a story.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Tonguç Bodur","platforms":[{"id":0,"name":"PC"}]},{"id":20194,"name":"Overcast - Walden and the Werewolf","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/869/8694944f8bbdf77789274beee9f15be7.jpg","description":"Amnesia was a big success as a game of its genre – story driven horror with exploration and environmental puzzles. Overcast tells a story of an old hunter, living in complete solitude in the forest near the remote village. But players will have to deal with the fact, that now there’s a dangerous creature, that’s been haunting every human around, killing every resident of the village and now it’s the hunter’s turn.\nThe game offers similar mechanics to the source of main inspiration – Amnesia. Players will have to carry a lantern and hunt down several monsters in each of a few in-game chapters. Unlike Amnesia, Overcast has gunplay, map system, and scarce checkpoints, adding the high risk of replaying the chapter from the beginning, if players lost focus and made a mistake of dying too close, to the end of the chapter. The original game soundtrack is using guitar compositions to set the tone and ease the tension after the horror scenes or jump-scares. There are three distinct monster types, and each of them introduced from a first-person perspective of the said monster, adding to the tension. The game gained a surge of popularity, due to the game being played and recommended by several big YouTubers.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Microblast Games","platforms":[{"id":0,"name":"PC"}]},{"id":4380,"name":"Rock of Ages","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e5f/e5fc584aefc66dec235715908eb2316b.jpg","description":"Rock of Ages is a game which resembles a racing game, a Tower Defence and a platformer at the same time. It was developed by ACE Team.\n\nThe game is loosely based on the myth of Sisyphus. The main objective of the player is to use a giant boulder in order to destroy the enemy castle located at the bottom of the hill while at the same time defending your own stronghold using various structures. Players can build money farms to raise the funds necessary to build defensive structures or upgrade the boulder itself. After gathering a certain amount of money it is possible to equip both defensive and offensive upgrades to the boulder. The enemies can destroy the boulder in which case the player has to wait until the boulder spawns again and proceed with the offense. The player wins if they successfully destroy the enemy's castle gates and place the boulder right in the center of the castle. \n\nThere are five distinctive time periods present in the game, such as romanticism, rococo, renaissance, and so on.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"ACE Team","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":13035,"name":"12 is Better Than 6","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/985/985dc43fe4fd5f0a7ae2a725673d6ac6.jpg","description":"12 is Better Than 6 is a top-down shooter with stealth elements based on the Wild West theme. \r\n\r\n###Plot and art style \r\nThe game takes place in 1873 Texas. The story follows a Mexican runaway that does not remember anything about his past other than there is a bounty on his head. The game is notable for its art style that imitates pictures drawn with pen and paper. The game’s visuals are stylized, but the story bluntly describes the brutal nature of the late 1800s. The character himself is not a hero in the typical sense of the word, and some of the protagonist’s actions throughout the game are going to be far from honorable. \r\n\r\n###Gameplay \r\nThe gameplay is a top-down twin-stick shooter and shares some similarities with famed Hotline Miami series. The campaign consists of four acts that feature numerous missions centered on killing enemies as effectively as possible. One of the most notable characteristics of the gameplay is that you have to cock and reload your guns, using different buttons manually. The hero’s weaponry consists of iconic Wild West firearms such as revolvers, double-barreled shotguns, rifles, and bows. Between missions, you come across hub towns in which you can restock ammo, buy upgrades or take side-quests to earn more money. \r\nBesides the primary campaign, there is an arena mode that makes you fight waves of enemies.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ink Stains Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1794,"name":"Hard Reset Redux","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7f/f7f073a773afb2912a3a997cec20ca8b.jpg","description":"The acclaimed First-Person Shooter returns fully upgraded, and more beautifully challenging than ever. Hard Reset Redux is a brand new version of the cyberpunk classic that includes all the content of previous editions, and adds new improved gameplay, enhanced visuals and additional content to make this the Definitive Edition of Hard Reset.\nHard Reset Redux is an action-packed and hardcore single-player shooter which embraces the best qualities that the genre has it offer. It includes over-the-top destruction, loads of enemies, great weapon variety, a challenging campaign and a beautifully realized cyberpunk setting. Having been originally developed to shake-up the shooter scene on PC, Hard Reset now returns to do it again on a new generation of hardware.New FeaturesBrand New Cyber-Katana Weapon: A powerful new weapon which provides an effective close range combat option\nBrand New Enemy Type: Various variants of a threatening new Cyborg Zombie now lie in wait for unsuspecting players\nNew Quick Dash Move: Provides players with a new movement option in battle to help avoid incoming attacks and enemies\nEnhanced Visuals: The game has been updated to the newest version of the RoadHog engine and includes improved lightning and effects\nImproved Performance: Enjoy faster Load times, a new Quicksave feature and full joypad support\nRebalanced Gameplay: The game now includes improved difficulty levels and better pacing\nDifferent Enemy Placement: Enemies are introduced differently throughout the game, and provide a new challenge for even the most seasoned Hard Reset veteranStory:The world as we know it ceased to exist. Humanity is at the verge of extinction, living in the last closed city of Bezoar. Mankind wages war against the machines controlling vast areas of what became the 'Barrens'. Machines want to control and assimilate 'The Sanctuary' a network that holds billions of digitalized human minds. Our hero, Maj. Fletcher, is a soldier of CLN - a corporation combat unit, established to protect the city. Machines are constantly assaulting the walls of Bezoar. Fletcher moves in when Bezoar's protective barrier is breached.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Flying Wild Hog","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":964,"name":"Ticket to Ride","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/768/768e36d4b62a1481fef737c6920fbfc7.jpg","description":"Ticket to Ride is a turn-based strategy game, an adaptation of a board game of the same name. \n\n### Gameplay  \nThe gameplay copies the board game entirely. The game takes place on a map of the United States and south Canada filled with multicolored railroads.\nEach player starts with 45 train pieces and has to choose two Destination Cards. The Destination Ticket cards show two cities that player has to connect. Each turn every player chooses one of three actions: spend their train pieces to claim part of the railroad, draw three more destination tickets and keep at least one of them and draw two railway car cards. You can only claim railroad parts if you have enough railway car cards that match the road’s color. The amount of train pieces you spend depends on the length of the railroad fragment. \nClaiming routes and connecting cities on your Destination Ticket card give you points at the end of the game. However, incomplete tickets make you lose points. The player with the most points wins the match. \n\n### Downloadable content  \nTicket to Ride features several DLCs in the form of extra maps. Europe and 1910 USA maps were released in 2008 for Xbox 360 version of the game. These maps appeared later in the Mac and PC versions of the game alongside the Switzerland and Legendary Asia maps.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":440086,"name":"Scarlet Nexus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27c/27cb94ed1763fec383fb99151580095a.jpg","description":"Take on the role of Yuito Sumeragi, a new recruit to the OSF aiming to become an elite psionic like the one who saved him as a child. Armed with a talent in psycho-kinesis, explore the futuristic city of New Himuka and uncover the mysteries of a Brain Punk future caught between technology and psychic abilities in SCARLET NEXUS.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":60783,"name":"Outward Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7e/f7e1219e49e1e77cf1365841d2947656.jpg","description":"Outward offers an immersive RPG experience coupled with realistic gameplay, as well as deeply-rewarding challenges for the most avid gamers.\n\nAs an ordinary adventurer, you’ll not only have to hide or defend yourself against threatening creatures, but also brave the hazardous environmental conditions, protect yourself against infectious diseases, and stay hydrated. Embark on risky expeditions across untamed lands to reach new cities, undertake important missions, and discover hidden dungeons crawling with formidable enemies.\nPearlbird Pet and Fireworks Skill\n\nEmbark on your adventure with your loyal friend! With the skill included, you can light up the sky with fireworks and enjoy a quiet night with your pet in the rough realms of Aurai!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nine Dots Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":3388,"name":"Borderlands: The Handsome Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/819/819cbc1d24837166b24299f5c8b68e07.jpg","description":"Borderlands: The Handsome Collection includes the definitive versions of both Borderlands 2 and Borderlands: The Pre-Sequel, built specifically for next-gen consoles. Experience the highest performance and highest fidelity graphics for any Borderlands game ever played on a video game console. For the first time, play four-player split screen on a single screen, all in stunning high definition. Experience the entire Handsome Jack saga, from his not-so-humble beginnings to the heights of his egomaniacal tyranny.\n1080p HD Video Output\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© 2015 IPerion, LLC. Published and distributed\nby 2K. Gearbox and Borderlands, and the Gearbox Software and Borderlands logos, are registered trademarks, The Pre-Sequel is a trademark, all used courtesy of Gearbox Software, LLC. 2K, 2K Australia, and their respective logos are trademarks of Take-Two Interactive Software, Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"2K","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":614964,"name":"Death Stranding Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b6f/b6fa0cde8a1204c7d6edc2ec3c753df9.jpg","description":"Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the Death Stranding? What will Sam discover on the road ahead? A genre defining gameplay experience holds these answers and more.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Kojima Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"}]},{"id":10096,"name":"3DMark","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/39b/39b62f5a6813c71d4d6946828fcda4cb.jpg","description":"3DMark includes everything you need to benchmark your hardware. With its wide range of benchmarks, you can test everything from tablets and notebooks to the latest 4K gaming PCs. It's the most powerful and flexible 3DMark we've ever created.\n3DMark is for gamers, overclockers and system builders who want to get the most out of their hardware. When you buy 3DMark on Steam you unlock all tests, settings, and features. Better benchmarking with 3DMark\nThe right test every time\nWe've made it easy to find the right test for your PC. 3DMark automatically scans your hardware and recommends the best benchmark for your system.\nChoose your tests\n3DMark grows bigger every year with new tests. When you buy 3DMark from Steam, you can choose to install only the tests you need.\nHardware monitoring\nDetailed charts show you how the CPU and GPU temperatures, clock speeds, and the frame rate changed during your benchmark run.\nCustom settings\nExplore your PC's performance limits with custom benchmark settings. You can change the rendering resolution and quality across a range of settings.Benchmark Tests\nTime Spy - DirectX 12 benchmark for Windows 10 PCs\nWith its pure DirectX 12 engine, built from the ground up to support new API features like asynchronous compute, explicit multi-adapter, and multi-threading, Time Spy is the ideal benchmark for testing the DirectX 12 performance of the latest graphics cards.\nFire Strike - For high-performance gaming PCs\nFire Strike is a showcase DirectX 11 benchmark designed for today's high-performance gaming PCs. Use Fire Strike to test dedicated gaming PCs, Fire Strike Extreme for high-end systems with multiple GPUs (Crossfire/SLI), or try Fire Strike Ultra, the world's first 4K Ultra HD benchmark.\nSky Diver - For gaming laptops and mid-range PCs\nSky Diver is a DirectX 11 benchmark that is ideal for testing mainstream graphics cards, mobile GPUs, integrated graphics and other systems that cannot achieve double-digit frame rates in the more demanding Fire Strike test.\nCloud Gate - For notebooks and home PCs\nUse Cloud Gate to test the performance of notebooks and typical home PCs with DirectX 10 compatible hardware.\nIce Storm - For basic tablets and smartphones\nUse Ice Storm, Ice Storm Extreme, and Ice Storm Unlimited to compare smartphones and tablets across platforms.Feature TestsAPI Overhead feature test - Compare the latest graphics APIs\nThe 3DMark API Overhead feature test is the world's first independent test for comparing the performance of DirectX 12, DirectX 11 and Vulkan. See how many draw calls your PC can handle with each API before the frame rate drops below 30 fps.Stress TestsCheck the stability of your system\nStress testing is a good way to check the reliability and stability of your system after buying or building a new PC, upgrading your graphics card, or overclocking your GPU. Stress testing can also identify faulty hardware or the need for better cooling.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Futuremark","platforms":[{"id":0,"name":"PC"}]},{"id":9557,"name":"The Incredible Adventures of Van Helsing: Final Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8be/8be1d2c12a8ff3fdb693d4df128f50f0.jpg","description":"The Incredible Adventures of Van Helsing: Final Cut is a role-playing game with several hack and slash elements developed by NeocoreGames. It is a remastered version of the trilogy of games by the same name. \n\n###Setting\nBased on Bram Stoker's Dracula, the game is set in the alternative 19th century Europe. The world bears some steampunk inspired details and is described as full of monsters, magic, and weird technologies. You play as the some of Abraham Van Helsing, a legendary vampire hunter from Stoker's novel. He sets on the same path his father once did.\n\n###Gameplay\nThe main objective of the game is to clear the in-game world of monsters. Experience is gained from killing monsters and is used for leveling up. With each new level, it is possible to improve Van Helsing's firearms or melee weapons. Van Helsing can also improve his own stats after leveling up. Four stats are present in the game: body build, agility, willpower, and luck. \n\nThe game features an inventory system which allows for the players to upgrade their armor, coat and the amulet the protagonist carries with himself. Money is gained by either completing quests or selling the items you do not need to the shopkeepers.\n\nThe main character is accompanied by the ghost of a woman that his father once saved. She helps Van Helsing in conversations with other characters and during combat. The players can order her to stay passive or become more aggressive. She has her own inventory and stats.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"}]},{"id":754888,"name":"The Quarry","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f40/f407a80be4c604d013e4b9d1e0c6dbef.jpg","description":"Play as each of the nine camp counselors in a thrilling cinematic tale, where every decision shapes your unique story from a tangled web of possibilities. Any character can be the star of the show—or die before daylight comes. How will your story unfold?\r\n \r\nYOUR STORY, THEIR FATE\r\nWill you dare to check what's behind that trap door? Will you investigate the screams echoing from within the forest? Will you save your friends or desperately run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale.\r\n \r\nA STUNNING CINEMATIC EXPERIENCE\r\nCutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic ensemble cast of Hollywood talent, bring the horrors of Hackett’s Quarry to life in a pulse-pounding, cinematic thrill ride.\r\n \r\nENJOY THE FRIGHT WITH FRIENDS\r\nPlace your faith in up to 7 friends in online play, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player picks a counselor and controls their actions.\r\n \r\nCUSTOMIZE YOUR EXPERIENCE\r\nAdjustable difficulty for all gameplay elements let players of any skill level enjoy the horror. And if you prefer to watch rather than play, Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. Select how you want the story to unfold, kick back, and munch on some popcorn in between all the screams!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Supermassive Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":45775,"name":"Biomutant","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/363/363830e5f6459ca71eb43bea8c32f688.jpg","description":"BIOMUTANT® is an open-world, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action.\nKey Features:\nA NEW TAKE ON 3rd PERSON COMBAT\nThe martial arts style combat system allows you maximum freedom of movement and agility while mixing shooting, melee and powers from your mutations. Learning new Wushu combat forms through progression and learning from masters you’ll meet, will constantly add to your choices and make sure combat never gets old.\nEVOLVE YOUR GAME-PLAY\nYou’ll be able to re-code your genetic structure to change the way you look and play. This will of course affect your attributes and in addition to this, exposure to bio-contamination in the world will lead to physical mutations like mantis-claws and barbed tails, while exposure to radioactivity found in bunkers from the old world will affect your mind and unlock psi-mutations like telekinesis, levitation and more.\nNEXT LEVEL OF CRAFTING\nYou are totally free when crafting weapons. Mix and match parts to create your own unique 1H or 2H slash, crush and pierce melee weapons. Revolvers, rifles and shotguns and add modifications like cork-screws and battery-powered chainsaw modules to bio-contaminated sludge vials adding to your combat arsenal. There are even characters you’ll meet that’ll craft cool stuff for you, like bionic wings, a jump-pack and even let you modify your Automaton - the scrap-toy sidekick!\nGEAR UP FOR ADVENTURE\nYou are totally free when equipping your character. Not only when it comes to choosing weapons you created, but what type of gear you wear. Equip a gas-mask and an oxygen tank for exploring the Dead Zones, thermos-resistant clothes for venturing into cryonic areas or protective gear for taking on bio-contaminated creatures, the choice is up to you.\nSURVIVE IN A VIBRANT OPEN WORLD\nYou are free to explore the world and what lies beneath its surface, by foot, mech, jet-ski, air-balloon or area unique mounts. Explore the dying wildland, the tunnels and bunker networks of the underworld, and find your way up the mountains or out in the archipelago. There are lots of discoveries to be made, mysteries to unravel, creatures to confront and weird characters to meet in this vibrant and colorful world.\nAN UNUSUAL STORY WITH AN UNUSUAL END\nYour actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruining the land and the Tree-of-Life is bleeding death from its roots. The Tribes stand divided, in need of someone strong enough to unite them or bring them all down...\nYou are guided through the world by a Storyteller that narrates every step of your journey, but it’s your actions and choices that’ll decide how your story of survival ends.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Experiment 101","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":286474,"name":"Narita Boy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba3/ba3dbf9a5a71913582052d7e12775aea.jpg","description":"Explore and fight in a retro-futuristic world.\nSwim deep into a oneiric, poetic and unique experience across dimensional planes.\n\nThe aesthetic of the game was inspired\nby retro pixel adventures (Castlevania, Another World, Double Dragon)\nwith a modern touch.\n\nAnd an 80s plot homage (Ready Player One, He-Man, The Last Starfighter),  \naccompanied by the retro synth touch of the old glory days.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Studio Koba","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":17286,"name":"Eets Munchies","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/904/904809185a905c430f6c36f0ebf5353c.jpg","description":"Eets Munchies is a sequel to Eets and is defined by a cartoonish visual style, upbeat music, and whimsy humor. Its gameplay is reminiscent of Lemmings. The main character is Eets, a small funny beast that eats everything on his way. However, the player doesn't control Eets directly. The character will not obey the player and has to be manipulated in various ways. For example, the player may place Eets's favorite food where he or she wants the character to go. Certain items can also influence the beast's mood and make him behave in a different way. \nAt the start of each level, the player puts his or her items on the map. After that, Eets is released to stumble all over the level, bounce off the obstacles, and get sad, happy or angry, depending on what he ate. Eets Munchies has three levels of speed that allow the difficulty to vary. Your main goal is to lead Eets through each maze towards its endpoint, which is marked by a huge cake hanging from the ceiling on a rope. Your game score, however, also depends on how many candies Eets will devour on his way, and to set a higher score is necessary to unlock new levels.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Klei Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":23659,"name":"Last Day of June","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ada/ada5c5ef872679536eb0e2ab58c1aa1d.jpeg","description":"Last Day of June Special Launch Pack\nPurchase Ovosonico’s emotional watercolor adventure before September, the 15th 2017: you’ll be granted a 10% off discount and will get Brothers: A Tale Of Two Sons for FREE – a heart-touching journey and one of the most critically acclaimed adventures ever.\nThis special offer purchase includes two master pieces, respectively from the creative minds of Massimo Guarini (Murasaki Baby, Creative Director for Shadows of the Damned) and Josef Fares (A Way Out).\nMake sure to follow and wishlist Last Day of June on Steam to get notifications!\nAbout the Game\nJoin Carl and June on what begins as a magical outing to their favorite spot, and try to unlock the sequence of events that could save the day – and June’s life – in this cinematic experience that will compel you  to ask yourself: “What would I do to save the one I love?\"\n+ Polygon (US): 8.5/10\n+ EuroGamer (UK): RECOMMENDED\n+ Jeauxactu (FR): 8.5/10\n+ IGN (ES): 84/100\n+ Multiplayer (IT): 8.5/10\nLast Day of June is an interactive tale about love and loss, from an all-star team of creators - including critically acclaimed director Massimo Guarini (Murasaki Baby, Shadows of the Damned) & award-winning musician and record producer Steven Wilson, and featuring a collaboration with writer/director/animator Jess Cope (animator on “Frankenweenie”, director for Metallica’s “Here Comes Revenge” music video).\nA HEART-DRIVEN QUEST: Last Day of June is inspired by Steven Wilson’s haunting song “Drive Home.” Recreated as an interactive adventure, Last Day of June takes players on a profound and poignant journey.\nPOETRY IN MOTION: A true artistic innovation in visualizing a bittersweet story told through a welcoming, painterly world that showcases the beauty of life and love, but also the contradictions of loss.\nEMPATHY THROUGH EXPERIENCE: Determined to save his beloved and fueled by the power of grief, Carl introduces players to June’s last day. But as they interact with the narrative, players will progress from viewer to a character deeply intertwined in the story.\nFATE-ALTERING PUZZLES: Relive June’s last day by traveling back in time through her paintings in an attempt to change the results of the fateful and final drive home by solving emotionally challenging puzzles.\nINTERACTIVE STORYTELLING: Carl and June’s story progresses at key moments where life-changing decisions need to be made, but players may need to navigate unintentional consequences that create new dilemmas – and potentially new opportunities.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"505 Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":16677,"name":"Arx Fatalis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e52a138701aa7e4f751e0f88361a9d8.jpg","description":"This critically acclaimed first-person RPG takes the player on an amazing journey into the fantasy world of Arx. The game mixes intelligent story with immersive and actual medieval surroundings. Arx Fatalis allows the player to feel that all his actions have a direct consequence on those around him.\nThe goal of the game is to destroy the secret cult of Akbaa, the god of destruction. As a player, you must prevent the return of such a cruel creature to the physical world. Should you fail, Akbaa is bound to impose its terror upon the world of Arx.\nYou will become the hero of an underground world - with weapons, spells and magical items to defend against goblins, trolls, rat-men and other vicious opponents.\nBesides brute force, stealth and the \"onscreen gesture based magic system\" are the three alternative ways to succeed.   Using the mouse, flaming runes can be drawn in mid-air.  A combination of these gestures can create powerful magic spells that will protect you or empower you to defeat opponents and pursue the quest.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Arkane Studios","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":11434,"name":"Viscera Cleanup Detail: Santa's Rampage","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3c6/3c6d71166b38e29f78b01b97828e2682.jpg","description":"This science-fiction game begins where most of the science fiction games end. Earthlings survived the invasion of hostile aliens - and were able to repel him. The battles were not even on the planet Earth itself, but at the space station. And at this station there were many traces of carnage. From blood to parts of aliens, from holes in the walls from bullets and shells to broken glass. And now all this must be cleaned, collected, and the garbage must be thrown away. A game about space janitors, and an extraordinary task for them.\n\n###Gameplay\nIn the course of the game, it is necessary to solve the tasks related to cleaning up of the huge space station, which survived the battle between the inhabitants of the Earth and the alien invaders, from the dirt and debris. It is necessary to remove the most diverse and exotic garbage: remains of bodies of aliens and earthlings, shot casings and broken glass, medicines for the wounded, weapons and who knows what else. It is necessary to wash the floors and walls of blood and soot, to seal holes from bullets in walls, ceilings and floors.\n\nAs tools, players have a mop to wash out stains, a special device for detecting biological remains, and a PDA. You can interact with garbage and simply with the help of hands.\n\nAt each level there are devices for cleaning and recycling garbage: an incineration plant, a source of clean water, a container in which smaller debris is placed, such as cans, liners and body parts, a welding device for repairing holes in walls, and a vending machine where the player can get lights, medicines, a \"wet floor\" sign, other signs and lamps. Sometimes these devices work incorrectly and produce even more pollution.\n\nThe player can figure out how to use improvised tools to speed up and simplify cleaning. On the other hand, the player should think about how his actions will affect the situation and will not lead to even more pollution and the need to clean the same place several times.\n\nAfter passing each level, the player enters the so-called \"The Office\". This is the place where the work done at this level is summed up. The player sees what he missed to draw conclusions for the future. In this place you can also get things as a reward for the work done.\n\nThe cleaning takes up any amount of time, but there are penalties for poorly executed work. If less than 75% of the territory is taken away, the player can be fired and he will lose all the accumulated achievements.\n\n###Additions.\nThere are several additions to the game. The gameplay in these additions is the same as in the main game, but setting is different.\n\nViscera Cleanup Detail: Shadow Warrior is set in the first chapter of the Flying Wild Hog's Shadow Warrior, cleaning up the mess.\n\nViscera Cleanup Detail: Santa's Rampage - the action takes place on the North Pole, and you have to clean up behind the crazy Santa Claus, in his workshop.\n\nA Halloween DLC pack entitled Viscera Cleanup Detail: House of Horror, featuring a crime scene of a house, where an unsolved mass murder has happened, while the player gets to uncover it during the gameplay.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"RuneStorm","platforms":[{"id":0,"name":"PC"}]},{"id":10171,"name":"Dungeons 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e2/2e256a7643dca3065b7ff1dcc4c7650d.jpg","description":"Pre-Purchase Offer\nPre-purchase Dungeons 3 now on Steam and get 15% discount, as well as the follwing exclusive bonus content:\nAccess to the Beta\nUnlock instant access to the Dungeons 3 closed-beta test (Windows only)!\nThrone Room DLC\nBeautify your dungeon with an exclusive Horde-themed throne room skin!\nDigital Soundtrack\nEvil sounds so good – enjoy the music of Dungeons 3 with the digital soundtrack!\nFeature ListThe dungeon manager you’ve been waiting for: Dungeons 3 is the biggest, best, and evil-est dungeon sim yet, topped off with a fully reworked overworld RTS mode.\nUnder new management: Command the united forces of evil under the guidance of new character Thalya and lead them to victory.\nSize does matter: Extensive single player campaign with 20 missions and more than 20 hours of playtime, randomly generated levels, a brand new co-op mode for two players, more rooms, and more unique abilities.\nSpeak (no) evil: The fan-favourite Dungeons narrator is back with his unmistakable voice, continuing the Dungeons legacy in the best way possible.\nAbout the GameThrough enticing the dark elf priestess Thalya from the fluffy clutches of the surface world to become his chief lieutenant, the Dungeon Lord has found a way to direct his campaign of conquest from the confines of his underground lair. With Thalya on the front line, and the united forces of evil to support her, players will have to use every trick in the book to best those do-gooders of the overworld, once and for all!\nUnleash your dark side by creating a unique underground dungeon from a huge array of rooms, traps and structures. Raise the most terrifying army the world has ever seen, by choosing from despicable creatures such as orcs, succubae, zombies and much, much more. Then, once you have built your forces, emerge from the darkness and guide your army to the light of the overworld, where you will corrupt the land and dispatch anything even vaguely heroic, cute or unicorn-shaped. And in a first for the Dungeons series, experience randomly generated levels, so that no two sessions are alike – never-ending fun for any evil conqueror!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Kalypso Media","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":161,"name":"Momodora: Reverie Under the Moonlight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/302/3021f937f82274320bb2758a0a9bccf6.jpg","description":"Momodora: Reverie Under The Moonlight takes the player on a journey through a cursed land on the brink of eradication. Evil spreads, the dead rise, and corruption reigns. Hope is but a faded memory for all but one: a priestess named Kaho from the village of Lun. If only Kaho could somehow gain audience with the Queen, Her Majesty could surely be convinced to lend her power to help save the land and its inhabitants from certain doom―but time is short, and each coming night falls darker than the last...\nReverie Under The Moonlight is the fourth installment in the Momodora series of side-scrolling action platformers, featuring melee combos, dodge mechanics, and a plethora of items and spells to unleash upon your enemies. Play casually to fully take in and enjoy the rich setting and engaging, mysterious story, or crank up the difficulty to run your reflexes through a truly brutal gauntlet.\nBeautifully animated graphics\nExciting action gameplay: pull off impressive combos, dodge attacks, and skewer enemies with arrows\nIntense boss battles with challenging patterns and epic scale\nDifficulty settings appropriate for all types of players―from story and setting lovers to hardcore action enthusiasts\nA breadth of items that can be combined to facilitate new strategies\nAn amazingly diverse world to explore, filled with secrets and treasures\nEccentric allies and foes with compelling personalities\nMysterious lore and rich backstory woven into events, dialogue, and item descriptions\nFor this fourth installment in the Momodora series―which actually serves a prequel to the previous games―the primary focus during development was on improvements to the gameplay and art. The combat gameplay has truly evolved since the days of Momo III, and the character sprites are now bigger and better animated.\nWe also made an effort to include more tiny details here and there, expand on the world lore, and create more exciting boss battles.\nI believe this is the best Momodora game in the series, and definitely the most polished title so far.\nMost of us at Playism grew up playing video games during the early days of the NES, and throughout the years, action-platformers have been some of the staples in our respective game libraries. Long before “Metroidvania” was a thing, we fell in love with the original Castlevania series, as well as with other Hall of Famers such as the Metroid, Contra, and Ninja Gaiden games. About halfway through the lifecycle of the first-generation PlayStation, sprite-based game development took an unfortunate nosedive, and the sorts of games we loved most and grew up with just weren't being made as frequently or, frankly, with as much love and care as they once were.\nIndie game development really helped to reinvigorate both the sprite-based action-platformer genre and the magic of actual sprite animation. rdein's games combine what we’ve always loved about tight-action 2D gaming with splendid influences from more modern games like Dark Souls. The dedication to your actions necessitated by animation locks; the insane intensity driving the boss fights and how epic it is that this quaint little heroine can tackle these heroic endeavors; the attention to detail in the environments, designs, and animations... all of this stuff is simply stunning and rdein pulls it off to beautiful effect.\nThen there’s also the story itself, which is also a masterpiece in game storytelling: a strange, mysterious world that you inhabit with countless hopeless souls whom you are trying to save. There is painstaking detail in every item, every snippet of dialogue. You find yourself constantly readjusting how you feel about these people. You're trying to save them, but do they even want to be saved? Or should you be more worried about that awkwardly sinister tone in their voices...?\nMomodora: RUTM shouldn’t exactly be categorized as “Metroidvania” or “Souls-like”, but there certainly are elements of both contained within. It's a game of its own, and it’s one of the best entries in the mind-bogglingly expansive genre of side-scrolling action-platformers. We at Playism all love the game, and we can state with absolute confidence that if you’ve bothered to read this far, then you certainly will, too.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ACTIVE GAMING MEDIA","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":12726,"name":"Toki Tori","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2bb/2bbcb4cbb748512b386eedc0d2f1cfc7.jpg","description":"Toki Tori is a platformer puzzle game developed by Two Tribes.\n\nYou play as a tiny chicken named Toki Tori who accidentally falls out of a chicken coop. His brother and sisters fly in a mysterious castle. The tiny bird set out to find his family.\n\nThe players have to use a certain set of tools to get to all the chicken eggs in a certain amount of time. If the players misuse at least one tool, the level is rendered incompletable. Enemies are present in each level and the players have to avoid them.\n\nThe enemies follow simple patterns of walking back and forth. They turn around upon encountering an in-game object. If any enemy touches the protagonist, the level has to be restarted.\n\nThere are four worlds present in the game with fifteen levels in each. Tutorial levels are also available to the player. In order to unlock a new world, the player has to complete at least ten levels. The last five levels are much harder.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Two Tribes","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2866,"name":"LEGO Marvel's Avengers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4e/d4e0720282f967886af9cffd2ebb5e1d.jpg","description":"Avengers Assemble! The best-selling LEGO® MARVEL videogame franchise returns with a new action-packed, Super Hero adventure. Join the LEGO® MARVEL's Avengers team and experience a videogame featuring characters and storylines from the critically-acclaimed films and more. Play as the most powerful Super Heroes in their quest to save the world.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"}]},{"id":10301,"name":"Dead Island: Riptide Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c1/6c1eaddfb0e7861a799d273177492e45.jpg","description":"Continue the story of the outbreak and see another paradise gone to hell - fully remastered.Paradise gone to Hell!Welcome to the zombie apocalypse experience of a lifetime – and now more beautiful than ever. Caught in the midst of an epic zombie outbreak on the tropical island of Banoi, your only thought is: Survive!The Dead Island ExperienceSmash heads, crack skulls and slice ‘em up with visceral astounding melee combat and true story-based 4 player co-op in a sprawling open world just waiting for exploration.FeaturesIncludes all previously released DLC!Fully remastered: Experience Dead Island: Riptide in crisp full HD with improved graphics, game models and a photorealistic lighting system with physically based shadingAdrenaline-Fuelled Combat: Smash heads, crack skulls and slice ‘em up with the weapon of your choice in the visceral astounding melee combatSeamless Coop Multiplayer: Collaborate with your friends, live through a story of the struggle for survival in a world gone madExperience the atmosphere: Experience the dense atmosphere - feel the destruction, the horror and madness. Immerse yourself in the turmoil that is taking place on the Island.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Techland","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"}]},{"id":29233,"name":"Indivisible","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a8/6a806af1aa50b35b7f2ad08e7e7e180e.jpg","description":"Indivisible is an exciting RPG platformer set in an immersive, vibrant world that tells the story of Ajna, a good-natured tomboy with a rebellious streak. Raised by her father on the outskirts of their rural town, her life is thrown into chaos when her home is attacked and a mysterious power awakens within her. Her world now in chaos, Ajna sets out on a quest to save everything she knows from being destroyed.\r\nKey Features:\r\nMasterfully crafted story and characters: Indivisible tells the story of Ajna, and her quest to find redemption for her father and village. Throughout her quest, she’ll encounter an incredibly diverse cast of “Incarnations”, people whom she can absorb into herself and manifest to fight alongside her. There are many Incarnations to recruit, and by uniting unique characters from faraway lands, she will learn about herself and the world she inhabits.\r\nAction-packed battles: Obtain a variety of weapon types, learn new combat skills and recruit more than 25 playable Incarnations to build your battle party and engage monsters in fast-paced, strategic combat.\r\nBeautifully drawn characters and world: Building on its winning formula of 2D, hand-drawn animation with Skullgirls, LabZero draws inspiration from various cultures and mythologies to create visually dynamic environments and a rich cast of characters with unique stories of their own.\r\nUnique Battle System: The key to success is mastering your party’s attacks to create combos, and experimenting with new Incarnations and attacks to make the most out of every round. The active controls allow your party to function as a single, customizable fighting game character while switching between characters and unlocking new attacks as Ajna’s affinity for her weapons develops.\r\nBuild your Inner Realm: Along with her ability to absorb certain people, Ajna will also discover she can meditate and enter a mysterious dimension growing inside her. Once she discovers it, Ajna’s Inner Realm becomes the central hub for the game, where most of the game’s quests, upgrade and saving functionality resides. Simply pressing a button will send Ajna to this realm, sparing needless trekking back to towns.\r\nStellar soundtrack: Lose yourself in a stunning soundtrack by legendary Japanese game music composer Hiroki Kikuta who is responsible for is responsible for the amazing soundtracks to Secret of Mana, Seiken Densetsu III (Secret of Mana 2), Soukaigi, and Koudelka among others.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Lab Zero Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]}]