[{"id":277957,"name":"Space Haven","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a79/a79034d132c8c6427bfa0bf9b25b406c.jpg","description":"Space Haven is a spaceship colony sim throwing you in charge of leading a patched-together crew of civilians in search of a new home. It’s a base building game where players must build spaceships from the ground up tile by tile, create optimal gas conditions, manage the needs and moods of their crew, encounter other space-faring groups, and explore the universe in a self-built haven among the stars.\nSpace Haven allows for a lot of freedom regarding building. A functional spaceship can be built tile-by tile, giving you the opportunity to shape a spaceship of your own desire. It can be symmetric and streamlined, or an asymmetrical whimsical looking thing. It does not have to look like a conventional spaceship depicted in sci-fi literature, you are free to design your own, the choice is yours!\nSpace Haven’s core is built around the isometric tile-based gas system, which simulates various gases, temperature and crew comfort on a spaceship. The gas system combined with humans, plants and facilities all having their own reactions to gas levels create deep and emergent game play. When designing and building a spaceship, you need to secure facilities, optimize crew survival and well-being, but also think about possible future accidents and chaos generated from crew combat or environmental hazards. Gas conditions can be monitored using different view modes.\nThe game simulates needs, moods, and relationships of crew members. Each crew member has their own history of life before the apocalypse, their past life occupation and hobbies will affect their skills and know-how. Crew members will develop relationships with each other, good or bad. They will want to spend more time with some, while avoiding others. Witness depression, happiness and drama surrounding different crew members as you journey onward towards a new home.\nExplore a new randomly generated galaxy with your crew each time you start a new adventure. Throughout your venture your crew will meet other groups of humans escaping earth, as well as established factions looking to survive or take control of the galaxy. Trade, negotiate or attack. Navigate the star map and seek out resources to keep your crew alive and expand your spaceship.\nYour crew will have encounters with an alien race, often hiding in the shadows of a derelict ship. These aliens are capable of abducting your crew members and dragging them to their base. Will you try to save them or leave them behind?\nCool things that can happen in Space Haven:\nGain a new crew member by finding a hypersleep pod aboard a derelict ship.\nHave a space burial for your fallen crew member to let other crew members say good bye.\nGrow plants with bio mass and water recycled from toilets.\nEat the meat from a fallen crew member or invader as desperation is high.\nWatch aliens capture your crew member and plaster him to a wall in their base. Will you go save him or leave him there?\nWishlist and follow now!","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Bugbyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":31412,"name":"Need for Speed: Porsche Unleashed","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/236/236b79a5c51ed6bf59dffd2d24df30cc.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"}]},{"id":21413,"name":"7,62 High Calibre","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d0/1d0047af60e1043b0debfc1cc1c69bfe.jpg","description":"7.62 High Calibre is a tactical action game, sequel to Brigade E5.\nA professional mercenary is in pursuit of a certain Russian \"businessman\", who stole a large amount of money from his \"colleagues\". Now he is hiding in a small country of Latin America to avoid an inevitable punishment. What seemed like an easy task at first, soon turns into an intense and dangerous adventure, for there are many things that must be kept in mind - intricate political situation, confrontation between governmental military and rebels, not to mention a necessity to choose friends and foes wisely.FeaturesSequel to Brigade E5: New Jagged Union, the best strategy game according to the GameLand Award 2005, \"Best Computer Games\", \"GameLand\" and \"Game World Navigator\" magazines\nSPM (Smart Pause Mode) battle system combines RTS dynamics with diverse opportunities of turn-based gameplay\nOver 150 accurately modeled firearms with optional upgrades\nVaried ammunition as well as an extensive list of equipment\nNon-linear storyline gives you an opportunity to make your own choices and to reach one of multiple endings\nOver 30 mercenaries\nUpgraded graphics engine","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Apeiron","platforms":[{"id":0,"name":"PC"}]},{"id":20513,"name":"Apotheon Arena","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/20d/20d8d6398c7212126e05ba37a348a21d.jpg","description":"Apotheon Arena is the free online-multiplayer complement to the mythic Greek action RPG, Apotheon. Pit your skills with spear and shield against other players in brutal bronze-age combat. Battle across the statuesque arenas of Olympus, depicted with beautiful black-figure pottery artwork.\n-Totally free! No microtransactions or ads! If you already own Apotheon no need to download, you can play online with the regular Apotheon game also\n-Deathmatch, Team Deathmatch, and Team Elimination game modes.\n-Ten arenas to fight across; battle from the Grove of Artemis, to the Palace of Zeus\n-Dozens of melee and ranged weaponry. Slay with spear, sword, arrow and axe.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alientrap","platforms":[{"id":0,"name":"PC"}]},{"id":19643,"name":"Elven Legacy","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d0/6d01f279058b61389a22e47f42e7a8da.jpg","description":"The shadows of destruction begin to loom on the horizon once a human mage uncovers a dark and powerful secret dating back to the remote past of the Elven race.\nHowever, the Elves cannot allow this forbidden knowledge to fall into the hands of others and thus imperil the world. For the first time in countless years, this ancient race must venture forth and interfere with events transpiring in the lands of man. With the renegade mage in their sights, the sorceress Gilwen and ranger-lord Seagate set off together, unaware that beliefs and friendships alike will soon be tested...\nClassic turn-based strategy gameplay\nMultiplayer combat in 16 different scenarios\nMultiple endings which depend on your choices\nPowerful built-in game editor\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":19604,"name":"Avernum 2: Crystal Souls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/601/601ee22dca79f9914d07187a42d68406.jpeg","description":"Avernum 2: Crystal Souls is an epic, indie, fantasy role-playing adventure in a unique, massive world. The subterranean land of Avernum is full of strange caves, cunning dungeons, and the alien inhabitants of the underworld. Explore a massive, underground nation of tunnels and caverns, packed with over 100 towns and dungeons. Fight to complete up to three distinct game-winning quests.Avernum 2: Crystal Souls features:\nEpic fantasy adventure with over 50 hours of gameplay. An enormous underworld, with multiple nations and alien cultures.\nRich game system with over 60 spells and battle disciplines and a multitude of beneficial character traits to choose from.\nOver 100 towns and dungeons.\nThree separate game-winning quests. There are many ways to fight the invaders. Do just one of them or all three!\nUnique races and settings make Avernum different from any adventure out there.\nDozens of side quests and hundreds of magical artifacts.\nThe story of Avernum 2 is self-contained, and previous experience with Avernum games isn't required.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spiderweb Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":17040,"name":"Face Noir","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/767/76747ea6b57d19385c861fac8f9391ce.jpg","description":"A moody tale that combines the intrigue and atmosphere of a Raymond Chandler novel or Humphrey Bogart film with classic point-and-click adventure gameplay, Face Noir follows private eye Jack Del Nero as he’s falsely accused of murdering the man who left a little girl in his protection.\nAs Jack tries to figure out the identity of the girl and clear his name, the disillusioned detective finds himself up against a city infested with corruption and economic uncertainty. The more he uncovers, the more he discovers about the darker depths of human nature.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Mad Orange","platforms":[{"id":0,"name":"PC"}]},{"id":510,"name":"Fieldrunners 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/69b/69b8c6537418030d4e21e755a2306fdc.jpeg","description":"Get ready to DEFEND THE WORLD! The biggest sequel in tower defense history is finally here: Fieldrunners 2 has arrived! From Subatomic Studios, creators of the award winning classic strategy game comes an all new adventure that was years in the making. Build epic mazes out of powerful weapons to defend the world from the invading fieldrunners!\nThe fieldrunners are back! With legions of soldiers and a gaggle of new tricks, they’re ready to conquer the globe. Or so they think! Our top scientists at SubaLabs have built a bleeding-edge arsenal of devastating weapons for any heroes willing to stop these dastardly invaders. Help your people by taking action - DEFEND THE WORLD!\nStrategic-Action-Puzzle-Defense has never been this fun and addicting! Defend your world from the invasion by building winding paths out of imaginative, new weapons. Call in airstrikes and set explosive traps to hit the enemies where it hurts. Over 20 new levels span the grassiest fields, driest deserts, sparkling cities, and even an infernal volcano lair! Challenge your mind with the exciting new gameplay styles in Puzzle, Sudden Death, and Time Trial levels. Are you ready to stop the fieldrunners once and for all? Join the defense, now!\nKey Features\nPint sized invaders seeking revenge!\nA tower that launches bee hives!\nTons of levels in a 20+ hour campaign!\nRevolutionary AI - each enemy creates a dynamic, realistic path through the battlefield!\nGorgeous, hand painted, 2D graphics by award winning artists!\n20 unique, upgradeable weapons!\nCustom loadouts let you pick the perfect weapons for each battle!\nAir strikes, mines, and powerful items so you can strike with the precision of a surgeon!\nTime Trial, Sudden Death, and Puzzle maps bring all new challenges to tower defense!\nTrenches, bridges, and tunnels add new dimensions to gameplay!\nCollect all the Elite enemies to become the ultimate tower defense champion!\nA tower that turns enemies into barnyard animals!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SUBATOMIC STUDIOS","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":465,"name":"Enigmatis: The Ghosts of Maple Creek","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a6c/a6c940ab03d08e381ba07c3017571aca.jpg","description":"Imagine waking up after a powerful storm as the sun goes down. You find yourself just outside a small town on the side of the road. A shiver runs down your spine as your body remembers the recent dramatic events that your mind cannot or will not recall…\nWill you dare to solve the ages-old mystery of Maple Creek? What ancient evil lurks in the seemingly peaceful, pastoral lands of Vermont? Find a missing teenage girl and save yourself in the thrilling detective story, “Enigmatis: The Ghosts of Maple Creek,” an outstanding hidden-object puzzle-adventure game!\nFeaturesNamed one of the best HOPA games of 2011 (Gamezebo, Jay Is Games);\nFeatures the unique Evidence Board: collect evidence and draw conclusions to run the investigation and push the story forward;\nAAA-quality cinematics;\nBreathtaking scenery of autumnal Vermont;\nExtraordinarily immersive and multi-layered story;\nHours and hours of adventure filled with puzzles and riddles;\nSpecial Collector’s Edition version full of exclusive extras;\nBonus Chapter awarded for completing the game;","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":49302,"name":"Robo Rumble","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e97/e97d42d544c34d8bb4de32b17aac65ec.jpg","description":"RoBoRumble is a real-time 3D strategy game, offering two major battle campaigns consisting of 15 missions each and a multi-player mode with hot combat for up to four players at a time. One of RoBoRumble's key features is the unique way in which Units are assembled. Unlike most games of this type, where the player is given a palette of already designed Units to choose from, in RoBoRumble the player constructs his own from a palette of different components. This gives a far greater number of variations and adds an extra strategic dimension to the game.\nEach Unit (known as a \"Robo\") consists of a chassis and a weapon mounted on it. Available chassis designs range from two- or four-legged runners to jet-propelled, tracked or wheel-based craft and even tele-porters. There's also no shortage of weapons to mount on them. In addition to the standard lasers, heavy artillery and machine guns, RoBoRumble offers some imaginative creations like an \"Oiler\", that slows the enemy down by leaving slippery pools in his path, and the \"Whirlwind\", that picks up the enemy and throws him against the nearest wall. Each of the two parties in the conflict have eight different chassis and weapons to choose from. One side leans more toward \"brawn\", utilizing pure firepower, while the other tries the \"brains\" method of better weapons design. Whichever side the player chooses, only a small pool of weapons is available at the beginning. The player can increase the pool by giving out development contracts between missions.\nThe third optional component of a Robo is the so-called \"Booster\". This normally costs only a fraction of the other two components, but can have a huge effect on the game. Some Boosters double the Robo's speed, while others give the Robo more firepower or firing range, make him invisible, or increase his intelligence.\nThe relatively complex way of creating Robos stands in heavy contrast to the intentionally simple resource management. The source and at the same time, the main base, of the player's and the enemy's army is a dome-shaped, glowing \"Energy Pool\", which he must protect from attacks. The pool's capacity, which varies with each mission, is given to the player as a \"budget\" and used to create Robos. When a Robo is destroyed, his \"energy\" (the energy which was invested in creating him), flows back into the pool, so the player can build new units.\nThe base consists of three different energy levels. Whenever one of these levels comes under sustained fire and is destroyed, it triggers a violent explosion that, in turn, destroys all enemies in the immediate area. This \"cleansing\" effect sees to it that the defending party gains time to gather his troops and go on the counterattack.\nSTORY\nThe distant future – the planet Mars. The biggest arms contract in the history of the human race will be given to one side. The most powerful prototypes square off in a head-to-head battle. The winner closes the deal of a lifetime and gets the honor of defending Earth in the Final Battle against the evil Aliens. Will that lucky person be you?\nBuild powerful battle robots from components like Chassis, Weapon and Booster. The battle’s starting and you’re right in the thick of things – with freely definable camera perspectives, spectacular effects, unlimited zoom and scroll, colored light sources, terrain morphing and 3D sound. Pure action – pure excitement!Tactical 3D real-time strategy game which breaks free of the normal conventions\nMore than just a “shoot-em-up” – unusual features and innovative weapon systems add a complex element to this easy-to-play game\nOver 30 missions in two campaigns\nThe “building block” principle lets you assemble a battle robot to fit your tactics – literally hundreds of different combinations are possible!\nYou can freely move, rotate or tilt the camera perspective","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Metropolis Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":28536,"name":"Kane & Lynch 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/762/762e1c65ec3a00f85b08f04ab36fb54f_9bgcXuT.jpg","description":"The Games on Demand version supports English, French, Italian, Spanish.  (Online Interactions Not Rated by the ESRB)  After a simple job ends in a blood bath, Kane and Lynch are forced to face the consequences of their actions…","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"IO Interactive","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":17084,"name":"Red Comrades Save the Galaxy: Reloaded","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48f/48f2cb53b782cf6ce9e26280ae17be51.jpg","description":"Almost 17 years on, we bring you back the true Russian video game industry classics, remastered for modern platforms.\nThe first part of this classical game series will be released on PC on February, 5th . The game saves the original graphics and voicing but the game code has been completely rewritten for Unity engine and it has widescreen support now.  Any animation issues and old bugs have been fixed. Steam achievements and trading cards are also available. So from now on you can play in Red Comrades Save the Galaxy using any modern PC working on one of modern operating systems!\nAbout the game:\nRussia is in a midst of Civil War. Both the front line and Ural River splits the village Backwoods in two. One part of the village is somehow controlled by the brave Red Army division headed by Chapaev. Remnants of the cowardly Whites are still comfortably stationed on the other side.\nVasily Ivanovich Chapaev and his fellow aide Petka wake up to find themselves in a bad hangover and in a worse mood. They realize that someone has stolen the Red banner from the HQ. Our heroes are totally depressed with such a misfortune, just like every decent Red army fighters should be.\nThis unbearable offense leaves them no choice but to sneak into the enemy territory and to retrieve the precious banner.\nAlthough it's not the end of the story yet! Somewhere on the moon, legions of alien invaders prepare to conquer Earth. But could such a little thing really give a scare to the Red Army heroes?\nGame Features:\n•\tIncredibly lush new high-res hand-painted graphics!\n•\tAchievements!\n•\tThe beginning of the epic and captivate adventures of beloved characters.\n•\tBreathtaking story\n•\tEnormous amount of puzzles to solve\n•\tHilarious gags","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"S.K.I.F. Studio","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16573,"name":"Awkward Dimensions Redux","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58dc7ab011e6c874be04100f8e9b0a10.jpg","description":"Interactive Dream Journal & Diary; Awkward Dimensions Redux is a personal game. Lasts 20 minutes to an hour with less traditional interaction. Focuses on getting to understand another person through an interpretation of their dreams, thoughts, fears, desires, and past work. It's a game about conversing with roosters, disembodied legs, standardized tests, Immature jokes, relationships, art, espionage, and a teenager coming to terms with life and growing up.IncludesDiverse dreamscapes\nFantastic soundtrack with music from Clawfoot Slumber, Halina Heron, American Grandma, Pablo Garduno, Dong Lee, Steven Hamon, and Franz Liszt\nFMV segments\nA multitude of doors","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"StevenHarmonGames","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":12293,"name":"Super Galaxy Squadron EX Turbo","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a65/a65e071ae2320687f7c901b019347905.jpg","description":"2438. Eleven years after the First Ceti War. The United Interstellar Federation and a secluded alien race from Tau Ceti are locked in a tense stalemate. Seventeen of the best pilots in the Federation have been recruited to single handedly win the inevitable second war.\nSuper Galaxy Squadron EX Turbo is an expansion/remaster/one-step-from-a-sequel to 2015's Super Galaxy Squadron, and takes the original game's frantic action and modern accessibility to vastly greater heights. New and returning features include:\nSeventeen ships with unique stats and weapons to suit a variety of playstyles\nSix stages of classic shmup action (and savage bosses) in Arcade Mode\nAn infinite onslaught to satisfy your scoring itch in Endless Mode\nThe supreme timed challenge of Boss Rush Mode\nA range of difficulty options, from calm and newbie-friendly to basically impossible\nFully voiced cutscenes for the two people looking for a good story\nNew mechanics like Overdrive & Focus that help you kill more things and get more points\nA (nearly) complete graphical overhaul\nStill a whole lot of explosions (like you were ever worried)\nFeeling nostalgic, or just want to see what's changed? Super Galaxy Squadron EX Turbo includes the original Super Galaxy Squadron, so load up your smaller, slightly less pretty ship for a trip down (two year old) memory lane. Or don't. It's up to you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Synset","platforms":[{"id":0,"name":"PC"}]},{"id":9666,"name":"Dinosaur Hunt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c01/c01c5d03b66381ebc97d30580627761e.jpg","description":"WHAT IS DINOSAUR HUNT?\nDinosaur Hunt is a chaotic first person shooter that confronts heavily armed players with the most horrifying creatures that ever roamed the earth: Dinosaurs.THE SETTING\nThe world of Dinosaurs is a ride that you will never forget\nTHE PLOT\nThe story is mindblowing and will make you crying in the corner\nFEATURES\n1081 Achievements - thats right 1081 of them.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Racing Bros","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":413,"name":"So Many Me","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1b1/1b1ae596430c4ce10a0a7add1286afc5.jpg","description":"So Many Me combines puzzle-solving platform gameplay and the careful resource management of classic games like Lemmings!\nYou play as an unassuming green blob named Filo, who has an incredible ability: to control his many, many clones -- referred to as the “ME”. These clones possess all sorts of fun abilities that can be used to solve puzzles throughout the game. As you progress further through Filo’s adventure, you will find a variety of new types of clones. Understanding and harnessing their unique powers are key to your success.\nFilo’s myriad of adventures take him to a whimsical universe. It features a colorful art genre filled with adorable characters in their world’s mysterious environment.\nHonorable Mentions, Main Competition – IGF China\nIndieCade E3 Showcase – IndieCade\nUnity Showcase – GDC, China Joy, Tokyo Game Show, Korea Games Conference & G Star Global Game ExhibitionKey Features:Discover new transformational abilities as you progress through each chapter. Learning to master these forms and using them in sequence, is key to solving the game’s many puzzles.\nFilo’s endless adventures take you to a wondrous world of color filled with delightfully, intriguing characters.\nRide massive and powerful creatures. Utilize their unusual abilities to solve special puzzles and to smash through pesky obstacles on your way to the goal!\nBoss monsters, each with their own distinct characteristics, will try to eliminate you. Challenge and overcome them.\nEarn your rewards when you have solved the puzzles! Dozens of adorable costumes, ancient artifacts, and bonus levels are waiting for you!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Extend Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":292957,"name":"When the Darkness comes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cc7/cc7ffd4d8915cbff9ab77d550026df98.jpg","description":"A Game Without Meaning.\nA Game Nobody Should Play.\nWhen the Darkness comes is a walking simulator whose glitchy and dark tale tries to illustrate the hardships of depression and anxiety through a variety of imaginary digital landscapes.\nA clock, a piano and a girl. What do they all mean?\nWhat is meaning, anyway? What has meaning?\nDo you have one? A path, a goal, something determined, pre-determined?\nA light to follow?\nDiscover a world filled with loneliness and fear. A world where despair breathes and hope dies. A world about you, about us. A world about humanity and about life.Before StartingThis Experience is NOT for everyone.\nThis Experience explores themes such as depression, anxiety, verbal abuse, manipulative control, and suicide.\nThis game could also potentially trigger epilepsy attacks.\nSeriously, do NOT play this Experience if you believe this might affect you in any way.\nThe first Arc should take about one hour to complete.ControlsMovement: WASD or arrow keys\nInteract: F\nJump: Space\nSprint: Shift\nControls are customizable in the launcher (under the Input tab).","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sirhaian","platforms":[{"id":0,"name":"PC"}]},{"id":288661,"name":"Carcassonne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee8/ee8610ecaf643f53d66ba0704d6ddeef.jpg","description":"Play the original award winning board game Carcassonne with friends, family, or other board game enthusiasts - online or offline. Includes six expansions!\nBuild a medieval landscape, tile by tile, claim landmarks with your followers and score points. As a winner of the prestigious \"Spiel des Jahres\" award in 2001, the game allows for a plethora of play styles and strategies. If you like social gaming or board games you will love Carcassonne!\n\nFEATURES\n• Cross-platform play with iOS version\n• Official Carcassonne game with original artwork\n• Internet multiplayer\n• Unique Solitaire mode\n• Includes all expansions released for iOS:\n• \"The River\" adds a new strategic element to the game play\n• \"Inns & Cathedrals\" adds a double follower and tiles to upvalue cities and roads.\n• \"Traders & Builders\" with trade-goods, pigs and builders.\n• \"Princess & Dragon\" with dragon, princess, fairy and magic portals.\n• \"Phantom\" adds the phantom, a game piece you can place in addition to other followers.\n• \"Winter\" with a new theme, tiles, and the Gingerbread Man.\n• Easy mode that does not count fields, ideal for Kids.\n• 9 different AI players: Hans, Count, Countess, Maid, Servant, Juggler, Fortune Teller, Witch and Warlock.\n• Game Center Achievements\n• Comprehensive in-game manual\n• Play with Game Center friends","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":20329,"name":"Ubinota","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/250/2503ea2c174abc2ecde784555c48d4b2.jpg","description":"In a world where inhabitants live in the sky on floating islands made of cubes, a disaster threatens to make the population fall into the depths. The magic paint that keeps the cubes stuck together is drying out. Lucien, a trainee painter, fights with others against the disaster by repainting the islands.Key features:Smart puzzles in 3d in a zen world\nMagic paints with improbable powers, allowing many possibilities\nThe little adventure of Lucien, a trainee painter travelling through the sky\nMore than 100 levels to discover in 7 different skies","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rotateam","platforms":[{"id":0,"name":"PC"}]},{"id":20248,"name":"Brick-Force","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b84/b842481a622d52018e81b8114e9e68a6.jpg","description":"Brick-Force is a sandbox shooter that lets you create your own battlefield or join other players’ worlds to fight on their turf!\nFrom the sci-fi universe of “BrickStar” and the magical fantasy setting of “BrickSaga” all the way to the Wild West themed worlds of “Cowboys & Bricks”, Brick-Force offers you countless possibilities to build, share, and play on your very own battlefield, using hundreds of different bricks, outfits, weapons, and much more.Features Swiftly create awesome maps and share them with the world\nFight alongside your friends in 8 bricktastic PvP & PvE game modes\nCustomize your character with hundreds of costumes and clothing items\nAccess a loaded arsenal that ranges from lollipops to laser rifles\nRegular themed updates with new settings, features, and possibilities\nOver two million players have already started building virtual worlds in Brick-Force. Using various types of bricks and even interactive elements such as turrets, mines, and portals, they create architectural masterpieces which serve as the setting for several different shooter modes. There’s a bit of an architect hidden inside every one of us, so get in the sandbox and play! In Brick-Force, you can fulfill your creative impulses and build a world that suits your tastes, either by yourself or together with friends.\nDiscover the worlds created by other players or share your own maps with the Brick-Force community! More than 1,200,000 worlds have been built in Brick-Force to date, and they’re just waiting for you and your friends to come explore them.\nThe shooter modes of Brick-Force offer an exciting change of pace from building. Grab your weapon and transform from a master architect into an elite soldier. space marine or colt-swinging cowboy! Defend your own world with sniper rifles, pistols, frying pans, and more – or bring your fight to some of the very best maps made by the community! Brick-Force offers many different game modes, including team and individual Deathmatch, Capture the Flag, Build and Destroy (where you can build and fight at the same time), Defusion, Freefall, Zombie Mode, and Defense Mode.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Exe Games","platforms":[{"id":0,"name":"PC"}]},{"id":19472,"name":"Rise of Flight United","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff3/ff33f8b67d6e0a04273260e43901dd93.jpg","description":"Rise of Flight is the most realistic WWI PC flight simulation ever created. Take to the skies of war torn Europe and experience daring air combat at the dawn of aviation. Re-enact famous air battles fought by legendary aces such as Manfred von Richtofen, James McCudden, Georges Guynemer and Eddie Rickenbacker. Rise of Flight transports you to a time when courageous pilots fought each other for control of the sky high above the bloody trenches. In aircraft made of canvas and wood they battled to the death. While some survived to become legends, most met a fiery fate. Do you have the skills and the courage to become an Ace?\nThe free-to-play Rise of Flight United is just the beginning of your adventure. There are 35 additional flyable aircraft available for purchase along with additional content from the Steam store in the form of content packs. These packs include not only airplanes and additional theaters of war, but other helpful items such as Field Modifications and Weapon Modifications for your aircraft which can help you be a more effective combat pilot. The Rise of Flight universe continues to expand with new flyable aircraft and game updates added on a regular basis. The sky knows no limit.The free-to-play Rise of Flight United allows you to:\nPilot three fighter planes (Spad 13, Albatros D.Va and Nieuport 17 by Dux plant) with all their modifications included against any planes in the game.\nAccess Training campaign, Quick Mission Builder, Career mode and pilot the aircraft you have in multiplayer.\nEnjoy advanced graphics featuring High Dynamic Range (HDR) lighting, blinding sun glare, beautiful sunrises and sunsets, dark moonlit nights with stars and realistic looking raindrops and oil splatter on pilot goggles.\nExperience a cutting edge flight-sim with advanced flight-models, adjustable difficulty settings, a complex physics engine and an industry leading progressive damage model.\nPractice teamwork with your friends by manning additional gunner positions. You get unlimited access as a gunner to multi-crew airplanes in Multiplayer matches. Protect your plane’s six o’clock!\nEndure G-effects with blackout, red out and wounded pilot effects featuring blood splatter, ringing ears and control difficulty.\nExplore huge maps of Western and Eastern fronts of World War I.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"777 Studios","platforms":[{"id":0,"name":"PC"}]},{"id":10817,"name":"Bridge Constructor Playground","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/957/9575ef30b113e0f3f4d629a64474212d.jpg","description":"Bridge Constructor Playground offers people of all ages an introduction to the topic of “bridge building”. This game gives you the freedom to let your creative side run riot – nothing is impossible. Across 30 innovative levels you have to build bridges over deep valleys, canals or rivers. Following this your bridges will be subjected to a stress test to see whether they can support the weight of the cars and/or trucks which drive across them.\nIn comparison to the #1 hit Bridge Constructor, Bridge Constructor Playground offers an even easier entry to the game including an extensive tutorial. With no fixed budget, and next to no limitations on building materials, there are almost no limits: you can build and construct to your heart’s desire. Here you are free to do as you please and let the time fly by with creative bridge building. Experienced players will enjoy the challenges of the new badge system: for every bridge there are 5 badges to be won for which you must fulfill certain requirements. For example, building a bridge that can carry no more than a certain load limit. All of this, paired with a bright and friendly look, makes Bridge Constructor Playground an exciting and also educational experience for the whole family, offering hours of gaming fun.Key Features32 Levels\n5 Settings: City, Canyon, Beach, Mountains, Rolling hills\nSurvey map with unlocked worlds / levels\nExtensive tutorial for easy entry to the game\nNew badge system for beginners and pros\n4 different building materials: wood, steel, steel cable, concrete piles\nPercentages and colored visualization of building material’s stress loads\nTwo different stress levels: car and truck\nHigh score per Level\nSteam Achievements and Leaderboards","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Headup Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":23129,"name":"Medal of Honor: Pacific Assault","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/775/77548bc36660d2d86cc91142148d5a9c.jpg","description":"Medal of Honor Pacific Assault puts you in the boots of a WWII soldier in the Pacific Theater of Operations. As Marine Private Tommy Conlin, you must survive the devastating attack on Pearl Harbor and then join the Allied crusade to defeat Imperial Japan's bloody conquest of the Pacific. From the attack at Pearl Harbor to the pivotal battle against Japanese Forces at Tarawa Island, Medal of Honor Pacific Assault gives PC gamers a sense of the courage it took to endure and overcome the Japanese threat in WWII and fight for VICTORY in the Pacific.Historical Backdrops - Experience missions set at historically accurate backdrops including Pearl Harbor, Guadalcanal, and Tarawa.\nBond With Your Squad - Get to know the Marines who you'll be fighting alongside. Each has a unique personality and backstory. When new recruits arrive, get them experience to increase their proficiency.\nMore Weapons - Take to the battlefield with historically accurate handguns, machine guns, rifles, shotguns, explosives, and more!","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Electronic Arts Los Angeles","platforms":[{"id":0,"name":"PC"}]},{"id":17997,"name":"Fly'N","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7a6/7a6055b341a0f73529b0fcf9029eb6af.jpg","description":"Steam Greenlight\nAbout the Game\nSomewhere between a platformer, a puzzle game and a great big dollop of pure fun, Fly’N will challenge your skills through more than forty levels set in a luxuriant world featuring charming visuals.\nExperiment with the four Buds and their individual powers to save the World-Trees from Dyer, the loony hair-dryer who intends to destroy their Helys! Redistribute the Helys and play with the environment to free the inhabitants of Helicia.\nIt’s up to you to control the Buds: four different characters with unique powers, guardians of the World-Trees.  Watch out - Their path is peppered with pitfalls, each one more hazardous than the rest! When you find yourself in a tricky situation, you’ll have to figure out the right combination of powers and actions that will save the day…Key Features:Experiment with the four Buds and their individual powers to save the World-Trees:\nFly'N uses his singing to interact with his environment and keep moving.\nLyft can stick to almost any wall.\nYwok, once inflated like a balloon, is invincible and bounces everywhere.\nNyls propels himself through the air.\nSwitch between Innate and Subtle Visions when to find your way through\nRedistribute the Helys in order to play with the environment and free the inhabitants of Helicia\nChallenge your skills through more than forty levels.\nReach the top tier of the STEAM leaderboards and compare your scores with your friends and the developers.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Ankama","platforms":[{"id":0,"name":"PC"}]},{"id":17421,"name":"Winter Voices","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0e4/0e49b2540adbfd3251b98f927b9b1504.jpg","description":"A unique adventure, a stunning scenario to discover in one season!\nWinter Voices is a narrative-driven, episodic, role-playing game set in an imaginary and timeless world at the start of the Industrial Revolution. Players control a 24 year-old heroine as she deals with the death of her father. She must journey through the heart of Winter and battle her worst enemies – her own personal demons.\nThe first season of the Winter Voices series is comprised of seven downloadable episodes, each unraveling new elements of the character’s tale.\nWinter Voices combines “point and click” real-time gaming with strictly defensive turn-based combat. As the game alternates real-time dialog and world exploration with combat, players will experience turn-based psychic warfare.\nKey Features:mature and creative narrative, exploring human consciousness and immersing in an evocative and chilling role-playing experience\nsophisticated and thought provoking gameplay: the player engages in “defense of the mind” mechanics, as the character is overwhelmed by memories and fights against her own inner demons, fears, voices of illusion, guilt, madness...\ntactical... with a twist: strictly defensive turn-based combat\nwondrous and unusual world: an imaginary and timeless world at the start of the Industrial Revolution\ndynamic soundtrack: keeping to the theme of self-discovery, haunting melodies guide the player, setting a dark, intriguing mood to match the character’s cold journey and mysterious past\nWinter Voices Prologue: Avalanche\t\t\t\t\t\t\tA drama is unfolding in a tiny village buried in snow, lost in the depths of a Three-River Principality valley. A sudden death, a now-hostile home, new sensory capacities  rising like a storm and the departure towards the unknown, the only means to escape besides death, has become inevitable...The newly-orphaned heroine is pushed to leave her father’s village by the voices of her unconscious mind.  The long journey to find answers will lead you through many events to overcome anger, sadness, pain and fear and finally unveil what is whispered by the voices of Winter.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"inner seas","platforms":[{"id":0,"name":"PC"}]},{"id":485218,"name":"Tormented Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1e/a1efdea31e35beddae46d37aee4d64c7.jpg","description":"Survival Horror inspired by the original Resident Evil and Alone in the Dark series. With a fresh twist on the fixed perspective adventure, Tormented Souls modernises for a new generation - as Caroline Walker investigates the mysterious disappearance of twin girls in a terrifying mansion.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Dual Effect","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":255842,"name":"Vambrace: Cold Soul","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a0d/a0dbc7462cbdc18ee621b8e9448155da.jpg","description":"The King of Shades has cursed the great city of Icenaire. Now cast under a permanent blight of frost fall, its former residents have returned from the dead as mad Wraiths. Survivors take refuge deep underground where they lead a desperate campaign against this unearthly power. Woefully outmatched, they are forced into hiding as the King of Shades amasses an army of the undead above them. One fateful day, a mysterious stranger appears in the city with an enchanted vambrace. She may now be their only hope…\nYou are Evelia Lyric, bearer of the Aetherbrace and the only human capable of entering Icenaire. The survivors now look to you as their best hope against the King of Shades. Only one problem...you’re woefully outmatched, and survival is not guaranteed.\nVambrace: Cold Soul is a narrative-driven game filled with memorable characters, brutal challenges, and deep strategy. To succeed, you must choose perceptive party leaders, camp to recuperate, navigate strange encounters, and survive deadly combat. Will you scavenge for supplies to sell or use them to craft new items for your next expedition? The surface of Icenaire is cold and unforgiving. So, prepare your party well before departing...lest you join the cursed city's undead.\nIn this game, the difference between life and undeath all comes down to good planning and smart tactics!\nEmbark on an epic fantasy-adventure spanning 7 intriguing chapters.\nComplete sub-quests to unlock up to 26 new, thematic character skins.\nAssemble your party from 5 races and 10 unique classes of recruits.\nCraft items and armor from precious materials gathered on your trips.\nMake crucial decisions where one wrong turn can seal your party's fate.\nPrepare well well or condemn your comrades to permanent death.\nFind codex pages to expand upon Ethera's history and mythical lore.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Devespresso Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"}]},{"id":27819,"name":"Letter Quest: Remastered","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d7b/d7b273d90ff2438106c8938e47e6d356.jpg","description":"The grim reapers Grimm and Rose need your help to defeat a legion of\nmonsters, ghosts, and evil bunnies using the power of words!\n\nSpell words to battle monsters and earn gems that can be used to\npurchase upgrades, books, special items, potions, and much more! Letter\nQuest is a turn-based RPG featuring high-res artwork, clever wordplay,\nand two great soundtracks. Use your linguistic skills to survive!\n\nDemolish your foes with tons of upgrades, weapons, books, and more!\n\nJourney through a land filled with 40 stages, each playable in 4\ndifferent ways!\n\nUse your vocabulary to help our heroes vanquish over 30 unique\nmonsters!\n\nTry your hand at the challenging endless mode - how far can you get?\n\nMarvel at the beautiful high-res art and animations!\n\nEnjoy two full soundtracks - choose your favorite!\n\nOvercome the challenge of earning all 60 achievements!\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":20961,"name":"Shadows: Price For Our Sins Bonus Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db9/db9a97434cb809dd3bedc8af081b8f57.jpg","description":"Are you ready to party? A chilling night of reckoning is unleashed upon guests bold enough to party on Halloween at an abandoned farm house.\nAs children, you and your friend, Samantha, would play at an old farm during your summer vacations. Years have passed, and Samantha has invited you to join her and a group of fellow students back at the farm for a Halloween party. Little does anyone know - but a demonic force will be crashing the event.\nWhen the partygoers game spirals out of control, a portal to a world of darkness opens to imprison their youthful souls. They soon join company with the rest of the cursed souls collected by the lord of darkness. You alone are their sole hope of rescue.\nA freakish fest filled with menacing mysticism awaits your arrival ... That’s of course, if you’re not too afraid to RSVP.\nBONUS CONTENT:\nWallpaper\nSoundtrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"8th Floor Games","platforms":[{"id":0,"name":"PC"}]},{"id":20761,"name":"Plug & Play","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61e/61e9a93715636325d5938582f770c2eb.jpg","description":"Explore the universe of Plug & Play, an interactive animation drawn by Michael Frei and coded by Mario von Rickenbach. An unashamedly surreal play with plugs.\nPlay time between 10 – 15 minutes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Mario von Rickenbach","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":524,"name":"RWBY: Grimm Eclipse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58d9535f8aaeba07876cec37bc8886a1.jpg","description":"RWBY: GRIMM ECLIPSE is a 4 player, online co-op, hack and slash game based upon Rooster Teeth’s international hit series RWBY.\nGet ready for intense combat action as you battle Grimm across familiar locations of Remnant including new areas never before seen in the show. Play as Ruby, Weiss, Blake, and Yang in this character-driven adventure that explores new storylines, new Grimm types, and a new villain!\nThe fast paced, hack and slash gameplay takes inspiration from games such as Dynasty Warriors, combined with team play elements from Left 4 Dead, to create over-the-top, co-op combat along with engaging missions and storytelling.\nFEATURES:\n4 Player Online Co-op (Multiplayer)\nPlay as Team RWBY - Ruby, Weiss, Blake, or Yang, each with their own unlockable abilities and upgrades\nExperience an exclusive storyline with new locations, enemies, and a new villain never before seen in the show\nFull voiceover from the cast of the show, plus new voice talent\nRanked challenges, unlocks, and achievements\nHorde Mode featuring 3 unique maps focused on intense co-op action, strategy, and defense turrets. Protect security nodes and survive waves of Grimm!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Rooster Teeth Productions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":331267,"name":"TrackMania","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f4/6f473ae1a810ad2eff721b00a2d7173f.jpg","description":"RACE SOLO OR WITH FRIENDS\n• Unlock medals, trophies, and prestige skins.\n• Climb the leaderboards in the intense versus-style Ranked mode.\n• Race on wacky tracks in Royal mode, our 60-player showdown.\n• Cross-play and platform progression lets you play anywhere!\nEVER-EVOLVING CONTENT\n• Enjoy new campaigns every three months.\n• Compete on Track and Cup of the Day with tracks made by players, curated by Nadeo*.\n• Join and manage community club activities, and access car skins, online rooms, competitions, and more*.\n\nCREATIVITY UNLEASHED\n• Create endless possibilities with the track editor.\n• Design incredible car skins**.\n• Show off your skills with the replay editor**.\n\n*Standard and Club access features\n**Unavailable on consoles","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nadeo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":19285,"name":"Faces of War","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c14/c14a2db2f26ded93da60a00239c99f19.jpg","description":"Through the eyes of Allied, German and Russian squad leaders, experience the most immersive World War II time strategy game where each battle is played out and\nwon differently based on your tactical choices.Key features:Get immersed in the heat of the world war II, command American, English, Soviet and German troops during world-renowned battles that include D-Day, new winter missions and the storming of Berlin\nComplex team AI for new tactical opportunities: AI controlled soldiers don't simply execute any order given by a player, they think how to do it in the most efficient and safe way.\nRealistic physics: anything can be destroyed or manipulated and used to player's advantage\nImprovised player tactics, advanced AI reactions and real time physics guarantee players that missions will never be fought the same way.\nUp To 16 players via LAN.\nFaces of War is affected by the GameSpy shutdown on the 31st of May. You can continue to play the game through LAN, DirectIP and GameRanger.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Best Way","platforms":[{"id":0,"name":"PC"}]},{"id":16133,"name":"Egyptian Senet","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc9/fc9e1262a28141c6f3983460fe72c59b.jpg","description":"New Important Note: To make the gameplay easier and more fun, you can press spacebar to throw the casting sticks instead of mouse click.\n*************************************************************\nENJOY END OF SUMMER & BACK TO SCHOOL BIG SALE\n*************************************************************\n************************ HAPPY EID :) **********************\n====== Awards ======\n◆ 1st Winner Of Egypt e-Content Award 2013.\n◆ Silver Winner in 2013 W3 Awards.\n◆ 3rd Winner Of Gaming Egypt Contest 2012 organized by iTi.\n◆ Nominated for the World Summit Award 2013 in e-Entertainment & Games from Egypt.\n◆ Nominated for Top 20 Mobile Apps in Mobily KSA Developers Award 2014.\nEgyptian Senet (Ancient Egypt Game).\nThe Mysterious Afterlife Journey And The Favorite Pastime Of The Pharaoh Tutankhamun.\nThe Artifact Of The World's Oldest Board Game Found In King Tut's Tomb, Beside The Golden Coffin & Sarcophagus.\nAfter performing opening of the mouth ceremony on your mummy by Anubis, you start your afterlife journey protected by Eye of Horus(Wadjet) to pass through the underworld realm of Osiris, challenging an invisible adversary inside an Egyptian hidden tomb in The Valley of the Queens located near the better known Valley of the Kings, on the west bank of the Nile river across from Thebes (Luxor).\nSenet is a board game from predynastic and ancient Egypt, it is the earliest known record of a backgammon , checkers, draughts, ludo and chess like games.\nThe oldest hieroglyph representing a Senet game dates to around 3500 BC.The full name of the game in Egyptian was meaning \"The game of passing\".\nGames have been around for thousands of years, but none are older than the ancient game of Senet, invented by the Egyptians roughly 3500 or 5000 years ago. It is believed that this two-player board game originated as a popular form of recreation with both royalty and peasantry. But by the mid-13th century BC, Senet had evolved into a more religious ritual. Some depictions from this time period forward show the game being played not by two people, but rather as a deceased player competing against an invisible adversary, interpreted by some to symbolize the deceased players own soul.\nThe board has become a metaphor for the afterlife with pawns moving across the board just as a soul moves through layers of the netherworld after death. Reaching the final space and leaving the board is the goal of the game, just as reaching Horus and leaving the netherworld was the goal for the Egyptians after their death for attaining rebirth with the gods Isis & Osiris, Sekhmet & Bastet holding the Egyptian Ankh or the papyrus scepter.\nThe game board consists of 30 squares or slots, arranged in 3 horizontal rows of 10. Pawns move from left to right through row 1, then drop down and move from right to left through row 2. Dropping down again, pawns move from left to right along row 3 and finally, off the board. The game uses the rules developed by Timothy Kendall in his 1978 work, Passing Through the Netherworld :The Meaning and Play of Senet, an Ancient Egyptian Funerary Game.\nThe game includes five special squares, governed by their own rules, each containing a hieroglyphic. Square 15 is the House of Rebirth; square 26 is the House of Beauty; square 27 is the House of Water: square 28 is the House of the Three Truths; square 29 is the House of Two Truths; and square 30, the last, is the House of Horus, the Egyptian falcon-god and lord of the sky.\nEgyptian Senet is a pharaonic challenging game that combines luck,strategy,and magic features authentic photos of ancient Egyptian temples,plus artistically crafted graphics and animation of an ancient stone game board and pieces,set in an echoing,tomb-like chamber.Ritualistic music plus sound effects of stone pieces moving recreate the atmosphere of predynastic Egypt.The App's Icon shows the Egyptian Queen Nefertari playing Senet in her tomb,she was the great wife of the pharaoh Ramesses II(Ramses)Rio. Also many Egyptian Queens have a similar photos playing Senet such as Cleopatra,Nefertiti the great royal wife of Akhenaten,and the Queen Hatshepsut the wife of Thutmose II.\nSupported Languages in year 2016 - 2017 - 2018 : (English, Arabic, French, Spanish, German, Italian, Dutch, Russian, Japanese, Korean, Chinese, Portuguese-Brazil)\nSuitable for everyone Adults and Kids.\nPerfect relaxing and time killer (timekiller) game with good prices for all countries.\nHighly Recommended for anyone interested in Egyptology, Archeology, Sphinx, Mythology, Archaic, Arcane, Agony, Edu, Monopoly, Atypical, Indiana Jones, Nancy Drew, Compulsive,Tic Tac Toe, Very Positive, Overwhelmingly Positive,Outstanding, Uncommon and Unusual Games.\nFor More Info (Information):\nSupport Email: ezzatstudios@gmail.com\nFacebook Page: https://www.facebook.com/EgyptianSenet","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ezzat Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":14806,"name":"Starward Rogue","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/caf/caf773765821e38a5c4d6bce32cb1d48.jpg","description":"Roguelite catacombs that evolve and expand with each of your successes.\nHundreds of items, enemies and rooms, and dozens of epic boss fights.\nFully playable with keyboard+mouse or gamepad.\n5 difficulty levels range from \"Relatively Easy\" to \"Nigh Impossible.\"\nPlay as a \"head in a mech\" harvested from the neck of everyone's favorite Hydral.\nFind secrets of The Megalith, a giant structure lodged in a star, as you lose many heads.\nFigure out what happened to Rodney, an AI redshirt of uncertain motives.\nOver-the-top mod support.  Detailed wiki: create enemies, items, weapons, and rooms.\nSecrets!  Among them \"incredibilities\" that massively change the way the game plays.\nVaried mech suits: dipole magnetism, time control, and more.\nUpgrade during each \"run\" via EXP/Perks, shops, and items found while exploring.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Arcen Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14700,"name":"TransOcean: The Shipping Company","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd1/dd1dd3d1016473e6e1799fd2562a6d48.jpg","description":"Bundle Offer\nGet two hit management simulations from the quills of Deck13 Hamburg with the TransOcean 1 + 2. Start at the beginning of the series with TransOcean: The Shipping Company and its exciting adventure set among the floating giants of cargo shipping. In TransOcean2: Rivals experience the next exciting installment in the tale of loyalty, betrayal, and world dominating empires. Plus, pit yourself against friends in the competitive multiplayer mode.\nAbout the GameTransOcean – The Shipping Company is your ticket to the world of gigantic ships and transnational transport empires. Build a mighty fleet of modern merchant ships and conquer the seven seas. Track your routes and real time, take the controls as ships enter and leave the harbor, and see to it that freight gets loaded efficiently. Keep in mind that time is money! Excessive lay days are taboo.\n55 of the largest and best known, as well as the most exotic harbors in the world await your visit; one of these is your home harbor, which you will choose yourself. Every harbor has its advantages and disadvantages, so you should carefully consider which one you choose. A highly polished bonus system will lend an element of suspense to every decision. And with 20 classes of ship available, you will have to bear a lot of factors in mind: is your new ship designed for the Panama Canal, or will you have to take a longer route? Would you rather take the shortest route through the Suez Canal, or head for the ports of Africa to land other lucrative assignments? Are you likely to encounter a storm on your chosen route, or is there currently a threat of piracy somewhere along the way? Is there even adequate space at your destination port for your newest freighter?\nPainstakingly crafted harbors based on real-world models as well as realistic ships and routes make TransOcean – The Shipping Company a unique gaming experience. An elaborate trade system with dynamic prices allows you to constantly keep an eye on the most lucrative routes, as this is the only way you can secure the best jobs. Try to keep a balance between expenses and profit, and keep your nerve when you have to choose between different possibilities: would it pay to smuggle goods, or would you risk your good reputation? Then consider that the more successful you are and the better your reputation is, the better the offers you will receive. In online mode, you can compete with other players for the more lucrative routes and the best prices; the law of supply and demand applies in this case. Numerous paths can lead you to your goal – find the right strategy to continually expand your empire and become the most successful transport company of all time!FeaturesComplex assignment management that always poses new challenges55 detailed harbors, 20 of which have iconic landmarks20 realistic ship classes with ships that have to be maintained22 trade goodsExciting chance occurrences and global events influence what happensSelf-guided or automated mooring and casting offOnline mode: other players influence routes and commodity prices","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Deck13 Hamburg","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13325,"name":"Disgaea 2 PC","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2bb/2bb34913733796eb9f86ee0345c672ec.jpg","description":"~ The DEFINITIVE Edition! Includes all content from Disgaea 2: Cursed Memories (PS2) and Disgaea 2: Dark Hero Days (PSP) ~\nDarkness is back. Overlord Zenon has cursed the land, and now, Veldime is transforming into a nasty Netherworld. Memories are sterilized, bodies demonized, the world is falling into chaos. The only one unaffected is a young man, Adell. He stands up to fight the curse, but things never go as planned. The haughty daughter of Zenon, a filthy little frog, lovable demon siblings and a washed-up rock star!? No one can ever predict what goes on in the world of Disgaea. And of course, other Overlords refuse to sit still watching...\nKey Features:\nChoose from over 200 character classes for your squad!\nAll-new Dark Court system where the good are punished and the evil praised.\nThe Item World is back! Customize your items to make them even better.\nUtilize the new Stack Attack option, adding another layer of strategy.\nEnter the Dark World: a hardcore world setting where you can display massive amounts of damage!\nPlay through Axel Mode and help Axel regain his popularity!\nHead over to the Land of Carnage, defeat high level enemies, and claim victory!New to Disgaea 2 PC:\nUpdated UI, keyboard and mouse support\nNew keyboard shortcuts\nPlayable on Macs & Steam Machines!\nThree playable characters that never made it to the West: Dark Eclair, Gig, and Miabel!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Nippon Ichi Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":7660,"name":"Dead In Bermuda","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/492/492c53889b5ee4b6c81a58251458c80b.jpeg","description":"DEAD IN BERMUDA is a survival management game with RPG and adventure elements, in which you lead a team of 8 survivors from a plane crash on a strange island. Assign your survivors to tasks, gain experience and develop your survival skills, research and craft new items for the camp, explore the island for resources and solve the mysteries behind an ancient atlantean prophecy.Key FeaturesManage the well-being of your team: they can die from Hunger, Fatigue, Sickness, Injury and Depression as well as lack of water.\nRelationships between characters evolve! They can argue, become friends and even lovers.\nResearch & Craft to upgrade your camp.\nDeep RPG system running behind the scenes: the efficiency of every action is tied to character skill, opinions and the state of the character.\nExploration: 100 map areas to discover, each with its own rewards… or traps!\nRandomized elements: the map, the items, the dialogs, the skills and traits of your characters changes every new game.\nSpecial encounters in the jungle with choose-you-own-adventure like elements.\nEasy to play, but hard to survive!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":4760,"name":"Ghostbusters: Sanctum of Slime","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e58/e58997f3cb18a9bb0650eab5e985aa5f.jpg","description":"Strap on your proton packs for an all-new Ghostbusting adventure! Ectoplasmic threats are spawning all over New York, and only you and your team of rookie Ghostbusters™ can stop them. Choose from 4 new playable characters. Hop in the all-new ECTO-4WD and blast your foes with a medley of destructive weapons. Battle against the hordes of evil entities alone or with a team of friends through local or online multiplayer co-op. Show them you ain’t afraid of no ghosts!\nGHOSTBUSTERS: Sanctum of Slime: TM & © 2011 Columbia Pictures Industries, Inc. \"GHOSTBUSTERS\" with the \"GHOST DESIGN\" is a registered trademark of Columbia Pictures Industries, Inc. \"GHOSTBUSTERS\" and \"GHOSTBUSTERS 2\" movies: © 1984, © 1989 Columbia Pictures Industries, Inc. All rights reserved. Game Software excluding Columbia Pictures Elements: © 2011 Atari, Inc. All rights reserved. Developed by Behaviour Interactive Inc. Marketed and distributed by Atari, Inc., New York, NY.  Atari and the Atari logo are trademarks owned by Atari Interactive, Inc. All other trademarks are the property of their respective owners.  The ratings icon is a registered trademark of the Entertainment Software Association.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Activision","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":747,"name":"NBA 2K17: The Prelude","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a49/a491d3882b6989ef1698e74502704d7d.jpg","description":"Get a head start on your MyPLAYER career for free! Choose between 10 great colleges and play to improve your draft ranking. Your progress in the Prelude will transfer over to NBA 2K17.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"2K","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]}]