[{"id":274480,"name":"Mortal Kombat 11","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eb5/eb514db62d397c64288160d5bd8fd67a.jpg","description":"Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment, brings you so close to the fight you can feel it. And featuring a roster of new and returning Klassic Fighters, Mortal Kombat's best in class cinematic story mode continues the epic saga over 25 years in the making.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"NetherRealm Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":2518,"name":"Max Payne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2f5/2f5eb72fe45540e93ac2726877551a20.jpg","description":"Max Payne is a man with nothing to lose in the violent, cold urban night. A fugitive undercover cop framed for murder and now hunted by cops and the mob. Max is a man with his back against the wall, fighting a battle he cannot hope to win. Prepare for a new breed of deep action game. Prepare for pain...\nDeveloped by Remedy Entertainment and produced by 3D Realms, Max Payne is a relentless story-driven game about a man on the edge, fighting for his justice while uncovering plot-twists and twisted thugs in the gritty bowels of New York during the century's worst blizzard. Max Payne is an original third-person 3D game based on the MAX-FX engine and uses photo-digitized textures and radiosity lighting, resulting in one of the most realistic looking games ever seen on the PC.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Remedy Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":9653,"name":"Hacknet","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/23b/23b69bfef2a1ce2e3dcdf1aa8ef1150b.jpg","description":"Hacknet is a computer hacking simulator. You take on the role of a user nicknamed Bit and need to investigate the death of the previous \"Bit\" that was probably involved in illegal activity. To get through the story, you search for the files on other computers that can help to reveal the truth about your predecessor. \nHacknet combines a graphical interface with a text-based console creating the impression of real hacking software. As a rule, every mission consists of connecting to another computer, breaking its protection system and getting special privileges and access to the database. You need to complete the mission before the speed countdown reaches zero. If you fail, you’ll have one more try to finish the level.\nHacknet is expanded with Hacknet Labyrinths DLC that adds two more chapters to the story, new hacking tools, and a fully new soundtrack.  The game can also be modified by players.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team Fractal Alligator","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":9793,"name":"Guns of Icarus Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/179/179245a3693049a11a25b900ab18f8f7.jpg","description":"The player is one of the four members of the combat airship team in the alternate steampunk world. At the disposal of the player are several ships with different characteristics and weapons. Vital ship systems can be damaged and repaired, all damages affect the combat capability of the ship. You can choose who to be on the team: pilot, engineer or shooter.\nIn PvP mode, two teams participate, each team includes 2 to 4 ships. The purpose of the game varies, but, as a rule, it is the destruction of the ships of the enemy team or capture of control points.\nIn PvE mode, all players are combined into one team, which can include from 1 to 4 ships. Own unique PvE modes include defence of the base, destruction of enemy bases, interception of enemy ships, battles with boss ships and others.\nIn addition to PvE mode, there is a war scenario of six parties: players earn points to enforce their party in the process of capture or defence of territories.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Muse Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17803,"name":"Ryse: Son of Rome","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/736/736c0eaec96d848d7824b33298a182f2.jpg","description":"The action of Ryse: Son of Rome is set in the capital of the Roman Empire, which is besieged by the Celtic barbarians led by Boudica. Emperor Nero says from the balcony of the Palace that the defenders of the city should protect him. Marius, the General of Rome (you will play for him) and the commander of the defenders, gives a small sack to a subordinate with the instructions to display it, saying this is the key to victory. Then he secures the ruler in the secret room and begins his story.\n\nThe player will have to fight a lot with the enemies. There is a weak attack, there are quick sword strikes, allowing to deprive the enemy off balance, as well as a potent offence, for which you need to hold the button for a few seconds. It is better to attack at the right moments: striking, dodging and parrying, you can bring the combo counter to indecently high numbers. \n\nThere is also a system of finishing the enemy, which can finally overthrow the opponent. Over the heads of heavily wounded enemies there is an icon in the form of a skull, and by pressing the right trigger, you can finish them with the help of the provided reception.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Crytek","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13628,"name":"Dear Esther: Landmark Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b20/b20a20205954f9765e82298dbd41e48a.jpg","description":"One of the earliest \"walking simulators\" made by the same team that developed Everybody’s Gone To The Rapture, Dear Esther is an art piece rather than a regular game. There's very little interactivity and zero action; you just walk around a rocky Scottish island in autumn. The major events of the plot are set in the past, and we only learn about them through the voice of the unseen narrator - the only voice in the game – who will read a certain letter from his past when he approaches a certain place. The letters slowly unfurl the mystery around him as you visit various locations on an island: the lighthouse, the cave, and others. The world of Dear Esther is far from open, and you can only follow the restricted pathways. To unlock all the achievements and find every audio clip, however, may require several walkthroughs.\n\nThe Landmark Edition is based on the Unity 5 engine and contains better graphics, minor interface improvements and a system of achievements. It also includes the creators’ commentaries that provide additional insight into their narrative intentions.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"The Chinese Room","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10449,"name":"Darksiders II Deathinitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cfe/cfe5960b5caca432f3575fc7d8ff736b.jpg","description":"Become the terrifying force which everything fears but nothing can escape. Awakened by the End of Days, Death, the most feared of the legendary Four Horsemen embarks on a quest to redeem his brother's name. Along the way, the Horseman discovers that an ancient grudge may threaten all of Creation. Death lives!\nDeathinitive Edition Features:\nDarksiders 2 with all DLC included and integrated into the game which offers a total playtime of more than 30 hours\nReworked and tuned game balancing and loot distribution\nImproved Graphic Render Engine for higher visual quality especially in terms of lighting and shadows\nImproved and reworked level, character and environment graphics\nRunning in native 1080p resolution\nSteam Trading Cards\nFeatures:\nPlay Death: Become the most feared of the legendary Four Horsemen, able to destroy entire worlds and battle forces beyond Heaven and Hell.\nEpic Universe: Unlike anything the player has seen before, delivered in the unique style of Joe Mad.\nPlayer Choice & Customization: Customize your experience with varied armor sets, weapons, and Skill Trees allowing players to create their own Death.\nReplay-ability:  Explore a vast open world,  complete dozens of side quests and customize your Death with a full leveling system, Skill Trees and endless equipment combinations.\nTraversal: Death is a nimble and agile character capable of incredible acrobatic feats allowing the player to explore the world like never before.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":3346,"name":"Wolfenstein: The Old Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f14/f1422eacab98c5f85a5123da4e9d9e89.jpg","description":"Wolfenstein: The New Blood is an FPS game which serves as a prequel to Wolfenstein: The New Order developed by MachineGames.\n\nThe game is set in the alternate 1946, where Nazi Germany is close to winning World War II. You play as B.J Blaskowicz set out on a secret mission to turn the tides in favor of the Allies.\n\nThe game is divided into two chapters: Rudi Jäger and the Den of Wolves and The Dark Secrets of Helga Von Schabbs.\nIn the first chapter, you have to escape the prison Blaskowicz was put into after his cover was blown.\nThe second chapter has Blaskowicz infiltrate the fictional city of Wolfburg, where Helga Von Schabbs, a high-ranked Nazi archaeologist found several dark magic artifacts.\n\nEach level in the game is a semi-open sandbox which the player can navigate and explore freely. Experience intense and fast combat with the ability of dual-wielding any weapon you find. The game features an uncommon cover system, where the character leans out of the cover. The perk system is also present. In order to unlock a perk, the player has to complete a specific task. Perks can grant a bonus to health, armor or an ability to perform a silent takedown.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":15858,"name":"Star Wars: Knights of the Old Republic II – The Sith Lords","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/046/0464f4a36cd975a37c95b93b06058855.jpg","description":"The game takes place in the expanded Star Wars Universe, almost 4,000 years before the events described later in the films. The game begins on the ship \"The Endar Spire \", attacked by the Sith fleet near the planet Taris. Player and one of the pilots, Carth Onasi, descend on the planet in an escape pod. Their primary goal is to find a Jedi named Bastila Shan, who commanded their ship. She has the mastery of battle meditation, by which the Republic has managed so far to withstand the onslaught of the Sith.\r\n\r\nKnights of the Old Republic is the first computer game, which takes place in the author's world of Star Wars. Battles go through in real time, but they can be suspended at any time. The main character balances between good and evil, and each of his actions depends on his belonging to the Light or Dark sides of the Force, and ultimately the ending of the game.\r\n\r\nIn place of magic came the Force Powers that is vested in the Jedi, and they are divided into three categories: light, dark and neutral. Any Jedi can study any force that is sufficient for his level.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":12320,"name":"Prison Architect","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6bc/6bc79f5bc023b1e6938f6eaf9926f073.jpg","description":"Prison Architect is a person construction and management simulator developed by Introversion Software.\n\nIt is a two-dimensional top-down simulator where it is the player's responsibility to build new prison blocks, cells, facilities, manage the staff such as wardens, guards and so on. The more staff hired - the more options does the player have while building the prison.\n\nIt is advised to complete the game's campaign first which also serves as a tutorial and consists of 5 parts. Each part of the campaign focuses on two game aspects and has its' own story told with Polaroid photos. The player can't lose the game in campaign mode as there are no failure conditions whatsoever.\n\nTwo more modes are present: Sandbox Mode and Escape Mode. There is no main goal in Sandbox Mode, so you basically can't win the game, but there are several failure conditions such as a riot or bankruptcy.\n\nEscape Mode, on the other hand, has both winning and losing conditions. In this mode, you play as a prisoner making their escape causing the most destruction on your way out. Escape Mode starts automatically if you allow too many deaths in a short period of time in Sandbox Mode.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Double Eleven","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":10092,"name":"Minion Masters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e4a/e4ab7f784bdc38c76ce6e4cef9715d18.jpg","description":"Two small platforms hang in space, each has a place for the commander and his few, but diverse warriors. Between the platforms there are two bridges. The goal of the game is to capture and hold bridges. The game involved more than three hundred characters.\nYou can fight with players of different levels. There are game modes with the computer and with any partners, friends or players found on the game server on the Internet.\nAfter the end of the battle, you can see all the initial conditions of the opponent in the last game and all his actions in it. It is possible to trace what decisions the enemy took, how he equipped the troops and how he controlled them.\nThe amount of armament and power increases from level to level, from battle to victory. A variety of monsters and fantastic teams are combined in different combinations to conquer and suppress the enemy. Control of the bridge and neutralization of enemy forces - in this game this is the sacred grail, after which the player goes away time and again, honing his mastery of strategic planning.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"BetaDwarf","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":50781,"name":"Sea of Thieves","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5f6/5f61441e6338e9221f96a8f4c64c7bb8.jpg","description":"Sea of Thieves is a cooperative multiplayer action-adventure game developed by Rare.\n\n###Gameplay\nThe game features a cartoonish pirate aesthetic to it and features no plot whatsoever. The players set out to explore an open shared world. The first thing available to the players is player creation, as the game offers the players to choose one out of eight randomly generated characters. After that, the players are let go to the open world.\n\nThere is no certain objective present in the game. The players have to create a story for themselves. \n\nPlayers can take mission known as voyages. Voyages require you to locate an island on the map, sail to it, find a treasure, dig it out, and safely bring it back to the game's hub island. You will get gold upon completion. Gold can be obtained either through voyages mentioned above, boarding and raiding other players' ships or clearing out a fort full of skeletons who have a lot of gold hidden in their stronghold.\n\nThe gold can be used to buy cosmetic upgrades, such as new ship bodies or skins for your weapons. There are four weapons present in the game, with the players being able to carry two at the time. \n\nThe game relies on the player to player interaction, as they are able to dance, use emotes or even get drunk together either on the ship or on the game's hub island bar. The ships cannot be appropriately handled by only one player, so it is a must to gather a team.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Rare","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"}]},{"id":17380,"name":"Sid Meier's Civilization III Complete","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/054/0549f1a0a5e782d4e81cdf8d022073fa.jpg","description":"Civilization III is the third installment in 4X strategy series Sid Meier’s Civilization. The game is centered around building a civilization starting in 4000 BC and until modern days. The player can choose from 16 different civilizations (15 more are added in expansion packs included in Complete Edition) all of which have their unique characteristics and individual units. \nThe primary goal of every match is to defeat other civilizations. This can be achieved in different ways, such as: destroying every other civilization with, controlling more than 2/3 of the world’s land, building a spacecraft, assimilating other nations and diplomatic domination. This brings a significant amount of variety in gameplay and lets player experiment with different ways of progression for each civilization. \nThe Complete Edition of Civilization III includes the most updated version of the game and both released expansions: Play The World and Conquest.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Firaxis","platforms":[{"id":0,"name":"PC"}]},{"id":3554,"name":"The Evil Within","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/157/1570121f5c4d240504f1eae5c3854733.jpg","description":"The Evil Within is a third-person survival horror action game developed by Tango Gameworks.\n\nDetective Sebastian Castellanos and two of his and two of his partners come on call to the Beacon mental hospital. The hospital is filled with dead bodies upon the police arrival. Castellanos has to find out what is going on in the Beacon.\n\nBeing a survival horror, looking for supplies is crucial in The Evil Within. The game teaches the player when should they run away from the enemy or pick up the fight. Terrible monsters are not the only dangers in the game as there are a lot of traps scattered around the level that can be either used by Sebastian or trap him causing a lot of damage. The game world transforms during the game as a result of player actions.\n\nPlayers can use a safe house named 'Safe Haven' that is accessed either further into the plot development or by finding mirrors during the game. This safe house features a save room, an upgrade room, and several storage safes.\n\nAlthough the ammunition is hard to find in the game, players have access to a wide variety of firearms which include but are not limited to a revolver, shotgun, and a sniper rifle.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":10090,"name":"Beholder","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/40a/40ab95c1639aa1d7ec04d4cd523af6b1.jpg","description":"If someone has to live in the totalitarian society, that person has to work not to become a victim of it. Carl, a state-appointed landlord, has to spy on the tenants and to receive orders from the government. But to follow them or to dismiss them is up to the player, controlling Carl. Players will have to eavesdrop, bug the apartments of tenants, search through their personal items and complete quests, given to them by the higher ups. The moral choice system will take note of every action players will make, and every decision will have consequences. Much like in a similar in spirit game “Papers, please,” a government worker has to report any suspicious activity or anyone involved in suspicious activity. Beholder has multiple endings, and each of them is a compilation of player-made choices over the course of the game. Each tenant has their own personality, distinct appearance, conditions, and issues. It’s up to the player, to empathize with the lives of the tenant, or to follow orders.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Alawar Entertainment","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":19299,"name":"Fallout 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/218/218167ff4011acc825c844d0070940a0.jpg","description":"This sequel to the original Fallout is set in a post-apocalyptic era many decades after a nuclear war broke out and eliminated most of the world as we know it. America is turned into the Wasteland, a grim world full of ugly ghouls, powerful super mutants, mad robots and raiders, and various factions fighting for power. There are also many pre-war Vaults, some of which allowed their inhabitants to survive the war. The game uses an isometric view like most 1990s RPGs did, and the battles are turn-based. \n\nYou play as a Chosen One, a distant descendant of the original Vault Dweller, living in the village called Arroyo. The Chosen One is tasked by the village's elders to retrieve  Garden of Eden Creation Kit, a gadget that can transform the wasteland into a fertile environment. Before you start, you can customize your Chosen One and assign him with various skills, perks and traits using the system called  S.P.E.C.I.A.L. Your actions and choices affect both your karma, which defines how \"good\" your character is overall and your reputation that may vary from settlement to settlement.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Black Isle Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":51610,"name":"Dark Souls: Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/29c/29c6c21cc0c78cff6f45d23631cc82f4.jpg","description":"Then, there was fire. Re-experience the critically acclaimed, genre-defining game that started it all. Beautifully remastered, return to Lordran in stunning high-definition detail running at 60fps.\nDark Souls Remastered includes the main game plus the Artorias of the Abyss DLC.\nKey features:\n• Deep and Dark Universe\n• Each End is a New Beginning\n• Gameplay Richness and Possibilities\n• Sense of Learning, Mastering and Accomplishment\n• The Way of the Multiplayer (up to 6 players with dedicated servers)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"FromSoftware","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":15274,"name":"Jotun: Valhalla Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/032/0329db96e252aa41e672da2ba16f914c.jpg","description":"The graphics solution of the game may seem simple at first glance, but in fact, it is very addictive and elaborated with the exceptional talent of the artist. Reminds the best samples from the history of world animation. There is an impression that the directors and operators of the highest Hollywood level worked on all the scenes in the game - the hero's simple passage through the hanging ladder suddenly turns into an exciting panorama that you want to admire for a long time. Voices speaking the ancient Scandinavian languages, and beautiful original music help to create a tangible atmosphere of Nordic folklore and adventure. These advantages draw attention to the game, despite the lack of continuous action. There is no such action in the game, but when it does happen, its epic nature is suited to the world of Nordic fairy tales. Plots of these tales and a description of the world of Nordic myths are adequately represented in the game, it is even possible to study this topic. The gameplay consists of exploring large levels, searching for runes to enter the next level, avoiding various exotic troubles and rare but epic and picturesque battles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Thunder Lotus Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":19451,"name":"Fallout 3: Game of the Year Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e53/e5372e767149bc88106e1da0ae7e9104.jpg","description":"Fallout 3: GOTY edition is an open-world role-playing game developed by Bethesda Game Studios. It is the fifth installment in the series and is the first 3D and real-time combat game in it.\r\n\r\nThe game takes place in the year 2277 - 200 years after the nuclear Great War. You play as a vault dweller and set out on a quest to find your father that left the vault.\r\n\r\nFallout 3 offers the player immense freedom: create your own character with a particular set of skills using the role-playing S.P.E.C.I.A.L system and explore Washington, D.C., which has turned into a wasteland over the years without even following the main quest or complete every side quest you come across in the game.\r\n\r\nOne of the main features of the game is the V.A.T.S system, that allows the players to target specific body parts of the enemy. For example, if you target the enemies hand, they could drop their weapon.\r\n\r\nGOTY edition features all the DLCs that were released: Operation: Anchorage, The Pitt, Broken Steel, Point Lookout and Mothership Zeta.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":12569,"name":"Starbound","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d9/6d92d50affeebf2eb3894d178eb1117e.jpg","description":"Starbound is a 2D adventure game with a heavy focus on the sandbox aspect and procedurally generated levels. Unlike many similar games of this genre, Starbound has a story you need to follow. Playing as a space officer whose planet was destroyed by aliens, you explore the universe and prepare for the revenge.\nIn general, Starbound is a typical 2D sandbox with such activities as spelunking, crafting and exploring that are united with story missions. Quests help to find the information about the in-game universe and races and lead through different tasks. Some levels are based on platforming only, while the others make you change the environment and solve puzzles. Some of them are based on the character’s ability to turn into a ball and use both hands to hold tools.\nAnd still, the key feature of Starbound is procedurally generated levels and their design. The game features a huge amount of planets to explore, with multiple caves, buildings, labyrinths, and forests.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Chucklefish","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3912,"name":"Sanctum 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/963/963815b2a1a88475a31f311b591e70fb.jpg","description":"Sanctum 2 is a first-person shooter game, the second installment in Sanctum series by Coffee Stain Studios.  \nThe story takes place on planet Loek-III colonized by people. The colonies are built around the Cores, large spheres of energy that make Loek atmosphere suitable for humans. You take a role of one of four Core Guardians team members. There are 4 characters in the game with its unique abilities and characteristics and several unlockable weapons for every one of them. \nThe gameplay may be essentially described as a mix of FPS and tower defense. Every level is necessarily a tower-defense-style map with the main building, the Core, which player has to protect from waves of enemies, coming from the access shafts. Every round consists of two phases: building phase, when the player can build towers and walls that help hold back waves of enemies, and defending phase when the player has to kill enemies in order not to let them destroy the Core.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Coffee Stain Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3427,"name":"Murdered: Soul Suspect","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/54a/54a3e4c617217848dc43c4de9989fe37.jpg","description":"The hero is a policeman, talented and devoted to duty. But there is a clarification - this is a dead policeman, killed because of his work, but he did not leave the world, he turned into a ghost and did not lose his passion for investigations.\nA hero can do many things in our world, but not all. Can be present everywhere and even pass through the walls (but not in closed houses, only through open doors and windows). Can see what ordinary people see, read, think. But he can not take and move things, cannot talk with living people - for actions with objects and communication he has to find a girl-medium.\nIn the game, you need to collect evidence and draw conclusions from this. Ways to extract proof are sometimes very exotic. For example, a hero can penetrate the memory of a witness and find there information that the witness himself cannot remember. The hero can meet other ghosts, who were once people and killed - after talking with them, you can learn about the circumstances of this.\nFinding evidence and reasoning is not the only thing that you have to do. The hero can be killed a second time, and it will be definitive - some disembodied beings seek to destroy the hero's soul. But they are vulnerable, and the hero can kill them.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":3729,"name":"LEGO The Hobbit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e4f/e4fb3fd188f61fabec48dca22e6ef28a.jpg","description":"LEGO The Hobbit is another installment in the LEGO series of games adapted from popular movie franchises. It is based on the first two films in Peter Jackson's The Hobbit film trilogy, that was, in turn, adapted from John R.R. Tolkien's book of the same name. Like with all LEGO games, its visual style imitates a world that is entirely made of LEGO constructions and inhabited by mini-figures.\n\n###Plot\nThe game follows the plot of the movies rather than the original book. LEGO The Hobbit recreates The Hobbit story using voice samples from the movies, while also parodying it with the addition of the tongue-in-cheek humor. The plot takes place in the high fantasy world of Middle-Earth. Bilbo Baggins, the main protagonist, is a hobbit. He lived a peaceful life until one day a company of thirteen dwarves and the wizard named Gandalf called him to join them on an adventure. Bilbo and his new friends left out on a quest to reconquer the dwarves' home, the Lonely Mountain, and its treasures from the wicked dragon Smaug. \n\n###Gameplay\nThe player controls the Thorin's party, switching between characters when needed. Each character has his unique abilities, such as climbing or shooting arrows. The game is divided into a series of short, linear levels that correspond to certain scenes in the movies. On the way, the player has to smash objects made of LEGO and sometimes use them to assemble new objects. The game also has a cooperative multiplayer for two.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"}]},{"id":10001,"name":"Serious Sam Fusion 2017 (beta)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/21b/21babfc41e2a6972290833d1b860f13e.jpg","description":"Serious Sam Fusion 2017 is a special edition of the original first-person shooter series. This is a central hub for the whole Serious Sam franchise, which includes remastered and VR versions of both First and Second Encounters, and Serious Sam 3: BFE. The series follows Sam Stone’s adventures set in the environment of Egyptian pyramids, jungles and medieval castles. According to the plot, the protagonist fights against science-fictional extraterrestrial forces and their leader Mental, whose only aim is the devastation of humanity. The gameplay consists of eliminating waves of re-spawning invaders all across the game map. Enemies themselves range from basic soldiers to gigantic robots. As far as health and armor are non-regenerative, players controlling Sam have to gather special packs, which are scattered all around, in addition to dodging aliens’ attacks. From the technical side remasters offer lots of graphical issues and fixtures. The 2017 Fusion also allows players to maneuver within the whole series not exiting the game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Croteam","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":14062,"name":"Red Orchestra 2: Heroes of Stalingrad with Rising Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bff/bff077fb7c3b037bd5ed920bf447c863.jpg","description":"Red Orchestra 2: Heroes of Stalingrad with Rising Storm is a first-person tactical shooter, continuing the legacy of the series and adding various new mechanics. The game focuses on multiplayer battles, and the only singleplayer campaigns are tutorials.\nRO2 is set during the World War II, showing the many confrontations on the Eastern Front. The players may take up arms as one of the two opposing factions, and either fight for their ground as the Red Army or try to take more land as the soldiers of Wehrmacht. The game features 7 playable classes, from a mere footsoldier to the tank commander. The playable maps include up to 64 players and feature different game modes. Red Orchestra 2 emphasizes on the difficulty of battles and maximum realism, making it one of the few “hardcore” WW2 shooters.\nThe Rising Storm expansion focuses on the Pacific front, adding two new factions with varying equipment and battlefield capabilities, and new maps to play on. The game, together with expansions, supports Steam Workshop and encourages its players to enhance their game experience further.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":5161,"name":"Braid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a5a/a5abaa1b5cc1567b026fa3aa9fbd828e.jpg","description":"Braid is a traditional platform game with puzzle solving. The story follows the main character Tim on his way through twisted 2D levels. According to the storyline, Tim’s aim is to rescue the princess from a monster. In the course of the completion, players will be able to get some additional information about the protagonist’s relationship with the princess. Players control the protagonist as he climbs platforms, jumps on the enemies to defeat them and to collect keys to hidden quests and mosaic parts. Players have to lead Tim through 6 worlds, each based on an intriguing time mechanic, as Tim features the ability to rewind the original pace of time. For example, Time and Forgiveness world allows respawning Tim after his death by switching time back. To attend the last level, Tim must assemble the mosaic. The story ends in the world simply called “1”, where time flows in reverse and returns to the normal pace by rewinding. The last room of the final world contains Tim’s meeting with the princess, but, due to the time pace turned back, players face some unpredictable twists of the plot.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Hothead Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox 360"}]},{"id":829,"name":"Killing Floor 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/192/1921ec949024a5fbd1e1c7008f54b5af.jpg","description":"Killing Floor 2 is a cooperative first-person survival horror game developed by Tripwire Interactive.\n\nThe game is based on events of the first Killing Floor. A biotech corporation Horzine attempts to create military clones, yet something goes wrong and now the mutant clones are spread all around Europe. Governments collapse and the infrastructure is almost non-existent. \n\nUp to 6 players spawn on the map in order to kill the boss. The players have to hold out 4, 7 or 10 waves of enemies after which the boss spawns. Each wave has more enemies and special mutants. After the end of a wave, the players can visit the trader, where they can buy weaponry and equipment. Players earn money and experience points for killing enemies. The more players there are on the map - the more enemies spawn. The difficulty level is also affected by the number of players. The only difference between singleplayer and multiplayer is in the number of players.\n\nThe game features a class system. Players spawn with level 0 and can level themselves up to level 25. Each class is better in one field of combat. For example, medics have a speed boost and can heal other players while supports are able to seal the doors.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Tripwire Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":3449,"name":"Resident Evil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/510/51039d0ec5dc8c3e08ae4374dfceecec.jpg","description":"Resident Evil is a survival horror video game developed and released by Capcom originally for the PlayStation in 1996, and is the first game in the Resident Evil series. The game's plot follows Chris Redfield and Jill Valentine, members of an elite task force known as S.T.A.R.S., as they investigate the outskirts of Raccoon City following the disappearance of their team members. They soon become trapped in a mansion infested with zombies and other monsters. The player, having selected to play as Chris or Jill at the start of the game, must explore the mansion to uncover its secrets.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Capcom","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":678,"name":"Neverwinter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/26b/26b27e1da9e3727fcb12e3e4e86c8c19.jpg","description":"The multiplayer game \"Neverwinter\" takes place in the setting of Forgotten Realms - one of the most developed worlds of the game Dungeons & Dragons.\nAt the beginning of the game, the city of Neverwinter is in chaos because of the sudden disappearance of Lord of Neverwinter.\nIn the novel by Robert Salvatore \"Gauntlgrym\", dedicated to this period, it is said that after plunging into chaos, Spellplague and a Primordial Fire Elemental almost destroyed the city.\nThe remaining residents united in several factions, between which a struggle for power in the city broke out. The dead began to emerge from the graves, they call the city their home and also pretend to power. The player is investigating the case of the Sect Crown of Neverwinter, trying to find out what all this undead is looking for. The list of locations is based on the novels Gauntlgrym, Neverwinter, and Charon's Claw.\nPlayers can create their own new locations, related or not at all related to the rest of the game content. Content created by players is clearly marked as such, so as not to mislead other players.\nThe game is based on a modified version of the Dungeons & Dragons 4th edition rules set.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Cryptic Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":5578,"name":"GRID (2008)","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fc0/fc076b974197660a582abd34ebccc27f.jpg","description":"GRID is a racing game that lets the player dive into the motorsport, assume the real racer’s role and even control their own racing team. Races and racing championships are held in three main locations – the United States, Europe, and Japan. All racing circuits in the game are the mixture of imaginary and the existing ones. The gameplay is divided into 6 racing classes: GT championships, drifting, touge (climbing the narrow mountain pass like Pikes Peak), open wheel racing, demolition derby, and 24 Hours of Le Mans (additional at the end of the season). Each car of 43 available in the game is tied to one of the event types. Several professional teams compete within these championships. Therefore, to start the career player have to choose one of the disciplines and a professional team to join. While progressing GRID gives an opportunity to create your own racing team, hire sponsors and other drivers, and participate in different events. The gameplay also has a remarkable feature called “flashback” that allows rewinding time to prevent driver’s mistakes.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":14690,"name":"Trine Enchanted Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e0f/e0f05a97ff926acf4c8f43e0849b6832.jpg","description":"The king died and did not leave an heir, the kingdom fell into civil strife, the land in response to lawlessness and disorder brought to the surface hordes of monsters, increasing chaos.\nThe magician, knight and thief were united by fate for the struggle for peace and the restoration of the kingdom. Alone and together they fight with enemies, solve puzzles and overcome obstacles on fifteen different levels. Decisions can be more than one, and they can be composed of the skills of all three players.\nExquisite, delicate drawing of the world and characters. Very elegant, subtle, very realistic sounds - yes, realistic sounds of the magic world. That's precisely the way it should be. But when the hero breaks the wall with a ram or stumbles upon a mountain of treasures - the battering ram sounds like a battering ram, and the mountain is imposing. Very cleverly put light makes the world deep, voluminous and alive. Passing the game, you do not want to rush, you want to consider, to discover all its details, to admire them for your pleasure.\nThe game supports 3D mode, you need a suitable TV and stereoscopic glasses.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Frozenbyte","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19452,"name":"F.E.A.R.","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/89a/89a8378d49732505cdb28babe505df9e.jpg","description":"Following the plot of the game, you play as a Point Man, who works for F. E. A. R. - a fictional special forces unit, which is forced to resist the rebel squad of cloned supersoldiers. He also faces a supernatural threat - Alma, a ghostly creature in the form of a little girl. The game consists of 11 episodes with an epilogue. As for the plot, it is completely confused until the end.\n\nOne of the primary abilities of the player is to slow down time.  Being in this state for not so long, you can see the traces of flying bullets, move faster and get an advantage in battle.\n\nThe whole game comes from the first person, and the camera never shows the player from the side. Also, the game is often criticised for the fact that the primary action levels take place inside the buildings, not in the open area. But the player can attack the enemy from anywhere, hiding behind a wall, or create a shelter for additional protection.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Monolith Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":452638,"name":"Stray","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd3/cd3c9c7d3e95cb1608fd6250f1b90b7a.jpg","description":"Lost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten city.\n\nStray is a third-person cat adventure game set amidst the detailed, neon-lit alleys of a decaying cybercity and the murky environments of its seedy underbelly. Roam surroundings high and low, defend against unforeseen threats and solve the mysteries of this unwelcoming place inhabited by curious droids and dangerous creatures.\n\nSee the world through the eyes of a cat and interact with the environment in playful ways. Be stealthy, nimble, silly, and sometimes as annoying as possible with the strange inhabitants of this mysterious world.\n\nAlong the way, the cat befriends a small flying drone, known only as B-12. With the help of this newfound companion, the duo must find a way out.\n\nStray is developed by BlueTwelve Studio, a small team from the south of France mostly made up of cats and a handful of humans.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"BlueTwelve","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":14317,"name":"Endless Space - Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf7/bf71c819eace914e6c42ae3ecb667308.jpg","description":"The 4x-strategy game from the Endless series. Choose one of the eight humanoid an non-humanoid factions that inhabit the world of Endless Space and conquer your way onto the top of a galactic food chain. Each faction has elaborated story and features that shape unique gameplay. Will it be by power or by economic and diplomatic means, the game offers uncountable hours of top-grade turn-based strategy gameplay.\n\nThe game is focused on economic management of player’s intergalactic empire and ways to control and develop colonized star-systems. Factions fight over the control of the mysterious resource called Dust. The substance is often found in ancient temples and random planets. Battles in the game are simplified graphically and gameplay-wise. The game emphasizes on a thorough exploration of the Endless universe. \n\nEmperor Edition of the game includes a new hero and new civilization to play as well as skins, digital soundtrack and other cosmetic goodies.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Amplitude Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":3300,"name":"The Elder Scrolls Online: Tamriel Unlimited","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/596/596a48ef3b62b63b4cc59633e28be903.jpg","description":"The Elder Scrolls Online: Tamriel Unlimited is the remastered version of The Elder Scrolls Online. The main difference between the two versions is switching from the subscription model to buy-to-play monetization along with several improvements and re-branding.\n\nTES: Online is an MMORPG and the first multiplayer installment in the series. It's set on the continent of Tamriel, long before the events of offline titles. Following the tradition of the franchise, the story starts with you being imprisoned. You escape and start to search for the soul that was stolen from you. Besides the storyline, the game features nonlinear gameplay with multiple side quests, and you can freely roam around the world. In general, the plot is indirectly connected to previous TES titles, such as Morrowind and Skyrim.\n\nIn fact, The Elder Scrolls Online provides the same gaming experience as offline titles but shared with friends. You can widely customize your character, choosing from ten races and five classes and developing different skills and abilities.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":17174,"name":"Resident Evil Revelations 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ea3/ea3228b5c6c749019a9ed42e90a4e7c6.jpg","description":"Resident Evil Revelations 2 / Biohazard Revelations 2 is a four-part episodic survival horror, a part of the Resident Evil franchise and the tenth installment in the series. It follows Claire Redfield, the protagonist of Resident Evil 2, that was kidnapped and forced to survive among monsters on Sushestvovanie Island. There are two endings depending on the decisions made throughout the game.\nTwo bonus episodes extend the story and tell about Natalia Korda, a little girl with supernatural powers, and Moira Burton, Claire’s colleague. These episodes have a more suspenseful atmosphere as you need to survive without using guns.\nThere are two pairs of playable characters in Revelations 2: Claire and Moira Burton, and  Barry Burton and Natalia Korda. While only one character in each pair has weapons, it's important to complete missions stealthy if possible. Supportive characters, though, has special abilities, such as fighting with bricks or finding hidden items. The game supports cooperative gameplay on consoles and features the Raid mode, which allows customizing your skills and weapons.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":4729,"name":"Assassin's Creed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0bc/0bcc108295a244b488d5c25f7d867220.jpg","description":"The game takes place in 1191. In the present time, 2012, bartender Desmond Miles, the main character, kidnapped by the Corporation \"Abstergo industries\", which with the help of a machine called \"Animus\" wants to find an artefact. He learns that he is a descendant of the assassin Altair, who discovered this artefact. They need Desmond to know the location of the treasure through him.\r\n\r\nThe game belongs to the category of open world projects. It means that the world can be explored by the player in a free manner there. All the game space is a simplified model of the Holy Land. The area is divided into seven main sections. \r\n\r\nThe player will have to climb on a lot of different buildings and towers. The architecture of the cities in Assassin's Creed is specially designed so that Altair can jump on any roof. Throughout the game, these skills will not just be used to perform additional tasks.\r\n\r\nAn essential part of the game is the investigation and the associated need to merge with the crowd. Each time, getting to the big city, Altair has to look around properly and find the office of assassins. The head of the Bureau will tell him about his future victim and will bring to some people who have useful information.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2574,"name":"Enter the Gungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3be/3be0e624424d3453005019799a760af2.jpg","description":"Enter the Gungeon is a twin-stick roguelike shooter. The game takes place in a planet inhabited by living bullets. You play as one of six adventurers trying entering a considerable fortress to find a gun that can destroy one’s past. \nThe gameplay represents a mix of bullet-hell and dungeon crawler. You choose one of the characters and start descending the Gungeon. Every floor has several pre-made rooms with enemies and treasures procedurally-generated. The player can shoot guns, dodge, use items and make barricades of the tables. There are more than 300 hundred different guns and items in the game which can be acquired from shops, treasure chests and bosses. \nThe game is notable for its severe difficulty that comes from tough enemies, the vast amount of projectiles that can simultaneously be on the screen and from the fact that every time you die you have to starts the game from the beginning.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Dodge Roll","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":3697,"name":"Serious Sam 3: BFE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/12e/12ea6b35b65df38258e25885a0a392a6.jpg","description":"The alien monster destroyed all earthlings, except one. But this one has a full set of everything that can be called hardcore and brutality. From the athletic figure and the hoarse voice to short phrases that leave no doubt in the victory. He goes to the past, for it can return everything as it was.\nThis type of hero sets everything else, the plot is clear and straightforward - run and shoot. It happens on twelve levels, the landscapes of which are created by Nature for bloody and dynamic battles. Everyone who likes to shoot and run will be happy with everything in this game. The best in the genre is collected in one place and cleaned to chemical purity. Even the monsters you meet as old friends - and they also try for you with all their might. They roar, beat and shoot, covering the sky.\nThere are enough weapons in the game, including hand-to-hand combat skills. Separate pleasure - if you kill monsters by your hands, you need to find your own approach to each. One monster needs to be pulled out of the eye, the other will die only if you wrest the heart. The heart, by the way, can then be thrown in someone - it can kill. There are a lot of pleasant surprises of this kind in the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2047,"name":"Lords of the Fallen (2014)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d09/d096ad37b7f522e11c02848252213a9a.jpg","description":"Lords of the Fallen is an action RPG, which is set in the fictional world abandoned by Gods and occupied by supernatural hostile power. Players assume the role of Harkyn, a human hero seeking to defeat threatening villains. According to the storyline, the main character is released from prison, where he was held for his sins, in order to protect the world. While wandering around the in-game world, the protagonist, controlled by players, eliminate bosses and earn experience points. As far as Harkyn has a branch of abilities, both combat and magical parameters can be upgraded with experience. In addition to the main story, players are able to complete various side quests, which expand the whole picture of the game, to gain extra experience or to unlock new equipment. Character’s customization ability allows creating a heavy knight as well as a lightweight attacker. The gameplay also features the progress-saving system: if dead, players can return to the ghost (remaining on the place of death) and get their progress back.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"City Interactive","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]}]