[{"id":16842,"name":"Total Annihilation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/720/7208e92b997d04b0029130c9c2d5fa36.jpg","description":"What began as a conflict over the transfer of consciousness from flesh to machines escalated into a war which has decimated a million worlds. The Core and the Arm have all but exhausted the resources of a galaxy in their struggle for domination. Both sides now crippled beyond repair, the remnants of their armies continue to battle on ravaged planets, their hatred fuelled by over four thousand years of total war. This is a fight to the death. For each side, the only acceptable outcome is the complete elimination of the other.Story / Background In the distant future, the galaxy is ruled by a central body of humans and artificial intelligences called the Core (a contraction of \"Consciousness Repository\"). The Core's technological and economic triumphs have allowed humanity to colonize most of the Milky Way and enjoy peace and prosperity. However, the balance is broken by a technological breakthrough that allows the consciousness of a human being to be reliably transferred into a machine, thereby theoretically granting infinite life, in a process called \"patterning.\" Following a mandate imposed on humanity by the Core requiring everyone to undergo patterning as a public health measure, a rebel band is formed out of colonies from the edges of the galaxy (hence their name, the Arm), whose members refused to leave their natural bodies to join the Core's machines. A war lasting 4,000 years followed, with the Arm mass-producing clones as pilots for its vehicles and the Core duplicating consciousness-embedded microchips to pilot its own machines.Key information Total Annihilation (TA) is a real-time strategy (RTS) video game created by Cavedog Entertainment under the guidance of lead designer Chris Taylor. It was released on September 30, 1997, and was the first RTS game to feature 3D units and terrain. Two expansion packs were released: The Core Contingency on April 30, 1998, and Battle Tactics exactly 2 months later on June 30, 1998. When TA was released, the minimum computer requirements were a Pentium 100 MHz processor and 16 MB of RAM. Of course, these requirements were for computers in 1997; modern day machines easily exceed those recommended specifications, but it is still recommended to have a 1 GHz processor and 512 MB of RAM for the updated game engine.Game features\nUpon release, the original TA game boasted:\tFully-articulated 3D units and buildings, with a diverse complement of unit types — for example, aircraft, amphibious tanks, infantry bots (kbots), vehicles, hovercraft, ships, submarines, unit production factories, powerful stationary defenses, and long-range weapons. A unique tracking feature allows players to follow single units, entire armies, or even projectiles across the landscape.\nTrue 3D terrain that units can climb over, into, and around, on extra-large 3D-generated maps. TA runs comfortably in high resolutions and even on modern dual monitor setups, so players can see more of the battlefield.\nNumerous world types to do battle on, such as grasslands, forests, deserts, archipelagos, open water, lava, metal, ice, crystal, acid, and even moons.\nMore than 150 official units and 25 official missions per side in a single player campaign. The Core Contingency expansion pack added 75 new units (including the infamous Krogoth), 50 new maps, 25 new missions, and 6 new world types. Battle Tactics added 4 new units, 6 new maps, and 100 new missions. A final patch (version 3.1c, and included here) added 6 new units, including a resurrection kbot!\nDetailed and exciting campaigns that focus on their respective side's leaders, the Commanders. The stories of either the Core or the Arm start with an effort to defend the protagonist's home world and initiate a turning point in the war, followed by a series of battles on numerous planets and moons (using Galactic Gates as a form of faster-than-light transportation), before a final strike on the enemy's home world: either on the Arm's bucolic Empyrean or the Core's artificial Jupiter Brain world of Core Prime. Mission objectives include protecting a vital structure or area, capturing a pivotal enemy unit, or simply eliminating all enemy units. More powerful units and weapons are gradually unlocked throughout the campaigns after specific missions or events.\nSingle-player skirmish battles and full multiplayer support, allowing players to watch and join battles, and form allied teams to share resources, information, and units.\nHighly advanced weaponry, including lasers, energy machine guns (EMGs), starburst missiles, plasma shells, lightning pulses, paralyzers, and nuclear warheads.\nVariables such as gravity, tides, and wind to disrupt the effectiveness of certain weapon types or to enhance resource production.\nIntelligence measures to detect or jam enemy units using radar and sonar, the ability to cloak or provide stealth shielding for units, and the means to revive destroyed units from their wreckages.\nOver the years, the TA community has created literally thousands of third-party units and hundreds of maps to customize a player's TA experience. Numerous utilities, missions, mods, and factions have also been created to rebalance or totally convert the game; many of these units are still in competitive online and skirmish play today. Modern modifications to the game push the venerable 16-year-old TA engine to new limits with complex scripting, allowing for mass unit transporting, instant map-wide teleportation, upgradeable units, and true shields — plus much more. Don't forget to visit File Universe and Unit Universe to download and test the TA community's many maps, missions, mods, races, standalone units, utilities, and other extras!More information You can find more detailed information about the many aspects of TA — including the perfect installation, troubleshooting techniques, and tutorials on how to use / create third-party mods, units, maps, and missions — in TA FAQ. Further reading — about the gameplay, story, Jeremy Soule's eponymous soundtrack, reception, and the 58 awards that TA received — can be found by visiting the TA article on Wikipedia. You can also find entries on TA's expansion packs, The Core Contingency and Battle Tactics there.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Cavedog Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":16452,"name":"Rogue Trooper","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8cb/8cbd91cb2bac600b86e00c6abe89c8c4.jpg","description":"Nu Earth: a poisoned planet where endless war rages between the Norts and the Southers. A futile struggle on a hostile planet with no end in sight.\nBut there are tales of a lone warrior. A man who can appear out of thin air and take out whole platoons, then disappear back into the shadows to which he belongs. A man who knows no allegiance but to his own mission and is hell-bent on revenge. He is the ultimate soldier, the last survivor of the massacred Genetic Infantrymen...\n...the Rogue Trooper!\nIntense 3rd-person action on the battlefields of Nu Earth.\nUse of Helm, Gunnar and Bagman: Rogue's friends brought to life in his equipment, adding depth to the gaming experience.\nAbility to create the type of ammunition you want, when you want it.\nDynamically use the environment to your advantage - conform to objects and terrain, and fire from protected positions. Athletically climb over the environment to gain the advantage over your enemy. Run, leap, and dive for cover.\nUse the unique upgradeable abilities of your Bio-chipped equipment to strategically outwit your foes.\nIntense LAN multiplayer action.\nNote: Multiplayer available via LAN only.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Rebellion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"Wii"},{"id":0,"name":"macOS"}]},{"id":14007,"name":"Ceville","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c8f/c8f850364edd030e1b754946890247e0.jpg","description":"The mean cruel cold blooded tyrant Ceville ruthlessly rules the beautiful kingdom of Faeryanis. Or rather, he used to rule the beautiful kingdom of Faeryanis, until the brave people revolted against his regime and drove him out of the palace.\nThe kindhearted queen Gwendolyn did step up to reign over the land with a council of noble and wise advisors.. It seems that this story could end just like any other fairy tale: \"And they lived happily ever after...\" But no, that's not quite right. Because another evil rises within the land. The treacherous Basilus — counsellor of Gwendolyn and of Ceville before her — plans to take the crown and torture the realm with the help of murderous beasts he has summoned from the planes of eternal darkness.\nAll seems lost! But hope resides with the one most unlikely person imaginable to save the kingdom and restore peace to the realm: Ceville, the realm's former despotic ruler...\nCeville\nThe ancient ruler of Faeryanis and spare-time tyrant, is dreaming up evil plans to exact his revenge on his former counsellor and servant Basilus, who betrayed him.\nAmbrosius\nThe noble and somewhat self-important knight Ambrosius is Ceville's would-be-nemesis. He constantly attempts to capture Ceville — but usually with little success. Will they both team up to fight a greater evil?\nLilly\nThe gentle and kind girl Lilly is rather an improbable choice to team up with Ceville. Never the less she helps him to escape for the good of the realm (at least that's what SHE thinks!)\nThis game will give you an impression of what happens, when you mix up the setting and humour of Shrek, Discworld and the Monkey Island series.\nup to three simultaniously playable characters with weird but loveable personalities\nbizarre characters from stock-broker dwarves and hippie-elves who populate the fairy-tale realm of Faeryanis\nvarious locations all over Faerynis, like the Not-So-Hidden druid circle, the (former) Elven Forest, The Dwarven Mines of Mount Goldmore and more! a variety of puzzles, many of which that can only be solved by teamwork of two (or more) player characters\ntons of humour","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Realmforge Studios","platforms":[{"id":0,"name":"PC"}]},{"id":4006,"name":"CAPCOM ARCADE CABINET","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58f/58f9da7488ae88f9485d3daae7d56f63.jpg","description":"Capcom's pedigree arcade games are back! Take on players from around the world in 'score attack' and even play together with online co-op! (Only for titles that support this feature.) Check out these classic games, now loaded with a 'casual mode' geared towards newcomers and other new features. Play the full game of 'Black  Tiger' and try out '1943' and ' Avengers' in this free trial!\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item.\n©CAPCOM CO., LTD. 2013 ALL RIGHTS RESERVED.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":3221,"name":"Actual Sunlight","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/058/05824db343e71d48d134511a33073049.jpg","description":"“I know what you’re thinking: Why keep getting up, day in and day out, even though your life is going nowhere?”\nNotorious: Widely considered to be one of the bleakest and best-written experiences in indie gaming, Actual Sunlight challenges you to confront the life of Evan Winter: An overweight, lonely and severely depressed young professional.\nFear the words, not the reading: Presented almost entirely in text, a mixture of sharp observation and pitch black humor captures your interest from provocative beginning to shattering conclusion.\nPrepare yourself: Actual Sunlight is a uniquely unforgettable adventure that will etch itself into you as one of the most difficult, haunting and beautiful experiences you have ever had as a gamer.Key Features\nAn intense, heartbreaking story with themes of video game addiction, unsatisfying work and miserable solitude.\nBeautiful, original pixel and CG artwork invokes the streets, offices and sanctuaries of Toronto, Canada.\nDark and moody original music sets a proper tone for the brutal indifference of real life.Important Notice\nDue to explicit language, Actual Sunlight is not appropriate for players under the age of 18.\nIt also deals with extremely mature themes, including depression and thoughts of suicide. Similar to other forms of art that tackle these issues, Actual Sunlight can be an extremely powerful emotional experience – before downloading it, please first consider what your reaction to a book, film or piece of music in a similar vein might be.\nFor immediate updates on the game, please follow Will O'Neill on Twitter: http://www.twitter.com/willoneill","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WZO Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":840776,"name":"Lords of the Fallen","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/12c/12c2fd04262732cb5e2e6ff378e1cc2d.jpg","description":"The Lords of the Fallen introduces an all-new, epic RPG adventure in a vast, interconnected world more than five times larger than the original game.\n\nAfter an age of the cruellest tyranny, the demon God, Adyr, was finally defeated. But Gods… do not fall forever. Now, aeons later, Adyr’s resurrection draws nigh. As one of the fabled Dark Crusaders, journey through both the realms of the living and the dead in this expansive RPG experience, featuring colossal boss battles, fast challenging combat, thrilling character encounters, and deep, immersive storytelling. Will your legend be one of light… or one of darkness?\n\nDare to Hope.\nExplore A Vast, Interconnected Worlds\nJourney across two expansive, parallel worlds in your epic quest to overthrow Adyr. While the living realm presents its own brutal challenges, untold terrors lurk in the nightmarish realm of the dead.\n\n\nDefine Your Own Legend\nFully customise your character’s appearance from a wide array of visual options, before selecting one of nine character classes. Whichever starting path you take, develop your character to your own playstyle by upgrading stats, weapons, armour and spells.\n\n\nMaster Fast, Challenging Fluid Tactical Combat\nOnly those that master the deep, tactical combat can hope to survive. Choose from 100s of uniquely brutal weapons, or forgo metal for magic with devastating attacks of the arcane.\n\n\nUnite or Fight in Online Multiplayer\nExperience the expansive, single player campaign alone, or invite a second player to join your adventure in uninterrupted, online co-op. But be warned - heroes from other realms can, and will invade.\n\n\nWield a Device of Ungodly Power\nYour lantern possesses the ungodly power to cross between worlds. Use this dark art to reach forgotten places, unearth fabled treasures, and even manipulate the very soul of your foe.\n\n\nRise from Death\nFall in the world of the living, and rise again… in the world of the dead. You now have one final chance to return to your living state, as all manner of hellish creature descends upon you.\n\n\n\nKey Features:\n\nEmbark upon two vast, parallel worlds - that of the living… and the dead\nMaster a fast, fluid and challenging combat system\nWield devastating magic attacks and character buffs\nInvite a second player to join your campaign in uninterrupted, online multiplayer\nEncounter a wide array of characters, eager to offer a dubious hand…\nFully customise your own unique character\nChoose from 9 starting character classes, including Knight, Rogue and Fire Apprentice","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"City Interactive","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"}]},{"id":41181,"name":"Bless Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/44f/44f5017b7d3e1b229eba477be4b60af7.jpg","description":"NEOWIZ welcomes you to an epic and immersive world of Bless Online where your choice matters. Explore the immense world and face your challenges alone or join up in groups to partake in massive warfare to determine your fate and reap the rewards. From the majestic opening of Embers in the Storm to the haunting chorus of The Sea of Sadness, the music created by the world-renowned composers Hans Zimmer and Lorne Balfe will draw you into the world of Bless.\nAvailable features\nChoose your sideChoose to align yourself with either Hieron, the Northern Holy Empire united in defending the civilized world or Union, the Federation of the southern races that aim to challenge Hieron for the supremacy over all land.\nChoose your storyEach of the 7 races you choose from will present you with a unique character story. 7 classes with different skills and combat style will provide you with just the right type of hero for your play style.  With the best-of-class character creation system, you can make the character exactly as you envisioned.\nChoose your adventureMassive and seamless world of Bless offers you an enormous choice in activities. Do not just pass by cool looking creatures in Bless. The creatures you encounter may be yours to tame as mounts or pets aiding you in your adventure. You can also challenge yourself in dungeons and mob infested fields.\nChoose your battleYou are called to participate in a constant epic war between Hieron and Union. The struggles come in many forms, starting from simple duels all the way up to 100v100 RvR where you contribute in the massive siege battle. Your valor in these battles will help you build your reputation in the world.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Neowiz Games","platforms":[{"id":0,"name":"PC"}]},{"id":23592,"name":"Dragonia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ab/8abe166e3c281fdfb7e301b98106482e.jpg","description":"This is a flight shooting game with RPG growth factor.If you are not 18 years old, Do not download the game plz,Because there are R18 content in the game.\nThe role that you control is the white dragon’s daughter who will resist the evil dragon and protect the Dragon Kingdom’s national treasure “Dragon Tears” according to the dragon’s witch’s instructions. At the beginning, the small white dragon’s power is not strong. But with constant fighting and collecting a lot of Dragon’s Souls, her bullets, attacking methods and special skills will be improved.\nPlease use your power to expel the evil dragon lurking around the Dragon Kingdom and maintain the peace and tranquility of the Dragon Kingdom.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SakuraGame","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":23208,"name":"Bit Heroes","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea5/ea5e08d9467b0562e4582f2b2809a2fb.jpeg","description":"Explore a vast new MMORPG world inspired by your favorite pixellated dungeon crawlers.\nBit Heroes captures that charm and nostalgia of your favorite RPGs, delivering them seamlessly to your computer.\nCollect and craft thousands of pieces of loot to increase your power. Build your team by capturing monsters and bosses to fight at your side in old school, turn-based combat. Prove you’re the mightiest hero in the land by competing in the PvP arena, Raids, and weekly events for awesome prizes! Take your most powerful friends and guildmates along to battle at your side!\nKey Features:\nRetro dungeon crawling adventure!\nParticipate in rotating competitive events, including PvP, Guild vs. Guild, Gauntlets, Trials, Invasions, and more!\nFive vast zones with over 60 randomly-generated levels and raids.\nThousands of mix and match pieces of loot to upgrade, craft, and recycle.\nCapture and evolve over 100 creatures to fight by your side! (including powerful bosses).\nEquip fantastic pets such as floating pizza, tiny unicorns, and more!\nTeam up with friends to tackle ultra-difficult dungeons to find great treasure!\nLevel up your guild to unlock a special shop with powerful bonuses.\nShare stories and swap strategies with World Chat and Guild chat.\nOriginal chiptunes soundtrack that sounds like it was ripped straight from a NES cartridge.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kongregate","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":19998,"name":"Level 22: Gary’s Misadventure - 2016 Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/689/68982c8e9f02b077c1b9bdc25fe6a87a.jpg","description":"THE FIRST STEALTH GAME SET IN THE MERCILESS AND FRENETIC WORLD OF WORK!\nGary is an office worker who overslept after a drunken night out in town. Here's where it gets tricky, because this isn't the first time Gary's been late for work, and he could be fired if he's spotted arriving at his desk after everyone else yet again. So he’ll have to prove his smartness and slyness to make his way up the 22 floors standing between him and his office without being caught.\nHide in closets, crawl through air vents, slink along the walls… nobody must spot you!\nUse everything in your reach to get to the end of the level: hide behind a newspaper, smash a vending machine with a well-aimed kick, or use donuts to lure the security guards away.\nWant to drive your colleagues crazy, knock them out, poison them or even expose them to harmful radiation?\nFool photocopiers, stroll hiding in a cardboard box or distribute laxatives ... It is possible in Level 22!\nReady to settle the score with your bosses?\nFrom the basement to the boss’s office via the research and development labs, explore the zany little universe of LEVEL 22.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Plug In Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"}]},{"id":19474,"name":"Nimbus","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/31c/31cad5c0affeec77aaa0882266a15809.jpg","description":"Nimbus is a unique combination of racing & puzzling. The player controls a craft with no means of directly propelling itself and needs to use whatever is scattered around the levels to acquire thrust and reach the goal. Traverse a world map with several distinct islands in order to recover your lost love. Light on story, but heavy on gameplay Nimbus offers several hours of increasingly harder challenges.\nKey features:\nOver 50 levels available on the main campaign\nUnique game play that is easy to understand, but hard to master\nA varied blend of levels that requires a combination of skill & puzzle solving\nPlenty of opportunity for optimizing how you approach each level in order to beat the best times\nSeveral trails, levels and ships to unlock\nLoads of secrets & tricks","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Noumenon Games","platforms":[{"id":0,"name":"PC"}]},{"id":16524,"name":"WORLD END ECONOMiCA episode.02","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/977/9772809341c3b386ddc549c11d3b3bfc.jpg","description":"From the creator of Spice and Wolf, Isuna Hasekura, comes World End Economica. Haru woke up with his life but without his dream. 4 years after the incident, he finds a new cause, as a driven young lady offers him a chance to return to investing and to find justice.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Spicy Tails","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15315,"name":"Alien Hallway","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c77/c77cd75b059b7a7dfe671bd81f005c83.jpg","description":"Alien Hallway is a totally new action- strategy shooting game for the PC developed by Alien Shooter series makers, Sigma Team company.\nHere, in Sigma's adrenaline-fueled game, players measure stamina with a never-ending stream of green creatures within the borders of a special military mission. The rules are severe and the fate of Humanity is put on the line.\nControl an entire army in a challenging single-player campaign mode with a simple click of the mouse. With an approachable interface, players can go through a three-dimensional battlefields destroying the enemies with superpowered weapons, throwing various types of grenades, using airstrike skill, and upgrading both the base and the units. Players make serious decisions saving the soldiers and earning gold bonuses which are vital in this intense confrontation.\nConstantly changing settings and glow effects mixed with heavy, rythmic music add life to the game and keeps you captivated - you'll be hooked!\nKey features: \t\t\t\t\t\t\t\tDynamic Single-Player Campaign - A Captivating atmosphere of unknown Planets full of suspense and tension serves as an arena for endless fights between Humans and Aliens!\nEasy Mouse Control - Easy to learn controls make the game attractive for all kinds of players - Attack, upgrade, and buy items with just a click of the mouse.\nPlain Navigation - Explore the battlefield effortlessly by simply moving the mouse sideways. Scroll the mouse-wheel to zoom.\nUnlimited ability to upgrade your skills and weapons - Players are able to intensify skills by upgrading the base and the units in the shop: unlock blocked slots, increase air strike skills, add gold bonuses, decrease cool times, upgrade turrets and expand energy cell capacity.\nUnique characters - What's unique? Watch classic green-headed aliens. The whole race from larva till adults is reproduced.\n","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Sigma Team","platforms":[{"id":0,"name":"PC"}]},{"id":12827,"name":"ETHER VAPOR Remaster","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8a/d8a4f0365bf742907676c24857834819.jpg","description":"All hope seems to be lost for the country of Lydia in their war against Caldea, which has a huge advantage in numbers and technology. Into the midst of this war flies an unknown pilot in a prototype fighter...  His agenda and the secret to the his awesome firepower will be revealed as he takes on overwhelming numbers of enemy fighters and massive bosses to reach his final objective.\nEther Vapor Remaster is a cinematic 3D arcade shooter and visual treat from developer Edelweiss. Explosions, lasers, ships and backgrounds are breathtakingly rendered. The dynamic camera uses vertical, horizontal and cinematic chase cam views to switch up the action and highlight the drama. Use multi-lock-on to shoot tens of missiles at a time and even blow up an entire battleship in the challenging Bonus Zones.Key Features:Gorgeous 3D graphics, supporting up to 1600 x 1200 resolution and anaglyph 3D mode\nDynamic camera provides vertical, horizontal and cinematic chase gameplay\nDestroy the enemies with Gatling, Winder and Lock-On weapons, each with a unique & powerful Charged Shot\nCinematic Bonus Zones with Multi-Lock-On mode\nOnline leaderboards","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Edelweiss","platforms":[{"id":0,"name":"PC"}]},{"id":8602,"name":"Dragon's Lair HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3f1/3f1f3ed174e14cce6c89b64c118ba6f1.jpg","description":"Haven't heard of Dragon's Lair?! Well, you play the heroic Dirk the Daring, a valiant knight on a quest to rescue the fair princess from the clutches of an evil dragon! Originally released in the summer of 1983, Dragon's Lair has solidified itself as a cultural icon in gaming.\nControl the actions of the daring adventurer, finding your way through the castle of a dark wizard, who has enchanted it with treacherous monsters and obstacles. In the mysterious caverns below the castle, your odyssey continues against the awesome forces that oppose your efforts to reach the dragon’s lair.\nDragon’s Lair is a fully animated classic arcade game from legendary animator Don Bluth. You’ll make your way through the castle and caverns below and wield your sword against some strange creatures.  Beware of your foes, as they are numerous!\nLead On Adventurer. Your Quest Awaits!Features\n720p HD Remastered Video\nOriginal Arcade Release\nRemastered Game Footage\nBonus Extras -- Interviews With Creators, Watch Game and more!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Digital Leisure","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":5715,"name":"ScreamRide","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/da0/da015745ca82dff413d419e3783da7a0.jpg","description":"This game features stunning high definition graphics, hundreds of customizable building components, physics-based destruction, cinematic collisions, unlockable levels, in-game leaderboards, global rankings and more.  ScreamRide is the home of limitless innovation. Push the boundaries of thrill seekers everywhere. Take on your perfect role to complete each level in multiple ways. Scream seekers can prove their precise piloting skills, engineers can solve cunning construction puzzles and demolition experts can ignite the most explosive carnage possible. The path you choose is up to you!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":2397,"name":"Shadow Blade: Reload","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a24/a24ef7c50212a1260671530bd6be9d61.jpeg","description":"Shadow Blade is an action-platformer set in a visually striking world where the ancient teachings of ninjas and samurai clash upon a modern landscape.  Sprint through stages littered with traps, slaying enemies along your path without hesitation as Kuro, the blade of shadow!Story\nDarkness and chaos are once again creeping into the world of man.  The covenant made in a time almost forgotten has failed, the three clans now in a violent struggle for dominance.  The medallion is almost made whole again and it falls upon Kuro?s shoulders to restore balance.  All his training has led up to this one moment, where the fate of the world will rest in his blood-stained hands.Key Features\nEpic NINJA Platforming: Test your skills in fast-paced platforming, mastering the skills of the ninja to breeze through challenging levels.\nVicious NINJA Combat: Kill your enemies with extreme prejudice through the mastery of the katana, shurikens and kusarigama!\nShadow Ninja: Attack the guards before they see you and alert all other mobs.\nStory Campaign: Fully voiced motion comics tell the story of Kuro?s plight to restore balance!\nMore than 50 Challenging Levels: Environmental hazards, rifle-toting warriors and many more challenges await a hardened warrior.\nLevel Secrets: Raw speed doesn?t guarantee the highest rank.  A true ninja is ever vigilant, aware of any possibly hidden areas.\nNinja = Hardcore: Cleared the normal campaign?  Prepare for the ?Hardcore? variation and if you dare, the ultimate ?Master Class? version awaiting only the foolhardy.\nChallenge Modes and Leaderboards: Feel the need to gloat?  Challenge yourself in these specially crafted stages only for the masters.  Compare your stats with friends and other players as you fight for the top of the leaderboards!\nAdditional Features\nLevel Editor and Workshop Integration: Create and upload your own levels to Steam Workshop for your friends and other players to check out.  Become the ultimate Dojo Builder!\nStylish 3D World:  Feast your eyes on a world where ninja and samurai clash in a modern landscape.\nAchievements: Unlock a full list of achievements as you embark on your mission to restore balance.\nCloud Saving:  All progress saved through the Steam Cloud for pick-up-and-play on any steam powered device.\nThe Deluxe Edition includes:\n1 - Shadow Blade: Reload game\n2 - Art Book\n3 - Comic Book\n4 - Original SoundtrackFollow the development on Twitter @DeadMageStudio","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dead Mage","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1864,"name":"Carmageddon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ca/6ca508f924da59e8cab1610b30117b56.jpeg","description":"Carmageddon is the original freeform driving sensation, where pedestrians (and cows!) equal points, and your opponents are a bunch of crazies in a twisted mix of automotive killing machines. The game features anarchic drive-wherever-you-like gameplay and over-the-top surreal comedy violence. It’s the racing game where racing is for wimps.\nNow the same Mac & PC classic that was BANNED AROUND THE WORLD is back and available on iPhone, iPad and iPod touch!\nCarmageddon features real-world environments that have been turned into killing fields, where the locals stay out on the streets at their peril. As well as using your car as a weapon, every level is sprinkled generously with power-ups that have a vast variety of mad effects, adding a whole extra level of craziness to the proceedings. In every event you have the option to “play it your way”… Waste all your opponents, kill every pedestrian, or (perish the thought) complete all the laps. Oh and watch out – the cops in their super-tough armoured patrol vehicles are lurking, and if they catch you being bad they’ll be down on you like several tons of cold pork!\nFEATURES\n• 28 dangerously deranged Opponents\n• 11 wildly exhilarating Environments\n• Career Mode featuring 36 satisfyingly violent Levels\n• Race and Wreck opponents to unlock 30 playable cars!\n• Universal App\n• iCloud Support\n• 27 Cunning Stuntworthy Achievements\n• Leaderboards\n• Game Center integration\n• Multiple control methods: digital, analogue (mix ‘n’ match), tilt\n• Edit your control layout in game to your preferences\n• Comprehensive Action Replay System\n• Movie editing; Save your movies straight from the game to YouTube; Share links using iOS 6\n• Retina display and iPhone 5 support\n• Environment maps and other special effects\n• Enhanced pre-lit environments\n• Buckets of gibs\n• Tons of laughs\nPlus the opportunity to make in app purchases to unlock ALL the cars (apart from the secret one) and ALL the races!\nCarmageddon requires iOS 5.1 or later.\nAWARDS AND RECOGNITION FOR THE ORIGINAL GAME\nCarmageddon won the “Game of the Year” trophy in the 1997 PC Zone Reader awards. Carmageddon 1 & 2 were “Driving Game of the Year” 1997/1998.\nSELECTED REVIEWS OF THE ORIGINAL GAME\nOriginally released for the PC in 1997, Carmageddon was an instant hit and the titles went on to sell over 2 million copies worldwide. Here’s what a sample of the gaming press thought at the time:\n“Carmageddon is visceral, violent, vehicular fun...” - GameSpot 8.8 out of 10\n“Carmageddon, to get straight to the point, is one of the best computer games I've ever played… Carmageddon is God!” - Duncan McDonald 95% Classic Award PC Zone Magazine\n“Carmageddon is one of those games that only come along once in a blue moon. An essential purchase.” - Escape Magazine 6 out of 6\n“The gameplay is spot on and anyone with a dark enough sense of humour should give it a go.” - Computer Gaming World 4 out of 5\n“So next time you gun down coppers on GTA VI, just remember, Carmageddon’s controversy was there first, and you have a lot to thank it for.” - RetroGarden\nABOUT STAINLESS GAMES\nStainless was founded in 1994 by Patrick Buckland, a veteran of the games industry going back to the Jurassic period of 1982, and Neil Barnden, who used to have hair like a mammoth. A team of 8 worked on the original Carmageddon at Stainless, and 5 are still with the company today, although a couple of them are now kept manacled in a small padded room in the cellar.\nStainless Games now employs well over fifty mad, dedicated people of assorted gender, height and width. They can all be found dangling precariously from a small chalky rock just off the South Coast of England.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Stainless Games","platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Nintendo 64"}]},{"id":1539,"name":"White Night","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/53d/53de2c8849c5c75068c241883d71e706.jpg","description":"The dark will reveal all!\nExplore the macabre past of an old mansion in the 1930's and solve puzzles of light and shadows in this fully black & white survival horror! Players are trapped in this nightmare where darkness is a constant threat!Classic Survival-Horror 3D Mechanics:Solve puzzles of lights and shadows to survive.Shed Light on the Mysteries of the Mansion:Collect matches to light your way and reveal the next passage.Dark Entities Lurk in the Shadows:Avoid apparitions to continue your search for answers.Immerse Yourself in the Noir:Unique art style engrosses the player in the tone of Film Noir.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Activision","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":666416,"name":"Plunder Panic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/834/834821c3e620e7e7ea3490edbf4a3268.jpg","description":"Plunder Panic is a swashbuckling, up to 12-player action-arcade game where two rival crews battle for supremacy on the high seas! Featuring both local and online play, work with your crew to plunder booty, defeat the enemy captain, or scuttle their ship. The first team to capture an objective wins, so be on the lookout for other sneaky pirates!\nRaise the Jolly Roger and dive into this blend of classic and modern games, where retro graphics and simple controls meet fast-paced, frantic arcade action. With multiple play modes, unique power-ups and game changing modify-arrs, there are hundreds of gameplay combinations guaranteed to shiver ye timbers! Plunder Panic features flexible team configurations, including local, online, and AI-controlled players. Time to assemble your crew, get all hands on deck and send your scurvy competition to Davey Jones’ Locker!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Will Winn Games","platforms":[{"id":0,"name":"PC"}]},{"id":589198,"name":"Lacuna – A Sci-Fi Noir Adventure","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fa8/fa82bd27f3b93ec4dc34572126736bc5.jpg","description":"Another cigarette tumbles into the abyss. The sun is slowly coming up,\nglistening in the sea of buildings below.\nI look up at the stars one last time before they disappear.\nThey don't provide any guidance. They don't give a f*ck.\nI have to make this decision on my own, and very soon. Problem is, I don't know how.\nI've never been able to figure out why I do what I do. Not really.\nNo more time to think. I have to go.\nHere’s the deal\nYou are Neil Conrad, CDI agent. Awoken by the news of a murder, you rush into a case that will soon turn your life and the whole solar system upside down. Ask questions, collect evidence, and put the pieces together until the ugly truth reveals itself... or not.\nNo takebacks\nThe story branches and ends based on your actions. There's no going back. Sure, you can rush your way to the end – if you don't mind paying the price. Play your cards right, and you might make it out alive.\nHow far will you go?\nSome questions don't have a right answer. Will you sell out a friend to protect your family? Will you endanger a loved one in exchange for public safety? Will you keep the peace or reveal the horrible, world-shattering truth?\nHungry for Point & Click Adventure?\nWhile the classics were great in their time, Lacuna does away with the baggage of many adventure game tropes:\nPointing & clicking Platformer movement controls (WASD / controller)\nSelecting all dialog options one by one anyway Non-repeating conversations and choices\nInventory management and counter-intuitive puzzles Immersive, story-driven mysteries\nPixel hunting Optional outlines on anything interactable\nStory grinds to a halt at every puzzle can always be driven forward\n\"x will remember this\" Real choices and multiple endings","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"DigiTales Interactive","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":494394,"name":"Monster Hunter Stories 2: Wings of Ruin","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f79/f79662d3267e50434ab6c674d47aa1f1.jpg","description":"Monster Hunter Stories 2: Wings of Ruin offers both RPG and Monster Hunter fans a unique new experience with a rich storyline featuring charming characters, challenging quests and friendly encounters with familiar monsters from the Monster Hunter series. Assuming the role of a young Monster Rider who can use a Kinship Stone to form strong bonds with monsters, players can gain experience and improve their skills to form deeper connections with these wonderful creatures. When ready, players can embark on memorable adventures filled with dramatic events and heartwarming friendships as the epic tale unfolds.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":367056,"name":"Help Will Come Tomorrow","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1a/a1ad1c3ffcbd778bc5a8b6987565924c.jpg","description":"In a uninhabitable Siberian wilderness, in a wake of October Revolution, a group of passengers survives the mysterious catastrophe of Trans-Siberian railway train. They must endure in a harsh ice-clad climate until rescue arrives. Facing many dangers, their own weaknesses and, above all, their own prejudice. People from different social classes have to unite and make decisions that often go against their beliefs, either by putting them to the test or by completely breaking them. Will they survive and at what cost is only up to the player.\nThe basic mechanics of the game will focus on the survival of the characters (meeting their needs, gathering resources, expanding the camp, taking care of security, exploring surroundings), but the player will quickly find out that in order to win, he needs much more: to learn the personality of the characters and work out relations between them, mitigating conflicts and taking care of the morale. You may choose to act selfish but it is cooperation that will allow you to win and keep clear conscience.\nIn Help Will Come Tomorrow you will:\n•         Overcome class animosities between your party members in order to survive in an innovative class relations building system.\n•         Manage scarce resources and stay alive in frosty wilderness of Siberia before help arrives.\n•         Guide 9 unique characters coming from different social origins and grouping in three society classes\n•         Discover intimate stories and past of all party members\n•         Build and expand your own camp to increase the chances of survival\n•         Face dynamically changing weather conditions and unforgiving Siberian wildlife affecting survivors life.\n•         Experience in-game Event system based on characters relations and morale\n•         Immerse yourself in touching story set in 1917 pre - Bolschevik Imperial Russia","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Arclight Creations","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":248400,"name":"Enlisted","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9da/9dad0e1b6406a4685f244c58854a0ea2.jpg","description":"Enlisted - is an MMO squad based shooter which is built around some of the most important and famous episodes from World War 2.\r\n\r\nIn Enlisted, players can experience these famous battles on a massive scale through the real heroes of those encounters - the soldiers. In some modes, players won’t be fighting alone on the battlefield, they will be leading their own squad of AI controlled soldiers, this will grant a unique scale to the combat. Engagements with up to hundreds of soldiers fighting simultaneously will be held on different fields of battle with maps up to hundreds of square kilometers.\r\n\r\nThe latest version of the Dagor Engine is able to calculate huge detailed spaces, dynamic water and skies, while using physically based render.\r\n\r\nTeamplay, the correct evaluation of actions with consideration of the current situation on the battlefield, weapon and character capabilities - all of these will be essential parts of Enlisted. Players will gradually unlock new characters who will all have different playstyles. Additional diversity in the battles will also be granted by a wide weaponry selection. Just like in a real war, where you rarely can see two absolutely identical rifles - weapons in the Enlisted will have their own features and their own history.\r\n\r\nPopular World War II battles will be present in the Enlisted in separate campaigns. To re-create each of these battles requires not only the creation of separate content like new locations, characters, weapons and vehicles - it also requires a huge amount of work on creating the game rules and balance in them. This is why each campaign will be developed separately from each other.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Darkflow Software","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":234013,"name":"Endless World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/715/71588faa47649419a21e38c85f763b21.jpg","description":"“Endless World” is a 3D idle casual ARPG. Explore an endless world and become stronger with every battle. Collect rare equipment and recruit over 20 legendary heroes to help you in your adventure. In the end, every defeats you have will only make you stronger.\nKey Features\nSummon Heroes\nNo hero ever travels alone. Recruit over 20 heroes with various abilities to help you in your quest. However, their spirit fragments had been scattered across the world. Explore the endless world and collect all of their spirit fragments to summon them to your side!\nSkills & Talent\nUnlock and upgrade your skills to advance faster! Pick a talent to be upgraded with specific property based on your playstyle. Upgrade your skills to power up your “Werewolf” form to unleash devasting attacks!\nExplore Different areas\nTravel across different areas. From the volcanic lands, the jungles, the abyss, to the snowy mountains and more. Each area is not only filled with deadly monsters and beasts, but also fantastic treasures to be found for your hero.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Radiance Games","platforms":[{"id":0,"name":"PC"}]},{"id":52799,"name":"Chrono Cross","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2ad/2ad33347237cdc941ba5312787dbe3f8.jpg","description":"Chrono Cross (クロノ・クロス, Kurono Kurosu) is a 1999 role-playing video game developed and published by Square for the PlayStation video game console. It is the successor to Chrono Trigger, which was released in 1995 for the Super Nintendo Entertainment System. Chrono Cross was designed primarily by scenarist and director Masato Kato, who had help from other designers who also worked on Chrono Trigger, including art director Yasuyuki Honne and composer Yasunori Mitsuda. Nobuteru Yūki designed the characters of the game.\nThe story of Chrono Cross focuses on a teenage boy named Serge and a theme of parallel worlds. Faced with an alternate reality in which he died as a child, Serge endeavors to discover the truth of the two worlds' divergence. The flashy thief Kid and many other characters assist him in his travels around the tropical archipelago El Nido. Struggling to uncover his past and find the mysterious Frozen Flame, Serge is chiefly challenged by Lynx, a shadowy antagonist working to apprehend him.\nUpon its release in Japan in 1999 and North America in 2000, Chrono Cross received critical acclaim, earning a perfect 10.0 score from GameSpot. The game shipped over 1.5 million copies worldwide, leading to a Greatest Hits re-release and continued life in Japan as part of the Ultimate Hits series. Chrono Cross was later re-released for the PlayStation Network in Japan in July 2011, and in North America four months later.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":44765,"name":"Patapon Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7c6/7c6239e38daa20aac4c140c7feeabefe.jpg","description":"Patapon™ returns to PlayStation with all new enhancements taking full advantage of the PS4 and PS4 Pro!\nPatapon™ is a rhythm-based 2D platform/action game marching to PlayStation®4 with revitalized graphics output in 1080p and 4K resolution on compatible displays.  For years the Patapon tribe has lived in the desolate frontier, driven from their home by the evil Zigoton army.  Behind the Patapons' cute exterior, lies a fierce warrior spirit that can only be commanded by the beat of their God’s war drum.  They wait for the day that the 'Almighty' will return, to lead them against their enemies and bring them back to their homeland.  Finally, their wait has come to an end as the drums of war are heard once again.\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2008,2017 Sony Interactive Entertainment Inc. ©2008,2017 Rolito/Interlink.  Patapon is a trademark of Sony Interactive Entertainment LLC.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":32028,"name":"Heroes of Might and Magic 3: The Shadow of Death","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/27b/27bccacfcd840bf587e4e59cf4a8f575.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"New World Computing","platforms":[{"id":0,"name":"PC"}]},{"id":28347,"name":"Geometry Wars Evolved²","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/374/3740072f58ba0b1720fd543eaaf41382.jpg","description":"Local Multiplayer 2-4, HD (High Definition). Experience an unbelievable adrenaline rush from playing the latest version of the frenetic retro shooter Geometry Wars: Retro Evolved 2!  Newcomers and pros alike will be blown away by the screen-melting intensity and insane new features, including six action-packed gameplay modes, new enemies, new scoring strategies and a diverse list of exciting achievements! If that’s not crazy enough for you, try multiplayer mayhem for up to four players! Use power-ups in versus mode to boost your stats or handicap your opponent. Or team up with others in co-op mode. Play it all in razor-sharp 1080p to new pulse-pounding music! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Bizarre Creations","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":19659,"name":"Chronicles of Mystery: The Scorpio Ritual","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a3d/a3d463cddba7a565d3cf7c7876ca7b31.jpg","description":"Uncover the darkest secret of humanity!\nYoung archeologist Sylvie Leroux accidentally stumbles upon an ancient secret. What she doesn't realize is that her research will put her in deadly peril. Who wants to prevent her from finishing her research? Are mere humans standing in her way, or is it a supernatural power?\nDramatic story with many twists and turns\nMystical atmosphere with breathtaking graphics\nChallenging and intense puzzles\n","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"City Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":18306,"name":"Tick Tock Isle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3cb/3cbf8734ce48c8c5c0b94a189fcfbfe1.jpg","description":"In the year 20XX a confident, young horologist by the name of Strike is inadvertently transported into the past while attempting to repair a mysterious, abandoned clock tower. Endeavoring to return to the future, Strike must fix both the time machine and the island’s dysfunctional family who are responsible for much of the clock’s disrepair.\nAs the spiritual successor to Cat Poke, Tick Tock Isle plays like a puzzle platform game that relies heavily on story, character interaction, creative thinking, and poking.‬\nThe music and sfx are by Kevin Carville.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Squiddershins","platforms":[{"id":0,"name":"PC"}]},{"id":17963,"name":"Where's My What?","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ba/2ba7548e42a77481e3182805f1e97aa8.jpg","description":"Where’s My What is a simple yet highly addictive game where you must identify and select a certain number of items on the screen before time runs out! While it sounds simple, it quickly becomes a dash against the clock as you pinpoint the right items in dozens of included categories. If you choose a wrong item, valuable seconds are lost. If you choose a correct item, valuable seconds are given. Are you quick enough to get triple-star ratings? Adventure Mode features an amazing 100 levels to complete and the farther you get, the more difficult it becomes. Free Mode is a race against time as you play to beat your own record by discovering as many items as possible. You can even invite a friend to your house for some local two-player fun!KEY FEATURESSingle Player Adventure- & Free-Mode\nLocal Two-Player Turn-Based Mode\n100 Challenging Levels\n70 Exciting Categories\n100s Of Items To Discover\n3-Star Rating System","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":17091,"name":"NEON STRUCT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/502/5025cd820a246b1f85d15cf99be22680.jpg","description":"You are Jillian Cleary: an ex-spy on the run, framed for treason and hunted by your former agency. You must move in secret, survive off the grid, and find a way to clear your name. Old friends and new allies will lend their support; but with the eyes of the world upon you, who can you trust?StealthKeep in the shadows, move in silence, and stay out of sight. Escape from tight situations by scrambling your enemies' vision. Enhance your performance with black market stims.WorldExplore a concrete-and-neon brutalist vision of the modern surveillance state. Undertake eight missions spanning two continents. Meet a diverse range of interesting characters.MusicFeaturing an 18-song soundtrack by electronic rock band The Home Conversion.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Minor Key Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":16963,"name":"Guardians of Graxia","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ada/adaec607f3249505178dd42b9ff07d3c.jpg","description":"Guardians of Graxia takes on the form of a card-based board game set in a floating island environment high in the sky of the Graxia world. Releasing with four powerful Guardians that will guide your armies into battle, charge onto the battlefield by laying out your forces strategically. Gameplay advances in turns by selecting new unit and spell cards to place and move on the tiled map surface. Win by completing any of the numerous skirmishes, or by defeating Draknal Trueblood in the game's initial campaign!\nThe floating continents are filled with the cities and dens of dozens of magical races, including Dragons, Dwarves, Elves, Goblins, Humans, and many others. Guardians are the only ones able to create magical portals which are the sole means to cross from one drifting continent to another. The various creatures are constantly at war with each other through using their Guardians and armies via the portals. Use these portals to transport your armies and conquer the land found on the other side!\nKey features:Combines the best of a card game and board game in a PC format.\nDynamic gameplay using cards and map tiles in a floating continent environment.\nSingle-player skirmish and campaign modes available.\nHighly replayable with over 240 Unit and Spell Cards.\nGame card creatures include: Dragon, Dwarves, Elves, Goblins, Humans, Orcs, Skeletons, Wisps, Wraiths and many more!\nGuardians are represented in the game as primary player units that command your armies into battle!\nBuilt to be expanded with additional map packs and other content updates.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Petroglyph","platforms":[{"id":0,"name":"PC"}]},{"id":15946,"name":"Infectonator: Survivors","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8aa/8aa924bc0272459fea2b26b60bc3c66f.jpg","description":"Imagine if Left 4 Dead gets a retro make-over and mixed with a little bit of roguelike and survival simulation mechanics, the result would be \"Infectonator : Survivors\".\n\"Infectonator : Survivors\" is a Randomized Permadeath Survival Simulator that combines RTS, Tower Defense, Roguelike, and Management-Simulation gameplay. Your goal is to lead a group of survivors in a struggle to stay alive and find rescue in a zombie apocalyptic world. You must scavenge resources, build defenses, and find a way to survive in a game where death is permanent and levels are randomly generated.\nKey Features\n• Awesome pixel art graphics.\n• Randomly generated cities every time you play.\n• Permanent Death. Each survivor matters, every decision counts.\n• Addictive TD gameplay combined with action packed real time strategy elements.\n• Deep and engaging management simulation gameplay.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Toge Productions","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13686,"name":"Tribal Pass","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c28/c2866f3a722412ad50d52f843270a5ce.jpg","description":"Peace no more. Tomorrow – no more.\nShaman said: \"Flaming Dew scorches the earth, wipes the life – soon.\"\nShaman said: \"Death remains here. Life awaits – somewhere.\" The tribe sets off. For the Big Pass.\nTribal Pass is a tactical hardcore runner comprised of resource management and environment interactions – all on the run.\nTribesmen make their way through the unfriendly wilds encountering a quick river, a herb, a human and a beast of various danger. You play around encounters, splitting and uniting the tribe, arming it properly, making sure your people are alive and your food is in stock.\nPlease mind the fact that this really is a RUNNER (of no sort you've ever seen, though) – there's no stopping till the sun drops and the run ends.\nThe runs are procedurally built and ruthless to new players, but eventually it all depends on the player's skill.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Stas Shostak","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":12003,"name":"Karos","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/01c/01ce53b379c1e21d9bb8e6cc47ebdd99.jpg","description":"Karos has gained a living MMORPG classics status. It has amazing fantasy world where you can find the most unusual. Variety of locations, a great number of dungeons and monsters will make you plunge into the world deeply.\nPVP plays an important role in the Azmara world (It is the name of the virtual world of Karos). Heroes not only have the chance to fight with each other, but also especially for this they can participate in grand battles and fight at PVP arena. Your character could be totally unique because of character customization, a wide range of costumes and amazing mounts and pets.\nThe multitude of game professions and classes, epic battles between guilds and factions, dungeon raids, elaborate crafting system and other necessities essential for a modern MMORPG found their flawlessly neat execution in Karos. At the same time it is hardly possible to charge Karos developers with lack of original ideas while there is, for instance, the Fletta system in the game. Currently there are 5 servers for Karos. One of it is new server — Bloodstone. That's where you can start your journey through the world Azmaria.\nKaros is one of those games which are easy to learn and are hard to master so it can be equally enjoyed by both novice gamers and warworn vets.Features\nF2P with an opportunity to trade in-game money for premium shop currency (Money Auction).\nUnique Fletta-system: along with experience a player gains magical Fletta-points which can be invested in development of Fletta-skills or used to enchant items in some really special way. The Fletta-enchanted items increase their stats following the character’s levelling progress.\nEpic battles between factions and guilds for total dominion over castles and mines which can generate significant income for the conqueror.\n4 races, 7 classes, 42 professions with 12 unique superskills for each class.\nWith the advanced crafting system a player can create some really wear-worthy equipment.\nVarious PvE and PvP modes: from face-to-face duel to devastating siege with unlimited participants.\nConstantly issued large-scale updates.\nOngoing in-game events and 24/7 support service.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Galaxy Gate","platforms":[{"id":0,"name":"PC"}]},{"id":678642,"name":"The Jackbox Party Pack 8","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8e1/8e152f411bb1864b532b08ec8b7eb6d9.jpg","description":"About The Jackbox Party Pack 8The eighth installment of the beloved Jackbox Party Pack franchise is here! Five hilarious new games will energize your next game night, holiday party, happy hour, or video call.\nNo extra controllers needed - players use their phones or tablets to play along! Got a bigger group? Play with up to 10 players and up to 10,000 audience members.\nThe Jackbox Party Pack 8 is currently in English only. This game does not support online matchmaking but can still be enjoyed remotely using livestreaming services or video conferencing tools.About Each GameDrawful Animate (3 -10 players) - It’s alive! The guessing game with terrible drawings and hilariously wrong answers makes a dynamic return. In this revamped title, players create looping, two-frame animations based on weird and random titles.\n.The Wheel of Enormous Proportions (2-8 players) - Trivia has never been so large! A fantastic, mystical wheel challenges you with a variety of trivia prompts. Winners are awarded slices of the Wheel’s face with a chance to win big with each nail-biting spin. In the end, one player will have their most burning question answered by the great Wheel.\n.Job Job (3-10 players) - Use other people’s words to create unique and funny answers to classic job interview questions. Go head to head to see who scores the job!\n.The Poll Mine (2-10 players) - A survey game that’s all about YOU! Split into teams and see who can escape from the witch’s lair! Players individually rank their choices to a difficult question, then must guess how the group answered as a whole. How well do you know your friends?!\n.Weapons Drawn (4-8 players) - A social deduction game where everyone is both a murderer and a detective. Players doodle all the clues, hiding a letter from their name in the weapon drawings. Can you solve murders while trying to get away with your own?\n.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Jackbox Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox Series S/X"}]},{"id":60189,"name":"Boobs Saga","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7be/7be267c8d585b143d1924746567f8a76.jpg","description":"Imagine that you're a young woman with some tasty curves; and it can only mean one thing - you're a perfect sacrifice to the King of the boobs! Avoid traps, fight monsters or hide from them, solve puzzles, dance. And remember: the main goal is to save your BOOBS!\nBoobs Saga - is a satirical 3D action.\nKey features:\n- Unique weapons (gatling boobs, strapon-plasma gun and more);\n- Ultraviolence;\n- Cooperative campaign;\n- Customizable character;\n- Playable demon character;\n- Amazing puzzles;\n- Realistic women breasts and ass physics;\n- Truly special atmosphere;\n- Dangerous traps;\n- Girls in swimsuits, blood, screams and many more...","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Kukhtenkov Georgiy","platforms":[{"id":0,"name":"PC"}]},{"id":60178,"name":"Gray Dawn","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f6/1f698c752488c11f4a5efab8448c731f.jpg","description":"You will be entangled in a terrifying adventure of a priest on a quest to prove his innocence. Guilty or not, you find yourself trapped in the middle of strange events involving a demonic possession and divine apparitions.\nEach time you remember the boy or hear about being accused of murder, you go into a trance fueled by fear. These moments of madness depict gore, repulsion towards God, and sometimes even the voice of the devil himself trying to convince you of things that may or may not be lies...\nGray Dawn takes place around the year 1920,  in a remote village in England. Throughout the game, you will often be transported to the beautiful world of Romania, which is inspired by the mysticism of Eastern Europe.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Interactive Stone","platforms":[{"id":0,"name":"PC"}]}]