[{"id":959976,"name":"Cassette Beasts","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fbd/fbd1bed9eb46cf9164058685f8bc176a.jpg","description":"Check out another Raw Fury RPG!https://store.steampowered.com/app/1658150/Moonstone_Island/\nAbout the Game\nAdventure. Battle. Transform.\nCollect awesome monsters to use during turn-based battles in this open-world RPG. Combine any two monster forms using Cassette Beasts’ Fusion System to create unique and powerful new ones!\nWelcome to New Wirral, a remote island inhabited by strange creatures you’ve only dreamed of, nightmares you hopefully haven’t, and a cast of brave folks who use cassette tapes to transform for battle. To find a way home you’ll need to explore every inch of the island, and record monsters to your trusty cassette tapes to gain their abilities!\nTransform into monsters...using retro cassette tapes?!\nFaced with the constant threat of monster attacks, the residents of Harbourtown, New Wirral choose to fight fire with fire. Record a monster to tape, then play it back to take on its form for battle!\nFuse monster forms!\nGetting close to your companion has benefits–while transformed you can combine your strengths to gain the upper hand in battle! Any two monster forms can be fused to produce unique, fully-animated new fusion forms.\nExplore a rich open world\nCertain monster abilities can be used in human form. You’ll need these to help you get around, solve puzzles, and locate dungeons. Glide, fly, swim, climb, dash, or turn magnetic!\nTravel alongside a diverse cast of human companions\nNever fight alone! Form bonds, spend time together, and help your selected partner complete personal goals to become a better team. The strength of your relationship determines how well you’re able to fuse!\nMaster a deep battle system\nTake advantage of elemental chemistry to apply extra buffs or debuffs alongside your attack, or even alter your opponent’s elemental type!\nPlay couch-co op with Friends\nTeam up in local multiplayer with a friend to explore an open world, transform and battle together! Facing the unknown as a duo will surely develop your relationship!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Bytten Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":830232,"name":"Lost Light","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f6/4f624b7835462e6a90b9af43ed610d79.jpg","description":"Join our Discord!\nAbout the GameRealistic warfare survivalFactories, harbors, forests...... these once familiar sights have been desecrated by the wrath of the apocalypse. Never neglect small details on the battlefield or there will be fatal consequences. You must know your weapons and know your equipment, explore every corner of the battlefield, learn to effectively deal with hunger and pain, and make tactical plans...... Complete survivors' commissions, scavenge for supplies, and hone your skills to survive the exclusion zone.\nAuthentic Firearm CustomizationFrom structures to textures, the firearms in the game are meticulously recreated to provide players with the most realistic firearms experience. Each firearm supports up to 12 modifiable parts and hundreds of components to choose from. It's time to optimize your loadout from hundreds of possibilities. Of course, the system will also provide several recommended loadouts for Quick Equip.\nAll About TacticsIn Lost Light, violence is not always the answer—as long as you can find the evacuation point, you can make it out alive. You may choose to go armed to the teeth, wreaking havoc and reaping the loots, or you may choose to be a minimalist, scavenging your way to a small fortune. But remember, if you die in combat, you lose everything—the loots are not yours until you make it out alive!\nMap Out Before Moving OutPrepare yourself for battle in your shelter. Not only do you need to boost your body energy and stay in good shape, but more importantly, you have to customize and build your own loadout. But be careful with the gear you choose, because the battle begins when you start to equip yourself.\nDiversified Social InteractionUnlike conventional competitive survival games, Lost Light allows you to choose partnership over being a lone wolf. You may decide to team up with a spared enemy or commission other players to rescue you after you're knocked out—endless possibilities await!\nProfit Off Free-tradeAfter the evacuation, you retreat deep within the abandoned subway tunnels where you stash your loot and establish a foothold. After upgrading it to a full-fledged base of operations, you can set up shop and trade within Lost Light's player-driven economy. Sell your surplus and buy what's in need—Trade wisely and your chance of survival increases!\nCross-Platform PlayPC gamers can now feel the exhilaration of battle. Players on mobile devices and PC will be able to chat with one another for a cross-platform gaming experience. Form parties across the different platforms to complete more challenges and achieve the impossible!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"NetEase Games","platforms":[{"id":0,"name":"PC"}]},{"id":581204,"name":"Deduction","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/829/829a983d95f3a46d6dd39d6459d07566.jpg","description":"Play with 4-10 players online as you either try murdering everyone or finding the murderers and vote them out! Deduction follows the formula set by other hidden role games but has its own twists.\nWith inspiration from Among Us and Trouble in Terrorist Town, Deduction features cams, vents, and more.\nHave fun harassing your friends around the office!","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Red Fox Studios","platforms":[{"id":0,"name":"PC"}]},{"id":452607,"name":"SpellForce 3: Fallen God","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8bd/8bd356c987f12dd8176aecb5c8ace7e5.jpg","description":"Your dwindling, nomadic tribe of trolls has just one goal: survival. Plagued by vicious poachers for your precious tusks and weakened by disease, hope is almost lost - until an enigmatic Elven stranger offers you, the young chieftain Akrog, a path to salvation: you must resurrect a fallen god.\n\nFeatures:\nThe perfect blend of RTS and RPG: SpellForce 3: Fallen God combines RTS and RPG gameplay for an exciting blend of storytelling and epic real-time battles\nStandalone game and story: Fallen God is a standalone expansion to SpellForce 3. You don’t need to be familiar with the story of SpellForce 3 or SpellForce 3: Soul Harvest to jump right in\nSingle-player campaign: Featuring the dark, enthralling story of the long-misunderstood Trolls and their battle for survival, with a playtime of around 15 hours\nCustomize your heroes: Combine skill trees and abilities to create the perfect heroes for your strategy\nExplore a new continent: Discover Urgath and solve its mysteries using unique hero interactions with the world\nCraft powerful weapons: Salvage legendary weapons and armor from other races to give your Trolls the edge in battle\nLead your army to victory: Hone your battle strategy in an improved sector-based RTS system\nWin epic battles: Make the best use of each unit’s strengths to ensure victory\nImmerse yourself in Urgath: Enjoy the beautiful fantasy soundtrack and cutting-edge, top-down graphics","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Grimlore Games","platforms":[{"id":0,"name":"PC"}]},{"id":302881,"name":"Foregone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a8/2a86d494366a6524ea94b24472e3b3d3.jpg","description":"Souls-inspired Action-PlatformerThe combat is intense. The enemies are mighty. The weapons are plentiful.\nYears after the resolution of a devastating war, an organization of powerful Arbiters carries out one objective: maintain order, by any means necessary. When a nefarious force that consumed her wartorn city long ago suddenly threatens to reawaken, one Arbiter is dispatched to preserve order and keep the peace – but her mission dredges up memories better left forgotten.\nGuide the Arbiter through stunning pixel environments and slay legions of corrupted creatures in Foregone, a Souls-inspired action-platformer. An extensive skill tree and vast arsenal of weapons are at your disposal: use them strategically, and you just might survive. Let your enemies overtake you, and you’ll be forced to battle them all over again. And again. And again.\nFeatures• Intense, combat-focused action-platformer\n• Deep exploration-driven story\n• Challenging Souls-inspired gameplay\n• Huge arsenal of weapons\n• Extensive skill tree\n• Detailed next-gen pixel artwork\nEarly AccessForegone is expected to enter Early Access in Winter 2019.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Big Blue Bubble","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":61326,"name":"Booty Calls","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/193/193e68690c8d3f133875aecc7a593da7.jpg","description":"Help mermaid princess Andriella fulfill her task by getting it on with the hottest chicks of Naughty Beach!\nBelow the surface of the blue ocean, the curious mermaid princess Andriella desperately wants to see the world beyond the surface. Her wish finally comes true after meeting a mermaid witch who agrees on helping her under one condition: Andriella needs to supply her with a unique ingredient, that can only be obtained from sexy human girls.\nNow Andriella is with you and you must help her to get the special ingredient – by banging all the sexy chicks at Naughty Beach! Discover all the locations, get in touch with hot girls and show them, that you’re the master of Booty Calls♥!\nKey Features\n* MEET different girls with unique personalities\nMeeting girls might be easy, but to successfully bang them, you need to find out what they desire!\n* Experience A Unique New Puzzle Mechanic\nComplete dates and sex with the girls with a unique, fun and addictive puzzle mechanic\n* Receive Messages From Your Girls\nIf your girls are hooked, they send you hot pictures!\n* Improve Your Character\nUse various skill upgrades to make dating and banging girls even more fun!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"3X Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":58729,"name":"Beyond Good and Evil 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ab/3ab6181e75dd9d2e8600e1c17f6c95f0.jpg","description":"Journey to System 3 for the prequel to one of Ubisoft's most beloved games. Fight alongside venerable characters in a dynamic new solar system, as you struggle for freedom and the right to determine your own fate among the stars. Play the adventure by yourself or with friends in a vast and seamless online playground.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":57518,"name":"Super Mario All-Stars (1993)","genre":"Platformer","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a1/4a1b357e73d20695ec71461cab5a5073.jpg","description":"Super Mario All-Stars is a collection of previously released Super Mario NES platform games. Each title is presented with its original gameplay and level design, but has been given a makeover in the graphics and sound department. A save option has been added allowing players to store the session data.\n\nIncluded in Super Mario All-Stars are the following games:\n\n    Super Mario Bros.: Mario and Luigi must rescue the Princess and the Mushroom Retainers from the evil King Bowser.\n\n    Super Mario Bros.: The Lost Levels: known as Super Mario Bros. 2 in Japan, this game features the same style of gameplay as the original Super Mario Bros. The game contains poison mushrooms, which will shrink or kill Mario, and new and old enemies, such as Flying Bloopers.\n\n    Super Mario Bros. 2: also known as Super Mario USA in Japan, Mario and friends discover a mysterious land, called Subcon, that is being destroyed by Wart and his minions. They must rescue this strange land from the tyrant.\n\n    Super Mario Bros. 3: Bowser, with the help of his Koopalings, takes over the Mushroom Kingdom's 7 lands and turns their kings into creatures. It's now up to Mario and Luigi to save the Mushroom Kingdom","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii"},{"id":0,"name":"SNES"}]},{"id":53781,"name":"Disney's Darkwing Duck","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6ba/6ba189a9b636a5bbd1d7e5de58b6cf6d.jpg","description":"Darkwing Duck is a platformer video game based on the Disney television series Darkwing Duck. The game was developed by Capcom for the NES in 1992 and was ported to the Game Boy in 1993.\nThe NES version of the game was included in The Disney Afternoon Collection compilation for PC, PlayStation 4, and Xbox One in April 2017.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Capcom","platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"},{"id":0,"name":"SEGA 32X"}]},{"id":53435,"name":"Mother 3","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab7/ab7f986a92bb56a7574ad8ad3d607227.jpg","description":"Mother 3 is a 2006 role-playing video game in the Mother series, developed by Brownie Brown and HAL Laboratory, and published by Nintendo for the Game Boy Advance. The game, which is the final entry in the series, was directed by Nobuyuki Inoue, written by series creator Shigesato Itoi, and scored by composer Shogo Sakai. The story follows Lucas, a young boy with psychic abilities, and a party of characters as they attempt to prevent a mysterious invading army from corrupting and destroying the world.\n\nThe game's development spanned twelve years and four consoles, beginning in 1994 for the Super Famicom console and then transitioning to the Nintendo 64 and its 64DD add-on before being cancelled in 2000. Mother 3 restarted development in 2003 for the Game Boy Advance and was finally released in Japan on April 20, 2006.\n\nMother 3 was a critical and commercial success upon release. Critics generally praised the game's graphics, music, and story, but believed that the gameplay offered few innovations to the role-playing genre. The game was never released outside Japan, though an unofficial English fan translation was released by the Starmen.net internet community in October 2008. On December 17, 2015, the game was released for the Japanese Virtual Console on the Wii U.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Brownie Brown","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":50076,"name":"Zup! 7","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc7/bc7a30ef68684643e1493e4318d6d6e6.jpg","description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ 2800+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nExtended panels of Steam's backgrounds were invented by Aevoa\nMusic by Ann Sharova","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":35763,"name":"True Crime: Streets of LA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fb5/fb56b4a6c05031a1c3d4a9b4edcbfdcb.jpg","description":"Experience the hard-boiled life of a Los Angeles city cop, and choose to either uphold the law or take it into your own hands. True Crime: Streets of LA puts players in the role of LA cop Nick Kang on missions to take down major crime syndicates. True Crime recreates a 420 mile area of bustling Los Angeles California cityscape, where players will be able to freely roam, or take on missions that span from trendy Santa Monica to the gritty streets of Hollywood. City activity is similar to Rockstar's popular Grand Theft Auto series, allowing for \"police acquisition\" of civilian vehicles. True Crime also features deep \"bullet-time\" shootouts, and martial arts battles.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"LTI Gray Matter","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"}]},{"id":32965,"name":"The Lost Vikings","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be7/be7d798ec269ef8cca2e7fea0ef0481d.jpg","description":"The Lost Vikings is a puzzle-platform video game developed by Silicon & Synapse (now Blizzard Entertainment) and published by Interplay. It was originally released for the Super NES in 1993,[2][3] then subsequently released for the Amiga, Amiga CD32, MS-DOS, and Mega Drive/Genesis systems the next year; the Mega Drive/Genesis version contains five stages not present in any other version of the game. Blizzard re-released the game for the Game Boy Advance in 2003. In 2014, the game was added to Battle.net as a free download emulated through DOSBox.[4]\n\nIn The Lost Vikings, the player controls three separate Vikings with different abilities. The three Vikings must work together to finish each level and find their way back home. A sequel, The Lost Vikings 2, was released in 1997.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Mass Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"SNES"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Boy Advance"}]},{"id":28795,"name":"Gatling Gears","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de4/de425f280bd6805100983e522664962f.jpg","description":"When the Empire begins its reign of destruction in a thirst for natural resources, it’s up to Max Brawley, a retired Gatling Gear pilot, to stop them. Together with his niece and his trusty Gatling Gear unit he must fight his way to the heart of the Empire and eliminate the destruction at its source.    This product supports the following languages: In-game speech: English; On-screen text: English.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Vanguard Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":28583,"name":"Kinect Star Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eef/eef3bedccc94516a1f2d5ad8f34c85d8.jpg","description":"The Games on Demand version supports English, French, Portuguese, and Spanish  This game requires a Kinect™ Sensor.  Step into Star Wars and experience a new galaxy of physical gameplay. Pilot a starfighter, race speeder bikes and even become the ultimate Jedi. Stomp, roar, grab and throw Stormtroopers as a powerful Rancor Monster, or speed past rivals to become a Podracing champion. Even dance for your life as you entertain Jabba the Hutt and other characters, and enjoy more adventures by yourself or with friends.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Terminal Reality","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":25256,"name":"Avatar: The Last Airbender - The Burning Earth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/808/80846bed4848a50e1ce8ae7ca43fc504.jpg","description":"Journey through 6 exotic locations filled with adventure to help Aang\nfulfill his destiny to master the bending arts and become the Avatar—for\nonly the Avatar can stop the ruthless might of the Fire Nation! Defeat\nhordes of bizarre enemies and perform noble deeds on your quest to save\nthe world.\n\nWho is the Blue Spirit? With the Fire Nation hot on his trail,\nAang races to save his friends. Who is this mysterious warrior who\nappears to Aang and is he a friend or foe?\n\nSiege of the North: Fend off Admiral Zhao's assault on the\nNorthern Water tribe by mastering the Arctic Waters. Aang must unleash\nthe power of the Avatar in this ultimate battle for survival!\n\nTrouble in Kyoshi Village: Can you defeat the Boar-coons with\nyour air blasts? Seek refuge in Kyoshi to escape the clutches of\nPrince Zuko, who is unrelenting in his quest to capture the Avatar.\n\nKing of Omashu's Challenge: Use your skills and smarts to\novercome the King's challenges, including duels with Hog-Monkeys, to\nmaster the Air Shield.\n\nThe Scar of the World: Fire and Earth Warriors of the Past\ncannot rest until the spirit of the land is healed. Journey into the\nSpirit World and learn how to stop the awesome fury of the Spirit\nGuardian!\n\nShowdown at Crescent lsle: Aang must overcome the perils of the\nvolcanic island to discover his true quest from Avatar Roku. But first\nAang must face off with Prince Zuko in a bending duel for the ages.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"THQ Australia","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Wii"}]},{"id":21963,"name":"Tanki X","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1a5/1a5f7680a2b5665e94e800546bc5cace.jpg","description":"Tanki X is a multiplayer tank-action game that proves that there’s more to tanks than just thick shells and firepower… Strap on your seatbelt because you’re in for some serious adrenaline!\nYou decide what your tank will look like and how it will behave in battle. Choose from 11 turrets, all with different ranges, firing rates, and unique features such as repair nanobots for healing allies, bullets that bounce off walls to reach hidden enemies, and lots more. There’s even a turret that sprays enemies with a blast of ice to slow them down to a crawl.\nMount your weapon of choice on one of seven hulls of different shapes and size, all of which feel and handle differently. Wasp is renowned for its high speed and nimbleness, which makes it great for jumping off platforms and spinning around your target. On the flipside, Mammoth is a veritable fortress that will take lots of firepower to bring down.\nCustomization doesn’t stop at choosing turret, hull and paint job. In fact, each hull features five slots where you can install “Modules”. These Modules give you active and passive abilities that allow you to customize your gameplay for specific roles. You’ll be able to turn invisible, drop Spider Mines that will track down and kill your enemies, and lots of other cool and deadly functions.\nThere are 3 game modes in Tanki X. In “Capture the Flag” and “Team Deathmatch” you will need to rely on teamwork, tactics and cunning to get the upper hand. Then there’s the classic Deathmatch, where it’s everyone against everybody else — always fun. There are also 9 maps offering different backdrops, layouts and tactical challenges.\nEarn crystals in battle to upgrade your equipment, remain competitive, and customize your tank further with aesthetic items such as paints, skins and colored projectiles.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"AlternativaPlatform","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":21487,"name":"Chainz 2: Relinked","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/33a/33ac5d3d8a5ea5a9cf4a44b5607c88e6.jpg","description":"It’s link-matching madness with Chainz 2: Relinked. Rotate the colored links to make matches of three or more in Classic Mode. Pit your link-matching skills against the clock in Arcade Mode. Ponder every precious move in Strategy Mode. Twist your brain and clear all the links in Puzzle Mode. Add in awesome sound effects, a zippy new music score, and sensationally updated visuals, and Chainz 2: Relinked is sure to keep you chained to your seat!\n4 Awesome Gameplay Modes\n200 Challenging Levels\nExciting New Power-Ups\nIndividualized Personal Profiles\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"MumboJumbo","platforms":[{"id":0,"name":"PC"}]},{"id":21100,"name":"This Book Is A Dungeon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b69/b698ceccb48d332daa04a0bd417e7b17.jpg","description":"Auto-cannibalism. Demonic Seduction. Occult Rituals. Bloodfeasting Worms. This Book Is A Dungeon has it all and more. This dark, horrific Twine-based dungeon crawler pairs edgy interactive fiction with grisly pixel art and light RPG elements. Prepare to be disturbed, titillated, and savaged by unholy denizens aplenty in your quest to navigate this sprawling narrative-driven labyrinth bristling with otherworldly doom.WARNING: THIS GAME WILL KILL YOU. OFTEN.\nPart of the intended challenge is in experimenting to see where different paths and choices lead you. It's impossible to experience all of the content in a single runthrough. Experiment, be bold, and uncover your fate, wherever it may lead!\nFeatures:\nExperience a grim story-driven horror adventure\nSolve cryptic and disturbing puzzles\nDie in dozens of horrible ways\nEnjoy light RPG elements, including combat and inventory\nDiscover multiple endings\nBONUS: 40,000 word game dev diary\nThis game is not for the squeamish or faint of heart.\nBONUS GAME DEV DIARY EBOOK\nThis Book Is A Dungeon was originally created as an interactive fiction and self-publishing experiment. It was initially launched as a game inside a Kindle book that served as a developer diary documenting the entire process for creating the game from start to finish. As part of the Steam Edition, you can access a free download link for a PDF version of the dev diary within the main menu.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nathan Meunier","platforms":[{"id":0,"name":"PC"}]},{"id":20932,"name":"Freshman Year","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/79f/79f9fc188b0b979e585b7344720205ea.jpg","description":"Freshman Year is a vignette game about an ordinary night in the life a college freshman named Nina. Nina's best friend Jenna invites her to meet up at a local bar with some classmates. Jenna is sort of flaky though, so Nina has to navigate the party by herself. You play as Nina, texting with her friend Jenna as you mingle, dance, drink and wait.\nPlease be aware that this game depicts scenarios that may be distressing to people who have experienced abuse.\nFreshman Year was developed by designer Nina Freeman, with art by Laura Knetzger and music by Stephen Lawrence Clark.\nThis game is autobiographical, based on the experience of designer Nina Freeman.\nPlease also check out the Steam page for \"how do you Do It?\", another autobiographical vignette game from a team including the designer of Freshman Year.\nhttp://store.steampowered.com/app/353360","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nina Freeman","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20812,"name":"Slam Bolt Scrappers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8cb/8cb9aa1420989adc9480d0e66bc1222b.jpg","description":"Steam Big Picture\nAbout the GameBuild and brawl in this fast and frantic mash-up!  Race your opponents to build the most powerful towers in Slam Bolt City while defending against deceptively adorable baddies and hugely epic bosses. Create weapons that shoot lasers, drills, missiles, and more to annihilate your adversary. Battle in four-player co-op campaign mode, or go head-to-head for more brawling and block-building awesomeness. This version includes 5 new levels as well as two new very cool unlockable characters (Bullseye from Monday Night Combat and Steve from Minecraft!)Slam Bolt Scrappers Features\nUp to 4-player local co-op and competitive modes 7 different level types with unique environments that hugely change how you play! Unlockable characters and outfits Full Big Picture support for awesome big screen action. Single player campaign complete with boss levels!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Fire Hose Games","platforms":[{"id":0,"name":"PC"}]},{"id":20718,"name":"MURI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e35/e35ccac43b4c35d7e9608a8e1054843e.jpg","description":"MURI is a DOS-style shooter from Remar Games and Ludosity.\nAfter the colonization of Mars, a team of scientists design an armor suit of cataclysmic power, sparking a conflict between several factions. When Mars suddenly vanishes, one woman sets out to discover the fate of humanity.\nInspired by the games of its time, MURI is an authentic '80s experience, with the focus often changing between run-and-gun action and more tactical combat.\nGame features\n* PC speaker music and sound\n* 16-color EGA graphics\n* Optional TURBO mode!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ludosity","platforms":[{"id":0,"name":"PC"}]},{"id":20408,"name":"Probably Archery","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/288/2884b07002ed857a654ea283276e3651.jpg","description":"Manipulate your wrists, elbows and shoulders to get the arrow to the bow, draw it, aim and fire!\nProbably Archery gives the player more control over the minutia of their joint movements with tons of crazy scenarios to conquer, multiplayer battles to fight and brutal target challenges to dominate.\nWith controls inspired by games like QWOP and Surgeon Simulator 2013, you must overcome a series of ridiculous challenges like shooting a hangman's rope, exterminating flying eggs in a china shop and stopping an apple-headed warrior in space.\nOnce you've mastered the way of the bow, test your skills in the online multiplayer modes. Team Deathmatch allows you to test your speed and skill against other players while the Horde mode lets you stand alongside your friends against waves of enemies.\nWhen it's time to lay down your bow, why not pick up a cricket bat and revolver? Shoot some zombies, bash other players and kick some goals in Zoccer - Zombie Soccer. An extra mode that is practically an additional game, Zoccer delivers a multiplayer first person sports shooter experience you've never seen before.Key Features:Crazy and intense single player scenarios\nTeam Deathmatch multiplayer\nCo-op wave-based Horde mode\nCharacter customisation\nGamepad support\nRazer Hydra support (currently Windows only)\nNative Oculus Rift support\n... and... Multiplayer Zombie Soccer\n\"... Archery Is Hard. But Also Pretty Funny.\" - Kotaku\n\"... right there, right... nope... down... F***!\" - Giant Bomb\n\"QWOP A Load Of This\" - Rock Paper Shotgun\n\"Probably Archery realistically simulates archery ...Probably\" - Destructoid\n\"... aim up... aim f***ing up, stupid!\" - Rage Quit\n\"Move over, William Tell and Robin Hood, there's a new legendary archer in town.\" - Joystiq\n\"... requires a bit of finger magic\" - Indie Games","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"South East Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19730,"name":"JDM Tuner Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/518/51833d61c7d620b4d396d962bc00c9cc.jpg","description":"The game is a 2D game of drag racing.\nThe game has an opportunity to upgrade your car to the full!\nYou can set the visual details to your car, putting a body kit or rear wing you improves the aerodynamics of your car, and the car's dynamics on the speed!\nOr you can upgrade engine of your car, and tune it to the max! Install the new head of the engine, sport exhaust, improved intake system for better airflow to the engine, set the forged pistons, Nitrous oxide, which will be very helpful to you, and of course the turbocharger with intercooler, for a significant increase in power!\nYou can upgrade your transmission's clutch to better shifting!\nUpgrade your tires for more grip! And install Drag Tires!\nSetup your Engine Rev Limiter and gearbox!\nAlso in the visual tuning section you can buy vinyls for your car!\nYou can paint the body and install Neon!\nThe game has a lot of different body kits! 5 different wings! a lot of different types of rims! And a lot of vinyls!\nDuring the race, you get a random opponent on the same car!\nTry to be a king of street wars!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"JDM4iK","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":19396,"name":"Maelstrom: The Battle for Earth Begins","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e3e/e3e4c2a980dc4944e0c292cc31dfc3d9.jpg","description":"In the space of fifty years, Earth changed from a planet on cusp of a challenging future to a world a breath away from lifelessness and plunged into an apocalyptic time of ecological disaster, global warfare and the meltdown of human civilization. This is the time of the Maelstrom. In this ravaged world, the planet's dwindling resources have divided what remains of mankind in two: the urban freedom fighting 'Remnants' and the technologically advanced 'Ascension'. Now they must wage war against a new threat, the invasion of a savage alien race, the Hai-Genti, and each other in a desperate struggle for supremacy and survival. Through the game's missions, take command from different viewpoints and employ faction-specific tactics and weaponry to achieve your objectives. Complete with the ability to terraform landscapes and transform units, Maelstrom provides gamers with the power to harness the forces of nature in the most frantic, destructive, action-packed RTS game yet.\nA stunning mix of action-packed RTS missions set in a totally destructible and immaculately realised environment.\nA devastated future Earth becomes the battleground as a divided human race fights for survival against alien invaders.\nThrough the game, players control each of the game's three factions - the Remnants, Ascension and the alien Hai-Genti - each with unique identities, strengths and tactics.\nModify the terrain and use the elements as a strategic weapon. Create valleys, carve out lakes, freeze water, melt ice, create tornadoes and even control the wind.\nCharacters grow experience and level up with new abilities as you progress through the game.\n","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"KDV Games","platforms":[{"id":0,"name":"PC"}]},{"id":17498,"name":"Marauder (2009)","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d0/9d0ce8b31f86920ecbd1419c6b602fc7.jpg","description":"Darkestville Castle Coming Soon\nQuest and Adventures\nhttp://store.steampowered.com/app/443360\nAbout the Game\n«Marauder» is a tactical strategy with RPG elements. The game is based on the book \"Marauder\" by Berkem al Atomi and brings you to an alternate history where anarchy and endless strife have become a rule. You will play as a marauder who is trying to survive and settle a comfortable life. At first you have nothing but a double-barreled gun and a handful of shells, but in time you will gather \"a family\", arm it, and learn to stay alive in this constant war of everything against everyone.\nGame script and character dialogues written by Berkem al Atomi himself.\nA full-blown RPG system to develop your squad members.\nA small Uralian town with various different locales for you to explore (ruins, forests, military bases, underground bunkers); flexible system of weapon customization and a great diversity of items for barter and survival equipment.\nPossibilities for tactical play and rich selection of combat situations – you will have to use stationary weapons, assault fortified buildings, operate at night, battle enemies indoors and outdoors and much more.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Apeiron","platforms":[{"id":0,"name":"PC"}]},{"id":16132,"name":"The Guest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ed6/ed62b3d8071242a9157db3645d5308c0.jpg","description":"Important note:\nThis game focuses on exploration and gradually builds tension to provide a deeper experience. The story takes place inside a house where there is an evil entity that will try to prevent you from getting out alive.\nThe Guest is a first-person psychological horror game.\nEnvironment\nImmerse yourself in this horror experience and feel firsthand the terror of being alone with an entity that is stalking you for being in the wrong place.\nThe game takes place in a simple and familiar environment that little by little will become your worst nightmare. Move around the house, without neglecting your back, it may be that something is stalking you.\nThe theme of the game\nThis game takes place in a small, apparently abandoned house, where our protagonist has had to take refuge from the terrible storm outside. What he doesn't know is that he has entered the wrong house.\nDeveloper Comment:\nThe supernatural entity in this game may not harm you physically, but they may harm your psychology. It is our recommendation for people who are afraid of the dark, have heart problems, and are afraid of being alone. Play with caution.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Team Gotham","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":9691,"name":"Shiny","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5b/d5baf52334fa2cab2fb31c9fb1edc866.jpg","description":"IGN: Best Brazilian Game at BGSIGN Brasil selected Shiny as the best Brazilian game at BGS 2016!\nhttp://br.ign.com/m/brasil-game-show/37509/feature/ign-brasil-seleciona-os-melhores-da-brasil-game-show-2016\nAbout the Game\nRobots can have a heart!\nLeft to fend for himself after mankind abandoned the doomed planet Aurora, robot Kramer 227 must find a way to harvest energy and rescue his robotic friends before Aurora crashes into its sun. In his journey, Kramer will probe the planet itself and overcome challenging obstacles, all while trying to conserve his limited life energy to power himself and his friends on their way to safety.\nKramer will gather and share energy with his fellow robots, helping them escape dire situations and predicaments. He will have to jump and explore every platform in every corner of the 20 extensive levels to find all of his friends. Energy is running low on Aurora, so Kramer will have to collect batteries or use generators to recharge, as every action drains his power. Various power-ups collected along the way, such as jetpacks, energy spheres and temperature regulators, can help him on this crucial journey.\nShiny is about saving lives, so it contains no blood or violence.Features\nEnjoy non-violent, platforming action\nExplore 20 extensive levels.\nManage your energy levels – the robots’ source of life!\nMake use of cool power-ups found along the way.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Garage 227","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":4281,"name":"Ratchet & Clank: Going Commando","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c03/c03965311ed72ba0629b84f4db45aebf.jpg","description":"Ratchet & Clank: Going Commando is the second installment in the Ratchet & Clank series developed by Insomniac Games and published by Sony Interactive Entertainment.\r\n\r\nThe game follows Ratchet and Clank, who after defeating Chairman Drek in the conclusion of the previous release, are recruited by MegaCorp's CEO, Abercrombie Fizzwidget, and taken to the Bogon Galaxy. While Clank is given an apartment on planet Endako, Ratchet is trained to work as a commando, tasked to locate a thief who has taken a biological experiment. The two later realize that the operation is not all as it seems, and must work to save the galaxy from the Protopet menace.\r\n\r\nWhile the core third person action adventure gameplay is similar to the previous entry, Going Commando features notably more role playing game elements, allowing players to upgrade both their nanotech (health) and weapons by defeating enemies, and given them more weapons and armor to purchase at vendors with collected bolts. There are also many more challenges, such as gladiator battles and hoverbike races, that they can participate in to earn bolts (or alternatively raritanium to upgrade their ship). Players are still required to complete objectives on planets to unlock new planets or to obtain gadgets required to complete other objectives and progress the story.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Insomniac Games","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":1044,"name":"Dub Dash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cd6/cd6803eaabf80a1a874cf88b1cca4836.jpeg","description":"ARE YOU READY FOR THE ULTIMATE CHALLENGE?\nUNIQUE SYMBIOSIS OF MUSIC AND GRAPHICS\nDub Dash is a fast-paced rhythm based action game. The tracks are decomposed into diverging game mode segments. The obstacles, tracks and visual effects are all adjusted to the music and in perfect harmony with each song. Dub Dash has a great soundtrack including music from Bossfight and the DJs of Geometry Dash – to enjoy the full experience the use of headphones is highly recommended.\nUP TO FOUR PLAYER SPLIT-SCREEN MODE\nChallenge your friends to the ultimate race in this breathtaking split-screen competitive mode for up to four players simultaneously. Who will beat most of the level? Jump in and find out!\nSEVEN ULTRA CHALLENGING GAMEPLAY MECHANICS\nSpin your crazy wheel in harmony with the song and keep dodging left and right avoiding obstacles at high speed. Fly like a bird, make hard 90° turns and feel the rhythm of the zig-zag trajectory. The objective for each track is clear: Do you rock the funky road of Dub Dash?\nGRAPHICAL FIREWORKS\nDub Dash offers impressive colorful graphics and effects with a steady and smooth high framerate. Immerse yourself in a hypnotizing psychedelic experience.\n\nSKILL COMES WITH PRACTICE\nThe gameplay of each segment is simple but it´s tough to master the levels. Actually it´s extremely hard, almost impossible – but fortunately there´s the practice mode which gives you a save point after each passage so you won´t need to finish the whole level in one try. Memorize each segment of the level and maybe (only maybe) you will be able to master even the hardest levels someday.\nFEATURES\nDriving electronic soundtrack\nPsychedelic graphical fireworks\n“Easy to learn, hard to master” gameplay\nAll levels split in multiple gameplay sections\nGameplay technically synched to the music in the minutest detail\nUse of all input devices (keyboard, gamepads, mouse – even racing wheels!)\nGreat soundtrack including tracks from Bossfight and DJs from Geometry Dash\nChallenge mode featuring randomly generated levels to earn extra lives\nMultiplayer mode for up to four players on split-screen\nPractice mode for every level\nSteam Controller support\nSteam AchievementsPHOTOSENSITIVE SEIZURE WARNING\nA very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Even people who have no history of seizures or epilepsy may have an undiagnosed condition that can cause these \"photosensitive epileptic seizures\" while watching video games.\nThese seizures may have a variety of symptoms, including lightheadedness, altered vision, eye or face twitching, jerking or shaking of arms or legs, disorientation, confusion, or momentary loss of awareness. Seizures may also cause loss of consciousness or convulsions that can lead to injury from falling down or striking nearby objects.\nImmediately stop playing and consult a doctor if you experience any of these symptoms. Parents should watch for or ask their children about the above symptoms - children and teenagers are more likely than adults to experience these seizures.\nThe risk of photosensitive epileptic seizures may be reduced by taking the following precautions:\n•\tPlay in a well-lit room\n•\tDo not play when you are drowsy or fatigued\nIf you or any of your relatives have a history of seizures or epilepsy, consult a doctor before playing.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Headup Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":961204,"name":"Helldivers II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbb/cbb9480547e9770383e3af1ab9dd3be3.jpg","description":"Freedom. Peace. Democracy.\nYour Super Earth-born rights. The key pillars of our civilization.\nOf our very existence.\nBut the war rages on. And everything is once again under threat.\nJoin the greatest military force the galaxy has ever seen and make this a safe and free place to live.\n\nYou will be assembled into squads of up to four Helldivers and assigned strategic missions.\nWatch each other’s back – friendly fire is an unfortunate certainty of war, but victory without teamwork is impossible.\n\nRain down freedom from above, sneak through enemy territory, or grit your teeth and charge head-first into the jaws of combat.\nHow you deliver liberty is your choice; you’ll have access to a wide array of explosive firepower, life-saving armor and battle-changing stratagems… the jewel in every Helldiver’s arsenal.\n\nSuper Earth recognises your hard work with valuable Requisition. Use it to access different rewards that benefit you, your squad, your destroyer ship and our overall war effort.\n\nEverything on every planet wants you dead. That’s what we’re dealing with.\nEach enemy has distinct and unpredictable characteristics, tactics, and behavior – but they all fight ferociously and without fear or morality.\n\nCapturing enemy planets, defending against invasions, and completing missions will contribute to our overall effort.\nThis war will be won or lost depending on the actions of everyone involved.\nWe stand together, or we fall apart.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Arrowhead Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":840866,"name":"A.V.A Global","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a86/a8600d984dce45bde4403a133c9be7c8.jpg","description":"To All A.V.A fans! We are aiming to open A.V.A on the Planned Release Date!\nWe are launching Ava on Steam at the request of many global fans!\nEnjoy the classic FPS game once again with redesigned features!Class systemEach class has unique advantages and disadvantages against other classes.\nPlayers are able to acquire skills to enhance the unique characteristics of the classes they choose.\nPointman\nSpecialized in close-range combat, Pointman is a fast and agile member of a team.\nPointman's main roles are reconnaissance and attacking enemies from their backs.\nThe Pointman is equipped with customizable Submachine Guns (SMG), Shotguns (SG), and unique gear.\nWhen your enemy needs a \"nice\" surprise, Pointman is there to deliver them a lethal present.\nRifleman\nEquipped with Assault Rifles (AR), bullet stopping armor, and throwable items, rifleman brings destruction to the enemy.\nRiflemans can respond to any types of situations on the battlefield by engaging and neutralizing the enemy.\nYour enemy team can run, but they can't hide from the Rifleman.\nSniper\nEquipped with a Sniper Rifle (SR), the Sniper is specialized in long distance combat.\nSnipers provide effective attack and defense of certain areas by taking down enemies and protecting teammates.\nBefore being destroyed, your enemy team won't even know they are being watched.Modes/MapsWith various types of modes and more than 14 maps, players can play their own unique mission on various battlefields with friends.\nModes\nAnnihilation - Based on the death match rule, players on two opposing teams need to reach a score within a limited time.\nDemolition - The NRF forces must survive and eliminate all EU forces or defuse the bomb. EU forces must successfully plant and detonate the bomb, or eliminate the enemy team to win a round.\nBreach - The NRF forces must damage the tank that is being escorted by firing RPGs. The EU forces must escort the tank to the goal. When the tank is damaged, it must be repaired to move on.Weapon AttachmentsThe weapon attachment system allows you to modify your own weapons. You can use the various weapons in different styles to suit your shooting needs. attachments parts include dot sight, scope, barrel, grip, ammo, grenade launcher, silencer, laser pointer etc.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"NEOWIZ","platforms":[{"id":0,"name":"PC"}]},{"id":502191,"name":"A Game of Thrones: The Board Game - Digital Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5b6/5b67d47234ad4f18d957de0f890cc0b1.jpg","description":"A Game of Thrones: The Board Game – Digital Edition is the digital adaptation of the top-selling strategy board game from Fantasy Flight Games. During the game, players spread their influence across Westeros through a combination of strategic planning, masterful diplomacy, and military might. As one of the Great Houses, will you conquer with force, forge alliances, rally your townsfolk, or cunningly coerce your way to the Iron Throne?\nBased on the best-selling A Song of Ice and Fire series of fantasy novels by George R.R. Martin, A Game of Thrones: The Board Game – Digital Edition  allows up to six players to play online, or a single player with up to five AI opponents to play locally. The game is set after the death of King Robert Baratheon and allows each player to assume the role of one of the Great Houses of the Seven Kingdoms in an attempt to assault King’s Landing and claim the Iron Throne.\nTo be declared ruler of the Seven Kingdoms, you have 10 rounds to use diplomacy and warfare to your advantage to control as many strategic areas of the map.\nConquer with care as your resources are scarce and your troops are not expendable.  Muster your army, plan your orders wisely and seize strategical lands with your Footmen, Knights, Siege Engine and ships.\nDuring the turmoil of a battle, use well-known characters from your house to take the upper hand and vanquish your enemies.\nA Game of Thrones: The Board Game – Digital Edition is a game of negotiation and deception.\nEach round, you secretly assign one order token to each of your armies: promise support, offer peace, forge alliances, betray a vulnerable ally - a House that dares set its eyes on the Iron Throne must turn many wheels within wheels to achieve its ends.\nMove up the three influence tracks by betting your hard-earned power tokens. Obtain the Iron Throne, the Messenger Raven and the Valyrian steel tokens, each granting you strategic and social gameplay advantages to hold sway over rival houses.\nHowever, keep an eye beyond the Wall as an army of barbaric wildlings gather to descend upon the continent! All houses must cooperate to gather enough power tokens to reinforce the Night’s Watch and fend off the wildlings, or the consequences could be devastating…","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Dire Wolf Digital","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":460519,"name":"Umurangi Generation","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/517/517c2bb1eaee637db6bb6654798a9f46.jpg","description":"Umurangi Generation is a first person photography game in the shitty future. Set in Tauranga Aotearoa off the back of an impending crisis you are a courier for the Tauranga Express. Along the way you take photos to make ends meet. Throughout the game you will unlock a variety of lenses and equipment.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"ORIGAME DIGITAL","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":56196,"name":"Second Sight","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b56/b56a2ff4e6479a3e484f4e686f6ee201.jpg","description":"Second Sight is a science fiction action-adventure stealth Single-player video game, developed by Free Radical Design, and published by Codemasters for GameCube, PlayStation 2, Xbox and Microsoft Windows. Players assume control of an American parapsychology researcher, who awakens in a medical facility with no memory of their past and powerful psychic abilities, and breaks out with these powers in order to uncover their past and their involvement in a mission they undertook with a specialist taskforce of the U.S. Marines. The game's action is divided between gun combat and stealth, with emphasise on players making use of different psychic abilities to survive against hostile opponents and overcoming obstacles and tricky puzzles.\nSince its release, the game's console entries have received mostly favourable reviews, while the PC version received mixed feedback.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Free Radical Design","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":52996,"name":"Gran Turismo 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/64d/64d9b8d00ea0da293f584077ad432aa9.jpg","description":"Gran Turismo 2 (グランツーリスモ2, Guran Tsūrisumo Tsū, commonly abbreviated GT2) is a racing game for the Sony PlayStation. Gran Turismo 2 was developed by Polyphony Digital and published by Sony Computer Entertainment in 1999. It is the sequel to Gran Turismo. It was well-received publicly and critically, shipping 1.71 million copies in Japan, 20,000 in Southeast Asia, 3.96 million in North America, and 3.68 million in Europe for a total of 9.37 million copies as of April 30, 2008, and eventually becoming a Sony Greatest Hits game. The title received an average of 93% in Metacritic's aggregate.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Polyphony Digital","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"Dreamcast"}]},{"id":51857,"name":"Fog Of War - Free Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f4/5f465a9b4210c331590bfb9016cfb2f4.jpg","description":"The action of the game Fog Of War takes place during the Second World War.\nEarly Sunday morning, June 22, 1941, Germany, with the support of its allies - Italy, Hungary, Romania, Finland and Slovakia - all of a sudden and without warning attacked the USSR and began the Great Patriotic War.\nYou can play the game alone or with your friends. Occupy strategic positions, move by feet or take transport. You may join existing groups or create your own, use any techniques  and teach them to your allies. Each character has unique set of weapons and  transportation, you can use any of them. But you need to benefit your team and your options will depend only on your personal performance. Now you know why you're here. Join any squad and show what you can do.\nDuring the game you can unlock anything that affects the process of the play. Varieties of items, will be available to purchase: jewelry, additional content or media content, or anything else. But opportunities to influence the gameplay will not.\nWhoever you choose to play with you will earn experience points. You can gain this points by increasing the level of your account,developing your skills and completing daily quests. Further, for the experience earned by your  character you can purchase any additional features.\nFog Of War is the first-person game.  Management is easy to learn for experienced players and beginners as well.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Monkeys Lab.","platforms":[{"id":0,"name":"PC"}]},{"id":42180,"name":"The Elder Scrolls V: Skyrim Legendary Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6db/6db2d022f77b1c99116bbf6750ec2c7d.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28380,"name":"The Gunstringer","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ca9/ca9280290c4777c6155c447258efbf02.jpg","description":"The Games on Demand version supports  English, French, Italian, German, Greek, Hungarian, Spanish, Potuguese, Russian, Japanese, Korean and Chinese. This game requires a Kinect™ Sensor.  Twisted Pixel Games, creators of The Maw, Splosion Man and  Comic Jumper, proudly present our latest original IP: The  Gunstringer! We're bringing you an all-new type of Kinect  game where you'll puppeteer an awesome skeleton cowboy  marionette with your hands. Brace yourself for an  action-packed production of gunplay on the vengeance trail!","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Twisted Pixel Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28225,"name":"Midway Arcade Origins","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/35b/35b0f9c04601a1b0b6678ec78e16d9e7.jpg","description":"The Games on Demand version supports English, French, Italian, German, Spanish.  Midway Arcade Origins delivers the ultimate arcade experience with more than 30 classic games from the arcade golden age.  Players can enjoy their favorite genre defining Midway titles now with local co-op multiplayer, achievements, and Leaderboard support.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Backbone Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]}]