[{"id":386511,"name":"Gordian Quest","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/eca/ecaf00756c6fa997c40495134cfff1b3.jpg","description":"A sinister curse corrupts the land. Darkness reigns. Monsters roam. Scoundrels loot. Cowards flee. Heroes emerge.\nLead heroes on an adventure to save what’s left of this fallen world and destroy the root of evil abound. Will you fall at the claws of your enemies or the consequences of your poor decisions? Your Gordian Quest is about to begin.\nGordian Quest is an epic roguelike adventure that combines the best elements of deckbuilding, tactical combat and strategic decision-making. You will form parties of heroes whom you will have to lead and manage on grueling missions. Help them forge bonds and discover new skills among them. Be fearless and unwavering as you work to unravel the curses laid upon the lands and defeat the ultimate evil at the heart of it all.\n*** Features ***\nForm parties of heroes with unique classes, skills, and playstyles (more heroes will be added as we expand on the game).\nBuild and refine your deck with hundreds of active and passive skill cards that will help you claim victory in strategic turn-based combats (more cards will be introduced as we keep upgrading the game)\nTrain, upgrade and equip your heroes with weaponry to meet the arduous challenges ahead. Enchant your equipment to give your heroes an edge during battles.\nExperiment with forging bonds among your heroes to see who become friends, lovers and foes. Discover special combo skills made possible only through such bonds (a WIP feature).\nEnjoy endless replayability with procedurally generated adventures. No one single adventure is the same.\nCollect powerful relics that can turn the tides of fate in your favor, or against it.\nTake on side quests and be presented with complex decisions that will shape the course of your adventure.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Mixed Realms Pte","platforms":[{"id":0,"name":"PC"}]},{"id":368994,"name":"Mega Man Zero/ZX Legacy Collection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1de/1deb93469588beea6c143dc7abfe1694.jpg","description":"Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.\n\nIn addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Capcom","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":45319,"name":"Empires Apart","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9d8/9d8cfbfd3ca5c786dd34d3b19b4d4710.jpg","description":"Join the Beta!\nAbout the GameEmpires Apart is a Real Time Strategy game set in medieval times.\nYou will lead one of six uniquely designed factions in outstanding procedurally generated maps. Each game is a totally different experience as you collect resources, assemble your army and wage war against your enemies.\nPlay as the Aztecs, Chinese, French, Mongols, Arabs or Byzantines and fight with up to 7 opponents in ranked matches and lobbies. Or chose skirmish mode against the AI to train your skills before you challenge your friends in multiplayer mode. Gather resources during the day and withstand hordes of enemies at night in Survival Mode.\nCollect Food, Wood, Gold and Stone. Build military and economic structures. Trade with allies, collect relics for powerful bonuses. Raise an army of spearmen, archers, knights and catapults. Choose your hero and lead your civilization to victory!\n\nIf you are a fan of RTS games, you will relive memories of classic games of the past while enjoying a modern interface and a brand new approach to fast-paced real time gameplay. If you are newer to genre, Empires Apart is the ultimate RTS experience you've been waiting for.Features\n- Play as Aztecs, Chinese, French, Mongols, Arabs or Byzantines, each with its own unique gameplay, two variants and two heroes.\n- Online battles and AI Skirmishes with up to 8 players.\n- Fight against hordes of AI enemies in Survival Mode.\n- Sharpen your skills in 6 unique challenges for each Civilization.\n- Procedurally generated maps with beautiful graphics and atmosphere.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"DESTINYbit","platforms":[{"id":0,"name":"PC"}]},{"id":44320,"name":"Next Up Hero Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e2/5e22f3aeea3ff182c3a4ad23a7329795.jpg","description":"So you think can slay all the monsters and win eternal glory, is that it? Bad news, hero. In the Spiral Shards, we can only send in one hero at a time to fight the Ceaseless Dirge. At some point, a flaming blue fireball, mech mortar rocket, or giant spike of doom is going to hit you in the face, and you’re going to die. That’s when the fun begins.\nWhen you die, you’ll leave behind an Echo of your hero on the battlefield. The next hero in line will be able to resurrect your Echo as an AI battle companion. Take turns continuing each other’s games, fighting and dying with friends until you have an entire army of Echoes by your side. Everyone dies. Heroes continue.\nNext Up Hero is a 2D action adventure driven by Community Continue. Next Up Hero is inspired by friends taking turns at the arcade to beat unfairly difficult games, and designed so beating a session is a shared victory and more fun than playing on your own.\nChoose from nine heroes with an assortment of weapons and abilities to suit your playstyle, from swords and rocket launchers to laser turrets, bongo drums, and boomerangs. Coming this fall, Heroes who complete feats of greatness will gain entry into the Champions Trials, a monthly contest in which Digital Continue throws the hardest monsters they have at you.\nDeveloped with community feedback, beginning with an exclusive closed beta at RTX this summer and moving to Steam Early Access in the fall, Digital Continue will incorporate community ideas to improve characters, gameplay, weapons, attacks, and enemy types for the final game.\nNext Up Hero is the first game from Digital Continue, founded by Joe Tringali, the co-founder of 5TH Cell, creators of Scribblenauts, Lock’s Quest and Drawn to Life.\nFeatures:\nExclusive Participation - By participating in this closed beta, you gain access to a 10 percent discount and four exclusive Rooster Teeth skins when the game launches into Early Access later this year!\nCommunity Continue - Engage in a cutting edge style of cooperative play, Community Continue, where beating community sessions is a shared achievement, and more fun than playing on your own.\nSpotlight Sessions and Leaderboards - Compete with the community in daily, weekly and monthly leaderboards! Play in sessions with your favorite streamers, or join celebrities in exclusive VIP sessions!\nCustomized Heroes - Defeat monsters and steal their abilities. Combine monster attacks, character skins, and Ancient abilities for thousands of deadly potential loadouts!\nSupported Gamepads:\nLogitech RumblePad™ 2\nLogitech™ Dual Action™\nMicrosoft® Xbox® 360 Controller for Windows® (Wired)\nMicrosoft® Xbox® One Controller (Wired)\nMicrosoft® Xbox® One Elite Controller\nPDP Rock Candy\nPDP Afterglow\nRazer Sabertooth\nSONY® PS4 DUALSHOCK®4 wireless controller (Wired)\nThurstmaster GPX","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Digital Continue","platforms":[{"id":0,"name":"PC"}]},{"id":43464,"name":"Warhammer 40,000: Legacy of Dorn - Herald of Oblivion","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/519/5198aa02d929600e0c03d9685e88c418.jpeg","description":"A vast choice-based digital gamebook set within the Warhammer 40,000 universe where you are a Space Marine!\nYou are a veteran Space Marine of the Imperial Fists Chapter. Equipped with powerful Terminator armour and armed with the deadliest weapons that the Adeptus Astartes wield, you are a symbol of the Emperor's might. Trapped aboard the space hulk Herald of Oblivion and the only survivor of your squad, you must fight your way through the aliens and heretics that infest the star vessel and find a way to escape the horror and return to your Chapter.\nHerald of Oblivion is adapted from the gamebook written by Jonathan Green and was originally published by Black Library/Games Workshop.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tin Man Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":38091,"name":"FIFA 08","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b2c/b2c5dd6f0d467ca2d04ad422a1d4c2fd.jpg","description":"FIFA Soccer 08 challenges players to master the skills required to play professional soccer. The FIFA Soccer 08 next-gen gameplay engine delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players are now aware of their surroundings, reacting authentically to threats and opportunities to make intelligent decisions. The FIFA Soccer 08 shooting system allows even more control and precision in front of the goal to become a true marksman. You can combine tricks and skill moves together to recreate signature moves from the real-world superstars or define your own style of play. You can even capture video of your best moves and goals in-game and upload to the FIFA 08 website to show off your style and celebrate your glory with friends across the globe. Brand new to FIFA Soccer '08 is a play mode called Be A Pro, which locks you in the role of a single player and challenges you to master the same disciplines as a real professional player, from positioning and tackling to reading the field and passing. Tired of playing alone? You've got the award-winning Interactive Leagues. Represent your club online against your rivals throughout the season in the F.A. Premier League, Bundesliga, French League or Mexican 1st Division. When they play, you play. Plus, create and organize your own multiplayer Friends Leagues and tournaments with all the tools in-game. FIFA Soccer 08 brings all the drama of pro soccer right to you, made even more real with the inclusion of 620 licensed teams, 30 official leagues, and more than 15,000 players! 620 licensed teams, 30 official leagues, and 15,000+ players Tournament Mode - Play 60 tournaments, including 35 licensed ones, or create your own ESRB Rated E for Everyone","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PSP"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":35590,"name":"White Day: A Labyrinth Named School","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0bb/0bbd54880ddae673c5cb00fe6f21e208.jpg","description":"Steel your nerves for a Korean horror without equal! Step into the shoes of student Hee-Min Lee and brave the terrors of Yeondu High School in a terrifying survival horror game filled with puzzles, secrets and - of course - deadly ghosts.SYNOPSISPrepare yourself for one of the most chilling games ever created!\nOn the eve of gift-giving holiday White Day, new Yeondu High School student Hee-Min Lee slips into school to hide a box of candies for the girl of his dreams. But when the school shutters slam shut, he finds himself trapped in the building overnight, hunted by a killer janitor and haunted by the troubled souls of the dead.\nPlaying as Hee-Min Lee, can you remain hidden, solve the clues and uncover the dark secrets of the building's past to survive the deadly threats? Or will the after-class horrors claim your life before you can escape? With no weapons to defend yourself there’s zero room for error in this tense, stealth-based scarefest brimming with secrets and multiple endings.FEATURESA Classic Horror For A New Generation: The notorious 2001 first-person Korean survival horror considered by original fans to be one of the scariest games ever made returns by popular demand. Completely rebuilt for modern gamers, and finally localized for a western audience, White Day: A Labyrinth Named School is a true videogame nasty\nSpine-Tingling Story: Trapped inside your school at night, you and your fellow classmates must carefully explore the twisting corridors by torchlight, hiding from possessed stalkers and running from evil spirits as you try to escape. With branching dialogue, collectable ghost stories hidden scares, White Day: A Labyrinth Named School demands to be played with headphones on and the lights off\nMultiple Endings: Your actions determine where the story goes! Shape your relationship with the other students trapped inside the school to save or sacrifice your friends on the way to unlocking the nine different endings\nMind-Bending Puzzles: Thanks to an environment filled with classically-styled survival horror puzzles, White Day tests your brain as much as your run button. Collect items, solve riddles and race against the clock to save your friends from certain doom and unpick the secrets of the school\nCheaters Never Prosper: This school’s wise to those who want to take shortcuts! Puzzle solutions change every time, so pack away all thoughts of skipping the scary bits with a guide\nInnovative Dynamic Scare System: Want to just absorb the story? Play on Very Easy to enjoy the adventure without the challenge. Eager to prove your bravery? Increase the difficulty setting to ramp up the scares and ghost activities, with hauntings ready to spring when you least expect it\nTraditional Survival Horror Mechanics: Resource-based save points and limited healing items guarantee an edge-of-your-seat thrill ride that takes no prisoners\nNew Features: As well as all-new visuals and audio effects, discover a brand-new character, scenario, reimagined ghosts and special endings created specifically for this remake","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Pqube","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":32007,"name":"Need for Speed 2","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/39c/39cc060da7c25da5571c80eb8a53447b.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":22331,"name":"Fluffy Creatures VS The World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f2/4f2e5517d78ff24f77228abc449fb52c.jpg","description":"Story\nThe player is put in the role of Fluffy McCuddleston, the member of a peaceful, intellectual race. One day, his world was invaded by the nefarious Dr. Sadisto who captured Fluffy and his partner Snuggly Von Purpleton for his evil purpose.\nHe strapped them with a timed explosive device which will kill them both if they do not harvest the very rare candy gold substance for him.\nIt is up to player to guide Fluffy trough the tasks of the evil Doctor, save his partner and turn the tables on Sadisto to ensure the peace of the Fluffyland.\nGameplay\nFluffy creatures is a simple platformer game with two game modes, Single player and Multi player (shared screen and keyboard.). In the Single player mode the player will take the role of Fluffy who will have to collect as many coins in the time limit of each stage to save him from his untimely demise. Each stage will feature a time limit which increases with every coin collected and various traps that will hinder Fluffy in his mission for survival. Try to reach the end of each stage within the time limit and escape from the hell Dr. Sadisto created.\nIn the coop Multi player mode, the other player will assume the role of Snuggly and join Fluffy in order to disrupt the evil plans of Dr Sadisto. Candy is rare and time is running out. Who will be the first to die, and who will manage to beat the level and secure passage to the next stage?! Find out in Fluffy Creatures Vs. The World!!!\nThis is a simple game and features 25 short stages which gradually increase in difficulty. Beat the game in order to gain all the achievements.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Amaterasu Software","platforms":[{"id":0,"name":"PC"}]},{"id":20817,"name":"Spectraball","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52a/52a88fb3dc1be0757bd1550bb171a0e1.jpg","description":"Spectraball combines elements of platforming, puzzle solving, addictive gameplay, and stunning visuals to deliver an experience that sets a new standard for the genre. In addition, Spectraball utilizes Steamworks, offering full support for achievements and stat tracking.\nRoll, jump, and launch your way through several diverse and detailed environments\nAddictive, fast-paced gameplay\nOnline leaderboards (see how you rank against players around the world!)\nAchievement system\nUnlock new abilities, maps, mini-games and skins\nEnjoy free content updates that include new maps, abilities, mini-games, zones and achievements\nEngage in some quick fun with a variety of mini-games\nXbox 360 and standard controller support\nIncluded Map Editor with online sharing (make your own maps and share them with friends!)","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Shorebound Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20666,"name":"Portal of Evil: Stolen Runes Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a71/a710dfa5ced719cc735841c989f2ec94.jpg","description":"The gates to another world will open soon! You can stop the impending disaster, but to do so at all costs to return the stolen stamps!\nVanessa is the only heiress of Abraham Van Helsinga, a member of the secret order of light guarding the peace of our world. And now it has to find a stolen the runes that were sealed the gate, behind which lurks an ancient evil.\nVanessa comes to Italy at the invitation of Archbishop Benedict, also comprised in the order of light. Using clues left by his grandfather, she can open the doors to other worlds and times where it will have to seek the powerful printing. In addition, Vanessa learns how to relate this story with her mysterious visions and the ghost of a mysterious a hunchback.Key features60 locations\n45 mini-games\n26 HOG scenes\n42 cinematics\nMore than 200 objects to use!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"8Floor","platforms":[{"id":0,"name":"PC"}]},{"id":18738,"name":"Fantasy Tales Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/717/7174068b9329e0ee3b209fff7d193dd7.jpg","description":"Fantasy Tales Online is a retro MMORPG where you must form parties, collect gear, fight through dungeons and defeat bosses. Featuring puzzles, a rich item system and complex encounter this isn’t your run-of-the-mill grindfest MMO title!Build Your Character\nPick who you want to become. Choose between thousand of customization options for your character.Raid Epic Dungeons\nRandomly generated dungeons featuring puzzles, bosses, traps... the works!Build Your Home\nJoin your local player town. Collect blocks and objects to place in your home. Band with friends and upgrade to a guild house as the base of your operations. Elect your town major and contribute to it success by defending it and going on the offensive.Explore a Massive World\nEnter a massive world filled with quests and secrets. Start in the town of Bluevale where you must prove yourself before working your way to the large dungeons. Find all the hidden treasures, fight through the Cauldron sewers and explore the southern desert.Unleash Your Powers\nStun, obliterate, vanish with your characters' unique abilities. Use them strategically to turn the battle in your favor.Unique Monsters\nFight unique creatures and take down epic bosses. Employ strategy and party up with your friends. You will be rewarded for your efforts.Free to play\nEnjoy the game without paying, and if you want to support the development team purchase something from our Cash Shop that does not supply any competitive advantage.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cold Tea Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17531,"name":"Kingdoms CCG","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/602/602de58ef2f6d5a31243587760931e80.jpg","description":"Choose your Kingdom, collect your spells, herald your forces and prepare your weapons. The war for Euna awaits!\nKingdoms CCG is a unique digital trading card game where you take the role of a hero for one of the six great kingdoms of Euna. Each Hero and Kingdom has a distinct play style creating a vibrant metagame. Decks consist of spells, creatures, gear and powerful Rune Words that shape the battlefield. Combat takes place through a strategic three-lane system with lane changing and defending available at all times. Battles are tight, tense and highly rewarding.\nKingdoms CCG has been designed to be fast to play, yet highly strategic. Play against other players in PVP arenas or live Tournaments, or the challenging AI in the single-player campaign and Guild Wars. Win prizes monthly on the Arena Ladder or battle through the ranks to reach the Epic Guild League. Glory is yours for the taking!\nEasy to Learn. Always a Challenge. Join the battle today!\nFeatures include:\n27 unique Heroes - each with 3 special abilities that charge over time and can be used to turn the tide of battle\n6 Kingdoms - each with strengths, weaknesses and unique abilities - your Kingdom matters!\nOver 900 cards - an amazing breadth of cards that allow for all types of decks - aggro, control and combo\nNon-Linear Mana Progression - Gain 2 mana per turn, and turn cards into more. You control your fate!\nRobust Guild System - Raise through the ranks to the challenge the Epic League, while gaining Honor to acquire special cards\nLive PVP Arena Ladders - Prove your are the best and win free packs and promo cards! A new ladder every month.\nChallenging Single Player Training Grounds - Unlock heroes, win cards, gems and coins - all free!\nCrafting - Turn extra cards into essence to craft new cards - even Epics!\nFREE TO PLAY\nJoin for free. Play for free. Pay if you choose.\nAs a Collectable Card Game this game includes randomized Booster Packs that expand your collection and deck building options. Of the 4 currently available sets, 3 can be purchased with Gold (in-game currency) and 1 require Gems (premium currency).\nGems can be acquired for free by completing daily Arena challenges, completing Hero achievements, completing the campaign and through high-level Guild play.\nSpecial booster packs with cards from all sets can also be won through Tournaments.\nFinally, all available heroes can be purchased with Gold.\nComplete the Advanced Tutorials found on the Campaign screen and receive 7 FREE Core Booster Packs!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ganz","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":15351,"name":"Swordbreaker The Game","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2ec/2ec1687f2456db6d6e2acc3fdc0cbd77.jpg","description":"Art DLCThis DLC contains 324 in-game scene + 9 ending scenes in full HD quality (1920x1080p), so you can set any of them as wallpaper for your PC Desktop.\nhttp://store.steampowered.com/app/446890/\nAbout the GameThrough the dense fog our hero noticed a dark silhouette of a dark castle. Eventually his old rain-soaked map brought him to his target. He didn't have anything with him except for his favorite sword and remainings of an old armor with an unusual device – a sword-breaker. The hero looked around and stepped on the castle bridge...\nThis game is about a hero who, as fate would have it, finds himself in an abandoned castle. There will be many obstacles on his way to the treasure hidden somewhere inside, with most remarkable adversaries he will have to face and mysteries to unravel. All this to receive his well-earned reward in the end!\n\"Swordbreaker The Game\" gives you a rare opportunity to find yourself in interactive fiction, where each player has their own storyline to develop. Every action or decision will have an effect on how the story unfolds and how it all ends. Some moves you make will change your character's karma, and others can lead you to the darkest corners of the castle, so be careful! Because any step you take may turn out to be the last one!\nMain features of the game:\n- A compelling totally non-linear game story\n- Various endings\n- A huge mysterious castle\n- Lots of exciting locations and events\n- Impressive enemies and inhabitants of the castle\n- Absolutely stunning artwork\n- Achievement system","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"DuCats Games Studio","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12180,"name":"12 Labours of Hercules V: Kids of Hellas (Platinum Edition)","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb7/cb792454f589ba16eaf89ff632cd5ad5.jpg","description":"Our new games!http://store.steampowered.com/app/545820/\nhttp://store.steampowered.com/app/567800/\nJoin our Steam group to learn more about our games, events and giveaways\nhttp://steamcommunity.com/groups/jetdogs\nTry other Hercules adventures:http://store.steampowered.com/app/342580\nhttp://store.steampowered.com/app/360640\nTry other Hercules adventures:http://store.steampowered.com/app/360650\nhttp://store.steampowered.com/app/396800/\nhttp://store.steampowered.com/app/567800/\nAbout the Game\nThe peaceful living of Hercules and Megara is interrupted by mighty god of war, Ares. He asks Hercules to help him conquer the world by leading the great army.\nAs soon as Hercules declines, Ares finds a way to avenge. By using enchanted toys, he zombifies the kids of Hellas so they will follow the god's commands and become his warriors!\nWith your help, Hercules must return the kids home, blow up the factory that produces the evil toys, and lead a strategic operation to destroy Ares' command transmitter in 12 Labours of Hercules V: Kids of Hellas!\n- Meet Codrus the woodcutter and giant golems\n- Included strategy guide reveals tips and tricks\n- Atmospheric wallpapers and 50+ levels of new adventure\n- An extra bonus episode with its own story\nP.S. For this game as usual we'll offer a bunch of adorable collection of collectible items - trading cards, backgrounds and amazing emoticons!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Jetdogs Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":11078,"name":"LEAVES - The Return","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/de1/de1048cadf728f8a6003e28c80474ef1.jpg","description":"\"LEAVES - The Return\" is an artistic exploration and puzzle-adventure filled with real sculptures in a surreal dreamscape. This sequel to \"LEAVES - The Journey\" is a stand-alone addition and playable without any knowledge of the first part.\nCollect and combine, solve a plethora of puzzles and mini games that will challenge your wit and skill.\nThe Stony Mountains are as welcoming as ever, if the Treefruities were not in trouble. Holding on to the leaves of their home tree once again proves to be more difficult than you would think when their home tree is rocked by a giant fit of sneezing and scatters the leaves all across the lands of Mononino.\nHelp the Treefruities to get their lost leaves back and look forward to this amazing journey. Explore the fantastic new landscapes added to Mononino where strange creatures and secrets are still waiting to be discovered.\n\nArtistic puzzle design in the tradition of games like Samorost, Machinarium und Rhem\nChallenging puzzles and unique mini games\nExplore four new vast worlds\nAtmospheric soundtrack by award winning composer Gary Marlowe and Daniel Hoffknecht","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ZAR 21","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10750,"name":"Premium Pool","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/798/79849d3140f4573cfcf256fc8367e10c.jpg","description":"Premium Pool is a smooth and enjoyable way to play billiards on your computer. Practice in single player against AI and then put your skills into use in a tournament or in a wide range of different custom locations online. You can also challenge your friends locally or online. In Premium Pool everything can be customized. Gather credits from your wins and change the cue, table, cloth and balls to your liking from a vast collection of beautifully designed equipment. Who wouldn’t want to play with a royally designed table on the beach? Or use one of the uniquely designed cues in a casino? Finally personalize your character by selecting one of the awesome theme characters in the game.\nKEY FEATURES\nOnline multiplayer\nLocal multiplayer\nSingle player\nChallenge your friends\n8 Ball\nTournament mode\nSuper smooth controls\nSpecially themed game rooms\nCustomize every equipment\nAwesome set of avatars\nChat with your competitor\nOption to fast forward; no need to wait all balls to settle down to continue playing\nAchievements and collectible cardsFuture updatesRegular content updates will be released for the game. In addition to new equipment and game locations there will be tournament mode, daily challenges and player ranking system. Also new game modes like 9 ball and snooker are in development.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Iceflake Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10679,"name":"Children of Zodiarcs","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a13/a13a1012070605eda4984cbc42083a3e.jpg","description":"Children of Zodiarcs is a story-driven, tactical RPG set in the fantasy realm of Lumus; a world divided by affluence and poverty. Take control of Nahmi and her fellow outcasts, utilising a brand new deck and dice based combat system to strike a blow to the noble Lords’ and Ladies’ unquenchable thirst for profit.\nStory\nProfessional thieves on the trail of an ancient relic, the group infiltrates the glittering halls of a corrupt noble’s private chambers in pursuit of their target, narrowly escaping the wrath of the city guards at every turn. Desperate to find an escape, they seek refuge in the city’s seamy slums and brave the sunless pits of the underworld. Out to get them are heavily armed city guards, rival gangs and psychotic families of subterranean cannibals. Abandoned by the system and used by selfish criminals, these young companions will be forced to come to terms with their own reality. But be warned - in the world of Children of Zodiarcs, no one escapes unscathed!\nKEY FEATURES:\nCombat Cards\nEach of your party members’ attacks & abilities are bound to combat cards. Drawing different cards during battle provides you with ever changing combat possibilities every time you fight!\nEmpower Cards through Dice\nOnce you’ve chosen your attack, physics based dice allow you to roll for bonuses! Favoring symbols over numbers, these dice deliver attack, defence, healing, and special ability modifiers.\nInfluencing Lady Luck\nTo add yet more layers of stratagem to Children of Zodiarcs, you can craft dice to favour your play style, and re-roll up to two dice every time you throw. You need not fear being at Lady Luck’s mercy!\nA World Full of Characters\nAlong the way you’ll come to learn about Nahmi - stolen from her homeland as a child, Brice - forced to survive on the mean streets of Torus; Zirchhoff - a charismatic bandit leader who employs young orphans to do his bidding: as well as many more mischief makers.\nBuilding Decks\nEach playable character comes with their own customisable deck. This allows you to tailor their skillset to the types of attacks and abilities you want to have in your hand during the heat of combat.\nA Fully Orchestrated Score\nChildren of Zodiarcs’ music captures the feel of tactical RPG classics with its fully orchestrated soundtrack composed by the award winning team at Vibe Avenue.\nJoin Nahmi and her team in a harrowing tale of the downtrodden’s struggle for survival in a world where mystical forces are overlooked; and the people in power are solely concerned with profit. Do you have what it takes to overthrow a corrupt system?","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":1619,"name":"Asdivine Hearts","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f6b/f6bbbb21b1fefae3523a8debd26996f6.jpg","description":"Restore the balance of light and shadow in the world!Beautiful hand-drawn visuals and a story of epic proportions bring Asdivine Hearts to the forefront of PC gaming! Travel alongside four companions and a cat in the adventure of a lifetime and one that transcends even the world in this fantasy 2D turn-based RPG!StoryOne year ago, the world of Asdivine was enveloped by a brilliant flash of light. Since that time, the influence of shadow has only continued to grow ever more powerful across the face of the land. And though the event itself was undoubtedly connected with the heavens, few people seem to have realized the far-reaching implications of what transpired.\nNow turning to the present, a surprising revelation awaits a young man by the name of Zack and his childhood friend, Stella, in the capital from a chubby cat claiming to be none other than the Light Deity and declaring the world to be on the verge of a great collapse.\nAlthough skeptical at first, this band of unlikely adventurers soon finds this chance encounter to be only the beginning of an adventure set to not only change their lives, but their fates, as well.Features\nGroundbreaking Visual Quality: The world of Asdivine has been rendered with stunning detail, from meandering clouds to lapping waves, sparkling magic to slithering creatures, and even dynamic skill effects.\nLimitless Customization: By taking puzzle piece-like jewels and setting them in a box known as a \"rubix,\" players are able to customize characters in ways like never before!\nLoads of Extra Content: The game features plenty of subquests, a battle arena, treasure to dig for, and an enemy guide to collect information for. How far can you level and how many millions of damage can you dish out? All these challenges await you and more!About KEMCOKEMCO is a video game publishing company specializing in handheld JRPG games. By focusing on immersive narratives and quality gameplay we strive to continually design gaming experiences both seasoned and new gamers alike can enjoy while advancing the genre to a whole new level.\nFind us on Facebook!\n*IMPORTANT NOTICE*\nThe game screen can rarely flicker depending on the device environment. If you notice any instability, please quit the game once and load the it from CONTINUE in the title screen.\nThis app features full controller support with the Xbox 360 Controller on Windows. Full controller support is not guaranteed on Mac OS X.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"KEMCO","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":1317,"name":"GHOST TRICK: Phantom Detective","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7fa/7fae1e3e5c0d7838c403f3f1168b860e.jpg","description":"Ghost Trick: Phantom Detective is a Adventure video game published by Capcom released on January 11th, 2011 for the DS.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"}]},{"id":686816,"name":"Endling - Extinction is Forever","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/367/36771189d7994afa1952276cd5e13ad0.jpg","description":"Will a mother fox manage to keep its little cubs alive?\n\nExperience a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure.\nDiscover the destructive force of the human race, like it, day after day corrupts, pollutes, and exploits the most precious and valuable resources of the natural environments.\nExplore various 3D side-scrolling areas and defend your tiny furballs, feed them, watch them grow up, notice their unique personalities and fears, and most importantly, help them to survive.\nUse the cover of night to stealthily guide your litter towards a safer place. Spend the day resting in an improvised shelter and plan your next movement carefully since it could be the last for you and your pups.\nFeatures:Explore devastated environments based on real current issues.\nHunt other animals to feed your cubs and avoid becoming the prey.\nPut your survival instinct to the test and get involved in emotionally taxing decisions.\nFind new shelters to be safe from natural and unnatural threats\nCare for your kits, feed them, and teach them new skills to make them less vulnerable.\nSurvive.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Handy Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":622518,"name":"Alfred Hitchcock – Vertigo","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/074/074e642bdfa4a6b774977a2222dfd4ea.jpg","description":"Ed Miller, a writer, came out unscathed from his car crash down into Brody Canyon, California.\nEven though no one was found inside the car wreckage, Ed insists that he was traveling with his wife and daughter. Traumatized by the event, he begins to suffer from severe vertigo. As he starts therapy, he will try to uncover what really happened on that tragic day.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"}]},{"id":484813,"name":"Gladiator Guild Manager: Prologue","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1f1/1f17656121869140c9964a165bb28b85.jpg","description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/1043260/Gladiator_Guild_Manager/\nAbout the GameGladiator Guild Manager is a game about building your guild, buying, developing and equipping units, figuring out tactics in different arenas against various opponents and becoming the most powerful gladiator guild in this epic fantasy world.\nFeatures: Each gladiator has Strengths, Weaknesses, Unique Behaviours, and Abilities.\nEach battle let's you choose a team of several units. Figure out best combinations that compliment each other as well as counter the enemy team.\nThe direction you choose to Build Your Own Guild will determine which warriors, beasts, or mages you can hire, as well as their perks.\nDynamic Market with new gladiators and items arriving every day. It's up to you to find the best deals.\nLevel them up, equip them with the finest items and make unique team combinations.\nCombine and Craft Items. Use items to make up for your fighters weaknesses or to boost their strengths even more.\nMeet all the challenges and conquer all the arenas in this epic fantasy world.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Entertainment Forge","platforms":[{"id":0,"name":"PC"}]},{"id":375281,"name":"Tangle Tower","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/43c/43c02ccc2d395e3827619e25af166221.jpg","description":"Unravel a thrilling mystery by exploring a strange and twisted mansion, discovering curious clues, interrogating peculiar suspects and solving unique puzzles.\nFreya Fellow has been murdered. The lead suspect? A shadowy figure found looming over her body, wielding a knife. The problem? That suspect... is just a painting.\nInvestigate the entirety of Tangle Tower, from the bizarre and eerie gardens, to the cold and ominous crime scene at the very top.\nWill you be able to uncover the secrets of Tangle Tower?\n• A fully voiced and animated cast of characters\n• Atmospheric original orchestral soundtrack\n• Beautiful digitally painted environments to explore","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"SFB Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":326988,"name":"Devolver Bootleg","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/033/033a15cbf5dfd1658471fa0c0e8f4ca6.jpg","description":"Devolver Bootleg contains eight original rip-offs of Devolver Digital games including:\nEnter The Gun Dungeon\nImagine a dungeon crawler but instead of swords it’s guns.  But also everything is made out of guns and bullets and stuff.  Like, everything.\nHotline Milwaukee\nBrutal, fast-paced, stealth action and a whole lot of blood.  From your garbage person apartment in historically interesting and relevant Milwaukee, pick up the phone, and answer the call--of murder.  Follow instructions and follow the stairs deeper and deeper into the mysterious basement.  Where does it go?  Who are you?\nApe Out Jr.\nEscape out of ape prison in this classic arcade-style platformer where you play as an orange gorilla who will kill everyone so he can to see his dad again.  Grab unsuspecting guards to use as weapons and shields in this completely original idea set to an interpretive chiptune jazz drummer soundtrack.  Please, Ape Out was my father’s name.\nShootyboots\nIt’s the never-ending story of a young boy falling down a well, wearing a giant boot as if it was overalls, which also is a gun.  Collect gems, squash and shoot the fauna, fall deeper into the infinite well, and wear some other equally large and ballistically designed shoes.\nSuper Absolver Mini: Turbo Fighting Championship\n(2 Players Only)\nA competitive fighting game where you play as your choice of one of four masked combat disciples.  You choose two special moves.  You fight two rounds.  The winner is absolved of the obligation to ever have to fight again, but probably will anyway because the one true resolve of the flesh is a fist colliding with it.\nCatsylvania\nIt’s a cat inside of a suit of armor. It’s a cat...In full plate armor.  What else do you want?\nPikuBiku Ball Stars\n(2 Players Only)\nEverybody’s favorite red thing with legs is back and ready to sink some baskets with a friend.  Nothing but net baby.  Slam freakin’ dunk.\nLuftrousers\nHello, I am Rami Ismail, ½ of Dutch independent game development studio, Vlambeer. We made a version of Luftrausers that had a typo, and JW left the thumbdrive containing the source at a coffee shop somewhere while I was doing a talk in Berlin, then Nairobi, then in Los Angeles the following day. If you find the thumbdrive, can you please return it and please PLEASE do not share the contents with anyone or add it to a compilation of pirated, under-the-table ripoffs of games that Devolver has published.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"doinksoft","platforms":[{"id":0,"name":"PC"}]},{"id":316824,"name":"MINERVA: Metastasis","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b4f/b4fcc9fe6aac972a2361c33b6faf56d1.jpg","description":"<strong>Pervasive. Literary. Brutal. Experimental.</strong><br/><br/>MINERVA, by Adam Foster, takes you to a remote island under the control of Combine forces. Something is going on here. Your goal is to uncover what that is and destroy it. Oh, yes-- and try to survive.<br/><br/><strong>This is the newly released 2013 edition of the famous Half Life 2: Episode One mod.</strong><h3>Special Thanks</h3>Minerva Soundtrack - Available Here<br/><br/>Translations by LocWorks","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Desconocido","platforms":[]},{"id":248481,"name":"Sparklite","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d1/7d17d7e55980764359b62b75e9e3b699.jpg","description":"Sparklite is a roguelite brawler-adventure. Using an arsenal of gadgets, guns, and gear, you will battle foes in top-down action combat, solve puzzles and explore dangerous corners of the world. Having crash-landed your first job will be to search for missing gyrocopter parts before you take on the task of saving the Sparklite.\nEverything in the world is tied together by Sparklite... it's the life force of the planet and the inhabitants have learned how to channel it for their own gain. It can be harnessed sustainably, which gives it low power that lasts forever, or it can be consumed immediately for a huge surge of power but then it is destroyed.\nThe \"Baron\" has devised a plot to mine the world’s Sparklite core. He mines Sparklite and burns it to fuel his powerful war machines. The resulting pollution is corrupting the world. Animals have turned into violent monsters and the environment is slowly rotting away. Thankfully the world has a natural defense - its Sparklite core. Periodically, the core causes a disruption which rearranges the layout of the world, setting back the Baron’s efforts. If the Baron can obtain the core, he’ll gain the power to create a new world where he has ultimate power.\nOur hero, Ada, must travel to each zone of the world to shut down the Sparklite digsites, lowering the Baron’s defenses so that she can stop him before it’s too late...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Playdigious","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"}]},{"id":60261,"name":"BAD DAY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdb/cdbdc56e5c1729fbdf9113682257749d.jpg","description":"*WARNING: BAD LANGUAGE*\nBad Day - an endless free to play runner with unique combination of 2D graphics and 3D environment. Compete with players from all around the world. But do not forget that the difficulty increases as you progress through.\n- Endless gameplay. Run and try to survive as long as you can.\n- Obstacles. The environment will distract you, and various obstacles will not let you get bored.\n- Simple controls. All you have to do is to run and jump. That simple.\n- Free to Play. Yes, this game is totally free.\n- Leaderboard. You can compete against players all over the world. The leaderboard will be updated in real time.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Black Lime Studio","platforms":[{"id":0,"name":"PC"}]},{"id":52293,"name":"Slayaway Camp: Butcher's Cut","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/55b/55bd7efdd9cef856e98d8a713162e7cb.jpeg","description":"A killer puzzle game where you control Skullface, a psychotic slasher\nhell-bent on revenge. Slide this adorably demented murderer around\nhundreds of isometric puzzle levels to squash, flay, and decapitate\nhapless victims in this darkly comic homage to 80s horror movies.\n\nExperience a new dimension of gut-churning terror as an unspeakable\nforce of skull-faced killing maims and murders his way through\nsmart-mouthed, over-sexed, substance-abusing young adults. No teenager\nis safe in the summer horror blockbuster smash hit of 1984.\n\nThis special console-only Butcher's Cut edition is the biggest and\nbloodiest version of Slayaway Camp EVER! More puzzles. More killers.\nMore gore.\n\nGAME FEATURES\n\n300+ Fiendish puzzle levels to massacre your way through\n\n60+ Killers to cause comical carnage with\n\n90+ Gorepacks with delightfully OTT kill scenes to shock and entertain\n\nIntense finger action! Play using touchscreen controls in handheld mode\n\nStarring Mark Meer (Cdr. Shepard from Mass Effect) as \"Skullface\" and\nDerek Mears (Jason from Friday the 13th) as \"Jessica\"\n","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PS Vita"}]},{"id":45561,"name":"Football Manager Touch 2018","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/637/63711abc0c9bf284aaee36a932f385ca.jpg","description":"With over 2500 clubs to choose from and over 190,000 real footballers and staff to sign, Touch packs the depth and power of Football Manager’s acclaimed data but focuses on the core managerial duties only – tactics and transfers. There’s no media circus around here, so you’ll find it much faster between games and complete seasons quicker.\nFor managers in even more of a hurry, Touch lets you simulate your matches with a single click of a button, leaving your backroom staff to guide the team in your absence. If you’re a football purist, you can watch your footballing vision unfold before your very eyes on our acclaimed 3D match engine.\nFans who pre-purchase Football Manager Touch 2018 will also enjoy access to a fully-playable Beta version of the game, meaning you can start ‘pre-season’ at least two weeks prior to the November 10th release date. Careers started in this Beta version will continue in the full game.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SEGA","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":34997,"name":"Neighbours from Hell 2: On Vacation","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae5/ae5fa481480c21abe85bf58f2c122d24.jpg","description":"The reality TV show of neighbourly nastiness and community commotion moves on to the next round.\r\nThe Neighbour from Hell wants to enjoy an undeserved holiday – reason enough for Woody and the camera team to sneak along onto the cruise liner to make the nasty neighbour's holiday a living hell. This time, the neighbour's mum has joined him, and she is taking good care of her baby.\r\nGet the Neighbour from Hell into his mum's and fellow travellers' bad books, play tricks on him and give free reign to your vengeance.\r\nKey Features Neighbours from Hell: Season 2 - On Vacation (full game version):\r\n- 14 new tricky and highly detailed episodes of anarchy of the popular \"NEIGHBOURS FROM HELL SHOW\"\r\n- 6 different locations in China, India, Mexico and on the cruise liner\r\n- More than 5 new characters and numerous animals\r\n- New cool soundtrack reflecting the countries our characters visit","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Handy Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":31298,"name":"Tropico","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d02/d0243a3d912bf86080e4dbb31f61c15e.jpg","description":"All hail El Presidente! The proud nation of Tropico is now in your hands and badly in need of modernisation!\nAs the freshly elected leader of an underdeveloped Caribbean island with untapped resources and enormous potential, hopes are high that you will deliver Tropico into the glorious future its people deserve. The opportunities are boundless in this humorous city-builder with a political twist.\nYOU RULE!\nDevelop and manage every aspect of Tropico, from its roads, buildings and people, to its military, trade and foreign policies.\nBE A VISIONARY LEADER\nTransform Tropico into the country you want it to be: a booming tourist paradise, an industrial powerhouse, a police state, or all three!\nPLAY POLITICS\nRecount elections, calm unruly elements, manage public opinion and reward your loyal followers…\nBUILT FOR iOS\nExercise complete control with an intuitive touch interface and gameplay mechanics designed and refined for mobile gaming.\nBUY ONCE, RULE FOREVER\nGet the keys to power with one simple payment and no in-app purchases.\nThis game requires iOS 12 and just under 3GB of space to install.\nSupported iPads:\n• iPad mini (5th generation, 2019)\n• iPad Air (3rd generation, 2019)\n• iPad (5th generation, 2017)\n• iPad (6th generation, 2018)\n• iPad Pro (1st generation: 9.7\", 12.9\")\n• iPad Pro (2nd generation: 10.5\", 12.9\")\n• iPad Pro (3rd generation: 11\", 12.9\")\nSupported iPhones:\n• iPhone SE\n• iPhone 6S/6S Plus\n• iPhone 7/7 Plus\n• iPhone 8/8 Plus\n• iPhone X\n• iPhone XS/XS Max\n• iPhone XR\nCopyright © 2019 Kalypso Media Group GmbH. Tropico is a registered trademark of Kalypso Media Group GmbH. All rights reserved. Developed for and published on iOS by Feral Interactive Ltd. Apple, the Apple logo and iOS are trademarks of Apple Inc., registered in the U.S. and other countries. Feral and the Feral logo are trademarks of Feral Interactive Ltd. All other logos, copyrights and trademarks are property of their respective owners. All rights reserved.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":29154,"name":"Infinite Undiscovery","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/15d/15d62f88f6f5633d9397ca943ec8e9f7.jpg","description":"The moon is bound by chains. The land rots. The light fades. The end is near. Tri-Ace presents an exciting new RPG for the Xbox 360!","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Tri-Ace","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":28269,"name":"Comic Jumper: The Adventures of Captain Smiley","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/601/601afa76b9596e3e800039719a4eae98.jpg","description":"Here we are, it’s impulse buy time.  You already know how awesome \"Comic Jumper\" is going to be from that sweet demo, but maybe you need more.  How about a free premium dashboard theme?  Free gamerpics?  Free avatar accessories?  Yes. Tons of unlockables and bonuses?  How about a few new \"Splosion Man\" levels for good measure?  \"Comic Jumper\" comes from Twisted Pixel Games, creators of the award-winning \"Splosion Man\" and \"The Maw\". There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Twisted Pixel Games","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":22470,"name":"Insaniquarium Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/933/933e6ff913dd507e6b79b01fc9f414d6.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"PopCap Games","platforms":[{"id":0,"name":"PC"}]},{"id":21657,"name":"Cherry Tree High I! My! Girls!","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52c/52c7dd3c10306290370d0d3efad64054.jpg","description":"STARTING A CLUB IS ONE THING... RUNNING A CLUB IS A WHOLE OTHER STORY!\nCherry Tree High I! My! Girls! is the sequel to the popular slice-of-life adventure game Cherry Tree High Comedy Club by developer 773, and picks up the story where Cherry Tree High Comedy Club left off, but this time as a kinetic (single story branch) visual novel and adds new areas, new music, and three new characters to the roster!OverviewNow that Mairu and friends have successfully re-opened the club, they actually need to act like a club! Mairu’s nemesis Chitose hasn’t given up on closing them down just yet, so they’ll need to be careful! But Chitose isn’t the only problem that Mairu and friends have to face... A rival club is competing for the spot of number one entertainment club, and a new transfer student will forever affect the Comedy Club line-up!\n*PLEASE NOTE* CTHIMG is definitely NOT the end of the Cherry Tree High story, and does leave a couple of major plot elements open for resolution in the next installment.New Characters:★ Ai Fujino ★Ai Fujino is the real-life and super-secret identity of the national pop idol ‘Ai Towano’. Her wonderful singing ability, dancing sense, and cute looks have made Ai Towano nationally famous, but the glitz and production of her performances conceal her true identity, and her true name and private life have remained well-guarded secrets.\nDespite her fame and adulation from fans, Ai aspires to be something more in life than a pop idol and, to fulfill that dream, she decides to transfer to Cherry Tree High School.★ Imari Kobayashi ★A third year student at Cherry Tree High School, Imari is the talented club president of the Classical Comedy Club. Under different circumstances, she and Mairu might have been the best of friends, but as head of the competing comedy club, they are now arch rivals.★ Utena Katakura ★A female teacher at Cherry Tree High School. Her poise and flair for drama have led to rumors that she once performed in a certain theater troupe.At any rate, she is a woman of irrepressible character and seems to be friends with the original Comedy Club founders then Grinmeisters, and also with Dina Delaney, manager of the Unity Dorm...Features: ★  The Cherry Tree High Comedy Club story continues in linear visual novel format!\n★ 12 chapters: 7 main chapters and 5 sub-stories\n★ 3 new characters\n★ New backgrounds\n★ New music\n★ 2-3 hours of gameplay★★★ Cherry Tree High I! My! Girls! ★★★\nLocalized & published by Nyu Media\nCreated by 773\nAbout Nyu Media, Ltd.\nNyu Media, Ltd. is the world's leading localizer and publisher of independent Japanese video games. By combining high quality localizations, broad distribution and accessible price points, Nyu Media enables global gamers to fully enjoy excellent indie titles as well as support the indie game development in Japan.\nFor more information about Nyu Media and other quality Japanese indie games, visit or follow us at:\nHomepage: http://www.nyu-media.com\nFacebook: http://www.facebook.com/NyuMediaLtd\nTwitter: @nyumedia\nAbout 773\nThe Japanese development studio 773 (pronounced “nanami” in Japanese) consists of just one full-time member who goes by the handle “Hizume” and several members who contribute to development projects purely as required. Hizume oversees all development projects and personally heads up game design, script writing, screen design, etc. To date, 773 has released the murder mystery Enfant Terrible, Cherry Tree High Comedy Club, its sequel Cherry Tree High I! My! Girls!, and the visual novel Dead End Junction. Their latest project is a fighting game which takes place in Cherry Tree High School.\nHomepage: http://atelier773.dojin.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"773","platforms":[{"id":0,"name":"PC"}]},{"id":19450,"name":"Freaking Meatbags","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/439/439a4abeca605e981999efb5c219f997.jpg","description":"Freaking Meatbags throws you into a futuristic world where robots have jobs, cephalopods aren't confined to a single dimension, and humans pretty much just stand around talking to themselves. As a lowly cleaning robot, your task is to gather precious materials from each world before the solar system goes kaboom. As soon as you land, you realize this gig isn't going to be as simple as you had hoped. During the day you'll scramble to gather resources, build structures and keep your base in good repair. But when it gets dark, get ready to fight. Those rampaging wild robots aren't here to have a knitting competition.\nAt least you're not alone in your daily chores. Fleshy, unintelligent and very unattractive human creatures live on these planets. You've discovered they're quite amenable to being told what to do, even if those tasks are as limited as carrying resources back and forth. Mix some DNA from a few different species, however, and you can breed humans with special powers. Like, say... laser beam eyes! A little mod here, a little hack there and they might turn out to be quite useful!Features\nFuse alien and human DNA: Create hybrids with special alien abilities by mixing DNA from two different meatbags. A human is useful, but a human with a laser eyes, and a new pair of arms is even more useful.\nBuild offensive and defensive structures: Hold back the wild robot hordes while simultaneously pummeling them with lasers, missiles, bolts of electricity and your very own personal attack drones. 15 unique structures to create and upgrade.\nEnhance your base with technology: Influence the battlefield and manage your base with nine different pieces of buildable technology. Need to heal yourself? There's tech for that. Want to build drones? Tech for that, too!\nMotivate your meatbags: The humans usually do what you ask. Unless they're tired or bored or just plain apathetic. Fortunately there's plenty of alien biotechnology you can implant to give them a little encouragement.\nRobotic enemies: Nobody knows where the wild robots come from, but they sure are well-armed. Eight unique enemy types that range from creepy crawly things to dashy explodey things.\nBoss robots: Three sinister bad guys to take out with your turrets. One of them has a giant brain. How do you figure it got in there?\nMultiple planets and environments to explore\nFour alien species to encounter, chat with and steal DNA from\nOne giant trans-dimensional space squid\nPhilae Update(February 2015)\nRevamped DNA system with hundreds of alien/human combinations.\nSeven new genes to get all splice-happy with.\nEquip meatbags with jetpacks, hoverboards and... ROCKET LAUNCHERS!\nStick humans in towers to power-up the buildings. Because of science.\nOverclocking ability lets you see the world in slow-mo.\nBrand new boss that jumps around a lot. Shhh, that's all we can say!\nHidden zombie planet. Go ahead, try to find it.\nOver 50 gameplay, sound and interface improvements.\nNew platforme: Mac & Linux.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wild Factor","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19190,"name":"Grim Legends 3: The Dark City","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/035/035dc635fcb6cbe397f71be2c9508f61.jpg","description":"PLAY THE CAPTIVATING THIRD INSTALLMENT OF GRIM LEGENDS!\nGrim Legends 3: The Dark City is a high-quality hidden object puzzle adventure game that focuses on mini games and puzzle solving in the creepy scenery of a gothic city.\nHUNT MONSTERS IN THE HAND PAINTED GOTHIC CITY!\nSylvia, the acolyte of the mysterious monster hunting Order, loses her memory. One year later, the Incarceri Stone – a powerful artifact that binds Koshmaar, a horrifying creature from another world – is stolen!\n36 CAPTIVATING HAND PAINTED LOCATIONS!\nSylvia and her master, Solomon, embark on an adventure that will lead them into the city of Lichtenheim, where they will face the thief whose identity will come as no less a shock than the actual disappearance of the artifact.\nTEST YOURSELF IN 36 MINI GAMES AND HIDDEN OBJECT SCENES!\nThe heroin and her mentor will need to put on their detective hats and face not only the evil forces within the gothic walls of the grim city, but also dark secrets from the past. Will Silvia succeed in recovering the Incarceri and prevent the Koshmaar from breaking free? Will she muster the courage to save Lichtenheim and its inhabitants?\nHELP THE ESTRANGED LOVERS IN A BONUS ADVENTURE FROM THE COLLECTOR’S EDITION!\nThe additional content contains an immersive bonus adventure that will pull you deeper into the game!\nBRING THE HIDDEN OBJECTS PUZZLES ADVENTURE WITH YOU!\nOptimized for phones and tablets, filled with hidden objects, perfect for playing while traveling. No Wi Fi required for this offline game!\nSIGN UP TO OUR NEWSLETTER FOR NEW ADVENTURE GAMES EVERY MONTH!\nCaptivating adventures, stories, tales, and eerie mysteries await in our selection of immersive hidden object puzzle games!\nFeaturesMaster the third installment of Grim Legends!\n36 atmospheric hand-painted locations!\nTest yourself in 36 mini-games and hidden object scenes!\nHelp the estranged lovers in bonus adventure!\nExamine and put together useful items!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17605,"name":"Helicopter Simulator 2014: Search and Rescue","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e4b/e4bee3ac2c6e607ad9dcb9e1611d06aa.jpg","description":"Become an emergency pilot and test your skills to their limits, as you sit in the cockpit of an emergency helicopter, across more than 40 challenging missions. Choose from 8 models of 'copter, each varying in size, ability and specs.\nFighting forest fires, communication failures, and conducting perilous search and rescue missions are just the start... you'll face many more natural disasters throughout your missions.\n2014 edition comes with brand new Sightseeing Mode Challenge, that will allow pilots to explore each island in search of beautiful, but sometimes hard to reach spots with ultra-light helicopter. And if that's not enough there are lots of achievements to unlock. Game engine was also upgraded with newer shader effects to achieve even more stunning visual quality.\nGame features:\n- 10 different helicopters\n- 45 various missions\n- over 400km2 of terrain\n- changing weather conditions\n- well-balanced flight controls\n- fully configurable controller support\n- sightseeing mode in free play\n- Steam achievements","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"PlayWay","platforms":[{"id":0,"name":"PC"}]},{"id":16941,"name":"Namariel Legends: Iron Lord Premium Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5bd/5bdf71807d40d63ba12a90ceabe27589.jpg","description":"Game’s action takes place in a magical land of Namariel, where magic and science joint together. The game is played from the first person; you will see the world through the eyes of king’s daughter, who was overthrown by the brutal Iron Lord.\nWe selected Steam Punk as a style of the game, which means that you will find many interesting puzzles, interactions with objects and mechanisms. The player will have to escape from the air prison, find the Great Prophet in magic forest, reveal the secret of the Iron Lord, sneak into his citadel and rid Namariel from cruel tyrant.\nWe tried to invent something new, for example there is “mind reading device” in the gameplay; by using this item you’ll be able to divine thoughts of characters, who are unable to communicate with you. Also you will have a robot assistant at your disposal, his name is Jim, he will help you in solving quests, and also, from time to time you’ll be able to switch controls of both main character and Jim to walk through levels with his assistance.\nLarge game world, many magnificent locations and lots of pleasant animation; by the way, animation is what we are especially proud of, because we are a small studio, but we really wanted to do our best in terms of quality, so that you would like it.\nIn spite of the linear gameplay, at the same time there is a freedom in choosing several quests to resolve, not connected among themselves, we don’t lead you by the hand, giving you rein to choose.\nDozens of brain-teasers, mini-games and innovative solutions, ranging from simple mini-games in two moves to advanced mode mini-games, where help of your assistant may be needed.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Shaman Games Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]