[{"id":5398,"name":"WipEout HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b9e/b9eb7adfc7c19618c507ab03694fc76f.jpg","description":"WipEout HD is a sci-fi arcade racing game developed by Sony Studio Liverpool. \n\n###Gameplay\nThe players use the futuristic anti-gravitational vehicles and participate in the FX350 anti-grav racing league. The game features all the previous tracks and vehicles from Wipeout Pure and Wipeout Pulse, which were released on the PlayStation Portable. \n\nWipEout HD is not a remastered game in a common meaning. It is more of a spiritual successor of the core mechanics that were introduced to the public in the previous installments of the series. \n\nFive modes are present in the game: a standard race, a Tournament mode, Time trials, Speed laps, and Zone Mode, where the players have to avoid crashing while their vehicle speeds up more and more. A photo mode is also available to the players. Photo mode is available at any point during gameplay, as it freezes the race the player participates in at the moment, allows to change camera position, and change exposure, lens focus or add depth of field.\n\nThe ships in the game feature four base stats: speed, acceleration, maneuverability, and shield strength. During gameplay, the players are able to pick up offensive or defensive weapons. Every weapon featured in the game was featured in the previous installment. For example, machine guns, missiles, landmines and so on.\n\n###Fury expansion pack\nFury expansion pack was released a year after the base game release. It featured eight tracks, 13 new vehicles, three game modes, and a new revamped campaign mode.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":16868,"name":"Tower Wars","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/eaa/eaa0e310b0e7697862713f397f82c555.jpg","description":"Tower Wars is a tower defense game. It includes an army building and attacking enemies’ tower. \n\n###Gameplay \nThe player can choose both single-player and multiplayer modes, but sometimes it can be difficult to find opponents and matching can take a long time. The player has to build his castle, starting with a new battlefield.\nYou aim to break into the enemy’s tower before he gets his army into yours. As for the building process, the player is free to place his tower anywhere he wants inside the map. It gives the user the possibility to create traps and corridors according to his taste. Here his enemies have to battle through barriers, so you need to make it as complicated as possible. The game offers various weapons, both classical (cannons, launchers) and unique ones (enormous fan, pushing opponents back).\nMoreover, there are two sorts of points: gold and battle. You can earn battle points while attacking the opponent’s tower. To get more gold points, you can use mines, which are already on your map. As for units, which you send to enemies’ castles, they can be primary and specialized. Although, it is possible to upgrade each one. \n\n###Style features \nThe graphic is crafted. The art style is also well-defined. It seems to be made with much attention. Despite the limited number of maps, they are detailed and comfortable for use. Moreover, the soundtrack is not as annoying as it can sometimes be.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":17450,"name":"Earth 2160","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/32e/32e0d330b10b68da3a3ee6d52eedf538.jpg","description":"After the destruction of the EARTH in 2150, the leaders of the Eurasian Dynasty escaped on board an evacuation fleet. Now they are fighting for the survival of the human species. Their base is one large building comprising of smaller variable parts. The Lunar Corporation is already on the Red Planet and has to fight to find a new base and home after the destruction of the Earth. LC buildings are built one on top of the other, similar to a skyscraper, but with one big difference - they have the ability to defy all the laws of gravity to move quickly to a new location.\nThe UCS (United Civilized States) machines evolved from the UCS battle machines. During the long flight to Mars, the computer decided to kill all human survivors and then initiated a plan to conquer the solar system with its own mechanical army. The Aliens - alien renegades were imprisoned a long ago, deep in the unknown history of Mars.\nIn 2160 the landing of the UCS ships awoke them from their long sleep...\nGAME FEATURES:\n4 playable parties with different basic technologies and abilities\nEach party consists of more than 13 basic buildings and more than 13 basic units\n4 single player campaigns, each with 7 missions\nSkirmish mode with 10 maps\n4 Multiplayer modes with 10 maps\nRealistic, formable and multi-textured terrain\n12 virtual agents with special abilities\nMultiplayer matches for up to 8 players per match\nEarthC (programming language) SDK for Mod teams\nRich musical score consists of 29 dynamically varyied tracks\nIncludes Superstorm, Platinum and Titanium Map Pack","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Reality Pump","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4903,"name":"DeathSpank","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5c3/5c3f7f973a94a73f2d504bf99ba47cbb.jpg","description":"DeathSpank: Orphans of Justice is a parody of fantasy RPGs, the first in DeathSpank trilogy. It features a comically cartoonish visual style and deconstructs the genre's cliches and stereotypes. The game's main designer is Ron Gilbert, best known as the creator of The Secret of Monkey Island and other LucasArts adventure games.\n\n###Plot\nThe titular DeathSpank is the game's main protagonist. He is a larger-than-life masked champion of goodness on a quest to save the world. His goal is to find The Artifact, an object so mysterious that nothing is known about it: neither its shape nor its purpose. Nevertheless, DeathSpank and his companion, the bearded and robed wizard named Sparkles, believe this McGuffin to be critical. And so does their antagonist, the evil Lord Von Prong, who also searches for The Artifact. DeathSpank is one step from finding the elusive Artifact, but it slips away at the last moment. To complete his quest, DeathSpank needs assistance from local people, who, in return, send him on multiple side quests.\n\n###Gameplay\nAccording to Ron Gilbert, DeathSpank is a cross between Monkey Island and Diablo series. The game combines elements from action-RPGs and visual adventures. The combat system is essentially the same as in Diablo. The protagonist can obtain and use various types of weapons and armor and perform comb movements. There's also the Justice Meter that grows when DeathSpank defeats the villains. When it reaches the maximum, it buffs DeathSpank with a temporary power-up.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":707254,"name":"Cave Story's Secret Santa","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d39/d3974392b686185e14165cb7a95f6519.jpg","description":"Be the Mimiga Who Saved Christmas\nIt's our holiday gift to you: Cave Story's Secret Santa, a new game you can download for a limited time and play for FREE! It's a bite-sized side story of stealth and puzzle solving, with familiar characters and settings from Studio Pixel's classic adventure.\nAfter Balrog recovers the Christmas presents that were stolen by Chaba, the cowardly Mimiga named Santa must sneak into every home and return the missing packages. As he tiptoes past the beds of sleeping residents and avoids being seen by patrolling Gaudi, Santa finds useful items, eats delicious cookies and places the gifts under the Christmas trees where they belong.\nSanta can push or pull obstacles, turn light switches on and off, pry open ventilator shafts and more. But he'll have to watch out for hazards and avoid making any noises that might attract attention. Get Cave Story's Secret Santa before it's gone!\n• Return gifts to 20 unique homes across three familiar zones\n• Find and consume delicious cookies\n• Discover hidden passageways and secret surprises\n• Earn 10 different achievements","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Nicalis","platforms":[{"id":0,"name":"PC"}]},{"id":50616,"name":"while True: learn()","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c7/1c770e4c68021d1d78b704045e6182eb.jpg","description":"Everyone is speaking about machine learning. Forbes writes that these developers and Data Scientists have incredible salaries, Elon Musk says that they can accidentally create an AI that can enslave humanity. So, what are these people really doing when they come to work? This game is a simulator of a machine learning specialist who uses visual programming to make his living. Learn what those guys are actually doing and realize if it is possible to create a big and scary evil AI by mistake (or not)?FeaturesWork as a freelancer or run a startup\nWrite systems using visual programming interface to complete clients' orders\nDeploy system to the cloud\nReuse system components in future\nScale the system when the amount of data gets huge\nMake money as a machine learning developer\nLearn how machine learning works","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Nival Interactive","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":19236,"name":"Majesty 2 Collection","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7f/c7fdd3f7d109c253002e670a5d18f6b4.jpg","description":"Just UpdatedNew content just added to Majesty 2 Collection:\n2 New Classes (Ice Mage, Assassin)\n6 Spells\n9 Abilities\n8 Missions\n6 Weapon Upgrades\n\nAbout the GameIn the world of Majesty, you are the ruler of the Kingdom. Your rule is not absolute, however, as you face subjects that are independent and stubborn. They will need a great deal of persuasion before they carry out your wishes...\nIncludes all Majesty 2 content:\nMajesty 2\nKingmaker expansion\nBattles of Ardania expansion\nMonster Kingdom expansion\nThe Kingmaker game editor enables players to create their own missions. Also included is every item, quest, unit and building previously only available for purchase using the in-game store. This additional content includes new spells, weapons, units, heroes, buildings, quests and more.\nMain Features:\t\t\t\t\t\tReal-time strategy with indirect control – your heroes have a will of their own\nBuild the ultimate fantasy kingdom and experience an engaging world, but beware: monsters are waiting to lay siege to your domain\nDefend your realm with noble warriors, spell-wielding wizards, or wild barbarians\nMultiplayer for up to 4 players over LAN\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"1C:InoCo","platforms":[{"id":0,"name":"PC"}]},{"id":15337,"name":"Heaven Island - VR MMO","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ccc/cccb4952af7d15d553cf4d70843c753e.jpg","description":"Heaven Island - VR MMO is an indie virtual reality massively multiplayer online game developed by Fabio Ferrara and Giulia Airoldi.\n\n###Gameplay\nDue to being an MMO, the game does not feature any plot.\n\nHeaven Island is an experimental indie project where the players can explore a vast island that is distant from any continent. This game was designed to be used for relaxation, a place where people could just admire the beauty of a distant place and forget any worries they have in their real lives. The main focus of the developers is the well-being of the player, as they state. It was meant to be a safe harbor from any chores, stresses and other aspects of a usual day to day life.\n\nThere are no objectives whatsoever present in the game. The players are free to explore the island in a way they see fit. It is possible to collect shelves or fruit, but it is not forced upon the players by the game. The game features 12 achievements based on the finding the shelves and fruit mentioned above. \n\nDuring the gameplay, the players can find each other in an in-game world if they create a special \"Connection\" (or adding themselves to a Steam friend list). There is no player-to-player interaction apart from that. The players can't see each other models. Instead, a special pre-defined \"essence\" model is used to show other players in your online session.\n\nIt is possible to play the game without a VR headset, though it is recommended to be played as a VR title.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Fabio Ferrara","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":308098,"name":"Embr","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cff/cffcad5a37be70da700023800b1502bc.jpg","description":"Do you feel the fire in you? Want to break free from the 9-5? Are you between the ages of 18-85? Then get fired up for the chance of a lifetime! Join the emergency services revolution and become an Embr Respondr™ today!\nEmbr is a frantic fire-fighting (un)Simulator set in a hyper-capitalist, deregulated alt-present where public firefighting funding has run dry, where venture capitalism and e-hailing rule the roost. The Embr Respondr is the last stand in a world ablaze.\nExpect cross-platform co-op multiplayer for up to four players, supporting player-hosted servers.\nJoin the Early Access community and help shape the future of Embr as a valued partner*\nBreak down doors, fix electrical circuits, clear gas leaks, do whatever it takes to get through the burning building. Remember, Embr Respondrs, if you die you don’t get paid!\nSolo or Online Co-Op: As a Respondr™ you can answer the call alone or with up to 4 friends to save your clients, their portraits, and loose change around the house.\nUse the cash you make or take to lease better equipment and vehicles from Embr. Tackle the biggest jobs for the biggest payouts!\nSave lives and treasured possessions to get that high review score. Be somebody’s hero today!\n(*in name only, no actual business partnership is implied by this statement)","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Muse Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"}]},{"id":29225,"name":"Staxel","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/747/74721edfb9995d8748b46cec37115e52.jpg","description":"Staxel is getting ready for steamGet notified when Staxel comes out on Steam by clicking the Add to your wishlist button above\nAbout the GameStaxel is a sandbox farming game that is currently in development. Tend to your farm and work on the village by yourself, or enlist the aid of your friends via online multiplayer to turn it into a thriving farmstead!\nExperience Village Life\nAs the village’s newest resident there's a lot to look forward to. The village is filled with all sorts of colourful characters to meet and befriend. Sure, they might have some favours to ask of you, but helping them out might bring unexpected rewards! When you’re not hanging out with the villagers or working on the farm, you could be pursuing a new hobby, completing one of many collections, spending your hard earned money in the local stores, or working on improvements to the village. Your new neighbors would certainly appreciate your help!\nNurture Your Farm\nPut down your roots and settle into your life as the village’s new farmer. Starting out with an old, run-down home and farmland reclaimed by the wilderness, it’s up to you to turn this place around. Plant seeds, carefully tend to your crops, take care of your animals, and build improvements to your farm. Don’t forget‐if you look after your farm it will look after you!\nCustomise Your Sandbox\nStaxel is set in a voxel-based sandbox world. You can alter your surroundings in any way you like, and with a rich selection of in-game materials and a simple, easy-to-use approach to modding, you really can create your own unique world within the game. Will you grow the village while keeping its rustic charm, or take it in an entirely new direction? Perhaps you’d rather leave the village and focus on your own projects? It’s all up to you, and your creativity is just the tool for the job!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Plukit","platforms":[{"id":0,"name":"PC"}]},{"id":22965,"name":"BlazBlue Calamity Trigger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f90/f9001fe059434783652e70939d6f74cc.jpg","description":"The first hi-res 2D fighter from the creators of the Guilty Gear series! BlazBlue is a traditional 2D fighter where two characters participate in a duel. The story of the game involves dissent and destruction among a powerful council, known unofficially as \"the Library,\" which controls a great power that once saved humanity, but which now wields its power in protective, some say repressive, ways.\nA round is called a \"rebel\" and one match can consist of one to five \"rebels\". To win a round, one player must either incapacitate the other by inflicting damage through various attacks to reduce their opponent's health to zero or by having more remaining health than their opponent after the clock runs out. Every character has a weak, medium and strong attack. Also every ones has a \"unique\" technique, called a Drive attack, which is different for each character.\nKey Features\n12 unique batants to choose from! - Choose a character that represents your own fighting style like the lightning-fast Taokaka or the wickedly powerful Tager.\nDrive your way to victory! - Use the unique Drive Attacks specific to each character to decimate your opponent. Depending on the character control the elements like wind and ice or even absorb the life force from your opponents.\nExperience the beauty of high-resolution hand-drawn sprites on 3D backgrounds all in glorious high-definition.\nVarious modes - Arcade, Versus, Score Attack, Training, Gallery and a pletely fleshed-out Story Mode that tells the tales of each character.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Arc System Works","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":8318,"name":"Spacecom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/724/7245c2892abf31759e3b01ae583516a8.jpeg","description":"Game DemoNot sure if you'll like the game? Download our DEMO and try our Single Player campaign and our challenging Multiplayer mode!\nGet the Steam DEMO now!\nAbout the GameSPACECOM – a strategic-to-the-bone, starfleet command game in which deception, smart movement, and choices to battle decide victory or defeat.\nNo coincidence, no luck. Spacecom pushes your ability to strategize with a focus on real-time tactics and planning. Use proven maneuvers learned from military legends or devise your own plans.\nTest your wits in single player campaign, go head-to-head with up to 5 opponents in multiplayer or experiment with new strategies in AI skirmish mode. Most of all, you'll need a bright mind, cunning, and sound tactics.\nWhen the war begins, leave the little things behind and dive into austere soundscapes as you immerse yourself in starfleet command. From now on, what matters is your grasp of tactics and strategy, not how fast you can click. Spacecom is about creativity in planning, not complexity of game mechanics.Key Features\nSingle player campaign that will test your wit in diverse tactical puzzles\nTense multiplayer - dominate up to 5 players per map\nNo coincidence, no luck. What matters is good planning and successful execution\nSound designed specifically to trigger strategic thinking\nMinimalistic visual design inspired by military technology\nCreated to exalt smart thinking over fast clickingPreviews\n\"In a market currently dominated by MOBAs, SPACECOM is set to offer a more nich perspective on strategy. Focused on concise combat roles and managing supply routes, it's all about using limited resources, to outwit your friends.\" - GameTrailers.com\n\"What really strikes me is that all of this is presented in an incredibly minimalistic style.(...) There is none of the distraction of flashy visual effects or incredibly renderedenvironments, this is pure strategy.(...) For me, an advocate of game mechanics above all else, this is as close to pure space strategy as I’ve seen and I’m really looking forward to the finished product.\" - gaminglives.com\n\"Spacecom is an interesting idea, as a quick-play strategy game. In a genre that tends to frighten off newcomers, Spacecom is poised to be the title that welcomes them in with open arms, avoiding complexity while still offering that classic 4X feeling. \" - Criticallysane.com","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":38559,"name":"GTR Evolution","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/225/225cc5468f3c2ff3789713fbbf7c68c9.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"SimBin Studios","platforms":[{"id":0,"name":"PC"}]},{"id":670693,"name":"Submerged","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/442/442204ac4ad76d50a6883832f74b37d8.jpg","description":"Boat, climb, solve and explore in the beautiful ruins of a sunken world.\nA drowned city, crumbling tips of skyscrapers stubbornly standing above the waves. Deserted villages, now inhabited by enigmatic creatures. And beneath the surging ocean waits an anguished, angry presence.\nSubmerged: Hidden Depths is a non-combat third-person “relaxploration” adventure, set in the sunken ruins of a beautiful world. Take on the role of Miku and Taku – one cursed with a mysterious power that she wants to use for good, the other determined not to let it tear them apart.\nFeaturesBoat across tranquil waters and storm-driven white-capsExplore, climb and interact with the remains of a once-towering cityCollect mysterious relics of a distant past Scour the buildings for the seeds of its salvation.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Uppercut Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":647611,"name":"Lawn Mowing Simulator","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/643/643a3dd6aba644d35f2c6476ce10ef60.jpg","description":"Join Our Discord Community!\r\nAbout the GameExperience the beauty and detail of mowing the Great British countryside in Lawn Mowing Simulator, the only simulator that allows you to ride an authentic and expansive roster of real-world licensed lawn mowers from prestigious manufacturers; Toro, SCAG and STIGA as you manage your mowing business.\r\nPHYSICALLY AUTHENTIC LAWN MOWING EXPERIENCE\r\nExecute ground checks, set your blade height, and measure your engine load as you complete a variety of contracts across Career Mode, Free Mode or Challenge Mode. Take your mowing further with several attachments from stripe rollers, mulching kits, grass collectors, recyclers, flail decks and more.BEAUTIFUL RURAL BRITISH COUNTRYSIDE\r\nLawn Mowing Simulator is set in a beautiful British countryside town. Busy residential streets, vast castle grounds, quaint cottage greens, and large equestrian fields are just some of the locations that await your mowing blades.REAL WORLD LICENSED MOWER MANUFACTURERS\r\nToro, SCAG and STIGA front line Lawn Mowing Simulator with their real-world machines painstakingly re-created visually and physically. 12 Mowers are available in the base game, each with their own challenges, attachments and upgrades to pursue.ACCURATE AND ATTENTIVE BUSINESS MANAGEMENT\r\nBuild your own lawncare business from the ground up. Purchase and upgrade your headquarters, hire employees, purchase advertising and balance the books as you grow and expand your business.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Giant Fish","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":59350,"name":"Dying Light: Bad Blood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/92d/92d0afe47942bd1d31ebed3fc9387e52.jpg","description":"Dying Light: Bad Blood Founder's Pack (available September 2018)\nThe Founder’s Pack includes:\nDying Light: Bad Blood (game)\nExclusive Golden Founder’s Mask\n3 exclusive Legendary weapon skins: Golden Neckslicer (dagger), Golden Bonecleaver (machete), and Golden Skullopener (cricket bat).\n1000 Blood bucks, the in-game currency spendable in the game’s store\nBonus: 3 exclusive Legendary skins distributed over 3 months\nAbout the Game\n\nGet competitive and get the blood on your hands in the all-new brutal royale experience.\nEnter a zombie-infested area and compete as one of 12 players to become the only survivor. Scavenge for weapons, destroy zombie hives to level up, and combine your advanced parkour mobility with brutal combat skills to outrun, outsmart, and outplay your opponents.\nIt’s all in, one out in Dying Light: Bad Blood - a fast-paced and gory online game that creatively blends PvP and PvE combat while retaining the core of Dying Light’s iconic gameplay.\nKill the zombies and destroy their hives to collect blood samples and level up your character. Prey on other players, steal their loot, and become the only one to leave the zone alive.\nWhether you run for your life, chase another player or race to the evac chopper, it’s your parkour skills that give you an edge over the enemies\nImmerse yourself in the blood-soaked FPP combat known from the highly-acclaimed Dying Light, now with greater tactical depth, new moves, and tons of vicious weapons.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Techland","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":28539,"name":"Peggle","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea8/ea82ea0e91daeafd6b98d22166c0913b.jpg","description":"Experience the ball-bouncing, peg-busting phenomenon! Do you have what it takes to become a Peggle™ Master? Take your best shot! Conquer 55 levels with 10 mystical Magic Powers and rack up bonus points. Face off against friends in 4-player Xbox LIVE® multiplayer play, and test your skills in 75 Grand Master Challenges. This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"PopCap Games","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":9385,"name":"Mechanic Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/add/addd52cae3fff5142cfa8e26a4cdda41.jpeg","description":"Mechanic Escape is a platformer runner game focused on chases — the player has a giant robot chasing him at every level. This is the only title developed by Slak Games. \n\n###Gameplay\nThe player controls a robot which looks like an old CRT monitor through 80 levels. There are collectibles on the levels — the protagonist can accumulate little CRT monitors to earn the bonus points for the levels and compete with friends and online challengers. The primary goal of every level is to escape giant machine heading toward you using all means necessary — one can jump, slide down, and shoot himself out of cannons on the levels.\nThere are four characters with various skins all representing monitors with different stages of thickness. The distinctions are only cosmetics — they bear no impact on the in-game process.  There are no checkpoints in the levels, so the title is widely considered as Super Meat Boy successor when it comes to difficulty settings. \n\n###Plot\nNamely, the title feature no story whatsoever — the entry cutscene is shown to the players at the beginning and at the ending of the game telling a story of an unnamed robot trying to save his friends. As one proceeds through levels, he may discover the other three robots which he was entitled to save alongside with little NPC CRT monitors. The game ends the same after 80 levels regardless of the monitors collected.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Playdigious","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":1071,"name":"Job Simulator","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d0/7d0b7fd7c71c591ca16c7502fec2dc1a.jpg","description":"A tongue-in-cheek virtual reality experience for HTC Vive. In a world where robots have replaced all human jobs, step into the \"Job Simulator\" to learn what it was like 'to job'.Key Features!Throw a stapler at your boss!\nLearn to 'job' in four not-so historically accurate representations of work life before society was automated by robots!\nUse your hands to stack, manipulate, throw, and smash physics objects in an inexplicably satisfying way!\nAggressively chug coffee and eat questionable food from the trash!\nUse the confluence of decades of VR research to accurately track your every movement to sub-millimeter precision so that you eat VR donuts, of course!\nAble to juggle tomatoes in real life? Do it in VR! Unable to juggle? There's no cleanup required in VR!\nGain valuable life experience by firing new employees, serving slushy treats, brewing English tea, and ripping apart car engines!\nHave a comfortable VR experience where vomiting is solely a gameplay mechanic, not a side-effect!\nA VR-Only game!\nCommunicate with the Owlchemy team over Twitter at @OwlchemyLabs","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Owlchemy Labs","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":367183,"name":"Cyber Hook","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4b/f4bbf37efa563ed46791742b4682242c.jpg","description":"Cyber Hook has players using parkour skills and a grappling hook to scale and ride walls, while fighting enemies and blasting blocks with a finger laser gun. Hurdle forward in a vibrant retrowave environment to test parkour abilities, but be careful, because one missed jump can mean life or death.Features :\nIntense Parkour Action – Fast-paced 3D parkour gameplay that plunges players at 150 km/h through a bevy of platforming challenges. Scale and ride walls, but be careful to time jumps correctly or you’ll plunge to your death.\nTools At Your Disposal – Use a grappling hook to fly through levels by hooking yourself onto blocks, while blasting foes and blocks with a laser finger gun.\nAlter The Game – Warp time to save yourself from falling and discover new movement options to make it past challenges. In Cyber Hook, you can forge your own path by abusing physics and breaking the level design.\nLevels Galore – 70+ levels at launch to test your parkour skills.\nWorldwide Leaderboards – Compete with other players using the region or worldwide leaderboard and watch others play in-game to determine the best strategies to make it through levels.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Graffiti_Games","platforms":[{"id":0,"name":"PC"}]},{"id":19382,"name":"GUN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ec1/ec132c684b3d57dbf1a86641b5a69f6b.jpg","description":"When life robs Colton White of all that matters, the only thing left he can trust is his GUN. From award-winning developer, Neversoft, and accomplished screenwriter, Randall Jahnson (The Mask of Zorro, The Doors), GUN follows Colton on his quest for discovery as he seeks to exact vengeful justice on those who have wronged him. GUN is a realistic epic action/adventure that lets gamers experience the brutality of the lawless West.\nNew and savage ways to punish: Stealthily sneak up and attack your enemies, use them as cover, stab and shoot them. Blast away and watch the aftermath, shoot guns out of enemy hands, or destroy with dynamite.\nExtensive variety of missions and game play: Wage war on horseback, commandeer trains, protect prostitutes, collect bounties, play poker, hunt buffalo, and more. Multiple game play styles include: precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions that allow you to master gun slinging and horse riding. Unlock secret weapons and upgrade your skills and abilities to improve your weapon and equipment performance.\nBrutal realism: Act as a gunslinger protecting righteousness, or seek retribution as you face corrupt lawmen, warring tribes, cold-blooded outlaws, and ruthless renegades. Encounter legendary gunfighters such as JJ Webb. Employ a multitude of authentic weapons including: Six shooters, shotguns, Gatling guns, flaming arrows, hatchets, dynamite, and more.\nExpansive interactive world: Play an extensive variety of exciting missions as you journey west across the new frontier. Ride on horseback through the scenic, yet dangerous Western terrain of canyons, mountains, plains, forests, gold mines and towns.\n© 2006 Activision Publishing, Inc.  Activision is a registered trademark and GUN is a trademark of Activision Publishing, Inc.  All rights reserved.  All other trademarks and trade names are the properties of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Neversoft","platforms":[{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":13483,"name":"Drones, The Human Condition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fae/faef87e072c9156cab9acaf8a3bef244.jpg","description":"Now with Trading Cards!\nAbout the GameYou can save Humanity!\nIn 2084, Cloud 9, the world Government body, perfects armed AI Drones, a cloud controlled advanced robot species created from bio-mechanical material traded with alien races who influence power on earth. Guided by their infallible logic, the drones conclude: \"The Human Race is draining the earth resources and therefore must be imprisoned and destroyed.\"\nYour Task is Simple, Kill Drones, Free Humans, Don't Die!\nDrones, The Human Condition is a fast paced twin stick, top down arena shoot 'em up, set in a futuristic Orwellian dystopia, with adrenaline-pumping electronic music, 13 hand designed levels of glitchy insanity and hoards of intelligent robots to blast to pieces. Bring on the destruction!\nUse 5 different weapon types to defeat hoards of Drones, you have 5 credits, once you have used all these credits, its game over! your progress is recorded, so you can pick up where you last died. beat 13 levels of chaotic destruction to complete the game. discover the secrets of Drones, The Human Condition.\nThe entire game was made by a solo Attic dwelling Developer.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Blunt Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10179,"name":"Rakuen","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/07d/07db693969f2d918aaba6adfbb0a4819.jpg","description":"Rakuen is an adventure game about a little Boy who lives in the hospital. One day, the Boy asks his Mom to escort him to the fantasy world from his favorite storybook, so that he can ask the Guardian of the Forest to grant him one wish. In order to receive his wish, the Boy must complete a set of challenges that revolve around helping his neighbors in the hospital by interacting with their alter-egos in the fantasy world...\n...A cranky old man who guards a broken music box with his life while complaining that he never gets any visitors; a young woman in a coma whose husband hasn’t left her side in months; a little girl who laments over a friend she was never able to say goodbye to after growing ill… The Boy slowly begins to realize that his neighbors are plagued by secrets and struggles that are mysteriously tied to the strange hospital.FEATURESHeartwarming and character-rich story.\nA unique non-combat adventure that mixes whimsical dungeons, eerie room escape puzzles, and dialogue-based mysteries that are intricately tied to the story.\nWalk a mile in everyone's shoes as you traverse each character's life to learn about their unfinished business and help them through it.\nAn original soundtrack featuring multiple vocal songs that are closely tied to each character.\nCollect items and build friendships to gradually make the hospital a better place.\nGo on humorous quests for strange creatures in the fantasy world.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Laura Shigihara","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":471031,"name":"As Dusk Falls","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0eb/0eb6673637d877b09a9a1f9aa6e25db4.jpg","description":"One town. Two families. Three decades of secrets.\n\nAs Dusk Falls is an original interactive drama from INTERIOR/NIGHT that explores the entangled lives of two families across thirty years. Starting with a robbery-gone-wrong in small town Arizona, the choices you make will have a powerful impact on this epic story of sacrifice, betrayal, and resilience.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"INT./NIGHT","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":14936,"name":"The Typing of The Dead: Overkill","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/47d/47dd080e9c479db28312d7d91fa014a4.jpg","description":"New Sci Fi DLC Available!The Typing of the Dead has now been updated with all new free Sci Fi DLC! Lazer those Aliens...err Zombies to smithereens!\nAbout the GameTyping of the dead: Overkill fuses the horror and comedy of the legendary House of the Dead series with unique typing mechanics in order to deliver a truly original gaming experience!\nThis gruesome shooter puts you in the middle of a mutant outbreak in Bayou county. Blast pieces out of the zombie horde across 9 stages, one keystroke at a time, in order to save you and a friends life as you work to uncover the mystery behind the outbreak.\nFeatures:\n-\tRandomised kill-words to make every game experience unique;\n-\tYour keyboard is the weapon – type bullet holes into those zombie hordes!\n-\tThree difficulty levels included to test your typing skills to the max as well as a special ‘hardcore’ level for true keyboard warriors!\n-\tRedefined HOTD gameplay to complement the new typing mechanics;\n-       Two-Player co-op multiplayer\n-\tFull Steam integration\n-\tFull and faithful port of the original PS3 edition of HOTD included in game\n-\tPlus more to come","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Modern Dream","platforms":[{"id":0,"name":"PC"}]},{"id":11403,"name":"Panzar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/925/925ff3b4b5b7633e1e2b24b1dc160d53.jpg","description":"PANZAR is a fantasy multiplayer third-person shooter. You get to choose from eight unique character classes, team-based PvP battles, exciting PvE adventures and regular tournaments with real prizes. Advanced RPG elements, the non-target combat system and the most modern graphics by CryEngine 3 will make your combat experience unforgettable!Key Features\nDynamic Team-Based PvP and PvE\nPANZAR is built on high intensity team-based battles. Players fight in 8 vs 8 PvP fights and extensive breathtaking PvE raids where no one can secure victory alone. The secret to success in battle is how well you coordinate with your other teammates. It’s ideal entertainment for groups and clans. PANZAR’s developed clan system gives you the chance to participate in spectacular mass tournaments for glory and prizes.\nOne Spectacular Fantasy World\nIncredibly Detailed Fantasy World\nPANZAR comes to life through the raw power of CryENGINE, the ultimate game development platform deliveri\nng incredibly detailed graphics and fluid gameplay. Players face off in rich and detailed environments such as mountain waterfalls, jungle villages, ancient castles and temple ruins. PANZAR is flexible, serving a wide range of graphics capability modes, so computers of many generations can get into battle.\nTactical Gameplay Modes\nPANZAR has a wide range of locations, equipment and skills creating an almost never-ending variety of tactical options and battle strategies. There are eight different character classes, each with their own unique skill set, game dynamics and overall role within the team. With several different gameplay modes – Domination, Siege, Rugby and King of the Hill - it’s a game you’ll want to play again and again.\nUnique Heroes\nPlayers can create their own formidable characters and develop and equip them as they like. You can buy, sell, craft and upgrade weapons, armor and magical potions at any time between battles. Not to mention the nearly limitless freedom of self-expression arising from all the hairstyles, battle cries and armor paint choices. Unleash your imagination!\nAdvanced Social System\nPlayers can communicate with other players right in-game using voice, team and general battle chat options.  Finding new friends, grouping or reconnecting with old ones is simple! There are even gold bonuses on offer for each new friend recruited. Join teams, claim victory and crystals in tournaments, even create your own clan and choose the comrades you will fight shoulder to shoulder with. In PANZAR, there is only one goal…Victory!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Panzar Studio","platforms":[{"id":0,"name":"PC"}]},{"id":29069,"name":"FIFA 10","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/297/297bb5ec95c05e3d5778d352ee304813.jpg","description":"FIFA 10 is a football game, the 17th installment in FIFA series. The game was released in 2009 on the all platforms — handhelds and stationery — possible, making its way through a total of 10 gaming platforms covering the sixth and seventh generation of video game consoles.\n\n###Manager Mode changes\nThe mode was rebuilt when compared to the previous parts of the game due to the vast amount of critics towards it. The \"Total Football Experience\" was added to see the latest transactions and game changes transparently. The finances question were put on hold and changed the correlation of forces from the sponsor's side to the director's.\nThe manual experience system from the previous part was also cut.\n\n###Gameplay\nThe gameplay is generally not changing across the series. The minor changes are set into the fields of stadiums: 50 stadia from Europe and all over the world. \nThe game also features 500 teams which are divided into 30 leagues. Russian premier league makes its first appearance in FIFA series in the 10 chapter. \nThe gameplay process is accompanied by voiceover commentaries in twelve languages. Every featuring speech supports about 30 thousand remarks each.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Wii"},{"id":0,"name":"PlayStation 2"}]},{"id":3182,"name":"Beyond Eyes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0b6/0b6e570237c0fb8a529d3c2ab392d30e.jpg","description":"Beyond Eyes is a modern fairy tale about finding courage and friendship as you carefully guide young Rae on a life changing journey, uncovering an incredible world, step by step. Blinded as a young child, and reluctant to leave the protection of her family home, Rae’s world is once more shattered as Nani, her pet cat, goes missing. Summoning up all the courage she can muster, Rae learns to face her fears and ventures out into the world, to find her best friend.\nExperience the world from the unique perspective of a young blind girl, as she is faced with the world outside of her parent’s home and the challenges her disability brings.\nImmerse yourself in a uniquely painted and explorable environment, overlaid with a haunting musical score.\nOn Rae’s journey to reunite herself with her feline friend Nani, you will help Rae make sense of this unfamiliar world, changed in the years since she first lost her sight.\nUnlock achievements to mark your progress both through the woven story, and with helping Rae grow more comfortable with her surroundings and disability.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":259883,"name":"Maid of Sker","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/742/742e7e9936c4d663069de26511f3717e.jpg","description":"ABOUT THE GAME\nMaid of Sker is a first-person survival horror, set in a remote hotel with a macabre history from Welsh folklore. Brave the nightmares of the Quiet Men. When they arrive, do not panic — don’t even breathe.\nSet in 1898 and based on the haunting true story of Elizabeth Williams, you play as Thomas Evans, a musician who is thrust into a terrifying battle to save the woman he loves.\nFeaturing realistic 4k visuals with gameplay focused on story, exploration and no-weapon survival tactics. Experience a multiple thread narrative where your decisions matter, unlocking different story paths and multiple endings.\nExpect a story of forbidden love within a family empire driven by torture, slavery, piracy and a supernatural mystery that suffocates the grounds of the hotel.\nA 3D sound based AI system is the core survival gameplay mechanic. Hide, run, creep, trap and distract are some of the techniques you need to master to survive enemies with super hearing. As you progress, enemies become more difficult to avoid, to the point where standing still and holding your breath is the only option!\nTime it correctly and you’re safe, for now. Run out of breathe and — suffer.\nWith the support of the Creative Europe Programme - MEDIA of the European UnionSUPPORTED CONTROLSKeyboard / Mouse, Standard Controller","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Wales Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12751,"name":"Tempest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/41a/41a648b954d9a750b2595995b113e684.jpg","description":"Level up your pirates, let them grow from sailor boys to skilled old salts!\nHey Captain! Now that you’ve got the Jolly Roger fluttering in the wind over your ship, you’re ready to rove the seas, take on merchant ships loaded with booty and storm formidable fortresses. Set sail and get your hands on all those legendary treasures that are just waiting for the picking!\nWhen we created Tempest, we focused on the most thrilling part of pirate life – sea battles.\nAs you navigate the dangerous waters of the game you won’t just catch up with merchants, but you will encounter fellow pirates, creepy followers of a mysterious cult and terrible mythical monsters: Kraken, Leviathan and other infamous creatures.\nYour ship – the pride and joy of any freebooter – can be customized in many ways. You are free to change almost everything – from the color of your flag and sails to the ship’s hull and figurehead.\nOf course, there are plenty of weapons to choose from for every battle, including cannons, mortars, flame throwers and so on. Also there are special tools ready to help you to rig the ship for any purpose. However, you can win the most valuable artifacts only by finishing the multilevel quests called “legends”.\nGood hunting.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lion's Shade","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":42889,"name":"Vane","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a7e/a7e6a71fa0094acec20749c73925961b.jpg","description":"In a ruined desert, a strange golden dust transforms a free-spirited bird into a determined young child, setting off a chain of events that will reshape the world itself.\r\n\r\nSet out on an exploratory quest, transforming between bird and child, using both perspectives to unravel the land’s mysteries and create a path forward through the barren landscape. As you do so, the world reacts to your passage, evolving and building into something altogether different. \r\n\r\nFrom the team at Friend & Foe Games, Vane is a stunning, emotional and unnerving experience. Developed with the conviction that players should find their own path through the world, the result is a minimalistic, stark environment that encourages exploration just to the edge of getting lost, set to an all-original brooding synth soundtrack.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Friend & Foe","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":18110,"name":"Shadows on the Vatican Act I: Greed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/855/8551340e0a130520a19c74111caa84ba.jpg","description":"Visiting Rome from Chicago, where he works as a doctor, ex-priest James Murphy answers a mysterious call for help from his friend Cristoforo. The disappearance of a briefcase containing compromising documents is enough to convince James that his friend is a victim of something shady and sinister. The Vatican's involvement and some strange parallels with his own traumatic past inspire James to get to the bottom of this mystery.\nAlong this dangerous and disturbing path, James finds the most unlikely travelling companion who will question his deepest beliefs. And so the two characters begin both a physical journey in search of the truth, and a metaphysical exploration of the inner soul and the darkest secrets that everyone hides, even a \"champion of the faith\" like James.\nRome is the stage for this adventure – a city bathed in eternal twilight, its skies tinted the color of blood spilled in more than thirty years of intrigue: blood of innocents and guilty, unknown and famous victims alike.KEY FEATURESShadows on the Vatican is a thrilling new point-and-click adventure in 4 acts, inspired by real events in recent Italian history and freely adapted from the bestseller of David Yallop \"In God's Name\".\nArt direction by Lorenzo Ruggiero (Marvel/DC Comics)\nOver 10 locations per episode with high resolution graphics and Full HD support\nRealistic characters with hours of motion-capture animations\nWell integrated puzzles and several hours of gameplay\nAnimated coloured comics by award winner Daniela di Matteo","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"10th Art Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16008,"name":"DashBored","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1d0/1d0c5d74a8600ce8a91fd710be1cedc4.jpg","description":"DashBored is a twisted turn-based RPG taking place in a horrible realm of nobodies!\nNic's not the kinda guy who gets out much. You know, the kinda guy who kicks a friend out\nso he can get back to watching anime? Yeah that kind of guy.\nJust when he thought life couldn't get any worse, Nic finds himself transported into an insane\nalternate dimension where everyone's either a loser, a degenerate, or an actual monster.\nNic's gotta make some friends here if he ever wants to get back home!\nFeatures\nA classic style turn-based RPG.\nFive degenerate party members to recruit.\nStrange hamstrung soundtrack.\nWitty dialogue and funny characters!\nMultiple Endings!\nTravel to strange locales and meet their strange locals!\nLarge amount of characters to meet and greet.\nRodents that you can flip off!\nBirds to break your fall!\nGiant monstrosities to break your bones!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fading Club","platforms":[{"id":0,"name":"PC"}]},{"id":561,"name":"Frozen Free Fall: Snowball Fight","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/faf/faf826e358255c6831cf67228dc4ebfe.jpg","description":"New Languages SupportedFrozen Free Fall Snowball Fight now supports the following languages:\nFrench\nItalian\nGerman\nSpanish\nJapanese\nKorean\nPortuguese-Brazil\nRussian\nSimplified Chinese\nTraditional Chinese\nChange the Steam language setting to display.\nAbout the GamePlay Disney’s #1 puzzle game now featuring 375 levels!\nGet ready to turn your living room into an epic puzzle matching battle in Frozen Free Fall: Snowball Fight with local multiplayer mode! Challenge your friends & family to a thrilling Snowball Fight where you dodge and throw snowballs by creating cascading combos. Unleash spectacular power-ups and progress through challenging levels to unlock new characters and even more exciting puzzles! Play now for FREE!Key FeaturesThe ULTIMATE Puzzle Experience: Match colorful ice crystals and deploy masterful combos to conquer each puzzle.\nCompetitive Multiplayer Mode: Come join the fun and challenge your friends & family to an epic snowball battle!\nFeatured Frozen Characters: Unlock and play as your favorite Frozen characters including the menacing yet lovable Marshmallow!\nSpectacular Power-Ups: Unleash dazzling powers such as Elsa’s Glacier Magic & turn the tide of the game!\nStunning New HD Graphics: Experience vibrant new high definition visuals, exclusively on the big-screen & PC editions!\nBefore you download this experience, please consider that this game contains in-app purchases (IAPs) that cost real money.\nWe respect your wishes regarding your Privacy.  Please review our Privacy Policy at http://disneyprivacycenter.com and our Terms of Use at http://disneytermsofuse.com.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Disney Interactive Studios","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":11593,"name":"Bleed 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e2e/e2ed9b49dbe50699dddfe3c6a0f64f25.jpg","description":"Bleed 2 is a relentless arcade action game featuring air-dodging, bullet-reflecting, and tons of bosses.\nWryn is the world's greatest (and only remaining) hero. Help her battle an invading force of villains and live up to her title as the Greatest Hero of All Time!\nFeaturing an original soundtrack by Jukio Kallio and sound design by Joonas Turner!Key Features:7 levels containing over 25 boss fights\nUnique controls let you shoot, dodge, reflect bullets and slow time all at once\n4 difficulty levels that remix enemy placement and boss patterns\nUnlockable weapons, characters and abilities\nArcade Mode: Tackle the game on one life to compete for leaderboard glory\n2-player local co-op for all modes (requires at least one gamepad)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Digerati Distribution","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":2404,"name":"PARTICLE MACE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/358/358d31e3946a1baa2133a9cc7d37b04e.jpeg","description":"Unlike in traditional twin stick shooters, in Particle Mace, you destroy your enemies by swinging giant boulders at your enemies.  It takes a deep understanding of your own weight, thrust, and inertia in order to be a master Particle Mace gladiator, but once you get in the zone, this game satisfies like no other.\nPARTICLE MACE is a game about capturing the thrill of classic arcade games with a new, physics based mechanic.\nPARTICLE MACE is a game about trying not to die, but that's impossible.\nPARTICLE MACE is explosive arcade fun for 1-4 players that pays homage to twitch games of the past, but replaces the typical guns with an unruly physics-based weapon. Take control of a tiny ship in an extremely hostile universe, and defend yourself as long as possible from enemy ships and asteroids using a collection of trash particles tethered to the ship. To survive, you must carefully navigate around the many hazards while building up momentum to swing your weapon into your foes or your friends, all in a field of brightly abstracted visuals and an entrancing procedural background.\nFeatures:\n■ 150 Missions\n■ 1-4 Player Local Coop\n■ 9 Ships to Unlock\n■ 2-4 Player Deathmatch\n■ 2-4 Player Arcade Co-op\n■ Leaderboards\n■ PS3, PS4, Xbox One & Xbox 360 Controller Support\nGame by Andy Wallace\nMusic by Nathaniel Chambers\nAudio by K. Anthony Marefat & Bobby Fata\nPR by Maya Kramer","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Andy Makes","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":916,"name":"Small World 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c25/c252e2023355e98787402c4bdd90f775.jpeg","description":"Based on the phenomenally successful Small World fantasy board game with over 500,000 copies sold! Take control of insanely fun fantasy race & special power combos, such as Berserk Halflings, Triton Merchants, Alchemist Ratmen and Dragon-master Amazons, to grab all the land you can in a world that is just too small to share with your opponents!\n\nA host of new features await you in this colossal update:\n\n* 2, 3, 4 and 5 player maps to conquer\n* Play with friends on iPad, Android, Kindle Fire (2nd gen) and of course Windows, OSX, Linux and SteamOS\n* Play Online games in real-time or turn-by-turn, with friends & strangers from the world over; and Local games over Wifi\n* Play Solo against up to 4 built-in AI; Pass’n Play with up to 5 live opponents on a single device\n* 20 new races & special powers to master through in-app purchases of Cursed!, Grand Dames and brand new to digital Be Not Afraid…\n* Online, Solo & Face to Face scores with daily, weekly and forever rankings\n* Comprehensive Small World Encyclopedia detailing all rules, races, special powers, icons & more!\n* Extensive Days of Wonder Online Buddies integration\n* Brand new musical score, sound effects, graphics and animations\n* Video Tutorial by Master Glandulf himself","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":60546,"name":"CryoFall","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df9/df90b89175ad501eba4c392ebca4a8b0.jpg","description":"CryoFall is Sci-Fi multiplayer survival game set on a forgotten planet in a distant future.DescriptionWelcome to the world of CryoFall, where a catastrophic crash landing has stranded you — and dozens of others — millions of light-years from home, trapped on a hostile planet and in constant danger.\nYour only hope for survival is to make use of the resources around you as you develop your skills and technology to conquer this new land, tame its harsh wilderness and build a new life for you and those who have found themselves marooned on CryoFall.\nTogether with dozens of other survivors you can create your own cities, establish active economy, industry and agriculture, or pillage what other survivors managed to put together.Features Complex crafting and industrial system, including oil refining & lithium extraction\nVarious stages of technological progress (primitive, industrial, modern, post-modern, sci-fi)\nFarming with complex crop growth simulation, fertilizers, etc. & diverse cooking options\nWide range of player interactions and roles with meaningful specialization options emphasizing meaningful interactions, rather than just combat\nEconomy with coin minting, complex trading and automated vending machines managed by players\nCarefully hand-crafted maps and locations (+ map editor)\nStoryline elements discovered through exploration\nDiverse environments with several biomes (temperate, desert, tropical, boreal, wasteland, etc.)\nIn-house developed Renkei Engine™, allowing hundreds of players on the same server\nComplex character simulation with several dozens of status effects (e.g. bleeding, poisoning, radiation, etc.)\nExtensive modding capabilities, including real-time code editingNot sure if this game is for you?Make sure to take a look at our complete feature overview!\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=1489843089DevelopmentThe game is in active development and new features added monthly with each new version release!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"AtomicTorch Studio","platforms":[{"id":0,"name":"PC"}]},{"id":58498,"name":"Bloodstained: Curse of the Moon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e38/e38c2d27671f97bd42855d358b37d22d.jpg","description":"Battle with swords and whips in this retro-style action game brought to you by game creator Koji Igarashi and Inti Creates!\nPlay as Zangetsu, a demon slayer bearing a deep grudge, who must travel through perilous lands to defeat a powerful demon lurking in a dark castle. Zangetsu will meet fellow travelers along the way, who can join your journey as playable characters.\nSwitching to these characters with their unique abilities will unlock new paths through the treacherous stages. Your choices in recruiting these adventurers will change the difficulty of the game, and may even affect the ending!\n*Bloodstained: Curse of the Moon is the 8-bit style game promised as a stretch goal of the 2015 Kickstarter campaign for \"Bloodstained: Ritual of the Night.\"","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Inti Creates","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"}]},{"id":11984,"name":"S.K.I.L.L. - Special Force 2 (Shooter)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ce/9cedf673d6329ecbb4a542aae4980861.jpg","description":"S.K.I.L.L. - Special Force 2 is a fast-paced, action-packed shooter based on the Unreal Engine 3. The game features a wide range of game modes, tons of maps and a huge selection of weapons.\nThe game comes with regular content updates including new maps, game modes, weapons and other improvements!Key Features:Over 20 maps covering a wide range of locales, spanning everything from deserts through to winter landscapes.\nA ton of game modes – including PvE modes and the unique Hero mode:\nSingle Deathmatch\nTeam Deathmatch\nAI Team Deathmatch\nBlasting\nSeizure\nEscape\nHardcore (increased damage, no HUD)\nSurvival\nDefence\nHero\nand more…Cool weapons to suit every playing style – from pistols through to heavy machine guns.\nA plethora of options to change the appearance of your character and weapons.\nSpecial clan features: weekly rankings, clan logo designs, and of course T-shirts so you can show your allegiance in the game!\neSports: The game's fast and competitive nature makes it perfect for eSports competition, with Gameforge providing full support to the community, e.g. with the specially dedicated area on the official S.K.I.L.L. website.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Dragonfly GF Co","platforms":[{"id":0,"name":"PC"}]}]