[{"id":22869,"name":"Startopia","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/767/767bcf676a9219c85210b4bb7bfbed11.jpg","description":"A once thriving network of space stations and planets have been left lifeless, redundant scars of the apocalypse. Into this age of darkness comes light. You will lead the way in rebuilding the network of space stations to a standard accepted by the individual alien races, attracting them to harness their expertise and research new technologies. Thus begins the hilarious battle of wits and cunning, full of daring escapades.Key Features:Fully functioning alien society, with racial animosity and friendships, crime and punishment, leisure and entertainment, and functioning economy\nUnique 'Torus' play area gives a viewpoint never before seen in a game\n16 habitable subsections spanning three decks in each space station\nBio-deck with editable landscape and manageable ecosystem allowing complete control of terra-forming\nMultiplayer support for up to three other stationmasters\nVaried levels of play, from simple sandbox to detailed station micromanagement","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Mucky Foot Productions","platforms":[{"id":0,"name":"PC"}]},{"id":19899,"name":"PICO PARK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/744/7448401d1e853956a4e1b30b256192a3.jpg","description":"PICO PARK is a cooperative local/online multiplay action puzzle game for 2-8 players.\nThe rule is quite simple: \"Get all the keys and get to the goal and clear\", but all 48 levels have special gimmicks designed specifically for multiplayer. At most levels, different gimmicks will appear as you move forward, and you will need to consult with your peers and think about new ways to cooperate.\nThis version is essentially a port of the one we released on the Nintendo Switch in 2019.\nHowever, it's not just a port, it now supports online play.\nThe 2016 version of this link has been renamed  \"PICO PARK:Classic Edition\"\nhttps://store.steampowered.com/app/461040/PICO_PARKClassic_Edition/\n[Flexible Level]\nEach level of PICO PARK can be cleared when players get the key,unlock the door and all players reach it.But, every level requires cooperation to complete..\n[Battle Mode]\nCo-op play is the main work of this game, but let's compete with friends in BATTLE MODE once co-op play is completed.\n[Endless Mode]\nEven if you complete all 48 stages, you can play ENDLESS mode to aim at high score by collaborating with friends. By collaborating with friends, your score will grow faster.\n[Online Play Mode]\nYou can play together online with people who are far away from you.\nHowever, this is a game where communication is very important, so we recommend using Discord or Zoom to play while talking.\n* If you are connecting more than 5 Xbox controllers, please enable \"Xbox Extended Feature Support\" in Controller Settings.\n* Sorry , TecoGamePad is not supported.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"TECOPARK","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":301576,"name":"Gato Roboto","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/266/2667b0dc1a9766cfc767172edc1255c5.jpg","description":"Pounce inside of your cozy armored mech and set off on a dangerous trek through an alien underworld full of irritable creatures and treacherous obstacles in a valiant effort to save your stranded captain and his crashed spaceship. Tiptoe outside the friendly confines of your technological marvel and follow your feline instincts through tight tunnels and mysterious waterways to scavenge for new weapons and gear. Adventure awaits the most curious of cats in Gato Roboto!\n* Explore the underground labyrinth of a deep space outpost and uncover the dastardly deeds that unfolded before your arrival.\n* Blast and dash your way through enemies and obstacles in an agile mech suit to face the guardians stationed precariously throughout the base.\n* Cautiously venture outside the mech and risk all nine lives to explore areas inaccessible to your bulky, mechanical armor.\n* Discover secrets abound and gather new weapons and items to help open up new areas on your journey through dozens of handcrafted environments.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"doinksoft","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":20159,"name":"Tony Hawk’s Pro Skater HD","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/958/9582b5acfecaefac5875fa13e5901081.jpg","description":"Tony Hawk’s Pro Skater HD takes the best elements of the classic THPS games and gives them a fresh update to create an all new skateboarding experience for PC. The gameplay in Tony Hawk’s Pro Skater HD focuses on the satisfaction of linking sick tricks for maximum points. Combining sharp visuals with the best controls ever in a Tony Hawk game, the feel is cutting edge yet timeless.\nKey Features\nTHPS and THPS2 gameplay comes to PC!\nHD Upgrade: Game was rebuilt and polished by Robomodo using Neversoft’s original level models.\nClassic levels: The style and feel of the best 7 levels from THPS and THPS2 (Warehouse, School 2, Mall, Hangar, Venice, Marseille and Phoenix Downhill Jam) refreshed for today. The levels are exactly the same specs as the originals - every gap, SKATE Letter, etc is exactly where you remember it but looks a hell of a lot better!\nThe Top Pros: Today’s biggest skate pros round out the cast including: Nyjah Huston, Chris Cole, Eric Koston, Andrew Reynolds, Rodney Mullen, Lyn-z Adams Hawkins Pastrana, Riley Hawk and, of course, Tony Hawk himself. Each has 8 boards, 3 special moves, and an alternate outfit.\nRefined controls: The skaters’ animations, tricks and combos reflect the evolution of the THPS games. Animations are improved, the tricks have been redone (and some new special tricks added), even “skater celebrations” have been added for big combos.\nManuals and Reverts: You can do manuals as part of trick combos in THPS HD. Given the fact that this game combines the best gameplay from THPS1 and THPS2, Reverts will not work as part of trick combos in the initial launch of THPS HD as that mechanic was not introduced until THPS3. However, reverts will work in the post-release DLC for the THPS3 levels, as those levels were originally designed to accommodate this.\nEndlessly fun objectives:  Players pursue the same global and level-specific goals as the original games, including S-K-A-T-E, Secret DVD (used to be VHS tape!), and many more.\nIn-Game Soundtrack: It is about half classic THPS tracks and half new ones. Includes Goldfinger’s “Superman” and the Anthrax/Public Enemy collaboration “Bring the Noise”.\nDownloadable content: Coming post-release, The “Tony Hawk’s Pro Skater 3 HD Revert Pack” DLC includes levels from THPS3 including Airport, Canada, and LA. New pros included are legends Steve Caballero and Geoff Rowley.\nIn Game Map View: Pause and see the location of objectives and gaps.\nQuick Restart: Back button allows you to quickly restart their session. Perfect for the obsessive gamer who is looking to achieve the perfect combo.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Activision","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":10121,"name":"Conflict: Denied Ops","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/58d/58dea937cb848952b3734bed14829569.jpg","description":"*This is a single player only title*\nVenezuela is left in a state of civil war after the government was brutally overthrown by a military coup.  With factions fighting to reinstate democracy, the U.S. government has offered their assistance, though the new government regime has threatened to deploy nuclear weapons if the U.S. meddles in Venezuelan affairs.  The threat needs to be neutralized, and the U.S can't risk nuclear war.\nThe CIA Special Activities Division operates in isolation and secrecy.  If captured, any link with the U.S. Government will be denied.\nConflict: Denied Ops is a highly accessible FPS featuring massive, extremely explosive firefights across destructible environments.  Work as a team to utilize the specific skills of each operative and experience the ultimate in destructive satisfaction with tons of exploding objects and an endless barrage of terrorists who are begging to be blown to hell.Key Features: Two-Man Tactics  Switch between team members at any time for maximum control.\nExplode Your Enemies  Levels are built around massive fire fights with a continuous stream of enemies, and tons of exploding objects littered around the level to help your cause.\nDestroy Everything  Obliterate your enemies with explosions, demolish buildings, blow through walls and destroy almost anything in the environment.\nAccessible Action  Give commands to your team mate simply by pressing or holding a single button. Concentrate on the action, not complicated menus or control schemes.\nPuncture-Tech  Utilize strategic destruction made possible with new Puncture-Tech technology developed by Pivotal Studios.  Blast open new pathways, shoot unaware enemies through walls, or create holes in your cover to generate firing paths.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Pivotal Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":40035,"name":"Naruto Shippuden: Ultimate Ninja Storm 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a77/a77ab903bb7dd2001cb17e821a9b6fc3.jpg","description":"NARUTO SHIPPUDEN: Ultimate Ninja STORM 2 is a tour de force of Naruto thrills and spills. Impressively faithful to the universe of the anime, the game takes players through the Naruto Shippuden story arc with new battle systems enhancing the gameplay. Players must choose the right companions to fight alongside and together unleash explosive Team Special Techniques to lay waste to opponents. Ultimate Ninja STORM 2 has been remastered in HD.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":32247,"name":"Crime Cities","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/510/51040f5ea76619307ccf641fac1216e3.jpg","description":"25th century, Pandemia System. Law and order have been swallowed by a tidal wave of crime and terror. After its top man disappears while trying to infiltrate the criminal underworld, the Human Federation sends in another undercover agent, Garm Tiger, disguised as a convict in one of Pandemia’s prison cities.\n\nRevisit Crime Cities, a revolutionary cross between a shooter and a futuristic vehicle simulator, originally published in 2000. Immerse yourself in the dense atmosphere of a grim future, as you follow a complex plot and complete a variety of deadly, unpredictable missions. You’ll quickly realize that speeding in a futuristic vehicle through a city of myriad skyscrapers is the easy part of the job.\n\nTotal freedom of movement in a 3D environment\nFast-paced tactical gameplay\nOver 100 branching missions\n50 unique futuristic vehicles to choose from, each with a wide array of modifications\nMore than 20 different weapons\n4 distinct cities\nVaried enemy AI\nPlease note, multiplayer mode is not supported anymore.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Techland","platforms":[{"id":0,"name":"PC"}]},{"id":19445,"name":"Disciples II: Gallean's Return","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be2/be255cabe42fc00f2b0234be753f1a1b.jpg","description":"Disciples II: Gallean's Return is a compilation edition that includes the base game, Disciples II: Dark Prophecy, plus the two standalone expansions Disciples II: Guardians of the Light and Disciples II: Servants of the Dark.\n\nDisciples II: Guardians of the Light is a stand-alone expansion that lets you dive into the fantastical world of Disciples II as either the Empire or the Mountain Clans.\nThe Empire is decaying from within as self-proclaimed rulers struggle for control of the now vacant throne while a cruel Inquisition sweeps across the human lands, causing rebellion and misery. Meanwhile the Clans, recovering from their near-destruction, begin to reunite their tribes. They have received divine instructions and now seek to uncover an ancient ritual that will let them communicate with their god, Wotan.\nDisciples II: Servants of the Dark is a stand-alone expansion that brings you into the never-ending quest for supremacy as either the Undead Hordes or the Legions of the Damned.\nOn the dark side, the Legions of the Damned enact a plan to spread Bethrezen’s plague across Nevendaar. They sense the threat brought about by the rebirth of the Elven god and will stop at nothing to steal this power for their own purposes. Perhaps most pivotal to the conflict, however, is Mortis and her army of Undead Hordes. After all, the rebirth of her husband Gallean was her doing. He had rejected her for what she had become, a twisted, heartless beast. Now she would teach her mate a lesson... one that would scar his people for eternity...\nFeatures\n\nRandom map generator\nMultiple resolution support\nHigh level unit AI support\nImproved computer AI\nImproved editor\nImproved UI\nAuto-Resolve Combat mode\nPlayer can capture capitals\nDirect 3D support for improved performance\nEnhanced chat interface\nSupport for large maps, 120x120 and 144x144\nAll the updates for Disciples II: Dark Prophecy\n2 new high-level mini campaigns and original Disciples II campaigns\n16 skirmish/multiplayer maps including 10 never-before-seen maps\n3 new special characters\nNew capital backgrounds\nNew battle backgrounds\nFour new music tracks\nExclusive portfolio containing original concept art and sketches\n","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Strategy First","platforms":[{"id":0,"name":"PC"}]},{"id":13776,"name":"Who's Your Daddy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d40/d4016a4fe0348b6ec91c9345c4fdf816.jpg","description":"DescriptionWho's Your Daddy is a casual 1 on 1 video game featuring a clueless father attempting to prevent his infant son from certain death.Current Features A beautiful home for you to watch over your son in\nPhysics based game play allowing you to move small objects as you please\nBeautiful compositions to be played on your baby's piano\nTwo unique character types to play as\nRandomized locations of crucial items\nAwesome power ups for being able to do chores\nAvailable for PC, Mac and Linux/Steam OSThe CharactersWho's Your Daddy features two different characters to play as, the daddy and the baby. DaddyThe daddy's goal is to prevent the baby from dying. He has a number of items that can be found inside the house to help him complete this task such as:\nPower Outlet Covers\nCabinet Locks\nPillsThe father player also has the option to do various chores around the house, such as cleaning up toys or changing a smoke alarm battery. Doing these side activities rewards the father player with a power up to help him watch over his son. Some examples of these are:\nPeek-A-Boo: Makes the daddy invisible\nBat Dad: Daddy can see baby's health and location through walls\nSay Momma: Daddy can see the location of important objects through wallsThe daddy player faces a number of challenges, due to needing the knowledge of how to approach any danger his baby may be in. He needs to be alert, fast moving and prepared for anything if he wants to keep his son safe.BabyThe baby's goal is to take his own life using whatever objects within the house he can get his little hands on. This includes actions such as:\nShoving forks into power outlets\nChugging various cleaning products\nScuba diving unsupervised in the tub The baby player has minimal responsibility and this allows for a simple, yet erratic play style.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Evil Tortilla Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":369237,"name":"Path of Giants","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/981/981c3e9d9d931e64bc294eec9ebbeb6c.jpg","description":"Path of Giants is a serene adventure through icy caverns and snow covered cliffs as you help three explorers face the trials of the mountain in search of a lost treasure.\nEach level is carefully designed and hand-crafted to create chillingly beautiful scenes, evoking a sense of calm as you explore this long forgotten area of the world. Each puzzle focuses on controlling three characters, and is hinged around the fact that you need to use all three to solve them.\nFEATURES:\n○ Play as three characters that help each other up and down platforms\n○ Navigate using simple tap controls\n○ Collect hidden relics\n○ Solve more than 50 puzzles split into 13 levels\n○ Increasing difficulty as you progress through the game\n○ Available in English, French, Spanish, German, Italian, Portuguese\n○ Colorblind feature - alternate character colors for better visibility\nTerms of Service: https://www.pathofgiants.com/terms-of-service\nPrivacy Policy: https://www.pathofgiants.com/privacy-policy","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Journey Bound Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":349844,"name":"Kind Words (lo fi chill beats to write to)","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b29/b2976bdc4e6eabdae4555e1251670b63.jpg","description":"Write Nice Letters to People and Get StickersHas something got you down? Stressed you out? Scared you? That's pretty normal. It might help you to talk about it.\nIn Kind Words, players anonymously write out their concerns and sorrows by making short requests for letters.\nReceive Comforting LettersEveryone can respond to requests with letters of comfort, sympathy or gentle advice.\nKind Words is a positive context; a warm, cozy mood. A place to feel centered and focused on the opportunity presented:\nUse your words to lift others and be lifted in return.\nOh, and There’s Stickers!You start the game with a couple random stickers in their inventory.\nStickers can be placed on letters written to others or sent as an appreciative response to a letter that has been received.\nOnce you get a new sticker, you can make copies of that sticker to send out to other players.\nEach sticker also comes with a 3D toy that you can put on display in your room.\nSwap letters to build up your collection of stickers and room decorations!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Popcannibal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":57666,"name":"Pandemonium!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b8/8b8348ef4dc763cb3ddf579c4a20bedd.jpg","description":"Pandemonium! is a 1996 platforming video game developed by Toys for Bob and published by Crystal Dynamics for the PlayStation, Sega Saturn, Microsoft Windows, N-Gage, Mobile and iOS. Pandemonium! features Fargus, a joker, and Nikki, who unwittingly casts a spell that destroys the town. The goal of the game is to reach the Wishing Engine, where they can wish the town back to normal. For each level, the player can choose which character to be. Each has a special move – Fargus can deliver a special spinning attack, and Nikki can double jump. The game consists of a great variety of unique gameplay objects, such as watermelons, clouds, spider webs and logs. A sequel called Pandemonium 2 (Miracle Jumpers in Japan) was released in 1997 for PlayStation and Microsoft Windows.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":1801,"name":"Halo: Spartan Strike","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/90a/90aeddc4106f90d6197a36572f59b4f8.jpg","description":"Halo: Spartan Strike makes you a Spartan supersoldier battling evil forces.\nDelve into 30 challenging missions through cities and jungles using a devastating arsenal of weapons, abilities and vehicles including the iconic Warthog against the Covenant and Promethean enemies. Be the Spartan and deny your foes the conquest of Earth.\nEarn Steam achievements, complete missions and compete against your friends for the top scores in the leaderboards.\n\nChallenge your enemies. Strike Fast. Be a Spartan!\nTOP FEATURES\nCrush your enemies using the iconic Warthog or sweep them from the battlefield using the all-new Kestrel VTOL.\nFace off against Promethean enemies; deadly mechanical warriors who seek mankind’s annihilation.\nExperience an all-new story that will take you from New Mombasa on Earth to the enigmatic Gamma Halo located at the edge of charted space.\nComplete weekly challenges and take the top position against friends in leaderboards that showcase your Halo gaming skills.\nGame supports keyboard/mouse, USB Xbox controller and virtual joysticks for touch.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"343 Industries","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":48894,"name":"Forged Battalion","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/82d/82d6cb4b9be7af2ab9455946c754f626.jpg","description":"Towards the end of the 21 century, the effects of climate change have devastated the world and a military force called “The Collective” has spread across the globe. As part of the resistance group it’s time for you to join the fight!\nCustomize your unique faction in a new take on real-time strategy as you fight in a variety of skirmish, solo, and multiplayer battles.  You are not only a commander, but also an engineer – so you have ultimate control over your faction’s units, factories, superweapons and economy.\nManage, customize, and develop the blueprints of your emerging faction to create ever-evolving factories and units.  Between missions a deep tech tree unlocks components that you’ll use to design combat units. As more technology is unlocked, your designs become more advanced and powerful.\nUsing resources gained in battle, you’ll unlock new options through the metagame Tech Tree to choose the archetype, armor, locomotor, weapons, and special abilities such as stealth and regeneration that will make your faction one of a kind.  Ultimately, you will have access to the most powerful options, including an array of deadly superweapons to launch against your foes.\nForge your FactionModify every unit chassis (Infantry, Light Vehicle, Heavy Vehicle, Aircraft) with a host of weapons, support and locomotor types. Add regenerative armor to your light vehicle, or add an anti-tank gun to your aircraft. Adapt to every situation, and every opponent.\nPersistent Tech treeEach battle you win, in each mode, contributes towards your faction’s technology upgrades with different science paths; advancing tech tree unlocks blueprints.\nA dynamic story campaign The resistance needs you to forge a new force to be reckoned with. Play through an exciting story campaign that will test your ability to react and adapt to the increasing threat of the ‘The Collective’.\nOnline multiplayerJoin up to seven other players in a variety of online multiplayer modes for intense tactical co-operative and versus action on dedicated servers.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Petroglyph","platforms":[{"id":0,"name":"PC"}]},{"id":18794,"name":"Tales of Monkey Island Complete Pack: Chapter 2 - The Siege of Spinner Cay","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1ff/1ff954c3718a82dda79f30b6e48b5564.jpg","description":"About Chapter Two\nGuybrush's adventures continue on the high seas as pox-plagued pirates lay siege to the innocent Mer-People. In between defending the Mer-People and dodging the persistent pirate hunter hot on his trail, Guybrush manages to catch up to his beloved wife and despised arch-nemesis — but their reunion is short-lived. Now Guybrush must focus on eradicating the Pox of LeChuck before more harm can be done. And as the Mighty Pirate draws closer to a cure, the waters will only grow murkier in this thrilling chapter of the epic saga.\nAbout the Series\nWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem...\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Telltale Games","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":275606,"name":"The Artful Escape","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3e/d3ee2d7653cf9d4640335ff7a471ab07.jpg","description":"The game centers on the character of Francis Vendetti, the nephew of a deceased folk-music legend, Johnson Vendetti. Though a musician like his uncle, Francis struggles under the influence of his genealogical relationship to his uncle on his own career. Before his first public concert, he sets off on a journey not only geographically to get away from London, but to also create a new identity for himself to completely stand out from his uncle.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Beethoven and Dinosaur","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":59641,"name":"Levelhead","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29e/29e46c72cd5af32327116a049c1d6d5f.jpg","description":"LISTEN AHHHP, INTERN. The Bureau of Shipping has a bunch of baby artificial intelligences (or B.A.I's) runnin' around, and someone's gotta teach them the ROPES. That someone is YOU. You've been assigned your very own B.A.I. called GR-18. You'll need to work that little robo through training, then build and share obstacle courses with the other Levelheads so we can start dispatching these A.I. across the galaxy!\nWelcome to the Levelhead division!>> FEATURES\n+ Responsive, joyful platforming - Take control of GR-18, a delivery robot in-training, as you run, jump, and blast your way across a single player campaign and an endless supply of player-generated levels.\n+ Effortless, dynamic level building - Hop into the Workshop to create your own levels with more than 60 elements including enemies, hazards, paths, switches, secrets, power-ups, and even alternate game modes.\n+ Couch Co-op Creativity - Levelhead lets you play with up to 4 friends on the same couch for some downright hilarious entertainment. And if you want to really reach for those relationship goals, hop into the Workshop with friends and build levels with everyone at once.\n+ Build a following, play the world - Publish your Workshop levels to the Levelhub for the world to enjoy, and then fill up your own personalized feed by following creators whose content you love. With robust search and subscription, the Levelhub makes amassing a following and playing quality content from around the world a breeze.\nFor more game details follow the links to our official site and subreddit, and don't forget to Wishlist us!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Butterscotch Shenanigans","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":49950,"name":"Reigns: Her Majesty","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abf/abf5f1a2fc64c7d823caae6bd59b5d0b.jpg","description":"Reigns: Her Majesty is the revolutionary follow-up to the smash swipe ‘em up hit Reigns. A cultural renaissance has bestowed the world with a new era of knowledge and enlightenment but greed and jealousy still conspire against the benevolent queen. Outwit and outlast those that would seek to depose you and your husband by swiping left or right, making just (or unjust) decisions on all manner of royal matters. Maintain the balance between the kingdom’s most powerful factions, use mystical items from your inventory, and navigate the increasingly complex politics and personal relationships of your dynasty.\nNew Kingdom, New Drama: Your royal decrees and unpredictable requests of the people will shape both your time on the throne and the future of your dynasty. Carefully navigate the foolish politics and emotional pleas of the kingdom’s eccentric subjects to find balance between the most powerful factions of the land.\nMystical Inventory: Find and upgrade five special items in a new inventory system. Use your powerful items on character cards and unlock special paths in the ever more complex narrative of your kingdom.\nRoyal Challenges: Reach specific goals set before each new monarch’s reign to unlock new sets of cards and new directions to take the story of your dynasty.\nNerial and Friends: Reigns: Her Majesty is a collaboration between François Alliot (design/programming), Arnaud de Bock (art), Jim Guthrie (music), and Leigh Alexander (narrative director).","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":28757,"name":"Pure","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0b/d0b041f89b9ad94504c0af0f84fe8225.jpg","description":"(Online Interactions Not Rated by the ESRB) This game supports English, French, Italian, German, and Spanish. Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\". PURE is an offroad trick-racing game featuring incredible tricks and massive, vertigo-inducing jumps. Leap hundreds of feet into the air - off mountains, over lakes and across gaping chasms in epic worldwide locations. Pull off over 70 different tricks and build over 100,000 different custom quad bikes. It's all about speed, air and incredible tricks. PURE Adrenaline! There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Black Rock Studio","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":19678,"name":"Sword of the Stars: The Pit","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7c8/7c8c169dae89474752fcaf19d73babf0.jpg","description":"A deadly plague ravages your world. Your last hope: a legendary alien facility dug deep into the Feldspar Mountains...a massive Pit, built by the ancient Suul'ka.\nIf 'The Pit' really exists, there might be something left. Something that will give your doctors a fighting chance at the cure.\nAll you know for sure is that every expedition into those mountains has failed to return...\nAnd Nothing Sows Death Like the Suul'ka.\nQuamdiu Poteris Superesse?\nSword of the Stars: The Pit is a fun, fast, light-hearted turn-based RPG, where the tradition of Rogue and other old school dungeon-diving games meets the sci-fi Sword of the Stars universe, where the question to ask isn't \"Did you make it to the end?\" so much as \"How far did you make it into The Pit before the monsters got you?\"\nBe brave, press on for the sake of your planet, and when all else fails, go out in a blaze of glory!Key Features\n3 Characters to choose from... Marine, Pilot and Engineer!\n30 Levels of ancient evil science between you and the cure!\nImprove your character and increase your skills as you try and find a way to survive the depths.\nDozens and dozens of enemies drawn from the Sword of the Stars universe!\nOver 50 weapons and armors with a variety of special effects including flamethrowers, rocket launchers, plasma cannons and powered Brawler armor!\nRandomized augmentation effects (for your equipment... and for you!) make each game unique.\nCrafting lets you make special items from bits and pieces of your enemies.\nOver 100 items to discover, ranging from the familiar to ancient exotic tech.\nDozens of room types containing a host of exotic devices to help - or maybe hinder - your progress.\nDiscover and decipher hidden messages, crafting recipes, and pieces of Sword of the Stars lore!\nMany fiendish ways to die including poisoning, disease, traps, radiation, starvation and of course... MONSTERS.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Kerberos Productions","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18795,"name":"Tales of Monkey Island Complete Pack: Chapter 3 - Lair of the Leviathan","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2c/a2ce2ea32bf54a829cc01c315407a4c2.jpg","description":"About Chapter One\nThe saga begins with a heated battle involving the brave but often bumbling Mighty Pirate™ Guybrush, his beloved wife Elaine, and their nemesis, the demon pirate LeChuck. When the showdown goes up in flames, Guybrush finds himself marooned on a strange island with winds that always blow inward. How will our hero manage to escape this meteorological anomaly? What has become of LeChuck and Elaine? And what's the story with the infectious voodoo pox that's spreading across the Caribbean, causing Guybrush and other pirates to act like unruly hooligans? These are just some of the many questions posed in this first chapter of one of the most rollicking and rip-roaring entertainment experiences this summer.\nAbout the Series\nWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem...\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Wii"}]},{"id":47361,"name":"Zwei: The Ilvard Insurrection","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc9/fc90404f8713e306a99ba9e6e92b1b60.jpg","description":"Pilot, treasure hunter, and courier Ragna Valentine lives a life of adventure flying the high skies of Granvallen. But on a routine delivery to the remote floating continent of Ilvard, he finds himself ambushed by two dragon-riding ne’er-do-wells who send his plane spiraling to the ground.\nFortunately for Ragna, his crash was witnessed by someone in a position to do something about it: vampire princess Alwen du Moonbria. Pulling the dying Ragna from the wreckage of his plane, Alwen forms a blood contract with him, saving his life in exchange for his services as her vassal.\nHer request is far from simple – Alwen needs Ragna’s help both to recover her stolen magic, and to retake her castle, wrested from her mere weeks ago by villains unknown. Ragna’s ready to ante up, but on one condition: instead of acting as Alwen’s servant, he wants to undertake their adventure as equal partners...even though it could very well make the going tougher!\nSo begins the unlikely duo’s trek across Ilvard. Along the way they’ll meet the isle’s strange and colorful residents, battle the minions of darkness, train pets, learn potent skills from a macho masked luchador, and discover the meaning of (slightly dysfunctional) friendship. Sure, the bad guys might have the upper hand, but luckily for Ragna and Alwen, they never saw a tag-team this weird coming!FEATURESTwo Playable Characters for Tag-Team Action\nNo need to go it alone when you’ve got the power of two on your side. Ragna roughs up foes in melee range, while Alwen fires off salvos of powerful magic or locks down enemies from afar. Switch between the two on the fly to create crazy combos!\nUnique Food-Based Experience System Gives Greater Control Over Leveling\nExperience is gained through eating food, so you can choose to cash in immediately, or save it to trade later for food worth even more EXP. You can even beat the game at level 1...if you dare.\nStrange and Quirky Setting with Strange and Quirky Characters\nThe residents of Ilvard are a lively lot, and you can learn more about each one in your spare time as the story progresses. What’s the deal with that chain-smoking nun? Which of the three maids shirks the most work? And... is that a girl in a giant penguin costume?\nBrand New, Expanded English Voices\nWe’ve greatly expanded on the Japanese release’s voice acting, with over 2000 never-before-voiced lines bringing the twists and turns of the main story to life.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Nihon Falcom","platforms":[{"id":0,"name":"PC"}]},{"id":38146,"name":"Platypus 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/96e/96e99759615ed985192cc1092c57d7ce.jpg","description":"Fly the famed Platypus fighter through a fantastic landscape of carefully molded clay to protect inhabitants of Mungola from the Collosatropolians! Collect power-ups and bonus stars to give your Platypus the boost you need. Every level of this gorgeous arcade challenge bursts with original fun that's perfect for gamers of all ages.Features:Cooperative Multi-Player (1-3 Players Locally)\nTwo Difficulty Levels\nStunning Claymation Graphics\nUnique and Addictive Fun","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Idigicon","platforms":[{"id":0,"name":"PC"}]},{"id":20041,"name":"Super Mustache","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/276/27647287893952e64c5fbcf2a5e70c6e.jpg","description":"Features:\n- Vintage/Retro style graphics and music.\n- Customizable controls.\n- Save your progress.\n- 15 hand crafted levels, 3 worlds filled with action.\n- Nostalgic, funny and challenging.\nSuper Mustache was developed by Redro Games and is being published by Back To Basics Gaming.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Redro Games","platforms":[{"id":0,"name":"PC"}]},{"id":18797,"name":"Tales of Monkey Island Complete Pack: Chapter 5 - Rise of the Pirate God","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e0/5e0a0e714301fff8ec98c4ec6eaa9fcb.jpg","description":"About Chapter One\nThe saga begins with a heated battle involving the brave but often bumbling Mighty Pirate™ Guybrush, his beloved wife Elaine, and their nemesis, the demon pirate LeChuck. When the showdown goes up in flames, Guybrush finds himself marooned on a strange island with winds that always blow inward. How will our hero manage to escape this meteorological anomaly? What has become of LeChuck and Elaine? And what's the story with the infectious voodoo pox that's spreading across the Caribbean, causing Guybrush and other pirates to act like unruly hooligans? These are just some of the many questions posed in this first chapter of one of the most rollicking and rip-roaring entertainment experiences this summer.\nAbout the Series\nWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem...\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Telltale Games","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":2713,"name":"Assault Android Cactus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5d3/5d3e51e02a2e28cc8a543de3d8253942.jpg","description":"When you're running on battery, make every second count!\nAssault Android Cactus is an arcade style twin stick shooter set in a vivid sci fi universe. Junior Constable Cactus is outside her pay grade when she responds to a distress call and ends up stranded on a crippled space freighter under attack by its own robot workers.\nUtilising a draining battery mechanic in place of lives, Assault Android Cactus challenges you to think fast and keep the bullets flying, blending the gameplay of western styled arena shooters with aspects of Japanese style bullet hell as you charge head first through transforming stages, massive boss battles and an eclectic cast of characters on the way to saving the day.\nKey Features\n9 playable androids, each with a distinct play style and personality\n25 stage campaign spread across five areas of the ship, face down giant bosses, earn characters and uncover the story of the Genki Star\nDive into the Infinity Drive to test your skill and endurance or challenge the Daily Drive to pit your wits against the community\nSupports keyboard or joypad and 1 to 4 players with local co-op\nUnlock game modifying EX options, Codex entries, artwork and more for wrecking robots","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Witch Beam","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":407565,"name":"Alder's Blood Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8aa/8aaf27d0868658ccfafb8df8b7cc3e85.jpg","description":"Parent Game\nAbout the Game⚜️FEATURES:⚜️🔸Tactical Strategy combat\n🔹Stealth and preparations\n🔸A sneak peek into twisted world of Alder's Blood\n🔹Diversity of approaches\n🔸Prologue - NOT a Demo\n🔹Hey it's free - enjoy and we wish you lots of fun :)\n⚜️SUMMARY:⚜️The story takes place before the events from Alder's Blood and changes the perspective from Chief of the Hunters - to a commoner, named Charles.\nCharles, as everyone else in this cruel world, is struggling to stay alive. Daring his luck, out of bravery or desperation - he aims for a quick buck and attempts to hunt the spawns of darkness. If he'll survive - income from reselling the remains of the beasts will secure his livelihood for weeks to come.\nWhat he is not aware of, is how his story will soon unfold and his life... changed forever.\nIn the world ruled by misery and humanity rotting in shadow of God's dead carcass - death, becomes mercy.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Shockwork Games","platforms":[{"id":0,"name":"PC"}]},{"id":45737,"name":"BROKE PROTOCOL: Online City RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c54/c545f87ffec9a7b0093f3e4b7ab6126f.jpg","description":"Become the Most Successful (or Most Wanted) man in the city.\nBroke Protocol is like a low-poly GTA Online with a strong focus on roleplaying features. You define your own goals and identity in a persistent, interactive, and reactive online sandbox. Currently in Early Access.\nYou can roleplay in limitless ways to gain money, power, and influence in a diverse low-poly world. You start with nothing and have to build your wealth, while managing your hunger, thirst, stamina, and addiction levels.\nClimb to the top of the criminal underworld, or live your life as a paramedic, firefighter, gangster, or law enforcer. You write your own story in Broke Protocol.FeaturesSupports up to 255 online players per server!Wide open and continuously expanding city with suburbs, market, prison, marina, and airportHundreds of AI citizens, police, firefighters, paramedics, and criminals roaming the city streets3D Positional VOIP to talk with other players near youTake on any job yourself to bring order and justice to the streetsEnterable interiors with staff, guards, and shopping areasDozens of usable weapons, guns, tazers, grenades, flashbangs, smokes, seeds, drugs, and handcuffsOwnable homes/apartments and gangs/territory systemUsable vehicles and aircraft, with boats and motorcycles coming soonAlso coming to Mac, and Linux later this year. Made with Synty Studios World Models and custom assets.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cylinder Studios","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":18796,"name":"Tales of Monkey Island Complete Pack: Chapter 4 - The Trial and Execution of Guybrush Threepwood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e57/e57af03918b91e78ff0b7c847260bfdd.jpg","description":"About Chapter One\nThe saga begins with a heated battle involving the brave but often bumbling Mighty Pirate™ Guybrush, his beloved wife Elaine, and their nemesis, the demon pirate LeChuck. When the showdown goes up in flames, Guybrush finds himself marooned on a strange island with winds that always blow inward. How will our hero manage to escape this meteorological anomaly? What has become of LeChuck and Elaine? And what's the story with the infectious voodoo pox that's spreading across the Caribbean, causing Guybrush and other pirates to act like unruly hooligans? These are just some of the many questions posed in this first chapter of one of the most rollicking and rip-roaring entertainment experiences this summer.\nAbout the Series\nWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem...\nWho can Guybrush trust? Where can he turn? Everything you think you know will be challenged as Tales of Monkey Island builds to its unexpected finale!","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Telltale Games","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"PC"}]},{"id":16043,"name":"Monsti","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e43/e4322029541bfafde4c3f9e78c91cb10.jpg","description":"Are you ready to test your skills in Monsti world?\nPlaying Monsti is easy, all you have to do is to click and fly for as much time as you can. There will be many obstacles that come your way and you have to do all in your power in order to avoid them.\nAs you go through the level you will be able to collect eggs, which will offer you immediate access to a variety of great new characters. Eggs are hard to get and many times you will have to go through trial and error in order to acquire them.\nIf the Normal game mode is too simple for you, we also offer an Insane mode where the enemies will move a lot faster so it will be even more challenging for you to move onward and acquire the eggs. The eggs will also allow you to purchase new themes, so if you do get enough you can also explore new locations and levels.\nUpcoming:\n- macOS support\n- More characters\n- New levels of difficulty\n- Powerups","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Unika Games","platforms":[{"id":0,"name":"PC"}]},{"id":3163,"name":"Blood Bowl 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c3a/c3a4a7a6337b94e7c5c9a1d2bc8076e7.jpg","description":"Blood Bowl 2 Legendary Edition is now available! Do you own Blood Bowl 2?\nAbout the GameTOUCHDOWN!\nBlood Bowl 2 smashes Warhammer and American football together, in an explosive cocktail of turn-based strategy, humour and brutality, adapted from Games Workshop’s famous boardgame.\nBlood Bowl 2’s new graphics engine and high-flying realization makes for a faithful portrayal of the fury and intensity of classic Blood Bowl matches. The solo game mode will have you lead the famous Reikland Reavers. Former star team of Blood Bowl you are tasked with bringing them back to glory, following a full story campaign supported by the hilarious commentators Jim & Bob from Cabalvision. Each match of the campaign is unique, with unexpected and surprising events constantly renewing the experience!\nThe multiplayer modes are bigger and richer than ever. In the persistent online mode, create and manage your own team comprised of one of eight races from the Warhammer world – Humans, Orcs, Dwarfs, Skaven, High Elves, Dark Elves, Chaos, and the Bretonnia newcomers. You will develop your team, gaining XP and unlocking new skills. But beware! On the pitch, all losses are permanent... Organize entirely customisable championships, from qualifications to finale, and use the new Transfer Market to buy and sell your players, and build your Blood Bowl dream-team!\nThe next generation of Blood Bowl touches down today, will YOU be the champion?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":35314,"name":"Silent Hill 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/594/59415e7fe99545bb303c108b19f38667.jpg","description":"Silent Hill 3 continues the series' trademark brand of psychological horror and terrifying gameplay. As a teenage girl named Heather, you'll explore and unravel the mysterious connection between the godforsaken town and her inner fears. Along the way, you'll encounter many strange characters you're not sure are trustworthy. Silent Hill 3 also features enhanced graphical detail, a more complex storyline, new items and weapons, and even more grotesque monsters than the previous games. Step into this world of nightmares and fight to survive.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Konami Computer Entertainment Japan","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"}]},{"id":14913,"name":"Disgaea PC","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b27/b27f2f6a30e2bae039ef6b8d13deb205.jpg","description":"Download the Darkness, Level Up Evil!\nTwo years after the death of his father, Overlord Krichevskoy, the demon prince Laharl awakens to discover that the Netherworld is in turmoil. With unlikely allies, his devious vassal Etna and the angel trainee Flonne, he must battle his way to supremacy to retake the throne and become the next Overlord. Experience the SRPG classic, now on PC!\nKey Features:\nAn SRPG from the most prolific SRPG creators in the world, Nippon Ichi Software\nChoose from over 40 unique character types\nEven with a max level of 9999, use Transmigration to start all over again, but your characters will be even stronger per level!\nDelve into the Item World, a randomly generated dungeon world, to level up your items!\nWith max level characters and leveled-up items, dish out millions of points of damage!\nOver-the-top battle animations\nGeo Panels - A puzzle game within a Strategy RPG\nLift & Throw - Throw your allies up ledges to reach enemies in hard-to-reach spots, or toss your enemies around instead!\nA zany story set in the Netherworld, where the notions of good and evil are reversed\nNew to Disgaea PC (It's not just a port!):\nUpdated UI and textures\nKeyboard/Mouse and controller support\nIncludes all content from Disgaea: Afternoon of Darkness\nNew Steam features, such as Achievements, Cloud Saves, Badges, and trading cards\nLearn about the long and prestigious history of the Disgaea series @ http://disgaea.us/","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Nippon Ichi Software","platforms":[{"id":0,"name":"PC"}]},{"id":349109,"name":"60 Seconds! Reatomized","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ce5/ce55171e4744e78eebe9af113b854028.jpg","description":"Dolores, Ted, Mary Jane and Timmy return to face the nuclear apocalypse in this new, remastered edition of the classic atomic adventure - 60 Seconds! Reatomized, featuring 4K support, refreshed 2D graphics and hand-drawn 3D textures, new interactive menu, improved UI system, a technical refresh, and of course... new content!\nNEW GAMEPLAY MODE Survival Challenges - unique, short storylines which will put your survival skills to the test!\nNEW OPPORTUNITIES  to escape the wasteland in form of a storyline spanning across multiple playthroughs! Can you escape the wasteland in style?\nNEW RELATIONSHIP SYSTEM  more stories and crazy interactions between the McDoodle family members!\nNEW SOUNDS, ART AND UNLOCKABLE VISUAL CONTENT  allowing you to add a little color to your fallout shelter!\nNEW ACHIEVEMENTS!\nWith only 60 seconds left to impact, go on a mad dash through the house in search of family members and useful supplies. Everything will be against you: time, your very own furniture, a house that's different every time you play, and the fundamental question... what to take with you and who to leave behind?\n\nReaching the fallout shelter in time, alive, is only the beginning. Whatever you scavenged and whoever you saved will play a vital role in your survival. Each survival story will be different, with every day surprising you with unexpected events. Will all of these stories end well? It's up to you. Ration food and water, make best use of your supplies, face difficult choices and even venture into the wasteland.\n\nGood luck.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Robot Gentleman","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":5776,"name":"Frederic: Resurrection of Music","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/27a/27a3b8ec5ec35dc2756f8564282b78f2.jpg","description":"Special OfferBuy Frederic: Resurrection of Music on Steam and get the award winning soundtrack from the game for free!!!\nAbout the GameStep into Frederic Chopin's shoes, and embark onto an one-of-a-kind adventure through musical genre in this remastered especially for Steam enhanced version.\nFrederic Chopin – one of the world's most talented classical composers, is brought back from the afterlife and finds that he's an involuntary part of a treacherous plan. The world of music is at the edge of destruction. Soulless music labels and mass-produced popstars have hindered all creativity. And you're the only hope of bringing it back.\nAccompany Chopin in his amazing journey full of quirky events. Battle your opponents in musical duels, intensity of which will make your palms sweat. Enjoy an hour of hand-drawn animated comic picturing the quirky story. Play through twelve catchy arrangements of Chopin's greatest classics, each in a different musical genre. Practice your skills until perfection and become the master of the piano.\nFeatures\n- 12 fantastic remixes of classical hits\n- 10 colorful locations from around the world full of hidden easter eggs and jokes\n- An hour of outstanding animated comic\n- Megatons of humor\n- 18 achievements of all difficulties\n- DRM-free game soundtrack included\n- Trading cards\n- Optimized for Windows 8 touch screens","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Forever Entertainment","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"}]},{"id":979524,"name":"Content Warning","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4b7/4b7716ece99ad9d65747f580c0399237.jpg","description":"Film your friends doing scary things to become SpöökTube famous! (strongly advised to not go alone).","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"Philip","platforms":[{"id":0,"name":"PC"}]},{"id":372505,"name":"Fun with Ragdolls: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/40e/40ea697111d25caba66564b71f7aecf7.jpg","description":"ObjectiveYou're a ragdoll! What's the point of the game? Do what a ragdoll be meant to do and flop, fall, or crash on to things and get points by doing so! Don't be nervous!Game ModesSandbox\nBuild worlds for you and your ragdolls! Choose from a collection of canons, black holes, giant fans, ragdolls (obviously), explosives, lasers, and much more!\nMini-Games\nThey're basically mini-adventures that you can win and lose from!\nExplorer\nOut of ideas for what to build? Want to dive right in without having to create from scratch? Explorer offers pre-built environments!CustomizationChange the look of your ragdoll from an assortment of skins and faces that you can unlock as you progress through the game!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Jadon Barnes","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":292080,"name":"Backbone: Prologue","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db6/db681cf969d69f68872914fc6d40eb8f.jpg","description":"ADD FULL GAME TO YOUR WISHLISThttps://store.steampowered.com/app/865610/Backbone/\nAbout the GameBackbone: Prologue is the first chapter in an upcoming noir-inspired detective adventure. Step into the shoes of anthropomorphic raccoon and private eye, Howard Lotor, and explore the beautifully rendered 2.5D pixel art environments of dystopian Vancouver.\nHoward Lotor is experienced and self-assured, but finds himself caught in the tedium of quotidian life. Most of the cases he works on are unremarkable domestic disputes. Odette Green’s case probably won’t be any different.\nBackbone's gameplay is a new take on point-and-click adventure, featuring smell-based stealth mechanics and extensive branching dialogues reminiscent of classic CRPGs. As Howard, you must traverse the different districts of a now walled-off Vancouver to sniff out clues, collect evidence, interrogate witnesses, choose which leads to follow, and unravel The City’s secrets.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"EggNut","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58209,"name":"Dwarf Fortress","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b20/b20a30ae9d910d948a24ca234eb4553d.jpg","description":"Prepare for the deepest, most intricate simulation of a world that has ever been created.\nNot just generated geometry -- a whole simulated world. Generated rise and fall of civilizations, personalities, creatures, cultures, etc. Infinite hours of gameplay.\nNow with graphics! (Optional ASCII mode available.)\nSteam Workshop integration for easier modding\nA lifetime “living” project - created/updated since 2003, with no end in sight\nGenerate your unique world and manage a bustling colony of dwarves, even as they probably mine towards their eventual demise.\nOptional ADVENTURER MODE: explore the generated world as a single hero in an RPG\nOptional LEGENDS MODE: read the history of the generated world and your games in it\nA new endless hobby, just for you!\nThe legendary Dwarf Fortress is now on Steam! Build a fortress and try to help your dwarves survive, despite threats of starvation, dragons, and madness.\nIn this complex construction/management/roguelike simulation, every generated world brings a unique challenge, whether it’s dwarves with their own simulated personalities or aquifers. Observe what makes your civilization fall into eventual decline, and learn for next time… until something else inevitably goes wrong.\nThe combat model includes skills, body parts, material properties, aimed attacks, wrestling, pain, nausea, various poison effects, and much more.\nIt’s difficult to convey the depth of the generation. Hundreds of animals and monsters, many of which are randomly created for each world, as well as generated poetry, musical forms, instruments, and dances for your dwarves to practice and perform. A dynamic weather model tracks wind, humidity, and air masses to create fronts, clouds, storms, and blizzards. Over two hundred rock and mineral types can appear, in their proper geological environments.\nYour purchase includes Dwarf Fortress Classic if you prefer to play without graphics or music or Steam-specific features, in the “classic” beta branch.\nRemember: Losing is fun!\nNothing substantial is new or changed, under the hood. It’s still good old Dwarf Fortress, but with graphics support and music by default. A few bells and whistles won’t change that.\nYou may already be familiar with the tile set mod packs from Michał “Mayday” Madej and Patrick Martin “Meph” Schroeder. They’re collaborating on an all-new, from-scratch tileset, as seen in the trailer and screenshots. Meanwhile, Dabu has composed a few musical tracks, to match the seasons, and some other audio bits and pieces.\nCommand your dwarves as they search for wealth in their generated mountain. Your dwarves will need a steady supply of food and beer, but they’ll also need your guidance in surviving attacks from hostile civilizations, the wilderness, or even the dead.\nCraft treasures and furnitures from various materials\nEstablish a barony and support the increasingly demanding nobility\nRead your dwarves’ thoughts to keep them happy\nBuild floodgates to divert water for farming, and/or prevent magma mishaps\nBuild structures and watch your dwarves discover and build their culture, like taverns, libraries, temples, honey, wax, pottery, animal training, bookbinding, and more.\nChoose a sentient race from your generated world (usually dwarf, human, or elf, but potentially goblin or animal person) and quest for glory.. Or seek vengeance.\nRecruit people to join you on your journey\nExplore without cumbersome plot restrictions, from capitals to catacombs, labyrinths to bandit camps.\nThe original nemesis system: Meet adversaries from the previous games\nEarn a reputation as a hero, soldier, thug, musician, etc, with various civilizations\nStealth system with vision arcs, respecting vegetation density and other factors\nUse signs like shoe impressions and animal tracks to hunt and avoid danger\nSteal a mummy’s treasure or learn forbidden secrets from a necromancer’s tower\nVisit your retired fortresses and meet your old dwarves -- even ask them to join you!\nThe original inspiration for RimWorld, Prison Architect, Minecraft and more.\nOne of the first video games acquired by the Museum of Modern Art in New York\nUpdated for over 16 years by two brothers, Tarn “Toady One” and Zach “Threetoe” Adams\nWith the goal of simulating all of existence, Bay 12 estimates they’re only about 42% done.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Bay 12 Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20995,"name":"GunZ 2: The Second Duel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b3b/b3bafd722b820cae07ad83d5e2b032a0.jpg","description":"GunZ 2: the Second DuelRediscovery of action shooting! We present to you GunZ 2: the Second Duel. GunZ 2 is an online action shooting game. GunZ 2 provides a whole new user experience that players have never seen from other games.Key FeaturesCompletely unique action gameplay\nIn this game, there is no limit on how players move. In GunZ 2: the Second Duel, a wall is not an obstacle yet another path that provide tactical advantages. You no longer have to hide behind walls when you encounter your enemies. You can rather climb up the walls around you to take higher ground or move into enemies’ blind spot to launch vigorous assault.\nUnique classes with various tactics and strategies\nIt’s absolutely up to players to choose which class to play. Unique classes are fitted with its own Passive and Active skills. Become a silent assassin wielding a long katana, roam around in the battle ground freely with a giant shield, or burn enemies with flame-thrower. The choice is completely up to you. (3 classes will be available at launch, more classes will be continuously be added)\nWeapons… More Weapons!\nIn GunZ 2: the Second Duel, you can choose from 200 different weapons sorted into 13 different categories. Especially unlike conventional FPS games, GunZ 2 provides unique melee weapons which bring maximum strategic variety. Each class has its own ultimate skill that can dramatically rescue a friendly unit from danger.\nSave the day with friends!\nPlay Campaign Mode to fight against the notorious mega corporation with super-national power. Fight against the enemies with action you can experience only in GunZ 2: the Second Duel.\nYet, it’s available for beginners!\nEven though it is fitted with such powerful action, maneuvering your character in GunZ 2: the Second Duel is extremely easy. To run on walls, simply point your cross-hair to the desired direction and tap on the jump key rhythmically. Such simply control makes up incredible fast-paced stylish action.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Masangsoft","platforms":[{"id":0,"name":"PC"}]}]