[{"id":2784,"name":"The Bridge","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5a3/5a36930b16d9b1949d8c8c92b5a28d89.jpg","description":"The goal of the game is to pass level by level, finding an exit from each to the next. The difficulty, the challenge and at the same time the solution is that the levels are designed in the world of drawings by M. C. Escher. Top, bottom, right, left, floor, ceiling, stairs and walls are not in their usual places, not fixed and pass into each other quite differently than in the real world. However, the solution is sought precisely by turning over, rotating and other unusual, impossible actions with all this.\n\n48 puzzles await the hero throughout the game. Each puzzle has its own unique solution.\n\nAfter the hero passes the main story of the game, its alternative version will open. Alternative version includes alternative versions of half of the puzzles, 24 pieces. And, accordingly, 24 variants of the end of the game.\nDuring the game, you can step back and change the decision - so you can not be upset if an error has been committed.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"The Quantum Astrophysicists Guild","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Wii U"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":8278,"name":"Gears of War 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/079/079175933a50b2bf202edd6aa17be19c.jpg","description":"Gears of War 4 is a third-person shooter, a follower of Gears of War 3, set 25 years after its events. The game combines classic shooter mechanics with tactical elements and changing weather conditions that directly affect the gameplay. \n\nThe story is set on Sera planet where humanity survives one threat after another. The peace reached after the war with Locust didn’t last for long. The Coalition, the ruling force, is confronted by Outsiders who claim the current order to be a military dictatorship. You take on the role of J.D. Fenix, Marcus Fenix’s son as he joins Outsiders and helps them in their struggle.\n\nIn its core Gears of War 4 is a position shooter with a cover system and quick shifting to melee combat. The number of enemies, their specifications and upgraded AI bring tactical elements to the game, as you need to plan your strategy during fights. The campaign rotates intense battles, kind of tower defense missions and exploration, making the action dynamic and involving.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"The Coalition","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":274767,"name":"Far Cry New Dawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d2/6d27cf9c22f2b28cf3ae706464d138f9.jpg","description":"Dive into a transformed vibrant post-apocalyptic Hope County, Montana, 17 years after a global nuclear catastrophe.\r\nJoin fellow survivors and lead the fight against the dangerous new threat the Highwaymen, and their ruthless leaders The Twins, as they seek to take over the last remaining resources. \r\n\r\nFIGHT FOR SURVIVAL IN A POST-APOCALYPTIC WORLD\r\n• Take up arms on your own or with a friend in two player co-op in an unpredictable and transformed world\r\n\r\nCOLLIDE AGAINST TWO ALL NEW VILLAINS\r\n• Recruit an eclectic cast of Guns and Fangs for Hire and form alliances to fight by your side against the Highwaymen's unruly leaders The Twins\r\n\r\nBUILD UP YOUR HOMEBASE AND THE SURVIVORS\r\n• Recruit Specialists to upgrade your homebase, who will help unlock all new features including crafting weapons, gear and more\r\n\r\nBATTLE FOR RESOURCES IN HOPE COUNTY AND BEYOND\r\n• Engage the Highwaymen in Turf Wars and venture on Expeditions to memorable locations across the USA","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":28156,"name":"Tacoma","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/256/256a3188c2907eff4d7721ce044df5d7.jpg","description":"Tacoma is an indie adventure game developed by Fullbright.\n\n###Story\nIn 2088, corporations heavily influence social life. These conglomerates are the pioneers of space travel, space construction, and artificial intelligence development. The economy promoting loyalty to a select corporation is established. \n\nThe game takes place on the Tacoma space station. It serves as a transit hub between Earth and a resort built upon Moon. Amy Ferrier is hired by the corporation that operates the station to investigate a mysterious chain of events occurred on the station and to retrieve a processing module from the station's artificial intelligence. Upon her arrival, Amy begins to find out what's going on using Tacoma's augmented reality system.\n\n###Gameplay\nTacoma focuses on the in-game world's exploration. There are no enemies present in the game, so the players can focus on the narrative aspect of it. \n\nThe players utilize an augmented reality device found on the station to access its security footage and recreate the events that happened here. It is possible to manipulate the footage like a recording, fast-forwarding it, pausing and rewinding. The players can see the characters move from room to room, or in some cases follow the character's path. One of the main game's aspects is its puzzles, as it is the main thing the players will be doing for most of the time.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Fullbright","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":455532,"name":"Star Wars: Squadrons","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b19/b191ff2b8ccb646d1d2d9297ed5c7e89.jpg","description":"Master the art of starfighter combat in the authentic piloting experience STAR WARS™: Squadrons. Buckle up and feel the adrenaline of first-person, multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic and Imperial fleets and fight in strategic 5v5 space battles. Modify your starfighter, and adjust the composition of your squadron to suit varying playstyles and crush the opposition. Pilots will triumph as a team and complete tactical objectives across known and never-before-seen battlefields, including the gas giant of Yavin Prime and the shattered moon of Galitan. Take control of starfighters such as the X-wing and TIE fighter. Customize loadouts and cosmetics. Divert power between weapons, shields, and engines while immersing yourself in the cockpit. In addition, players will have the option to play the entirety of the game in virtual reality (VR)!\r\n\r\nLive your STAR WARS pilot fantasy\r\n\r\nThe cockpit is your home. Use its dashboards to your advantage and — with just a thin hull of metal and glass between you and the perils of space — feel the intensity of combat from a first-person perspective. Take off in thrilling multiplayer modes and a unique single-player STAR WARS story. Immerse yourself in the pilot’s seat completely with the option to play the entirety of STAR WARS: Squadrons in VR.\r\n\r\nSTAR WARS™ single-player story — Learn what it means to be a pilot after the events of Return of the Jedi. Seen from alternating perspectives between 2 factions, iconic and emerging leaders on both sides are battling for the galaxy. The New Republic fights for freedom. The Empire demands order. We need you to join the galaxy’s finest.\r\n\r\nAll wings report in — Plan skirmishes with your squadron in the briefing room before taking off to the evolving battlefields across the galaxy. Compete in intense 5v5 multiplayer dogfights, or unite with your squadron to tip the scales in monumental fleet battles. Together, you’re the galaxy’s finest.\r\n\r\nMaster legendary starfighters — Take control of different classes of starfighters from both the New Republic and Imperial fleets — including the agile A-wing and the devastating TIE bomber. Modify your ship, divert the power between its systems, and destroy your opponents in strategic space dogfights.\r\n\r\nThe mission is clear — STAR WARS: Squadrons is a fully self-contained experience from day one, where you earn rewards through play. Climb the ranks and unlock new components like weapons, hulls, engines, shields, and cosmetic items in a clear path for progression that keeps gameplay fresh and engaging.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":311,"name":"Sunless Sea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c32/c323f9c17ac95c363772bb9ff3693dc6.jpg","description":"###The help from Kickstarter backers\nThis is a role-playing game with roguelike elements from the independent British studio Failbetter Games. The money was collected on Kickstarter, just 4 271 backers supported the game, and donated a little over a hundred thousand pounds to its development. The game is available for solo completion on PC, Mac, and Linux.\n\n###Story and setting\nThe player tries on the role of the captain of the ship. Captain's backstory is fully customizable. The game is a spin-off for the browser game Fallen London from the same developers: the action takes place in the same universe and at the same time. The game mixes the Victorian era and the mystical atmosphere of Lovecraft's books. The player sails between different islands of the underground sea, facing different dangers. To win, you need to achieve a certain goal: for example, to find a treasure or to gain the title of the most famous seafarer by transporting goods and opening new lands.\n\n###Key Features\nDeath is permanent in the game - the player starts all over again after each defeat. Developers have added the ability to inherit some of the property or team of the predecessor. The game world is randomly generated, although the location of the main ports and islands remains unchanged.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Failbetter Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":194,"name":"Styx: Shards of Darkness","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b43/b43c8d475172bf6cbeeba1153ea569d5.jpg","description":"Twitch Dev Session\nAbout the GameStyx returns in a new stealth adventure!\nExplore and master huge open environments, sneak past or assassinate new enemies and bosses, and experiment with the new array of lethal abilities and weapons in our goblin assassin's arsenal.\nSneak your way alone, or with a friend in coop mode! Climb the dizzying Elven city, traverse the perilous territory of the Dwarfs, and survive vast unexplored lands filled with lethal dangers to fulfill your mission… failure to succeed could have huge consequences for your kin.\nClimb, swing, and hang through multi-layered sandbox environments brought to life with Unreal Engine 4. Creep and hide in the darkest corners, or reach heights to avoid detection. Spend experience points in assassination, infiltration, magic, etc. to learn new skills and abilities. Explore the world to recover valuable artifacts, find ingredients to craft deadly traps and useful items, and create clones of yourself to distract and deceive the many types of enemies on your way - the choice is yours!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":52330,"name":"The Council","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/123/123e035701a975f5d96c233f4048eed2.jpg","description":"The Complete Season of The Council grants you access to all 5 episodes.\nThe Council is an episodic game like no other. Delivering a fresh new take on the Narrative Adventure, your choices and character growth truly matter. Make hard-hitting decisions, but also develop an array of skills to directly impact how the story unfolds. With permanent, long-lasting consequences, there is no going back. Plunge into a tale of intrigue and manipulation in the style of a classic murder mystery, living with a cast of alluring characters each hiding their own dark secrets. Trust no one while uncovering dire truths – no matter the cost to mind and body.\nThe Council begins in 1793, with players taking the role of secret society member Louis de Richet after his invitation to a private island off the shores of England by the enigmatic Lord Mortimer. Joining him are a number of high profile guests, including Napoleon Bonaparte and President of the newly-formed United States of America, George Washington. The strange nature of this private reception goes beyond just the prestigious guests –Richet’s own mother has recently gone missing on the island, while each and every one of the colorful cast seems to have their own hidden agendas.\nIn a new twist for the genre, the core of The Council’s gameplay comes from manipulating and maneuvering through character encounters using the unique Social Influence system. During confrontations, skills and limited resources can be used to gain the upper hand and achieve the desired outcome. Players will be rewarded for their knowledge of each character’s psychological vulnerabilities and immunities, as well as their preparations made during prior exploration and investigation. Failing an encounter does not mean ‘game over’, and no action can be taken back. The consequences are permanent, and may result in persistent physical disfigurements or mental traits that help or hinder the rest of the player’s adventure.\nRichet’s numerous skills can be developed to align with your chosen approach to the adventure. Solve issues with diplomacy, delve into occultism to expand your historical and scientific knowledge, or play detective and see what others do not perceive. Your skills will have uses that extend far beyond your conversations with fellow guests. With 15 diverse skills to use and invest in, players are free to uncover The Council’s mysteries how they see fit, with wildly varying consequences depending on their methods. The results will forever alter the life of Louis de Richet, of those around him, and shape history as we know it.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Big Bad Wolf","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":44510,"name":"The Escapists 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f6/8f69fbc424a579cbdb4b3199ab6c262a.jpg","description":"The Ultimate Prison Sandbox!\nRisk it all to breakout from the toughest prisons in the world. Explore the biggest prisons yet, with multiple floors, roofs, vents and underground tunnels.\nYou’ll have to live by the prison rules, attending roll call, doing prison jobs and following strict routines; all the while secretly engineering your bid for freedom!\nYour prison escape antics will take you from the frosty Fort Tundra, a train hurtling through the desert, and even to the final frontier!Escape Team Assemble!\nUnite with up to 3 friends to create the ultimate escape crew and engineer the wildest escapes yet! Jump online or gather round on a couch to prepare for your sneaky adventures. By working together you’ll be able to create even more elaborate and daring plans.\nFeeling competitive? Dive into the versus mode and show that you’ve got the skills to break out of any prison faster than your friends can. If all else fails, settle your rivalry in the court yard with a prison punch up!Create YOUR Con!\nIt’s time to make your prisoner truly yours. Choose from a massive array of customisations to make your character unique to you. It’s important to look stylish whilst you mastermind your escape.Craft your Escape!\nBeing in prison forces you to be creative and work with the limited tools at your disposal. You’ll have to combine everyday objects like soap and socks to craft new weapons and tools to help you achieve your goal. Steal forks from the cafeteria to chip a tunnel in your room, and craft a poster from magazines and duct tape to hide the evidence. You’ll soon learn that duct tape solves (almost) everything!Prepare for a fight!\nThe Escapists 2 introduces a brand new combat system to make every prison brawl more exciting and interactive. You’ll have to block and tie together chains of attacks whilst strafing around your locked on targets to gain the upper hand in combat. Make sure your visit the gym first to build up those muscles!New ways to escape!\nAs the prisons get tougher you’re going to have to get more creative with your escape plans. There’s a ton of options to tackle almost any prison escape.Features10 Prisons\nUp to 4 player co-operative and versus multiplayer\nDrop-in/ Drop-out Online/Splitscreen multiplayer\nOver 300 customisations\nMulti-storey Prisons","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19166,"name":"System Shock (1994)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/202/20253cf9a7bd4f3ddb26bf68cf9117ba.jpg","description":"A first-person fight to the death in the depths of space.\nYou're a renowned hacker, the most notorious cyberspace thief in the corporate world. Caught during a risky break-in, you become indentured to Diego, a greedy Trioptium exec who bankrolls a rare cyberjack implant operation. After six months in a healing coma, you awaken to the twisted aftermath of a terrible disaster. Where are the surgeons? Why is the station in such disrepair? Slowly, the chilling realization that something is very wrong creeps over you.\nOnce a prime corporate research facility, Citadel now teems with mindless cyborgs, robots and terribly mutated beings, all programmed to serve SHODAN, a ruthless A.I. There's scarcely time to think before it unleashes the first terror...\nTwenty one years after its first release, System Shock is back!\nThe Enhanced Edition adds a modern touch to this true classic gem, without taking anything from its unmistakable atmosphere.\nSee for yourself that the game that has been called the benchmark for intelligent first-person gaming, has lost nothing of its ability to keep you on the edge of your seat.\nSystem Shock: Enhanced Edition features:\nHigher resolution support: up to 1024x768, and 854x480 widescreen mode.\nMouselook support added.\nRemappable keys with three profiles to choose from: original controls, custom controls, and lefthanded controls.\nSome original game bugs fixed.\nGameplay features:\nRocket through cyberspace to steal information, hack security and grapple with watchdog defense programs enslaved to a maniacal computer.\nSurvive battle after battle against armies of killer cyborgs and deadly robots as you collect hardware attachments, life-sustaining patches and deadly weapons to combat mindless mutants.\nTest your intelligence by solving puzzles, rewiring access panels and outwitting SHODAN in its own cyber-realm.\nEnjoy the vastly improved controls and graphics of the Enhanced Edition - or keep your experience as close to the original as possible with the Classic version.\nIncluded Extras located in your Steam\\SteamApps\\common\\SS1EE\\Bonus Content folder!\nEnhanced Edition Quick Start Guide\nOriginal Manual (English, German, French)\nGame Maps\nI.C.E. BREAKER - Official Origin Hint Book\nSystem Shock - Strategies & Secrets - Strategy Guide\nOST - (Midi, MP3, FLAC)\nTV Commercial","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Nightdive Studios","platforms":[{"id":0,"name":"PC"}]},{"id":2592,"name":"DuckTales: Remastered","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/36d/36dbcc51d45ae1105c7cb744a5fa6e2a.jpg","description":"DuckTales Remastered is a platforming game developed by Capcom. It is the reboot of the original DuckTales released on NES.\n\nAfter The Beagle Boys go after Scrooge's money once again, a mysterious painting was found by Big Time Beagle and was left at Scrooge's manor. The painting reveals the five treasures and Scrooge sets out to find them.\n\nDuckTales Remastered is a 2.5-dimensional game. The character sprites are 2D and are hand-drawn while the levels are 3D modeled. The gameplay resembles the same of the original game. The players control Scrooge on his quest to find the treasures around the world. The duck defends himself by swinging his cane or jumping on objects with it like a pogo stick. Various diamonds and coins are scattered across the levels. The character's health is restored using various candy.\n\nThe game features five levels from the original game which were greatly expanded. It is up to the player to define in which order to play all of the levels. In every level, the player has to complete a certain objective and defeat a unique boss.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"WayForward Technologies","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":2666,"name":"Mini Metro","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c49/c4983df94a8a8167d652b812de742da8.jpg","description":"Mini Metro is an indie puzzle strategy game about building a rail transit network. You have to provide transport in continually growing cities by building stations, railways and disposing of trains. The number of passengers continually increases, and once any of the stations reaches its capacity limit, the game is over. With each in-game week, you get new trains and upgrades that allow you to upgrade stations capacity or give you additional tunnels, rail lines or train carriages.  \nEvery level in Mini Metro is based on the real city. Some of them have their unique features like high-speed Shinkansen trains in the Tokyo level. The game is notable for its minimalistic art-style. Almost every element on the level is made of simple shapes and bold colors. The different shapes represent different stations and passenger’s destinations. This style was chosen so it can imitate the real-life railway mar schemes.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Playdigious","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":12760,"name":"Warhammer 40,000: Dawn of War II Chaos Rising","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6f3/6f3855fc42784a7da7bdc4cf325b0d30.jpg","description":"Warhammer 40,000: Dawn of War II Chaos Rising is the second expansion of Warhammer 40,000: Dawn of War II. It offers new characters Chaos Space Marines and adds new units to all other races. The game takes place in the Blood Ravens work which is in Aurelia. It seems, that Aurelia was lost to the Warp a long time ago, but now it has reappeared. 10 years have passed since the events of Dawn of War II, in invasion of Tyranid is already defeated and Blood Raven heroes from the previous game have returned as well as Chaos Lord Eliphas, Derona and Vandis.\nThe game for the first time presented the Corruption System. Through multiple objectives during missions, player decides how much corrupted he wants to be. Too much corruption will lead into becoming Chaos, which will lead into betraying the Imperium of man. This choice will affect one of the several games’ ending. \nAlso, Chaos Rising offers two new environments for players to explore. Three environments from the previous game didn’t disappear so with Chaos Rising players have an opportunity to explore five different locations.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":3336,"name":"Project CARS","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/05a/05a6ca96307b25626d1af5607a8c96a8.jpg","description":"With the help of original technical solutions, the game manages to offer a fully dynamic SETA model of tires, as well as a system of dynamic day and weather change. The player feels how the car adjusts the behavior depending on the work of braking assistance or stability control.\n\nThe game has more than 110 cars, their number is constantly growing. Each car has its distinct characteristics, in its own way behaves on the road. The game has about forty race tracks, and if you consider different configurations, you can count 110 variants of routes. Before the game you can set up the AI, controlling all the circumstances on the track, according to a variety of different criteria. Similarly, AI can be configured and in terms of management of other cars - what kind of rivals do you want to see around you?","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Slightly Mad Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":10346,"name":"Fistful of Frags","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2d/d2da7735c7f8a2a765c4649a650e2c30.jpg","description":"Fistful of Frags is a western-themed modification created on the Source engine. This is the same engine that was used by Valve for their hits like Half-Life and Team Fortress 2. The game started as a Half-Life mode but was renewed and re-released in 2014. The name of the game is a pun on Sergio Leone's famous western movie A Fistful of Dollars.\n\n###Weapons\nThe game offers a variety of XIX century weapons. In Fistful of Frags, there are five weapon classes (melee, pistols, rifles, shotguns, and special) and several weapon tiers. The lowest tier is Starter Weapons, the ones the player gets when he or she spawns. There are Blue, Red, and Gold weapons that the player can find in the chests of the respective color. Different weapons allow different actions, such as dual wielding or throwing. There's a weight limit that doesn't allow the player to carry too many weapons at once. The way the player obtains the weapons strongly depends on the mode.\n\n###Game modes\nFistful of Frags includes multiple game modes, both single and multiplayer, cooperative and competitive. In the Team Shootout mode, the players are divided into 4 or 2 teams and eliminate each other trying to get the most frags. When spawning, the player can obtain additional weapons, spending his or her \"stars\". Break Bad mode is similar, but the goal of each team is to gather more money. The guns are also purchased with the in-game money. There are also Versus, Elimination, Shootout, and Teamplay modes.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Fistful of Frags Team","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1165,"name":"SteamWorld Heist","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e49/e49256363789d1dec316edf8ebb27ccf.jpg","description":"Steamworld Heist is a pirate-themed turn-based strategy with shooter and platformer elements. You take on the role of a pirate captain, Piper, as she recruits robots and leads them through space to capture enemy ships. The game has a side-scrolling perspective, and most levels are procedurally generated.\n\nThe main resource in the game’s universe is water, and all power try to get it. But unexpectedly one more side appears in this conflict: aggressive steambots that attack people. Only Piper can find out what’s happening and save the world.\n\nTo fulfill your mission, you need to form a team of robots to fight by your side. There’s a huge variety of potential crew members that can be found in different parts of the galaxy. To recruit them you spend water or reputation points you get completing missions. Every soldier has unique abilities and specialization that upgrade through the game. Battles are made in a classical turn-based manner with a realistic physics model that features ricochets, laser sights and bomb throwing.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Image & Form","platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":4125,"name":"Crysis 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1c6/1c61ef4ce04bce876841118580b03ccb.jpg","description":"A game that began life as a tech demo, but became a meme instead. The question \"But can it run Crysis?\" is the true measurement of PC power. Designed by the German studio Crytek Crysis 3 continues the story begun in the second part.\n\nThe year is 2047, New York, where evil corporation CELL built Nanodome on top of the city and turned the metropolis into a real jungle. In addition to mundane enemies, the alien race of Ceph threatens humanity who pursues its goals. The player gains control of Prophet - a soldier in nano suit, whose primary goal is to stop the leader of the alien race.\n\nTurning into a jungle landscape one of the most recognizable cities in the world, allowed developers to diversify the gameplay. Together with the nano suit, they transformed the classic first-person shooter into a vast fast-paced sandbox. It depends solely on the player how to complete each level. In addition to a solo story campaign, the game has a multiplayer with 8 modes and 12 maps.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":324992,"name":"Watch Dogs: Legion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/415/41563ce6cb061a210160687a4e5d39f6.jpg","description":"In Watch Dogs Legion, you get to build a resistance from virtually anyone you see as you hack, infiltrate, and fight to take back a near-future London that is facing its downfall, courtesy of state surveillance, private military, and organized crime.\n\nRecruit a well-rounded team to overthrow the wankers ruining this once-great city. The fate of London lies with you.\n\nEach character has their own backstory, personality, and skill set—all of which comes into play as you personalize your team. Swap between characters as you explore an open world online with friends. Enjoy free updates of new modes, rewards, and themed events.\n\nExplore a massive urban open world and visit London’s many famous landmarks – including Trafalgar Square, Big Ben, Tower Bridge, Camden, Piccadilly Circus, or the London Eye.\n\nWelcome to the Resistance.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":16344,"name":"Sanctum","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/486/4867553de7f93ab572102c47570a9050.jpg","description":"An experimental game that tries to combine first-person shooters and tower defense genres. Players take control of the elite soldier Skye, who was sent to defend her hometown from a crowd of unknown alien-monsters.\n\nAt the beginning of each map, the player has time to place the attacking towers and build a maze along which hostile creatures will move. The main task is to protect the core, which can withstand a small amount of damage.\n\nThere are 8 types of the tower, which differ in functionality: attack towers, towers-teleports, and towers, which affect the characteristics of enemies. Also, the player can inflict damage with his weapon. there are 10 types of enemies in the game, 3 of which are and will require a special tower to defeat. At the end of each mission, a “fat” enemy appears on the map - the boss, which deals more damage to the core and which is harder to beat. Multiplayer is not available in this installment of the series.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Coffee Stain Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10606,"name":"Mirage: Arcane Warfare","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bb6/bb69662c8fb265e790d07039dd30066c.jpg","description":"Multiplayer adventure from Torn Banner Studios was released in May 2017.\n\nThe main gameplay mechanic of the game is a team multiplayer shooter from the first person perspective. The main bet was on melee fighting and the magical abilities of the characters. Players could choose from six classes that differed in skills and roles in the game. There are several modes available in the game: deathmatch and various mission options such as Capture the Flag and “Payload” modes.\n\nThe game was available for pre-order on Steam back in 2017 and for the year of its existence, it managed to attract about one million players but never found its core audience despite multiple positive reviews from the press. It was removed in May 2018 from public access due to the inability to comply with the GDPR policy. The Developers confirmed that they ran out of options to keep the game alive and they do not plan to return to it.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Torn Banner Studios","platforms":[{"id":0,"name":"PC"}]},{"id":366881,"name":"Little Nightmares II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2a/c2a7dc4540eb79aaff7099ae691105d3.jpg","description":"Return to the world of charming horror that has terrified over 1 million fans. Face a completely new set of distorted enemies as Mono, and learn how to be as courageous as a child.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Tarsier Studios","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":35086,"name":"KAO the Kangaroo: Round 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/83a/83af36d8924271087360d142d34f0960.jpg","description":"Play as Kao! The cutest and bravest kangaroo of all video games returns in this digital version of “Kao the Kangaroo: Round 2.\"\nExperience the joy of playing a classic 3D single-player platformer filled with various challenges, including fighting, racing and solving puzzles.\nBounce through 25 levels set in 5 unique, colorful worlds to rescue your animal friends captured by the evil Hunter and his henchmen!\nExperience the digital version of a classic 3D arcade platformer with online features like:\n* Steam achievements\n* Steam cloud saving\n* High resolution support\n* Controller support (Xbox 360/ One and PS4)\n* Bounce through 25 levels set in 5 unique, colorful worlds\n* Punch the baddies! Use a variety of different fighting techniques to rescue your friends\n* Approximately 30 challenging enemies to defeat\n* Boss encounters\nThe digital version of Kao the Kangaroo is a nostalgic journey to the past for all players who grew up with the classic platformers. This is a fun, educational experience – enjoy vintage gameplay on this classic 3D arcade game.\nOnce you add it to your library, it will never leave.\nThe opportunity to play this classic version of Kao the Kangaroo was made possible by all of the engagement and requests from our loyal Kao fans. These wonderful players came together under #BringKaoBack and asked us to release Kao digitally.\nThis moved us deeply, and we decided to grant their request and release the game as our way of saying “Thank you for being with Kao for the last 2 decades.” We also want to thank you for your interest in our game, since you are here on our product page.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Tate Multimedia","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":15713,"name":"Chaos on Deponia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6bc/6bc337100b6f6b7afb638bc0806c0b6d.jpg","description":"The second game in the Deponia series is set in a whimsically cartoonish future world and is defined by its emphasis on characters and humor. Once again, the player controls Rufus, a selfish yet loveable rogue, who tries to leave his home planet Deponia and move to the luxurious space station Elysium. His cyborg girlfriend Goal got into trouble because of Rufus’s faults, and he has to save her. The plot, character interactions, and many jokes rely on the assumption that the player is already familiar with most characters from Deponia. However, in case you didn’t play the original game, there’s an introduction to familiarize you.\nChaos on Deponia uses point-and-click controls, which are usually better suited for mouses and keyboards. However, the developers claim to make sure that playing with a console’s controller is just as fluid and natural. The analog stick stands in for the mouse, while the buttons control various actions Rufus can do to objects and other characters. Like in most adventure games, the protagonist has to use various items to solve puzzles. Those are quite complex right from the start, and there’s no growing difficulty over the course of Chaos on Deponia.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":19409,"name":"Operation Flashpoint: Dragon Rising","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd8/cd89ed5083a6cca9c2768ebca7a73b2d.jpg","description":"Dragon Rising is the second installment of Operation Flashpoint series, though its plot bears no connection to the previous game. The game is set on Skira, a fictional Northern Pacific island with huge oil reserves. China annexed the island, provoking a military conflict with Russia and the US. Skira’s landscape is thoroughly modeled after a real-life Kiska island in Russia. \nThe player assumes the role of a leader in a squad of four US soldiers, three of which are AI-controlled. In the single-player campaign, they perform a series of military operations against the Chinese army. The gameplay tries to authentically simulate the real warfare, with no checkpoints and few scripted scenes. Depending on the difficulty level, the player may even lack the traditional HUD indications of health, ammo, and directions. The player will have to march long distances through the 35 km wide Skira, which may feel like a slog, but also adds to the game’s realism.\nThere are many multiplayer modes in Operation Flashpoint: Dragon Rising. The players can assume the roles of the remaining three soldiers to play through the main campaign. There's also a local PvP mode and a couple of traditional online multiplayer modes.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Codemasters","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":29236,"name":"Tunic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2c1/2c1984e128ac48b89953ed4de4904a3b.jpg","description":"Explore a land filled with lost legends, ancient powers, and ferocious monsters in TUNIC, an isometric action game about a small fox on a big adventure. Stranded on a mysterious beach, armed with only your own curiosity, you will confront colossal beasts, collect strange and powerful items, and unravel long-lost secrets.\n\nExplore a hostile and intricately-connected world of shady forests, sprawling ruins, and labyrinthine catacombs\nFight mighty bosses deep beneath the earth, high above the clouds, and in places stranger still\nCollect the missing manual pages, bursting with hints and original full-colour illustrations\nDiscover hidden treasures to help you on your way\nUnearth secret relics, secret techniques, secret puzzles, and… listen, there’s a lot of secrets!\nFeaturing sound design by Power Up Audio (Celeste, Darkest Dungeon, Subnautica: Below Zero)\nAnd an original soundtrack by Lifeformed (Dustforce, Double Fine Adventure)\n\nKeep your wits about you and be brave, little fox!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"ISOMETRICORP Games","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":12323,"name":"Shadowrun: Hong Kong - Extended Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56c/56cdc9d4e29255e4a0d90cb2bce2dc14.jpg","description":"Year 2012. A mutation occurred on Earth. Next to people appear magicians, elves, goblins, gnomes, orcs, dragons. The world has not collapsed, different races have learned to harmoniously interact with each other. Civilization is developing.\n\nHeroes of the game can belong to different races, and within the race - to be different representatives of it. The choice of the hero is done at the beginning of the game.\n\nThe world has come to magic, but crime has not disappeared from it. Heroes are caught in a criminal history. They can get out if they find the father of one of the heroes - in fact, this is the purpose of the game.\n\nHeroes are pursued by police and criminals. In this situation, you can select three game intensity modes.\n\nHeroes pumped skills and abilities. You can even pump etiquette. Pumped etiquette allows you to go through some missions without resistance.\n\nInside the universe, you can move to a level deeper. Diving into the virtual reality of a programmable matrix and solving problems at the program level. At this level, too, there are enemies - malicious programs. The damage incurred in the virtual world will affect the health of the characters.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Harebrained Schemes","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3489,"name":"The Crew","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b79/b797325a14fc62444ca6032d59aa1c75.jpg","description":"The Crew is an online driving simulator developed by Ivory Tower.\n\nAlex Taylor, the brother of a 5-10 motor club founder Dayton, helps his brother run some errands. But it does not go according to plan as Dayton gets killed. Alex is framed for his murder and sent to prison. Five years pass, an FBI agent proposes a deal to Alex. He will be let go if he helps expose a corrupt FBI Special Agent. Alex agrees and sets out to seek revenge.\n\nThe Crew features a vast open world that resembles the scaled down version of the modern United States. The map is divided into five regions each of which features different geography and weather. The game's missions can be played alone or in a player's crew. The game is online-only nonetheless. Apart from the usual races, players can participate in so-called skill challenges. After every mission, the player's score is saved and displayed to all his friends. Online matchmaking allows up to eight players to participate in one race.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ubisoft Reflections","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":10758,"name":"American Truck Simulator","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/135/135a00cf33b0c860fcb366747e95b89b.jpg","description":"Just UpdatedWe've rescaled the whole map from 1:35 to 1:20. Enjoy!\nAbout the GameExperience legendary American trucks and deliver various cargoes across sunny California, sandy Nevada, and the Grand Canyon State of Arizona. American Truck Simulator takes you on a journey through the breathtaking landscapes and widely recognized landmarks around the States.\nGame mechanics are based on the highly successful model from Euro Truck Simulator 2 and have been expanded with new features, creating the most captivating game experience from SCS Software.\nAmerican Truck Simulator puts you in the seat of a driver for hire entering the local freight market, making you work your way up to become an owner-operator, and go on to create one of the largest transportation companies in the United States.Features\nDrive highly detailed truck models officially licensed from iconic truck manufacturers.\nYour truck is your new home. Make it yours by changing cabins, chassis, paintjobs, adding tuning accessories or more powerful engines.\nLots of different cargoes to choose: From food to machinery to hazard cargoes.\nMultiple types of trailers – from reefers to flatbeds, from dumpers to lowboys and goosenecks.\nThe longest trailers (up to 53 ft) will challenge your skills and patience while hauling and during parking.\nDeliver your cargoes to a rich variety of companies and locations like refineries, oil storage, gas stations, car factories, or roadworks.\nVarious simulation settings for trucking enthusiasts: Air brake simulation; different types of brakes: retarder, Jake brake, trailer brake; multiple types of transmissions straight from real trucks, brake intensity, and more.\nFeel like inside a real cabin: Adjust your seat, mirrors and position your head to get the best view of the road.\nDrive safely, follow the rules and speed limits – police will fine you if you aren't careful!\nEnsure that you are not delivering overweight cargo – you may be checked at the weigh scales.\nUse the route adviser as your personal assistant during the travels.\nTry the life of a truck driver for hire. By delivering the cargoes safely and improving your skills, become the owner of your own, successful company!\nBuild your own fleet of trucks, buy garages, hire drivers, manage your company for maximum profits.\nMake your trucking time better by listening to your favorite songs via built-in music player or streaming your favorite radio stations.\nCapture your favorite moments with a photo mode offering rich set of editing options.\nGreat support for steering wheels, gamepads and other input devices.\nLong-time support of the game, including new features.\nObtain challenging Steam achievements and collect all hand-painted Steam trading cards.World of Trucks\nTake advantage of additional features of American Truck Simulator by joining our online community on World of Trucks, our center for virtual truckers all around the world interested in Euro Truck Simulator 2, American Truck Simulator and future SCS Software's truck simulators.\nUse in-game Photo Mode to capture the best moments and share them with thousands of people who love trucks.\nFavorite the images you like the most and return to them anytime in the future.\nDiscuss the screenshots with everyone using World of Trucks.\nSee the best images hand-picked by the game creators in Editor's Pick updated almost every day. Try to get your own screenshot on this list!\nUpload and use your custom avatar and license plate in the game.\nMore features coming soon!\nTo join World of Trucks, simply sign up with your Steam account on the join page. You will need to own American Truck Simulator or Euro Truck Simulator 2 to join World of Trucks.\nWorld of Trucks is an optional service, registration on World of Trucks isn't required to play the game.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"SCS Software","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":58831,"name":"Call of Cthulhu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b8/1b8a3ed646ccea6375bd4d4b7dd67aa4.jpg","description":"Call of Cthulhu: The Official Video Game is a psychological horror game adapted from the 1981 tabletop role-playing game of the same name by Chaosium. It is loosely based on the famous horror story by H. P. Lovecraft and the Cthulhu Mythos universe in general.\n\n###Plot\nThe game is set in 1924 in Massachusetts, USA. The main character is Edward Pierce, a troubled and alcoholic private detective. He was hired to investigate the mysterious fire that destroyed the Hawkins mansion on the Darkwater Island and killed the Hawkins family. Shortly before the fire, the mother of the family drew an image of a weird monster. Pierce's investigation eventually leads him to discover the secret cult of the ancient evil god Cthulhu, who is about to awaken to unleash his rage on Earth. The protagonist faces cosmic horrors, unholy cultists, weird dimensions, and otherworldly creatures that make him question his own sanity.\n\n###Gameplay\nThe player controls Edward Pierce and navigates him across the Darkwater Island. The goal is to investigate the case by talking to other characters, searching for clues and exploring the environment. The protagonist is weak and cannot really fight a strong opponent, so the player has to find the ways to avoid trouble. Another major concern in the game is sanity. Encountering eldritch abominations and uncovering dark secrets can drive Edward insane. His mental state affects the gameplay.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cyanide Studio","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":2925,"name":"Rebel Galaxy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/59f/59f8ff56cde745ceb56029f229ad4e43.jpg","description":"The most reasonable rule of trade: if the goods are from far away – they should cost more. If you apply it to the space trade between the galaxies, you will get Rebel Galaxy, a space trading and combat simulation, created by a small studio of two people. Western style is complemented by licensed blues and country rock music tracks. \nThe universe is randomly generated, and players are taking control of the spacecraft, that can and will be replaced if needed. The game offers numerous activities for players, depending on what they are compelled to do. Salvage what’s left of the spaceship after the battle, mine the asteroids for resources, explore galactic anomalies or befriend aliens and trade with them. Not interested in trade and exploration? Any player can take on bounty hunting contracts or battling pirates. Combat in the Rebel Galaxy uses shooting gallery mechanics: the player and capital ships are restricted by two-dimensional movement, all non-player gunships are capable of maneuvering on X, Y and Z axis. And all that in addition to the story missions.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Double Damage Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":17087,"name":"The Tiny Bang Story","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fb9/fb912e77c4295b0c47af632cd1b48522.jpeg","description":"Life on Tiny Planet was calm and carefree until a great disaster occurred - Tiny Planet was hit by a meteor! The world fell apart and now its future depends only on you! Use your imagination and creativity: in order to restore Tiny Planet and help its inhabitants you will have to fix a variety of machines and mechanisms as well as solve puzzles in each of the five chapters of this game. Navigation is simple and intuitive. It doesn't distract you from the witty brain teasers, and you will be able to fully immerse yourself in the unique atmosphere of the game.\nThere is no text in this game. It is fun for all ages and suitable for the whole family!\nFive vastly different chapters and over 30 exciting brain teasers (minigames)\nA bright, gorgeous world drawn entirely by hand\nAbsorbing game play and simple navigation\n10 enchanting musical themes","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Colibri Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17010,"name":"Kentucky Route Zero","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/177/1775aacedb915b0e0880476530dc87b4.jpg","description":"At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.\n\nKENTUCKY ROUTE ZERO is a magical realist adventure game in five acts, featuring a haunting electronic score, and a suite of hymns and bluegrass standards recorded by The Bedquilt Ramblers. Rendered in a striking visual style that draws as much from theater, film, and experimental electronic art as it does from the history of videogames, this is a story of unpayable debts, abandoned futures, and the human drive to find community.\n\nOriginally published episodically over a span of years, the game now includes all five acts along with the \"interludes,\" which were originally published separately. It has also been painstakingly localized for French, German, Italian, Japanese, Korean, Russian, and Spanish (both European Spanish and Latin American).","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Netflix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":12322,"name":"Emily is Away","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e25/e253cc4df0c2604ec2b12cab8b45d58a.jpg","description":"Emily is Away is an indie-developed visual novel created by Kyle Seeley. \n\n###Plot\nThe game tells the story of the main character relationship with a girl named Emily which lasted for five years and began in the early 2000s. \n\n###Gameplay\nUnlike most visual novels, this game is linear, with the players being unable to influence the plot development severely. The game resembles an online chat using an EOL messaging client running on an operating system that closely resembles Windows XP. There are multiple pop-culture references to the early 2000s era, such as the user profile icons, that resemble multiple old memes (like the Polish Polka), the icons on the main character's desktop that show that he is a fan of 28 Days Later, Lord of The Rings, and Red Hot Chili Peppers. \n\nAs the game goes on, the players are able to change their profile icon according to the tendencies of these years. It is also possible to interact not only with Emily, but also with their classmates, and the main player's friends. The main gameplay revolves around chatting with emilyluv (she will later change her nickname to emerly). You discuss your high school love with her and your classmate Brad that harasses Emily. It turns out that your other classmate, Travis, is planning a party, which the players can choose to attend with Emily or stay at home.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kyle Seeley","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19615,"name":"Crysis Warhead","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e34/e344d4b45f3d393d44cbed087279379c.jpg","description":"Crysis Warhead is a standalone expansion of the original game, following the story and actions of Nomad’s ally – SAS Sergeant Michael “Psycho” Sykes. While the events of original Crysis are taking place, on the opposite side of the island players will have to join a vehicle convoy through the jungle and after the series of violent clashes with North Korean forced, Sykes is getting a new mission, to secure and locate another container, that’s reported to be carrying a nuclear warhead.\nCrysis: Warhead was a showcase of capabilities of CryEngine 2 and was the first game by the Budapest studio of Crytek.  The game is played just like the original crisis, aside from the addition of new weapons that can be fully customized as well. Separate from the story campaign, the game has an additional group of multiplayer modes, titled Crysis Wars. It used to have its own disc, its own installer and was considered a separate game, but it’s still in a bundle with Warhead. Unfortunately, this multiplayer is unavailable, since GameSpy ended all of its gaming services.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Crytek","platforms":[{"id":0,"name":"PC"}]},{"id":22412,"name":"Ultimate Doom","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/601/601a7eb90b02a424090f9a67dbc316d3.jpg","description":"The Ultimate Doom is a standalone expansion pack for Doom developed by id Software. Apart from the base game, it includes a completely new episode that continues the story of the game.\n\n###Plot\nThe game's plot seems loosely connected to the base game as id Software was busy with developing Quake. The simply players set out on a journey to kill off four guardians of hell. This episode serves as a prequel to Doom 2.\n\n###Gameplay\nMinor additions were made to Doom's engine, as it now featured several Doom 2's engine features, such as the ability to use flickering lights and fast working doors. Apart from that, the game is still the base Doom. \n\nPlayers traverse vast levels killing any Hell creature they encounter on their way. A wide range of weapons is as the player's disposal, starting with a brass knuckle and finishing with an experimental energy weapon, BFG9000.\n\nThe one and only objective of the player is to find the exit of the level. Sometimes a keycard is required to unlock the exit. Upon the completion of the level, the player's performance is evaluated and points are accumulated based on how fast did the player pass the level, how ruthless they did it, how many demons got killed and how many secrets were found. \n\nAt the end of each episode, the players will encounter a Boss - a unique and powerful enemy that has to be defeated to complete the level.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"id Software","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Classic Macintosh"}]},{"id":20511,"name":"TrackMania Nations Forever","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/81f/81f0b4cb49329b57b6e949d272d09263.jpg","description":"TrackMania Nations is an arcade-style racing game, the third installment in Nadeo’s TrackMania series. Unlike the other installments in the series, Nations is a free-to-play game that featured in-game advertising as a form of monetization. \n\n###Gameplay \nLike other TrackMania entries, Nations is a racing game with heavy emphasis on player-made content and simplified physics. There is only one car available in the game, which gives every player equal opportunities and accentuates the importance of skill over the right car choice or tuning.\nThe single-player component consists of 100 tracks that gradually get more and more difficult. There is no collision system in the game, so other players or AI opponents do not affect your car’s movement. Depending on the time it took to finish the race, the player gets bronze, silver, or gold medal. Different tracks require a certain amount of medal to unlock. \nEach of the single-player tracks is available for multiplayer alongside the custom tracks that are made with in-game track-editor. \n\n###Forever version \nIn 2008, TrackMania Nations, alongside TrackMania United got free updates with Forever added to their name. The games became network compatible and allowed United owners to play together with Nations players on certain tracks. The Nations’ physics system was updated to match that of United.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Nadeo","platforms":[{"id":0,"name":"PC"}]},{"id":45109,"name":"Maneater","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/895/8951013b8ace2d652727df2f9023cbb8.jpg","description":"Maneater is a Single-Player Action RPG, set in the unforgiving waters of the Gulf Coast. Fight to survive in the open ocean, with danger lurking at every depth. Your only tools are your wits, your jaws, and an uncanny ability to evolve as you feed. Anything and everything is on the menu... kill or be killed.Become a MANEATER\nPlay as a giant Bull Shark and terrorize the coastal waterways.  Tear swimmers and divers limb from limb, give the humans a reason to fear you.Explore a massive open world\nImmerse yourself in a living, breathing world full of threats, and rewards.  Explore sunken wrecks,  lurk in swamps,  or just cruise the open ocean looking for whales to feed on.Deep Stats and Role Playing\nRole-play and customize your shark with a variety of stat driven systems.  Evolve different parts of your body to improve how they function, or pump up your ferocity to enter brief feeding frenzies.Experienced Team\nFrom the minds behind Depth and Killing Floor, our goal as an early access game is to push the feeling of playing as a shark to new heights, developing a strictly single-player experience that will challenge and engage the player from start to finish. Gritty, visceral, heart-pounding action games are our calling.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Blindside Interactive","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"}]},{"id":4724,"name":"Puzzle Agent","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/332/3327c47e0abc76882fc96c434d2e06bd.jpg","description":"When White House inquiries to the Scoggins Eraser Co. are answered only with curious puzzles, Nelson Tethers from the U.S. Department of Puzzle Research is sent on the case.\nThe strange events in Scoggins will challenge every ounce of Tethers’ expertise, and possibly his very wits too, with brainteasers at every turn: mazes, logic puzzles, riddles, and more. He soon realizes that these - along with the clinically pre-occupied townspeople, secret societies, and peculiar sounds from the forest - are intimately connected to the core mystery. And what's with the gnomes?\nCreated with indie comic artist Graham Annable's unique narrative and visual sensibilities, delivered with the distinctive Telltale storytelling style, Puzzle Agent is sure to challenge, thrill and engage in more ways than you can shake a cryptogram at!\nPlentiful puzzles to challenge your neurons. See if you can find every puzzle to solve the mystery of Scoggins -- mazes, logic, riddles, brainteasers and more.\nInvestigate the strange, peculiar and mind-boggling to crack the case! Your discoveries provide clues to the larger mystery crippling the town, or uncover puzzles that must be solved to reveal answers ... or even more questions.\nHunting for Hints: Chewing gum helps Agent Tethers think and solve. Find and collect gum wads around the town to uncover hints if you get \"stuck\" in any puzzles.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5877,"name":"Back to the Future: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e2e/e2eac90903c56886e39d21ac71b958e5.jpg","description":"Marty McFly and Doc Brown return in a completely new Back to the Future adventure. Six months after the events of the third film, the DeLorean Time Machine mysteriously returns to Hill Valley - driverless! Marty must go back in time and get aid from a resistant teenage Emmett Brown, or else the space time continuum will forever be unraveled!\nEpisode 1: It's About Time\nEpisode 2: Get Tannen!\nEpisode 3: Citizen Brown\nEpisode 4: Double Visions\nEpisode 5: OUTATIME - Finale!\nKey Features\t\t\t\t\t\t\t\tSpecial Appearance by Michael J. Fox!\nChristopher Lloyd and Claudia Wells return to voice Doc Brown and Jennifer Parker\nCollaboration with Bob Gale Film, Trilogy Co-Creator/Writer\nBack to the Future’s “first families.” The McFlys, the Browns, and of course, the Tannens – all play key roles.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Telltale Games","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":58325,"name":"Beat Saber","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/90f/90f61894908915eff8455e7b43d466a2.jpg","description":"Beat Saber is a unique VR rhythm game where your goal is to slash the beats (represented by small cubes) as they are coming at you. Every beat indicates which saber you need to use and also the direction you need to match.  All the music is composed to perfectly fit the hand made levels. Our goal is to make players almost dance while cutting the cubes and avoiding obstacles. Each cut is strongly supported by great sound and visual effects to emphasise the rhythm. It features unique gameplay with a great feel - Beat Saber combines the satisfying feeling of cutting with emergent perception of rhythm.\nHandcrafted levels & music - All the basic levels and music in the game will be handcrafted to emphasise the music rhythm. The results are incomparable to similar games with generated content.\nGame accessibility - Anyone can understand basic game principles and play the game in just a few seconds.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hyperbolic Magnetism","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]}]