[{"id":20790,"name":"Realms of Arkania 3 - Shadows over Riva Classic","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7b3/7b3160611cc42f94b71d168243087e42.jpg","description":"Shadows over Riva (1997) is the third part of the glorious Realms of Arkania Trilogy...\nSomething sinister lurks in the seaside town of Riva. An evil force has subverted the city's leaders, and evil things lurk in the town's sewers. Explore the huge city, dungeons and even underwater regions in stunningly detailed 3D. Adjustable difficulty levels make the game as simple or as detailed as you like.\nPC Gamer Editor's Choice (1997)\nFantastic story and excellent gameplay (Online Gaming Review, 1997)The Realms of Arkania TrilogyThe Realms of Arkania games (Blade of Destiny, Star Trail and Shadows of Riva) deliver a prime example of the classical European fantasy universe. Based on Germany's most popular pen & paper role playing game, it was also the first German computer RPG series to get widely recognized outside of its home country. To this day it holds a stable hardcore fanbase that loves the games for their comprehensive adaption of the pen & paper ruleset and the believable medieval fantasy setting.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Attic Entertainment Software","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":18298,"name":"Turba","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7f/f7f35b0b89073e2a3b24d539b7c17993.jpg","description":"Turba provides a gameplay experience unlike any you have encountered before. Load in music from your PC and combo blocks to your favorite tunes in this unique new twist on the “match-3” style game!\n\nThe blocks on the game board generate and move to the beat of the song you choose. Clear blocks in time with the beat and make expert combos to maximize your score while you compete in online leaderboards for any and every song you play.\n\nKey features:\n\nThree modes of play\nSeven Special Powers to change up how you play\nOnline leaderboards for each song you play\nSupported file types: Mp3, Music CDs, Flac, Ogg, Wma, Ape, Mpc\nLast.fm Scrobbling support\nIn-depth stat tracking and unlock system\n20 Steam achievements, 50+ Steam stats, Steam leaderboards","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Binary Takeover","platforms":[{"id":0,"name":"PC"}]},{"id":17391,"name":"Loren The Amazon Princess","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3a2/3a29b5f808782d7e457965f8bcc5e74a.jpg","description":"Loren The Amazon Princess is a fantasy epic combining intricate turn-based battles with a heroic tale of overcoming evil -- with a twist! In this tale, you play as a loyal servant of the hero rather than the hero herself.\nTravel by Princess Loren's side as she searches for her lost mother, the Queen of the Amazons. Guide her choices and act as her valiant defender, meeting many colorful characters along the way. As the journey progresses, everyone will grow and change -- character development in games isn't dead! It's also impossible to see all the content in just one playthrough, with so many ways to customize the characters.\nHardcore role-playing games with replay value are becoming rarer in today's age of simplification for the masses. The developers of the hit title Planet Stronghold have dedicated themselves to keeping old-school RPGs alive through this new adventure.Game Features\nCustomize Your Hero: Play as a male or female warrior or thief. Decide their backstory, initial stats, and personality. Help them rise from humble servant to legendary hero!\nTrain Your Characters: Select everyone's skills, weapons, and armor. Over 500 items can be used in 13 armor slots. Class-based skill trees combine with unique character-specific skill trees such as \"Gladiator\" or \"Assassin\".\nBattles Demand Strategy: Your tactics will be challenged by over 100 enemies: take advantage of weaknesses and achieve combos with your characters by inflicting and then exploiting status effects. All that character customization has a major effect on how each battle plays out. But never fear: choose between two different modes of play when you start the game, as well as your desired difficulty level.\nStory-based Gameplay: Over two novels' worth of in-game text depict vivid characters and flesh out a strong plot that reflects your decisions. Optional interactions abound, such as talking with your party members at camp to learn more about them -- or even to uncover a romance.\nInclusive to all demographics. A wide range of romantic interests are provided.\nTheme song composed by Matthew Myers and performed by Christina Vee,  game soundtrack by Michael Chait.Useful linksWinter Wolves Official Site (find all the games made by us, also available for mobile platforms)\nWinter Wolves Facebook page (become a fan to be informed on the latest news)\nWinter Wolves Forums (join it to receive help and info about the games)","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Winter Wolves","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16396,"name":"Lunnye Devitsy","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/223/2239b7d6daed971e5d53ed5cfbbd1373.jpg","description":"Lunnye Devitsy is the story of an alien who falls from the moon onto a huge mountainside on the planet below. Explore strange locations, aid mysterious characters and find your way home.Key Features Find all the ways back home - some logical, some abstract\nExplore a strange mountainside\nUnlock abilities, build cannons and spaceships\nNo death\nRelaxing exploration gameplay\nFully universal - no in-game text\nXbox 360 and standard controller support\nIncludes full MP3 and FLAC soundtrack","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Boss Baddie","platforms":[{"id":0,"name":"PC"}]},{"id":12437,"name":"Death Penalty: Beginning","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03b/03b66938bdee71738086759e4b36463b.jpg","description":"From the beginning of her service in the World Safety Secret Organization Alice showed herself as a brave and very capable agent. In a few years she completed tasks of the highest difficulty on her own. However, this story had to be about one of them.\nBut her plane crashed and she got into hostile environment of the victims of criminal experiments on people. These hyper-aggressive individuals with a complete degradation of communicative skills don’t understand what is happening and want to destroy everybody not like them.\nThat’s why make yourself comfortable in your chair and get ready to plunge into the cruel world which didn’t lose its attraction and rock&roll!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Vi Games","platforms":[{"id":0,"name":"PC"}]},{"id":7493,"name":"The Walking Dead: A New Frontier - Episode 1","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/129/1291f900d9ce93f523f14536ca19ecc3.jpg","description":"When family is all you have left…how far will you go to protect it?\nAfter society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier?\n\nAs Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.\nDownload Episode One of The Walking Dead: A New Frontier, a five part episodic game series from the creators of The Wolf Among Us, Batman - The Telltale Series, and Tales from the Borderlands.\n","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox One"}]},{"id":4073,"name":"Dollar Dash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/931/93199375ea0634afb148013cd5131f28.jpg","description":"Find it, rob it, and keep it. Grab the cash in this fast and frenetic top down multiplayer versus game. Dollar Dash will have you shouting for joy, as you make a dash with the cash. You must attack, defend or outrun your competitors in any of the three game modes (Dollar Dash, Save the Safe or Hit’n’Run) using unique and comedic tactics.\nStand out from the crowd by customising your character, upgrading your favourite weapon, earning perks and unlocking achievements.  You can’t stand still for a second as combat is crazy and money changes hands frequently.  Choose your weapons carefully as you challenge your friends to become the best thief in town and laugh out loud as you smash them with a huge Bolder, peck them with a Mag Pie, while protecting yourself in Jelly!\n1-4 players\n90MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-4\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement and this item's use restrictions. This item has been sublicensed to you by Sony Computer Entertainment America. One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\ncopyright © 2012 kalypso media\n1-4 players\n90MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). This item may be solely used on up to 2 PlayStation® systems activated by this account, with no more than 1 activated device within a 24 hour period.  Content may not be used by any other account.  Please see software description for device compatibility.\ncopyright © 2012 kalypso media","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Kalypso Media","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1544,"name":"DUCATI - 90th Anniversary","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0f5/0f548acd6e89aef79263ddd9411b06a1.jpg","description":"From the creators of RIDE comes a spin-off entirely dedicated to the legendary Ducati brand - nearly a century of legend wrapped up in one video game!\nWith 39 models in the game, you can thrash the most iconic bikes. 7 great ERAS ere you can rediscover the bike of your dreams, from the 50s to historic victories. Test out the legendary 1954 125 Gran Sport Marianna or Fogarty’s powerful Ducati 996.\nGet an adrenaline rush racing on the tracks where Ducati made history! Hit the gas on 5 faithfully-reproduced country tracks and 8 official circuits, including the Ducati fans’ favourite, the Misano World Circuit - Marco Simoncelli, reliving the exploits of those who made history.\nFind out more about Ducati's history in the museum, dedicated to the technical and historical details which have rendered every vehicle famous.\nWhat are you waiting for? Go get involved in history!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Milestone","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":962108,"name":"The Bookwalker: Thief of Tales","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/4ae/4ae187d7ab7227c74f4da6f079cac8e3.jpg","description":"Join our Discord\nAbout the GameSteal legendary artifacts to regain your freedomEtienne Quist, a once-acclaimed writer, loses his ability to write after he is found guilty of an unspeakable crime. In an attempt to reclaim his lost status, he is approached by a criminal boss with a cunning offer. All he needs to do is locate and steal a series of legendary items from books. Delve into remarkable book worlds, each with its unique rules and challenges. Should anyone stand between you and the artifacts, be prepared to persuade, deceive, or even engage them in combat.\nExplore different books and reshape their storiesEach quest thrusts you into an entirely new world: medieval prison, snow-capped mountain, futuristic spaceship and more. Meet the inhabitants of each book and use them to achieve your goals — after all, they are not really alive... or are they? In your quest, you will not be alone, as your paths cross with a sentient caged page, whom you adopt as your partner-in-crime and trusted advisor.\nSolve unconventional puzzles across fiction and realityTest your ingenuity with unique puzzles that encourage thinking outside the box, as you freely travel between fiction and reality, gathering valuable items to overcome obstacles. Using the mystical power of ink, you can manipulate objects within the books, adding depth to your interactions and unlocking new paths to explore.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Do My Best","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":647660,"name":"Frostpunk 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a73/a732e6a5261699e1ba3a3c1c3926a7b7.jpg","description":"Discover a city-survival game set 30 years after an apocalyptic blizzard ravaged Earth, transforming our world into a harsh, icy wasteland. In Frostpunk 2, you must face a new deadly threat that appears on the horizon – human nature and its unsatiated thirst for power.","review":"","timePlayed":0.0,"releaseYear":2024,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":278022,"name":"Alchemy Garden","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6d4/6d48770b91a6c39e29a0ff55886378a3.jpg","description":"Alchemy Garden is an interactive experience where you can create gardens, make experiments and run your own alchemy shop.CREATE MAGIC GARDENSYou have a large piece of land where you can unleash your imagination to create unique gardens! You can use plants, flowers, trees and all kinds of decorative objects to unleash your imagination.EXPLOREFind new plants and ingredients for your experiments, be they common or exotic in hidden areas. You have several biomes where you can find a variety of plants and components for your garden.CRAFTUse components and try all kinds of combinations to create potions, which you can apply to your plants or sell them.RUN YOUR OWN STOREManage your own potions store and sell your creations to the villagers. With the gold you get you can buy from random seed bags, tools and even furniture for your home.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"MadSushi","platforms":[{"id":0,"name":"PC"}]},{"id":59833,"name":"Slap City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c49/c497af34ca0cd869868bdee65e850260.jpg","description":"Slap City is a streamlined platform fighter with characters and locations from the Ludosity universe! Slap your way through multiplayer modes like Battle and Slap Ball either locally or online, or take on a bunch of single-player challenges!\nPlay with up to four players locally or online with a variety of game modes, options, and computer controlled opponents, or play for points in online 1 on 1 ranked battles.\nSave replays of your greatest moments!\nWant a break from fighting? Try Slap Ball! (Note: there will be no breaks from fighting.)\nIn this team-based game mode, players slap the ball into the opponent's basket to score. The more the ball gets juggled in the air without touching the ground, the more points it'll be worth, allowing for some serious plays and comebacks. Don't forget to rest near your goal to recover some damage, or each hit from your opponent will soon send you several laps around the court!\nHere's a quick look at what is already implemented, and what is coming in the updates ahead!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Ludosity","platforms":[{"id":0,"name":"PC"}]},{"id":50888,"name":"Onmyoji","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/68c/68c9bdfd99a7d951ba64030f266c0828.jpg","description":"A Tale of Demons\nBegin your legendary journey through a Japanese-style fantasy RPG. Your epic adventure starts in the Heian period of Japanese history, a time when humans and demons co-exist…\nIt was a hellish time when spirits and demons lurked in the shadows, striking fear into the hearts of men. The only ones standing against the oncoming darkness and terror were the onmyoji – masters of mystery. Divining the future, observing the stars, traveling between worlds, and ultimately bending spirits to their will, the onmyoji sustained the balance between the humans and the demons.\nEnter the incredible, vibrant world of spirits and demons, and watch mysteries unfold before your very eyes.\n\nPlay as a Legendary Onmyoji from Japanese Folklore\nBe reincarnated as Abe no Seimei, a legendary onmyoji from Japanese folklore. Help Seimei on his journey to recover his lost memories while encountering demons of all shapes and forms. Unravel the supernatural tales of the shikigami, spirits, and demons, and listen to their inner voices.Collect and Evolve Hundreds of Shikigami\nCollect nearly a hundred different magical spirits called shikigami, each with their own unique stories and abilities. Strengthen your shikigami or change their appearances by evolving them.Multi-dimensional Gameplay and Strategic Battling\nUnleash your shikigami in semi-real time battles with other onmyoji in your area or from around the world. Build your dream tactical team by choosing shikigami based on their abilities and strengths, then send them into battles against other teams. Challenge yourself with various and exciting game modes including Duels, Realm Raids, Boss Challenges, Demon Parade, and much more.\nExquisite Reproduction of Ancient Kyoto\nImmaculate 3D modeling takes you into the vibrant, immersive world of Kyoto during the Heian period. Relax in peaceful courtyards and pass through otherworldly Torii gates, watch the spring cherry blossoms drift, and wrap yourself in the solemnity of palaces and shrines. Detailed rendering and painstaking worldbuilding will immerse you in the mesmerizing, fantasy world of Onmyoji.An Auditory and Visual Feast\nOnmyoji features many of Japan's top voice actors, including Rie Kugimiya (Fullmetal Alchemist), Noriaki Sugiyama (Naruto), Miyuki Sawashiro (Di Gi Charat), Tatsuhisa Suzuki (Final Fantasy XV), Jun Fukuyama (Super Smash Bros), Nana Mizuki (Naruto), Akira Ishida (Neon Genesis Evangelion) and more. This talented group brings all the characters of the game to life and helps paint their mysterious yet poignant tales.\nAn original soundtrack by world renowned composer Shigeru Umebayashi (Mood for Love, 2046, House of Flying Daggers) provides a lush soundscape to transport players deep into the mysteries of the ancient Japan.Social System\nYou can create virtual realms and interact with other players in Onmyoji. Invite your friends to battle alongside you against boss demons, or challenge them to a duel!\nTravel through the zones of the living and the dead with your new friends, or even break through dimensions by connecting with them in the real world.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"NetEase Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":49493,"name":"Knights And Bikes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/507/5079b644ad6fb5efce34a387b18d1c4e.jpg","description":"KNIGHTS AND BIKES is a hand-painted action-adventure set on a fictional British island in the late 1980s, inspired by coming-of-age movies like The Goonies and classic games like Earthbound and Secret of Mana.\nThe story features two new friends: Nessa & Demelza. They're tough and imaginative girls exploring the island of Penfurzy in search of mysteries and treasure. Cycling around on their bikes, exploring the natural beauty of their surroundings, they experience their first taste of a more grown-up freedom. But this new-found independence also leads them into danger, both modern and ancient.\nWith a mixture of ingenuity and imagination, they deal with enemies and a challenging environment using frisbees, water-balloons, a cranked-up stereo, a pet goose, and more. The trinkets they collect from their adventures allow them to upgrade their bikes and widen their treasure-hunt.\nAs Nessa and Demelza try to figure-out the puzzling adult world around them, it's their friendship and imagination that guides them on their quest: to find the legendary treasure! (as well as saving some of those stupid adults that just keep disappearing).\nThe game is by Rex Crowle, (Creative Director: Tearaway/Tearaway-Unfolded, Art & Design: LittleBigPlanet) and by Moo You (Gameplay Programmer: Ratchet & Clank and LittleBigPlanet). Audio design by Kenny Young (Audio Lead: Tearaway & LittleBigPlanet) and with a musical score by Daniel Pemberton (Composer: The Man From Uncle, Steve Jobs, King Arthur: Legend Of The Sword)Things to Do Best friends forever! Play single-player with an AI companion, couch co-op or online co-op.\nSolve puzzles and deal with enemies using your improvised abilities! These include: frisbees, water-balloons, puddle-stomping welly boots, and a powerful boom-box stereo.\nWork together! Both characters have different skills so you'll want to experiment with how they combine in order to succeed.\nExplore the island! Seek out its modern tourist-attractions and ancient ruins, both on foot and on your customised bikes.\nDiscover treasure! Ranging from trinkets like broken action-figures and animal skulls, to the legendary riches rumoured to be hidden on the island.\nUpgrade your bikes! Barter with adults (offload your junk) so you can personalise your bikes, unlock extra abilities or at the very least: get those training-wheels removed!\nTend to your pet goose! Captain Honkers has a keen nose-beak and can help you find what you need, if you keep him fed and happy.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Foam Sword","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"}]},{"id":34734,"name":"Tony Hawk's Pro Skater 4","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c39/c391b587cffb4e013d7854e03a03647c.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Beenox","platforms":[{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":32577,"name":"Tony Hawk's Pro Skater 3","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2b/a2baa14bf592e3973650faacbf60fe74.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Gearbox Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"GameCube"},{"id":0,"name":"PlayStation 2"}]},{"id":20739,"name":"Wake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bce/bce39f1030d4c7ec3b1940ca84d77ea4.jpg","description":"Wake is the story of an engineer trapped on a sinking ship. Navigate through the ship however you want to find your way to the surface above, but avoid the ship's corrupted security system!Key Features Run and swim to escape a sinking ship\nDodge bullets, fire, electricity and LASERS - but most of all avoid drowning!\nRandomised areas change the ship every time\nTense, close-quarters gameplay\nCollect keys, torches and other items to stay alive\nUnravel the truth behind the sinking of the ship\nMultiple difficulty modes and end-game challenges\nCompete against others with online scoreboards\nXbox 360 and standard controller support\nIncludes full MP3 and FLAC soundtrack","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Boss Baddie","platforms":[{"id":0,"name":"PC"}]},{"id":16309,"name":"Balloon Blowout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/63d/63d69d515e58d3f2384b6738cc1eea17.jpg","description":"Balloon Blowout invites you to pop weird and wacky balloons! In this colorful puzzler, balloons have escaped and you must pop them all before they get away. You get points for each popped balloon and additional points for grouped balloons or for popping balloons of identical color. Balloons come in different colors and some have funny facial expressions, while others contain surprising powers. Experienced balloon-poppers seeking the ultimate challenge can test their skills in Survivor Mode, where the objective is to gain as many points as possible before 20 balloons escape.KEY FEATURESAmusing balloons with funny faces\n45 challenging balloon-popping levels\nPoints- and star-system\nHilarious sound effects\nSurvivor mode with endless play","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":14684,"name":"Melty Blood Actress Again Current Code","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/aa8/aa8e11ec911e636d2705894154a8be9d.jpg","description":"The final episode of the series, \"MELTY BLOOD Actress Again Current Code\" is now on Steam!Maximum Combat FreedomAll playable characters comes with 3 separate styles for players to choose from - \"Crescent Moon Style\", \"Full Moon Style\" and \"Half Moon Style\". Each style exhibits a different behaviour for the selected character, experiment away to discover your own combat style!Largest Character Variety in the SeriesToday a friend, tomorrow a foe… Some tag-teamed, some got converted to the vampiric side, some just wanted to have a spot in the promised movie debut. Try your hands at the largest cast number among the series on all the 31 characters (multiplied by 3 styles each!) to find the dream fighter that suits you best!Deep LoreA year has passed after the TATARI incident left Misaki Town scarred. However, the nightmare revisits again for the third time. Every character has a story to tell in the \"ARCADE\".\nAlso, users may enjoy pure battle action in \"VERSUS\", whether is it 1P vs 2P, 1P vs CPU, or just watch CPU vs CPU.\nPlayers may also wish to try out the characters and their individual styles in the \"TRAINING\" to get a hang of their abilities before heading to the heat of the battle.Online Battle FeaturePlayers may head over to the \"NETWORK MODE\" and play against other players over the internet with \"RANK MATCH\" and \"PLAYER MATCH\".\nPit your skill against others in a serious matchup via \"RANK MATCH\" and watch your rankings grow with each win!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"FRENCH-BREAD","platforms":[{"id":0,"name":"PC"}]},{"id":13576,"name":"InCell VR","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bc1/bc110e458ce0fae2af903be92964cac9.jpg","description":"About the Game\nInCell is an action/racing game with a bit of strategy and science thrown into the mix in a rare and highly unusual microworld of the carefully recreated human cell. This is the right project to start your acquaintance with VR or receive new VR impressions. The game is focused on Virtual Reality but you can play just fine without a set.\nReady steady go!\nThanks to all robot-gods out there we will not take this journey alone -  our humble (with a tiny control-everyone mania) assistant is waiting for us (she is so sweet, isn’t she?). The Most Excellent Assistant Zero-Seven (she said that humans may refer to her simply as ‘Your Highness’). So the player’s task is to impress TMEAR07 with experiment on volunteer to unlock new healing technology for humanity. The problem is she doesn’t believe in that possibility because humans are simple and illogical (and she is genius… as always).\nTo cure our volunteer Mrs. Jane Smith and impress TMEAR07  players must select the right way through the objects (organelles) to the cell’s nucleus and do their best in innovative radial racings between selected objects. Each object provides unique abilities to improve racing params or to protect cell with different strategies.\nHow is it going inside the cell?\nGetting closer to understanding cell structure and organelles functions (which are similar to the real functionality of the organelles) players will improve their skills and will have a chance to impress completely suspicious The Most Excellent Assistant Zero-Seven (who knows why is she so much aware of the other six Excellent Assistant Robots disassembling…).\nOne old and wise robot (he is still remember his 386 childhood) said that it’s a bad idea to make this kind of girl-robot sad…\nFeaturesPlayable with VR (control the movement with your head only, or use keyboard and joystick).\nSolve the riddle of TMEAR07, find out why doesn’t she believe in the humanity (may be it is just robot’s bad today or some silicon stuff inside your PC makes she sad)?\nWith each new start the cell structure will be generated anew placing the organelles in different locations.\nThis game is a perfect opportunity to learn more about cell microstructure, different organelles and their roles in cell vital activity.\nUnlock harder difficulties where the true challenge awaits.\nHot keysSpace - recenter camera position in VR mode\nM - switch mirroring VR picture on monitor\nEsc - pause and options menu\nF5 - hide or show UI\nF6 - hide or show bathyscaphe\nF1 - graphics for recommended hardware\nF2 - graphics for older hardware\nF3 - decrease rotation speed (highly not recommended, only for experienced VR players)\nF4 - increase rotation speed (highly not recommended, only for experienced VR players)\nF7 - reset rotation speed to defaultKnown issuesVR on Linux is not yet implemented\nIf you are not using gamepad you may want to plug it off to switch game in mouse/keyboard control mode.Other VR games by Luden.io\nhttp://store.steampowered.com/app/522220/\nhttp://store.steampowered.com/app/588560/\nhttp://store.steampowered.com/app/343740/","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":10188,"name":"Higurashi When They Cry Hou - Ch. 5 Meakashi","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/66f/66f2df526b49dec6ee7f9984cf8d2fe9.jpg","description":"June, 1983.\nThe summer heat has arrived earlier than it does most years.\nBy day there are cicadas, and by night, the higurashi.\nHinamizawa, a small village in the Japanese countryside.\nWhile there are fewer than two thousand people there, every year, 'something' happens.\nFor the past 4 years, someone has died, and someone else has gone missing.\nThis series of deaths and disappearances is connected to the local resistance against a now-abandoned dam construction project.\nA murder during the construction, covered up by the local authorities, is being re-enacted year after year.\nIs it a conspiracy? A coincidence? Or perhaps a curse?\nSomeone who was supposed to be there... isn't.\nSomeone who wasn't supposed to be there... is.\nSomeone who was alive last night is now dead, and someone who is here right now isn't alive.\nThere is no way to avert this tragedy. There is no choice but to give up trying.\nBut even so... please don't give up.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"07th Expansion","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":6093,"name":"Shiny The Firefly","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/049/049fcb5ce768ac2a3e019659108825f7.jpg","description":"Shiny the Firefly is a challenging platformer, set in an atmospheric , delightful environment .  Control Shiny, a brave firefly, on a quest to find his children who have been scattered all over the mysterious garden, following a terrible accident. Master tricky trials and solve demanding puzzles on this odyssey. You’ll need stealth to protect your children from deadly dangers and to fend off nasty enemies. As well as big boss fights, you’ll encounter many dangerous garden dwellers, such as the stubborn mosquitoes, hungry toads, mischievous plants, sneaky wasps and endlessly long centipedes.\nThis colourful, gorgeous world is  a feast for the eye. Thanks to the great animation you’ll know how Shiny’s feeling at every twist and turn- if he is happy, frightened, tired or angry. This will help you to solve even the toughest of challenges.  Remember to use Shiny's glow skilfully; only when he is lit up can his children will follow him, but beware, for this makes him easier prey for his enemies…\nDirect gamepad controls, Steam Achievements and Trading Cards top off the whole thing - resulting in a great overall package. Can you reunite Shiny with his family?","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Headup Games","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":5463,"name":"Rayman","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ca/7ca0df41799243443a4e3887720fdf2a.jpg","description":"In the world of Rayman: Mister Dark no Wana®, people live in peace and harmony with nature, and the Great Protoon maintains the balance of the universe. One fateful day, Mr. Dark steals the Great Protoon and defeats Betilla the Fairy, plunging the whole world into darkness. It's up to Rayman® to defeat Mr. Dark and restore balance to the universe in this classic platforming game.\nKey features:\n•\tAction-packed platforming levels have you jump, climb, and swing your way to victory.\n•\tExpand your repertoire of moves by learning new Powers.\n•\tExplore over 30 levels in 6 diverse and fantastic worlds.\n•\tDefeat all of Mister Dark's menacing Antitoon footsoldier minions and face challenging boss battles.\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PLAYSTATION®Network account that originally purchased the game.  You must have at least 97 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PLAYSTATION®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PLAYSTATION®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and this item’s use restrictions.  If you do not wish to accept all these terms, do not purchase or use this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account.\nMemory Stick Duo™ may be required.\nRAYMAN®  © 1995-2008 Ubisoft Entertainment. All Rights Reserved.  Rayman, the character of Rayman, Ubisoft, Ubi.com, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1995,"developer":"Ubisoft","platforms":[{"id":0,"name":"SEGA 32X"},{"id":0,"name":"Jaguar"},{"id":0,"name":"SEGA Saturn"},{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"iOS"}]},{"id":4363,"name":"VIRTUA FIGHTER 5 FINAL SHOWDOWN","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5cf/5cf4c17c8ac927985e3fc2f3c0f1eb58.jpg","description":"Virtua Fighter 5 Final Showdown is the definitive version of the Virtua Fighter 5 series that incorporates all the enhancements SEGA has rolled out since 2007 with some brand new features.\nKey Features:\n\nNew Characters: Taka-Arashi returns from Virtua Fighter 3 and a karate expert Jean Kujo makes his debut in this gang of 19 playable characters.\nOverhauled Fighting Mechanics:  The enhanced fighting mechanic makes Final Showdown more accessible to new players while retaining the trademark depth and balance of the game.\nDynamic Fighting Arenas: Final Showdown introduces new stage arenas and interactive environments.\nOnline Modes:  Challenge a friend to a Ranked Match or Player Match or play with up to 7 others in Room Match mode.\n\nCustomizable Costumes: Add a huge variety of customization items sold separately (as DLC packs) for the ultimate Virtua Fighter experience.\n1-2 players\nDUALSHOCK®3\nNetwork Players 2-2\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service). One time license fee entitles play on up to 2 PlayStation® 3 systems activated by this account.\n©SEGA. All rights reserved. SEGA is registered in the U.S. Patent and Trademark Office. SEGA, the SEGA logo, VIRTUA FIGHTER and FINAL SHOWDOWN are either registered trademarks or trademarks of SEGA Corporation.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"}]},{"id":869,"name":"Battlevoid: Harbinger","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0e/b0e6354c749d30d4b501222a8f4765ca.jpeg","description":"Special Edition\nThis version is completely reworked and perfectly optimized for PC, with lots of new content to make it a great experience. New additions include:\nReworked user interface for PC and enhanced graphics.\nMore content and more complexity to the game play overall.\nPrecise controls, and more precise interface.\nMore complexity to targeting. Targeting individual fighters.\nBandboxing and tooltips.\nAbout the GameBattlevoid: Harbinger is a hard sci-fi space exploration game blending roguelike, turn-based, star map strategy, and real-time space battles. You are a young commander given the task to venture out into enemy territories, far away from home to unknown galaxies, never knowing what you will face as you jump out from hyperspace.\nIn Battlevoid: Harbinger you will have to make decisions regarding your fleet and equipment, face surprising elements, use Battlestations to your advantage and battle fiercely for survival as you defend humanity. Strategy, tactics, and resource management are the core of Battlevoid: Harbinger. Plan your ship's offenses and defenses. Fortify your ships against enemy weapons, and wield them wisely. Lure your enemies into traps, or distract your foes with distress beacons toward your Battlestation. Battlevoid: Harbinger has been praised by the press and gamers, creating a solid community for the game.Key Features\nIntense and gripping sci-fi space adventure simulation\nExplore new procedurally generated galaxies each playthrough\nGalaxies full of mysterious places, Battlestations and dangerous encounters\nCarry out missions, discover new technology, and help humanity survive\nUnique turret upgrade system, never seen in a game before\nSuperb pixel graphics and effects","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bugbyte","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":493449,"name":"Leisure Suit Larry - Wet Dreams Dry Twice","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1b6/1b69c8cb9f47ab60426f9fc3c65aac64.jpeg","description":"Hey Ladies, it’s time to get wet again! I am not done yet and still dreaming of you in Leisure Suit Larry – Wet Dreams Dry Twice. I left New Lost Wages, stranded in Cancum, and had prepared to marry my only true love, Faith. But, unforeseen events interrupted us and we’ve become separated again! She is somewhere in the famous, sunny and huge Kalau’a archipelago and I have to find her. Help me — if I don’t find her soon, I think I may burst!\nNo obstacle will keep me away from my beloved, my Faith, not even the wild and untamed islands of Kalau’a. Those lovely island ladies can only distract me for so long as my heart’s compass only points in one direction - Faith! Care to set sail with me as a true pirate and become a real gold digger? Join my crew on this glorious quest — you may just end up soaked to the bone!\nFeatures:\nExplore the Kalaua’ archipelago with all its mysterious and beautiful islands - featuring over 50 handdrawn locations.\nMeet over 40 new and old friends from Wet Dreams Don’t Dry and chat up some fresh new feminine friends.\nHelp Larry solve difficult and exciting (and maybe a little erotic) new riddles and complete quests, providing him with a truly happy ending.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"CrazyBunch","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":251512,"name":"The Missing: J.J. Macfield and the Island of Memories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9dd/9dda3cb3a3980c77f76c3a22efd58c4c.jpg","description":"Look forward to the story of pain and recovery like you've never experienced before in this unique world of \"The MISSING - J.J. Macfield and the Island of Memories -\".\nDespite the horrifying death traps across the mysterious island, J.J. is able to revive from death endlessly. Many traps and gimmicks can be overcome only by bringing harm to your body, such as being struck by an iron ball, or by dismemberment. Be wary of your surroundings and look for ways, conventional and unconventional, to get through the island.\nYou may need to use your limbs as weight, or even break yourself in two to get through smaller spaces. Sometimes you can find tips by sacrificing your own body through dismemberment, being crushed, jumping into fires, and more. But don’t worry as you can revive yourself as many times as needed to find your way through the island.\nJ.J. scours Memoria Island to find her best friend, who has gone missing during a camping trip. However, this island was like a nightmare: no matter how many times she sustains fatal injury, she couldn’t die, and instead is able to revive herself back to normal. J.J. ventures into the depth of the island as she drags her decapitated body along, enduring the pain.\nHer limbs may sever, her neck may break, she may go through severe burns, but... In order to save her best friend, she puts her own body and life on the line, reviving infinitely, as she presses forward. Why did she go missing? What is going on in this world? All of these mysteries shall be revealed when the game is cleared.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Arc System Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":49305,"name":"Cyberdimension Neptunia: 4 Goddesses Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d30/d30293ce569f1072607c77df0ee12b1f.jpg","description":"Login to the Cyberdimension and lead Neptune's party!\nPlay solo or online in a 4-person party in this game within a game! It's up to the Goddesses to hack and slash through “Alsgard” and rescue the creators of Leanverde.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1 player\nNetwork Players 2-4 - Full game requires PlayStation®Plus membership to access online multiplayer\n6GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2017 IDEA FACTORY / COMPILE HEART/ TAMSOFT All rights reserved. Neptunia is a trademark of IDEA FACTORY. Licensed to and published by Idea Factory International, Inc.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Idea Factory","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":45636,"name":"Football Manager 2018","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b6e/b6e4960341c8cb05c3a43e652e7b443a.jpg","description":"Special Offer\nAbout the GameThey say football is a game of opinions and everyone has theirs, but it’s only yours that counts around here.\nYou make the decisions now, from who you sign and who you sell, to how you manage your budget. Will you build tactics around the players at your disposal or train them in your vision of how the game should be played? Who you pick and who you bench will affect squad harmony, and it’s up to you to manage it. Every decision comes back to you.\nGet it right and you’ll be the star of the show, grabbing the newspaper headlines and dominating trends on social media. They’ll write your name in footballing folklore…if you succeed, of course.\nWith unparalleled choices both on and off the pitch, all within the immersive footballing world, it’s time to decide what kind of manager do you want to be?\nTry your hand in 50 of the biggest footballing countries\nWin the title with any one of world’s top 2500 clubs\nPlay the transfer market with over 600,000 real players and staff\nWatch your football vision come to life before your very eyes\nFootball Manager 2018 is available to pre-purchase now and fans who do so before Monday, October 9th and who have Football Manager 2017 in their Steam Library will receive a ‘Contract Extension Bonus’ discount of 25 per cent.\nIn addition, you’ll also enjoy access to a fully-playable Beta version of the game at least two weeks prior to the November 10th official release date, allowing you to start pre-season early. Single player careers started in this Beta version will also continue into the full game.\nAll purchases of Football Manager 2018 also include a free copy of Football Manager Touch 2018 for PC/Mac and Linux.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Sports Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":37451,"name":"Lost: Via Domus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/df8/df8df72a9ca597216d52128e37e05ed1.jpg","description":"You awake to the blazing sun, the screaming of other passengers, the wreckage of Oceanic flight 815. And no memory of what has happened. Now you must fight for your survival by exploring the island, uncovering its dark secrets, and piecing together the fragments of your own furtive past. If you’re lucky, you may just find a way home...","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":36013,"name":"Tony Hawk's Underground 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e98/e98add56fb5fd36ba45ec668082fef8c.jpg","description":"Tony Hawk's Underground 2 Remix!!!\nYou've been chosen by Tony Hawk to compete against Bam Margera's team in the World Destruction Tour. In an all-new storyline, Tony Hawk's Underground 2 takes you to skateparks around the world, where you can spray your custom tag, slap stickers, and even create new skate lines. Now you can play as yourself, as your teammates, or as more than 20 special skaters. If you're feeling nostalgic for older Tony Hawk games, you can try Classic mode, which challenges you to accomplish your favorite goals, such as Secret Tape and High Score.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Neversoft Entertainment","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox"},{"id":0,"name":"PSP"},{"id":0,"name":"PC"},{"id":0,"name":"Game Boy Advance"}]},{"id":35403,"name":"Space Rangers 2: Rise of the Dominators","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f9f/f9f9121971f17320610f9d9fd2d2e562.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Elemental Games","platforms":[{"id":0,"name":"PC"}]},{"id":21273,"name":"Sacraboar","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0d/b0d495fecf7813744d567ae766a5edee.jpg","description":"Sacraboar is an RTS game in which players have to capture their opponent's boar trophy. Featuring an intuitive and easy to use resource management system, the game offers fast-paced game play without lengthy and tedious construction phases.\nDuring the game players can build towers, which either give them access to powerful spells or increase their budgets for producing units.\nGet yourself some awards in league and cup competitions as well as bronze, silver, and gold medals in over 80 challenging missions and battle it out against human opponents via LAN.\nMultiplayer via LAN\nLeague in four difficulties (Bronze, Silver, Gold, All Star)\nCup in four difficulties (Bronze, Silver, Gold, All Star)\n89 Missions, each one in three difficulties (Bronze, Silver, Gold)\n6 additional tutorial missions\nReplays (record your matches and share them with your friends)\n18 difficulties in Skirmish mode (from very easy to ultra-hard)\nLots of different game modes that can be combined\nEasy to use code system for sharing cool game settings\nTest Center for testing units and spells\nEncyclopedia with all information about units, spells, game modes etc.\nTrophy Room that lists all your achievements","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Makivision Games","platforms":[{"id":0,"name":"PC"}]},{"id":21029,"name":"Lost Legends: The Weeping Woman Collector's Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cfa/cfa0241dc723b752c54124d1ee635304.jpg","description":"Journey south of the border and immerse yourself in this compelling hidden object adventure that is packed with mystery, suspense and thrills!\nThe villagers of San Cristobal hold an annual festival called Flores de los Muertos, \"Flowers of the Dead\" - a carnival during which the entire village comes together to ward off the spirit of the Weeping Woman. The disappearances have miraculously stopped and the residents of San Cristobal consider themselves lucky that the festival has kept the Weeping Woman at bay... until now. The Weeping Woman has returned, and only you can stop her!\nSpecial Collector's Edition Features include:\nThe 'Tale of El Sombrerón' bonus chapter\nAchievements and morphing collectibles\nWallpapers and concept art\nIntegrated strategy guide and more!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Gunnar Games","platforms":[{"id":0,"name":"PC"}]},{"id":17964,"name":"Sweet Candy Mahjong","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/564/564736d3e36517d13bcbfd090b237ef6.jpg","description":"Sweet Candy Mahjong is the latest installment to the popular series of casual games by award-winning EnsenaSoft and is the sweetest Mahjong game you will ever play! Sweet Candy Mahjong includes 8 delicious mahjong-worlds with a total of 640 challenging puzzles in classic 2D and tasty 3D. Puzzles are laid out using random tile order, allowing you to replay many times with a new experience each session. An exciting scoring system, great sound effects and relaxing music adds to the fun. Suitable to players of all ages and experience levels, Sweet Candy Mahjong is a family-friendly game offering a modern rendition of the popular classic, and is a must-have game in your collection today.KEY FEATURES640 Mahjong Puzzles To Solve\n8 Worlds To Complete\nIntuitive Controls\nClassic 2D & Rich 3D Environments\nRandom Tile Layout\nOptional Timed-Puzzles\nGreat Graphics, Audio & Score","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":16738,"name":"Delta Force 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cb4/cb4545441b6be30851dcd88ec4a6b0d1.jpg","description":"You're a member of the U.S. Army's best kept secret: the elite SPECIAL OPERATIONS unit known as Delta Force, formed to BATTLE TERRORISM throughout the world. When the best of the rest can't handle the op, YOU are called into action. Can you handle THE JOB?\nFeatures\nFREE NovaWorld™: online gaming supporting up to 50 players.\nAPPROACH THE OBJECTIVE via parachute and use tall grass, water, and rolling terrain to move undetected.\nTAKE CHARGE with the new Commander's Screen, directing your teammates in single and multiplayer action.\nCREATE YOUR OWN single or multiplayer battles with the Mission Editor PLUS Over 40 new missions.\nTERRORIZE THE TERRORISTS with new weapons, new equipment, and fixed machine gun and grenade-launcher emplacements.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"NovaLogic","platforms":[{"id":0,"name":"PC"}]},{"id":16312,"name":"Block Blowout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b22/b22f4df3bec1ea80a1942e65b3469c60.jpg","description":"Block Blowout offers original brick-breaker arcade action inspired by the timeless classic. Blast your way through 84 challenging levels and collect useful upgrades and weapons of mass-destruction. Rockets and lasers help clear the screen, but watch out, as those are limited in numbers. Cool upgrades such as fireballs, extra lives, wider bats and nukes are available. You can even unleash your creative powers by designing your very own levels using the intuitive built-in level designer.KEY FEATURES84 Challenging levels\nBuilt-in level designer\nRockets & Lasers\nCollectible upgrades","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"EnsenaSoft","platforms":[{"id":0,"name":"PC"}]},{"id":14293,"name":"Drop Alive","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df4/df42a80d4e24e20d4d79d58a0ffee0e4.jpg","description":"An adventurous and curious water drop is trapped inside a house and needs your help to get back to the place she truly belongs to; a nearby glistening river. Climb a pile of jars, squeeze yourself through pipes and manage to get past a fridge full of stalactites without bursting. Use your wit to change from one state to another (liquid, solid and gas) surpassing every obstacle thrown your way as the game’s difficulty increases.\nDrop Alive combines all the right ingredients; entertainment, challenge, an exclusive soundtrack and the beauty and charm of heartwarming, handmade illustrated scenarios, an experience both adults and children will forever enjoy and cherish.Main Features\nHave fun as you navigate through 12 different levels, each with an aesthetic and peculiarity of its own!\nOriginal Drop Alive exclusive music. Delight yourself with a warm and fun soundtrack of over 10 themes!\nCollectables, Achievements, Cards and Full controller support.\nAlternate between 3 different states; liquid, solid and gas, to overcome every obstacle thrown your way.\nLeaderboards. Challenge your friends!\nWarning (as in \"don’t say we didn’t warn you\"): Do not, by any means, let this cute little fellow fool you. Drop Alive ain’t as easy as it seems. 12 unique unlockable Skins! Some of the skins you might find","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Invi Games","platforms":[{"id":0,"name":"PC"}]},{"id":14057,"name":"RuneScape: Idle Adventures","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ed/3edf47406b6a94d94cd78e1c5e796c56.jpg","description":"RuneScape: Idle Adventures brings the gigantic mythology of Gielinor, and packs it into an idle experience that anyone can play! Complete quests, earn loot, and interact with famous characters from the RuneScape universe, using as much (or as little) time as you want to put in! This is RuneScape, bite-sized.\nEXPLORE THE WORLD OF GIELINOR: Classic locations, ancient conflicts and infamous characters come together in a brand new RuneScape story for veteran and new RuneScape players alike.\nUNLEASH POWERFUL NEW ABILITIES: Destroy monsters, be everywhere at once, and rewind time itself. Unlock and combine powerful abilities unique to Idle Adventures.\nCUSTOMIZE YOUR JOURNEY: Become the hero of your own story, change your appearance with unlocks and armour, and add that extra bit of spice with branching dialogue and storylines.\nYOUR STORY, YOUR SPEED: Make progress and earn rewards whether you’re playing or not! Even the toughest quest can be completed with time.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Hyper Hippo Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13682,"name":"Sorcery! Part 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1aa/1aa10abbd12f45d66abb6f183e8bf662.jpg","description":"An open-world narrative adventure through a cursed wilderness of monsters, traps and magic. Hunt down the Seven Serpents, cast powerful spells that shape the story, and explore everywhere. Begin your journey here, or continue your story from Parts 1 & 2.\n+ Explore everywhere - move freely through the world, any way you want, creating your own unique story\n+ New time beacons allow you to alter the world dynamically - travel through the present, or into the past, or mix the two\n+ Thousands of choices - all are remembered, and shape your adventure\n+ Thirty new enemies, including seven deadly serpents, each with their own strategies - and weaknesses\n+ Adapted from the best-selling gamebook series by legendary game designer Steve Jackson\n+ Swindlestones is back! The game of bluff and deceit is back, with new, smarter, opponents\n+ New spells to discover and new magic to master\n+ Five Gods, all with different quirks and powers\n+ Start your adventure here, or load your characters and choices from Parts 1 & 2\n+ New music from \"80 Days\" composer Laurence Chapman\n+ New 3D hand-drawn maps to explore by Mike Schley\n\"Sorcery! 3 is unlike anything you’ve ever played. Its mix of puzzle-solving, combat, and choose-your-own-adventure stylings have created a unique form of entertainment that I cannot wait to get back into\" - Pocket Tactics, 5/5\n\"[One] of 2015’s best iPhone games\", TIME magazine\n\"This dragon-centric chapter of Sorcery! 3 does a fantastic job of keeping things dynamic and interesting, and better yet, its new puzzle-like aspect gives it the kind of magical, surprise-filled, combat-related fun fantasy fans live for.\" - Examiner.com, 5/5\nThe land of Kakhabad is a wilderness - a ruined desert, a tangled forest, cruel mountains and fissures, all guarded by seven fearsome serpents. But you must cross this land if you are to reach Mampang and the Crown of Kings. Rely on your wits or fight your way through - play with honour, or lie, cheat and steal - the choices are all yours.\nFrom the creators of TIME's Game of the Year 2014, \"80 Days\", comes the third instalment in the acclaimed Steve Jackson's Sorcery! series. An interactive story told through thousands of choices, all of which are remembered, where no two adventures are the same.\n\"Sorcery! 3 demonstrates just how wonderful interactive fiction can be.\" - 148apps\n\"A seminal moment in interactive fiction\" - Gamezebo\n\"A vast and engaging third chapter that expands brilliantly on the first two\" - PocketGamer (Gold award)\n\"An amazing adventure... easily the biggest and most satisfying gamebook ever released on iOS\" - TouchArcade, 5/5\nAdapted and expanded from the million-selling gamebook series by legendary game designer Steve Jackson, co-founder of Lionhead Studios (with Peter Molyneux) and co-creator of Fighting Fantasy and Games Workshop (with Ian Livingstone).\nUsing inkle's unique inklewriter technology, the story is written in real-time, built around your choices and actions.\nPraise for the Sorcery! series:\n* \"I love this app... better than any gamebook ever was in your head when you were a kid\" - 5/5, Interactive Fiction of the Year, Pocket Tactics\n* Top 20 Mobile Game of 2013, Touch Arcade\n* Top 25 Mobile Game of 2013 Gamezebo\n* Gold Award, Pocket Gamer\n* \"Some of 2013's best interactive storytelling\" - IGN\n* \"inkle's adaptation of Sorcery! takes the genre to a whole new level\" - Kotaku","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"inkle","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]}]