[{"id":470614,"name":"One Slice of Lust","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8eb/8eb35905c1741f31cba368a6cf849324.jpg","description":"The story revolves around the StrawHat Pirates who are targeted by one of the great emperors, Marshall D. Teach that makes them more desperate to meet their sexual needs that they never had before. Luffy who is captain of the Straw Hats will be the first target and the most affected of all. Zoro, Usopp, Nami, Sanji, Robin, Franky, Brook and their friends are not so affected but will follow their captain's wishes","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"LustWorks","platforms":[{"id":0,"name":"PC"}]},{"id":309893,"name":"Hard Truck 2: King of the Road","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/382/3825ce0ecf11b29bdae550b247c432f4.jpg","description":"Get behind the wheel in this sequel to the original 3D trucking simulation.\r\nGo head to head with the competition and try to be the first to deliver your cargo. It's all in a days work when you're driving the big rigs. From small trucks to 18 wheelers, you'll pilot the cabs that keep this country truckin'. Bid on jobs, manage your money, and keep on the right side of John Q. Law if you want to succeed in this racket.\r\nCheck this out...\r\n12 Different Trucks including 18 wheel big rigs.\r\nSpeed traps with police car chases and helicopter pursuits.\r\nSpecial effects like exhaust, tire marks, fog and blinding sun.\r\nRace the clock as day becomes night right before your eyes.\r\nOver 70 miles of continuous roads and secret path!\r\nWhen you're not on the job, race other rig-masters in time trails, obstacle courses, and one-on-one track racing. This is no wimpy race car sim! So, hop into yor cab, fire up your engine and put the pedal to the metal! The open road is calling you.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"SoftLab-NSK","platforms":[{"id":0,"name":"PC"}]},{"id":295125,"name":"Death end reQuest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/166/1667893e415612d0926954bdd54dd531.jpeg","description":"When video game programmer Arata Mizunashi receives an email from his missing colleague Shina Ninomiya, he soon discovers she is trapped as the only player in the virtual video game world they created- World's Odyssey (W.O.D.).\nHow can Shina escape? Complete the game and unlock the perfect ending - a success rate of 1%.\nKey Features\n- Jump from the in-game world and reality to solve the inner-workings of World's Odyssey.\n- In this turn-based battle system, knockback enemies and even change the game’s genre from a shooter, a fighting game, and more!\n- Players will need to activate character-specific dungeon skills to access hard-to-reach areas and hidden treasures!\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\n1 player\nDUALSHOCK®4\nRemote Play\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2019 IDEA FACTORY / COMPILE HEART All rights reserved. Death end reQuest is a trademark of IDEA FACTORY. Licensed to and published by Idea Factory International, Inc.\n\n©2019 IF / CH All rights reserved. (or without All right reserved depending on the product size)","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Idea Factory","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":292945,"name":"7th Sector","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1be/1befe403d9117aafb92105f13078e98e.jpg","description":"7th Sector invites you to dive into the mysterious world of cyberpunk and overcome a difficult path by solving various technical puzzles, facing dangers and collecting information about the world and the events happening in it. In this journey, you will controll several \"characters\", who has its unique abilities and connect to various technical devices, interaction with which may affect the final game.\nFEATURES\nDiverse and unique puzzles.\nControl of several characters during the game.\nAtmospheric soundtrack from \"Nobody's Nail Machine\"\n4 variants of final","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Sometimes You","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":61218,"name":"9 Monkeys of Shaolin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/929/9295b656bb657a565a80a45e898f2f8c.jpg","description":"\"If you know the enemy and know yourself, you need not fear the result of a hundred battles. If you know yourself but not the enemy, for every victory gained you will also suffer a defeat. If you know neither the enemy nor yourself, you will succumb in every battle\".\n- Sun Tzu, The Art of War9 Monkeys of Shaolin - marks a true rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely for you!\nAs a mere Chinese fisherman Wei Cheng you have to avenge the death of your friends and family slaughtered in a pirate raid at your peaceful village. Game protagonist is quite a tough nut to crack as he knows the basics of ancient martial arts only mastered by legendary Shaolin monks. Get your trusty battle staff ready for a challenging adventure in Medieval China and for merciless fights with hordes of various enemies.\nAction-packed battles, user friendly controls and incredible atmosphere of great kung-fu movies of 70s – all this makes 9 Monkeys of Shaolin a perfect choice for every true fan of really hardcore brawlers.Features:3 unique fighting styles: fight on earth, in the air or use mysterious magic seals. Combine these elements to defeat every enemy on your way.\nCaptivating narrative: discover the fascinating story of Wei Cheng and follow him as he rises from a simple fisherman to the master of Shaolin martial arts.\nStunning visual style: unlikely combination of historical and mystical elements gives you an exciting experience from every scene appears on screen.\nExtensive character development system: you learn a great deal of ways to victory as you discover various unlockable perks, items and fighting styles.\nMore than 25 different levels: Chinese villages, pirate ship, Buddhist monasteries, Japanese mansions, ancient ruins and many more.\n10 types of Chinese and Japanese polearms, each with its unique traits. Discover the landscapes to find new items!\nCo-op play: invite your friend to help you fight through growing waves of enemies and complete the game together.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Sobaka Studio","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":60629,"name":"Lynne","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c71/c713574bc04c93445ec30e2c30289707.jpg","description":"Fifteen-year-old Lynn has never had the easiest life, but things have become even worse thanks to her upcoming GCSEs. Her parents are always arguing, her big sister is pregnant, and Lynn is terrified that, come exam time, she’ll fail everything and disappoint her entire family.\nTo make matters worse, Lynn’s been suffering from recurring bad dreams that are cryptic, unsettling, and often violent. Curiously enough, these dreams often revolve around a girl from her school called Lynne, who looks so similar to Lynn it’s almost unsettling.\nAs Lynn’s interest in Lynne begins to border on obsession, Lynn’s grasp on reality begins to grow more and more tenuous.\nWill Lynn be able to pass her exams – or will her own fears and anxieties consume her?\nAround 20,000 words of text\n1-2 hours of reading\nA kinetic story, with no choices/branches\n800x600 display\nAn original soundtrack\nSuffering!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"ebi-hime","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":47444,"name":"Google Spotlight Stories: Pearl","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/107/107753250cadae60a95a4d2a0378a1b6.jpg","description":"EMMY AWARD-WINNER OUTSTANDING INNOVATION in INTERACTIVE STORYTELLING 2017\nACADEMY AWARD NOMINEE BEST ANIMATED SHORT 2017\nGoogle Spotlight Stories presents Pearl in VR. Set inside their home, a beloved hatchback, Pearl follows a girl and her dad as they crisscross the country chasing their dreams.  It’s a story about the gifts we hand down and their power to carry love. And finding grace in the unlikeliest of places.\nDirected by Patrick Osborne","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Google","platforms":[{"id":0,"name":"PC"}]},{"id":42371,"name":"Haunted Memories","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19e/19e6b7500640e9e2b248134ee17b937e.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"MadMan Theory Games","platforms":[{"id":0,"name":"PC"}]},{"id":35176,"name":"Dominion","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a4b/a4be19330d94fd3827ac8a2104f61961.jpg","description":"Dominion is the game that started a new genre:  Deckbuilding.  Winner of the Spiel des Jahres in 2008 and many other awards, Dominion has established itself as a true classic.  With more than a dozen expansions currently available, players will always be able to find new challenges.\nIf you have never played Dominion before, start here with the basic game.  There are millions of different combinations that can be played just with Dominion alone.  Each game is different but only lasts twenty to thirty minutes.  It's great for one player but just as fun with two or more players.GOAL\nThis is a game of building a deck of cards. The deck contains your resources, victory points, and the things you can do. It starts out a small sad collection of Estates and Coppers, but you hope that by the end of the game it will be brimming with Gold, Provinces, and the inhabitants and structures of your kingdom.GAME IDEAYou are a monarch, like your parents before you, a ruler of a small pleasant kingdom of rivers and evergreens. Unlike your parents, however, you have hopes… dreams! You want a bigger kingdom, more pleasant, with more rivers, and a wider variety of trees. You want a Dominion!\nIn all directions lie fiefs, freeholds, and feodums. All are small bits of land, controlled by petty lords and verging on anarchy. You will bring civilization to these people, uniting them under your banner. But wait! It must be something in the air; several other monarchs have had the exact same idea. You must race to get as much of the unclaimed land as possible, fending them off along the way. To do this you will hire minions, construct buildings, spruce up your castle, and fill the coffers of your treasury. Your parents wouldn’t be proud, but your grandparents, on your mother’s side, would be delighted.\nFeatures\n2 - 4 player with network multiplayer (Up to 6 players with Intrigue Expansion)\nSolo play against varying AI difficulties\nThirteen expansions and three promo sets available for purchase\nPass and Play mode\nTutorial & Rules\nJumbo Mode for accessibilityContents\nDominion includes three basic Treasure cards, three basic Victory cards, Curses, and twenty-six Kingdom cards.  Kingdom cards like Smithy, Throne Room, Militia, Gardens, Witch, Chapel and Village introduce the cornerstone mechanics of Dominion and serve as archetypes for variations seen in later expansions. The major strategies of Dominion, including engine-building, big money, slog, rush, and combo can be traced to cards from this basic set.Digital Optimizations and Custom SettingsMoat - You can opt to automatically always react with Moat\nMoneylender - You can opt to automatically always trash a CopperAwards & Prizes","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Temple Gates Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":31605,"name":"Soldier of Fortune","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89f/89fd7840387a2bc445a12a1375a87b49.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Raven Software","platforms":[{"id":0,"name":"Dreamcast"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":28964,"name":"James Bond 007: Blood Stone","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25e/25e35e7b96b0173b4f285baa1222eca0.jpg","description":"The Games on Demand version supports  English, French, German.  An international conspiracy has placed the UK’s most secretive bio-chemical project into deadly hands, and only Her Majesty’s most lethal agent, James Bond, can unravel the mystery. To navigate through layers of corruption, you, as Bond, will embark on a global chase that will have you battling on land, sea, and air through Athens, Istanbul, Monaco, and Bangkok. Nothing is what it seems as each adventure reveals a deeper more sinister conspiracy. Engage in precise cover™ based gunplay and tactical firefights, and speed your way through explosive adrenaline-fuelled driving sequences. Become Bond as he engages in intense hand-to-hand combat and uses his environment to finish off enemies. Take the battle online in 16-person multiplayer mode that requires skill, teamwork and strategy as you compete in matches that will have spies battling mercenaries. In the fight to prevent the world’s most dangerous weapon from falling into the wrong hands, you’ll need to be the ultimate secret agent.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"n-Space","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":22728,"name":"Jagged Alliance: Deadly Games","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/189/18953e3b95307fc84611d35197c7a3cc.jpg","description":"The enemy is on the run. One more mortar shell should take them out. Still, you have to blow up the bridge by sundown, and Postie is starting to talk to himself again. Maybe you shouldn't let him keep that dynamite...\nLock and load: it's time for Deadly Games. From the makers of Jagged Alliance, 1995's Game of the Year (Power Play magazine) comes the multiplayer strategy game chambered with new features.\nMore ways to play. Play the new solo campaign or choose multiplayer mode via your network connection.\nMore power. The included scenario editor provides infinite replay ability. Create your own maps, traps and enemies. Use the campaign editor to create your own deadly games.\nMore mercenaries. Choose from 70 different mercs, including 10 new ones - plus all 60 of the original Jagged Alliance mercs.\nMore weapons. Fun new war toys include mortars, grenade launchers, boobytrap kits and more!\nMore terrain. Skirmish through jungles, deserts, towns and frozen wastelands.\nAnd more attitude than ever!A highly requested multiplayer mode for the icon of turn-based tactical games\nAn abundance of authentic weapons and equipment\nDozens of extremely challenging missions that will put your tactical acumen to the test","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"Sir-Tech","platforms":[{"id":0,"name":"PC"}]},{"id":16924,"name":"Marble Duel","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/713/71388168100f9e83248de57414c6a333.jpg","description":"Special Offer\nAbout the GameMagic duels are the way to solve any dispute in a kingdom conquered by the cruel witch and her minions. Every monster you encounter will challenge you, but the power of spells will help you destroy the enemy. Master and improve the destructive power of the spheres and you will become the most fearsome mage ever! Now is not the time for mercy. It's time to eradicate the evil!FeaturesWin duels. Master the ancient power of magic spheres!\nDevelop your hero. Level your mage up to Legendary!\nUpgrade your spells. Improve your magic skills from duel to duel!\nMeet extraordinary characters. Be prepared to find very unusual allies.\n-----------------------------------\nKeep track of HeroCraft game news and updates!\nhttp://www.facebook.com/herocraft.games\nhttp://twitter.com/herocraft\nhttp://youtube.com/herocraft","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"HeroCraft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":13112,"name":"Jenny LeClue - Detectivu","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6fa/6fafff4b9b2843c7b038df1a82b0cdce.jpg","description":"Jenny LeClue is a handcrafted adventure with memorable characters, a unique aesthetic, and an epic tangled mystery. It’s also a coming-of-age story about the blurred lines between right and wrong.\nThis is a game about your choices and how they affect Jenny and the author’s story. It’s a rich metanarrative with delightful surprises and interactions. Jenny LeClue also explores mature themes, complex characters, and an epic tangled mystery.\nYou play as Jenny, a brilliant young detective, living in the idyllic college town of Arthurton. Jenny is a sharp-eyed, relentless pursuer of the truth. But nothing exciting happens in Arthurton, and Jenny longs for real adventure.\nJenny gets more than she bargains for when her mother is accused of murder, and begins an unexpected journey to find the truth.\nShe soon discovers every cloud has a dark lining, and nothing in Arthurton is what it seems. Unseen forces will stop at nothing to keep Jenny from the truth. And she will have to use all her skills of deduction to find the real killer.FeaturesBeautiful handmade Art StyleSleek and gorgeous hand drawn style with vintage midcentury aesthetics.A Living WorldThe goal is for everything to be interactive, to reward players who poke and prod at every last item and object with insight, secrets, and humor.Choosiness On A Massive ScalePlayers will make choices in their individual game, and some of those choices will be tallied to permanently influence subsequent chapters, essentially \"writing\" the story collaboratively. The choice players make about the cliffhanger ending of episode one determines the beginning of episode two.Female ProtagonistJenny is a brilliant young detective, sharp eyed, intuitive and a ruthless pursuer of the truth.Dialogue With A TwistJenny is able to move the camera around during dialogue scenes and observe the subject for visible clues that might reveal their guilt or innocence that would otherwise go undetected.Story Within A storyJenny LeClue weaves a rich metanarrative. The \"author\" of Jenny's adventures, Arthur K Finklestein, acts as narrator and guide, but his presence also allows you to change the way Jenny's story is written. Players choices will also affect Finklestein’s own story.Not Just For KidsComplex relationships will be explored with themes of family, loss, and identity influenced by horror, sci-fi, and mystery genres.A Diverse Cast Of Characters & LocationsExplore Arthurton’s expansive world including the abandoned mines, the forgotten graveyard, the misty mountains, the old observatory, the police station, the shops and eateries on Main Street, and Gumboldt University's Library. You will meet many intriguing and suspicious characters, in a town whose population is representative of the US Census demographics.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Mografi","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":11420,"name":"Nick","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c0c/c0cf11dc099238e49f29b5beda148334.jpg","description":"Time to kick some ChristmASS.\nNick is a free VR survival shooter defense game. Built in the Unreal engine, this first-person, room-scale VR experience lets users take control of a variety of weapons and tools to fight off endless waves of evil robotic elves. As Santa, users must move around the environment to set up defenses and dodge attacks to beat back the onslaught. 'Tis the season!\nKEY FEATURES:\n- Step into Nick’s boots to make a last stand in this room-scale interactive VR experience.\n- Face crushing waves of deranged killer robo-elves with different powers and abilities.\n- Use the “Santa’s Little Helper” suction gun alongside your trusty mallet to turn everything around you into a weapon.\n- Board up windows, stoke the flames and set traps to fortify your defenses between waves.\n- Christmas Easter Eggs (oh, the irony) abound!\n- Save the holidays. Well, you can’t... But you can hold out as long as possible.\n- Nick is compatible with the HTC Vive\nBACKGROUND:\nThe year is 2027. Civil unrest grips the North Pole. Santa Claus, a Rockefeller-ian captain of industry and a figure of hope and progress, has fallen on hard times. His once insurmountable manufacturing empire has given up massive ground to the dual-pronged threat of overseas production and digital distribution.\nIn order to keep up with a changing manufacturing landscape, Santa decided to automate his workshop by installing a mechanized, robotic production system led by an Artificial Intelligence named P.A.L. (Polar Algorithmic Computer). For the first few months, everything seemed copacetic. Then came an efficiency test… that Santa, by dint of being flesh and blood as opposed to mechanical marvel, inevitably failed. P.A.L. repurposed the once-peaceful robo-elf manufacturing arm into an army bent on assassination, and set out to wipe Santa from the face of the Earth. Why? To maximize profits, of course!\nEnter Nick—Santa Claus’ badass survivalist alter ego. Nick’s on the run, evading and fighting P.A.L.’s robot forces as he traverses the Polar wasteland. Fueled by weapons-grade eggnog and righteous Christmas wrath, he's made it to his final outpost: a remote satellite workshop originally meant for experimental toy R&D. Here, Nick readies his defenses, makes peace with his maker and prepares to make his last stand in. That’s where you come in…","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nickelodeon","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":10508,"name":"Ninja Stealth 2","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/95e/95e4b61d0ca9cac916332031df9e3a70.jpg","description":"Ninja Stealth Collectionhttp://store.steampowered.com/app/485450/Ninja_Stealth/\nhttp://store.steampowered.com/app/552950/Ninja_Stealth__Supporter_Edition/\nAbout the GameNinja Stealth 2 is the sequel of Ninja Stealth - A.I. Revolution, now as a RPG with more puzzles than sensors.The Game:38 new levels to explore\nThe final part of the story\nNew puzzles\n2 different endings, your choices will decide which one you will see!\nAnd a radioactive dog as your friend...","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SC Jogos","platforms":[{"id":0,"name":"PC"}]},{"id":9864,"name":"The Isle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0f8/0f877afe45beb6db4be762a2a9b99137.jpg","description":"DISCLAIMER: THIS GAME IS IN EARLY ACCESS. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT THE DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE SERIOUS ISSUES AND POSSIBLE INTERRUPTIONS OF INTENDED GAMEPLAY FUNCTIONALITY.Foreward and CautionFirstly, thank you for looking at and possibly considering the purchase of our game. Despite the fact we aspire to create a fun game approachable by many, we feel the need to caution any potential users. We have begun updating the game towards the point of intended hardcore functionality. As this happens, difficulty will gradually become more brutal and chances of survival become less likely. We, the developers, are actively going to design the future game islands and creatures to counteract known player tactics of survival. Your mistakes will be punished. Expect no survivors.The Isle: A World Designed to Kill You\nThe Isle is a realistic, gritty, open-world survival horror game. There is only one goal in mind: Survival. The islands and its inhabitants will radically change, ever-evolving as players themselves learn how to survive. There are no waypoints, tutorials, or ulterior precepts in mind to alter play styles or purpose. In the end, the only person you can trust is yourself.KEY FEATURES IN EARLY ACCESS\nThese features are currently in the game and though they are listed, may have bugs that have not been discovered or addressed.\nThe Island: A vast landscape of dense jungle and open plains, hidden within are various ruins and expanses that hold insight as to what was here...\nUp to 100 players per server based on server hardware and bandwidth.\nProgression System - Start as a defenseless creature and work your way up to the mighty titans of the prehistoric era, falling all the way to the bottom of the food chain upon death.\nBasic Dinosaur Simulation - Basic needs such a thirst and hunger are present. Stalk your prey and avoid your predators among the dense forests and swamps.\nPlayable Dinosaurs - Choose between more than 15 playable dinosaurs such as Austroraptor, Carnotaurus, Tyrannosaurus Rex, Gallimimus, Utahraptor, Acrocanthosaurus and Allosaurus, with many more planned ahead.\nDedicated Server Binaries with Steam integration\nBasic Dinosaur AI\nAn expansive island stretching larger than 16x16km²Planning Ahead: The Future Development Goals\nWe realize that there is a long road ahead and a lot of work to be done in order to turn this into the dinosaur game we want it to be. Throughout the year, we will be adding a lot more to the Isle based off of current planning and user feedback Some of these features are as follows:\nMac/Linux/Steam OS Support\nFull Mod Support - Skins, additional dinosaurs, and various gamemodes such as deathmatch and a tycoon sim\nAdditional Steamworks Features - Achievements, Trading Cards, etc.\nVR Support\nLocalization of all Game UI/Text\nRealistic Dinosaur AI with complex ecosystems\n20+ Playable Dinosaurs\nCannibal Faction implementation\nMercenary Faction implementation\nPlayer Crafting System implementation\nBase Capturing\nDynamic Aerial Drop-In Spawn System\nHuman/Dinosaur Body Painting\nDinosaur Capturing and Training\nAdvanced Vehicle System\nImproved Sound FX, including regional sound localization\nImproved and expanded vegetation system, including interactive foliage\nFunctional Steam economy\n\"The Escape\" global in-game world quest\nAside from the necessity of community feedback finds for bug fixes, content suggestion, and creative feedback, the Isle will have a post-release content structure after Early Access has been polished to the best of our ability.Unique Triple-Faction Gameplay\nChoose between three playable factions and find yourself stranded on a merciless island of harsh wildernesses, rampaging dinosaurs, vicious cannibals, lethal mercenaries and rival players. Explore dark and foreboding jungles, unforgiving swamps and beautiful but deadly mountain vistas for the supplies you will ultimately need to survive. As you progress and explore, you will happen across ancient ruins and abandoned military bases that, with perseverance and time, can convert into your own outpost or nesting ground in this hostile world.\nAs the Mercenary, you'll experience a sense of both wonder and terror as everything on the island has evolved to kill you. However, you will find yourself armed to the teeth and more than capable when it comes to survival skills. Nothing will stand in your way... so long as you still have ammo.\nAs the Cannibal, you will find yourself in-tune with the natural environment. Capable foragers and natural hunters, you will form tribes or survive alone. Armed with spears, bows, poison, and makeshift camouflage, you must be as ruthless as the beasts among you.\nAs a Dinosaur, you'll be the epitome of cunning and ferocity. From the small agile Austroraptor to the unstoppable Tyrannosaurus Rex, you will survive from being a juvenile until adulthood, forming packs, creating and defending your nests, hunting prey, and claiming territory. All roads lead to death, or becoming the apex predator of the island.A Global Community Story\nThe Isle features a narrative told strictly through the environment, achievable only through immense cooperation among players. Hidden locations and artifacts are dynamically created within the open world that reveal the answers to all the questions that would arise. Why are you here? Why dinosaurs? What is causing them to mutate? Why can’t you just leave? It will take the entire global community to unravel the purpose to their being on the Isle and each discovery will directly affect the future of the game.Become the Beast\nOne key focus of the Isle is the unique element of playing as dinosaurs and other creatures found on the islands. All will have a general familiar play-style, while each retain their own uniqueness of capability. Players can select a variety of creatures and grow from juvenile to adulthood. As your dinosaur grows, you can select different palette options and skins, growing your abilities to hunt, create your pack, and eventually mutate into a much powerful version of your dinosaur and claim the right as the Apex.Unparalleled Mod Support\nWe will support all the features of Steamworks and allow for any aspect of the game to be modded by the community using Steam Workshop. Members of the community will be able to download a free copy of Unreal Engine 4 from Epic Games and generate mods and change all aspects of the game. This includes everything but not limited to making a new map, adding new dinosaur types or new game modes such as a Dinosaur Park Simulator or a role playing focused game mode.\nYou can subscribe to mods on the workshop and select what ones you want enabled when you start your server. Players joining the servers will automatically obtain the required mods without even needing to restart the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"The Isle Development Team","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":5350,"name":"Tom Clancy's Rainbow Six","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/179/179d5f26a11e0ee44769b4ee500345db.jpg","description":"Purchase this PS one® Classic and play it on both your PS3™ and PSP® (PlayStation®Portable) systems!\n\nTom Clancy's Rainbow Six® pits you as the commander of an elite counter-terrorism squad, and you will have to plan and execute complete a variety of covert operations to take down terrorists and make the world a safer place. Assemble your team from an international pool of special operatives and select from authentic gear and weapons to help you complete your missions.\nDownload this PS one® Classic today!\nKey features:\n-Explosive Action - Lead an elite counter-terrorist strike force battling international terrorism in realistic settings\n-Real-Life Strategy - Plan out the insertion points and attack strategy, and execute your plan to fulfill the objectives\n-Customization - Pick the best operatives for the mission and customize their uniforms and equipment load-outs to match the mission objectives\n-Practice Makes Perfect - Hone your skills on the Training Level where you can go through basic training, hit the shooting range, and carry out a practice mission\nTransferring to a PSP® system from your PS3™ system:\nYou must be signed into the PlayStation®Network account that originally purchased the game.  You must have at least 113 MB free on your Memory Stick Duo™.  Connect your PSP® system to your PS3™ system with a USB cable and switch your PSP® system to USB Mode. Highlight the game on the PS3™ XMB™, press the Δ button and select Copy.\n\nPC Store Customers:\nLog into your PlayStation®Network account that you originally used to purchased the game.  Then, download the game from your “Download List” in the PlayStation®Store onto your PS3™ system.\nThis title has been converted from the original PlayStation® disc to the PSP® and the PS3™ systems. Consequently, there may be times where the title plays differently from the PlayStation® disc version, or where some features may not function properly.  This version does not support PlayStation® peripherals (controller, memory card, multitap, etc.), therefore functionalities such as multiplayer, versus, and co-op modes are not available.\nPurchase indicates acceptance of the PlayStation®Network Terms of Service/User Agreement and this item's use restrictions.  If you do not wish to accept all these terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems and 2 portable systems that are associated with the purchasing account.\nRainbow Six ® © 2007 Red Storm Entertainment.  All Rights Reserved.\n\"PlayStation\", \"PS\" Family logo, and \"PSP\" are registered trademarks of Sony Computer Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":1998,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Dreamcast"}]},{"id":3484,"name":"Final Horizon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8c9/8c98852ee8f7a9891bb97ddf707be8d4.jpg","description":"Final Horizon is a fast paced action packed strategic tower defense game like you've never seen before. Space Invaders just turned nasty.\nBuild and upgrade your defenses to fight off the Swarm invaders. Research weapon upgrades to level up with deadly effect. Build up enough kills to unleash one of the five powerful kill-streak attacks.\nFight the Swarm across 3 solar systems, 15 planets and over 50 levels. Replay missions and complete over 100 objectives to earn a Platinum Trophy.\nSome functions and features may not be available on PlayStation TV.\n1 player(s)\n1024KB Minimum\nTouchscreen\nDual Analog Sticks\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®Vita systems associated with this Sony Entertainment Network account.\nCopyright © 2014 Eiconic Games Ltd","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Eiconic","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":2004,"name":"Kung Fu Rabbit","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/414/4143f289242c6d39e98ab3751ebef2f0.jpg","description":"IMPORTANT: Kung Fu Rabbit is not compatible with iOS 8\n\"Kung Fu Rabbit is a no-brainer for the platforming fan.\"\n- Gamezebo\n\"A lot of care and love has gone into Kung Fu Rabbit\"\n- SlideToPlay\n\"Platform gamers will want Kung Fu Rabbit to hop onto their iOS device.\"\n- 148apps.com\n\"The pitter-patter of rabbit feet is a great little soundbyte\"\n- Capsule Computers\n\"The music and sound effects are all very oriental and that enhances the entire ‘Kung Fu’ feel big time!\"\n- Appcroc.com\nLife in the temple of rabbits hangs by a thread. Universal Evil has once again run rampant, and kidnapped all of your students. Only you barely managed to escape the raid. They left you alive… They'll regret it!\nUse your agility and combat abilities to save all of your students! Jump from roof to roof, slide gracefully along walls, sneak up on your enemies and rip them to shreds!\nDetailed graphics, humor, hours of gameplay and intuitive controls. Each of the 70 levels requires logic, precision, agility and lots of saber rattling. The game also has lots of trophies to win, babies to save, carrots to eat, and a Universal Evil to expunge.\nSaluted by the critics for its exemplary controls. Discover the platform game of the year!\nBuy Kung Fu Rabbit now and plunge into its exciting world!\nFeatures:\n- 70 levels in normal and hard mode (dozen hours of play!)\n- Universal application. Works on iPad.\n- 15 unlockable items to customize your Rabbit.\n- Playable on Apple TV in a 720p resolution.\n- Arcade controls\nWant to find out more? For more information, visit:\nctools-studio.com/\nfacebook.com/cTools.studio\ntwitter.com/cToolsStudio\nbulkypix.com\nfacebook.com/bulkypix\ntwitter.com/bulkypix","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Bulkypix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"iOS"}]},{"id":681467,"name":"ELYON","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e0c/e0c422e4c105c6dd3773967d554ea992.jpg","description":"The world is in turmoil - Vulpin and Ontari are at war for the control of Elyon, a portal leading to paradise, soaring high in the sky. Meanwhile, the Dark Apostles are invading Harth from another dimension through a space-time rift, their objectives still unknown.Massive Realm WarsAlong each faction's territorial borders lie fortresses packed with manamechs, artillery, and soldiers. Both factions are called to hold their ground in massive Realm vs Realm wars!\nExtensive Skill CustomizationA plethora of skill addons, runestones, and \"Mana Awakening\" are at your disposal. Combine them and create your own combat style, from bursty glass-cannons to tanky front-liners.Dimensional PortalsCross these purple-shaded portals to reach planes filled with rich resources that will help you get stronger, but be prepared - both factions have unrestricted access to them.DungeonsGather your friends to tackle fearsome bosses with complex mechanics and multiple phases. Feel like challenging yourself? Enter the solo floor-based dungeons and test your limits!\nChoose Your PathWhether you are a solitary traveller, looking for a party, or fighting with a Clan, a vast open world awaits, filled with all kinds of challenges and secrets - on the ground, and in the air. Field bosses, treasure hunts, riddle quests, instanced & open world housing, lifeskills, and so much more await!\nLooking for a place to talk about Elyon? Join our Discord server!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Krafton","platforms":[{"id":0,"name":"PC"}]},{"id":376982,"name":"Table Manners","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/544/544ffaa1584e248d2536b0606187bdb1.jpg","description":"Table Manners is a single-player turn-based strategy game set in the Regency Era at a series of dinner parties. Your aim? To insult, belittle and humiliate other party guests until they are forced to excuse themselves. The last person standing is declared the winner.\nA full-length campaign chronicling your rise to infamy\nDozens of classes to unlock, each with a unique special move and passive bonus\nPredict your opponents' behavior, forcing them to waste their abilities by anticipating attacks and parrying them\nChoose the perfect team to take along to encounters, dominating dinner parties even when the odds are stacked against you\nOutsmart, offend, overcome. Go down in history as the sharpest-tongued dukes and dames in the county.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Maybe Later Games","platforms":[{"id":0,"name":"PC"}]},{"id":351828,"name":"DOOM II (25th anniversary)","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/06d/06d8db066881440a7cb5518fcdd8b92e.jpg","description":"Celebrate DOOM's 25th anniversary with the re-release of DOOM II. This beloved sequel to the groundbreaking DOOM (1993) gave players the brutal Super Shotgun to bear against deadlier demons, and the infamous boss, the Icon of Sin.\nThe re-release of DOOM II includes:\n- The Master Levels, 20 additional levels made by the community and supervised by the developers\n- Local 4 player multiplayer\n- Local 4 player co-op\nTo save Earth, you must descend into the depths of hell, survive demon hordes, and take part in the fiercest battle ever.\n1-4 players\nDUALSHOCK®4\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nDOOM® II ©1994-2019 id Software LLC, a ZeniMax Media company. DOOM, DOOM II, id, id Software, id Tech and related logos are registered trademarks or trademarks of id Software LLC in the U.S. and/or other countries. Bethesda, Bethesda Softworks, ZeniMax and related logos are registered trademarks or trademarks of ZeniMax Media Inc. in the U.S. and/or other countries. All Rights Reserved.\nBethesda.net account required. See end user license agreement, Terms of Service, Privacy Policy and additional details at bethesda.net.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Nerve Software","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":51149,"name":"Hidden & Dangerous: Action Pack","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddf/ddf9518eaeece66f3ab22ac96a148723_Yq1vaHN.jpg","description":"Hidden & DangerousThe year is 1941. Your special forces team has been shot down deep inside enemy territory and it's now reliant on your cunning and tactical thinking to get them safely across the border. The odds are stacked against you. Have you got what it takes?Hidden & Dangerous: Fight for FreedomIn 1941, Captain David Stirling gathered an elite group of soldiers and founded what was to become one of the most powerful Special Forces agencies in the world--the British Special Air Services. Only the strongest, swiftest, and most daring were allowed to join the SAS; their bravery in battle was second to none.\nNow YOU can become a member of the SAS! Hidden & Dangerous: Fight for Freedom adds new missions and campaigns to Hidden & Dangerous. Guide your 4-man squad of covert paratroopers deep into enemy territory during World War II. Either blow up the bridge or blow the mission...the choice is yours. Hidden & Dangerous: Fight for Freedom raises the bar for squad-based games to new heights; can you handle it?\nTake control of genuine World War II vehicles!\nBuild your squad from a roster of 40 international commandos. Equip them with guns, explosives, and surveillance gear!\nGuide your team through sniper-packed forests, underground tunnels, and deadly city streets.\nOverhead map lets you synchronize split-second maneuvers!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Illusion Softworks","platforms":[{"id":0,"name":"PC"}]},{"id":49282,"name":"Decksplash Free Week","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ed/7edaae6ac7681d763ae551e6e0162478.jpg","description":"What’s Decksplash?\nFlaunt your deck control and gain the respect of your squad by building monster combos and dropping them hard on the rookies opposing your team. Your innate mastering of the trick system will allow you and your team control of the arenas and ultimately the game!Why a Free Week?\nLike any proud parent, we love Decksplash, but unlike deluded creators, we want to believe that you love it too. Thus we’ve devised a ‘first of its kind’ experiment: The Splash N’ Grab! We’re releasing the game free for a week AND if 100K people download, play, and have fun, we’ll instantly launch the game at the end of the free week. If not… RIP Decksplash.\nThe game’s future is in YOUR hands. We hope you have fun being a part of gaming history! (However it turns out -- fingers crossed...)Splash N’ Grab?\nIt’s simple:\nGet In\nGet Splashing\nGet the Game Released\nShare the fun with friends, family, lovers, acquaintances, fans, pets, and enemies to get them playing as each person counts towards the overall progress of the meter above!\nHere’s a handy little link to get you started with sharing the love.\nYou Will Be Rewarded!\nDuring the Free Week, All players will be pleased to hear that all your loot, levels and coins will be carried across to the full version of the game as a reward.\nAim high and if you reach the top of the leaderboard, finding yourself looking down on those around you with a total to rival the devs, enjoy the smug feeling that comes with being king of the deck.\nAnd for this one week only, you’ll be able to unlock and keep the Eirik board set, giving you a unique part of Decksplash history that no one else will be able to get.\nYou help get 100K people playing, you help get the game get released and we will bow down to you; forever remembered as a champion among mortals!Key Features\nCompetitive 3 vs. 3 - Take part in fast and furious matches which will pit your deck-splashing abilities against others looking to prove their skills.\nDank Skrilla - Earn yourself loot boxes with new board designs by taking on your opponents in incalculable fashion.\nParty Up - Nothing says BFFs than the squad getting their decks out to splash with complete strangers!\nGetting TRIꓘT out! - As you flip and spin through the air, you’ll be accredited for each trick you pull off with its real world counterpart.\n2ManyBoardz #FirstWorldProblems - Play with any of the freaky fresh boards, each designed to have its own unique personality and flavour.\nFull 3D Controls - Become the master of dimensions as you spin your board in full rotation of the X, Y AND EVEN Z AXIS! (Wow, it’s the future we were promised, eh?)\nShock the Competition - See the cool kid on the block tryna prove themselves? Decimate them with a shockwave, throwing them through the air and destroying their combo.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Bossa Studios","platforms":[{"id":0,"name":"PC"}]},{"id":42405,"name":"Kingdom Hearts HD 2.5 ReMIX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b54/b542d8ff41fddb6f5dd45aa27bc293c5.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":41680,"name":"Kingdom Hearts HD 1.5 ReMIX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/287/287abdde7547395c128a5dfe1cd213fd.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Square Enix","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":38360,"name":"Turok (2008)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/517/51755704a6787db74f9b813932bc8869.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Aspyr Media","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":37818,"name":"Jagged Alliance 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/529/529ea4e8639c027e3b1d40fb46af9588.jpg","description":"Grand Chien, a nation of rich natural resources and deep political divides, is thrown into chaos when the elected president goes missing and a paramilitary force known as “The Legion” seizes control of the countryside. Now, the President’s family has pulled together all their resources, including an arrangement with the powerful Adonis corporation, to hire a group of skilled mercenaries tasked with finding the President and bringing order back to the country.\r\n\r\nIn Jagged Alliance 3, select from a huge cast of mercenaries all with their own unique personalities, quirks, and backstories. Then go out and explore Grand Chien as you meet new people, earn money, grow your team, and ultimately make your own decisions that will decide the country’s fate.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Haemimont Games","platforms":[{"id":0,"name":"PC"}]},{"id":23935,"name":"Splatoon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2f/c2f94f3fefa98453f33f2b6abb6ae103.jpg","description":"Splatter enemies and claim your turf as the ink-spewing, squid-like\ncharacters called Inklings in Nintendo's new third-person action shooter\ngame for the Wii U console.\n\nCompete in four-on-four matches, in which the goal is to get your ink on\nas many places as possible and claim your turf, all while strategically\nsubmerging yourself in your team's colors and blasting your enemies.\nThis is a colorful and chaotic online third-person action shooter –\nexclusively on Wii U.\n\nFEATURES:\n\nFresh content\n\nNew weapons, modes, maps, gear, and more have been added to Splatoon,\nwith more rolling out through summer 2015. Plus, regularly scheduled\nSplatfest events let you choose a side and battle your way to victory\nwith other players around the world!\n\nOnline* team matchmaking:\n\nCreate a squid squad with your friends in Squad Battle mode.\n\nJoin up to seven friends in Private Battles—you choose the map and the\nrules.\n\nGet teamed up with other players for 4 vs. 4 matches in Turf War or\nRanked Battle modes.\n\nRamp up the intensity with Ranked Battle modes which include three\nrotating modes: Splat Zones, Tower Control, and Rainmaker\n\nPlay to win and boost your player ranking or level, or get in-game\ncurrency to spend on gear upgrades.\n\nThink while you ink\n\nStrategy is everything. Defeat enemies to splatter them in an\nexplosion of ink, covering more turf for your team. But choose wisely:\nPlayers who only go after the enemy might find their turf redecorated\nin their enemies' colors.\n\nRefill ink tanks, hide from opponents or move faster by turning into a\nsquid and diving intoink with the tap of a button.\n\nCovering more territory with ink unlocks powered-up super weapons that\ncan be used to attack rivals or cover more turf.\n\nMore ways to play\n\nSelect between multiple control options on the Wii U GamePad\ncontroller, including using gyroscopic controls to look around,\nallowing for better aiming and control.\n\nHone your skills in Octo Valley, the single-player mode that will have\nyou inking, splatting, and squidding through platforming puzzles as\nyou take on the Octarian army.\n\nBattle a friend one-on-one at home in a balloon-splatting contest in\nBattle Dojo.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"}]},{"id":19684,"name":"Bientôt l'été","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c4/6c439a0962dd73a384957a6a2ddcc597.jpg","description":"Bientôt l’été is a videogame for two players. Two players who pretend to be lovers. They pretend to be lovers separated from each other by lightyears of deep space. They have lonely walks along the shore of a simulated ocean, thinking wistful thoughts of each other. Thoughts from ancient Earth literature by Marguerite Duras.\nThe empty beach, the strong wind, the gentle music and a small colony of electric seagulls are their only companions. Yet their heart is full and their mind confused. Walk along the shore, until they meet the emptiness.\nWhen it all becomes too much, they run towards each other. Enabled by intergalactic networks, they touch each other’s holographic bodies in cyberspace. A surreal game of chess becomes the apparatus through which they, man and woman, can talk. The words they have were given to them, as they have always been to lovers everywhere.\nThe sea remains, tugging at their hearts when not at their hairs and clothes, as it itself is tugged by the virtual moon. And as great as the desire for the other may be, they cannot stay away from the wind and the waves and the sand. Every time they find a new treasure. An abandoned tennis field. An heap of coal. A dead dog. Ordinary. Absurd. Meaningless. Yet comforting.\nEnter a café, exit a villa, enter a casino, exit the ruin of an ancient colonial mansion. We know this is not real. So it doesn’t surprise us. Nothing surprises us. It doesn’t matter when you feel the pain of love. Of being in love, of falling in love, of leaving in love. There is no such thing as time. There is only love. And it never stops. No matter how much it hurts.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Tale of Tales","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":18133,"name":"CABAL Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a97/a974d0b0911763f523d8b3612d28e39a.jpg","description":"Experience the revolution of action in ESTsoft’s original hit MMORPG, CABAL Online.\nCABAL Online introduces fast-paced, fluid, skill-based combat as never before seen in the MMORPG genre. Explore the sprawling and diverse lands of Nevareth, a stunning world that blurs the line between fantasy and science fiction. Play now for free!Experience\nSeven unique character classes each offering varied and dynamic play-styles\nChallenging time-limited dungeons featuring a ranking system and completion time leaderboards\nUnrivaled skill-based PVP combat featuring a unique and intuitive combo system\nPVP systems supporting all play-styles; experience intense and balanced team-matches in Mission Battle, enter the massive fray in Nation War, pick your own rules of battle in the Custom PVP Battle Arena, or roam the world freely to protect or plunder\nBattle Mode allows your character to take on entirely new forms featuring exclusive abilities\nEpic story-driven quests featuring travel across diverse landscapes and battles with deadly foes\nMount your Astral Board or Astral Bike and venture into the unknown, blurring the line between science fiction and fantasy\nA dedicated and established community filled with active players\nContinuous content updates ensure that CABAL Online evolves with time and always provides players with engaging new challenges and frontiers to explore\nCABAL Online is free to play, no matter how much time a player spends in the intriguing world of Nevareth. Time limited dungeons, blazing and fluid combat, challenging puzzles, an enthralling story, and a constant stream of new game content drives the exciting and action-packed experience that is CABAL Online.\nThis is your true calling. Go forth and become a champion of Nevareth.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"ESTsoft","platforms":[{"id":0,"name":"PC"}]},{"id":17796,"name":"March of the Eagles","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/148/1487b6d126efae7566626b9ba4601bbc.jpg","description":"“he Who Fears Being Conquered Is Sure Of Defeat.”\nThe war-game March of the Eagles focuses on the dramatic conflicts of Europe during 1805 to 1820. Explore one of the defining periods in European history with this experience crafted by the masters of Grand Strategy, Paradox Development Studio. The makers of Hearts of Iron and Europa Universalis now bring The Napoleonic War to life in this war-focused strategy game.Main Features\nTake command: Rise to power in the era of the Napoleonic Wars and move on to claim the control of Europe\nLead your nation: Attack your opponents and defend your nation’s border while the tension rises. Expand your nation with war, negotiation and keep your empire from falling apart\nEurope is at your feet: Explore a historical topographic map in full 3D with a complete view of Europe\nCommand your troops: Use the combat order system and manage your troops to secure as much power as possible\nExperience true warfare: Organize your armies, manage logistics, raid your enemy's supply lines and set the strategy for your armies, fleets and more\nUse diplomacy: Form coalitions against other major powers\nExplore the new idea system: Embrace new technology, military tactics and economical organization\nBecome the dominant power of Europe: Experience the Victory System that allows you to dominate the other powers on land and at sea\nMultiplayer: Battle against your friends in this heavily multiplayer focused game where you can engage in multiplayer for up to 32 players\nCustomize your game: March of the Eagles gives you the chance to customize and mod in detail to create your ultimate wargame","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Paradox Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":16875,"name":"The Tape","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/558/558864bc17c43b373ae68182d344c66e.jpg","description":"The Tape is a first person horror game, with found footage stylization, slow pace and creepy atmosphere.\nThe game relies mostly on creating heavy atmosphere, instead of a cheap jump scares. Some of the scenes you are witnessing in this game are the most disturbing in horror game history.\nThe game tells story of middle-aged detective, who is tasked with search of a young girl, missing in US suburbia. He travels to abandoned house to check some of his clues and reveals things so horrifying, that it make him question his own sanity.Features Explore dark and terrifying mystery of missing girl.\nFace horrible creatures and enemies.\nUncover the truth or atleast try to escape.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Kazakov Oleg","platforms":[{"id":0,"name":"PC"}]},{"id":14584,"name":"Descent: Road to Legend","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/556/5566ff9195f682f0c755ddfb532c81e8.jpg","description":"Road to Legend is a companion app for the Descent: Journeys in the Dark 2nd edition board game. When you play with Road to Legend, the app assumes the role of the overlord player, controlling monsters and inviting you to explore the dungeon in entirely new and unexpected ways.\nAt its heart, Road to Legend introduces a fully-formed, cooperative way to play Descent, freeing you and your friends to all play as heroes and defeat the darkness in Terrinoth. With a series of fully-formed quests and the ability to incorporate your entire collection of physical Descent expansions, Road to Legend provides a thrilling new variant on the classic Descent experience!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fantasy Flight Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":8611,"name":"oO","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/99c/99c35e88a5aff814c51d25d2abdb15ff.jpeg","description":"\"oO\" is a hardcore minimal \"dodge-em-up / runner\" arcade game.\nYou can try it by playing an earlier version on Kongregate for free: http://www.kongregate.com/games/targaciej/oo .\nThis one has updated graphics, better performance, bug fixes. By buying it you give me an opportunity to create more games.\nThank you for your support!\nMaciej Targoni","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Maciej Targoni","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":5568,"name":"Fireburst","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/03f/03f0cb770625841f3a70a3a26fc9b487.jpg","description":"Blast opponents off the road with Fireburst, an explosively fun fast-paced arcade style racing game with fantastic graphics. Rev up to scorching speeds to outrun opponents on a dozen different tracks, setting them ablaze in your flaming wake thanks to our exclusive Fireboost technology. Drive as sixteen sarcastic drivers with unique styles and taunts, using various explosive, fire-based special abilities to turn other cars into a pyre of parts. Leave opponents sucking on your smoldering dust in single-player mode, local four-player mode or the insane, firetastic online eight-player mode. Grab the wheel and burn some rubber.\nKey Features:\nChoose Your Death Ride – Get behind the wheel of 16 different vehicles including trucks, buggys, muscle cars and 4x4s. Win additional artwork and unlock other goodies as you turn opponents in piles of road ash.\nEccentrically Eclectic Characters – Choose from 16 original characters with unique personalities and nerve pinching taunts.\nFireboost Abilities – Turn every vehicle into a deadly hotrod with four fiery class-specific special abilities: Fireball, Fireblast, Firewall and Firewheels. Oh yeah!\nMaps Galore – Race on 12 single-player and five multi-player maps including docks, airfields, oil rigs, sewers and warehouses packed with shortcuts, obstacles and cool-down zones (to help extend your Fireboost).\nModes Aplenty – Play the single-player mode to complete challenges, create a custom race or simply smash AI opponents. Multiplayer modes include four-player local split-screen and eight-player online racing.\nHeart-Pounding Soundtrack – As if things weren't hot enough, the soundtrack includes Hawthorne Heights' rockin' hit single, \"Drive.\"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"IndiePub","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3252,"name":"Pier Solar and the Great Architects","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0a5/0a560c035e853fe0ebfccbc327fd1db2.jpg","description":"Being originally designed and developed for the SEGA Mega Drive & SEGA Genesis, Pier Solar is a turn-based RPG with state-of-the-art aesthetics about the journey of three young heroes from the town of Reja. In this prospered and peaceful town there live three best friends: Hoston, Alina and Edessot. Young and curious, they want to go on a herb-seeking quest to help cure Hoston's father's mysterious illness. Little do they know ... it will be the beginning of their lifetime journey where they will learn the true meaning of friendship and the thrill of adventure.\nThis journey will demand their courage and wisdom to solve a long-lost mystery while they face the forces of destruction dispatched by an evil man who is trying to change the world for his own good. Through this escapade, they will be reborn as great heroes to protect the universe from a mistaken purpose..What makes Pier Solar so special?\nPier Solar was originally designed and developed for the SEGA Mega Drive and SEGA Genesis. Yes, you read that right!! It was actually the only newly  developed game for SEGA's 16-bit system in the new millennium. It's not a port, fan translation, or a copy of any other game. Pier Solar is a 100% brand new, entirely original,16-bit RPG.\nWe'll get right in to what we think makes Pier Solar so special:\nA 100% Original RPG! Pier Solar was developed from the ground up. An original world, storyline, soundtrack, characters, enemies, and battle style. No ports, translations or copying from any other game - it's all fresh! The first original 16-bit RPG to do this in over a decade!\nA Massive World to Explore! Pier Solar has 50+ hours of gameplay, over 300 locations, nearly 500 unique treasure chests, and over 800 NPCs!\nDirector's cut! Pier Solar expands what was the biggest 16-bit RPG Ever! We released Pier Solar on a custom 64MEG cartridge (the average SEGA Mega Drive/Genesis game size is 12MEG), making it the biggest 16-bit RPG ever! This allowed us to push the 16-bit medium to a precedent setting level, with state-of-the-art aesthetics and things like full-screen cut scenes, background scaling and 3D modes. But Pier Solar HD is more than just a port, the game is getting a Director's cut, and includes an expanded story with new locations and challenges, that couldn't fit on its original Sega Genesis/Mega Drive release.\nEpic Battle Tactics! We developed an innovative battle system that puts you in control of up to five characters and includes in-depth strategic moves such as counter-attacks and a special strategy called Gather, which stores energy to unleash even more powerful moves and spells!\nTranslated in 6 Languages! Pier Solar is translated in 6 languages: English, Japanese, Spanish, Portuguese, French, and German.\nAn Original Soundtrack! A beautiful soundtrack written just for Pier Solar that embodies everything great about a classic retro soundtrack!\nThere Are Surprises! We also packed-in many other surprises and secrets like hidden areas and mini-games!\nPier Solar truly is a love letter to the rich, imaginative 16-bit RPGs of a bygone era. We crafted Pier Solar in the same light - with an authentic adventure, that resonates deeply about life, death, love, family, and friendship. Remember the wonder you felt when immersed into your favorite retro RPG? Pier Solar captures that same wonder.What the media says about Pier Solar\n“...this is a game I'll be keeping on my radar. I love the style, the aesthetics, and the classic\nJRPG feel.”\n- Kotaku.com\n“...one promising title to play next December.”\n- Destructoid\n“Pier Solar bears the distinct honour of being a Sega Mega Drive game”\n- Eurogamer\n“WaterMelon’s attention to detail is staggering…a community-based development team with a\ntrack record of integrity and a proving capacity to deliver on promises made”\n- Gamespot.com\n“With a lengthy script, impressive graphics, and a top-notch soundtrack, those that still hold the\nflame for SEGA’s console will have something new to be nostalgic over.\n- IGN.com\n“The game itself, which comes on a high-density, 64 Meg cartridge, is a well-crafted love letter\nto the turn-based, role playing games of a bygone era. It’s evocative of the 16-bit classics\nPhantasy Star II and The Secret of Mana, both in scope and design. Pier Solar also sports an\nenhanced CD soundtrack that truly takes the overall experience to another level.”\n- 1UP.com\n“90% GOLD Award…the best RPG of Sega’s 16 bit…well developed [and] well written.”\n- Games TribuneIn a nutshell\nPier Solar is a product of passion, done by individuals who love video games in it's most pure essence. It's made by players for players. Our team has absolute commitment to the quality of the game as well as the experience of the players.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WaterMelon","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":799269,"name":"Fort Solis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b1/7b16f5a2219005df202aa34ac442dc4c.jpg","description":"Fort Solis is a single player third person thriller set on the far side of Mars. Engineer Jack Leary responds to a routine alarm. Upon arriving at a dormant Fort Solis he becomes unnerved by the lack of any staff at the base. As the night grows longer events begin to unravel and spiral out of control. The mystery of what Fort Solis was created for starts to appear along with its crew. Can Jack escape with what he has discovered and more importantly, his life?\n\n\nKey Sequences\nHuge narrative moments that are fully playable with multiple outcomes. Each containing actions that have story-changing consequences.\nImmersive Storytelling\nHigh fidelity world aiming to be as immersive and captivating as the performances of our cast.\nExplore Fort Solis\nOne large base location encompassing over 9 individual structures, all containing surface and sub-surface levels. Players can play on the surface of Mars or simply progress by remaining below the surface. The choice is theirs!","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Fallen Leaf","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":718167,"name":"Smart Factory Tycoon: Beginnings","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd5/dd56d723132ef97a252a2ce4665434dc.jpg","description":"WISHLIST THE FULL GAMEhttps://store.steampowered.com/app/1755300/Smart_Factory_Tycoon/\nAbout the GameSmart Factory Tycoon is a tycoon management game about running your dream factory with robots. Design your dream factory, plan all steps of production, research new technologies and become a tycoon!\nMachines & RobotsPurchase new machinery and unlock advanced machines to produce every type of products in the marketPurchase new robots with varying colors and watch them coming to your factory by different transportation options: balloon, mine cart, boat, parachute, PWC or busUse the skill points to level up your robots (Movement speed, processing speed, charge capacity, oil capacity)Purchase chargers, super chargers, wireless chargers, and lubricators for your robots roomsUpgrade your machines, solar panels, wind turbines, chargers and lubricators for faster production and increased efficiencyFully automated machine-maintenance by dronesProduction & MarketPlan all steps of the productionPurchase high quality raw material to produce healthy and durable productsAnalyze the market to be aware of trending productsCheck the general market categories (Basic-Medium-Master) and Special OrdersIncrease your health, durability and sustainability levels to be eligible for some products in the marketSustainability & EconomyPurchase wind turbines and solar panels to reduce electricity costs and increase your sustainabilityPlant trees in your gardens to be a sustainable factoryEarn more money and XP to take the first place in the leaderboardDo the math and be aware of your expenses! Don't go bankrupt!Invest & Research & DevelopmentResearch new technologies to improve your factoryPurchase new buildings and deliver your products by rail, sea, and airBuild new rooms for robots and productionPlace your product zones and define their types as general or exportAchieve milestones to earn more XP and level-up your factory","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Turquoise Revival Games","platforms":[{"id":0,"name":"PC"}]}]