[{"id":619867,"name":"Soulstice","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/43e/43e1a4f86ff59d70624d7e7c608e58c3.jpg","description":"The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as “Wraiths” invade from the other side of the Veil, threatening to consume the living. Wraiths corrupt their victims and can even possess their bodies, turning into unstoppable monsters that prey upon the common folk. The “Chimeras”, hybrid warriors born of the union of two souls, are the only ones who can protect humankind.\n\nBriar and Lute are two sisters who have been reborn as a Chimera. The transformation has granted Briar superhuman strength and resilience, while Lute, who was sacrificed in order to bind her soul to her sister’s, has become a ghost with mystical powers. Voiced by Stefanie Joosten (Metal Gear Solid 5), Briar and Lute are sent on a mission to reclaim a city in ruins that has been ravaged by the Wraiths, only to discover that the Order they belong to has a far more complex plan in mind.\n\nExplore a dark world brimming with hidden mysteries, master a diverse combat system, and inhabit the dual forces of two sisters in a coming-of-age fantasy story with fast-paced action, vicious enemies and breathtaking boss fights.\n\nKey Features\nFight in synergy - Manage both characters simultaneously. Briar masters melee attacks and combos, while Lute controls the battlefield with her otherworldly abilities. Combine their strengths to unlock powerful transformations and fulfill their true potential as a Chimera.\n\nCustomize weapons and abilities - Weapons are unlocked and upgraded throughout the game and can be switched even in the middle of a combo to deal greater damage to opponents.\n\nExplore the city of Ilden - Discover puzzles and secrets in diverse locations within a troubled city in ruins. A Tear in the Sky has opened above Ilden; as Briar and Lute get closer to it, their surroundings become more menacing and twisted.\n\nExperience a grim world - Plunge into a dark story of sisterly love heightened by stylish and sleek art inspired by classic Japanese fantasy.\n\nCombat different enemy classes - Wraiths, Corrupted and Possessed have trespassed into the world from beyond the Veil. Use Lute’s auras to weaken or expose them and adapt to a flow of battle that never feels the same.\n\nUncover the truth of your origin - Throughout the game, Briar and Lute will discover the truth about themselves and their power but must work together to stay true to their unbreakable bond.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Reply Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":484827,"name":"Library Of Ruina","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfe/dfea75b69eda147e6e366393a765126f.jpg","description":"“May you find your book in this place.”\nBecome the owner of the Library and receive your guests.\nYour librarians will fight for the Library.\nCombat between the guests and the librarians breaks out as if it were on a stage.\nDefeated guests turn into books, and the Library grows onward.\nA good book will allow you to invite new guests with greater secrets.\nAmass a collection of books and explore the secrets of the City.\nAnd eventually, get your hands on…\nThe one singular, perfect book.\n[Introduction to the Game]\n“May you find your book in this place.”\nBecome the owner of the Library and receive your guests.\nYour librarians will fight for the Library.\nCombat between the guests and the librarians breaks out as if it were on a stage.\nDefeated guests turn into books, and the Library grows onward.\nA good book will allow you to invite new guests with greater secrets.\nAmass a collection of books and explore the secrets of the City.\nAnd eventually, get your hands on…\nThe one singular, perfect book.\n[A Library Battle Simulation]\nLibrary of Ruina is a game that uses the concept of a “Library Battle Simulation”.\nYou will invite guests to the Library and engage in combat with them to gain 'Books' with their stories.\nBattles are played with the 'Librarians' and the 'Guests' using cards and dice.\nYou can plan against the guests’ moves by looking at the cards they will use and select the most optimal card to oppose them.\nWhen combat begins, how the dice from your chosen card fall will determine victory or defeat in the struggle.\nHowever, the outcome of the dice is not simply determined by pure luck.\nCertain effects and variables will shift the outcome of the dice for and against your favor.\nBe sure to carefully choose which cards you utilize to win the battle with your guests.\nBehold the outcome of your choices and how luck unfolds as your librarians and guests skirmish.\nYou can go through an exhilarating experience, putting it all on the line with thrills just like betting.\n[Conflicts that Build Emotion]\nConfrontation in the Library is not just about killing your enemies, it is about heightening emotions.\nThe emotions of the librarians and guests rise as the battle progresses, and as it grows fiercer and comes to a head, they will surge.\nDepending on your librarian's feelings, positive outcomes or powerful effects with penalties can occur.\nIn addition, as the emotional tension of the guests grows, the difficulty of combat increases, yet at the same time, rarer books can be acquired.\nFurthermore, dialogue can appear depending on the situation of the battle and will make one’s viewing experience of the match unfolding even more enjoyable.\n[Books Can Be Anything]\nA guest who dies in the Library will turn into a book.\nThese books can be a librarian's body, materials to grow the Library, or new cards for battle.\nYou can also use books as the parts of an invitation to bring forth another guest.\nInvite different guests to acquire various books, then utilize them accordingly.\nHow you make use of your collection to grow the Library is up to you.\n[The Story of the City and the Library]\nIn Library of Ruina, you will be witness to the stories of Angela, the Sephirot, and Roland following the ending of Lobotomy Corporation.\nYou will also watch various events occurring around the huge city in which the Library is located.\nAccumulate books to grow your Library and librarians, and invite more powerful guests to gain better books.\nFrom lowly canards to urban legends and beyond...\nThroughout the game, you will gradually become familiar with the story of the City.\nMay you find your book in this place…","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Project Moon","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":304191,"name":"Cyber Shadow","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/bee/bee2cf3815fe16391b15a77ac690679a.jpg","description":"The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow on a journey to uncover what started the path to perpetual ruin. Slash through the techno hordes, leap past traps, and nimbly navigate the ruins of Mekacity.\n\nOnly you can unlock the secrets to your clan’s ancient powers in Cyber Shadow, the quintessential Ninja Action game.\n\nFeatures:\nDash, slice, and leap through masterfully designed levels filled with sharply honed ninja platforming action.\n\nAuthentic 8-bit presentation with hand-crafted sprites, a detailed pixel aesthetic, and perfect controls. Modern touches like fluid animation, multi-layered parallax backgrounds, and evolved game design.\n\nTake down more than a dozen apocalyptic bosses, from enormous war machines to your synthetic clan rivals.\n\nRelive the authenticity of classic 8-bit challenge or experience it for the first time.. with an added convenience or two.\n\nRescue your clan to unlock permanent Ninjutsu skills and abilities, combining them seamlessly as only the warrior of legend could.\n\nSearch for secrets as you explore the ruined world. Return to your old haunts to find supplies, items and upgrades.\n\nExperience the gripping story, told both in-game and through animated cinematic story scenes between the action. Who can be trusted? How far will Shadow go to protect his clan and the one he loves?\n\nPulse-pounding soundtrack by Enrique Martin, produced by Jake Kaufman.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Aarne \"MekaSkull\" Hunziker","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":36850,"name":"World of Warcraft: The Burning Crusade","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5da/5dac0ce6914ccd23b760de2729ba8eb2.jpg","description":"The Doom Lord Kazzak reopened the Dark Portal to Outland, flooding Azeroth with the ravenous demons of the Burning Legion. Expeditions from the Horde and Alliance, reinforced by their new blood elf and draenei allies, passed through the gateway to stop the invasion at its source. On Outland's desiccated Hellfire Peninsula, the Alliance discovered several of their heroes who had crossed through the portal many years before, while the Horde made contact with the Mag'har - 'uncorrupted' orcs who had not participated in their race's original invasion of Azeroth. The expedition into Outland dragged Horde and Alliance armies further into conflict with the agents of the Legion and the lieutenants of Illidan Stormrage, who had claimed the shattered realm for his own.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":27913,"name":"Puyo Puyo Tetris","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b70/b704e6378681e5bd80b09fcf8a21c8df.jpg","description":"Two puzzle game juggernauts collide as Tetris®, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo™ from SEGA combine to create a fun-to-play, fast-paced, competitive party game like no other! There’s a ton of different styles of gameplay – from the single-player Adventure and Challenge modes to the ferocious competition of the up-to-four-player Arcade modes. Unlock new characters and backgrounds in Adventure mode, or unlock new character voices, skins for Puyos and Tetriminos, backgrounds and more in the in-game Shop. You can even try your puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online in Puzzle League or Free Play modes.FEATURES!\nAdventure\nSingle-player mode offers ten unique acts, each with ten stages featuring different characters from the Puyo Puyo and Tetris universes. Each stage contains unique challenges players will need to overcome in order to win and move on!\nMultiplayer Arcade\nFor up to four local players, Multiplayer Arcade offers a wealth of variety that will bring out players' competitive nature!\nVersus\nPlayers compete head-to-head in either Puyo Puyo or Tetris to fight in the puzzle battle of their lives.\nSwap\nPlayers' abilities are put to the ultimate test when they compete on both Puyo Puyo and Tetris boards, which switch back and forth at set intervals.\nFusion\nA true hybrid game where players compete with Puyos and Tetriminos together on the same board, requiring deft, on-the-fly thinking to become victorious.\nBig Bang\nIt's a race to the finish as players compete against each other to clear unique challenge boards as quickly as possible to win.\nParty\nPlayers compete on Puyo or Tetris boards, but the puzzles feature special items that when activated either help players or harm their opponents.\nOnline\nPlayers can try their puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online, in Puzzle League or Free Play modes.\nPuzzle League\nIncrease player rating, earn ranks and aspire to new leagues in this mode for competitive enthusiasts.\nFree Play\nA more casual experience where records aren't kept and players can customize matches with unique settings, and invite their friends to play.\nReplays\nPlayers can save and upload any online matches to show off to their friends, or search other players' replays using the tag and filtering system to see how they tackle matches.\nSolo Arcade\nPlay any of the Multiplayer Arcade modes against the CPU in Battle or Endurance matches, or try the single-player Challenges!\nBattle\nSubstitute human players with 1-3 CPU opponents to fight against simultaneously.\nEndurance\nGo the distance in a one-on-one gauntlet of never-ending CPU opponents, racking up as many wins as possible.\nChallenge\nForget about the opponents and put skills to the test with Sprint, Marathon and more, like the quirky Tiny Puyo, which shrinks down Puyos to fit even more on the board.\nJapanese VO\nFor the first time in the West, players have the option to play with the original Japanese voiceovers with localized subtitles.\n\nXbox One version was only released in Japan.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sonic Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 3"}]},{"id":18199,"name":"The God's Chain","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6ac/6acdf903e474a3f8793d674630888dbb.jpg","description":"Story Base -Finally the day came when we found our GOD.Human Beings are an experiment done by them.The human beings are evolving and have become one of the greatest powers in the universe which is becoming a great problem for other colonies in the universe.So our god decides to end the experiment but now human beings will fight for their existence.\nWill human beings exist in this space war or will become a part of history ?\nWill our god destroy us or will human beings will destroy other colonies ?\nWhat will be the future of Human Beings ?Game Modes -#) Story Mode -\n#) Multiplayer Mode -\nWar - 10 minutes , 16 players\nDeath Match -10 minutes , 16 players\nTeam Death Match -20 minutes , 24 players\nMulti Team Death Match -30 minutes , 32 players\nThe game is both First Person Shooter and Third Person Shooter .It is switchable, made for - the way you like it.\nThe purpose of this game is not to hurt any religion or any organization,this game is for entertainment purpose.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"CRASS Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":17011,"name":"Detective Case and Clown Bot in: Murder in the Hotel Lisbon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c3e/c3ecb4efc49087c8971fc4ed0024a344.jpg","description":"Detective Case and Clown Bot in: Murder in the Hotel Lisbon\nMurder in the Hotel Lisbon is a videogame inspired by the classic point and click adventures from the 80’s and 90’s. It adopts these eras distinctive design and it is built using only the pixel art technique. The game itself runs at a native resolution of 256x192, the same resolution used by the old ZX Spectrum 48k and most recently by the Nintendo DS.\nSynopsis:\nA strange murder has occurred in the Hotel Lisbon, a man committed suicide with 14 stabs to the back while at the same time he peacefully drank his coffee.\nThis case with contradictory facts was too complex for Policeman Garcia to solve, so he decided to hire the only detective duo in town capable of solving it: the mythical Detective Case and the unmistakable Clown Bot.\nTogether, they will solve a network of love relations so complex and so intricate, that it would take at least 14 clairvoyants, 5 apocalyptic sect prophets who can predict the end of the world and 3 of those gypsies that can read the palm of your hand just to guess the final outcome.\nCharacters:\nWith the mythical Detective Case, also known as the world worst detective, a man so rough and rude that his witnesses would rather be run over by a slow moving freight train than to be questioned by him.\nAnd the hilarious Clown Bot who, although he works as a Detective Case’s sidekick, he hopes in reality that one day he will get a job as a circus clown. Unfortunately, and no matter how many applications he sends, no circus will ever accept a clown that is afraid of children. He never sleeps, so besides working by day as a sidekick, he also works by night as a stand-up comedian in a local bar. People say that he is a joke machine.\nKey featuresMurder in the Hotel Lisbon has THOUSANDS of key features!\nA point and click graphic adventure game.\nPlay as Detective Case and Clown Bot.\nSearch for clues and interview witnesses.\nTake a rest, have a nap.\nSolve the murder in the Hotel Lisbon.\nIncludes 3 additional cases.Steam release:The release on the Steam platform includes many Steam updates and Steam extra features only found here on Steam! (wow!)\nUpdated Steam version to 1.02 with multiple bug fixes and Steam enhancements.\nNew Steam animations for Steam Case, Steam Bot, Steam Garcia and many Steam more.\nSupport for Steam achievements with a proper real trophy shelf on Case's office.\nAwesome and cool Steam Trading Cards!\nTaxi is now properly Steam animated.\nRevised Steam English version.\nSteam!\nTrading cards\n8 awesome and cool Steam Trading Cards!\nCollect them all!\nOriginal soundtrackMurder in the Hotel Lisbon may be low res and retro on the visual side, but we made sure that on the audio side your ears would rejoice with a complete original soundtrack. Composed of an orchestral band, a jazz band and a typical Portuguese Fado trio, the musical landscape contrasts beautifully with the colorful graphics.\nGame music\nThroughout the game you will ear over 20 different tracks of orchestral music composed and recorded specifically for the game.\nAll these tracks were recorded on studio with a 10 member band composed of friends and colleagues. All of them brought their soul and heart to these recordings and the results are absolutely AWESOME!\nJazz music\nInside the GAF Bar, a 4 man band plays some cool Jazz.\nThe character at the Piano is actually Filipe Melo who is doing a cameo and allowed us the rights to use some songs recorded previously with John Ellis, Romeu Tristão and João Pereira! BAM!\nFado music\nTo top it all, inside the Noitadas Restaurante we have a Portuguese Fado trio ready to entertain the guests. The song they sing was also recorded on studio. It is called \"A Caldeirada\" and it was originally written for famous Fado singer Amália Rodrigues.\nSUAVE!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Nerd Monkeys","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":16419,"name":"Iron Storm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/943/943a107d56186f56ddc07cbfd806a8c0.jpg","description":"Western Germany, March 1964... The last Great War rages on. Madness at the front lines. Men butchering each other.  War-torn Europe stands ripped apart by a front line that runs straight through the heart of Germany where American and Western European troops battle against enemy forces.  An eternal war seemingly with no end in sight. Opposing forces mercilessly attack with unrelenting force, claiming small victories one day only to lose them the next.\nAs Lieutenant James Anderson you must infiltrate and destroy key enemy positions deep behind enemy lines. If successful, your mission could finally put a stop to the carnage and restore what everybody has long since forgotten about: peace.\nInspired by real-world events and elements from WWI, WWII and modern warfare, Iron Storm brings the carnage!\nA cross between a shooter and an adventure game that has you asking… what would the 1960s have been like had WWI never ended.\nThe fighting isn’t just on the ground… watch as the stock market directly impacts the fight\nSix non-linear levels that require you to visit certain sections repeatedly with multiple ways to complete objectives\nSolve puzzles, use stealth and cunning skills and shoot it out in single and multiplayer action\nFind yourself in the trenches of WWI with environmental elements like barbed wire fences, bunkers, mines, gas warfare and snipers\nWWII comes to life as you use and battle automatic weapons, radar, tanks and flame throwers\nModern-day warfare is not missed though as helicopters, lasers, electronics and more will have you wishing you were back in your mama’s womb","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Microids","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16126,"name":"Yosumin!","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/988/988e1f8562ddb559d0cd9efa1017d01a.jpg","description":"Make rectangles of the same type of yosumin to make them disappear in this mind-bending puzzle game. The more you get, the better you'll feel!\nYosumin!, Square Enix's puzzle masterpiece, is here! Simply select rectangles of the same type of yosumin to make them disappear in this simple yet challenging puzzle game.\nThere are two game modes available.\nYosumin! Adventure\n\nOnce upon a time, deep in the Forest of the Yosumin!, which lies somewhere far away, but not too far from here, there was a shrine decorated with beautiful stained glass.\nOne night, someone came and took the stained glass, then smashed it into pieces and spread it far and wide over the world.\nWork your way through the world of the yosumin in search of the lost pieces of their treasured stained-glass window!\nUse the special Treats you earn along the way to help you make your way through the myriad of multifarious levels!\nEndless Yosumin!\n\nThe only limit is your skill in this never-ending game mode! How high will you fly?\nMore than 180 challenging stages.\nCute, fun graphics.\nRich, fun-filled sounds and voices.\nEarn extra Treats the more yosumin you make disappear.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"}]},{"id":10897,"name":"Bounty Train","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/db1/db1210219be7981486c3f6557f3aaecf.jpg","description":"Be prepared to conquer the Wild West on rails! Mount and design your very own train with plenty of detailed equipment, hire a loyal, bold and selfless crew and travel through the dangerous Wild West. Find your way by cleverly using your resources and by shipping goods and passengers. Solve problems your own way, either through diplomacy, violence or bribery.\nExplore the dangerous life, the accurate historic events and contemporary inventions of the North American/US 19th century.  Acquire one of the most legendary steam machines and transform it into a fortress on rails. Fulfill surprising quests and face notorious bandits, vengeful Natives and even more enemies. You can only achieve this journey of your life, if you pay attention to all these thrilling factors.\nControl true to original locomotives, expand and design them in various ways\nAssort an efficient crew and overcome the challenges of North America together\nProve yourself by handling chase-fights and ambushes, but be careful and inventive: resources are scarce and technology isn't always reliable\nExplore the America of the 19th century, visit real-life cities, trade and provide goods\nExperience an exciting, non-linear story – reunite with your family and prevent the forced removal of the Natives\nInfluence real historical events and inventions, and change the course of history\nChoose one of four huge factions – or switch sides in the game process","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Corbie Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9444,"name":"Indie Game Battle","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/280/2802e43a4522c3efcdfaa5efd2b259ed.jpg","description":"Indie Game Battle is a multiplayer fighting game for up to 8 players inspired by the Super Smash Bros series. However, IGB features indie characters instead, and the game is open for all suggestions!We've all seen other Smash Bros-like games before. So what makes Indie Game Battle stand out?Indie Game Battle plays much like our very own version of Smash Bros. However, some core differences are the team-based gameplay, the status effect system, and the PP meter.\nIGB is intended to work especially well with team battle, which few other Smash Bros or Smash Bros-like games have put the same amount of focus upon. It works just as well with free for all and 1v1 matches, but some movesets and mechanics are designed to work in teams and create new strategies you may not see elsewhere. If you believe team battles aren't popular enough in other games, IGB could be the game for you!\nThe PP meter decides how much you can use certain moves on some characters, and the bar will refill over time. Maybe the move is especially powerful and therefore uses the PP bar to simulate a cooldown? Some characters depend on having PP left for using some of their moves. Using this wisely can win you the battle!\nThe status effect system makes Indie Game Battle more based around strategy. Sometimes, only hitting your opponent enough isn't the best strategy to beat them. Some characters can cause fire damage, poison opponents, drain them of the PP they need to use certain moves, slow down their movement speed, and more. Making your opponent disadvantaged and exploiting their weaknesses can turn a battle around!\nWe aim to interact with our community as much as possible. All suggestions will be considered, and we never ignore ideas! Anyone interested in the project can feel free to message us about their ideas whenever. if achievable, you might be lucky enough to have your ideas accepted.\nIndie Game Battle is a game we want to continuously support and update for as long as possible in the future. We do not have set goal of content for the game for this reason, but we can guarantee that it will continue to grow for a long time as new characters, stages, modes, etc are added to the game.\nRight now, the game consists mostly of smaller indie games and less known developers. But we hope to get bigger names into the game in the future if possible, too!Some featuresIGB features lots of playable characters from various indie games. Each character has their own unique moveset and special moves. Later on, we aim to have a roster of 60 characters or above, too!\nOver 10 stages to fight on. Each stage has a different design, different music, and different hazards.\nVarious gamemodes. Right now the game only has one, but later we expect to add several more to keep the game fresh!\nLots of settings! You can tweak settings to suit the way you prefer to play the game. Turn off healthbars or the damage percentage if you wish, toggle super attacks on/off, enable damage text, and more. You can even toggle things like stage hazards on/off, too!\nCompetitive mechanics such as wavedashing, l-canceling, and more to discover!\nA story mode, featuring levels from the games involved! The story mode will come in a later part of development once we got the base game working best possible!\nLots of third party indie games! IGB includes the games we at Blob Games Studio are developing ourselves, but lots other indies can join in, too!Are you an indie developer? If so, feel free to contact us if you'd like to see your own characters in IGB. Maybe you'll be lucky! If you aren't a developer, you can always suggest a game, too!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Blob Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":6875,"name":"Lost Horizon","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a22/a22770b74a00479d791263fefe2f8fbd.jpeg","description":"1936: Soldiers of the Third Reich roam the world seeking occult weapons for their insane plans of conquest. When Fenton Paddock, a former British soldier and hapless smuggler, is asked to look for his friend Richard, who went missing in Tibet, he has no idea that this search will lead him across three continents to a secret that could turn the whole world upside down. Enough mystery? Not in the mood for another crime story? \"Lost Horizon\" brings the classic adventure back to its roots: the 1930s, exotic settings all over the world, and the dangerous quest for one of the greatest secrets of mankind makes adventurers' hearts beat faster. The Makers of the award-winning Secret Files series invite you to experience a technically outstanding, carefully designed game featuring an absolutely thrilling story at the side of Kim and Fenton.\nKey features:\n\nUnique handmade graphic style\nExotic settings you've never seen before\nMovie-like story by novelist Claudia Kern\nBoth realistic and funny dialogues\nExcellent technical appearance and minimal system requirements\nFast-paced presentation of the exciting story in movie style\nInnovative puzzle design, always fair and logical","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Fishlabs Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"}]},{"id":799381,"name":"Beacon Pines","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/384/3840fdbb91612c81db98176a4c1e7a8d.jpg","description":"Beacon Pines is a cute and creepy adventure set within a mysterious book. You play as both the reader of the book and its main character, Luka.\nSomething strange is happening at the old warehouse, and Luka and his friends seem to be the only ones taking notice. Sneak out late, make new friends, uncover hidden truths, and collect words that will change the course of fate!\nWhile helping Luka investigate the strange goings-on in Beacon Pines, you’ll collect special golden charms, each with a word engraved on it. These charms can be used at certain turning points in the story to fill in a blank word and drastically change everything that follows.\nAs the book's reader, you’ll navigate the story’s turning points using The Chronicle: an interactive story tree that branches and grows along with your choices. Exploring one set of events can unlock new charms to use on another branch, leading you to jump back and forth between entirely different versions of the story in order to unravel the mysteries at the heart of Beacon Pines.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Hiding Spot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Nintendo Switch"}]},{"id":302302,"name":"Mutazione","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5eb/5eb1c9aae01cde5d325137d821dbb40e.jpg","description":"A mutant soap opera where small-town gossip meets the supernatural\n\nMUTAZIONE is an adventure game where the juicy personal drama is just as important as the high-stakes 'adventure' part of the story. It draws on the ensemble cast format of storytelling in favourite television shows such as Twin Peaks, Deep Space Nine, Grey's Anatomy, and Lost.\n\nOver 100 years ago a great meteor named ‘Moon Dragon’ struck a tropical holiday resort. Most of the inhabitants perished but those who didn’t remained in the mutating environment and founded the small community of Mutazione.\n\nFast-forward to modern day, where you play as the protagonist Kai as she travels to this strange and secretive community to visit her ailing grandfather, Nonno. Explore the village, plant musical gardens, choose who you want to talk to, and find your way through an in-game week of small-town drama and scenic hangouts.\n\nAs you nurse your grandfather back to health, you make new friends, discover old betrayals, unravel long-kept secrets, and embark on a final spiritual journey to try to save everyone from the mysterious darkness at the heart of it all...","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Die Gute Fabrik","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":28355,"name":"Dance Central","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/48d/48d53d157997e680bb5094cbd81c9f2a.jpg","description":"From the creators of Rock Band™ comes the next great music experience: Dance Central™. Take your moves to the next level in the first controller-free, body tracking, fully immersive dance video game.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Harmonix Music Systems","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":20925,"name":"Port of Call","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e64/e641f80c55c9de7077d66b9831a5e688.jpg","description":"Imagine waking up on a small dock with no recollection of who you are or how you got there. The first person you find is a grumpy, old man who enlists you to work on his ferry boat which seems to have materialized behind you. But not all is as it seems on this strange ship, and the people you meet may know more about your past than they let on.\nPort of Call is a narrative exploration game that focuses on telling the player an immersive story. The game is an experiment in short-form storytelling in an immersive media. Interact with the ship's passengers and explore your surroundings in first person to try to uncover the secret of your past.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Underdog Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":12824,"name":"Mansions of Madness","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f47/f474a65705f4dad817e0f247fb5ab2c4.jpg","description":"A companion app for the Mansions of Madness Second Edition board game from Fantasy Flight Games.\nMansions of Madness is a cooperative board game of mystery and investigation inspired by the writings of H.P. Lovecraft. During each game, one to five players explore a location to unravel a mystery.\nThis companion app guides you through the haunted halls and misty alleyways of Arkham in stories of varied length and difficulty. In addition, investigators need to overcome various challenges, including fending off terrible creatures, befriending non-player characters, and solving puzzles.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fantasy Flight Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":367083,"name":"Encodya","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/286/2866ecf5417144152807e7cd0a0043b2.jpg","description":"It’s 2062. Tina – a 9 years old orphan – lives with SAM-53 – her big clumsy robot guardian – on a rooftop makeshift shelter in Neo-Berlin, a dark megalopolis controlled by corporations. The protagonist is an urban jungle kid, which has learnt to live alone, scavenging dumpsters of the dystopian city, eking out a living of scraps. Her funny robot always with her, programmed to protect the girl no matter what.\nENCODYA is based on the award-winning short film \"Robot Will Protect You\".\nExplore the dark cyberpunk world of ENCODYA with 2 playable characters\nOver 30 non-player characters bring the world and story of ENCODYA to life\nMore than 50 locations in Neo-Berlin to discover and explore\nOver 5000 lines of dialogue tell an immersive story\nRandomization of objects and locations\nUnique art and sound design\nThe original soundtrack creates a thrilling atmosphere\nProfessional dubbing actors lend their voices to the characters","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"chaosmonger studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":21461,"name":"Diehard Dungeon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c6/0c6f1f22680c64eb0cc5f4c4bb6eb2b8.jpg","description":"Combining its own unique take on the real-time roguelike genre, with a nostalgic 16-bit look and feel, Diehard Dungeon is a game that feels both familiar and quite different at the same time.\nFollowed by a trusty, treasure collecting companion chest, you must make your way through the dungeons many randomly-generated rooms and levels. Armed with a sword and a ‘hand cannon’, all manner of nasty dungeon dwellers, bosses and traps will need to be defeated or traversed in order to emerge from the dungeon victorious!\nTo aid you in your quest, you may be lucky enough to encounter one or more upgrades or new abilities scattered throughout the dungeon, or bump into the remnants of other players (Champions) via the unlockable 'Champion Mode'. Champions wander atop the dungeon walls, ready to unleash their souls upon passers by. Be careful though, as not all Champions are helpful.\nA randomly generated dungeon is created every playthrough, with many secrets and multiple outcomes.\nThe game features a dynamic difficulty and ranking system - the better you do, the more challenging the game will become. Only the most skilled dungeon escapees will attain the highest ranks.\nDo you have what it takes to survive the dungeon?\nMinigamesMayhem: You have 3 minutes to get a high score by any means necessary. Mayhem is easy to learn, but difficult to master.\nSurvival: An endless series of progressively harder dungeon rooms. Avoid receiving damage and clear rooms within the time limit for bonuses.\nFading Light: Destroy 10 pyramids as quickly as possible, whilst avoiding the gaze of the searching eyes, and the hordes of bloodthirsty zombies.\nEach minigame has a global leaderboard.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Tricktale","platforms":[{"id":0,"name":"PC"}]},{"id":20774,"name":"Cloud Knights","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fa1/fa1afd920bca19557d8f7fc66d91aa91.jpg","description":"Swing and slash your way to victory on the floating arenas of Cloud Knights! Pick your weapon and use it to hack at the enemies and move across the game world. The physics-based controls allow the characters to move and fight by simply swinging their weapon. All game modes can be played by up to two players locally. Save fellow knights, defeat the invading Undead Legions and crush your mightiest opponents in boss fights!Key Features:Unique physics-based control method\n60 level campaign mode with boss fights and varying missions\nVersus mode for one-on-one dueling\nSurvival mode for endless fun\nTwo player option for each game mode\nBeautiful game world that gradually changes with every level\nFour different weapon types to choose from. Each with upgrades.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Astrosnout","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":20178,"name":"ROSE Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/41c/41c5b3eff4cd45a54e48bc6886fbbe9a.jpg","description":"We don't know where Arua came from, nor how she came to be. We do know, however, that nothing existed before Arua. The Goddess of life, souls, and all existence created the universe as she saw fit… a calm and beautiful place where souls could dwell peacefully. The deep matters of the universe cradled the waves of life, on which all beings would sway soothingly. This perfect universe was called the Sea of Souls.\nLife would bring shine to the Sea of Souls, in the form of seven planets. Arua created these out of love, and dedicated each of them to the inhabitants that she breathed life into.\n\"The planets, as your lives, dear ones, are all yours. As am I. As are your souls.\"\nThese are the words of Arua that ring in everyone's hearts when they are born.\n\"To you, I give the Gods, to watch over you. Praise them well, for no love can ever match the one you will receive from them.\"\nAnd thus, the Gods were created, to watch over all life that Arua had created among the seven planets. And Arua named the planets after each of the Gods and Goddesses that would look after them: Junon, Lunar, Eldeon, Orlo, Karkia, Skaaj, and Hebarn.\nEach planet's inhabitants lived in happiness, idolizing their respective God or Goddess, and reveling in the pleasures that living under their protection and rule brought.\nBut all was not harmonious for long. The Dark God Hebarn disbanded from the other planets, and his plots to destroy Arua's universe began.\nSoon, the gossips about strange visitors started. The Visitors protect life, and make right from all that is wrong. They are divine beings; they seldom suffer from hunger or thirst, they do not need as much sleep as most other creatures, but they can hurt, they can love. And they can help.\nThat is why Arua created them, after allKey Features:Customize Your Game Play\nYou pick your stats and skills that best fit your type of game play with multiple skill tree options for each class that allows for an experience that is your own.\nPlayers Make their Own Legend\nThe quests in ROSE Online are affected by the activities of the user community. Who do you follow; Arua or Hebarn?\nCustomize Your Toon\nYou are not confined to ugly armors or a single look, you can outfit your toon to be just about anything you want to look like while you pick fights with monsters or engage others in PvP. You can look like a large Jelly Bean while fighting a Mech Castle Gear during PvP it is all up to you.\nParty Play\nGrouping with your friends doesn't just allow you to benefit like a traditional MMO, but you earn vastly more EXP and with player skills that help with the Party the enjoyment is vastly increased as well!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Gravity Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":19746,"name":"Magma Tsunami","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ebf/ebf83ad1720c5f4202cafb80a7a7e1d2.jpg","description":"Magma Tsunami is a frenzied arcade platformer game. Beat your records in 1P or Co-op mode, and don't get caught by the Magma Tsunami!!!\nCould you stay alive for more than one minute??","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"StrangeLight Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":19698,"name":"Soldiers: Heroes of World War II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e85/e85fba3957a183d8f08a6df14b19ad0e.jpg","description":"The player can take control of American, British, Russian, or German forces to play out battles that are set in World War II. The game is primarily a strategy game, but the player can take control of his or her forces and direct them with the keyboard and mouse for additional depth of control.\nCommand or commandeer over 100 authentic vehicles and weapons\nBattle through a variety of ultra-detailed terrain from coastal waters to Normandy villages\nFire from cover or hide from the enemy with totally interactive scenery Fight as British,Americans, Russians or Germans through more than 30 intense missions\nGet into the thick of the action with Direct Control of each unit, or command your elite squad with RTS-style gameplay\nEngage cunning AI enemies as they counter your plans with real battlefield tactics\nMultiplayer: LAN. Internet multiplayer is possible with the help of third-party software","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Best Way","platforms":[{"id":0,"name":"PC"}]},{"id":18720,"name":"Full Spectrum Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3e3/3e3a6634bde0810ba728a1df6191365e.jpg","description":"The U.S. Army is the most powerful ground force in the entire world. The backbone of a ground invasion is the U.S. Army Infantry, and in the midst of combat, their skills, courage, and teamwork are put to the test.\nWhile readiness continues to be the U.S. Army's top priority, how it goes about its business is changing. Full Spectrum Warrior began as a training aid for the U.S. Army to reinforce Army doctrine and team effort within the troops. It is the most realistic portrayal of Infantry-level urban warfare via unique tactical action gameplay. Players become the Squad Leader, commanding Alpha and Bravo squads. There is potential for danger down every alley, behind every window. Watch those angles folks, we've got a job to do here. Hooah!\nUnique combination of tactical and action gameplay.\nAuthentic implementation of U.S. Army Infantry doctrine.\nSimple control scheme lets you command eight soldiers in real time.\nSquad equipment reflects real weaponry and equipment currently in use by the U.S. Army.\nImmersive urban environments with danger around every corner.\n2-player co-op, each player controls one fire team.\nIncludes 2 exclusive bonus levels not available on Xbox.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Pandemic Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":16775,"name":"Party of Sin","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/284/284cfd05ac88a21c849ab05f7f17d403.jpg","description":"Ever had that itching desire to break out of hell and into the highest reaches of heaven? In Party of Sin, you take control of the Seven Deadly Sins in a coopetitive puzzle-platformer for 1-4 players.\nMaster a large, dynamic team of anti-heroes -- the Seven Deadly Sins --  as you forge your destiny on a quest to troll humanity. Envy, Greed, Sloth, Pride, Wrath, Lust, Gluttony are all multi-dimensional with special powers useful in many situations.\nSwap characters on the fly as you change tactics based on the situation: ALL the Sins are useful in combat, ALL the Sins aid in puzzle solving, and ALL the Sins have coop interactions, both Good and Evil.\nAdventure: A full 6 to 8 hours of gameplay is provided, in both solo and coop modes. Play over 20 levels on your adventure through Hell, Purgatory, Earth and Heaven. Upgrade your Sins in the shop by collecting God's forbidden apples. Five bosses like the Demon Narwhal and the Airship Captain stand in your way.\nSolo: Being alone requires more thought and planning as you make your escape from hell. Challenging puzzles and battles that will force you to combine powers in creative ways await you.\nCoop: You are not alone! Play with up to 3 of your friends and combine the sin powers in new and sinister ways. You will discover that all your powers that work on enemies also work on other sins. Use them to help the team or punish bad behaviour.\nInspired by known classics: Super Smash Bros, Zelda, Super Mario. Party of Sin takes the best games of your youth and melts them down into a sinful super-game. Powers are adapted from classic mechanics like grappling hooks and time-shifting.\nReligious Theme: Explore four biblical worlds as you make your way from the depths of Hell to the vaults of Heaven, one angel at a time. Fight enemies based in Christian mythology like demons, angels, cherubs and templars. Take the final fight to Saint-Michael himself!\nJoin a party of epic proportions that tests your ability to think from the other side of morality… Which Sin are you?","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Crankshaft Games","platforms":[{"id":0,"name":"PC"}]},{"id":5673,"name":"Terminator Salvation","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d3d/d3d538b56d062f354d2d6ed69e1579e5.jpg","description":"Terminator Salvation","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"GRIN","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":3430,"name":"Q*Bert: Rebooted","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fc/5fc4cfe5a172d1261ac3683228cfc53f.jpg","description":"Update Notes-\tVarious bug fixes for Classic mode\n-\tVarious art touch ups in Classic and Rebooted modes\n-       Sound FX fixes in Classic and Rebooted modes\n-\tUpdated controller support with default mapping for XBOX 360 controller and D-pad support\n-\t1 new playable character (can you find him?)\n-\t5 new levels\nJust UpdatedHalloween Update is Alive!\nAaah, All Hallows' Eve is upon us again…\nA time for pumpkins, scary costumes, mischief night, sugar highs and  crazy resurrected Q*bert Halloween characters!  Check out this haunting update and delve into your pagan lizard brain roots with Zom*bert, Jack*Q*Lantern, Franken*bert’s Monster, Q*tankhamen and Dra*Q*la.\n- Zom*bert: Q*bert's out for brainssss... or he's been up late watching TV. Doesn't explain the axe on his head, though!\n- Jack*Q*Lantern: Not sure if he’s purposefully wearing a pumpkin on his head or just lacks the arms to take it off\n- Franken*bert’s Monster: Doctor Franken*bert’s dark creation, a combination of various body parts brought to life!\n- Q*tankhamen: After wrapping up 4,000 thousand years in an underground tomb, he's ready to stretch his legs out\n- Dra*Q*la: Straight outta' the coffin, he's a real pain in the neck\nAbout the GameQ*bert is Back  @!#?@!\nOne of the most critically acclaimed and commercially successful arcade games of the 1980s is back in its Classic pixel perfect 2D form, and a re-imagined Reboot version with state of the art 3D game-play and graphics that remain faithful to the original concept. Both versions are exciting twitch games requiring keen puzzle solving skills and logic.\nFirst introduced in 1982 by Gottlieb, Q*bert was critically-acclaimed and went on to become the third most successful arcade game of all time (behind Pac-Man and Donkey Kong). It inspired home versions, a variety of Q*bert merchandise, numerous copycat games and even an animated TV series.\nQ*bert Classic stays true to the original in all its jagged 2D pixel art glory, now optimized for the modern PC with mouse and Steam gamepad controls. As the title character, players jump around an isometric cube pyramid and convert each block’s color while avoiding familiar adversaries Coily, Ugg, Slick, Sam, Wrong Way and Red Ball. Levels become progressively harder with more enemies blocking your path and the tiles requiring multiple jumps to change to the required color.\nQ*bert Rebooted takes the arcade classic and catapults it into the 21st century 3D game play that takes full advantage of today’s technologies yet remains faithful to the original Q*bert. Featuring hexagonal blocks instead of squares, Q*bert Rebooted introduces new enemies, playable characters, power-ups, traps, gem collecting and characters, and new ways to play.\nQ*bert Rebooted highlights:\nLevel Select – replay all previously unlocked levels and track progress against friends.\n7 New Playable Characters – introducing Q*zard, Q*bertha, Q*bot, Q*zilla, Q*tee, Q*knight and Q*nicorn, all based on the original Q*bert form.\n3 New Enemies – the classic cast of adversaries are joined by new enemies Homer, Uppercut and Treasure Chest\n9 Achievements – these include Classic Master, Newbert, Qbertorama, Snake Surprise, Green Machine, Ugg!, Down for the Count, Disc Rider  and Coin-Op Collector.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"LOOT™ Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"}]},{"id":2645,"name":"FIST OF AWESOME","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f7f/f7f19ca659630e1c02f9294679d59d45.jpeg","description":"Ever wanted to punch a bear IN THE MOUTH?\nFIST OF AWESOME asks the eternal question \"what would happen if bears took over the world?\" and answers it with the epic tale of a lumberjack travelling through time punching bears in the face to save humanity.\nIf you like bear puns then you're in for a treat. If you also like games like Streets of Rage, Double Dragon and Final Fight then sit down, pour a scotch, and get ready for the greatest time-travelling-lumberjack-em-up of all time.\nKey Features:\nA lumberjack who travels through time punching bears in the face to save humanity\nDevelop Award Nominated soundtrack by Brendan Ratliff aka Echolevel\nOkay-ish pixel graphics\nAn impawsible number of bear-themed puns\nUSB & Bluetooth controller support\nLike Streets of Rage, but with more bears","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"I Fight Bears","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":2085,"name":"Agent A: A puzzle in disguise","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6c2/6c25924ad4c92798b76917837f3ef4c2.jpg","description":"You play as Agent A in this stylish secret agent world full of retro futuristic contraptions, hidden gizmos, gadgets and clever logic based puzzles. But do be warned… Ruby La Rouge is no spy to be taken lightly! Explore a labyrinth of perplexing puzzles in this quirky game of cat and mouse that’ll have you wondering whether you’re the cat… or the mouse!!\nNotice something strange or out of place? Making mental notes and observations (like a good secret agent) will aid you in solving tricky puzzles later on. As you explore Rubys secret hideout, collecting objects and using them cleverly is crucial in unlocking a trail of puzzles leading you ever closer to your target!\n• Stylish 1960's inspired art\n• 35 unique environments to explore\n• 100 inventory-based puzzles\n• 50 puzzle screens\n• 25 trophies","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Yak & co","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":725781,"name":"Mirror 2: Project X","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/043/043f8b4a5d9b767694370d6fbbc8cd3c.jpg","description":"Please know that the release version of the Early Access version, the game only has the 1st chapter of the Story Mode, which is about 5% content compared to the complete version. We'd recommend you consider the status quo of the game before purchasing.\nThe complete version of the game will be released 8 to 12 months after the Early Access Release, during the said period we'll keep updating new features and stories; Trading cards and a set of complete achievements will be added to the game when the complete version is finished.\nWe intend the complete version to have:\n1. Story Mode: 8 chapters in total, estimated playtime is 12 to 24 hours.\n2. Challenge Mode: Roguelike+match-3 fused challenge mode, estimated playtime is 50 to 100 hours.\n3. Simulator: Gather resources by playing Challenge Mode to unlock characters, skins, and new areas. Estimated playtime ??? hours.\nThis is a story-driven game developed using cel-shading techniques powered by Unreal Engine 4.\nYou are an agent in the Federal Bureau of Research and Protection (FBRP). Your job is to protect mankind from various supernatural objects and events. As the player, you will enter a vast, complex, and diverse world that provides an entirely new experience. Know that every choice will affect the story's conclusion.ENTER A WORLD WITH OVERLAPPING PLANES\nThe Federal Bureau of Research and Protection (FBRP) is established in response to supernatural events happening all over the world. It has the most advanced technology, the most elite response team, and the most powerful weaponry in the world. Any phenomenon with indescribable origins, or the capacity to resist attempts to be contained through human power and science, will influence the organization to dispatch a response team to secure, contain and retrieve the source without civilian awareness.\nAncient gods, cults, alternate dimensions, parallel worlds, arcane sorcery, mythical creatures, super AI, magic, enigmatic Eastern martial arts, even anime characters... Mankind faces so many threats from the unknown. FBRP is humanity's collective efforts to protect themselves, and the embodiment of that fear of the unknown.STORYLINE\nYou are Naoto Jinguji, a talented FBRP researcher with a focus on supernatural beings. You are tasked to study the first live succubus in captivity. As the planes begin to overlap with increasing frequency, the bureau's board of directors is getting anxious and begin pressing you for results, causing you displeasure from the board's ironfisted policies. Faced with a growing amount of sympathy for the succubus, you will have to make choices that may affect your life.GAMEPLAY\nThe story is influenced by the choices you make. Some of them will affect the match-3 battles.\nMatch at least 3 gems of the same kind to win points. There are 5 regular gems and 6 special gems.FEATURES\nA vast, complex, and immersive world that will leave a mark on your heart.\nWell-made lifelike characters with stories worth discovering.\nMore intense match-3 battles than ever.\nTo be or not to be... the choice is yours. Remember, every one of them counts.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"KAGAMI Ⅱ WORKs","platforms":[{"id":0,"name":"PC"}]},{"id":528725,"name":"College Kings","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b5d/b5d8f5ac511033013e57ec96472c20d6.jpg","description":"Join the community\nJust an innocent freshman at San Vallejo College, you are oblivious to the path that lays ahead of you. Growing up gets real when you learn about the unique cultures of the place you must call home. As loyalties form and tensions rise can you lead your fraternity to the crown and with it become the king on campus?\nCollege Kings allows you to live the college experience however you want. Make meaningful choices that will alter the course of your time at San Vallejo. Your decisions will influence your 3 Key Character Traits: Confident, Popular & Loyal. These traits will change how those around you will perceive you and the opportunities that are presented.\nA unique and immersive fighting mode combines gripping story with challenging gameplay truly making the game feel alive. The achievements are much more rewarding, but the failures will leave you with dirt on your face. And with a handpicked soundtrack for every single moment, get ready to be immersed in the world of College Kings.FeaturesCreative fighting experience offers a tough yet rewarding challenge.\nActive pathing from player choices will decide your story.\nDetailed character personality system changes how the world around you unfolds.\nScene selector to relive your favourite moments.\nInteractive sex scenes put you in control.\nReal life mode forces you to live with your choices.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Undergrad Steve","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":21490,"name":"Pilot Brothers","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8f0/8f09310198772d2ea11feae4f7ce085e.jpg","description":"A provincial Russian town has been shaken in disbelief: their prized, rare, striped elephant, Baldakhin, disappeared from the zoo in the dead of night. The main suspect is its notorious former owner, Karbofoss. Two well-known detectives, the Pilot Brothers, set up a new investigation, pursuing the rogue through 15 comic-style locations to find the missing elephant. Sensible Brother Chief and his not-so-bright assistant, Brother Colleague, solve tricky puzzles and play their parts with precise timing in this humorous adventure game for the whole family!\n● 15 Increasingly difficult levels to solve\n● 2 Different characters: Brother Chief and Brother Colleague\n● Fast-paced, arcade mini-games and loads of absurdly witty mini-games!\n● Join the famed duo in their search for the elusive thief!","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"1C Wireless","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":21449,"name":"Disciples Sacred Lands Gold","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdd/cdd1f9f8c8b497561f4acc2ad58ebf92.jpg","description":"It is now the dawn of a new age. The most momentous of wars has begun in the heart of\nthe Sacred Lands. Four races - the Empire, the Mountain Clans, the Undead Hordes and the\nLegions of the Damned - stand ready for battle as they fight for the survival and dominance\nof their war-torn world, and the gods they have long believed in.\nThe Mighty Lords watch silently as their Disciples prepare for the daunting tasks ahead.\nEach warrior must engage in a struggle of swordplay, sorcery, and uncommon courage in order\nto complete their sacred quests.\nThe Empire fight to secure their people's future; The Mountain Clans search to regain their\nrune knowledge; The Undead Hordes seek revenge for their accursed god; and The Legions of the\nDamned battle to resurrect their fallen angel's soul. It is a struggle of desperation.\nEvery stroke of a sword, each blast of fiery magic must be endured beyond exhaustion. For once\nthe clouds of destruction clear, lands will have been transformed, new armies will have been\nforged and the cheers of the liberated will resound throughout the land.\nThe day of reckoning has come...\nOnly one race shall claim victory. Only the chosen will survive.\nFeatures:\n*Gold Edition includes over 25 new scenarios created by the developers and improved multiplayer functionality.\n*Engage in classic turn-based strategy and RPG action in a fully explorable medieval world.\n*Master over 100 spectacular spells, each boasting its own dynamic animation.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Strategy First","platforms":[{"id":0,"name":"PC"}]},{"id":389,"name":"Canabalt","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a9b/a9b505119dce288c69302e442621dd2d.jpg","description":"Escape the destruction of your city with just one button! The game that popularized the infinite runner genre is back with two-player mode and new challenges. Play any of the 8 new game modes with one or two players, dash across rooftops with four different runners, or just chase that high score in the classic futile race for survival.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Finji","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":185388,"name":"Escape Plan (2017)","genre":"Puzzle","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/774/774f81b667da1174f01ee35c7b1392d9.jpg","description":"This is my first released game. It is built using Unreal Engine 4.\nRight now there are 2 finished levels (that need some kind of polishing), and a semi-finished level, so the duration of the game is very small.\nI lost interest in making this as I have virtually no feedback from others so I'm releasing it here. If you like it and you want to support me, make a donation or post your feedback (negative feedback is welcome but be polite) and I'll be making more levels!\nThe minimum price is $1. Pay what you want. The recommended price is $5, around a cup of coffee or two, but feel free to pay more (or less, no problem there!)\nThe game is using the default Unreal Engine 4 Assets, as I'm no artist.\nCurrently there is no audio, just some sounds for doors etc.\nSystem Requirements:\nRAM: 2GBHDD: 450MBOS: Windows 7 and newerGPU: DirectX 11 capable card with 512MB VRAM and SM4.0 support.Mouse & Keyboard (obviously)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"dimitrisp","platforms":[{"id":0,"name":"PC"}]},{"id":42240,"name":"Doki-Doki Universe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f47/f47f02a68555e6c01d609c3ea5e39421.jpg","description":"Doki-Doki Universe is an adventure video game with a heavy focus on personality measurement during the gameplay's process. This is the only games within the IP and the first one by HumaNature Studios.\n\n###Plot\nThe developers tell a story of a QT3 — a robot who has been abandoned by humans due to lack of emotions which led him to fail “humanity test.” The main story arc is about QT3's ability to experience feelings. Alien Jeff comes to visit him after forty years of the isolations and checks whether he has gained any sentiments whatsoever.\n\n###Gameplay features\nThe gaming process primarily consists of Jeff and QT3 visiting planets and evaluating moral choices on each one. Every planet looks unique and cartoon-like and is painted individually, without the procedural generation of the environment. The core feature of the game is the player's perception of himself, as he proceeds through the narrative structure of the game — depending on choices he made, including both randomly picking planet color and thoughtful decisions about the fates of the living creatures dwelling on a planet.\nTo figure out the set of action on a particular planet, the player needs to figure out the likes and dislikes of the planet residents using summonables which are pictures every character may differently react to.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"}]},{"id":22876,"name":"Battle Realms + Winter of the Wolf","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f2b/f2b98e71bc2de3fedd700adc34cb5e68_68z16Oo.jpg","description":"Kenji, exiled heir to the Dragon throne, must stake his claim in a chaotic\nworld wracked by the subversive intrigues of the Serpent, Wolf, and Lotus\nclans. Shall he vanquish the land under a campaign of malevolence and\nterror or restore the war-torn realm to its former glory? Enter Battle\nRealms and choose your destiny. Explore the history that led up to the\nevents in Battle Realms in Battle Realms: Winter of the White Wolf.\nScattered and unorganized, your enslaved Wolf brethren hunger for revolt\nagainst their corrupt Lotus Clan masters. You must unite them. You must\nlead them. You must free them.\nBattle Realms is fantasy real-time strategy game inspired by the\nstories told in kung-fu movies and oriental mythology. Develop your tiny\npeasant village into a highly trained and deadly efficient clan of warriors\nwho are ready to die with your name on their lips. Experiment with Unit\nAlchemy and turn villagers into one-of-a-kind fighters like Samurai\nCannoneers, Bandits, Geisha, and scores of other mythical warriors. Defend\nyour people against the hordes of barbarians, evil magicians, and deadly\nninjas.The package includes the original Battle Realms and its Winter of the Wolf expansion that focuses on the Wolf clan and serves as a prequel to the original campaign.\nSeize tactical advantages in a living world teeming with life - birds fly when startled, wolves attack troops, and higher ground offers increased power to ranged attacks.\nCommand the power of Zen - your Zen Masters wield fantastic powers in the heat of battle.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Liquid Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":19688,"name":"Richard & Alice","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c1b/c1b47fb6c6122fd6399bbe2f0c6ddba7.jpg","description":"Richard and Alice are prisoners. Both their cells have a leather sofa and a state-of-the-art computer. But only Richard’s has a TV.\nOutside, the snow falls. It has done for some time. Elsewhere, they say, parts of the world have been rendered an inhospitable desert, the earth parched and cracked. People live in the zones now. The lucky ones, anyway.\nRichard and Alice have secrets.\nCreated by Lewis Denby and Ashton Raze, whose games journalism credits include the likes of Eurogamer, Gamespot and the Telegraph, Richard & Alice is a riveting mystery story about family, desperation and the weather – all set to the beat of an indie adventure game.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Owl Cave","platforms":[{"id":0,"name":"PC"}]},{"id":17254,"name":"Super 3-D Noah's Ark","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/89b/89b414702207cc1eba8c759248f45805.jpg","description":"It's been a long journey. In just a few days, the ark doors will open and Noah, his family & the animals will be back on dry land. But the animals have become a bit restless and are out of their cages. Camels, giraffes, monkeys, kangaroos and more are wandering throughout the corridors of the ark. As Noah, it's your job to regain order & get the animals to sleep until you leave the ark. Your only tool to accomplish this is the food you brought aboard the ark. Can it be done? You bet! But how?\n30 original levels.\n6 feeders and 11 animal varieties.\nFully featured in game map.\nFully textured mapped environments.\nFast moving adventure for all ages!20th Anniversary EditionRuns natively on modern operating systems.\nHigh resolution rendering.\nImproved, modern style controls.\nOption to play with SNES scale feeders.\nSteam Achievements and Cloud save.\nDigitial manual with quiz guide.\nIncludes original DOS port.\nDRM Free!","review":"","timePlayed":0.0,"releaseYear":1994,"developer":"Wisdom Tree","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Genesis"},{"id":0,"name":"SNES"}]},{"id":16410,"name":"Curse: The Eye of Isis","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7ad/7adf6702d997015df77844b4ca31b5d7.jpg","description":"Strange things are happening at Great Britain’s museum of natural history in 1890. A gang of ruthless thugs has broken into the establishment, the Eye of Isis Egyptian statue has been stolen, and a mysterious fog has overtaken a number of areas of the museum killing and transforming all it comes into contact with.\nIn this survival horror game you will be playing as museum curator/archeologist Victoria Sutton and her childhood friend Darien Dane, you’ll have to fight the various beings and entities created by this fog. You'll spend considerable time in the museum, take a steam train to the coast and travel the seas in a huge cargo ship before finally entering the pyramid tomb where you must find and destroy the source of this ancient evil.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Asylum entertainment","platforms":[{"id":0,"name":"PC"}]}]