[{"id":18601,"name":"The Darkside Detective","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8ae/8ae1bb87afe9f3f117d6502a438bbc35.jpg","description":"Where cultists crawl, where demons dwell, where the occult… occults? *ahem* That's where you’ll find Detective Francis McQueen, the lead investigator of the criminally underfunded Darkside Division. When evil darkens the doorsteps of Twin Lakes City – hell, even when it just loiters around shop fronts or hangs out in shady alleyways – he’s there, ready to investigate the cases that nobody else will.\nHe is The Darkside Detective.\nThe Darkside Detective is a micro-adventure game with a distinct sense of humour. It’s being developed for PC & Mac, and consists of a series of humorous bite-size investigations into the occult and extraordinary. It features:\n- 6 cases, each more spooky than the last\n- Music from Ben Prunty, the audiomancer behind gems such as FTL and Gravity Ghost\n- At least three jokes\n- Cutting edge, high definition pixels\n- One free curse-removal, up to and including mid-level witch hexes","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Spooky Doorway","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":17606,"name":"Ace Combat Assault Horizon - Enhanced Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10b/10b16d1e0d5a10eb235e746b215dd8d7.jpg","description":"Ace Combat: Assault Horizon is a combat flight simulator game, the 13th installment in Bandai Namco’s Ace Combat series. \n\n###Plot \nThe story takes place in 2015 in different places across the world, including Miami, Russia, East Africa, and the Middle East. You play as Lieutenant Colonel William Bishop, head of the United States Air Force's Warwolf Squadron and his sidekicks on the mission of defeating Russian criminal syndicate Blatnoi. \n\n###Gameplay \nThe gameplay is very reminiscent of other Ace Combat entries. You control different aircraft on various combat missions. The game’s controls are a compromise between arcade-like and realistic approaches. For the first time in series, the game features a “Close-Range Assault’ system that is intended to bring the action closer to the player. \n\n###Game Modes \nBesides single-player campaign, the game offers various multiplayer modes. There are both cooperative missions and competitive matches. Two new modes introduced in Assault Horizon are Capital Conquest and Domination. In Capital Conquest, your team must destroy the opposite’s team headquarters. In Domination, two teams try to take over three bases in one city. \n\n###Enhanced edition \nThe Enhanced Edition of Ace Combat: Assault Horizon is an upgraded PC port of the game. It features improved graphics, controls, additional, and multiplayer content.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"NAMCO","platforms":[{"id":0,"name":"PC"}]},{"id":4606,"name":"From Dust","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8ba/8ba66ddb82841911442a2f1893f43c5e.jpg","description":"###Key features\nThe game, created by Eric Chahi, was developed and released by Ubisoft in 2011 for consoles like Xbox 360, PlayStation 3 and PC. The game is often considered as the successor to the late eighties game Populous. The game develops it plot around mysterious being The Breath, which was called by the natives to return long-lost knowledge. The player takes control of the mouse cursor. It can influence different substances and elements like lava, earth or water. The player has the opportunity to help the natives overcome everyday problems, for example, with the search for totems or with the elimination of the consequences of the typhoon.\n\n###Developer’s return\nThe game originally supposed to be a real-time strategy and the return project for Eric Chahi to the company after a study break. The transformation of matter in the game is quite elaborated: lava can cool down to the state of stone, plants grow only on fertile soil, various weather conditions and cataclysms are simulated. The player controls a spherical cursor that is able to change matter and thereby help the natives. Structurally, the game consists of several missions that are linked together by a single story about a tribe of islanders and their quest for finding lost knowledge. The game has two modes: Story and Challenge mode.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Ubisoft","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1020,"name":"Mordheim: City of the Damned","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3bd/3bd9e6ff809fa6ba1f8160dbf14b1297.jpg","description":"Special Offer\nAbout the GameMordheim: City of the Damned is the first video game adaptation of Games Workshop's cult classic tabletop game Mordheim. Set in the Warhammer World's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes. The game blends RPG elements, fast-paced tactical combat and intricate unit customization in a time wrought by chaos and rivalry where only the strongest survive.\nAfter a twin tailed comet crashed on Mordheim, the City of Damned turned into a terrifying battlefield where rival warbands fight fiercely for the control of key neighborhoods, looking for glory and fortune by acquiring the very valuable Wyrdstone fragments.\nChoose from iconic Mordheim warbands - Sisters of Sigmar, the Cult of the Possessed, Skaven, Mercenaries from the Empire - and lead your troops to battle. Recruit new units, equip them with enhanced gear. Evolve and customize your warband with the experience gained from each successful mission, transforming them into a terrifying force on the battlefield.\nDevise the best strategy to annihilate your rivals. If you fail, some of your units might lose a limb... or worse. Keep in mind that in Mordheim: City of the Damned, a dead unit is lost forever! Consider the environment when formulating your battle strategy, exploiting the unique buildings, ruins or the layout of the streets. Deploy your troops carefully and anticipate the actions of your adversaries to set up ambushes! Organize ingenious battle plans where the talents of your units will be as important as your own luck during key moments of combat.\nLoot items and weapons hidden in the ruins, or steal those of fallen opponents. Survive the dangers that abound in the City of the Damned and collect as many Wyrdstones as you can, but remain ever vigilant. Mordheim is one of the most treacherous places in the Warhammer World!\nIn these epic battles where fame and glory await, your strategy will definitely be your best ally! Visit the four corners of the City of the Damned to complete multiple missions in the solo campaign, or challenge other players in enthralling multiplayer modes.\nFully customize your warbands\nChoose from a multitude of classes with unique abilities to create unique strategies\nTake your troops to battle and test their synergy on the field\nGain experience to unlock Player's special abilities\nSpend the Wyrdstones to acquire powerful items and unlock more choices and features\nFace other Player's Warbands in head to head skirmishes","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Rogue Factor","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":560733,"name":"Diablo II: Resurrected","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3f2/3f207dcc7931598567a90bc779a95cf8.jpg","description":"A Timeless Classic, Resurrected\r\nDiablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal, now in up to 4K (2160p) resolution on PC. Diablo II Resurrected features:\r\n\r\n\r\nRemastered graphics—monsters, heroes, items, spells, all resurrected.\r\n\r\nAn epic story told through five distinct acts.\r\n\r\nClassic gameplay—the same Diablo II you know and love, preserved.\r\n\r\nUpdated Battle.net support.\r\n\r\nPlanned support for cross-progression—take your progress wherever you play.\r\n\r\n… and much more!\r\nThe Lord of Destruction Returns\r\nDiablo II: Resurrected includes all content from both Diablo II and its epic expansion Diablo II: Lord of Destruction®. Battle your way through icy caverns, horrific tombs filled with undead abominations, and frozen wastelands to the frigid summit of Mount Arreat and stop Baal, the Lord of Destruction. Raise hell with two Lord of Destruction playable classes—the cunning Assassin, master of traps and shadow disciplines, and the savage Druid, a bold shapeshifter and summoner who commands primal elemental magic.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"}]},{"id":10029,"name":"Get Even","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/66c/66cad7e826e08682192392e37cce3cd1.jpg","description":"Black - an ice-cold mercenary and hired gun - awakes in a mysterious old asylum with no memory of his past.\nUnder the guidance of his anonymous captor, ‘Red’, Black embarks on a form of treatment, facilitated by a unique technology - a headset that allows the user to relive their memories and experience them again in the present.\nAnd so Black tries to remember.\nWith the help of the ‘Pandora’ headset, he travels into the depths of his own mind to explore the truth behind the only thing he can remember: the rescue attempt of a teenage girl with a bomb strapped to her chest.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":59613,"name":"Spelunky 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/686/68625f8bef120a2a6074c394baf27f77.jpg","description":"Meet the next generation of treasure hunters in Spelunky 2! Follow Ana Spelunky and her friends on an exciting new adventure as they journey deeper than they could have ever imagined...","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"BlitWorks","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":19483,"name":"Avencast: Rise of the Mage","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8a9/8a93801fbd249cfc6fd42140dfbf20a7.jpg","description":"Avencast: Rise of the Mage is an action RPG game developed by ClockStone Software. The game combines the elements of a beat-em-up, quest and puzzle games. \n\n###Plot\nA young mage is brought up by an old wizard and is sent to Avencast wizardry academy. To complete his final exam, the mage has to go to a forest and find his own crystal. Upon returning back to the academy, it is revealed that Avencast fell under attack. The monsters roam the halls of the academy, while a few survivors barricade themselves deep in the academy. The mage has to save Avencast and figure out why was it attacked in the first place.\n\n###Gameplay\nThe main action in the game is killing enemies. It can be done in two ways: using magic spells or physically attacking them. Should the player choose the first method, they'll have to figure out the complex magic system.\n\nThe magic system consists of three branches: force spells (used for close quarters combat), wisdom spells (long range combat), and summon spells (used for summoning pets and comrades). The activation of every spell is made with the press of three buttons. \n\nAfter killing an enemy, the players are awarded experience points which are used to level up your character. After leveling up, 10 points are given to the player, that can be used to upgrade the character stats or to buy new spells. The players can loot Avencast to find potions, notes, new armor or clothing.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"ClockStone Studios","platforms":[{"id":0,"name":"PC"}]},{"id":28414,"name":"FIFA 12","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ab7/ab7fdd680a7008a14b5bd8d99c760925.jpg","description":"FIFA 12 is the nineteenth installment of the decades-spanning series of soccer simulators by Electronic Arts. It is based on the 2012 season.\n \n###Changes from the previous games\nWhile FIFA 12 did not change the gameplay dramatically, the game includes several important updates. The most notable is Impact Engine that calculates procedurally generated collisions based on laws of physics. The engine takes into account the players' stats as well as the speed and angle of the collision. This makes the game less predictable and more realistic. The engine also influences the injuries of the players. \n\nThe game also introduces a new Tactical Defending system that gives the player more control over his or her defenses, and the Precision Dribbling option that allows the player to protect the ball while dribbling it. Another new feature is Pro Player Intelligence that makes the AI-controlled players take into account their teammates' skills.\n\n###Teams\nThe game includes 29 national leagues and 42 national teams. Notably, however, both the Czech national team and league are absent, as well as several others that were present in FIFA 11. \n\n###Multiplayer\nThe game introduced Head to Head Seasons mode that offers the players to progress through the ten divisions during ten seasons of ten games each. A new system automatically pairs the players with similar preferences, such as manual control, against each other.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Electronic Arts Canada","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"}]},{"id":42912,"name":"Gigantic","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/174/1749429e194be9f3fc0ecc1f98912c44.jpg","description":"Gigantic is a MOBA game with a unique twist. Each team in Gigantic has an enormous Guardian, who is the core of the gameplay.\n\n###Characters\nThe players fight each other in the teams of five \"heroes.\" The game has a roster of over 20 unique and named heroes. They belong to 10 classes with different abilities, such as melee-oriented Bruiser, a creature-conjuring Summoner, a Healer, or a Tank. The players can upgrade their characters right in the middle of a match. They can also obtain cosmetic improvements through in-game currency or microtransactions.\n\n###Guardians\nEach team has a Guardian, a huge powerful monster who accompanies the players. The Guardian is AI-controlled and only enters the fight upon seeing the enemy. However, Guardian's attacks are the most powerful. The goal of each match is to eliminate the enemy Guardian while protecting your own Guardian. Killing the enemy players doesn't count for victory score.\n\nEach match has several milestones. When a team manages to injure the enemy Guardian to a certain point, the two Guardians will fight each other in an even called The Clash. Dusing Clashes, the Guardians will destroy and reshape much of the game's map. It significantly influences the gameplay and also adds to the sense of the Guardians' enormous size and power.\n\n###Shutdown\nSince August 2018, the servers of Gigantic are no longer available.\n\n[Official gigantic shutdown notice](https://www.arcgames.com/en/arc-news/detail/10966193-gigantic-server-shutdown)","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Motiga","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":14930,"name":"Sonic the Hedgehog 4 - Episode II","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/845/84595759d06a7c5ed2eab76f623454f7.jpeg","description":"The Sonic 4 Saga continues in Episode II with the return of a beloved side kick and fan-favorite villains!\n\n\n\nFollowing the events of Episode I, Metal Sonic has returned to form an alliance with Dr. Eggman! To face this new evil, Sonic will have to call upon an old friend to help him save the day! Now joined by Tails, race across four new Zones and take down fearsome new badniks with deadly combination moves in order to put an end to this dastardly duo’s plans!\n\n\n\nExperience the Sonic 4 saga as never before with the addition of a brand new engine; bringing you gameplay with updated physics and zones in stunning HD graphics! Also new to Episode II is the addition of online/local collaborative play where players can team up with a friend to take control of Sonic and Tails as they battle against Dr. Eggman!\n\n\n\nBONUS! Owners of both Episode I & Episode II will unlock Episode Metal! Play as Sonic’s greatest rival in this exclusive zone and experience the untold story behind Metal Sonic’s revival!","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"SEGA","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"iOS"}]},{"id":11747,"name":"Wargame: European Escalation","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe0/fe044284119f28c3f5e6e31bad7a01ff.jpg","description":"Wargame: European Escalation is a real-time strategy game developed by Eugen Systems.\n\n###Setting\nThe game takes place during the end of the Cold War and explores the face off of NATO and the countries of the Warsaw Pact. More than 300 units of eight countries are present in the game.\n\n###Gameplay\nThe singleplayer mode features four campaigns (One for the FRG and the U.S. and two for the USSR). Each campaign is a hypothetical war scenario between the NATO and Eastern forces in Central Europe.\n\nThere is no unit building present in the game. Every arriving reinforcement is paid for using deployment points, which are accumulated for control over key areas. Reinforcements are not unlimited, as the amount of purchasable units is limited. Units earn experience on the battlefield and if they survive until the end of the mission, they can be used on the next level of the campaign.\n\nUnits have a set of stats: experience, health, psyche, ammo count, and accuracy. The units psyche depends on the state of the battle with the enemy forces. If a unit suffers a panic attack, it's efficiency goes way down. Vehicles can be upgraded. Some of the units are only present in the game's multiplayer mode. Initially, the player has access to a little number of the game's units. New units are purchasable for the command stars that are awarded both in single and multiplayer modes. The players can get 840 stars overall.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Eugen Systems","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9883,"name":"Distance","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fdb/fdb08676a20b0eaa5c8410ae9648a67c.jpg","description":"Distance is an atmospheric racing platformer. Fusing futuristic arcade racing with parkour, survive a deadly, mysterious, neon-drenched city by jumping, rotating, and flying.\nThe roads are treacherous with obstacles around every corner. Instead of doing laps on a loop, survive to the end in the quickest time. Your car has abilities that not only allow you to drive on the track, but upside down and on buildings and walls! You can also fly to discover new shortcuts and paths. Take on the roads alone, or in multiplayer with your friends!\nThe game is a spiritual successor to the multi-award winning Nitronic Rush, created by ourselves and 5 others at DigiPen Institute of Technology. It was widely praised for its innovative mechanics, visual style, audio design, and atmosphere.Key FeaturesAdventure: A short single player experience. Drive into the heart of a dark, mysterious city as you pursue an ominous threat.\nArcade: Race ghosts to take on the leaderboards' best. Earn medals to unlock new tracks in several different modes.\nMultiplayer: Online (up to 12 players) and split-screen (2-4 players) play in modes such as Sprint, Reverse Tag, Stunt, etc.\nTrackmogrify: Random track generation with advanced seed modifiers.\nVR: Full VR integration with support for Oculus Rift CV1 and HTC Vive.\nLevel editor: Use a powerful level editor to create levels from within the game and share them with players around the world. Over 2,000 levels have already been shared on Steam Workshop!\nOriginal soundtrack: New music from the composer behind award-winning games like Nitronic Rush, Solace, and The Fourth Wall. Listen to a preview here.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Serkan Binici","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":42391,"name":"Nosgoth","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c9d/c9d3512ecdc11a2da63dc8f6d5af1f80.jpg","description":"Nosgoth was a free-to-play action multiplayer game, a spin-off from the Legacy of Kain series. The project was closed in 2016, two years after the release in Steam Early Access, because of the lack of players. The story was set several years after the events of Legacy of Kain: Soul Reaver ad followed the confrontation between men and vampires for the lands of Nosgoth.\nThe gameplay was focused on class-based combat, where vampires, as a rule, used melee techniques and superpowers, and humans relied on guns, crossbows and other weapons. Additionally, every character had their own special abilities that determined their role during the match. There were two modes of the game. In Deathmatch one team needed to kill more enemies than the other. At the same time Flashpoint mode was focused on humans capturing certain points and vampires, trying to stop them.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Psyonix","platforms":[{"id":0,"name":"PC"}]},{"id":3801,"name":"Assassin’s Creed Liberation HD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ffd/ffd241ae3648999c599917f40cf78ca2.jpg","description":"Introducing Assassin’s Creed® Liberation HD, the striking chapter of the pre-American Revolution Assassin’s Creed saga which arrives for the first time on HD consoles and PC. With improved gameplay, a deeper story, and HD graphics, Liberation is an immersive and full Assassin’s Creed experience.\nThe year is 1765. As the events leading up to the American Revolution heat up in the north, Spanish forces plan to take control of Louisiana in the south – but they have yet to reckon with Aveline, a deadly Assassin who will use every weapon and ability in her arsenal on her quest for freedom.  . Whether eliminating her enemies with her multiple assassinations technique or luring them into deadly traps using her tools, Aveline strikes mortal fear into the hearts of those who stand in her way.\nAs an Assassin, Aveline soon finds herself on an unforgettable journey that will take her from the crowded streets of New Orleans to voodoo-haunted swamps and ancient Mayan ruins. She will play a pivotal role in the turbulent New Orleans revolution and the beginning of a new nation. As she fights for freedom, not for herself, but for those whose life and hopes have been squashed.Key FeaturesAVELINE IS BACK\nAs Aveline, an Assassin of mixed French and African heritage, you must use your skill, instinct and weaponry – including a machete, poison-dart blowpipe, a whip and duelling pistols – to hunt down and eliminate your enemies.\nEXPERIENCE THE UN-UNITED STATES OF AMERICA\nFeast your eyes on a richly detailed world, thanks to the AnvilNext engine which features groundbreaking physics, animation and innovative combat system. Outmaneuver your enemies in the Louisiana bayou with the unique Tree Navigation system, and eliminate them from above with deadly precision. Deep dive under water as you search for lost Mayan treasures, but stay alert; the hostile wilderness and humid swamps are full of menacing animals.\nCOMPLETELY IMPROVED EXPERIENCE\nTaking full advantage of its new hardware, Liberation HD introduces graphical improvements such as high-dynamic-range (HDR) rendering, high definition environments and characters, updated cinematics the sum of which delivers a complete graphic overhaul of the title. The gameplay experience has been revamped too with updated missions that improve the pacing, new missions that dive deeper into Aveline’s story, and updated world design for more gameplay options during mission. Finally, a particular attention was given to the audio with re-mastered music and all-new SFX.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":21777,"name":"8BitBoy","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b0d/b0d647d253e133e8d3d6111ab412edda.jpg","description":"8BitBoy is an indie platformer developed by AwesomeBlade. \n\n###Plot\n8BitBoy is unemployed, lonely, and does not know what to do with his life. He decided to start up his old and trusty eight-bit console to remember the good times he had when he was just a little kid, but when he puts in the cartridge, 8BitBoy gets sucked into the game's world.\n\n###Gameplay\n8BitBoy is an homage to the old NES-era games (mainly platformers). It is heavily inspired by titles like Super Mario Bros., Donkey Kong, and Mega Man, featuring numerous game designing elements present in these games.\n\nWhile still being an eighties classic platformer, the developers made several additions to the basic gameplay formula. The players still have to get to the end of the level untouched, as any contact with the enemies will kill them and reset the level back to the beginning. The enemies are killed by jumping on top of their heads. This applies to every enemy present in the game, either a basic sentry or the final boss. The players can also pick up a special power-up that will allow them to shoot projectiles that ricochet off the walls, but this power-up can be used only for a limited amount of time.\n\nThere are five worlds present in the game with each world consisting of 10 levels and featuring its own art style and environment.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"AwesomeBlade","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9155,"name":"Edna & Harvey: The Breakout","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b06/b066f5358cae814ba11a68895e38acff_vODaQbn.jpg","description":"Buy Harvey's New Eyes:http://store.steampowered.com/app/219910/\nAbout the GameThe award-winning debut adventure game from the creators of Deponia and The Whispered World now on Steam. Accompany young Edna and her talking stuffed bunny Harvey on a whacky attempt to escape from her padded cell. Experience a bizarre journey all across the insane asylum and far beyond its brick walls.\nAt the beginning, young Edna wakes up in the padded cell of an insane asylum with no memory of her past. She doesn’t have the slightest idea how she wound up there, but one thing is for sure, she wants out! After all, she feels perfectly sane – and her talking stuffed bunny Harvey agrees completely. Together, they attempt an escape and, in doing so, meet their extremely bizarre fellow patients – from the man in the bee costume to the pseudo-Siamese twins Hoti and Moti. But Dr. Marcel, head of the asylum, will stop at nothing to keep Edna from escaping. What does he have planned for her? And why was her memory erased? Gradually, Edna regains her memory of the time before her detention in her cell…Key Features\nOver 20 hours of twisted humor\nIncredibly funny insane characters and crazy dialogs\nUnique comic style\nUnlockable achievements\nGerman and English voiceovers\nWinner of the 2009 Red Dot Design Award (PC Edition)\nFrom the creators of the award-winning games The Whispered World and Deponia","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":22828,"name":"Fahrenheit (Indigo Prophecy)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6a7/6a78ff1d0b8c1e454886a64fe521eeee.jpeg","description":"In the men's room of a diner a mysterious murder takes place. The murderer is an ordinary man. He has no idea who his victim is. But this isn't an isolated incident. All over New York regular people are killing total strangers. The only link between the killings is that they all show the same ritual patterns.\n\n\n\nExperience this gripping story as you play each of the four characters in this remarkable game. The murderer: Lucas Kane. The smouldering detective: Carla Valenti. The NYPD Agent: Tyler Miles. And the murderer's brother and priest: Markus Kane.\n\n\n\nDiscover the truth: Why are these victims being killed? What is making people engage in these murders? And who is the mastermind behind it all? This is a unique chance to run from the police and hide from yourself. Welcome to a new form of video game.\n\n\n\nFahrenheit is a second game made by Quantic Dream - studio responsible for masterpieces such as Omikron: The Nomad Soul and Heavy Rain. All their games were very well received by gamers and Fahrenheit is no exception. With superb story, groundbreaking  gameplay, and Hollywood-level narration Fahrenheit (a.k.a. Indigo Propecy) has earned its place as one of the best action adventure games of all time.\n\n\n\nDisclaimer: This is an uncut and uncensored version of FahrenheitExciting story with science-fiction and  paranormal elements, well executed plot twists, and more than one main character.\nEnchanting music, superb voice acting, and professionally directed cut scenes.\nUnique, movie-like gameplay - almost everything you do just fuels the action and builds up suspense.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Aspyr Media","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":10397,"name":"Rivals of Aether","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9a0/9a0e8a4379d465ac6c17a599456b5374.jpg","description":"Rivals of Aether is a platform fighting game developed and published by Dan Fornace in 2014. The game takes heavy inspiration from the founder series of its genre, Super Smash Bros., and specifically its second entry, Super Smash Bros. Melee. Dan Fornace describes himself as a long-time fan of the Smash Bros. series, being the developer of the 2010 'de-make' fangame Super Smash Land.\n\nLike in Smash Bros., instead of a traditional fighting game arena, a game of Rivals of Aether takes place on a stage that could be compared to a platform game level. Instead of a health bar, damage is represented by a percentage. The higher the percentage, the further a player will be knocked back when hit. The goal of the game is to knock other players out of the screen using a varied moveset. Two to four players can take part in the same game, in a free-for-all or a team battle. \n\nRivals of Aether differs from the Smash Bros. series in that, instead of having Smash Bros.' enormous amount of content, it puts heavy focus on its competitive aspect. The game features a tightly balanced roster of 14 characters (including 2 guest characters) and every stage has an unique variation designed for competitive play. The game pulls the roots of its mechanics from the second entry in the Smash Bros. series, Super Smash Bros. Melee, famous for its competitive depth and aggressive gameplay (many advanced techniques from different entries of Super Smash Bros. are present, such as wavedashing, Reverse Aerial Rush or moonwalking, and the game is balanced with them in consideration), and tries to improve on them while cultivating its own original dynamics ; among other things, the classic shield has been replaced with a parry, which can stun opponents if it succeeds, at the risk of a significant recovery period if it doesn't).\n\nThe game has gathered a decently-sized competitive scene and is ran along with Smash Bros. at various major tournaments such as Genesis or Frostbite, in addition of having its own championship series and other tournament series, primarily in the United States.\n\nAs all DLC characters for Rivals of Aether have been released, a Definitive Edition of the game is set to release in the future, on PC, Xbox, Nintendo Switch and potentially PlayStation 4.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Dan Fornace","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":56183,"name":"Resident Evil (2002)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d24/d24ceb45b267f4b69b5d51c36c9a46db.jpg","description":"Resident Evil is a survival horror video game developed by Capcom Production Studio 4 and published by Capcom. Released for the GameCube video game console in 2002, it is a remake of the 1996 PlayStation game Resident Evil, the first installment in the Resident Evil video game series. The story takes place in 1998 near the fictional Midwestern town of Raccoon City where a series of bizarre murders have taken place. The player takes on the role of either Chris Redfield or Jill Valentine, S.T.A.R.S. agents sent in by the city to investigate the murders.","review":"","timePlayed":0.0,"releaseYear":2002,"developer":"Capcom","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"GameCube"}]},{"id":11617,"name":"AX:EL - Air XenoDawn","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c7b/c7bf141c7a0ed4ff5485a05bec84e579.jpg","description":"Build your own aircraft and prepare to fight\nCombining the very best of sci-fi and aerial dogfighting gameplay, AX:EL delivers a totally new gaming experience. Create your very own shape-shifting vehicle and dominate both the sky and the ocean.\nBuild your own bespoke aircraft, from mainframe to wings. Dominate the skies then watch your aircraft morph in to a silent underwater killing machine  as you chase the enemy from the blue skies in to the darkest depths of the ocean.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Alex","platforms":[{"id":0,"name":"PC"}]},{"id":7147,"name":"LYNE","genre":"Board Games","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/df4/df47a9df698c2c5b40de17e80f2f5ae0.jpeg","description":"LYNE is a minimalist puzzle game where the player has to connect geometric figures. Connect blocks (these can be square or triangle) to other blocks of their respective color to pass the level. \n\n###Gameplay\nThe goal is to connect the same colored shapes with non-intersecting lines. Depending on the difficulty of the level, there is a bigger network on which to do this, and more color sets to connect. It is a fairly straightforward title, but what makes it replayable is execution quality and unusual puzzle-solving experience. There are no timers, no enemies to kill, and no penalties for making mistakes. The puzzles are simple in the beginning but as time passes they become more complex. In a while, the player faces more colors, shapes, geometrical figures, lines. Lyne has several pre-made puzzles (650+), so it does not run out of levels too soon. Also, the game also offers daily challenges; they're called procedurally-generated puzzles. It also supports multiple languages. \n\n###Key features\nThe game mechanics are easy to follow. The player might get stuck on a puzzle, but every one of them can be solved.\nThe interface, in general, is smooth. The sound effects are string together in a pleasingly melodic fashion; they are soothing and quiet. The graphics and the music are designed to calm the player; the colors are soft and pastel.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Thomas Bowker","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1863,"name":"D4: Dark Dreams Don't Die","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7a5/7a5f7a3e58593bfda983507c2ddbc891.jpg","description":"In D4: Dark Dreams Don't Die, the player assumes the role of a detective who can see and alter the past. The very name of the game, D4, references the concept of time as a fourth dimension that can be explored.\n\n###Plot\nThe main protagonist, David Young, is a former Boston police officer who served in a narcotics unit. A couple of years ago someone killed his wife. David himself suffered a head trauma that made him amnesiac. The same trauma allowed him to uncover his superhuman skill to see the past. When he touches the important items related to his past, he can see their history and even travel to his own past to change it. Now Young became a private detective and is still searching for his memories and his wife's murderer. His goal is to change the past to prevent her death. On his investigation, Young will encounter many oddball characters and question his own sanity.\n\n###Gameplay\nThe game consists of a series of episodes, not unlike a visual novel. The player controls David Young from the third person view. The main character is limited in his movements and can only follow the predetermined paths. The goal is to explore the locations and to interact with various characters to uncover the mystery. The game often uses quick time events, and when the player fails them, the protagonist loses health. Xbox One version of the game employs Kinect as the main control tool, while PC version allows the player to use the mouse.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Access Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":20985,"name":"Saira","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6b1/6b1c6ce0863a74712bcd7ec6caa78c29.jpg","description":"Saira is a two-dimensional indie platformer game developed by Nicklas Nygren. The game is free, and its code was released publicly.\n\n###Plot\nThe game is set in a distant future, where humans figured out the interplanetary travel and colonies. Saira is a photographer. After a mysterious accident, she becomes the only human being left in the galaxy, yet she does not remember what happened due to a malfunctioning teleportation device that broke down during the event of teleportation itself. Saira begins her journey on her ship on Mars.\n\n###Gameplay\nSaira can run, jump, hang on ledges and interact with the in-game world's items. She carries a personal data assistant with her at all times, which allows the players to manage her inventory through it, review the taken photos or to teleport Saira to the last checkpoint or directly to her ship.\n\nSaira can photograph the scenes around her, which can be helpful, as there are clues present in the game that only appear after being photographed, such as the symbols on the walls.\n\nCheckpoints have to be activated manually upon encountering them if the players want to teleport back to them.\n\nThe game features multiple puzzles that are required to be solved to use several game items. It is possible to open the PDA while interacting with the items.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Nicklas Nygren","platforms":[{"id":0,"name":"PC"}]},{"id":13965,"name":"Iron Snout","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/484/4848bcf4deb6eeb3228048c7497dc1a6.jpg","description":"Iron Snout is fast, colorful and brutal button-mash fighting game in which you will be helping a piglet fight for its life against hordes of wolves.\nengage in fast-paced and bacon-flavored combat\nuse movie-like combo moves to fight hilarious (but dangerous) enemies\nuse enemy body parts and weapons to aid your battle\ngo crazy with hyper-responsive controls\nunlock tons of Steam achievements\nbattle your friends and enemies in Steam leaderboardsDeveloper\nHey, I'm SnoutUp and I'm solo hobbyist game developer from Lithuania. I like making little action-packed and pig-based games, but I'm very bad at introductions. Iron Snout is my first Steam release, but you can find a couple of my other games scattered around mobile marketplaces and itch.io. If you'll have time to do that let me know what you think about my games via tweet or email! Hope to see you soon!Special thanksStore art: Steffen Wittig\nBackground music: weirdnoises","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ratalaika Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":20970,"name":"Litil Divil","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/67e/67e654f926344bd8d4f6170d43e8a45e.jpg","description":"Litil Divil is a puzzle game developed by Gremlin Graphics Software.\n\n###Plot\nMutt is a lost little devil. He hears a story of a Mystical Pizza that can be eaten only if you pass the Labyrinth of Chaos. The only thing is required to enter the Labyrinth - make a step through a Portal of Mortals, which a tiny demon accomplishes.\n\n###Gameplay\nThe game fuses together platforming, action, and puzzle elements together and creates a unique gameplay experience. This is not an easy game, as Mutts health constantly drops (although at a low rate), the traps of the labyrinth are very well hidden and take a large portion of health if Mutt is caught into them, and the unique monsters of the game want to have Mutt for dinner. There is only one way to defeat a monster, and it is to use a specific item that can randomly spawn on the level. In any other cases, your only option is to run away.\n\nThere is no autosave system present in the game. However, it is still possible to save your progress, as there is a bedroom behind one of the doors of the labyrinth. It is also possible to find a shopkeep, who will help you with items to fight the monsters only if you have the needed sum of money. It is impossible to know what is there behind a door without opening it.\n\nUpon entering a level, the players have to defeat an ogre that guards the entrance to the level. The player's health on the level depends on the outcome of that encounter.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Gremlin Interactive","platforms":[{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10186,"name":"Mr. Shifty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbf9db1fa0bb301ec051e243e86c05a1.jpg","description":"Shift through bullets, and master lightning-fast takedowns in an all new kind of action game from tinyBuild and Team Shifty! Mr. Shifty follows a teleportation-fueled heist to break into the world's most secure facility.\nShift through walls, through bullets, cover huge distances and be everywhere at once\nOne shot kills. Survive on skills.\nUse distraction, trickery, explore what's possible when stealth and action become one!\nToy with enemies, laugh as they use doors to enter rooms\nUnderestimate enemies, and cry as they use group tactics to outsmart Shifty\nA group of industry veterans behind 21 games, from GameBoy Advance to Xbox 360, have joined together to raise the bar for independent games: Team Shifty's action-packed debut is a must play!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"tinyBuild","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19426,"name":"Aviary Attorney","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f57/f570971602f520f141bf5d642786dcc2.jpg","description":"The year is 1848. Paris is on the brink of yet another revolution, and the prisons are overflowing with guilty and innocent alike.\nOne man stands for justice amid society's chaos. No. One bird...\nPlay the role of Monsieur Jayjay Falcon, a bird of prey with a good heart and questionable lawyering expertise. Join him and his witty apprentice, Sparrowson, as the two take on clients, interview witnesses, collect evidence, and deliver justice to the guilty.\nWith art by 19th century caricaturist J. J. Grandville, and music by legendary romantic-era composer Camille Saint-Saëns, this game promises to be a ~swanderful~ experience.Features:Four chapters of talon-biting intrigue and suspense.\nDozens of colorful characters to meet, interview, and bribe.\nDid I say bribe? I meant persuade.\nReal-life landmarks. Knock on the doors of Notre-Dame! Loot the Louvre!\nThree fully fleshed-out endings. Decisions have consequences!\nMore bird puns than you can shake a feather at.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Sketchy Logic","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":9944,"name":"Ghost in the Shell: Stand Alone Complex - First Assault Online","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2c/d2c1fffbd32d4b70e680e47a717f2602.jpg","description":"Ghost in the Shell: Stand Alone Complex - First Assault Online is an F2P FPS developed by Neople.\n\n###Discontinuation\nThe game's Japanese version was discontinued on November 29th, 2017. While its worldwide counterpart was available up to December 6th, 2017.\n\nOnce the discontinuation was announced, the option to buy in-game items for real money was turned off immediately. DLC was also no longer available for purchase.\n\n###Setting\nThe game is set in the universe of Ghost in the Shell: Stand Alone Complex anime, that was based on a manga by Masamune Shirow. The plot follows the personnel of the Japanese Ministry of Public Affairs' Section 9. \n\nThe year is 2030, cybernetic prosthetics and cyborgs became a common thing in a modern world. Section 9 investigates various hacking-related crimes. The division was made up of former military officers and distinguished police detectives.\n\n###Gameplay\nThe main feature of the game was the in-depth cyborg customization system. A heavy emphasis was put on teamwork as the players were able to share their skills with the teammates and provide tactical support. That and the addition of the iconic optic camouflage and different robots allowed for numerous tactical options.\n\nThe players had several stats, such as their strength, visibility, and detection. The latter was used to measure the player character's exposure to the autonomous drones.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Neople","platforms":[{"id":0,"name":"PC"}]},{"id":484554,"name":"Everhood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8b8/8b845a7f481defa4dc8e4d8e5de59374.jpg","description":"JOIN OUR DISCORD\nAbout the GameEnter the world of Everhood where up is down and down is left and where time has stopped and strange characters roam.\nHere you control a wooden doll character whose arm has been stolen by a blue gnome...\nFeaturesMusic based battles\nMain story 5-6 hour journey with many twists and turns\nExpect the unexpected\nViseral visuals accompanied with magical music\nAnd a great challenge that awaits the bold...\n((Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition))","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"EverhoodDev","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":20249,"name":"Squishy the Suicidal Pig","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/376/37642a7bf967b5490b813d1c20d7f7ba.jpg","description":"The game is a puzzle platformer. Piglet Squishy in a complicated way goes to the Devil himself - Squishy hopes that as a result he will be able to get into the paradise for animals and reunite with his dead parents.\n\n###Game modes\nIn the game, you can go through the campaigns (story mode), you can improve yourself, passing the game at speed (speedrun mode) and, finally, the game has a number of additional modes.\n\n###Gameplay\nThe game requires a variety of activities - collecting apples, blasting TNT boxes, searching for secret artifacts, solving puzzles, fighting with bosses. There are levels where it is required to solve tasks so unobvious that it seems that the game can not be passed.\n\n###Locations\nLocations are four, and in each location there are ten levels. More precisely, eleven - after the tenth location of each level you will meet with the boss.\n\n###Bosses\nBull. In addition to the Bull, boxes with explosives are still falling here. On the other hand, the boxes fall on the Bull too, which can be the key to victory.\nCoyote. Coyote - not the only trouble at its level. Exploding boxes are present here, but in the company of traps and other troubles. The strategy here is about the same - apply all these troubles against the boss.\nSnowman. It acts on the player by the wind and snowballs. A player can throw fireballs at Snowman.\nDevil. The devil is not easy to win. The battle stretches for five episodes. First you need to catch the Devil, dodging meteorite rain - it happens in space. Then we fight with him. In the third, fourth and fifth episodes we fight the Devil in his house - in hell.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Elias Viglione","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":16869,"name":"Faerie Solitaire","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/952/952e5f4b30effbde2c8f605c3add59c9.jpg","description":"Faerie Solitare is a card game-based video game with elements of a role-playing game developed by Subsoap. \n\n###Gameplay \nThe gameplay is mostly a typical solitaire game. Structurally, the game is divided into 40 levels, each based on a fantasy area such as Bright Cave, Mote Grove and so on. Each level consists of nine hands. After completing the level, the player gets some amount of cash based on how well their performance was. The cash can be spent to acquire upgrades such as the ability to see the value of flipped cards or extra undo button. \nThe player has to clean the board of cards chaining them one number higher or lower than the last one. If there are no cards left to the chain, the player can draw another one from the deck. The game has several features that differentiate it from other solitaire games besides already mentioned power-ups system. Chaining several cards without drawing additional from the deck makes a combo that increases the amount of cash that player gets after the level. Each the player progresses, several special types of cards appear, like frozen cards, which can be played only after activating a special fireball card. During the game, the player can obtain recourses that are used to grow different mystical pets. \nBesides the default Adventure mode, there are also challenge mode, that lets you play levels with harder objectives, and quickplay, that lets you play any hand you’ve already beaten.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Subsoap","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12687,"name":"Sunless Skies","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d2f/d2f5f87a6e6df6b988dac391605f0b60.jpg","description":"It is the dawn of the 20th century, and London has taken to the stars! As the captain of a spacefaring locomotive you'll behold wonders and battle cosmic abominations in the furthest heavens. Stake your claim. Fight to survive. Speak to storms. Murder a sun. Face judgement.\nTen years have passed since Sunless Sea, and Queen Victoria has led an exodus from London to the heavens. There, a revitalised British Empire - ambitious and authoritarian - begins to expand across the skies.\nThe stars are alive. They are the Judgements: vast intelligences that govern all things. But they are dying. One by one, something is snuffing them out, leaving their thrones empty. An opportunistic Victorian Empire is colonising the domains they leave behind, painting its industrial vision upon the fabric of the heavens.\nTravel between distant ports, unravelling stories, bearing passengers and news, and trading in exotic celestial cargoes.\nYour every foray into space is as precarious as a Polar expedition. You’ll need to balance your resources carefully and keep an eye on your crew’s Terror to avoid mutiny and death.\nYour captain's actions could tip the precarious political balance of a region. Will you run guns for the Independents? Or spies for the Empire? Choose wisely – your decisions will affect the story; not just for yourself, but for your future captains as well.\nLeave your mark on the universe, and be marked in return. When you are creating your captain, every decision is a story, and every story has a consequence.\nEquip your vessel as you see fit. Would you benefit more from reinforced armour plating, or the additional manpower allowed by external crew pods? (\"Soundproof! Cosy! Detachable!\")\nIt is not safe in the skies. A captain will need to defend themselves against pirates, scorn-flukes, the Cyst of Faces, and worse.\nRecruit a gallery of unpredictable characters to crew your locomotive as First Officer, Chief Engineer, Signaller, or Surgeon. Each brings their own skills and stories to your adventures.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Failbetter Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10228,"name":"Rock of Ages 2: Bigger & Boulder","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3d8/3d87406406e0a171f4330b30bb524689.jpg","description":"The greatest “giant rocks rolling through historical/artistic ages” tower defense game is back with Rock of Ages 2: Bigger & Boulder. Just like the title says, Bigger &Boulder cranks up the surrealism and gameplay to be, well… BIGGER AND BOULDER. With an emphasis on the chaotic new multiplayer for up to four rock-rollers, new time periods, and improved graphics, physics, and destructibility powered by Unreal Engine 4, players will need to be ready for some intense rocking and rolling.\n\nACE Team’s Trademark Quirkiness\nThe Monty Python-esque humor is turned up to 11, as players literally rock and roll through the ages. Humorous animated vignettes will also make a return in full force, so famous historical figures beware!\n\nAn Emphasis On Multiplayer\nA little friendly competition never hurt anyone, so that’s why ACE Team decided to improve the multiplayer feature of the game. Play with a friend in local split-screen or up to four players online in a 2v2 match to the death, all with the ability to customize banners and colors for your units and more. Oh, and did we mention that opposing tracks can now intersect each other?\n\nA Positively Absurd Art Style\nJust like in the original game, ACE Team has created various levels inspired by the greatest art periods in history. Players will gaze upon exquisite art from the Egyptians, Late Gothic era, Early Renaissance, and Surrealist movement, as they carve a path of destruction with their rolling rocks of doom!\n\nHistorically Inaccurate Bosses\nTake on works of art come to life in boss battles featuring the likes of The Thinker and the Great Sphinx, leading up to the all-powerful final boss in a showdown like you'd never imagine!\n\nImproved Physics and Destructible Environments\nWith upgraded physics and even more things to be cracked, crushed, flattened, and slammed, rolling various rocks down a hill has never been a more pleasant experience!\n\nUtter Chaos\nWith the addition of brand new defensive units and unique boulders with special traits, chaos reigns supreme so be sure not to take each turn for granite.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ACE Team","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":20720,"name":"Moonbase Alpha","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7d3/7d38af4840ed364c4dff323d4681cbec.jpg","description":"NASA has once again landed on the lunar surface with the goal of colonization, research, and further exploration. Shortly after the return to the Moon, NASA has established a small outpost on the south pole of the moon called Moonbase Alpha. Utilizing solar energy and regolith processing, the moonbase has become self-sufficient and plans for further expansion are underway.\nIn Moonbase Alpha, you assume the exciting role of an astronaut working to further human expansion and research. Returning from a research expedition, you witness a meteorite impact that cripples the life support capability of the settlement. With precious minutes ticking away, you and your team must repair and replace equipment in order to restore the oxygen production to the settlement.\nTeam coordination along with the proper use and allocation of your available resources (player controlled robots, rovers, repair tools, etc.) are key to your overall success. There are several ways in which you can successfully restore the life support system of the lunar base, but since you are scored on the time spent to complete the task, you have to work effectively as a team, learn from decisions made in previous gaming sessions, and make intelligence decisions in order to top the leaderboards.\nKey features:\t\t\t\t\tTeam up with your friends...\nThe fate of a lunar colony rests on the shoulders of you and your team.  Communicate and coordinate efforts with up to six players (LAN and internet) by using voice over communication.\nUtilize the latest in NASA technology...\nA fully functional rover that utilizes lunar physics is available to transport both players and supplies to all reaches of the lunar colony.  You can build and pilot your own repair robot in order to fix crucial systems before time runs out.\nImmerse yourself in an awe-inspiring lunar environment...\nTake your first steps on the moon's surface in a truly accurate lunar moonscape that is unmatched in any other application.\nCompete with your friends to reach the top of the leaderboards...\nDo you have what takes it to be number one?  When you win, your score will automatically be posted to the leaderboards for everyone to see.\nA unique experience each time..\nWith multiple paths for game success, you'll need to learn to work effectively as a team, learn from decisions made in previous gaming sessions, and make intelligent decisions in order to top the leaderboards.\nTailor your game to fit your gameplay style...\nDo you want to play with two players or six?  With multiple game maps you can select the game environment that best suits your team's needs.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Virtual Heroes","platforms":[{"id":0,"name":"PC"}]},{"id":10454,"name":"Estranged: The Departure","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2d7/2d7919cd02bc5023c3a5c5bcdbfcbb3d.jpg","description":"Before DownloadingPlease ensure your computer meets the minimum requirements listed below before downloading Estranged.\nDue to the game being more graphically intensive, computers that ran Act I may not be able to run Act II.\nAbout the GameEstranged: Act II follows the story of a fisherman, stranded on a mysterious island during a violent storm.\nThe game continues after the events of Estranged: Act I, which followed our hero's adventure in a search for a way to get home.\nExperience what the island has in store as you uncover the secretive Arque Corporation, burrowing ever deeper into their dangerous and haphazard operations.Key FeaturesAdventure game with puzzle elements\nImmersive story driven environments\nUnique characters and narrative\nFamiliar first person shooter gameplay\nEstranged Act II is built using Unreal Engine 4, please check the system requirements before downloading.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Alan Edwardes","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":14636,"name":"Legend of Mysteria RPG","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/34b/34bbb7f3e6fb870477d70cf2b9c71932.jpg","description":"Legend of Mysteria RPG is a role-playing game made with PRG Maker, the prequel to Labyronia series developed by Labyrinthine.  \n\n###Story \nThe game takes place in the world of Labyronia. You play as Windir, an air mage who lives in a tower with many other mages.\nThe most powerful of them is a fire mage and headmaster Dinyon. One day Dinyon get murder by a mysterious assassin. The guards quickly catch and kill him, however, right before death, he accuses Windir of arranging the murder. The guards catch you, but you manage to escape the tower. Now you have to solve the crime, find out who was behind the murder and prove yourself innocent.  \n\n###Gameplay \nLegend of Mysteria is a story-driven RPG, and unlike most other games in Labyronia series, it focuses much more on the puzzle-solving, exploration and interacting with NPCs rather than on battles. There are only a few fights in the game that are necessary to progress.\nThere is also no leveling up system or character advancement aside from getting new equipment and items. The combat system is turn-based. The battle screen resembles of the early Dragon Quest games: you only see the enemies but not your team. In battles, you can perform physical attacks, block, use items or magic spells. The variety of magic spells depends on your equipment.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Labyrinthine","platforms":[{"id":0,"name":"PC"}]},{"id":2674,"name":"EA SPORTS UFC 2","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/187/18712fa218a19396d209393a8958ae00.jpg","description":"EA Sports UFC 2 is a fighting game developed by EA Canada. It is the official game of the Ultimate Fighting Championship.\n\n###Plot\nThere is no plot present in the game, as all the fights heavily resemble the real UFC fights.\n\n###Gameplay\nThe main objective of the player is to knock their opponent out. The matches may end via Submission, Knockout, Technical Knockout, or by Judges' Decision in case none of the fighters gets knocked out. These matches take place in an octagonal cage, which the fighters cannot leave during the match. EA Sports UFC 2 is trying to resemble the real UFC matches as accurately as possible. The rule sets, venues, and the moves present in the game are carefully recreated in-game.\n\nSeveral game modes are present in the game. The players are free to play an instant UFC match, choosing the fighter and other fight aspects, such as the venue the match is held in, who to play against, and customizing the rule set.\n\nIn a Knockout mode, the players can only win a fight by knocking their opponent out. This mode focuses mostly on strikes, rather than on grapples. There is no stamina bar present in the Knockout mode.\n\nThe Ultimate Team game mode is also present in the game. The players build up a stack of cards which resemble different fighters to play against other players' stacks. Upon winning, the players are given coins, that can be used to upgrade their fighters or purchase new ones. The players can also engage in multiplayer fights against each other.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Electronic Arts","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 4"}]},{"id":325089,"name":"Sniper Ghost Warrior Contracts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/370/3708f3ab10645b8eaf0236abc30d8437.jpg","description":"Contracts delivers tailor-made missions that offer a clear main objective with a fixed monetary reward, and options to complete secondary objectives for bonus payouts. With hundreds of ways to take down a wide range of targets, Contracts offers sniping gameplay at its absolute best.\n• Play as a paid contractor, an assassin for hire and defeat your rivals.\n• Open-ended contracts, bounties and side ops deliver strong replayability options to complete objectives and collect cash to redeem for upgrades and rewards. Beware rival snipers who won’t hesitate to disrupt your best-laid plans.\n• Enhanced Scope Mode offers the most realistic experience of intense sniping with a wide range of targets and hundreds ways to kill.\n• Redesigned in-game HUD and UI with tactical tagging system to mark your enemies for death.\n• An arsenal of new gadgets to play with including drones, remote sniper turrets, sticky bombs and toxic gas!\n• Show off your stealth kills and execute silent takedowns to be rewarded for strategic, quiet play.\n• Battle the brutal wilds of Siberia, Russia and fight to survive the intensity of snow-covered mountains, lush forests and secret bases hidden deep in the mountainside.\n• Play team death match modes online across brand new, unique maps that will test your sniping skills.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"CI Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":14123,"name":"The Hex","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7f7/7f701c2daaa639ca2688c07121108fbf.jpg","description":"In a creaky old tavern, in a forgotten corner of the video game universe, a storm is raging. The barkeep gets a patchy phone call. It's hard to tell what the caller is saying, but this much is clear: someone in this tavern is planning a murder.\nThere are six patrons of the tavern; all of them are video game genre protagonists gone astray. There's The Spacemarine, The Sorceress, The Platformer, The Fighter, The Apocalypse Survivor, and The First Person Perspective. By exploring their memories you may discover the identity of the murderer... or you may find a much darker secret.In The Hex you will... Control the six patrons to explore the dark and enigmatic tavern\nDelve into the memories of these cast-aside game protagonists to learn the truth of their past\nLearn the identity of the would-be murderer... as well as the victim\nThis game is about as indie as it gets.\nDaniel Mullins - Programming, Art, Design, Writing\nJonah Senzel - Music, Sound Design","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Daniel Mullins Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]}]