[{"id":36795,"name":"Ultimate Spider-Man","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6d6/6d63dae10570fa26b80920025cb6cef8.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Vicarious Visions","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"}]},{"id":27057,"name":"The Legend of Zelda: Link's Awakening (1993)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1b/a1b2af4caa3c61f9922431baf1fca447.jpg","description":"A high-seas voyage takes a dangerous turn when Link's ship is destroyed \n      by a furious storm, and he washes ashore on the mysterious island of \n      Koholint. Link learns that the only hope he has of returning home \n      depends on awakening the mythical Wind Fish, who slumbers within a giant \n      egg atop the island's highest peak. But who is the Wind Fish? How do you \n      wake it? And what will happen when it awakes?\n    \n      Lead Link on an incredible adventure as you explore uncharted lands, \n      meet amazing new friends and foes, and unravel the mystery of the Wind \n      Fish. The first handheld-system release in this beloved franchise, \n      presented as it appeared in the 1998 Game Boy Color re-release, The \n      Legend of Zelda: Link's Awakening DX is a must-play for fans of this \n      beloved series.\n    This game is only playable in 2D.This classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. See more Virtual Console games for Nintendo 3DS.","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"Nintendo","platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"Game Boy"},{"id":0,"name":"Nintendo 3DS"}]},{"id":28915,"name":"Dash of Destruction","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bdf/bdfe89d50e5d509ef85337f91f08528f.jpg","description":"(Online Interactions Not Rated by the ESRB) Dash your way through the city as a hungry Tyrannosaurus Rex in search of a Doritos delivery truck, or as a terrified truck zooming in and out of the T-Rex’s path of destruction in search of its drop-off points. Enjoy the fast-paced action as a single player or join with friends! This game requires the Xbox 360 hard drive or the 512MB Memory Unit for storage. There are no refunds for this item. For more information, see www.xbox.com/live/accounts.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"NinjaBee","platforms":[{"id":0,"name":"Xbox 360"}]},{"id":17639,"name":"Rig n Roll","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ea/7ea3575b85ee2a8097b99583aa7c86f3.jpg","description":"Players will step into the shoes of a young man in the year 2014 as he arrives in California to pursue his dreams of road domination and capture the Californian cargo transportation market. There are miles of highways to conquer and cities and towns to reach as he becomes the greatest trucker on the highways. Rig’n’Roll is a sequel to the famous Hard Truck series. This time the game world is true-to-life. Gamers can race high-powered Semis along thousands miles of real Californian roads, visiting San-Francisco to San Diego, San Jose to Los Angeles. Rig’n’Roll delivers players the ultimate truck driving experience with authentic models of trucks and their interiors, completely new physics and astonishing 3D graphics among numerous features.\nPlayers will outrun their opponents to deliver cargo on time or take part in truck races to prove their professional skills, giving them the opportunity to improve their rating and authority among other drivers. Rig’n’Roll also gives gamers an opportunity to test their management skills as they establish their own cargo transportation company. Players will recruit staff and hire other drivers to work for them as they expand their business and eliminate their competitors from the transportation market. Apart from being the most accurate and innovative truck driving simulation game ever produced, Rig’n’Roll immerses players in an exciting story with an unexpected finale, making new allies and battling treacherous foes as they discover a conspiracy that will test their skills to the limit.\nKey features:\nAuthentic models of famous trucks — Freightliner, Peterbilt, Kenworth, Sterling and Western Star\nOver 12,000 miles of California roads, including all major freeways\nOver 40 California cities, including San Diego, San Francisco and Los Angeles\nTruck races, cargo delivery, economic simulation and a thrilling storyline","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"SoftLab-NSK","platforms":[{"id":0,"name":"PC"}]},{"id":17410,"name":"Schein","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/062/0629af460b03e51a73e1a621fc07e25f.jpg","description":"Schein is an award-winning, puzzle platformer that tells the story of a father who enters a mystical swamp in desperate search of his son. As he becomes enveloped in darkness and begins to lose hope, a wisp appears, offering him guidance and her magical power: a light that reveals hidden worlds.\nUse your wits and light to conquer mind-bending puzzles and defeat deadly beasts. Can you save your son in what’s possibly the trickiest platformer you’ll play all year?\nKey Features\nExplore three hidden worlds, each with its own art style and dangers, using magical lights unlocked throughout the game.\nSolve perplexing, occasionally maddening, puzzles and master challenging platforming action.\nUse your intellect and reflexes to battle deadly bosses.\nImmerse yourself in Schein’s story as it unfolds in fully synchronized dialogs accentuated by leed:audio’s atmospheric soundtrack.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Zeppelin Studio","platforms":[{"id":0,"name":"PC"}]},{"id":10369,"name":"Bloody Walls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8d9/8d9e9614940eede850efdb860fe40afc.jpg","description":"The world was plunged into chaos following an accident at a bio-weapon research facility. 100% of the earth's population has been infected. There is an antidote that blocks infection from the airborne strain of the virus, but the effect is temporary. This antidote has become the de facto currency of the new world. You have been informed that an enormous quantity of the antidote is being stored on the last floor of a bio-weapon lab.\nGame Features:\nAn original mechanic for dealing damage to enemies Four-bit graphics using the Game Boy's color pallet","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"L. Stotch","platforms":[{"id":0,"name":"PC"}]},{"id":7074,"name":"Animation Throwdown: The Quest for Cards","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c09/c09916af3e234e2b4ca2017d0a4c4ff4.jpg","description":"Family Guy! Bob's Burgers! Futurama! American Dad! King of the Hill! It’s ANIMATION THROWDOWN!\nFor the first time ever, five of your favorite animated shows are together in one amazing collectable card game.\nFeaturing hundreds of your favorite characters and moments from your favorite episodes from all the seasons of Family Guy, Bob's Burgers, Futurama, American Dad, and King of the Hill. Collect character cards, optimize your deck, and create new combos as you fight in an epic card battle bacchanal.\nThe game may be digital, but the stakes are real!* The fate of the world rests in your hands!**\n(*Stakes are not real.)\n(**The fate of the world does not rest in your hands.)\n30 Chapters of Adventuring featuring moments and locations from your favorite episodes. Hilarious bosses, big rewards, and lots of challenge. What does Futurama's Space Bee say when you play a strong card? How does American Dad's 70s Hot Tub react to winning a battle? Adventure away to find out.\nHundreds of cards and combos featuring characters from each show. What happens when you combine Fry and Money? We think you know. But how about making a Beefsquatch, a $300 Knife, or Pro Bass Hank? Collect cards and put them together to find out.\nChallenge other players from all over the globe in the multiplayer Arena. Earn Hero tokens to level up your favorite characters: from Bender to Consuela, from Bobby to Zapp Brannigan.\nPartake in limited time events with awesome rewards. Battle against other players, unique bosses, and other crazy combinations of events to earn exclusive rewards,\nnew cards, and lots of loot!\nJoin a guild, make some friends, and get ready to Rumble! Chat with your friends, discuss strategy, battle each other for bragging rights, and gain great bonuses from joining a Guild and playing the game. When Guild events are live, play together to prove you're literally the best in the world.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kongregate","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":331454,"name":"Pokémon Black 2, White 2","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/abf/abf12c25d84b8853f219854ef6a2a1b2.jpg","description":"Return to the captivating Unova region two years after the events of the\noriginal Pokémon Black Version and Pokémon White Version\ngames — the first time in the core Pokémon game series that a storyline\nhas continued from one game to another. In the Pokémon Black Version 2\nand Pokémon White Version 2 games, players can explore new\nareas, discover Gyms with new leaders and see how everything has changed\nin the last two years.\n\nFEATURES:\n\nThe Unova region has changed and grown in the two years since the\noriginal Pokémon Black Version and Pokémon White Version\ngames. The first towns players travel through are completely new, and\nsome characters from the previous games have grown and moved into\ndifferent roles.\n\nIn Pokémon Black Version 2 and Pokémon White Version 2,\nplayers will also be able to catch some of the Pokémon from outside\nthe Unova region, such as Eevee, Riolu, Tyranitar, Arcanine and\nMareep, right from the start of the game.\n\nPokémon Black Version 2 and Pokémon White Version 2\nfeature the Pokémon World Tournament, an exciting battle arena where\nplayers will be able to take on numerous Gym Leaders and Champions\nfrom previous Pokémon video games. Fans of the series will be able to\nbattle trainers like Lance, Champion from the Johto Region, and\nVolkner, Gym Leader from the Sinnoh Region. Players can also use a\nvariety of battle styles and moves found in Pokémon Black Version 2\nand Pokémon White Version 2 against these classic\nopponents.\n\nIn addition to this new series installment, the downloadable Pokédex\n3D Pro and Pokémon\nDream Radar will both be coming to the Nintendo eShop, giving\nNintendo 3DS players new ways to catch and learn about their favorite\nPokémon.\n\nPokémon\nDream Radar lets players use several different features of the\nNintendo 3DS system, including the Nintendo 3DS camera, motion control\nand augmented-reality technology, to discover and catch Pokémon. The\ngame includes hard-to-find Pokémon such as the new Therian Formes of\nLegendary Pokémon Tornadus, Thundurus and Landorus. Players can\ntransfer Pokémon they have caught with Pokémon\nDream Radar into their Pokémon Black Version 2 and Pokémon\nWhite Version 2 games (visible in 2D only).\n\nPokédex 3D Pro is a fully enhanced and upgraded version of\nthe original Pokédex 3D application that includes detailed information\nabout the more than 640 Pokémon featured in the history of the Pokémon\nvideo game series. Pokédex 3D Pro will include in-depth\nsorting, comparison and ranking tools, as well as comprehensive\ndetails on what abilities each Pokémon can learn and how it evolves.\n\nAs of May 20, 2014, the Nintendo Wi-Fi Connection service for Nintendo\nDSi and Wii systems has been retired. Online features of this game are\nno longer available after this date but this game still provides an\nentertaining experience in offline mode.\n\nTo learn more about this service change, please visit To learn more\nabout this service change, please visit support.nintendo.com/servicesupdate.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Game Freak","platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":17942,"name":"realMyst: Masterpiece Edition","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/1c0/1c01ef016b131b280ac9847f54a8cd74.jpg","description":"realMyst: Masterpiece Edition is a beautifully updated version of realMYST for today’s Mac and Windows computers - celebrating the 20th anniversary of Myst! The models and textures have been reconstructed to provide an amazing graphical experience. The environments have been enhanced to provide dynamic water, weather, lighting, foliage, focus, and more. The interface has been redesigned to provide an enjoyable way to explore for both novices and gamers.\nrealMyst: Masterpiece Edition - this is not your father's Myst! It’s been 20 years since Myst became your world, and there's never been a better time to revisit the Ages. This newly refreshed and rebuilt version of realMyst is all-things Myst, but amazingly more real. You can explore anywhere, unfettered, and in realtime! Pick your own path through the forest on Myst Island. Listen to the crickets as the sun sets in the Channelwood Age. Relax in the falling leaves in the Selenitic Age. Spin around for a full panoramic tour of Sirrus’ throne room. Seek shelter from the thunderstorm in Stoneship Age.\nAnd If you’ve ever been overwhelmed by realtime 3D - too many controls or too much motion - realMyst has something for you! You have the option to play the game just like the original Myst - with a simple point and click! Point where you want to go - click the mouse and you move through the world seamlessly to the new location. As a tribute to Myst’s 20th anniversary we’ve also added the original Myst images when you play in this Classic mode. Hold down the shift key and the original Myst image pops up, so you can see the difference and fondly remember that early Myst experience.\nWe’ve added plenty of new features to enhance and assist you on your journey. So whether you’re visiting Myst for the first time or you want to remember the first time - there’s never been a better reason to lose yourself and let the surrealistic Ages of realMyst become your world.\nFeatures...\nAll the original Myst Ages plus bonus Rime Age\nFull Myst gameplay and interaction\nDynamic environments - rippling water, falling rain, waving trees & grass\nAdvanced graphic effects like bloom, blur, depth of field, etc.\nDay and night - watch sunsets and sunrises, or explore at night\nFlashlight - for exploring dark nights or dark corners\nHaunting Myst music score and dynamic 3D sounds\nClassic Point & Click navigation option - just like original Myst\nFree roam interface option - standard navigation controls\nZip Mode in Classic navigation - hold down to keep walking\nAuto quality option - checks your frame rate and auto-adjust your quality\nInteractive Guides - illustrates how to interact with objects\nBring up original Myst images to compare and reminisce\nBookmark feature to save & restore progress\nAuto-save to insure you pick up where you left off\nrealMyst Hint Guide - get past that one puzzle that's got you stumped","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":11876,"name":"Redactem","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/768/7680c937fcb7236b7a3f32d63689ff27.jpg","description":"Rewind time and manipulate gravity in order to solve parkour puzzles in this extremely difficult, yet exciting new 2D platformer. With new levels being added for free all the time, the fun never ends. Each level in Redactem incorporates one of the game's many features to create a challenging puzzle that keeps you entertained. The game is addictive, frustrating, and interesting, you will always find yourself coming back to challenge one more level.Redactem has been the number one rated video game on IndieGameStand, a marketplace similar to Steam but primarily for indie games since July 2016.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ocular Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":11654,"name":"Zup! 3","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2b0/2b07b58387934ce041bd45439a51cd89.jpg","description":"Minimal physical puzzle with explosions\n▪ 70+ Levels\n▪ 1700+ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nExtended panels of Steam's backgrounds were invented by Aevoa\nMusic: Aηacom","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Quiet River","platforms":[{"id":0,"name":"PC"}]},{"id":10810,"name":"The Book of Unwritten Tales: The Critter Chronicles","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/994/994624026c40ce39e148cc2239a26c61.jpg","description":"The Critter Chronicles tell the story of how adventurer Nate Bonnett and Critter, his hairy sidekick, first met, all set before their appearance in Wilbur’s and Ivo’s adventure in The Book of Unwritten Tales. Enjoy a thrilling and hilarious point-and-click adventure in the fantasy world of Aventasia. Travel from the Northlands to the Mage’s Tower of Seastone and experience a story that offers tremendous fun for seasoned players of “The Book of Unwritten Tales” and newcomers alike. Key Features Play as both Nate and Critter: You and you alone decide with whom you want to spend more time.\nMeet new characters such as animal rights activist Petra, a schizophrenic Yeti, and the “Critters”.\nChoose between two levels of difficulty: “Normal” (approximately the same difficulty as BOUT) and “Hard” (for true veteran adventurers).\nEnjoy high-resolution backgrounds, improved animations and sounds!\nReal-time lightning of 3d-models and objects (including volumetric lighing)\nSoft raytraced shadows of real-time objects on the backgrounds\nSupport of all screen resolutions up to 1920x1200 and wide-screen support\nImproved animations with facial animation and lip movement\nWatch a beautiful and emotional tale unfold in about 10-12 hours of playing time.\nStand alone add-on to the highly acclaimed \"The Book of Unwritten Tales\"","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"KING Art","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":7010,"name":"War Robots","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5e5/5e5e36fd69276609705ad56ca694c03a.jpg","description":"War is raging, pilot! Are you ready for surprise attacks, intricate tactical maneuvers and the many sneaky tricks your rivals have in store for you? Destroy enemy robots, capture all the beacons, and upgrade your weapons to increase your battle robot’s combat strength, speed and durability. Prove yourself in each map and use different strategies and tactics to emerge victorious in battle.\nThe renowned iOS and Android hit is coming to Steam! Fight other Pilots from all over the world and join millions of existing players!FEATURES:Tactical 6v6 PVP\n34 battle robots with different strengths\nover 30 weapon types, including ballistic missiles, energy and plasma guns. What will you choose?\n9 Maps to battle on!\nnumerous possible combinations of robots and weapons. Create a war machine to fit your own playing style;\ncreate your own clan and lead it to glorious victories;\njoin epic PvP battles against rivals from all over the world;\ncomplete military tasks for bonuses and earn the title Best Pilot.\nOnward, soldier! Victory is yours!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Pixonic","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":695867,"name":"Grow: Song of the Evertree","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/efb/efbfc29b608ba15ef379e96d5e6e5034.jpg","description":"JOIN US ON DISCORD!\nWishlist CampaignSee the world change before your eyes. Help us plant 10,000 trees!\nWishlist the game and help the community unlock additional benefits as we achieve the different tiers before game release.\nWhen planning this wishlist campaign we considered the many things we could offer our community: game features, discounts, physical items, etc. but we thought that Grow: Song of the Evertree speaks of the delicate relationship we have with nature and how our personal actions can have a positive impact on others by taking care of the environment. So, for Grow: Song of the Evertree we decided that we would love to plant trees for everybody’s benefit.\nSo, on top of some cool game features we are investigating and possible release discounts we will be planting trees depending on the final number of live wishlists the game has on Steam the day before release.10,000 Wishlist•\tWhen reached, a Photo Mode will be implemented in all platforms to capture the wonderful and vibrant worlds you shape in all their splendor and cuteness. And there are many unique creatures to discover so we will make Selfie modes available in the game to make sure you capture those beautiful moments.25,000 Wishlists•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 505 trees50,000 Wishlists.•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 1000 trees\n•\t 10% Steam launch discount100,000 Wishlists.•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 2000 trees\n•\t 10% Steam launch discount150,000 Wishlists.•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 3,500 trees\n•\t 10% Steam launch discount250,00 Wishlists.•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 7,500 trees\n•\t 15% Steam launch discount500,000 Wishlists.•\tPhoto Mode + Selfie Modes\n•\tWe will donate to plant 10,000 trees\n•\t20% Steam launch discount\nAbout the GameOver time, the Worlds of Alaria faded. The Evertree – where many worlds resided on its countless branches – is now nothing more than a sapling, its splendor long erased from memory. No one knows how to make it grow. But you are different. You hear the sun as it sings across the sky. You hear the language of rain against the earth. You are the last of the Everheart Alchemists and it is your ancestral task and privilege to care for the Evertree.\nDiscover a Vibrant Unique World… at Your Own Pace\nFind unique places, blooming with fantastic fauna and flora as you are encouraged to explore this beautiful world at your own pace. How do you want to spend your time? Exploring caves and solving puzzles, collecting minerals and flowers, fishing or catching bugs … it’s up to you!\nGrow Your Own Worlds!\nLearn to craft World Seeds through Alchemy to generate totally new worlds with unique characteristics. Tend those worlds to rejuvenate them and see how they change, and watch as new properties emerge before your very eyes! You can generate unique meadows, deserts, frozen worlds and… oh, well… Alchemy is not an exact science, some seeds may contain unexpected surprises.\nMeet New People and Create A Community!\nGet to know interesting and unique characters, listen to their stories, and help them when they need it. You can make them happier by finding a place for them to stay, helping them land their dream job, or gifting them accessories and decorations.\nBuild the Town of Your Dreams\nGrow offers an impressive catalogue of the cutest buildings and structures to create the town you want. Place them freely and customize them to make sure it feels like home!\nA Beautiful Soundtrack\nA Beautiful Soundtrack by games and anime composer, Kevin Penkin.\nMystery!\nRuins, caves, secret areas… explore and unveil the long-lost knowledge of the Evertree by accessing its very heart.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Prideful Sloth","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":485041,"name":"House of Detention","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3ed/3edb65acd71dc2729763141f7ed0ab24.jpg","description":"House of Detention is unique horror with a deep plot, a lot of characters, great sound effects and a creepy atmosphere of Dungeon Recommended to play the Right Version ♂ - Patch (if you're an adult)\nYou woke up in the Middle of Nowhere, the only thing you have is a flashlight. Collect Water Mugs and Meme Scrolls to win Unique Features\nVarious of Monsters - You cannot escape the Lash of the Spain King\nReal Dungeon - Created by the precepts of the Dungeon Master\nLocker Room - Show 'em who is the Lord of this Locker Room\nGym - Do you think you can beat me 123?\nCollect 18 Mugs with Water\nPick Up 5 Meme Scrolls\nAtmospheric Music\nYou will have to put a lot of mental and physical effort to beat up this game!","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Aniki","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":284762,"name":"Pandemic Express","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7bf/7bf63344f7c1824232be2c3618cb1fbe.jpg","description":"Welcome to Pandemic Express! We've played a lot of Zombie Escape-style mods, and wanted to make something standalone, and on a large scale. Up to 50 players spawn in a large world. One of them gets randomly infected, and has to spread the infection turning everyone into zombies. The human players desperately try to escape on a train through an onslaught of what seems like endless zombie hordes.\nFirst standalone ‘Zombie Mod’ on a massive scale\nUnique co-op experience with ad-hoc teams, vehicles, a large open world, and a train\nDistinctive art style & game atmosphere\nWe brought the unique ZOMBIE MOD experience into a standalone game\nImagine CS zombie mod infused with the DNA of a large-scale open world shooter, set in a post-soviet ghost town. And trains. We like trains.\nPlaying as a Human\nLoot: Find gear in abandoned houses\nCooperate: Work with teammates to survive\nFight: Kill zombies with anything you havePlaying as a Zombie\nResurrect: Respawn instantly and close to fellow zombies\nHunt: Find the humans hiding around the map\nAnnihilate: Infect everyone!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"tinyBuild","platforms":[{"id":0,"name":"PC"}]},{"id":50737,"name":"Bayonetta 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c30/c30ac50cb13096f5402250bf666a321c.jpg","description":"Bayonetta struts through multiple locations in an all-new, over-the-top climax action game. Sporting a wicked new ensemble and somehow familiar pigtails, the titular Umbra Witch must face a mysterious evil using her signature guns and time-slowing Witch Time ability. This time, invading manmade bioweapons called Homunculi find themselves in Bayonetta’s crosshairs.\n\nTap into Bayonetta’s naughtier side with Demon Masquerade, a new ability that channels the demon linked to her weapon allowing for some exciting action options, not to mention some hair-raising combos. She can also summon her demonic darlings like Gomorrah, Malphas, and Phantasmaraneae during battle, unleashing their demonic powers in the heat of combat and in new, larger-than-life battles where you directly control the action.\n\nFight your way through the streets of Tokyo, the mountains of China, and many other locales! Along the way you’ll meet a virtual coven of Bayonettas, each more fabulous than the last. You’ll also slash and slay as Viola, a feisty witch in training who fights with a sword and a capricious companion, the demon Cheshire. Find out what fate awaits Bayonetta, and if this arcane alliance can really save reality!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Platinum Games","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":32672,"name":"Star Wars: Shadows of the Empire","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/653/653e53801d2e5222f5b727bffdf97840.jpg","description":"A long time ago in a galaxy far, far away... As Luke Skywalker and the Rebel Alliance struggle to defeat Darth Vader and the Empire, a new threat arises. Dark Prince Xizor, head of the Black Sun crime syndicate, aspires to take Darth Vader's place at the Emperor's side. To do that, he must eliminate young Skywalker. As Dash Rendar, it's up to you to protect Luke and help the Alliance defeat the evil Xizor. Watch out for infamous bounty hunters and deadly stormtroopers! May the Force be with you!","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"LucasArts Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo 64"}]},{"id":22896,"name":"Neverwinter Nights 2 Complete","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0c/d0c63ff640f8db4a692c8f2e119f79b2.jpg","description":"Welcome back to Neverwinter!\nBards sing tales of heroes in ages past, but they rarely mention those that are yet to become heroes. One such hero is a farmer in the small village of West Harbor. Raised by the elven ranger, Daeghun, as his own child, our hero will embark on a grandiose quest against the King of Shadows. Neverwinter Nights 2 is the tale of his deeds. His adventures continue in Neverwinter Nights 2: Mask of the Betrayer. Our protagonist discovers that an ominous spell has fallen on him. A curse of perpetual hunger--one which can only be quelled by consuming the souls of spirits. In order to remove the curse, he has to travel to the Shadow Realm, which harbors dark secrets and tormented souls.\n\nNeverwinter Nights 2: Storm of Zehir gives as a breather from grand quests of destiny and epic ordeals. You simply assemble a group of four adventurers (either by carefully picking out each of their statistics and skills or by randomly re-rolling your characters until you find the ones that suit you) and go where the wind takes you. Just make sure to get a good look at the map as you will need it to explore the wide open region of Samarach and the Sword Coast. Then, yet another adventure: in an ancient and forgotten tomb you found an unusual mask. It made you quite powerful but changed your life into a living nightmare. Strange, terrifying visions torment your psyche. Every time you try to get rid of the accursed mask, it secretly makes its way back to you. There's just one solution: set sail for Westgate and discover the secret of the Night Masks in Neverwinter Nights 2: Mysteries of Westgate.\n\nNeverwinter Nights 2: Complete is an epic RPG set in the fantasy world of the Forgotten Realms, one of the most popular campaign settings of Dungeons & Dragons. Use all the wicked spells, feats, and prestige classes from the D&D 3.5 rules. Create your characters any way you wish, choosing from a wide variety of races and subraces, such as Tiefling and Aasimar. As if the pre-made campaigns weren't enough, you can take the reins and use the powerful Obsidian Neverwinter NIghts 2 Toolset to make your own adventures and share them with friends!\n\nIf you're looking for a truly epic experience, you can't go wrong with our Mod Spotlight for Neverwinter Nights 2 Complete!\nNeverwinter Nights 2: Complete includes the original game, and three expansions: Mask of the Betrayer, Storm of Zehir, and Mysteries of Westgate.\nCreate and host your own solo and multiplayer D&D adventures using the improved Neverwinter Nights 2 Toolset.\nRediscover many familiar locations and reunite with your companions from the Neverwinter Nights series.\nMore than 100 hours of immersive adventure across four campaigns, all rendered in breathtaking detail.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Obsidian Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":22485,"name":"Spheroid","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ae0/ae0f10e3cfd35ca79e3f11c227a593d0.jpg","description":"Hello, and welcome to Spheroid!​\nSpheroid is a game that you may have played before, but may not have seen before. Unlike most other games in the 'Marble Madness'-like genre, Spheroid aims to be story-driven and more visually varied. You wont see levels that are made from plain colored geometry with stuff occasionally in the far distance, but rather, you can expect to see worlds with varying themes which play a major part in the levels themselves.​\neach level has an \"Activator Field\" game-play mechanic associated with it's theme, making for a unique- but never overly difficult- challenge.​\nThere are also no time limits or lives in spheroid, which shifts the focus from getting though the environment as fast as possible to strategically planning how to get through.\n--------------\n\"What is a spheroid? Usually, a Spheroid is the term used to describe sphere-like, but not entirely spherical, objects. Here on the island, we use a somewhat different definition.  Within our premises, a Spheroid is an advanced artificial intelligence contained within a spherical shell capable of traversing any situation a spherical object could possibly be in- our goal on the island is to continually improve the A.I, in hopes that one day, we will create the first perfect intelligence in the world.\"\n-[usr_Owner2]","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"From Soy Sauce","platforms":[{"id":0,"name":"PC"}]},{"id":12272,"name":"Tap Tap Infinity","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/29a/29aa93c68de8abad32d8974cb490d7c7.jpg","description":"Monsters are attacking! Click to defeat them, save the village! Love Clicker/Incremental games? Inspired by Clicker Heroes, Tap Tap Infinity takes things to the next level with tactical Hero and Spell upgrades, an XP/Rank system, an unfolding story, fancy-pants 3d monsters and environments, endless gameplay, cross-platform cloud syncing and awesome graphics. Super-simple to play ... but with more strategic depth if you want it!\nLevel up your Heroes so that they farm gold and search for the fabled Infinity Tokens, even while you're not playing! Earn XP by defeating monsters and clearing levels to unlock mighty Spells and gain a DPS bonus per Rank! Get to a high enough Rank and Ascend over and over to gain double the DPS bonus per Rank each Ascension.\nFind the Tokens of Infinity and trade them to the Guardians to unlock Powers. With 16 different Powers to choose from you can customize the game to play how *you* want it. 'Go Infinite' to restart at level 1 but with your Infinity Tokens multiplying your DPS so you can reach further and further into the game as you try to ultimately defeat 'The Master' !\nTap Tap Infinity is free to play and incredibly easy to get into:\n★ Click monsters to kill them and collect their gold.\n★ Hire the beaten Boss monsters to help you do extra damage as you level them up.\n★ Your Heroes earn gold for you while you're not playing, even if the game is closed.\n★ Find Valor Points and use them to Upgrade your Heroes, doubling how powerful their Skills are!\n★ Gain XP and unlock Spells to auto-click, do more damage or even skip instantly between Boss levels!\n★ Find Infinity Tokens to start all over again but with a permanent boost to your DPS.\n★ Trade Infinity Tokens to The Guardians of Infinity for Powers that customize the game play or use them to upgrade Spells to make them more powerful.\n★ Save your game to the cloud and keep playing on mobile!\nThe game is already live on iTunes (4.5/5 star rating) and Google Play (4.4/5 star rating). Looking to discuss the game or check in with the TTI community? Check out the subreddit: https://www.reddit.com/r/TapTapInfinity\nTap Tap Infinity was built by Scary Bee LLC, a one-man coffee-fueled indie game studio in Seattle.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Scary Bee","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10573,"name":"The Signal From Tölva","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/484/48439c0341cc6d0eaeac59a35cd1c3c5.jpg","description":"The Signal From Tölva is an open-world first-person shooter set on a distant, haunted, future world. Unlock savage weapons and recruit robots to fight alongside you as rival factions struggle to discover the source of the mysterious signal. What you discover will decide the fate of a world.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Big Robot","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":616693,"name":"Replaced","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/041/041e04184322bc859d617b790d8bfab9.jpg","description":"REPLACED is a cinematic retro-futuristic action-thriller set in a dystopian alternative version the of the 80s' USA. You are R.E.A.C.H. - an AI trapped in mortal human body against it's will. Explore the world, push your body's limits in intense combat and learn what it's like to be a living being.","review":"","timePlayed":0.0,"releaseYear":2025,"developer":"Sad Cat Studios","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":60718,"name":"Telefrag VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/453/4531e9cb0690368b8976758a42b0b9ab.jpg","description":"Welcome to the Telefrag arena - VR is a hellishly dynamic multiplayer arena shooter with visceral movement and combat mechanics. Dash, shoot, teleport and enter the stage to fight in unique arenas, featuring impossible geometry, where there is no right side up and death comes from any direction.\nSet in an alternative universe, where the Roman Empire never collapsed, you take on the role of a new breed of a gladiator on your road to becoming a champion. Use your speed, aim, and wits to outmaneuver and defeat your enemies, reducing them to a puddle beneath your feet.\nCore Features\nLoadout Management – Players have a chance to utilize different loadouts, comprised of weapons, throwable buffs/ de-buffs, shields and teleport methods. At any given time, the player has 3 active slots for combinations of those elements. Upon spawning, the player is prompted to choose a loadout they feel will help them dispose of the enemy the best way. The game allows for switching the player's primary hand.Teleport Attacks and telefrags – Teleport is contact weapons inflicting \"Melee Damage\" at the same time allowing the player to move through play space, thus adding an extra layer to the standard teleport mechanic used in VR.Guns – Guns are ranged weapons inflicting \"Range Damage\" upon the target. Features classic weapons types, such as Pistols, SMGs, Rifles or Grenade Launchers, as well as futuristic additions, like Plasma Cannons or the like.Shields – used mainly to block enemy Ranged Attacks, thus forcing the player to change their angle of attack or to try a different approach. Their downside is their vulnerability to teleport attacks.Dash – allows for short and fast jumps from place to place on a given surface. This is the primary mode of locomotion in Telefrag VR.Impossible spaces – Walkable surfaces can be placed regardless of gravity, meaning the player can travel on any designated surface regardless of its rotation and position relative to the “true” ground. This allows many angles of attacks and passages through play space, which means a fresh take on competitive level design.Arena Game Mode – a 1v1 gameplay mode, where the player enters with three previously selected loadouts. Players are matched against each other, their loadouts put as a wager for the outcome of the match. The winner may take the losers equipment. Both Player receive currency at the end of the match based on their score. The losing party can buy back their lost loadout. Currency multiplier is applied for each won match, effectively introducing a “win streak” mechanic.\nMultiplayer\nTelefrag will feature a full arena game mode, where players stand head to head in 1v1 battles, their hard-earned loadouts as wagers. A best-of-five format determines the ultimate victor. Dare you enter the arena?\nArena\nPvP matches will require a good knowledge of the arena in addition to a creative use of dashes and teleports to gain the upper hand in combat. But you may use the ability for more than just defense and evasion, hence the title, Telefrag. Tired of shooting or in the middle of reloading? No problem, teleport through your enemies to see them reduced to a pulp.\nShooter\nBlock incoming shots with an energy shield and shoot your opponents with a range of firearms, from the staples of the genre to new and unique entries. But in order to outwit your enemies, you need to choose your loadouts carefully! Some may work better against your opponent, than others.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Anshar Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17908,"name":"Anno 1404","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/099/09958b7676fce13f46b59b56154e23cd.jpg","description":"A unique and award-winning combination of construction, economy, discovery, diplomacy, and combat.\nCreate your own nation with a unique blend of simulation and real-time strategy as you journey across the globe to explore, trade, and learn technologies to expand your empire and to make your own history.\nMeet the Orient! Build your own settlement and get to know the culture and technologies of the Orient.\nCreate huge metropolises! Build a unique seaside with the harbor system and shape the character of your new city with alleyways, city walls, and castles.\nPersonalize the way you play! Configure the interface to fit your own personal needs. Create your own adventures in the Dawn of Discovery world with powerful tools and share them with the community.\nA strategy game for beginners and pros! An intuitive interface for beginners with many options for advanced players. A thrilling campaign that carries beginners into the world of Dawn of Discovery. A motivating sandbox mode that can be modified by players to any degree. Special titles, talents, medals, and other rewards that are collected in the captain's log.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Blue Byte","platforms":[{"id":0,"name":"PC"}]},{"id":2090,"name":"Worms 2: Armageddon","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ea4/ea4ce80f8acd5cef34487ad54bb8c839.jpeg","description":"#1 Turn-Based Game in 135 countries - #1 Strategy Game in 100+ countries\n#1 Game overall 35+ countries - #Top 5 Game overall 80+ countries\nAsynchronous play - Worms™2: Armageddon’s most requested feature is here!\nPlay up to 16 simultaneous games with your friends or use Game Center’s auto-match facility to find new opponents.\nGrab your grenades and prepare for battle, as the worms are back, bigger and better than ever in Worms™2: Armageddon! The best-selling turn-based-strategy blast-a-thon is back on the App Store for iPhone and iPad with new weapons, brand new customization options and of course, more explosions! Get ready for the ultimate installment! With many games modes available, there is something for everyone. Battle against 3 other friends in high-octane multi-player action or take on the solo campaign in a bid to become the ultimate mercenary worm!\nTHE WORMS ARE BACK!\nAuthentic Worms™ gameplay with cartoon-style visuals, comical audio and a refined control system using the innovative touch screen user interface.\nNEW WORMS™ WEAPONRY!\nDefend and attack with new weapons and utilities, including the Sentry Gun, Electromagnet, Napalm Strike, Super Sheep, Petrol Bomb, Armageddon, Drill, Earthquake and Poison Strike.\nCLASSIC WORMS™ WEAPONRY:\nThe return of the Sheep, Holy Hand Grenade, Concrete Donkey, Parachute, Baseball Bat and enhanced Ninja Rope.\nSINGLE-PLAYER WORMS™ ACTION:\nCampaign Mode: 30 single-player missions across 5 new themes including Manhattan, Medieval, Sports, Construction and Cheese.\nBody Count Mode: The player takes on endless waves of increasingly tough enemies across 5 different themes or a random landscape.\nPractice Mode: A mode where the player can practice with every weapon against A.I. dummy worms.\nMULTI-PLAYER WORMS™ COMBAT:\nBattle against your friends with offline Bluetooth multi-player action for 1-4 players.\nTake on all-comers from around the globe with online Wi-Fi multi-player action for 1-2 players.\nMaster the new game styles – Fort Mode, Crazy Crates and Custom Game Style\nThe return of the favourite game styles - ‘Bazooka and Grenade’, Melee, Gun Show, Heads Up, Lightside, Darkside and Sudden Death.\nMaster the variety of difficulty settings – Beginner, Intermediate and Pro.\nNEW CUSTOMIZATION OPTIONS:\nNEW – in-depth ability to make custom game styles so players can create whichever game style they want to and play with online or offline.\nNEW - create the team you want with new personalization features – hats, forts, skins and victory dances.\nNEW - spend gold earned by completing the Campaign missions in the Worms™ shop on new hats, forts, and gravestones or unlock weapons for multi-player games.\nNEW - customize even further with one of the iPhone exclusive bonus hats.\nFurther personalization of worm and team names, speech-banks and gravestones.\nOTHER FEATURES:\nFor 3GS and iPhone 4 users – improved visuals with animated 3D backgrounds, water effects and other graphical enhancements.\n28 Achievements to unlock.\nLeaderboards.\nSave game status on quit – automatic save to the last turn if you exit - great for longer battles and for saving your single-player progress.\nWatch your finest victories again with action-replays.\niPad SPECIFIC FEATURES:\nCrisp high definition visuals, graphical enhancements and special effects.\nFlip the screen! Great for ‘coffee-table’ style play given the support of the screen orientation feature.\n**DON’T MISS THE OTHER TEAM17 TITLES NOW AVAILABLE!**\nWorms™ for iPhone and Worms™ HD for iPad.\nGet even more Team17 information, including the latest game updates and more…\nLIKE US: www.facebook.com/WormsTeam17\nFOLLOW US: www.twitter.com/Team17Ltd\nWATCH US: www.youtube.com/Team17SoftwareLtd\nVISIT US: www.team.17.com","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":46749,"name":"Dark Devotion","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1f/a1f18e428bbb4caf6623ca2a1a3782c2.jpg","description":"A strong RPG influence\nYou will have the chance to loot a lot of different weapons, armours and relics, which have their own qualities so that you have the chance to create your own build… for better and for worse…\nEach weapon has its own specificities and statistics which you will also be able to custom with mystical runes. Roughly speaking : you have the choice to adapt your arsenal depending the enemy you’re facing and/or your preferences. Choose wisely.\nPray for your safety\nKill enemies to collect some Faith. Indeed, Faith is necessary to many things such as : unlocking secret paths, special chests, and more… So use it sparingly.\nThe general amount of Faith you gather during a run is saved, and will be usable in the Filthblood Shelter (the HUB) to upgrade your unlucky character.\nItems for your salvation\nOf course you will be able to heal your wounds or illnesses by consuming the right item. If you have the chance to loot the right one! A lot of other consumables are scattered in the Temple, spend them carefully to survive.\nThe Temple can be a place of virtue for those who deserve it\nIf your prowesses are witnessed your God might want to give a hand, who knows? But it can also be a place of despair and sickness if you're not paying attention to what’s surrounding you so be vigilant and cautious, the Temple will not think twice about crushing you.\nYou can't go back, every door automatically closes behind you\nEach world has 3 or 4 different paths. Each path has its own environment and atmosphere. Some of them are inter-connected. As you can guess, every game will bring you through differents paths.\nSecrets are shrouding the Temple, you must uncover them. But... watch out getting lost is so easy... However that's how secrets are found, isn't it? Do not worry, the Temple has its way to show good intentions. Indeed, you can find some hidden altars in the shadow which can save your equipment and/or your location if you take time to pray at them.\nDiscover the complex story behind this Temple\nMeet the lost ones who populate it, either directly or thanks to letters left behind by lost travelers. Some will even arrive at the shelter.\nThe Temple keeps its secrets as fiercly as a dragon would keep his gold... Discovering a text or a secret room will not be an easy thing ; however their discovery is crucial for the good understanding of the background as well as your progression through the game since they often contain usefull and powerfull items.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Hibernian Workshop","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":27974,"name":"Super Mario 3D World","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cb7/cb78e5b2ada0e38cafb14cd00cfafbd7.jpg","description":"Work together with your friends or compete for the crown in the first\nmultiplayer 3D Mario game for the Wii U console. In the Super Mario™\n3D World game, players can choose to play as Mario, Luigi, Princess\nPeach, or Toad.\n\nFeatures:\n\nEach character has unique abilities and play styles. For example,\nPrincess Peach glides over gaps, while Luigi has his trademark\nextra-high jump.\n\nThe new cat transformation allows players to run on all fours, pounce\non enemies, attack in midair, or use their claws to scamper up walls\nand goal poles.\n\nExplore colorful 3D environments filled with obstacles and\ncontraptions like transparent pipes and vertical conveyor belts, which\nadd new puzzle elements.\n\nUse the Wii U GamePad Controller's touch screen to search for hidden\nblocks and freeze enemies in place.\n\nPrice effective March 11, 2016.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Nintendo","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Wii U"}]},{"id":26223,"name":"James Cameron's AVATAR: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f25/f2560e90d42949725b2edb771764e0f4.jpg","description":"James Cameron’s Avatar: The Game is the official video game based on the\r\nfilm James Cameron’s Avatar. The video game will take you deep into the\r\nheart of Pandora, an alien planet that is beyond imagination. Gamers\r\nwill encounter the Na’vi, Pandora’s indigenous people and discover other\r\nlife forms the likes of which have never been seen in the world of video\r\ngames. When conflict erupts between the RDA Corporation, a space-faring\r\nconsortium in search of valuable resources, and the Na’vi, gamers will\r\nfind themselves thrust into a fight for the heart of a planet and the\r\nfate of a civilization.\r\n\r\nCompatible with Wii MotionPlus and the Wii Balance Board","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Ubisoft","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PSP"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo DS"}]},{"id":20956,"name":"Passing Pineview Forest","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f94/f944302911c7560349fd95847fa6abf0.jpg","description":"Passing Pineview Forest is a free mini-prequel set in the universe of Pineview Drive. Behind the abandoned house on Pineview Drive lies ominous Pineview Forest. The dark, foreboding forest trail leading directly to the Pineview property must be explored – but your every move and reaction is being watched.  You must stay calm during your walk – or else IT will take you!  To survive you will need steady nerves; for any trace of fear comes at a price — your life.About Pineview Drive\nhttp://store.steampowered.com/app/288880/\nAn old abandoned mansion lies at the dead end of Pineview Drive. A troubled man is standing at its gates, looking over the property. 20 years ago he had visited this estate with his wife Linda. During their stay his beloved vanished without a trace – her mysterious disappearance unresolved.\nFor 20 years no clues, for 20 years no peace, for 20 years this house on Pineview Drive has not relinquished its tormenting grip on him. Now, he returns in hopes of coming to terms with his nightmarish past.\nThe ominous legends haunting this seaside lodge have become renown. The stories abound that no one has been able to endure more than 30 days within the mansion since Linda’s disappearance. Facing a force greater than you ever imagined, you must cross the threshold and confront the evil that envelops this cryptic cottage. To solve the mystery of Linda’s disappearance and lift the veil on this troubling history, there is no time to spare.Oculus RiftThis game additionally acts as a tech demo and supports the Oculus Rift (DK2). It should be noted that a DX11 system is mandatory. To start the Oculus version please select it via the integrated launcher.FeaturesFree mini-prequel to Pineview Drive\nOculus Rift (DK2) support\nSound design and atmosphere on a par with Pineview Drive","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"VIS - Visual Imagination Software","platforms":[{"id":0,"name":"PC"}]},{"id":17587,"name":"Men of War: Condemned Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/24a/24a577fc8b49be7a5a9901b3f5b131a0.jpg","description":"Men of War: Condemned Heroes tells the story of one of the infamous Soviet penal battalions during the WWII. These battalions are famous for being formed under Stalin’s \"No step back!\" order #227.  They consisted of court-martialed officers that were given a chance to redeem their crimes, or incompetence, in blood by serving as the lowest enlisted rank in a battalion that was assigned the most dangerous tasks. These battalions’ images are surrounded by many myths, and this game tells the truth about these regiments based on real evidence from their former members.\nTake command of one of these notorious companies and lead it to victory against all odds through most of the war on the Eastern front. Fight from desperate battles in 1942 in the area of Volyn in the Ukraine, to the massive operation “Bagration” in the Brest area, Magnush bridgehead and Warsaw area in Poland and finally to attacks on the German Altdam and Stettin near the end of the war.Key Features:Ultimate single player experience – 4 campaigns telling the story of the penal company from crucial 1942 to victorious 1945\nTruth about Soviet penal battalions from their former members\nNew ultra-detailed photorealistic human models, faces and uniforms\nBonus single player missions focusing on other non-penal army units\nMen of War: Condemned Heroes is affected by the GameSpy shutdown on the 31st of May. You can continue to play the game through LAN, DirectIP and GameRanger.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"1C-SoftClub","platforms":[{"id":0,"name":"PC"}]},{"id":17009,"name":"The Polynomial - Space of the music","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba3/ba3f1c72dc4e9d606d34049fda5357e9.jpg","description":"Polynomial 2 is on Early Access now!Polynomial 2 features different game modes, enemies, bosses and optional VR support.\nAbout the GameExperience the music in a new way. Feel it pulse around you.\nThe Polynomial is a 3D space shooter with unique, mathematical scenery that animates to the music. And this is not some boring mathematics. This is fractals. There are worlds to explore, ugly enemies to kill, pretty allies to protect, bonuses to collect, and scores to beat (if you are into this sort of thing). It also includes arena editor and a non-shooting mode in which you can simply explore and rock out to your music. The game comes with 50 minute soundtrack; you can also import your music and playlists or even use the microphone input. There is a great variety of options that you can adjust for your own ultimate visual experience.\nKey features:Dynamic universe animated to music of your choice or microphone input.\n50 minutes of original soundtrack.\nUnique 3D graphics and effects.\nHighly configurable visuals, music, and image post-processing.\nFull featured editable music playlist.\nSupport for anaglyph 3D glasses and the common 3DTV formats.\nJoystick support.\nBuilt in arena generator and editor.\n35 hand-picked arenas.\n4 music visualizers to choose from.\nInnovative scoring function.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Dmytry Lavrov","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":15666,"name":"Master of Orion 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/19c/19c3cd9d720826dbee189a97426d1f6a.jpg","description":"Forge an empire in a universe where population growth is stripping away planetary resources. Colonize unknown planets and trade with other races for their knowledge.\nThe need for galactic expansion is critical. You must conquer alien star systems to secure the resources that will guarantee your supremacy. The ultimate goal is to defeat the evil Antarans. They lurk in the coldest reaches of space, warmed by one all-consuming passion... Revenge!\nOne of the best 4X games ever created\nAbsolutely addictive gameplay with a powerful \"just one more turn\" factor\nTactical ship combat, galaxy-spanning strategy, 60 technology fields, advanced diplomacy and much more\nNote: This game is a part of Master of Orion, Collectors Edition package which includes 3 original Master of Orion titles available on Steam for the first time and new Master of Orion game published by WG Labs.\nThis game will available for stand-alone purchase at a later date in the future.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"SimTex","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":9887,"name":"Mighty Party","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/911/911aa4ddf13df22f2e96176d7e594fbc.jpg","description":"New DLC Availablehttp://store.steampowered.com/app/698560/Mighty_Party_Academy_of_Enchantress_Pack/\nSteam Exclusive Offerhttp://store.steampowered.com/app/645430/Mighty_Party_Wonder_Girls_Pack/\nBuzzhttp://store.steampowered.com/app/687890/Runaway_VR/\nAbout the GameAre you ready to lead your Mighty Party in an exciting journey to the LEGENDARY LEAGUE? Defeat other players -> Receive Legendary Chests -> Get and evolve new Heroes -> Gather your unique MIGHTY PARTY -> Be no. 1 !\nIt’s very simple and addictive – one tap to put the fighter onto the battlefield and only 3 MINUTES to win! It can reveal all your tactical skills – define opponent’s weaknesses and play heroes who can absolutely change situation on the battlefield and bring you top place in rankings!\nFind dozens of fighters in PvP and enjoyable Journey! Level up them to reveal their new skills and qualities! Combine them with other heroes to gather a legendary PARTY OF CHAMPIONS!\nTile-based & fast-paced innovative battle system. Easy to grasp and extremely tactical!\nInfinite squad combinations from dozens of Champions with their own strengths and weaknesses.\nLots of ways to power-up Heroes: level-up them, bind them with others, turn them into GOLD ones!\nCaptivating PVP (Rankings, Tournaments, Events, Survival, Raids etc.) with great rewards!\nVery tactical Campaign with epic story of Heavenly Roads and true hero’s Journey!\nAlso you can check our other projects. Epiq step-by-step RPG with elements of strategy Forge of Gods and exciting VR-shooter Cargo Cult: Shoot'n'Loot VR.\nPanoramik Inc. has been making games since 2005. We specialize in creating different types of games, ranging from casual ones up to mid core.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Panoramik","platforms":[{"id":0,"name":"PC"}]},{"id":6032,"name":"Enigmatis 2: The Mists of Ravenwood","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/48f/48f6f3537fdeabee744d75cfc7850238.jpg","description":"Enigmatis: The Mists of Ravenwood is a critically-acclaimed, beautifully crafted casual adventure game rich with horror, plot twists and shadowy intrigue. Follow the trail of a demonic preacher and unravel the secrets shrouded in the mists of Ravenwood Park! What happened to the abandoned camper covered by enormous claw marks? What lurks in the park’s shadows? Will you be able to solve the mystery?\nFeatures36 achievements to unlock\n30 collectibles (butterflies) to find\nBonus Adventure: “The Redeemed Memories” is a prequel to the main one. Witness the origins of Ravenwood Park, and rescue your friends from the evil dwelling within.\n55 stunning, hand drawn locations and graphics with many animated details\nExciting detective story rich with horror elements and plot twists\nAtmospheric soundtrack\nPicturesque setting of Ravenwood Park\nEvidence Board: draw conclusions based on evidence and clues","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":740,"name":"Clockwork Tales: Of Glass and Ink","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b55/b55c9df68a71888a37f826faa5fe6164.jpg","description":"Clockwork Tales: Of Glass and Ink is an adventure game in the steampunk genre. It is a detective drama featuring action elements such espionage, monster battles and even hang-gliding!\nA continuing string of strange earthquakes are causing the world’s cities to crumble to ruin. Dr. Ambrose Ink—one of the foremost minds of the technological revolution—hopes to expose the underlying cause of this supernatural phenomenon.\nHis research leads him to Hochwald, a town nestled high in the mountains near the mysterious Barber family castle. Yet, shortly after arriving at the estate, Dr. Ink disappears.\nIt’s up to Dr. Ink’s longtime friend and confidante, Agent Evangeline Glass to save Dr. Ink and reveal what is causing the earthquakes. With only a mechanical raven to guide her, she must storm the well-secured castle and face the General Engineer of Gottland.\nAgent Glass soon realizes that humans are not the only threat during these strange, revolutionary times…\nFeaturesSneak into Hochwald Castle as Dr. Ink, alongside his faithful companion Matthew\nRich, unique steampunk setting\nMechanical crow Matthew is player’s sidekick\n31 (38 in CE ) beautiful, hand-drawn locations\nThrilling detective story with action elements\nDiverse adventure gameplay: flying on glider, impersonating a soldier, defeating mechanical creatures\n30+ hidden steambugs to find\n9 achievements to unlock\nAdditional materials:  concept art, wallpapers and a stunning soundtrack\nBonus adventure (“Ink’s Story”) is a prequel to the main one","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Artifex Mundi","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":58561,"name":"Zoo Tycoon: Ultimate Animal Collection","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4a7/4a70c734fd9919a5ca0406f56abcc3d5.jpg","description":"The wildly popular Zoo Tycoon series gets set to crank up the excitement, challenge, and fun of building the ultimate zoo. Let your imagination run wild with Zoo Tycoon: Ultimate Animal Collection! Choose from almost 200 visually stunning animals and the largest, most detailed selection of environments ever, then build, manage, and maintain your dream zoo alone or with up to four players.  This zoo simulation will charm animal lovers of all ages.\n•\tGet up close and personal with nearly 200 visually stunning animals from around the globe\n•\tCreate the Zoo of your dreams with the biggest, most detailed environments ever utilizing intuitive yet powerful controls designed for Zoo Tycoon fans of all ages\n•\tIt’s your zoo – design and manage your ideal zoo from intuitive road construction to the ability to adjust the enclosures and decorate them. The choice is yours!\n•\tExtended Campaign Mode lets you become the ultimate zoo tycoon by completing 30 exciting scenarios all around the world!\n•\tSpecialized Challenge Mode features 20 specialized zoos. Collect all the species and transfer animals from one of your zoos to another! But beware of the crises that can strike at any time!\n•\tBuild and share your Zoo with up to four people","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Frontier Developments","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":13523,"name":"Hard Truck: Apocalypse - Rise of Clans","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c9b/c9b8ed29bd2587267409895858044031.jpg","description":"Darkestville Castle Coming Soon\nAbout the Game\nHard Truck Apocalypse: Rise of Clans - is an addon to a vehicular Action/RPG set in an alternate  future. New heroes and mysteries await you in the vistas of a post-apocalyptic North America. Special customization features, new types of weapons, and hi-tech bosses will immerse you even deeper into the ruthless world of Apocalypse, and your extreme driving skills will serve you well in its new multiplayer mode.\nINCLUDED IN EX MACHINA GOLD EDITION","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Targem Games","platforms":[{"id":0,"name":"PC"}]},{"id":1139,"name":"PlayStation VR Demo Disc","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/438/438d5fb1420840db7e3fcf9ee472c708.jpg","description":"VR games may cause some players to experience motion sickness.\nThis PlayStation®VR demo sampler includes demos of entertainment and gaming content spanning across a wide variety of diverse genres.\nHere’s what you get:\n•         Allumette (Penrose)\n•         Battlezone (Rebellion)\n•         DriveClub VR (SIE WWS)\n•         Eve: Valkyrie (CCP Games)\n•         Gnog (KO_OP)\n•         Harmonix Music VR (Harmonix Music Systems)\n•         Headmaster (Frame Interactive)\n•         Here They Lie (SIE WWS)\n•         Job Simulator (Owlchemy Labs)\n•         PlayStation VR Worlds (SIE WWS)\n•         Resident Evil 7 biohazard — Kitchen Teaser (Capcom CO., LTD.)\n•         Rez Infinite (Enhance Games)\n•         Rigs Mechanized Combat League (SIE WWS)\n•         Thumper (Drool)\n•         Tumble VR (SIE WWS)\n•         Until Dawn: Rush of Blood (SIE WWS)\n•         Wayward Sky (Uber Entertainment)\n•         Within (Within)\nVR Games may cause some players to experience motion sickness.\nPlayStation®VR Required\nPlayStation®Camera Required\nEnhanced play with 2 PS Move controllers\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n©2016 Sony Interactive Entertainment America LLC. 'PlayStation' is a registered trademark of Sony Interactive Entertainment Inc. All other copyrights and trademarks are property of their respective owners.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":529784,"name":"F.I.S.T.: Forged In Shadow Torch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d92/d92063ff4fc5b9f1f79cbc73594df289.jpg","description":"Six years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and steps to his journey fighting back. And he never expects that he has been involved in a bigger scheme between the mafia, the rebellion, and the legion.\nSophisticated and Interconnected Game Map with Countless Secrets\nExploring the Metroidvania game world with a dozen of areas with distinguishing vision themes and level designs. Earning the rewards by conquering the challenges of combats, puzzles and platformers in countless chambers, tunnels and shortcuts.\nInterconnected and automatically loading game map makes the detailed Torch City more convincing and beautiful.\n\n\nArcade-styled Combat System with Three Unique Weapons\nMastering the Fist, the Drill and the Whip, depending on the situation of the battlefield, switch your advantages between the long hits, the high damage and the wide range, taking every enemy standing in front of you down.\nDozens of enemies wielding their unique weapons challenge you with exquisite cooperation tactics, and various bosses with totally different combat patterns provides you never repeated experience.\n\n\nUnique Dieselpunk Aesthetic Powered by Unreal Engine 4\nThe combining of the dieselpunk aesthetics and the oriental-style architecture constructs the core visual style of Torch City, exposing the world with the intense conflict between the furry animals and the mechanical army from their appearance to the nature.\nPowered by Unreal Engine 4 with physically based rendering and extremely detailed textures, presenting a gorgeous 3D visual performance and pushing the genre to a whole new level.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"TiGAMES","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]}]