[{"id":15221,"name":"Eador. Masters of the Broken World","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cdd/cdd3098b7d4e31132be45a996f81ca70.jpg","description":"Eador is an infinite space in which fragments of hard rock fly. Each fragment is a world in which there are inhabitants.\nThere are also Masters in this Universe, able to collect fragments into larger worlds. In these worlds, the Masters behave like benefactors or tyrants - it depends on the nature of each Master.\nYou play for one of the Masters. And sooner or later you realize that you can only compete with all other Masters. This rivalry can not be won by the use of brute force. Simple, primitive strategy game does not reward.\nThe basis for the growth of our own world is astral energy - it is generated by every fragment. Energy may even affects the amount of gold received for the correct course in the game.\nIn addition to gold, there is another \"currency\" - \"blue crystals\". Gold is able to buy us \"ordinary\" things - soldiers, builders or loyalty. Blue crystals may be converted into magical actions. By magical actions, too, you can achieve goals quite common - to hit or steal.\nThe game units are not impersonal, as they play, they gain skills, gain strength. The choice of these skills is very large, and the choice of various finds and places where these findings can be found is very large too. The choice of events taking place in the worlds is also diverse.\nEverything that happens to us is affected not only by our own actions, but also by the actions of our subordinates - the system of karma is very complex.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Unicorn Games Studio","platforms":[{"id":0,"name":"PC"}]},{"id":2184,"name":"Moon Hunters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec6/ec659635f538be22bab35d9c402f774b.jpg","description":"Soundtrack EditionThe melancholy ballads of Issaria are available at a discount in the Soundtrack Edition of Moon Hunters.\nAbout the GameExplore a 1 to 4 player co-operative personality test set in a rich, ancient world that's different every time you play.\nYou have 5 days before King Mardokh and the Sun Cultists declare war on Issaria’s tribes. Multiple playthroughs of this short story will let you see it from different angles and uncover new sides to characters, conflicts, and narratives. Try out all 4 player hometowns and 6 player character classes, each with their own abilities and randomly generated upgrades as you build your mythology.\nEvery action and choice you make contributes to your legend, as a constellation in the night sky. How will you be remembered?","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Kitfox Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":13779,"name":"Civilization IV: Warlords","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4f2/4f24c59ac7ba91590d7394acac0bfae8.jpg","description":"Civilization IV: Warlords is the first official expansion pack for well-known video game Civilization IV. The game adds new features into original game such as a new category called Great Generals which can join a city as a Great Military Instructor, which gives +2 experience points to any military unit created in the city or creates a Military Academy, which boosts military unit production by 50%. Also, the game offers the ability to institute vassal states, which lets player to take up other empires as vassals. When an empire becomes a vassal, it loses the ability to declare war and make peace independently. \nWarlords offers new civilizations including Carthage, the Celts, Korea, the Ottoman Empire, the Vikings and the Zulu, and four new leaders for existing civilizations. \nThere are also eight new scenarios, six new civilizations which can be played in single-player as well as in multiplayer mode, ten new leaders, three new leader traits, unique buildings for each civilization, three new wonders, new units, resources and improvements, core gameplay tweaks and additions and inclusion of all patches released for original game.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Firaxis","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3179,"name":"LittleBigPlanet","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c32/c32fd6c512c48b3e2f10686a6e06690d.jpg","description":"LPB is a pseudo-3d puzzler-platformer exclusive for consoles from Sony Computer Entertainment. It was developed by British Media Molecule studio who before LPB developed only one semi-experimental game Ragdoll Kung-Fu. The game tells a story about the adventures of Sackboy, but there is no actual plot to follow in the game. The main focus is on the gameplay.\n\nThe game bets on user-generated-content and invites everyone to add something of their own to it. Each new level is a new story, and the ability to create your own levels with the built-in editor greatly increases the time spent playing. You can go through the game alone or with your friends: on one console or using online services.\n\nIn addition to the level editor, players can customize the Sackboy to their taste. In the creation of costumes for the main character of the game participated other developers: for example, Supermassive Games, Fireproof Games, Tarsier Studios.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":3044,"name":"Deadpool","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a2d/a2d80d32a35281c310a2b9d8cb02e5cf.jpg","description":"Deadpool wants to be the main protagonist of the game developed by High Moon Studios and in order to make them develop the game, he plants explosives in the studio. Deadpool even hires Nolan North to voice the protagonist. After Deadpool receives the scenario from the studio, he finds it boring and edits it with a pencil. The game continues according to the edited scenario after this point.\n\nIt is a combination of action, hack & slash and a third-person shooter, where new hit combos are unlocked further into the game. In order to get new combos, the players have to kill a certain amount of enemies. The main feature of the game is the breaking of the fourth wall by Deadpool. The protagonist often talks to the player directly, shares his opinion on the player's performance and reveals parts of the plot. The combat gameplay revolves around combining both melee and ranged attacks. The player can change Deadpool's equipment on-the-go. Deadpool has the same regenerative powers as Wolverine and will get blown up into pieces on some plot occasions.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Activision","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":16179,"name":"Out There Somewhere","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ddb/ddbcf3f1330e146094b0ce211e33090a.jpg","description":"Out There Somewhere is where Portal puzzles meet retro platforming. It begins with a scrolling shooter level at which you pilot a spaceship, but the main part of the game is completely different. The player controls the protagonist named Yuri, who crash-landed on an alien planet and is searching for the villainous Grigori who destroyed his ship. Yuri is armed with a portal gun, a device that will teleport the character to where its projectile hits a wall. Unlike in Portal, you can teleport to almost any surface as long as it’s a solid object, the transportation is instant, and there are no lasting “doors”. \nEach level in Out There Somewhere is a small puzzle maze with an exit on the other side, and the player’s goal is to figure out how to get here. Yuri can “shoot himself” across the lava pits toward the other shore, through narrow corridors, or away from the villains. Initially, it is all about reaction, but eventually, the game introduces more complex mechanics, such as laser beams that divert or alter Yuri’s shots, and a regular gun that allows you to fight enemies. Out There Somewhere is stylized as a nostalgic 8-bit NES game with pixel-art graphic and is accompanied by a chiptune soundtrack.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"MiniBoss","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":452645,"name":"Hitman 3","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/126/126fbd5ceacddc6ad16fc96e50b1265b.jpg","description":"Agent 47 returns as a ruthless professional for the most important contracts of his entire career in HITMAN 3, the dramatic conclusion to the World of Assassination trilogy.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"IO Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":674,"name":"Frozen Synapse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/672/672ebe061ec559f05af9bb4d28414f4e.jpeg","description":"Frozen Synapse is a turn-based strategy in which all participants make a move simultaneously. The player controls a small squad of soldiers who need to achieve the mission's goal - the destruction of all enemy forces.\n\nAll movement is planned in advance, one move is limited to 5 seconds. Before the final decision, you can simulate the results of your turn, but after pressing the button Prime, all actions are brought into effect and it is impossible to change the result. The calculations take into account the cover factor, reaction and aiming of each individual unit. A total of 5 kinds of units in the game, they differ in the speed of movement and weapons.\n\nThe game's events unfold in a gloomy cyberpunk future. The player commands rebels that are fighting against government troops. There is a cooperation mode for the campaign available with DLC bought and multiplayer, which is limited by 1vs1 duel-fights","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Mode 7","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58295,"name":"Murderous Pursuits","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/534/534d61ab5c9bfe29d94466377f6d0d6b.jpg","description":"Murderous Pursuits is a kill-or-be-killed stealth-em-up multiplayer game for 1-8 players. Smartly stalk your target – the Victorian’s call that Quarry -  and wait for just the right moment to pounce on your prey. But be careful not to give yourself away to the other players hunting you!\n\nAct like an unassuming passenger to avoid revealing yourself, locate high-scoring weapons, and stalk and kill your targets in a manner that befits your station as a 'right dodgy villain'.\n\nThe Best – And Smartest - Killer Wins\nGain the highest number of points by the end of the round to win. Optimize your points by finding higher value weapons and keeping your exposure low, all while scoring glorious kills. Be too careful and you’ll fall behind. Be too bold and other hunters will take advantage.\n\nEmploy a variety of abilities, including disguise, flash, and counter, to outmanoeuvre your adversaries and carry out your diabolical plan.\n\nTrack and Avoid\nUse the Quarry Tracker to locate your target. Keep an eye on the Hunter Indicator to avoid getting killed. But beware as your Quarry may be watching too.\n\nKeep your cool and use the busy passenger environments to your advantage by hiding in plain sight. Forget to blend in and you’ll raise your exposure, revealing yourself to your Quarry, and your Hunter.\n\nWatch Out For The Guards\nGuards are on board to keep the passengers safe.  Beware:  they are on the lookout for killers. Anyone caught in the act will be stalled and left open to attack from other hunters.\n\nTake your pick from a line-up of eight nefarious killers – each as deadly as the next. From the cold and calculating Duchess to the wise-guy Dodger, it is your choice of which version of evil you feel will serve you best.\n\nProve Yourself\nClimb the ranks to become number 1 in the world for most number of kills... or most number of pies eaten!\n\nKey Features:\nPlay solo or online with up to 8 players, featuring support for custom game options and wickedly intelligent bots. Identify your quarry, plan their extravagant murder and set it into motion, all before another player wises up and does the same to you!\nHunt in four sumptuous locations aboard the HMCS Britannic - a state-of-the-art, colonial time ship. Blend in with the festivities in the richly decorated Music Hall or wait in the dark corners of the Engine House to pounce on your prey\nChoose from eight playable characters. Pick your preferred archetype and skin, then blend in with the crowd to avoid detection\nMaster the use of five abilities – only two of which can be chosen each match, so choose wisely\nEarn favour to win - Simple killing won’t cut it. Be discreet, commandeer a high-value weapon, strike quickly and dance over your Quarry’s lifeless body to earn Mr. X’s ultimate favour\nProve yourself – skill-based matchmaking will ensure you face appropriate opponents, so no slacking!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Blazing Griffin","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":12641,"name":"Warhammer 40,000: Dawn of War – Winter Assault","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cc2/cc2e6c7aee44854f93063622fe08f197.jpg","description":"Warhammer 40,000: Dawn of War - Winter Assault is the first expansion for Warhammer 40,000: Dawn of War. It’s a real-time strategy about the war on the planet of Lorn V. The expansion added new maps and the Imperial Guard race to the game and simplified some game mechanics and units.\n\nYou can take control of one of five races: Orks, Eldar, Chaos, Space Marines, and the Imperial Guard. The plot is divided into the Order storyline and the Disorder storyline, represented by different races. No matter what path you choose, the game starts with the confrontation of these sides; you have to deal with the consequences of their battle and make decisions that will affect the story.\n\nThe game features such classic RTS aspects as building a base and technology development. However, the gameplay focuses on tactics. Every race in the game has its unique units you can use during missions. As a rule, it’s not the entire army that takes part in battles, but a limited amount of units. To be efficient you need to manage these units separately.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":87,"name":"Salt and Sanctuary","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dd1/dd1cc63c37361fa5c8122daec9bae8bf.jpg","description":"Salt and Sanctuary is a 2D action with role-playing elements developed by Ska Studios. \n\n###Plot and art style \nThe game follows an unnamed protagonist who escorts princess on a sail to her marriage in the distant country. The ship gets attacked by brigands that slay the whole crew and later gets destroyed by sea giant Kraekan resulting protagonist to find himself on a mysterious island. The hero must now find a way from the island and save lost princess. \nThe game is notable for its hand-drawn watercolor art style with the dark and cold palette. \n\n###Gameplay \nThe gameplay is heavily inspired by From Software’s Souls series and Castlevania franchise. The game mixes traditional Metroidvania-style exploration with several game mechanics borrowed from Dark Souls. At the beginning of the game, the player chooses one of eight classes. The class affects initial equipment of the character and his starting skills. It does not, however, affect character’s stats or restrict him from acquiring any skills from the Skill Tree later in the game. \nThe combat relies on different types of attacks, dodging, blocking and use of various abilities and items. There are more than 600 weapons, pieces of armor, disposable items and other equipment that can be found throughout the game. \nThe game features local multiplayer, both cooperative and competitive.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ska Studios","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":6885,"name":"Sid Meier's Pirates!","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7ca/7ca90d463ea0c0252e7d01afe897ffa8.jpg","description":"Sid Meier’s Pirates is an action-adventure strategy game, a remake of 1987 game of the same name. It’s set in an open world around the Caribbean islands. The game features numerous activities, including sailing and exploration, ship battles, trading and diplomacy.\n\nThe core gameplay of the game is sailing among the islands, cities and colonies. Every tip on the map provides great opportunities for both economic issues and fights, as you can attack ships and capture cities; some battles include sword fighting mini-game. Completing different quests, you will gain diplomacy points of one of the in-game factions. This will reveal additional options, such as dancing with a governor's daughter at a ball. The game also features AI historical pirates, such as Henry Morgan and Blackbeard.\n\nWhile the story aspect is not in focus of this game, there’s a little background of the hero you play as. After customizing your character, you start as a sailor under the command of a very harsh captain. One day the riot begins, and you become the new captain. Since then you can explore the world and do everything you want together with your crew.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PSP"},{"id":0,"name":"Wii"}]},{"id":19482,"name":"FlatOut","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b39/b39e0b98ac821bbc630948054b4e5041.jpg","description":"Flatout is the racing game with a heavy focus on destruction and associated with the drivers tearing out the front windshield. It is the first part of the tetralogy, followed by the three sequels and one remaster. \n\n###Gameplay\nThe game consists of two modes: survival and racing. The goal of the racing part is pretty much the same as in any game of its genre: to reach the finish through the variety of lap tracks. The one to finish the route first wins. There are always eight players on the map with the protagonist and seven other racers — the game does not divide players into teams, every racer plays for himself.  While the survival mode brings a new experience to the genre cause the winning player is determined not only by the amount of the damage it dealt to the others but also by surviving as long as possible. \n\n###Key features\nThe FlatOut is usually noticed for the realistic physics and the destruction mechanics, allowing the player to ruin their cars in many ways with the different types of collisions being caused by the different kinds of accidents accordingly. Apart from vehicle impacts the racing game also features realistic driver-tossing-out mechanics based on Ragdoll physics technology, which was previously used in animated cartoons and FlatOut is the first known title to utilize the engine in the video games.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Bugbear Entertainment","platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15712,"name":"Goodbye Deponia","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/187/187cf9fcec83be0ed55aaf96123fa948.jpg","description":"Goodbye Deponia is a point-and-click adventure, a third installment in the series.  The game’s world consists of two primary locations, planet Deponia, literally composed of rubbish, and Elysium, a flying city, pure and beautiful, as the game’s central character claims.\nThe protagonist, Rufus, is an egoistic, indifferent to others and unaware of it, anti-hero set out on his quest of getting away from the dump that is Deponia. The player has to solve different puzzles, interact with other characters and do everything possible to help Rufus achieve his long-shot goal. The game doesn’t forget about the protagonist’s companions as well; different storylines will allow players to understand the world of Deponia better.\nThe game features a unique art style, with hand-drawn 2D sprites, highly reminiscent of comic books. Despite the game’s natural looks, most of the humor is connected to previous parts, and it is implied that the games should be played from the very beginning.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Daedalic Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":17604,"name":"Return to Castle Wolfenstein","genre":"Shooter","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/b47/b47c20aa6cfd4c825d37e2bc68462e9c.jpg","description":"Return to Castle Wolfenstein is an FPS developed within Wolfenstein franchise in 2001. It rebooted the series and was the fifth part of the intellectual property. The game functions on the Quake III: Arena engine.\n\n###Plot\nThe whole series and the Return, in particular, depict the events of the World War II. The game tells a story of the year 1943 and follows the story arc of the agent Blazkowicz and Agent One who infiltrated the Nazi base and found themselves captured and sent to the Castle Wolfenstein. The narrative centers around their escape past the overpowered enemies called \"übersoldaten\" and figuring out the solution to the multiple mazes.\n\n###Gameplay\nThe game is one of the progenitors of the corridor shooters — the notion has not been spoiled yet, and the strictly linear games were the classics of the genre. Although the title exploits the basic mechanics of shooting enemies and moving around the territory, the player is suggested with some firearms and tools. \nThere is a multiplayer which is based on a number of the quests and two teams set to accomplish them. The team who achieves the primary goal first wins. There are three modes: an objective, stopwatch, and checkpoint. Objective aims at the fulfilling the goal, and stopwatch controls the progress achieved within the period, and checkpoint fixes the progress at its milestones.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"id Software","platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":13868,"name":"Stronghold HD","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/88c/88c66f471e0b28d3f6711f162ef0848e_IOHyhbU.jpg","description":"Stronghold is a real-time strategy game, the first installment in Firefly Studio’s Stronghold series. \n\nGameplay### \nThe game takes place in Medieval Brittan of XI century. In most game modes, you take лrole of a Lord and have to develop your castle increasing its population, creating a stable economy and strong military while maintaining your popularity among the people. The game attends both the war and economics aspect. There are many types of resources in the game that can be divided into two groups: food and materials. The townspeople constantly consume food, so the player has to develop a stable production of meat, bread, apples, and cheese. Each of these types of food requires different structures and has different stages of production. \nUnlike most other RTS, each military unit requires a different set of recourse to be created. E.g., crossbowman needs a crossbow and leather armor; swordsman needs a sword and metal armor. \nThe game has two campaigns: military and economic. In the latter, you don’t have to with other Lords, but only wild animals. Besides that, there is a free mode where you can develop your castle without any objectives or time restrictions and siege mode, separate scenarios that do not involve castle building but instead lets player attack or defend several historical castles.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"FireFly Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":1559,"name":"Sonic CD","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d5e/d5e177d510242bafa6e9e23ecc8158d3.jpg","description":"###The legacy\nThe original game was released for the Sega Genesis console with additional hardware that allowed the console from the late 80's to launch games on CD. From the point of view of gameplay, the game is not much different from other ones of the series of that time: it is a side-scrolling 2D platformer where the main goal of the player is to go as fast as possible. The game is often called the best in the series. In the development, it ought to be an improved version of the game Sonic The Hedgehog 2, but because of the low sales of the last, it was decided not to advertise connection between the two. Later the game was released on Sony PlayStation 2, Nintendo GameCube as part of the Sonic Gems Collection. The remastered version that uses a new engine was released for various platforms and mobile devices in 2011.\n\n###The plot\nThe plot of the game tells how Sonic goes to Never Lake, where the extraterrestrial body Little Planet appears at the end of the last month of each year. However, this time the main villain of the Sonic universe Dr. Robotnik tied the planet to the top of the mountain and began to transform its surface with the help of its robots into a huge factory. Sonic goes to the rescue to encounter not only Dr. Robotnik but also other characters in the series, such as Metal Sonic.\n\n###Key features\nThe gameplay of the game has not changed: Sonic must complete levels and defeat bosses at the end of each world. After collecting 50 rings, a special level becomes available, on which the player must destroy six UFOs. The version of the game for Steam includes the ability to play in 16: 9, leaderboards and a bunch achievements.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Christian Whitehead","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"SEGA CD"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":17536,"name":"Sniper: Ghost Warrior","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/61d/61d15dad7a5c58f58e6f182759fdeb5b.jpg","description":"Sniper: Ghost Warrior is the second game in Sniper series of tactical shooters with sniping simulation. It is the first game subtitled Ghost Warrior and a spiritual sequel to Sniper: Art of Victory.\n\n###Plot\nThe game is set in Latin America, in the deep jungle of a fictional island state Isla Trueno. An enemy power has recently overthrown the local pro-American government. The player assumes control over the US special forces agents and Truenian rebels who fight against the new regime. In Sniper: Ghost Warrior, the player assumes the roles of several main characters, among them a US soldier Tyler Wells who performs sniping and stealth operations, and a local rebel El Tejon who is most useful in open combat.\n\n###Gameplay\nThere are several types of missions in the game. Some of them emphasize stealth action and marksmanship, while others involve direct firefight. Besides a variety of sniper rifles, the characters can use other silent weapons, such as knives and silenced handguns.\n\nThe game has a quasi-realistic model of bullet ballistics. The player has to take into account the distance to the target and the bullet's flight time. The wind and the shooter's physical condition also influence the accuracy. In lower difficulty levels, the player can use the system that indicates the designated target and the place of the actual hit.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"City Interactive","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"}]},{"id":263608,"name":"Void Bastards","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/943/9436adc4b833d1026c3805fc4ce602b8.jpg","description":"Forget everything you know about first-person shooters: Void Bastards asks you to take charge, not just point your gun and fire. Your task is to lead the rag-tag Void Bastards out of the Sargasso Nebula. You make the decisions: where to go, what to do and who to fight. And then you must carry out that strategy in the face of strange and terrible enemies.\nOn board derelict spaceships you’ll plan your mission, taking note of the ship layout, what hazards and enemies you might encounter and what terminals and other ship systems you can use to your advantage..\nMove carefully through the dangerous ships, searching for supplies and manipulating control systems. React to what you find - will you detour to the generator to bring the power back online or will you fight your way into the security module to disable the ship’s defenses? Choose carefully when to fight, when to run and when just to be a bastard.\nUse your hard won supplies to improvise tools and weapons, from the distracting robo-kitty to the horribly unstable clusterflak.\nNavigate your tiny escape pod through the vast nebula. Flee from void whales and pirates, and politely avoid the hungry hermits. All the while you must keep scavenging for the food, fuel, and other resources that keep you alive.\nVoid Bastards features a 12-15 hour campaign that you can complete with an endless supply of prisoners, each with their own unique traits. When one dies, another steps forward to carry on the fight. Don’t worry though, as any crafting progress you’ve made is retained from one to another.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Blue Manchu","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":23600,"name":"Diablo III","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a27/a275556fab1a6acaded4cedad0f9dc80.jpg","description":"The third Diablo returns you to the world of Sanctuary, once again invaded by the demons. Twenty years after the ending of Diablo II, a star has fallen on the city of New Tristram, spawning hordes of undead monsters that the player must defeat. As usual in Diablo series, the game has a trademark dark fantasy atmosphere and is mostly set in gloomy dungeons.\r\nThe basic gameplay features are the same as in previous Diablo games, but there are many subtle changes. The player can choose one of six character classes (a seventh is available with an expansion). Each class has its unique abilities and class-specific quests. Unlike its predecessors, which used isometric 2D graphics, Diablo III uses 3D, however, it preserves the familiar top-down view. The dungeons are randomly generated and have destructible environments, thanks to the new graphics engine. There’s a new mechanic Skill Runes that is used to improve the character’s skills.\r\nOnline multiplayer is available through Battle.net. There are both a co-op mode and a PvP mode called Brawling. The players can create hardcore characters who face permadeath if killed. Even in the single-player mode, Diablo II requires a stable internet connection, because of DRM restrictions.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Desconocido","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":24,"name":"Gran Turismo Sport","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/e98/e989eb7026737bbb7bd386c1d16a5735.jpg","description":"Gran Turismo Sport is a racing game developed by Polyphony Digital. It is the 13th game in the franchise.\n\n###Gameplay\nLike the previous games of the series, no story mode is present in Gran Turismo Sport. Three modes are available to the players: Sports, Arcade, and Campaign.\n\nSports mode allows the players to compete with each other online. Polyphony Digital puts a heavy emphasis on the addition of the official FIA Championships set of rules. The players are offered a wide range of events, competitions, and tournaments to participate in. The Sports mode is region locked in order to provide the best experience with as less network lag possible.\n\nIn Arcade mode, the players participate in events they choose on whichever vehicle available in the game against AI opponents. Usual races, Time trials, Drift trials, and two-player split-screen game modes are available to the players.\n\nThe game's Campaign mode is a classic GT experience. The players have to obtain licenses, buy used cars at first and participate in small championships on their way to the best racing leagues of the world.\n\nGran Turismo Sport features 177 vehicles for the players to use. The game has vehicles from all their history, starting with the first car ever produced, Ford Model T.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Polyphony Digital","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":14689,"name":"Tiny and Big: Grandpa's Leftovers","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2a0/2a06e20ebd555f843fe8669a2d4fd11a.jpg","description":"Tiny and Big: Grandpa's Leftovers is a puzzle platform video game, which originally was released as a tech demo titled Tiny & Big: Up That Mountain in 2010. In the game players have to manipulate levels with a handful of tools to solve puzzles which are three dimensional. The main protagonist of the game is an inventor named Tiny, who has to get back his possession, which is a magical pair of briefs. These briefs were left to him by his disappeared grandfather from his rival Big who intends to rule the world. \nIn the game, the player has the ability to use an invention of Tiny called The Tool which has three functions: a strong laser, a grappling rope for pulling objects and a rocket for pushing objects forward. This Tool is the main item in the game as it helps not only to solve various puzzles but also defends Tiny from attacks of Big. There is also an artificial intelligence named Radio who acts as a mentor, providing prompts and hints for the player in order to progress.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Black Pants Studio","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":16118,"name":"Supreme Commander 2","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5db/5db33e1b461c60cdbfe48a5f4837101d.jpg","description":"Supreme Commander 2 is a real-time strategy, a sequel to Supreme Commander. The story is set in the near future in the world of giant mechs and the rise of technology. The plot tells about the confrontation of three forces: the United Earth Federation, the Illuminate and the Cybrans. They united in the first game but the newly elected President's assassination makes them break up.\n\nThe game is split into three missions dedicated to these forces. You have an opportunity to play as each side of the conflict that allows you to see it at different angles. At the end three separated campaigns come together and have the single ending.\n\nThe gameplay is typical for the RTS genre: you need to build facilities, mine resources and create an army of different military forces, including robots, tanks and super weapons. Your units are upgradeable with special points you can get developing technologies and defeating enemies. The goal of the game is to overcome your opponents. However, in a single-player campaign you can win by the numerical superiority of your army.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Gas Powered Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":11471,"name":"ELEX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/dac/dacd97ee0e467e6e97142692f0a2103d.jpg","description":"ELEX is a handcrafted action role-playing experience from the award-winning creators of the Gothic series, set in a brand new post-apocalyptic Science Fantasy universe that puts players into a huge seamless game world full of original characters, mutated creatures, deep moral choices and powerful action.\nIn ELEX, you join the war over a powerful resource that gives people great magic-like powers, but turns them into indifferent cold creatures. You decide if emotions and humaneness or cold synthetic logic will rule the world of Magalan.\nFeatures:\nCompletely seamless Open World experience without borders and loading zones for the ultimate exploration experience\nVertical Exploration: Use the jetpack to reach any place in the game world\nSimulated game world where everything reacts to the players actions and provides for an authentic atmosphere\nHighly interconnected quest system that support true player choices\nTactical and challenging combat system for close and ranged combat\nUniverse set in a post apocalyptic science fantasy universe that combines the most interesting aspects of all genres","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"THQ Nordic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":9891,"name":"Friday the 13th: The Game","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/46b/46b62c37c8faf3268a0768b548e6cd9d.jpg","description":"Gameplay\nFriday the 13th: The Game is a third-person horror, survival game where players take on the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the world tracks you down and brutally slaughters you.  Friday the 13th: The Game will strive to give every single player the tools to survive, escape or even try to take down the man who cannot be killed. Each and every gameplay session will give you an entirely new chance to prove if you have what it takes not only to survive, but to best the most prolific killer in cinema history, a slasher with more kills than any of his rivals!\nMeanwhile, Jason will be given an array of abilities to track, hunt and kill his prey. Stalk from the shadows, scare your targets and kill them when the time is right in as brutal a fashion as you can imagine. Take control of the legendary killer that is Jason Voorhees and terrify those unfortunate enough to cross your path!\nPlay as Jason Voorhees!\nFor the first time ever, you will have the opportunity to play as Jason Voorhees, the most famous killer in horror. Stalk your prey, ambush them whenever you see fit and strike fear in the hearts of so many hapless victims as you become the legend himself! Friday the 13th: The Game will include a variety of kills, new and familiar, that will help you set the tone for the Jason Voorhees that you want to be. You’ll even get to unlock various Jason incarnations from the movies!\nJason will be equipped with a terrifying array of abilities, giving you the control of a hunter at the height of his game. These are his woods, and he knows them all too well. Jason will not only feed off the fear of his victims, but will become stronger as the night progresses. The darker the night, the more terrifying Jason becomes!\nFans of the movies will be able to play as various versions of Jason, including:\nFriday the 13th, Part II\nFriday the 13th, Part III\nFriday the 13th, Part VI: Jason Lives\nFriday the 13th, Part VII: New Blood\nFriday the 13th, Part VIII: Jason Takes Manhattan\nJason Goes to Hell: The Final Friday\nHow Will You Survive?\nThe entire focus of Friday the 13th: The Game is multiplayer. Survival is entirely up to you, the player, as you either stealthily hide from Jason or work together as a team to escape or bring the fight to Jason. Playing as a counselor is all about risk and reward, giving players multiple means of triumph over Jason! Want to hide in the woods as you wait for the police? Perhaps you want to band together and try to take on Jason as a group? Maybe you and a friend decide to fix the boat on the lake and escape while leaving everyone else to their fate? There are endless opportunities to survive the night, but every choice has a consequence.\nFriday the 13th: The Game will continually set the pace of change, giving you unfamiliar surroundings while Jason Voorhees looks for his latest victim. No single strategy will ever be reliable, forcing players to adapt and change each time they begin their long night in Camp Blood! Be wary, you never know when or where Jason is going to strike!\nPlay as the Counselors!\nWe all remember the various tropes from Friday the 13th, and the game will be no exception! Each counselor type will have strengths and weaknesses, affording players the chance to excel in certain situations. Find the counselor that best suits your play style, or come up with various strategies to win against Jason! Players will have the chance to continually update and improve their characters through unlocks, customization and improvement! The more you play, the more you adapt and become a better all-around counselor!\nCamp Crystal Lake in All Its Glory!\nMirroring Camp Crystal Lake from the Friday the 13th series, players will try to survive not only in the iconic Camp Crystal Lake, but surrounding area. Iconic locations from the movies, like Higgins Haven will also serve as stalking grounds for Jason and his prey.\nPlayers will be given a large, open area in which to explore as they attempt to hide from certain death! Each gameplay session will fundamentally change the scenario, never affording players the opportunity to learn patterns or figure out where helpful items may be lying. With each movie giving a different feeling to the campgrounds, Friday the 13th: The Game gives you new and challenging situations every time you enter the woods!\nYour Crystal Lake Database\nFriday the 13th: The Game will feature a progressive unlock system unified to your account. The longer you play, the more you'll unlock from counselor customization to new Jason Voorhees costumes seen in the movies! Besides giving you personalized camp counselors, you'll be able to unlock secrets within Camp Crystal Lake, exploring the mystery surrounding Jason Voorhees and the grounds he patrols!\nBe Kind. Rewind.\nEvery aspect of Friday the 13th: The Game\nis drawn straight from movies you know and love. We’ve carefully crafted this world to remind you of\neverything you remember about Friday the 13th, right down to the visual fidelity of the 80’s. This is exactly how you remember it.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"IllFonic","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":19536,"name":"State of Decay","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a34/a34a8c9e1798ef82ee3734719d3c60d3.jpg","description":"State of Decay offers you to become a zombie apocalypse survivor. You assume the role of a local community leader in a fictional US region called Trumbull Valley. In the Storyline mode, you begin the game as Marcus Campbell. However, though you only control one character at a time, AI-controlled allies will aid you on your missions, and if the main character is killed, you will switch to another hero from your community. Each character has a set of skills that can be improved by repetitive actions, such as fighting.\nThe main goal is to help your people survive by building and protecting a safe haven. You can improve your base with multiple buildings, such as kitchens and medical bays. The game is strongly focused on resource management. There are no shops in the post-apocalyptic world, and most resources have to be scavenged. However, there are NPCs and other survivor communities you can interact with. You can trade with them and even recruit them to join your community as new members. There's also a variety of zombies that will attack your characters. The game offers you more than 100 weapons, both melee and ranged. All weapons have limited durability and will break down eventually.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Undead Labs","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"}]},{"id":4518,"name":"Prince of Persia: The Forgotten Sands","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9a2/9a2e789046757af843ef0dd2a435adab.jpg","description":"Prince of Persia: The Forgotten Sands is an action-adventure third-person game developed by Ubisoft Montreal. It is the direct sequel to Prince of Persia: The Two Thrones.\r\n\r\n###Plot\r\nThe Prince decides to visit the kingdom of his elder brother Malik to train in martial arts. Upon the Prince's arrival, the kingdom is found to be under a siege. Trying to repel the invaders, Malik uses an ancient mystic medallion that frees the ancient army of Solomon. Upon breaking free, the army turns the people of the kingdom into sand statues. Only the Prince of Persia can stop the army from destroying the kingdom.\r\n\r\n###Gameplay\r\nThe game uses the usual Action-adventure formula where the player-controlled character traverses the level while avoiding traps, solves puzzles, and fights enemies using aerobatics and special powers. The game features a complex fighting system. \r\n\r\nAs the game progresses, the Prince learns more and more skills. The player is able to control all four nature elements: fire, earth, water, and air. Using such power, it is easy to manipulate the game's environment. It is essential to combine magic skills with the fighting system in order to be most efficient in the game.\r\n\r\nAs in previous games of the series, it is possible to rewind time. If the player makes a mistake and the Prince dies, the player can travel several seconds back into the gameplay. If such a thing is impossible, the player has to restart from the latest checkpoint.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Ubisoft Montreal","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":9066,"name":"The Walking Dead: A New Frontier","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f0a/f0a65d7d9c4534f8f4897f9d161307ed.jpg","description":"The Walking Dead: A New Frontier is the third episode of the storyline, based on a comic book series. \n\n###Plot \nThe events of the game take place in four years after the zombie virus hit the world. Clementine is an original character from the previous episodes.\nShe is still alive and trying to survive. She meets Javier Garcia. Javier’s family was taken from him, so he has to find them. Together they find out about the existence of the New Frontier. It is a group of survivors, whose credibility is ambiguous. \n\n###Gameplay \nLike two past seasons, the third one is a point-and-click adventure. However, in turn, there are two available characters.\nYou can play as a Javier, who was introduced only in this episode. The player can choose Clementine, but only in flashbacks. You control and direct your character around the environment, explore different scenery elements and pick up and keep objects. These objects can be used to advance the story later.\nMoreover, you can begin dialogues with non-player characters. Their answers can give a broad range of choices; it even includes staying silent. The time for making a selection is limited. However, even if the player does not make it, the conversation is not stopping. In this case, it is regarded as you stayed silent. These choices have an impact on later events. There are more action-oriented scenes, where you have to make quick decisions. If you fail it, you would have to restart from the very beginning of the scene.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"}]},{"id":2074,"name":"UNO","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ef9/ef96c016bdc6f6d708085536df3d07ae.jpg","description":"UNO is a video game adaptation of a famous card game developed in the 20th century. The aim is to be the first one to win 500 points. There is also a variation of the game called Uno Rush, announced two years later than the original.\n\n###Gameplay \nThe rules and card design do not differ from the original. Four players are sitting across the table.\nEvery player can check out his points in the composite chart. The round proceeds clockwise, it is supported by the revolving arrows and sound effects. The deck consists of 108 cards, 25 of each color. When it’s a player’s turn to go, he has to match the top card in the discard pile based on color, number or symbol of the card. They are dealt automatically to each player. It lets one focus on the game itself rather than on the mechanics.   \n\n###Key Features \nThe main visual appearance is a red screen and slow music so that the game screen can set up the background. There is not much action in the setting as the main processes appear between the players. Just like the original, one can’t see the opponents’ decks, so their goal is to become the first one to gain points. The player can also change the appearance in different game versions. For example, in Partner Uno the player with partners sit across from each other; the Xbox Live Version supports the webcams, which makes the action more intense. The video game has several teams over the internet, so it is possible to participate in live tournaments with players from around the world.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Ubisoft","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":50736,"name":"SoulCalibur VI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/91b/91be1a00c767f9e3d79353e505d7f85a.jpg","description":"Soulcalibur VI is the seventh major installment in its series of 3D sword fighting games. This installment serves as a reboot of the Soulcalibur series.\n\n###Plot\nThe plot retells the events that happened before and during the original Soulcalibur and alters them, thus creating a new timeline for the franchise. The events of the game are set between 1583 and 1590. As with the original, the story is based around the conflict between two magical swords, the evil Soul Edge that devours souls and Soul Calibur, the spiritual sword, and their respective wielders. The Soul Edge belonged to a dreaded pirate Cervantes de Leon until a brave knight named Siegfried challenged him.\n\n###Gameplay\nThe game is meant to attract new players to the series, and some of the changes were made for that goal. For example, the game introduces Reversal Edge mechanic, in which two opponents enter a slow-mo scene and exchange blows in a rock-paper-scissors manner by pushing a single button. This option allows even the novice players to counter most types of attacks. There's also a new Lethal Hit mechanic which allows the players to knock the opponent down by performing moves in the right time.\n\n###Characters\nThe game includes most of the popular characters of the series, such as Mitsurugi, Siegfried, Sophitia, and Cervantes de Leon. Some of the characters are redesigned. Geralt, the famous protagonist of The Witcher series, appears as a playable guest character.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":20156,"name":"The Beginner's Guide","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65c/65c8b501f8c2a9c9386411d7b5210934.jpg","description":"A game from the creators of Stanley Parable, the Beginner’s Guide is a narrative-driven walking simulator, where players are dropped in the world, narrated by the Davey Wreden, writer, designer and director of the game. Players are taken on a tour through the games, that narrator once found on his friends' computer and now was sharing the findings. While they travel together, the narrator will explain little tricks and exploits he found in the game. Or telling the player, what his friend Coda really meant to do or show.\nBeginner’s Guide is a linear narrative story, so players won’t have to solve complicated puzzles. There’s no possible or intended way for players to die, and the game is mostly explorative. Unlike Stanley Parable, The Beginner’s Guide is a linear experience, based entirely on the writing and emotional bond player establishes with the narrator over the shared experiences and discoveries. After the chapters of the game are completed, players can return to any of them at any time, turning off the narration, to explore the levels alone.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Everything Unlimited","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":15932,"name":"Crayon Physics Deluxe","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/46c/46c7913691660c39c265fb2dc2b73f7d.jpg","description":"Crayon Physics Deluxe is a 2D physics puzzle / sandbox game, in which you get to experience what it would be like if your drawings would be magically transformed into real physical objects. Solve puzzles with your artistic vision and creative use of physics.\nKey features:\nAwesome physics\nOver 70 levels\nEasy to use level editor\nRockets, ropes and hinges","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Kloonigames","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":52943,"name":"Final Fantasy IX","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/826/82626e2d7ee7d96656fb9838c2ef7302.jpg","description":"Final Fantasy IX (ファイナルファンタジーIX, Fainaru Fantajī Nain) is a 2000 role-playing video game developed and published by Square for the PlayStation video game console. It is the ninth title in the main Final Fantasy series and the last to debut on the original PlayStation. The game plot centers on the consequences of a war between nations in a medieval fantasy world called Gaia. Players follow bandit Zidane Tribal, who kidnaps Alexandrian princess Garnet Til Alexandros XVII as part of a gambit by the neighboring nation of Lindblum. He joins Garnet and a growing cast of characters on a quest to take down her mother, Queen Brahne of Alexandria, who started the war. The plot shifts when the player learns that Brahne is a pawn of a more menacing threat, Kuja, who shares a mysterious history with Zidane spanning two worlds.\nThe game was developed alongside Final Fantasy VIII. Envisioned by developers as a retrospective for the series, it departed from the futuristic settings of Final Fantasy VII and Final Fantasy VIII by returning to the medieval style of the first six installments. Consequently, it was influenced heavily by the original Final Fantasy game, and features allusions to the rest of the titles. Despite this approach, the game did introduce new features to the series, such as \"Active Time Event\" cutscenes, \"Mognet\", and unique equipment and skill systems.\nFinal Fantasy IX was released to critical acclaim. It is often cited by critics and fans as one of the best Final Fantasy titles, and holds the highest Metacritic score of the series. Final Fantasy IX was commercially successful, selling more than 5 million copies worldwide by March 2003 and 5.5 million copies by February 2016. It was re-released in 2010 as a PSOne Classic on the PlayStation Store; this version was compatible with PlayStation 3 and PlayStation Portable, and PlayStation Vita support arrived in 2012. In 2016, ports featuring minor gameplay and graphical enhancements were released for iOS, Android and Microsoft Windows followed by a port for PlayStation 4 in 2017.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Square Enix","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Android"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":2992,"name":"Nuclear Throne","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a2d/a2de25bcbcb0b4f0b015b644534597c4.jpg","description":"Nuclear Throne is a top-down roguelike shooter, set in a post-apocalyptic universe.\n\n###Plot and features\nThe game has a sole objective: to reach the famed Nuclear Throne. The player controls one of the many mutated characters. Each playable character is unlockable through levels, and has unique abilities, allowing for different approaches in every playthrough. Each level follows the same pattern: kill enemies, collect upgrades, kill a boss. However, there are many possibilities for a skilled player, as there are achievements to complete, and daily and weekly missions, which can have different objectives.\n\n ###Gameplay\nDying resets the game’s progress, while success opens up new mutations, weapons, and enemy types. There are five ammunition types, and many weapons share the ammo, so player often has to choose wisely. Mutations can be achieved through leveling up, with some available only to certain mutants, while others are free to choose from. Said mutations can emphasize on character’s unique skill, his weapon proficiency, or upgrade his stats.\n\n###Graphics and soundtrack\nThe game’s pixel art design is made very distinct and unique, as the setting of a post-nuclear western can lead to great possibilities for artists. Each texture, albeit simple, is recognizable and well-made, and the stylistics further emphasize the work of game’s designers. The soundtrack is a mix-match of 8-bit samples and Wild West themes, resulting in a very immersive and entertaining playthrough.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Vlambeer","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":287337,"name":"Evoland Legendary Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7d6/7d6d8bbcdec1a1ad14cd6bbca325a8c0.jpg","description":"Evoland is a journey through the history of action/adventure gaming, allowing you to unlock new technologies, gameplay systems and graphic upgrades as you progress through the game. Inspired by many cult series that have left their mark in the RPG video gaming culture, Evoland takes you from monochrome to full 3D graphics and from active time battles to real time boss fights, all with plenty of humor and references to many classic games.\n\nEvoland 2 graphics style is changing as you travel through time and its gameplay evolves as you move along the storyline. It is also a real RPG at heart, with a deep scenario based on time travel: explore different eras and change the history of the world. But are you sure that the consequences will not make things worse?\n\nFull of humor and references to classic games, the Evoland series brings a truly epic and extraordinary adventure, unlike anything you’ve ever played before!","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Shiro Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":41052,"name":"World of Warships","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/184/184f145450a5089e9d5a3b2d2229074e.jpg","description":"ABOUT THE GAME\nOver 200 historic naval vessels are yours to command in World of Warships, the ultimate free-to-play MMO action experience. Fight for naval supremacy in a variety of ships — fire a battleship’s big guns, sneak in with a destroyer, charge with a cruiser, or darken the skies with carrier squadrons. Strategize, then strike!\nWorld of Warships lets you experience epic naval combat like never before. Assemble and customize a fleet of gorgeously detailed ships and bring them into a variety of realistic battle scenarios across beautifully rendered real world locales. Jump into a random skirmish for a quick PvP clash, team up with friends for a challenging PvE scenario battle, or put your skills to the test in ranked battles!\nIf you're looking for a real war, get your Clan action on! Develop your Clan, earn extras, climb to the top of the Clan League and be the best on the server!\nAugment your fleet with a captain’s bounty of customization options: enhanced equipment modifications, camouflage, flags, and more. Recruit a Commander and use their inherent skills on your favorite ship to improve crew performance and ship survivability.\nWorld of Warships offers an incredible free-to-play action-strategy challenge. Think you can handle it? Download and play today!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Wargaming Group","platforms":[{"id":0,"name":"PC"}]},{"id":388308,"name":"Overwatch 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/95a/95a10817d1fc648cff1153f3fa8ef6c5.jpg","description":"Overwatch 2 is an always-on and ever-evolving free-to-play, team-based action game set in an optimistic future, where every match is the ultimate 5v5 battlefield brawl. Team up with friends and dive into the reimagined PvP experience as a time-jumping freedom fighter, a beat-dropping battlefield DJ, or one of over 30 other unique heroes as you battle it out around the globe.\n\n— 35 HEROES, 22 MAPS AND 6 GAME MODES\nLead the charge, ambush your enemies, or aid your allies as one of 35 distinct heroes. Take them into battle across 22 futuristic maps inspired by real-world locations, and master six unique game modes.\n\n— SEASON ONE IS NOW LIVE\nNew heroes, maps, and game modes will be added in seasonal updates every nine weeks. Drop into Season One and unlock the latest hero, Kiriko, and over 20 tiers of completely free rewards on the Battle Pass. Purchase the Premium Battle Pass to unlock even more cosmetic rewards including the all-new Demon Genji Mythic skin, legendary skins, sprays, voice lines, weapon charms, and more!","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Activision Blizzard","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":20709,"name":"Tom Clancy's Splinter Cell Chaos Theory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/83b/83b59a9d512bec8bc8bda6b539b215b2.jpg","description":"###Instant classic\nThe stealth-action, which became a real classic and well-known among gamers. Excellent reviews and 92/100 score on Metacritic is a serious indicator. In the Steam community, there are still enthusiastic nostalgic reviews of almost everything that concerns Tom Clancy's Splinter Cell Chaos Theory. And there is an explanation for this. The game was released in 2005 and became the third in the Splinter Cell series. Canadian studio Ubisoft Montreal was engaged in the development, who is also responsible for Assassin's Creed and Far Cry. Critics and player noted the Xbox and PC versions of the game as the best. \n\n###The story\nIn Tom Clancy's Splinter Cell Chaos Theory, the player will feel like a professional spy, NSA agent Sam Fisher from a special unit called “The Third Echelon.” The plot takes its origin from the first game in the series. However, the narrative is constructed in such a way that the player does not necessarily have to go through it in order to enjoy the story. The events of the game occur in different parts of the Earth that are based on places from the real world. At the heart of the game is the conflict unfolding between China, North Korea, South Korea, and Japan.\n\nIn addition to a single user campaign, there is the possibility of playing on the net. However, the official online services for this game were disabled as early as August 2016. Despite this, players still have the opportunity to play on the local network or, with due skill - through third-party services.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Ubisoft","platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"GameCube"},{"id":0,"name":"Xbox One"}]},{"id":14336,"name":"Acceleration of SUGURI 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a8d/a8de8a8f3054b66362acb540aeea3f39.jpg","description":"Take on all the characters of the SUGURI universe in this lightning-paced duel-style shoot'em'up. Continue the story of the characters you've come to know and love, and meet a new mastermind causing havoc on Earth. Play against the AI in Story Mode, or friends and foes online or locally in Multiplayer.\nAcceleration of SUGURI 2 is a direct sequel to Sora.Key Features:Fast-paced, tactical duel-style bullet hell\nFull HD resolution support and beyond\nThree game modes: Story, Arcade and Match Mode\nOnline and Split-screen Multiplayer\nOver 10 characters from the SUGURI universe to battle with","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Orange_Juice","platforms":[{"id":0,"name":"PC"}]},{"id":16123,"name":"The Last Remnant","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a86/a86263d9dd8d21bc3e9fa37db1fd3203.jpg","description":"Mitra, yama, qsiti, sovani...\nThese four races exist in one world.\nA world filled with Remnants — mysterious artifacts from an ancient era.\nWho created the Remnant? How long ago? And for what purpose?\nWith these questions left unanswered, the Remnants became beneficial tools used for the good of civilization.\nThe world was at peace...or so it seemed. Who was to know such darkness lay in wait?\nThe powers of the Remnants slowly began to change the world's balance.\nA rift slowly formed between those who ruled and those who obeyed.\nThis was the dawning of a new era — an era of countless frays that would be brought upon the world by those enslaved by their own lust for power.\nA thousand years later, the journey of one young man begins.\nFeaturing an enthralling story, countless characters and an intricate battle system, Square Enix brings the RPG experience known as The Last Remnant to the PC.\nDiscover new strategies in the improved battle system.\nBlast through your battles with Turbo Mode\nBattles can be played out with twice the speed for faster game progression\nNo more leader units\nEnjoy more freedom when creating unions!\nA new equipment preview feature\nUse the preview feature to purchase items depending on stats or aesthetics\nChoose between English or Japanese voice acting\nThe voices can be switched between Japanese and English","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]}]