[{"id":27392,"name":"Mario & Luigi: Superstar Saga","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c48/c488b166259e38d942478c59b7508cdf.jpg","description":"Prepare for an epic journey beyond the borders of the Mushroom Kingdom as Mario™ and Luigi™ team up for a hilarious, action-filled adventure!\n\nDuring a normal day of royal duties, Princess Peach meets with the  ambassador of the neighboring Beanbean Kingdom. However, an act of amnesty turns into an act of theft! The evil Cackletta and her awful assistant, Fawful, disguised themselves for the chance to steal Princess Peach's voice. Before the Mushroom Kingdom can fall under Princess Peach's despair, Mario and Luigi will need to work together as they cross the border to the lands of Beanbean Kingdom. Take a break from the adventure and play a quick game in Mario Bros. mode, featuring an enhanced version of the original NES game. With all this awesome action, you'll have hours of fun!","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"AlphaDream","platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":21822,"name":"Trials 2: Second Edition","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/2e7/2e7c6bc2636da0eebc5fbcf015db8adf.jpg","description":"RedLynx Trials 2 Second Edition is a spectacular motorcycle game featuring stunning graphics and addictive gameplay!\n4 game types (race, flip, wheelie, dynamic)\nRace: Race against other players to compete levels as fast as possible\nFlip: Try to make as many backflips or frontflips with your bike\nWheelie: Drive on your backwheel for longest distance possible\nDynamic: Navigate through tracks with various dynamic obstacles and puzzles\nOver 51 tracks to play\nGlobal highscores\nGhost challenge. Play against the ghost of any other player in high score list\nOnline player profiles with team, country and player statistics\n25 achievements to unlock","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"Redlynx","platforms":[{"id":0,"name":"PC"}]},{"id":21654,"name":"Stalingrad","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0c6/0c6632c285882ac83f75920131a461be.jpg","description":"Stalingrad is a real-time strategy title that places gamers in the middle of the most dramatic periods of World War II, covering major events from June 1942 till January 1943. Built-up upon the enhanced Enigma Engine, the game offers faithful historical recreation of the Stalingrad area, vast tactical options and more than 150 units at your command.\nIn Stalingrad's two thrilling campaigns, you will take command over Wehrmacht and lead the German forces into the City, then switch to the Red Army and drive the occupants from the Soviet stronghold.Key features:\nMore than 150 types of units, 43 missions in two large campaigns for the Wehrmacht and the Red Army\nThe game missions were recreated from tactical maps and air photography materials\nHistorical buildings reconstructed from archive photos\nAccurate reconstruction of historical events\nFull-scale battles on the city territory\nOriginal soundtrack by the band \"Skafandr\"","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"DTF games","platforms":[{"id":0,"name":"PC"}]},{"id":20596,"name":"Contract With The Devil","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/217/217e3acfe5ba451a9ec3a2bede7fe76b.jpg","description":"The unknown sends you a letter and invites to his house, promising to tell something very important about your daughter. But during the dinner with the owner of the mansion, the terrible thing occurred: as soon as you threw off the blanket from antique mirror, a mysterious evil force stole your only daughter Lisa! Right before your eyes, she disappeared inside a large mirror without a trace, and the only witness of these strange events who could shed the light - disappeared. Return 7 vices back to the Vault in order to help Sonya to save yourself and her daughter. Use the tips of a bogy Brownie - it will become your faithful assistant in this dangerous journey full of mysticism.\nExciting tasks, unusual riddles, lots of logic puzzles, search of items and important artifacts are waiting for you. And also, the journey through the looking glass and a visit of the past.\nDiscover the sinister family secret and throw out a challenge to the power of evil! But be careful, the closer you are toward the goal, the more someone dislikes it much.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"AZ-Art Development Studio","platforms":[{"id":0,"name":"PC"}]},{"id":20098,"name":"Soccer Manager 2015","genre":"Sports","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d21/d21e566a3d2860189207239f57b7fae4.jpg","description":"A couple of years ago we decided to make a high quality, immersive single-player football management game that is genuinely free to play. After many, many months of development we are very proud to present the first iteration - Soccer Manager 15.\nWe have always kept users at the forefront of everything we do at Soccer Manager so our plan now is to let you enjoy the game for free, hopefully tell your friends about it and - even better - let us know what you think of the game by contributing to one our regular community events or via our social media/forum channels.\nYour feedback will help us shape the next major iteration (Soccer Manager 16) due for release later this year.\nIf you're still reading this - here is some marketing blurb about the game...\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nPlay Soccer Manager now - become a legendary football manager and lead your team to championship glory in this free football management game. Lead living legends to victory in this fast-paced, action-packed single-player game.\nKey Features:\nStart managing your favourite club in a matter of minutes\nYour game is accessible via the cloud\nManage over 800 clubs in over 48 of the world's top leagues – take your team to the top of world football.\nBuy and sell players to improve your club from our cloud-based Wiki of over 70,000 players – the only game in the world that has a player database that's always up to date.\nSet the tactics that dictate how your team play - how will you match up against the world's great clubs?\nBuild your club on and off the pitch - hire staff to scout or train your players, improve your facilities or build your stadium to bring in more revenue.\nIf you love football as much as we do, you live and breathe it. Join over 9 million other managers at Soccer Manager - the place where all that passion comes into play.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Soccer Manager","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":19489,"name":"Akaneiro: Demon Hunters","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/13e/13ef62daf0f226b3f89e6f77fb0f5fdb.jpg","description":"Starter PackAkaneiro is available for FREE on other platforms (like SpicyWorld and Kongregate), but not on Steam. Why?\nOn Steam we offer the game for sale with a Starter Pack that includes items and currency worth much more than the purchase price. If you don't wish to spend money to try Akaneiro, head over to a platform where it's offered for free. You can then decide for yourself if paying for it here on Steam in order to access the Starter Pack is worthwhile.\nPurchase the Starter Pack now and receive access to Akaneiro: Demon Hunters, bonus currency, consumables and exclusive items for Steam players!\n\nExclusive Steam Necklace. Boosts all base attributes.\nExclusive Raging Steam Blast Katana.\n25,000 Karma Shards. Karma Shards are the raw currency formed from the blood of the fallen Yokai.\n300 Karma Crystals. Karma Crystals are the highly valued currency refined from Karma in its most pure state.\n20 Shinigami Scroll consumables. Used to revive and smite surrounding enemies.\n3 Sea Urchin Sushi consumables. Boosts base Power stat\n3 Kagami Mochi consumables. Boosts base Skill stat\n3 Dorayaki consumables. Boosts base Defense stat\n3 Fugu Tempura consumables. Boosts Movement Speed\n3 Sukiyaki consumables. Boosts Critical Chance\n3 Sochu consumables. Boosts XP earned from monsters.\n3 Awamori consumables. Boosts loot drop quality.\n3 Hojicha Tea consumables. Boots Energy regeneration rate.\n3 Chrysanthemum Tea consumables. Boosts health Regeneration rate.\n10 Large Health potions. Recover 800 Energy per second for 10 seconds\n10 Large Energy potions. Recover 1600 Health per second for 5 seconds\nAbout the GameHints of Little Red Riding Hood combine with Japanese folklore and illustrated in Spicy Horse's unique dark fantasy style, \"Akaneiro: Demon Hunters\" is an action-roleplaying game (ARPG) that lets players hunt mythical monsters in Edo-era Japan.Planned Key Features:Materials:  June will see the introduction of material drops from enemies and significant drops from the Area bosses, with the chance and quality increasing with the difficulty of the Mission.\nCrafting:  With Materials dropping that means the Crafting vendor will open his doors, allowing players to upgrade the Element, Enchant and Gem attributes on the items.\nMore Areas:  The Melon Fields (Area 7) will be releasing in the coming month with following planned content updates to include Temple Depths (Area 8), Survival Pits (horde style waves), as well as the Raid missions especially created for multiplayer.\nMultiplayer:  We have begun working on the multiplayer aspect of the game with internal testing expected in July.\nSocial:  In-game Chat and Leaderboards to compare with the other Hunters out there.\nAbilities and Masteries:  More Abilities and Masteries to train based off of your base Discipline stats. Choosing your Discipline stats on level up will define your character in more meaningful ways.\nHelpers:  Easy access and use food and drink plus updates to Spirit Helpers through adding a leveling system to increase their effects on the player once summoned.\nNew Mission Types and Enemies:  Expanding existing areas with new mission types over the next coming months to create a more broad experience for the player.\nAchievements:  Track your progress and show off your achievements with pride","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Spicy Horse","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":17820,"name":"Draft Day Sports Pro Basketball 4","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/715/7155de2f13166f25dfd6a45c58f5c723.jpg","description":"If you've ever wanted to step into the front office of your favorite pro hoops team this is your chance! Draft Day Sports: Pro Basketball 4 puts you in charge of your favorite professional basketball franchise. Draft, trade, sign players in free agency, and build your team into the next championship dynasty.\nYou create the league you want. From multiple league sizes, draft format, limited or full financial models to allowing overseas and high school talent to enter your annual league draft. Hire your coaching staff, sign free agents, make trades, negotiate contracts terms, and draft college talent.\nTake a more direct or indirect approach to running your team. If you don’t like how your head coach is running the team on the court, fire him and take over the team as General Manager/Head Coach.  If a player’s attitude is disrupting the team, try to work with him or trade him away. You set your team’s player rotations, depth chart, and even directly manage in-game strategy on the court. Or just let your coaching staff handle those player and game day management duties.\nRookies and prospects get to compete in summer league games to showcase their talent. Send players to your affiliated D-League team for in-season development. There's even a fully playable European League option. Track and evaluate players with the latest statistical metrics - see where a player took every shot from and what his percentages are from each area.\nA full historical league almanac will keep track of every single season played for every player and every team. The in-depth news system will keep you up-to-date on the latest big performances, trades, and rumors from around the league. It’s all here to create your ultimate “dream league” pro basketball experience.\nFeatures\nControl the vision, development and strategy of a professional basketball franchise over decades.\nDraft college prospects, sign free agents, hire your coaching staff and put together blockbuster trades.\nChoose from a variety of league setup options to create your own “dream league”.\nRealistic, detailed financial models. Juggle the budget expectations of your team’s owner and the salary cap to build a winner.\nFinancial changes allowing the salary and luxury cap as well as player salaries to increase over time.\nBuild your basketball championship team according to your unique philosophies and strategies.\nManage the egos and personalities on your team. Do you support your coaches or trade the players?\nRebuilt UI with a brand new look and widescreen support.\nRobust stat tracking from individual player shot charts and new advanced stats like PIE.\nCombine stats added for rookies to use for scouting rookies to draft.\nFully playable European League and a full 32 team development league.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Wolverine Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16052,"name":"Reversion - The Meeting (2nd Chapter)","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6e0/6e0173bcdc0f5f6ca47c5c0bdf667520.jpg","description":"Steam Exclusive OfferChapter One of Reversion is available for $0,99 on Steam with trading cards- click  here (Reversion - The Escape)  to try it out.\nAbout the GameAfter escaping from the hospital still with no memories. Victoria is helping you find the person in the photo, it's vital to recover your memories and understand who you are and why you are here.\nAlong your journey, you'll meet new friends that will help you. New, challenging riddles in different locations all around the well known city of Buenos Aires. Those places will get you closer and closer to meeting this special person that might hold the answers to your questions.\nYou need to remember who you are.\nReversion - The Meeting is the second chapter of a graphic science-fiction adventure in point’n’click developed by the indie 3f interactive. Inspired by classics of the genre from Lucas Arts, Sierra or yet Pendulo Studios, 3f interactive thought its game for the fans of old school adventure games.\nYou will be propelled to a desolate future, robbed of your memories and looking desperately for clues to understanding your predicament.\nPlay as Christian and find his way back to his memories, through numerous puzzles and dialogues with intriguing characters. Team up with Victoria and Pablo, a new friend, that will guide you through the city while you learn what happened and what you can do to, maybe, change the future…\nPlunge in this fascinating adventure and reverse the disastrous events that left the city in ruins.\nTake your chance to change history; it’s time for Reversion. This time, in the city.Features:\nCharismatic and mysterious characters\nDeep and challenging puzzles to keep you hooked\nWide variety of interactive objects through each scenery\nClassic 2D graphics, as in the golden age of the genre\nHand drawn characters and locations, digitally colored, achieving a beautiful result that you can see for yourself\nHints system to help you move forwardOther Reviews\nhttp://www.ordinarygamer.co.uk/2013/04/02/reversion-review/","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"3f Interactive","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":12590,"name":"24 HOURS","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/577/577e6f655a548eca7076fce790c360a8.jpg","description":"24 hours have changed the world altogether. The gates to the Hell have opened. The city where yesterday the sun shone and the life throve has drowned in the darkness.\nDemons have swarmed the streets, forests and fields.The fear and atrocities reign. The peoples are in captivity of the demons.\nYou, the unfrightenable marine, managed to escape. And now you have decided to face this horror to return the light in this world and save the people.\nWith only very SMG you will fight in full darkness. You should be tiptoe and stealthy to avoid demons attention. Your way will be through dark forests, a dungeon to the center of the city where the evil dwells. Defeat the evil and save the people.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"MysticGames","platforms":[{"id":0,"name":"PC"}]},{"id":12457,"name":"The Janitor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/870/87097890b47bae24522d596b0190cfd0.jpg","description":"The Janitor is a first person horror game. You play as a janitor, called Max Taylor, who is send to an asylum by his boss to repair a broken pipe and a broken electric panel. Max knows that the asylum is abandoned, but he isn't feeling bad about going there although his boss warned him not stay to long there. Once arrived he quickly notices that something is wrong. Blood everywhere and strange noises can be heard. Short time after looking around a went-wrong experiment of the government rushes to him.\nMax has to worry about his life while trying to escape the asylum - but there is one problem: The elevator is broken! Max hurries to find some tools and machine parts to repair the hydraulic pump.\nAs soon as the elevator is repaired he has to look into the eyes of danger again! His only chance to escape is to jump down the elevator shaft. Max Taylor is wounded and unconscious. Right after waking up he finds himself in huge underground catacombs. Hunted by fear and the went-wrong experiment he has to find the exit!\nWill he find it?Gameplay Features\nThe Janitor focuses on breathtaking horror elements such as jump scares, physcally enemies and the fear of darkness.\nRealistic, modern graphic based on physical based rendering systems\nHorrific ambience with stunning sounds and jump scares\nInteractive world\nSolve puzzles to continue in story\nExtremely intelligent AI with progressive behavior\nCharacter stats are influencing the AI behavior, such as heartbeat, loud breathing, body odor or blood\nThe feeling of never beeing safe","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"VOS Gaming","platforms":[{"id":0,"name":"PC"}]},{"id":11837,"name":"Lamia Must Die","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b1c/b1cc08e2216d17f1762378c285f7701a.jpg","description":"Abstract\nLamia must die! was a contest entry done for Encounters of Boss Kind. Since it actually placed 3rd of 28 entries (going for a tie with Demon Slayer Z), I went ahead and improved the game with improved graphics and more depth involving battle system before release to general public. It has an opening, the fight against Lamia herself and then the ending which is afflicted by which of the heroes survive. If all four heroes survive, there's a special ending. The battle can be somewhat tricky and requires use of strategy. The difficulty is medium-hard to hard, depending on how familiar with RPG mechanics you are.Story\nA horrible monster has been terrorizing the local town for years, doing terrible, unspeakable things to the citizen. One day, a paladin leads several other heroes towards the cave where the monster lies in, them being the final hope for the town of Clearmill and to save it from total devastation.Characters\nYou have a party of four characters, with the ability to choose between two paladins, a mage and archer. You also have Bishop and Rogue who join your party in your quest to defeat Lamia.\nEric\nEric is a Paladin who fights using a sword and shield. He is very sturdy and is able to withstand mighty blows, even though his heavy armor slows him down.\nJanet\nJanet is a Paladin who fights using a spear. She is very nimble and is able to deliver strong attacks, even though she is lacking in her defenses.\nUrsula\nUrsula is a mage knowing many spells that can hinder numerous foes at once.\nVivian\nVivian wields a mighty bow that can hit any single target with an incredible power.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Tuomo Laine","platforms":[{"id":0,"name":"PC"}]},{"id":11337,"name":"The Rose and I","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/867/867208f9f69238d3e74ca8aa82766e86.jpg","description":"An immersive, animated VR film. Crafted by the artists, animators and storytellers of Penrose Studios, “The Rose And I” is about loneliness, friendship, love, and loss. Come meet a lonely Rose living in the unlikeliest of places, and join her as she transports you to a brand new universe.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Terry Kaleas","platforms":[{"id":0,"name":"PC"}]},{"id":10741,"name":"Shut Up And Dig","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/74f/74f3ba279d218ffa2e9ea6fa6382043a.jpg","description":"Shut Up And Dig is an exciting 2-d roguelike game made in fantasy theme. The main hero is an elf-girl, who is exploring the mysterious worlds of haunted dungeons.\nAll the elements of the magic world of this game is connected with each other. The terrifying world you have to explore is full of powerful artefacts, secrets, demons, monsters and ghosts.\n•\tPresently, the first world of the game is completed : it's around 10hrs gameplay\n•\tThe game will have 5 absolutely different and also randomly generated worlds and more than 10 secret worlds. Every world has its own design, music and gameplay.\n•\tDuring the game you will meet great amount of bosses.\n•\tAll the elements in this magic world interact with each other.\n•\tThe dangerous underworld you will explore is full of powerful artifacts, secrets, demons, monsters and ghosts.\n•\tEvery game will be unique. Get ready to survive in this dark and doomed world.\n•\tThe process of finding the artifacts and special tools is very interesting; you have to solve difficult puzzles.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Evgeny Shcherbakov","platforms":[{"id":0,"name":"PC"}]},{"id":5401,"name":"NOBY NOBY BOY","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4c1/4c17a63a150a5485fc8824d95cab8135.jpg","description":"Control the stretching, flying, farting character, BOY, in this one-of-a-kind gaming experience!\nYou and countless other BOYs across the world explore and interact with objects in dozens of surreal worlds, where play is limited only by the boundaries of your imagination! The more everyone stretches, the longer the whimsical character by the name of GIRL will grow—starting from Earth and reaching other planets in the Solar System, unlocking new levels along the way!\nVersion 1.1 now adds an offline multiplayer mode where you and up to three of your friends can bring your BOYs together for a romping good time! Fart BOY, another bizarre new feature makes BOY announce the name of the objects he farts out! Try these and even more surprises in the zany world of NOBY NOBY BOY™!\nNOBY NOBY BOY™ & © 2008 NAMCO BANDAI Games Inc.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":5329,"name":"Gunstar Heroes","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5fa/5fa8a952daf991d57bb44e2f98afb49b.jpg","description":"Just UpdatedAll SEGA MegaDrive/Genesis titles now launch using the new SEGA MegaDrive/Genesis Interactive Hub, with all new features, UI and Steam Workshop Support!\nAbout the GameThe Gunstar family are the protectors of the planet Gunstar 9.\nAfter many years of peace, vicious dictator Colonel Red kidnapped the Gunstar twins’ older brother and used mind control to make him his slave. Now, with the aid of the Mystical Gems, he’s threatening to release Golden Silver the Destructor from the Gunstar 9 moon, with apocalyptic consequences!","review":"","timePlayed":0.0,"releaseYear":1993,"developer":"SEGA","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Genesis"},{"id":0,"name":"Game Gear"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":836443,"name":"SpongeBob SquarePants: The Cosmic Shake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/678/67805379742d1880cd1177676699238c.jpg","description":"Wish-granting Mermaid’s Tears in the hands of SpongeBob and Patrick… What could possibly go wrong?\r\nSure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails.\r\nBut that’s nothing everyone’s favorite sponge can’t handle - with the right cosmic costume! Everybody do the Cosmic Shake!\r\n\r\n\r\n\r\nKEY FEATURES\r\n\r\nUnlock classic and new platforming skills like the Fishhook Swing and Karate Kick\r\nDon more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar\r\nTravel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom\r\nExperience all the buddy movie banter with SpongeBob’s permanent companion Balloon-Patrick\r\nMeet all your favorite Bikini Bottomites from the series, voiced by their original actors\r\nEnjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory\r\n\r\n\r\n\r\nSTORY\r\n\r\nSpongeBob and Patrick meet the mysterious fortune teller Kassandra who gives them a vial full of Mermaid’s Tears©. Legend claims they grant the wishes of those who are pure of heart…\r\nNaturally, the two best buddies get overexcited and their flurry of wishes tears open the very fabric of space and time. All while releasing Cosmic Jelly© onto Bikini Bottom and opening portals to strange Wishworlds in the process.\r\nNow it’s up to our heroes to rescue their friends who got lost in the Wishworlds and bring back Bikini Bottom’s most iconic buildings.\r\nBut Kassandra has her own devious plan…","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Purple Lamp Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":581025,"name":"Your Chronicle","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d4f/d4f9212d6390faec889ac38596866eef.jpg","description":"\"Let's begin your own story.\"\nThis is a text-based idle RPG game.\nThere are more than 1500 actions here.\nIt's still growing.\n[ Features ]\n- Action buttons to select what to do and enhance abilities\n- Automated battles in Dungeon\n- A system to summon monsters and strengthen them\n- Skill and Equipment for summoned monsters\n- An upgrade system called Routine with offline bonus\n- System to automate Action and Dungeon\n- Reincarnation and multiple endings\n[ Story ]\nYou'll start this game from the village.\nYour father says \"Be strong, and save your mother.\".\nClearing many quests and battle against monsters to be strong.\nMaking friends may be good for your journey.\nEverything starts from here.\n[ Controls ]\nClick buttons to select action.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Samurai Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":268403,"name":"Bladed Fury","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/806/80686bfa80114cd5f28b04a8187a1c03.jpg","description":"This is a classic Chinese fantasy 2D action game, based on Chinese history, mythology with a dash of surrealism in the mix.\n\nAt the beginning of the Warring States Period, Tian, an officer under Duke Kang of Qi, set a trap that killed the Duke, exiled Ji, the younger princess, and put Shu, the elder princess, under house arrest. This event ... more »","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Next Studio","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":261261,"name":"Second Chance","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/243/243d57f90669eb0cb9c0a28c20db3c2b.jpg","description":"Second Chance is a single-player, first-person narrative game of time travel, choice and consequence.\nAs an operative tasked with fixing corruption in the timestream, you have been sent to the North of England in May 2015, where six people died in a house fire. Prohibited from simply stopping the fire, you must instead manipulate the choices made by the housemates in the week leading up to it so that they all survive the event.\nFrom the outset, you have free and complete reign to explore the seven day timeline before the fire. You can watch and alter the significant events from the entire week as many times as you like and in whatever order you wish. Some decisions will have only minor effects on the timeline, moving objects around the house or revealing deeper stories and secrets. Major changes however, rewrite the timeline by changing existing events, adding new events and even replacing other events entirely.\nYou must traverse up and down this timeline, changing decisions at different moments throughout the week so that their effects interact and combine together to save all six housemates.\nHowever, it is not just the housemates who have choices. Each of them can be saved from the fire in multiple ways, with each outcome having a profound effect on their lives in the future. Will you just search for the quickest and easiest solution, or can you find the best possible outcome for everyone?\nUltimately, everything is about choices and consequences.Features\nChoose how you want to follow the game’s story\nWant to follow each of the six characters’ stories ‘Pulp Fiction’ style? That’s fine. Want to watch the whole thing like ‘Memento’, with the final event first and then moving back in time to see what caused it afterwards? That’s okay too. Or maybe you’re old school and just want to watch things in good-old chronological order? You can do that as well.\nWatch and change things as many times as you like\nCan’t remember exactly what happened in an event? Changed a decision and you’re not sure you like the consequences? That’s fine. Just pop back along the timeline and watch and change whatever you like, whenever you like, as many times as you like.\nChange the past to affect the future\nSetting up temporary base in the house mere hours after the fire, provides a unique perspective on events. As you look back through the timeline, past events play out in front of you in ghostly form, with the smoke and fire damaged house a constant reminder of what is to come. In addition, as you manipulate the past, the environment can be reset around you to match the changes taking place. Some new objects will appear, others will move around the house and the contents of rooms can change substantially as you change the past.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Cosmonaut Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":58285,"name":"Cast of the Seven Godsends","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/9ae/9ae1aeb536fca894c1df4420e7772483.jpg","description":"Four levels of difficulty, six worlds to conquer, twelve mid and\nend-of-level bosses, seven god-like armour sets, five basic weapons and\nthirty-five magic combat spells!\n\nThe evil emperor Zaraaima has kidnapped the infant heir to the land of\nDareca. King Kandar must call upon the aid of the seven gods of Dareca\nas he traverses the six worlds of his kingdom in a bid to save his son.\nHe must face the emperor's hordes as he battles through dark woods,\nslimy swamps, sinister mills, infernal volcanos, snowy mountains, golden\ncities and demonic castles. Each world is guarded by level bosses each\nsworn to bring about the king's swift demise. To help him in his quest\nKing Kandar can invoke god-given armour, wield different weapons and\ncast fanatical spells. Can the King save his son and his kingdom or will\nDareca fall into the evil emperor's grasp?\n\nFeatures\n\nEasy controls - only two buttons to play (shoot and jump)\n\nSix very different and long worlds to conquer\n\nCheckpoint save positions throughout worlds\n\nFive basic weapons to master\n\nSeven god-like armour sets\n\n15 different bonus items to boost your hero\n\nThirty-five magic combat spells to utilise\n\nOver 50 different enemies\n\nTwelve mid and end-of-level bosses\n\nFour difficulty levels\n\nDifferent endings\n\nHand-drawn pixel graphics with a 16-bit look-and-feel\n\nSpecial art gallery with achievements to unlock\n\nEaster eggs to discover\n","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Merge Games","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":57954,"name":"Vagrant Story (2000)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cdc/cdc039b06d3adddbf0499f72d6e59169.jpg","description":"Vagrant Story (ベイグラントストーリー, Beiguranto Sutōrī) is an action role-playing game developed and published by Square (now Square Enix) for the PlayStation video game console. The game was released in 2000, and has been re-released through the PlayStation Network for the PlayStation 3, PlayStation Portable and PlayStation Vita consoles. Vagrant Story was primarily developed by the team responsible for Final Fantasy Tactics, with Yasumi Matsuno serving as producer, writer and director.\nThe game takes place in the fictional kingdom of Valendia and the ruined city of Leá Monde. The story centers on Ashley Riot, an elite agent known as a Riskbreaker, who must travel to Leá Monde to investigate the link between a cult leader and a senior Valendian Parliament member, Duke Bardorba. In the prologue, Ashley is blamed for murdering the duke, and the game discloses the events that happen one week before the murder.\nVagrant Story is unique as a console action-adventure role-playing game in that it features no shops and no player interaction with other characters; instead, the game focuses on weapon creation and modification, as well as elements of puzzle-solving and strategy. The game received critical acclaim from gaming magazines and websites.","review":"","timePlayed":0.0,"releaseYear":2000,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation"}]},{"id":49061,"name":"METRO CONFLICT: THE ORIGIN","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/383/3837aa2daa4b4a124ea56ea7129f04e6.jpg","description":"Metro Conflict: The Origin takes place sometime in the near future where two factions wage war with each other in order to gain dominance over the world. It is a story of mercenaries caught up in the storm of battle.\n-\tThere are 12 mercenaries each with unique character models, weaponry, and character specific skills. Playing and mastering each character offers fun and exciting experience for players.\n-\tIn collaboration with various FPS game development veterans, we’ve focused on the core experience of handling each and every weaponry ranging from assault rifles, SMG, shotguns and sniper rifles. As we believe one of the most important factors within a FPS game is weapon mechanics, we welcome you to join us on the battlefield.\n-\tAll Mercenaries gain unique skills through their “Special Suits”. Skills are categorized into Offensive/Defensive/Support types and also provide benefits to team mates. Such skills provide additional grounds for strategy that can grant you and your team victory on the battlefield.\n-\tMetro Conflict: The Origin differs from generic FPS experience with the new EXD (Extreme Domination) game mode. EXD is a 6vs6 team play where two teams fight to gain control over a satellite hacking device known as the “Marker”. Once a team gains control of the “Marker”, they are able to choose their own location to set up and channel the device to fully activate it to win the round. It is important for a team to have great cohesion in order to have an edge over the other team. Strategy in terms of team build and map usage opens up a wide range of possible scenarios.\nMetro Conflict: The Origin seeks to value the following elements;\n-\tNo Pay to Win: The game will strictly be based on individual skill, team work, and strategy. We will not be offering cash items which may impact the gameplay directly.\n-\tWe stand against any and all manipulation of the gameplay which includes hacking, unofficial mod advantage, and/or any potential threats to the mass player base that is not skill/strategy based.\n-\tWe believe success of a game is based on customer satisfaction. No better customer satisfaction can be attained than to truly listen to the users. We will continue to focus on keeping our ears open to your feedbacks and improve your gameplay accordingly.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Red Duck","platforms":[{"id":0,"name":"PC"}]},{"id":45222,"name":"Gangs of Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/80a/80a6d7b76cc3bbbc2ddc42f3b63faf35.jpg","description":"Gangs of Space is an indie Rogue Shmup MMO developed with love by Grouroux and Erhune.Shmup\nPart-Shmup, part-Hack'n Slash.\nYour skill will be your important asset in order to avoid the myriad of enemy bullets. In addition, chosing the right abilities and equipment for your ship will transform you in a formidable space perdator.\nBut get your tissues ready: here, every death is permanent!Roguelike RPG\nChose a ship among multiple classes, and level it over 10 quick levels. Create a unique build and optimize it by looting equipment from the fuming wrecks of your enemies.\nOver time, you will complete class objectives and unlock new build choices that will enhance the possibilities of your next ships.MMO conquest\nThe goal of Gangs of Space is simple: conquer the Galaxy in the name of the Empire! Whether you go solo-hunting or gather a squad of talented Gang-mates, the only important thing is that: conquer more and more sectors.\nWhen the Galaxy is fully conquered, players and Gangs receive rewards based on their rank in various ladders. A new conquest campaign then starts, in a new unknown Galaxy.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Little Big MMO","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":39776,"name":"Zombie Driver","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/09d/09d22646c6bf32b8558cd8c071833304.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Exor Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Nintendo Switch"}]},{"id":39241,"name":"Need for Speed World","genre":"Racing","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ba/0ba3794e8e6013f3334a709c50bc8bf2.jpg","description":"","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts Black Box","platforms":[{"id":0,"name":"PC"}]},{"id":23849,"name":"Animal Crossing: Wild World","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/9e5/9e5090bc33c972d0da0d14afff882ae5.jpg","description":"Get ready to start a new life! Whether you want to decorate your home,\ncatch bugs or fish, join in on special events, or just chat with the\nlocals, there's always plenty to do! Accessorize your life with over 600\nnew items. Design constellations, clothes, and flags. Take part in\nevents as the seasons come and go!\nThis classic game is part of the Virtual Console service, which brings you great games created for consoles such as NES™, Super NES™ and Game Boy™ Advance. We hope you'll enjoy the new features (including off-TV play) that have been added to this title. See more Virtual Console games for Wii U.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"Nintendo","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo DS"}]},{"id":20473,"name":"Deep Eclipse: New Space Odyssey","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e6a/e6a522ab987b36a3b0cbd8534bb9b838.jpg","description":"Deep Eclipse: New Space Odyssey is the ultimate space thriller in the best tradition of the genre.\nYou're the pilot of a space fighter, accidentally catapulted into a parallel universe populated by hostile alien creatures; and they're not happy to see you! To get out of this hell, do your best, to destroy hordes of enemies.\nBe prepared to be part of this world, if you want to survive. Develop and upgrade your space fighter with a wide range of role-play features.\nDestroy to survive! Survive to return home!\n- Advanced 3D graphic and effects with cool light effects\n- Stunning and furious gameplay\n- Mad and unqinue parallel universe locations\n- A huge number of monsters and deadly bosses\n- RPG character development\n- 2 trees of development: technological and organic\n- Unique abilities for each of the development trees\n- 52 upgradable and well-balanced weapons\n- 30 perks\n- Achievement system\n- Great in-game camera for the best action","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Ultravision Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":15200,"name":"Think To Die","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d7/0d75073d5d8c10a6d6697e9f0bb4c05f.jpg","description":"\"ThinkToDie\" is a different and creative casual puzzle game where you have to find a way to die in order to pass the level. To do so, you have to master different situations, combine objects, and time your actions.\nThe game starts with a small introduction/tutorial. The more levels you pass, the harder they will become, the more players you will have to kill, the more you will have to think. Puzzle your way through over 145 levels. Furthermore, you have an option to skip any level in case you get stuck in one of them.\nMeanwhile in all other games your main goal is to survive, in \"Think To Die\" it`s exactly the other way round. If you love puzzles, classic and old-fashioned entertaining games, then this might be one you would enjoy a lot.\nThe game itself was inspired by the Karoshi Series, adding new puzzle mechanics, interesting puzzles and a lot of new features.\nFeatures    Over 145 levels\nHappy, not distracting background music\nOption to enable/disable Cartoon-Look\nFrom very easy to very hard levels!\nNew and original game idea\nFast gameplay\nAuto Save\nOption to skip any level you want\n100% free to play and no extra content DLCs or ingame purchases\nSingle-Player only\n100% playable offline\nMultiple music tracks to prevent boring repetitions\nAnd much much more...\nControl-Keys:F10 skips a level\nF8 flips camera\n\"C\" changes player\n\"R\" restarts level\n\"H\" changes camera perspective\n\"P\" pauses the game \"F1\"enables/disables performance profiler\n---------\n----------","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Felip Guimerà","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":14478,"name":"Delicious! Pretty Girls Mahjong Solitaire","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/78c/78cff20cad3505a96f3939eb5ab572eb.jpg","description":"The Pretty Girls are back and they're delicious! Check out an upgraded version of Zoo's top selling Pretty Girls Mahjong Solitaire with 8 new girls and a new candy flavored theme. Match pairs to reveal a Pretty Girl in a sexy outfit hiding beneath the mahjong tiles. Do you have what it takes to clear all the tiles for your Pretty Girl surprise?!\n■ Classic Mahjong Solitaire rules\nFind pairs of tiles to delete them.\nDelete all tiles before time runs out to clear a round.\nThink strategically when deleting tiles, or you might run into a dead end!\n100 patterns of tiles.\nThe tiles get shuffled every time you play, making it fun to play again and again.\n■ Pretty Girls are waiting for you!\nThe game contains 7 Pretty Girl characters and a bonus character when you complete all stages. In each stage, once you make it to the third round a girl in a sexy costume begins to reveal herself as you delete tiles. As you clear stages, the girls get more and more delicious!\nAll characters include sexy voices in Japanese.\n*This game is a character and theme replaced version of \"Pretty Girls Mahjong Solitaire\".\n*This is a puzzle game with sexy characters but no nudity.\n*Characters and character images used under license from their respective owners.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Zoo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PlayStation 4"}]},{"id":14168,"name":"Flat Kingdom Paper's Cut Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d45/d45b24cb1d9bffd2e2fb51da30c74a2d.jpg","description":"A STORY ABOUT DIMENSIONS, SHAPES AND JEWELS\nAccording to the Flat Kingdom’s legends, the world was once filled with malice and chaos because the 3D realm dominated all. But one day, a wise sorcerer created six Magical Jewels that kept the effects of the third dimension at bay, granting peace and prosperity to the beautiful 2D world.\nHowever, one day an evil masked thief named Hex stole one of those Jewels and kidnapped the princess. This disrupted the balance and made the chaos return.\nThe king of Flat Kingdom knew there was only one being able to save their land: Flat, the little shapeshifting hero! With his unique abilities, he’s not only able to change his shape, but is also the only one in the kingdom capable of withstanding the 3D chaos.\nNow the time has come. Flat must use his incredible powers to save the world and restore the Flat Kingdom to its former glory. Will he be able to stop Hex before it’s too late?GAMEPLAY\nFlat Kingdom is filled with fun platforming action, puzzles and some Metroidvania elements. It also features a unique combat system! Instead of directly attacking your foes, you’ll have to touch them while transformed in the correct shape to beat them! Kinda like a rock-paper-scissor game.\nEvery shape in Flat Kingdom beats the opposite, so sharp triangles can defeat the soft circles, heavy squares beat the fragile triangles and squishy circles can triumph over the slow squares. Both enemies and puzzles can be beaten using the correct shape and strategy, so you'll have to observe them and come up with the best solution.\nYou can also learn new abilities along the way that will help you solve even more puzzles, beat enemies faster and reach new areas that were inaccessible to you before!FEATURES\nJump into a beautiful papercraft world, filled with details and references to classic games.\nTest your might with epic and challenging battles against giant bosses.\nUncover all of the game’s secrets! There are side quests, upgrades and all kinds of surprises.\nLearn all about the kingdom’s lore and history by finding hidden scrolls.\nMusic by legendary composer Manami Matsumae! (Mega Man, Shovel Knight).","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Fat Panda Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":13714,"name":"The Ship: Remasted","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee7/ee743b7bb0058fcd4a2ce74309234a15.jpg","description":"Buy The Ship: Remasted and get The Ship: Murder Party FREE!You’ll now get The Ship: Murder Party for FREE when you buy, or own The Ship: Remasted. Oh buoy, what a deal! For those of you that already own The Ship: Remasted, make sure to update the game in your Steam Library to get access. Happy hunting!\n*Please be aware that this is a non-giftable copy. It will be added to your library.\nNow Includes World Leaders!Not only can you play with the original world leaders such as Thatcher, Castro, Blair and Bush from The Ship: Murder Party, but we’ve added two more potential leaders to the mix - Hillary Clinton and Donald Trump. So whether you’re with Hillary or believe Trump can’t be stumped, take up arms and prove who’s the real captain of this ship!\nThe World Leaders is a FREE add-on that is included in the June 30th update.\nAbout the GameThe Ship: Remasted is a remake of the classic 2006 game, The Ship: Murder Party.\nYou find yourself aboard a series of luxury 1920s cruise ships – a guest of the mysterious Mr X who has engineered your presence on board to take part in a murderous game. You and your fellow passengers will be assigned a target to kill and must do so before your own hunter tracks you down. Armed with a wide array of weapons and traps, use all of your cunning and skill to dispatch your unsuspecting target and avoid sleeping with the fishes.\nAll aboard and enjoy the cruise.\nDedicated servers (16 players) are live! LAN (16 Players) and Listen Servers (8 players) are also available to set up.  Please read our FAQs in the Steam discussion forums before you buy.\nYou can find our Development Roadmap here and it is updated frequently.  We'll also be posting regular updates here on Steam and on our blog.  Players can expect to see game updates once or twice a month at least, with the option to opt-in to test builds to check out new content and features before they go live.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Blazing Griffin","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":13013,"name":"Scott in Space","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ec4/ec444f7a03fb52120332c3dc5fe78bb1.jpg","description":"Picture this. One guniea pig alone in the vastness of space, fighting an empire of evil Rhinos. Sure, that's pretty unfair...the Rhinos don't stand a chance!\nScott in Space is a stylized platformer with a classic gameplay core, plenty of different enemies to defeat and quests to fulfill. Can you stop the evil Rhino Empire from abducting guinea pigs from their home world New New Guinea? Can you defeat the dark rhino leader named... Evil Andy?! Can you make it home before dinner? So many questions and so little time!\nIf you like the light-weight sphere of classic family platformers and you love helping little guinea pigs in space out from time to time (an uncommon hobby), then Scott in Space is the right game for you!\nWhile the easier difficulty modes satisfy beginners and casual players, the hard and the evil difficutly mode confidently challenge hardcore players.\nScott in Space is the debut indie title developed by Ragiva Games. The design team of this game is a group of three indie devs with experience from the games industry who decided to go their own way.\nFEATURES\n- Prove your guniea pig platformer skills (you have them, right?)\n- Fulfill quests for questionable characters\n- Enjoy a dead-serious story with non-existent rodent-rhino war humor\n- Explore over 50 levels across 7 planets\n- Sing along to the orchestral soundtrack (or just listen while playing, your call!)","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ragiva Games e.K.","platforms":[{"id":0,"name":"PC"}]},{"id":11896,"name":"Ryzom","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/351/3514439c3386b40a5a4b7026b18cbbaa.jpg","description":"Steam GreenlightRyzom warmly thanks the Steam community, whose votes allowed it to be greenlighted so quickly.\nSubscriptionA few years ago WinchGate, owner of Ryzom, chose to open the game to the world for Free, releasing its code and to be the only open source MMORPG, playable on Windows, Linux and Mac.\nHowever, maintaining Ryzom does involve costs, such as compensation for the small team of employees and payment for servers. That is why, even though Ryzom is playable as Free to Play, subscriptions are vital for it to continue.\nTo thank the players chosing to subscribe, certain features of the game are unlocked and certain bonuses are offered to them; an opportunity to level their characters to level 250 instead of 125, doubling all experience points gained, and access to several other means of storage.\nTo help Ryzom, make the choice to subscribe!\nContributionYou can contribute to Ryzom :\nCode: Ryzom Core\nContent: Ryzom Forge\nLore: Ryzom Lore Wiki\nArtworks, Fan Art: Graphic Creations\nWritten Creations\nVideo Creations\nMusic Creations\nAbout the GameEnter a unique science fantasy MMORPG and dive into a unique organic living world !OpensourceRyzom is one of only a few commercial-grade MMORPGs that are fully open source: client, server, tools, and media. Being open source means that Ryzom draws on a vibrant community providing fixes and functionality above and beyond that of what the team can provide. It offers players a unique opportunity to become involved in the development of the game.SandboxFar from being a frozen world, Ryzom is constantly evolving in regard to your actions. Will you spark another war? Will you found a lucrative commercial guild or aim for political power? What if your hunting talents could be decisive in the struggle against Kitins?\nPick your actions well, for each one of them may impact the world and its inhabitants!ClasslessRyzom characters are unusual in that they are not bound to a class. That means you don't have to choose between being a warrior, a mage, a harvester or a crafter. You can improve your skills in all these classes with only one character; you do not need to focus on one path. For example, you can, at your leisure, either train your pike handling, put on your magic amplifiers to heal or cast offensive spells, pick up your pickaxe and harvest materials, or go into crafting a new armor or weapon.\nYou have absolute freedom!RoleplayRyzom offers official interactive events (with live NPC's), regular and varied, that evolve according to your actions. Nothing is preordained!\nWould you like to create your own event? The Animation Team is always at your disposal and will gladly support and assist in logistics.\nIn addition, many guilds are prepared to open their doors to help your character evolve!\nFor lovers of imaginary languages, the players and Animation Team have created unique languages. Roleplay immersion guaranteed!InvasionsPicture yourself, in front of a city gate, looking at a far hill and sighting the scouts of a Kitin swarm. Now picture hundreds of Kitins following them, moving like a united and swarming army. Huge battles call for the cooperation of a great part of the community to counter these threatening invasions. And what if, one day, the Kitin were to win again, threatening hominity for the third time?Consensual PVPYou can fight everywhere, but only when you wish to do so. Duels, outposts battles, faction of region fights... You are free to engage in them... or abstain!Advanced Forage & HarvestRyzom features an advanced havesting and crafting system.\nHarvesting - allows you to dig materials from the ground depending on season and weather and your skill. It's not so simple once predators get involved!\nCrafting - Careful combination of materials depending on their characteristics and colors, allows production of unique weapons and armors. Thousands of recipes are possible.Living mobsA powerful A.I. system allows for a realistic wildlife behavior: carnivores attack herbivorous herds, realistic and dynamic animal motions make them lively, sometimes endearing, other times worrisome. There are also mass migrations on season changes and different behavior for different species. Take your time to sit and observe the life around you, it's an unforgettable view. But be careful of predators!Dynamic environmentRyzom is a 3D persistent world consisting of five lush and varied ecosystems. Landscape, wildlife behavior and ground material availability all change according to season, weather and time.\nDiscover the beauty of the Forest in the spring, do battle in the Jungle in a rainstorm under a summer sky streaked with lightning, lose yourself in the dunes of the Desert in the fall, or relax enjoying the reflections of a winter sun on the pure water of the Lakes.Full character customizationEntirely customizable character appearance upon creation: shape your avatar the way you like it!","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Winch Gate Property","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":333,"name":"Typoman","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/72e/72e748ad13fa3ab29d297bdb8be51fb1.jpg","description":"Typoman is a puzzle platformer. You slip into the role of a character made of letters, struggling to make your way through a dark and hostile world. Despite your small stature you have a powerful gift: You can craft words which will have an effect on the environment. But choose your words wisely - they can either be a blessing... or a curse!Game featuresWield the power of altering the world by creating, changing or destroying words\nSolve ingenious and challenging puzzles with a unique aesthetic mix of typography and pen & ink graphics\nCaptivating, carefully drafted, on-the-fly told story using witty word puzzles and puns\nSurreal, atmospheric game world\nFeaturing Steam Trading Cards, Badges, Leaderboards and Achievements\nDistinct soundtrack specifically composed for the gameAwards & RecognitionFeatured at Indie Game Revolution, EMP Museum, Seattle\nBeste Inszenierung / Best Production, German Video Game Awards 2016, Munich\nFinalist Indie Prize 2016 Showcase, Casual Connect Europe 2016, Amsterdam\nBest Casual Game, Game Connection Development Awards 2015, San Francisco\nNominee for Best Game, Best Indie Game, Best Sound, Best Game Design, Best Console Game, German Dev Awards 2015, Cologne\nWinner Best Art Style, Gaming Trend's Best of E3 2015 Awards, Los Angeles\nWinner Best of Quo Vadis 2015 (Sponsored by Google), Best of Quo Vadis Show, Berlin\nNominee Best Indie Game, gamescom award 2015, Cologne\nNVIDIA Accredited Partner","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Brainseed Factory","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":677164,"name":"Grand Theft Auto: The Trilogy – The Definitive Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/051/0518bc19ba710a13d58620723ef8b3f7.jpg","description":"Three iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant new lighting and environmental upgrades, with high-resolution textures, increased draw distances, Grand Theft Auto V-style controls and targeting, and much more, bringing these beloved worlds to life with all new levels of detail.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Grove Street Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":511723,"name":"Dead Estate","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/720/720ae319ecf9833b59f06e6dbd96fc46.jpg","description":"Can you survive?\nDead Estate is a gory, fast-paced, challenging, roguelike shooter, with a heavy emphasis on Halloween and other horror influences. Ascend the floors of a monster-filled mansion with 8 unique characters and collect loads of items and weapons, tackle grueling challenges, and discover many secrets and unlockables along the way.\nBeware of the lurking threats on every floor -- some of them are especially persistent...\nLoads of content, challenges, and procedural generation\nto keep the game endlessly replayable!\n8 playable characters, each with distinct playstyles and an alternate costume\nOver 50 weapons, and 150 items to make each run unique\nExplore the vast complexity of the Estate, complete with alternate floors\nAn isometric style, with compact room designs for tense, close-quarters combat\nOptional Challenges to keep you on your toes\nDifficulty levels, Looped runs, and other modes\nA bounty of secrets to be discovered, and many more to be unlocked\nController support included, but keyboard + mouse is recommended for the best experience.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Milkbar Lads","platforms":[{"id":0,"name":"Web"},{"id":0,"name":"PC"}]},{"id":471034,"name":"Captain Tsubasa: Rise of New Champions","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/338/338b02e34dd8d8c83e8d950c2081e3e2.jpg","description":"Captain Tsubasa: Rise of New Champions, based on the globally beloved anime series, is an action soccer game featuring the latest graphics and super plays anyone can enjoy.\nGet a real taste for the world of Captain Tsubasa through two story modes! To savor the drama alongside the action in Captain Tsubasa, we've prepared Episode: Tsubasa, a story mode where you can experience the events as seen in the anime. Additionally, become a part of the world of Captain Tsubasa, as you play through Episode: New Hero, an original story mode found in this game.\nOffline multiplayer (2-4 players)\nOnline multiplayer (2-4 players). A paid-for PlayStation Plus membership is required. Online features require an account and are subject to our terms of service (playstationnetwork.com/terms-of-service), our privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nUses DUALSHOCK 4 vibration function\nPS4 game can be controlled via PS Vita\nEnhanced game play on PS4 Pro console\nOptional In-game purchases\nOnline features require an account and are subject to terms of service (playstationnetwork.com/terms-of-service), privacy policy (playstationnetwork.com/privacy-policy), and the game publisher’s privacy policy.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\nSoftware subject to license (us.playstation.com/softwarelicense).\nOne-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":385406,"name":"Dark Souls III: The Ringed City","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25a/25a2a77f6feb0b14bcb0847ed966db20.jpg","description":"Fear not, the dark, ashen one.  <br/>\r\nThe Ringed City is the final DLC pack for Dark Souls III – an award-winning, genre-defining Golden Joystick Awards 2016 Game of the year RPG.  Journey to the world’s end to search for the Ringed City and encounter new lands, new bosses, new enemies with new armor, magic and items.  Experience the epic final chapter of a dark world that could only be created by the mind of Hidetaka Miyazaki.       <br/>\r\nA New World.  One Last Journey.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"FromSoftware","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":349591,"name":"Rogue Glitch","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d0a/d0a0379fa613c53c6d8c6e86b7433e2e.jpg","description":"OverviewRogue Glitch is a platformer's paradise within a roguelite world of procedurally generated levels and arrays of enemies. Develop your character each run with random items ranging from incremental stat modifiers to lethal showers of bullets. Expand your arsenal to include the full range of items Rogue Glitch has to offer by leveling up; then crush bosses to access unique glitched versions of your former self.\nPlay solo or up to four players to conquer the glitchworld.FeaturesSolo play and online/local co-op\nMore than 80 unique items to collected\nSeven character variants each with upgrading stats and skins\nA narrative told through completion events\nFour difficulties to challenge you and your friendsMovementFluid movement is the core component to making a platforming focused roguelite. Auto-targeting projectiles will fire as you remain within proximity of enemies and a downward stomp allows you increase your damage output. Learn the different enemy types and behaviours to achieve a devastating finesse in combat.ProgressionRogue Glitch is packed with unlockable items, characters and cosmetics to make every run a worthwhile one. Experience is awarded based on performance which will provide random item unlocks on level-ups. Bosses drop a currency called Malbytes which can be used to upgrade your existing characters into more powerful evolutions. Finally, each completion of a run will progress the story with a mysterious lovable villain, earning the new character variants.StoryYou were once a regular platforming character, running, jumping and shooting in your little 2D world. However things are starting to get weird. Your levels are being scrambled, pick-ups modified, and enemies mutating, The origins of these happenings are unclear but you are curious enough to proceed deeper into the unknown. You meet an ominous being who wants to make a deal...The FutureRogue Glitch was created for quick iteration and evolution. More items and characters are already on the way but we're excited to hear your ideas for glitched entities to distort your game. Leave your suggestions in the Community Hub to help evolve Rogue Glitch throughout 2019. For more information on Early Access, read above this section.","review":"","timePlayed":0.0,"releaseYear":-1,"developer":"Lino Slahuschek","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":304329,"name":"Xeno Crisis","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/8e2/8e21d6a63de3d6f582a076e767634751.jpg","description":"A port of the successfully crowdfunded Sega Mega Drive / Genesis title, Xeno Crisis is an arena shooter that can be played solo or in local co-op mode. Take control of battle-hardened marines embarking on a deadly mission to confront an alien menace and get home alive! Run and gun your way through thousands of adversaries as you explore the devastated research outpost, searching for survivors, and ultimately facing the origin of the outpost's demise.\nOutpost 88 is divided into seven distinct areas, each being randomly generated with each play, meaning that your strategy must evolve on the fly if you're to succeed in your mission. Collect dog-tags from vanquished enemies to upgrade your equipment between areas and look out for special weapons which will give you a momentary advantage.\nThere are several weapons at your disposal, each with their own characteristics. Although your standard issue pulse rifle is perfectly capable of taking on the enemy, other weapons can give you advantages in certain situations, so picking them up is generally advisable - just don't run out of ammo!\nAs you progress through the colony you will come across many different enemies, each with their own traits and means of attack. Many of them can be gunned down without too much thought, but others will require the player to outflank them, attack them within a certain time window, or be avoided altogether!\nAt the end of each area you will be given the chance to exchange any dog-tags you've collected for upgrades ranging from extra health to weapon power-ups to extra continues. Which upgrades you go for will depend on your style of play.\n* A faithful port of the hit 16 bit game with added extras.\n* Incredible pixel art from the legendary pixel artist, Henk Nieborg.\n* Intense FM chiptune soundtrack by Savaged Regime, originally created for the YM2612!\n* Two difficulty levels and three modes of play.\n* Seven varied areas to traverse.\n* Many different enemies to tackle.\n* An arsenal of 10 weapons to master.\n* Upgrade system allows you to change your tactics each playthrough.\n* Play solo or local co-op with a friend! (2 player requires at least one controller)","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Bitmap Bureau","platforms":[{"id":0,"name":"Genesis"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]}]