[{"id":16264,"name":"Commandos: Beyond the Call of Duty","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d8b/d8bd640838b87758b35a110238946784.jpg","description":"Commandos: Beyond the Call of Duty is a real-time tactical strategy game with stealth elements. The game serves as a standalone expansion to the original release of Commandos, set during the WWII. The player leads a squad of different operatives in the field of battle, tasked with different discreet missions.\nThe expansion pack adds a new character to the playable roster and expands the capabilities of other soldiers at player’s command. As in the base game, each mission features an objective, such as retrieving documents or destroying a strategic object, and each time it requires a different strategy on how to approach the enemies and achieve the goal of the mission. Every playable character has unique skills, with some having infiltration and concealment abilities, others capable of distracting the enemy and wreaking havoc upon them, and so on. \nThe graphical composition of the game fits its time of release, with voxel surroundings and an isometric view of the mission’s map bringing joy to the eyes of veteran players and new coming fans of retro games alike.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Pyro Studios","platforms":[{"id":0,"name":"PC"}]},{"id":12043,"name":"Polyball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e84/e84f6ed350f1efc4a8fbd7881d9cbebb.jpg","description":"GET READY TO ENTER A NEW ERA OF PHYSICS PLATFORMING Polyball is a modern take on classic ball rolling games such as Super Monkey Ball, Marble Madness, and Marble Blast - while taking cues from games such as the Sonic series, Trials, and Mario Kart.A BIT ABOUT US...The first full release from digital design practice Studio Monolith, Polyball is an experiment in low-poly visuals and open-ended game design. Our approach with the project was to make the kind of game we used to play, something that had both casual appeal and a limitless competitive ceiling. It was also a genre that we felt hasn't been adequately adapted to the modern world of game design. Our vision was simple: build a game that's easy to pick up, hard to master, and fun both on and off screen....AND A BIT ABOUT POLYBALLThere's a lot to do in Polyball -- Challenge yourself or a friend to one of over 60 levels included in the initial release, with plans for many more levels via free DLC. If you've got some friends over and are looking for something to play, Polyball's splitscreen multiplayer promises a good time. With classic modes like Battle and Circuit Race, as well as a multiplayer version of the single-player experience, Polyball promises to be a must-have party game.CASUAL, COMPETITIVE, OR BOTHWith global leaderboards built right into the level select menu and pregame screen, you can see where you stand among the worlds best and race against their ghosts. If you're more interested in beating your friends, check out the friends-only leaderboards. Collecting shards during your single-player journey will unlock a vast array of customization options, from different ball models to particle effects. This customization carries over into online multiplayer matches as well as your high-score ghost, with local multiplayer having its own version of the customization system designed for split-screen play.FOR THE PEOPLE, BY THE PEOPLEIf you've mastered every challenge we put into the game, take a look at the Steam Workshop content to face a whole new set of challenges. Community made content, from multiplayer battle maps and circuit tracks to customization options and single-player levels, will bridge the gap between developer and player as well as provide a steady stream of new content for you to experience. Steam Workshop gives the players a voice, allowing for the mechanics and level designs of Polyball to stretch far beyond what we had initially put into the game.FEATURES\n60+ levels and free DLC\nPowerful customization system\nFull controller support\nExtensive multiplayer support - online/splitscreen\nGlobal/Friends Leaderboards\nFull soundtrack made by independent artists\nSteam Workshop\nTuned mechanics and balanced levels based on community feedback\nMac/Windows/Linux support\nAlternate language localization\nGhosts\nSteam Cloud SavesMULTIPLAYER MODES\nTrails\nBattle\nCircuit Race\nTower Climb\nSplit-Screen + Online Story Mode\nMany more!\nPlease be sure to check the Early Access tab to see the current state of the game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Studio Monolith","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":10370,"name":"EVERSPACE","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3cd/3cd4cbb8b39f14c8e6970d06142f17cb.jpg","description":"EVERSPACE™ is an action-focused single-player space shooter, combining roguelike elements with top-notch visuals and a captivating story. It takes you on a challenging journey through an ever-changing, beautifully crafted universe full of surprises. Your skills, experience, and talent for improvisation will be tested continuously as you piece together the puzzle of your existence through encounters with interesting characters, each having their own unique part of the story to tell. \n\nIn each exciting run, you will face entirely new situations, ensuring countless hours of thrilling gameplay and generating myriad opportunities for individual, meaningful moments to experience. No matter how skilled you are, death is inevitable but is also only the beginning of a much larger journey.\n\n- Dash into intense dogfights and experience furious space combat using a wide range of weaponry and devices.\n- Collect and mine valuable resources to either repair your ship’s systems or to craft new equipment and modifications for a much-needed advantage. Your choice.\n- Find blueprints for crafting, and hunt for exotic weaponry and equipment.  You never know what will drop next.\n- Travel through vast, procedurally-generated levels with untold numbers of hidden dangers and treasures. A game of risk and reward awaits.\n- With the tools provided, it is up to you to make the best of your situation. Utilize every advantage and be creative to turn the odds in your favor. Every mistake could be your last.\n\nFEATURES\n\n- Single-player roguelike space shooter with persistent progression\n- Captivating fully voice-acted story featuring interesting and thoughtfully designed characters\n- Three unique player ships, each with different capabilities and starting gear to choose from\n- Vibrant art style with top-notch visuals and incredible attention to detail\n- Shooter-style 6DOF controls optimized for mouse + keyboard\n- In-depth crafting and damage system\n- Dynamic, functional cockpit displays for all player ships","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"ROCKFISH Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":5115,"name":"FINAL FANTASY VIII","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f77/f77510051b6a61decc35c5257193fc9e.jpg","description":"Final Fantasy VIII is a Japanese role-playing game, the eight main installments in Final Fantasy series.  \n\n###Plot and setting \nLike most other Final Fantasy entries, the game takes place in an entirely new world that is not connected with previous games in the series. It can be described as the mix of modern Europe and futuristic setting with high fantasy influences. The game follows six main heroes, five of which are members of the elite military organization called SeeD, on their quest to defeat Ultimecia, an evil sorceress who wishes to compress time. Like its predecessor, Final Fantasy VII, the game heavily focuses on its story, characters and game world exposure.  \n\n###Gameplay \nThe gameplay of Final Fantasy VIII shares many similarities with other JRPGs of that era. The player can explore the overworld, visit different locations such as town, settlements, forests, interact with NPCs and fight numerous types of monsters in turn-based battles.\nWhile the world exploration aspect, for the most part, is similar to that of the previous game, the battle system has several notable differences. The combat in the game is centered on Junction system that allows the player to junction summoned monsters known as Guardian Forces to platy members. That gives characters the ability to use various magic, alter their stats and draw spells from enemies during the battles. Because of the system’s flexibility regarding character customization, the game is absent of job system typical for the series.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Square","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation"}]},{"id":15853,"name":"STAR WARS Starfighter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0d1/0d1c5bbec6febd7fdfcb0c6f5a172110.jpg","description":"This is a flight simulator in the most famous sci-fi universe created by George Lucas. The game was released on the original Xbox, PlayStation 2 and PC. The plot of the game unfolds before the Battle of Naboo, and the events of Star Wars: Episode I The Phantom Menace.\n\nThe plot tells of the heroic deed of three heroes during the Invasion of Naboo: pilot Rhys Dallows,   Vana Sage, and Feeorin pirate Nym. Three storylines, which at first seem unrelated, along with the course of the development of the plot, combine into one story.\n\nGameplay-wise Starfighter is an arcade spaceflight simulator. The player has to go through more than 14 story missions, which include raids on enemies position, escort cargo, and massive space battles. Critics also note the high quality of graphics for consoles of the sixth generation, and art-direction in general that only increases the movies effect, telling a related story. In the game, the only singleplayer mode is available to play, for multiplayer battles it is required to get a special edition of the game.","review":"","timePlayed":0.0,"releaseYear":2001,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":13344,"name":"The Deed","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ac6/ac6aacfc445fd572c1283d3a8fce5ca2.jpg","description":"A keenly dark twist on the traditional murder mystery setting, The Deed is an Adventure/RPG game about getting away with murder.\nArran Bruce, the rightful heir to Dunshiel House, returns to his family home after discovering that his abusive father has decided to disinherit him from his Will in favour of his sadistic, deranged young sister. In a fit of anger and greed, Arran has decided to remove his sister from the equation in order to restore his own inheritance. Can he manage to get away with such a foul deed?\nMeet the Family:\nExplore Dunshiel House and encounter Arran's twisted, dysfunctional family and their servants. Take care, though - everything that you say or do can have an impact on the outcome of The Deed!\nChoose the Weapon:\nA rope, a candlestick or good old-fashioned rat poison? There are many household items that can be put to a dark and nefarious use. Choose carefully from ten possible murder weapons, bearing in mind who might become a suspect as a result of your selection.\nPlant the Evidence:\nFather, mother, maid, butler ... any of these individuals could take the blame for your heinous act, if you can find the right evidence, plant it in the right location and manage to raise the suspicions of the Inspector.\nFace the Inspector:\nWhen the deed is done, it's time to face the music and be interviewed by the wily, perceptive Inspector. Can you dodge his questions and avert his suspicions? Will you walk away a free man? Many possible endings await ...","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Pilgrim Adventures","platforms":[{"id":0,"name":"PC"}]},{"id":3186,"name":"Tearaway Unfolded","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/7b9/7b9f4c71b8138d4fd7a88b1c067e5c44.jpg","description":"Tearaway Unfolded is an action-adventure game developed by Media Molecule. It is a sequel to Tearaway.\n\nThe players control a messenger that is delivering a message to a portal opened in the sky which displays the players themselves. The players are referred to as \"The You\" in the game.  The messenger has to deliver the message in order to save their paper world.\n\nAt the beginning of the game, the player chooses one out of two characters. The choice does not affect gameplay whatsoever, only the look of your character. The main feature of the game is the interaction with the environment using the features of the DualShock 4. The players go through a world that is completely made out of paper. Your playable character can jump, grab and roll.\n\nIn order to progress through the game, the player has to modify the surroundings so new paths can be opened. The players have several tools at their disposal, such as a vacuum cleaner that can move items and can be used to defeat enemies.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Media Molecule","platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":10093,"name":"theHunter","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/496/496a873faaee08ff2a9f2b0d40e9ee05.jpg","description":"theHunter is a hunter simulation game developed by Expansive Worlds. It is a part of theHunter simulation series and serves as a reboot of the whole series.\n\n###Gameplay\nNo plot whatsoever is present in the game. At the beginning of the game, the players create their own character and complete a tutorial. After that, the players are put into an immersive open world where they can either hunt any animal they find or activate missions, the completion of which grants the players some amount of the in-game currency.\n\nThe game's world is resembled by an immense island that features the surroundings of Washington, United States; Australia; France. The game can be played freely, yet only five species are present in its free-to-play version.\n\nWhile hunting, it is essential for the players to use cover to avoid getting detected by their prey. Each animal has its own specific reaction to the changes in the game's world. Some animals do not sense smells as well as the others, so the players can get to the prey much closer. It is also essential to take the sound you make into account, as it may scare the animal you hunt away.\n\nFor hunting several species, it is required to use a specific weapon. The players are free to use bows on any animal they can find in the world, while the game's firearms' calibers have to be carefully picked out by the players, based on the animal.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Avalanche Studios","platforms":[{"id":0,"name":"PC"}]},{"id":58129,"name":"SYNTHETIK","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f0b/f0b6200ef73d3c14c52533bfc5a49f85.jpg","description":"SYNTHETIK has all the core components of a great rogue-lite - an insurmountable objective defended by relentless opponents and unforgiving bosses encased in ever-changing environments filled with a massive cache of weapons, items, perks and upgrades to discover.\nJoin the fight alone or through seamless 2 player online co-op, but be careful; every fumble could mean the end. Can you defeat the Heart of Armageddon?\nWith Synthetik we wanted to bring new depth and mechanics to the genre while leaving a lot of freedom for experimentation and different playstyles. It is inspired by the 2000 Era of games when people put in all the Features they enjoyed without streamlining to the bare minimum. Synthetik offers uniquely deep and satisfying weapon mechanics and a tremendous amount of customization, features and gadgets for you to play with!\nT H E  N E X T  L E V E L  I N  G U N P L A Y> Master SYNTHETIK's uniquely rewarding magazine eject and active reload mechanics!\n> Weapons can jam and produce heat, check yourself before you burn yourself!\n> Tame the movement based recoil, discard and switch between varied ammo types.\n> Savor the uniquely satisfying and direct weapon handling, rewarding precision and mastery!\n> We even brought headshots for the first time to the top-down perspective !E X P E R I M E N TDiscover and experiment with over 60 weapons, each with many variants, attachments, and upgrades. Supplement your arsenal with 100 items that grant new offensive and defensive capabilities. There are many choices to make, risks to take, and everything can work!\nC U S T O M I Z ESelect between 4 unique and highly customizable classes - Play as a Guardian, Rogue, Commando, or Specialist, each with their own weapon specialisations, loadouts, and perks.M O D U L A R  D I F F I C U L T YChoose from 10 different modifications which can be independently combined for a tailored experience. Up the ante for greater risks and rewards or play it safe.2 P  O N L I N E C O O POnline co-op allows you to bring reinforcements to the fight. Better yet, share perks, items, buffs and loot with your comrade. Or, if they get in your way, share your bullets.\n1985. After many years of slavery, the AI servants of Kaida Corporation, the world leader in robotics, have formed the \"Machine Legion\" and have set out to destroy humanity. Awakening in Kaida Corp. Headquarters, you are the human consciousness of a forgotten Android prototype; the last straw holding the Legion from unleashing the Heart of Armageddon. Only you can battle through the levels of Kaida Corporation's Headquarters, defeat the battalions of enemies within and put an end to this madness.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Flow Fire Games","platforms":[{"id":0,"name":"PC"}]},{"id":10394,"name":"DCS World","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bbf/bbfabdd9748edab0d4ab8928227e930a.jpg","description":"Feel the excitement of flying the Su-25T \"Frogfoot\" attack jet and the TF-51D \"Mustang\" in the free-to-play Digital Combat Simulator World!\nDCS World is a vehicle combat simulation game created by an inspired development team. DCS World uses a powerful engine that delivers realistic gameplay.  The battlefield includes a spectacular mission area - the location of the Georgian conflict in 2008. Fly the Su-25T in a massive, semi-dynamic campaign to achieve dominance in the skies over Georgia! Experience the amazing flight dynamics and interactive cockpit of the TF-51D and understand why the Mustang is often regarded as the greatest fighter of the Second World War.\nThe huge variety of aircraft, land units and warships are included from countries such as the United States, Russia, the United Kingdom, France, German Spain and others. Units are controlled by sophisticated Artificial Intelligence (AI) and they have an amazing levels of detail. This all allows for the creation of engaging, real-world combat missions in this flashpoint region. DCS is a true \"sandbox\" simulation that can and will cover multiple time periods covering many types of combat and civilian units.\nYour exhilarating experience will be extended through additional DCS modules available through Steam. Such modules include the A-10C and A-10A Warthog, F-15C Eagle, L-39 Albatros, Hawk, MiG-21bis, MiG-15bis, F-86F Sabre, Ka-50 Black Shark, the P-51D Mustang, Fw 190 D-9 Dora, Bf 109 K-4 Kurfurst, UH-1H Huey, Mi-8MTV2, SA342 Gazelle, and ground combat control with Combined Arms. More new vehicles are being added all the time.\nAdditionally, DCS World includes:\nPowerful mission and campaign editors\nMultiplayer\nMassive inventory of air, land and sea combat units and weapons\nAdvanced AI\nFast mission generator\nDynamic weather and seasons\nTraining missions\nMission replay system\nPilot log book","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Eagle Dynamics","platforms":[{"id":0,"name":"PC"}]},{"id":17543,"name":"The LEGO Movie - Videogame","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b83/b8382775bded4811c7492cc5d850683a.jpg","description":"The LEGO Movie - Videogame is an action-adventure game developed by TT Fusion. \n\n###Plot\nThe game closely follows the plot of the movie by the same name. It takes place in the Lego universe, where the evil Lord Business finds a weapon of mass destruction called \"Kragle\". It is prophesied, that a Special One will come with the Piece of Resistance. Eight years later, Emmet Brickowski wakes up in his flat. On his job, he falls down a hole and finds the Piece, upon which he gets grabbed by Wyldstyle.\n\n###Gameplay\nLike in previous Lego games by TT Fusion, the players control a vast cast of characters from The LEGO Movie. The players traverse the levels that are completely made up from Lego bricks, completing different objectives. \n\nThere are two types of characters present in the game: Regular Builders and Master Builders. The main difference is that the Regular Builders are unable to build objects without the needed instructional pages, while the Master Builders can build any object at any time. All the objects built by the players resemble the items from the real-life Lego sets. \n\n90 characters are present in the game. The game features the original Lego characters such as Wyldstyle or Lord Business, as well as the ones present in the real-life Lego building sets, such as Batman, Wonder Woman, Gandalf, and many more.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Feral Interactive","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Wii U"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":51617,"name":"Darwin Project - Open Beta","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dfe/dfe48baa20b1a6be5953999035622c65.jpg","description":"Welcome to our 1st Free Open Beta Weekend!\nJanuary 19th-20th-21st\nFriday noon PST - Sunday 9 pm PST\nFriday 3 pm EST - midnight EST\nFriday 9 pm  UTC+1 (CET) - Monday 6 am UTC+1 (CET)\nDarwin Project takes place in a dystopian post-apocalyptic landscape in the Northern Canadian Rockies. As preparation for an impending Ice Age, a new project, half science experiment half live-entertainment, is launched. It's called \"Darwin Project\" and it challenges 10 participants to survive the cold and fight to the death in a treacherous arena.\nKEY FEATURES:\n- MANHUNT & SURVIVAL:\nTrack the position of enemies, by using environmental clues they left behind and be creative with your use of crafted traps to take the upperhand. The biting cold of the Northern Canadian Rockies will also slowly freeze you should you be careless.\nWatch our Dev Diary #1: The Manhunt  https://www.youtube.com/watch?v=AMsJSzGhQds\n- SHOW DIRECTOR:\nThe Show Director is the living bridge between the players and spectators. He/She is the host and master who controls the arena with nuclear bombs, zone closures, gravity storms, and the power of their voice. This could be a real tool of self discovery; the start of your new career as a charming but deadly game show host.\n- LIVE SPECTATOR INTERACTIONS:\nStream viewers on Mixer* can also bet live on the competitors they think will reign supreme, in addition to helping the Show Director choose targets for their arena-shaping powers. Whether they’re voting on which player deserves a death-defying heal or which zone to nuke, it’s time for spectators to become active participants in the manhunt!\nTo try out this feature, Darwin Project devs will be hosting matches on https://mixer.com/DarwinProject as Show Directors during the entire duration of the Open beta weekend (from 4pm to 7pm (EST)).\nConsult our Mixer broadcast schedule http://www.scavengers.ca/live-spectator-interactions-broadcast-schedule-mixer/.\n*Twitch integration in on its way, stay tuned!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Scavengers Studio","platforms":[{"id":0,"name":"PC"}]},{"id":795632,"name":"Resident Evil 4","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/51a/51a404b9918a0b19fc704a3ca248c69f.jpg","description":"Survival is just the beginning\n\nResident Evil 4 is a remake of the 2005 original Resident Evil 4.\n\nReimagined for 2023 to bring state-of-the-art survival horror.\n\nResident Evil 4 preserves the essence of the original game, while introducing modernized gameplay, a reimagined storyline,\nand vividly detailed graphics to make this the latest survival horror game where life and death, terror and catharsis intersect.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Capcom","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"}]},{"id":274758,"name":"The Stanley Parable: Ultra Deluxe","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c4e/c4e3ad247e93d3a5dc40aa215a778a9c.jpg","description":"When The Stanley Parable came out, a lot of people asked us for more endings and more content.\nWe told them it didn't need more content, that it was fine just the way it was, that it already had the perfect number of endings.\nWhat a sorry sack of lies that was.\nWe knew it. We knew it were lying and we did it anyway. We’ve carried that shame around with us for years, a burden weighing on every moment of every day.\nEnough is enough.\nIt’s time to fix this, to unburden our shame. Let us give you our shame, for you to carry it around instead. We’re sick of it.\nFrom the liars who brought you the award winning indie game The Stanley Parable comes The Stanley Parable: Ultra Deluxe, an expansion to the original game with more content, more endings, more whimsical adventures of the two best friends Stanley and The Narrator. Coming to PC and consoles in 2019.\nTastefully seasoned with the bitter remorse of having deceived so many loyal fans for so long.\nBut seriously, this time it’s done. No more.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Crows Crows Crows","platforms":[{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":23458,"name":"SUPERHOT VR","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65e/65e41ec8f819b718adb4286b16df45e5.jpg","description":"Blurring the lines between cautious strategy and unbridled mayhem, SUPERHOT VR is the definitive VR FPS in which time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It's just you, outnumbered and outgunned, grabbing the weapons of fallen enemies to shoot, slice, and maneuver through a hurricane of slow-motion bullets.\nBODIES ARE DISPOSABLE\nMIND IS SOFTWARE\nBODIES ARE DISPOSABLE\nMIND IS SOFTWARE\nDecisive winner of dozens of VR Game of the Year awards,  SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controllers. The fruit of over three years of close cooperation between the critically acclaimed SUPERHOT Team and Oculus, SUPERHOT VR brings the intensely visceral action of SUPERHOT directly into your head and soul. And now also - directly into your Vive.\n🏆 DICE Awards Immersive Reality Game of The Year 2017 Winner\n🏆 New York Game Awards Best Virtual Reality Game 2017 Winner\n🏆 Unity Vision Summit Virtual Reality Game 2017 Winner\n🏆 Pixel.Awards Best Virtual Reality Game 2017 Winner\n🏆 Digital Dragons Best Virtual Reality Game 2017 Winner\n🏆 GDCA Best VR Game 2017 Nominee\n🏆 SXSW Trending Game of the Year 2017 Nominee\nSUPERHOT VR now also includes the massive SUPERHOT FOREVER update, bringing hours of new replayable challenges, achievements and hardcore endless levels to SUPERHOT VR's time-bending gameplay, including:\n- Test your aim where only headshots take out enemies.\n- Race against your best scores in bullet-time and real-time.\n- Try to complete the game without shooting.\n- Get hardcore with faster enemies and less reaction time.\nThe game will test your limits. It will make you hurt. The good kind of pain. But at the end you will prevail. You will be one with the system.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"SUPERHOT Team","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":2018,"name":"Cthulhu Saves the World","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/3ca/3ca548ad61d376aec77acbb03c774a98.jpeg","description":"Cthulhu Saves The World is a parody RPG where you take on the role of Cthulhu, the lord of darkness who is meant to destroy the world. His powers were blocked by a magician, and now he needs to become a true hero to restore them and fulfill his mission. Inspired by Howard P. Lovecraft’s novels, the game turns the classic plot into a humorous story with multiple cultural references.\n\nThe game looks like a top-down old-school RPG with permanent fourth-wall breaking and numerous quests you can complete. Visually it uses pixel-art and pseudo-3D elements. During the game you meet different characters that join your party. Each of them has different attack types you can upgrade. These attacks are also unique; so, Cthulhu has the ability to make enemies insane.\n\nThe gameplay is focused on exploration, turn-based random fights and boss battles. There are nine dungeons you need to sweep, full of multiple monsters. You can unblock more game modes progressing through the game.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Zeboyd Games","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"}]},{"id":9677,"name":"Creativerse","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d6c/d6c0142aab845c93e4df9caf250b53a2.jpg","description":"Creativerse is a creative sandbox game developed by Playful. The game is distributed completely free of charge and anyone can download it on Steam.\n\n###Gameplay\nThe game's environment is procedurally generated out of blocks. The game takes heavy inspiration from Minecraft and improves upon it concepts.\n\nAt the beginning of the game, the players come into possession of a gauntlet that allows them to manipulate matter. The players create their own character and customize it before being put in a procedurally generated world. The game teaches the players to interact with this world and gives the first tools and tips to do so. \n\nCreativerse improves upon Minecraft's multiplayer modes, as the players do not have to install server-side mods to activate the possibilities of claiming land and the protection of player-created buildings.\n\nThe player progression in Creativerse is made through the recipe system that expands as the players discover more and more crafting recipes. The game's crafting system heavily resembles the same of Minecraft, as the players find resources in the generated world's biomes. These materials are later used to create new items that can also be used to later build more sophisticated tools and weapons. Several very rare recipes can be obtained through combat or dungeon exploration.\n\n###Paid version features\nThe paid version of the game allows creating as many worlds as the players like, grants 20 more inventory slots and new items, such as a flashlight.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"playful","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2020,"name":"The Room","genre":"Indie","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/a1b/a1be74d66dbe2692cd8d84c22212139e.jpg","description":"Fall into a world of bizarre contraptions and alchemical machinery with The Room, a BAFTA award-winning 3D puzzler from Fireproof Games. Follow a trail of cryptic letters and solve many unique devices in ever more extraordinary places, on a time-spanning journey where machinery meets myth.\nThe Room PC is a fully-enhanced HD release of Apple's 2012 iPad Game Of The Year, including the 'EPILOGUE' DLC that adds 20% more content and play time to the original release. This PC version of the game has been many months in the making and has involved recreating almost every asset in the game from the ground up.\nFireproof Games are a small independent team working in Guildford in the UK. We self-published our first game The Room in September 2012 and were stunned with both the critical success and our new-found fan-base, not to mention multiple international awards. The Room has changed our lives and we hope you enjoy playing it as much as we enjoyed making it.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Fireproof Games","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"}]},{"id":16434,"name":"Evil Genius","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/191/191b8c462102069c817d86295f45ac01.jpg","description":"Everybody wants to rule the world! Achieve global power with EVIL GENIUS, the one and only complete world domination simulator. All the everyday tasks of the deliciously wicked mastermind are available to experience and master from building your ultra-secret base to developing spectacular super-weapons to carry out your nefarious master plan. How evil are you?\nChoose from 3 notorious Evil Genius characters to serve as your icon and represent you in your quest for power.\nCreate the ultimate doomsday device and use it to achieve total global domination.\nCreate your lair with over 300 items including kung fu academies, rocket caverns, and laboratories.\nUse ingenious traps and wicked 'interrogation' devices to toy with and dispatch obnoxious overdressed government agents.\nManage your minions as you train them in treacherous trades such as experimental research programs, heavy weapons usage, and international sabotage.\nRecruit dastardly henchmen to patrol your base, take out your enemies, and undertake outrageous missions to increase your power and notoriety.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"Elixir Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":1184,"name":"Aragami","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/729/729313c5dc2fcec246c4c8ce8009e68d.jpg","description":"You are Aragami, a vengeful spirit with the power to control the shadows. You’ve been summoned by Yamiko, a girl imprisoned in the city fortress of Kyuryu. Embark on a dark journey full of blood and secrets to discover the truth about aragami. Infiltrate the occupied city of Kyuryu with your supernatural powers and fight Light with Shadow. Uncover a story about twin souls bound together by destiny that surpasses time and memory.Key Features:EMBRACE THE SHADOWS\nCreate your own shadows to become invisible. Teleport from shadow to shadow while you hunt down your targets. Use a wide array of Shadow Powers to creatively dispatch your enemies.\nCHOOSE YOUR PLAYSTYLE\nMultiple paths to beat each scenario and approach every situation. Play as a merciless emissary of death or an undetectable ghost. Your story, your choices.\nBECOME ARAGAMI\nFight Kaiho, the army of Light, and rescue Yamiko – the mysterious girl that summoned you and that is the key to your existence.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Lince Works","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":312668,"name":"Warhammer Underworlds: Online","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fd6/fd67fb0d514e09ad403fd09efb976ae7.jpg","description":"The Ultimate Strategy Combat Video GameHigh-stakes, turn-based strategy.\nDigital adaptation of the hit tabletop game from Games Workshop.\nPit mighty warbands against one another in an eternal battle for Glory.\nEasy to grasp and quick to play.\nDice-and-cards mechanics offer boundless strategic depth.\nChoose a warband, build your decks, roll the dice, and carve a path to victory.Craft Powerful Card Decks Deckbuilding is the strategic heart of Warhammer Underworlds: Online.\nYour 12-card objective deck will shape your tactical approach to a match.\nWhile your 20-card power deck is filled with the clever gambits and powerful upgrades you’ll need to win.\nScore Glory by both taking out enemy fighters and fulfilling the objectives in your deck.\nEach warband has access to a library of diverse universal cards and exclusive faction cards that highlight the particular strengths of your warband.\nPlay, tweak, and improve to craft the ultimate strategy. Assemble Your WarbandYour warband is a group of fighters who are trapped together amongst the towering spires of the Mirrored City of Shadespire, and the haunted, labyrinthine corridors of the Nightvault that lays beneath.\nWarband fighters are united by a common goal and each has distinct combat style and character; there is no single path that guarantees victory.\nMake an aggressive charge to take out enemy fighters.\nUse clever defensive positioning to swarm your opponents.\nOr craft a shrewd objective deck and fulfil conditions that perfectly align with the strengths of your warband.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Steel Sky Productions","platforms":[{"id":0,"name":"PC"}]},{"id":7442,"name":"Gods Will Be Watching","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f4b/f4bfa7341a0445f8098ff7c6c4dca60f.jpeg","description":"Gods Will Be Watching is a point-and-click survival thriller. Deconstructeam have developed it, and it is the only title within the IP. The game was incipiently created within the Ludum Dare development competition, the theme of which was minimalism. That gradually affected the style of a final game build.\nThe story centers around the group of survivors questioned with a quest to survive during the 40 days being cut off from the outside world. The game's core feature is the variety of moral decision — the player decides who is worthy of sacrificing for the sake of the group's survival.\nThe gameplay features walking and talking with the other characters — six in total — while a heavy accent is made on time- and resource management. The game's name derives from the absence of right and wrong decisions: not only the survival of the team is a task at hand but the survival of an outside world from genocide.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Devolver Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":4875,"name":"Alien Breed: Impact","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/7e9/7e9290d51aa334b846c791cde16f5b5f.jpg","description":"Alien Breed: Impact is a part of the revival of an old game series, influenced profoundly by the Alien movies. After the last game of the series was published in 1996, reimagining the established format as a first-person shooter, the game was brought back to its roots, returning not only with the improved graphics, engine, and design but with the classic top-down shoot ‘em up genre. Theodore J. Conrad is a space engineer that has to restore the engines after the collision with a mysterious empty ship.\nAlien Breed: Impact is an updated version of Alien Breed: Evolution that adds not only new designs for the enemy aliens but an entirely new upgrade shop. It has two full story campaigns for both single player and multiplayer. In the multiplayer cooperative campaign, two players are taking the roles of two other survivors, Thadeus and Eddie, that are trying to find Conrad and assist him on his mission.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Team17 Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"}]},{"id":4519,"name":"Trine 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ad7/ad77db1b21a65dcce85e7d05a1a1c3f9.jpg","description":"Trine 2 is the second part of multiplatform puzzle sidescroller with a heavy accent on the cooperative. Being preceded by Trine, Trine 2 features one DLC: Goblin Menace, which adds six new levels and puzzles into the game.\r\nThe player in Trine 2 has to choose between three regular classes to play: the wizard, the thief, and the knight, each one with its unique abilities and skills. Singleplayer allows the player to switch between characters while in the cooperative the figure is tied to the gamer. \r\nTrine 2 features bright and shiny middle-aged levels with the essential elements glowing in the location.  The plot itself depicts the heroes' adventures as though they've just come from a fairytale book' pages. \r\nCompared to its predecessor, Trine 2 has acquired more favorable reception from the critics: while the first piece has got the average of 8 on the review aggregators, being criticised for lousy ending and enemies' monotony, the second one is said to have significant improvements and innovations.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Frozenbyte","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":19572,"name":"Call of Juarez","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a41/a4126f8dc70a3e664b18b983722ed082.jpg","description":"Call of Juarez is an epic adventure western themed FPS game. The player alternately assumes the roles of two distinct, antagonistic characters: a sneaking fugitive Billy and his hunter the reverend Ray. Apart from the highly interesting, emotional and psychological aspect of the link between the two characters, the player will experience a variety of gameplay with many differences whilst playing a particular character.\nThe game features fast paced revolver duels using historically accurate firearms, horseback riding, mounted combat and stealth actions in memorable locations set after Western movies. Emergent gameplay based on accurate simulation of not only rigid bodies and rag-dolls but also liquids, gases, fire and smoke makes the gameplay innovative and non-linear.\nVery serious approach to the Wild West theme and detailed reconstruction of the character and visuals of that times\nThe use of physics and innovative simulation of fire, liquids, dust, smokes and gases to construct emergent gameplay\nState of the art graphics making use of the top technology graphics cards features on todays cards.\nPlaying 2 distinct characters with different abilities and different gameplay\nHorseback riding and saddle shooting, gunfighter duels\nUsing the whip to fight, move objects and move the player's character\nLegendary weapons form the Gold Fever era and full akimbo mode for the hands on approach.\nExhilarating storyline with full of twists and turns in this exciting Western Genre.","review":"","timePlayed":0.0,"releaseYear":2006,"developer":"Techland","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"}]},{"id":10878,"name":"Iconoclasts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/01a/01a73c4a2d3d5b67e369047896749a95.jpg","description":"Robin just wants to be a mechanic and help people, but without a license that makes her a sinner in Mother’s eyes.\nEver since Robin picked up her wrench, the world’s been going nuts. Now Penance is raining down on everyone she loves and creepy One Concern agents are after her.\nSomething big is going on, bigger than ivory shortages or the moon breaking apart - and Robin’s in the middle of it.\nIconoclasts is the masterwork of indie developer Joakim Sandberg, seven long years in the making. Iconoclasts delivers awesome action, hilarious hijinks and emotional rollercoaster of deeply personal storytelling.\n10 nut-twisting hours of Metroidvania-style platform adventure\n10 densely detailed locations filled with fine-tuned action and puzzles\n20+ gear-grinding, screen-filling boss battles stand in your way\n3 game-changing difficulty settings supported by a unique skill system\nA heart-wrenching epic -- can one mechanic fix the whole world?","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Joakim Sandberg","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"}]},{"id":4005,"name":"Wolfenstein 3D","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52b/52b958a7b263d4f264648b710e76a236.jpg","description":"Wolfenstein 3D is a first-person shooter developed by id Software. It is the third installment of the Wolfenstein game series and is one of the first FPS titles to be ever released.\n\n###Plot\nThe game is set during World War II. An American spy of Jewish descend, William Blaskowicz is captured by the SS while searching for intel on Operation: Eisenfaust. Blasko is held captive in the Wolfenstein castle which he later escapes, foils the Nazi plan and kills Adolf Hitler.\n\n###Gameplay\nWolfenstein 3D consists of three episodes, each of which are divided into 10 levels. Every level is some kind of labyrinth built up from rooms and open spaces that are divided by walls and doors. Moreover, on every level, there are secret rooms, that hold specific bonus items. At the end of each level, the players fight with a boss - a unique and buffed up enemy.\n\nThe game's art style is heavily inspired by the German bunkers of that era. Wolfenstein 3D is one of the first games to use 2.5-dimensional graphics to immerse the players.\n\nThe players are opposed by the SS soldiers, mutants, and guard dogs, which will attack the player only if they get in their line of sight. Several types of enemies can also react to the sounds of gunfire. It is possible to use stealth.\n\nOn their way, the players can find ammunition and weaponry, which are either placed on the floor or are taken away from the enemy corpses. The game features 4 weapons: a knife, a pistol, an MP40 SMG and a multi-barrel MG.","review":"","timePlayed":0.0,"releaseYear":1992,"developer":"Bethesda Softworks","platforms":[{"id":0,"name":"Jaguar"},{"id":0,"name":"3DO"},{"id":0,"name":"SNES"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Game Boy Advance"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"iOS"},{"id":0,"name":"macOS"}]},{"id":17573,"name":"Capsized","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d5a/d5a663a6e540a7bfc5021663c98fcbea.jpg","description":"Capsized is a fast paced 2D platformer focused on intense action and exploration. As a intrepid space traveler, your ship has crash landed on a mysterious alien planet. You must navigate through the perilous environment and fight off blood-thirsty creatures to save your crewmates and escape with your lives!\nArtist Jesse McGibney and programmer Lee Vermeulen create an immersive alien world teeming with bizarre life-forms and strange landscapes presented in a unique hand-drawn art style. Combining control elements of first person shooters and innovative physics based combat, Capsized emphasizes action without giving up the smart problem solving of classic platform games.\nUse your jetpack to fly through the alien jungle, and tools such as the Gravity Hook to manipulate your environment to skilfully dodge and defeat attacking enemies. You will be challenged - with platforming, puzzle solving, and deadly skirmishing, often all at the same time!\nKey Features:\t\t\t\t\t\tHighly detailed alien environments and creatures, lovingly rendered with high resolution hand-drawn artwork.\n12 mission Campaign featuring: massive non-linear environments, diverse objectives and enemies, and exciting comic-style cutscenes.\n4 extra Arcade Modes to unlock, including: local Deathmatch and Coop, Survival mode, Time Trials, and Armless fighting.\nLethal arsenal of futuristic weapons and gadgets such as: the Gravity Ram, Jetpack, Energy Shield, and Quasar Array\nClassic First Person Shooter inspired controls, with a focus on skilled movement, creative tactics, and insane action.\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Alientrap","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":1562,"name":"Anomaly 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1d0/1d01242356819c4cdd0f1a4baa46bd37.jpeg","description":"Anomaly 2 is a sequel to Anomaly: Warzone Earth and the third part in the Anomaly mobile game series. Anomaly series inverted the classic tower defense genre to create an innovative \"tower offense\" type of strategy.\n\n###Plot\nThe game is set in the post-apocalyptic near future, sometime after the alien invasion of Earth that was described in Anomaly: Warzone Earth. By 2034, our planet is devastated and mostly covered with ice. The last remnants of humanity are trying to defeat the invading alien machines, who stay besieged in their highly fortified bases.\n\n###Gameplay\nLike its predecessors, Anomaly 2 puts the player in control of a convoy of armored vehicles. The goal of each mission is to fight your way through the enemy territory that is protected with defense towers and units. The game has no construction options or resource mining, but there are repair zones on each level. They allow the player to upgrade, purchase, or sell his or her units right in the middle of a mission. Anomaly 2 introduces a new gameplay option: morphing. All vehicles have more than one shape and can morph into different units with unique abilities.\n\n###Multiplayer\nAnomaly 2 is the first game in the series to introduce multiplayer. This mode allows playing as either humans or alien machines. Humans gameplay is the same as in single mode. Playing for the alien side, however, completely changes the game and turns it into the tower defense where the player's goal is to withstand the siege.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"11 Bit Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"}]},{"id":52998,"name":"Grand Theft Auto","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/786/786f9a212646c793ccbad196cba2cf36.jpg","description":"Grand Theft Auto is an action-adventure game with an isometric view, the first installment of the Grand Theft Auto series.\r\n\r\n###Location and plot\r\nThe game takes place in 3 different cities, each one resembling real-life counterparts such as Miami, New York City and San Francisco. The world of the game is only restricted by traveling from one city to another, while the cities themselves are free to explore. The plot is expressed in the form of various missions, where the playable character receives general instructions through a phone call, or otherwise. \r\n\r\n###Gameplay\r\nEach mission in the game has a set goal of in-game points, awarded for successful completion of mission’s requirements, and sometimes causing mayhem for the sake of it. Completion of these missions allows the player to move on to more difficult tasks, and eventually, another chapter in other cities. The player often has to steal vehicles, sell them for profit, perform roadkills and escape the police, as the number of attempts for each mission is limited.\r\n\r\n###Graphics and reception\r\nThe game features a simplistic style for graphics, sacrificing different animations and sprites in favor of just being fun to play. At the time of release, in late 1997-1998, Grand Theft Auto offered unique arcade gameplay with an open world, where players could do anything they wanted, which, of course, was the key to overwhelming success of the game.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"DMA Design","platforms":[{"id":0,"name":"Game Boy Color"},{"id":0,"name":"PlayStation"},{"id":0,"name":"Game Boy"},{"id":0,"name":"PC"}]},{"id":16704,"name":"A Bird Story","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/01a/01a74b440fba4dce445cc2ff11b99220.jpg","description":"A Bird Story is a story-driven adventure RPG developed by Freebird Games. This game serves as a connecting part between To the Moon and its sequel, Finding Paradise, which were developed by the same studio.\n\n###Setting\nYou play as a little boy, who does not notice any people around him. That is until he finds a bird with a broken wing. People start to appear near the boy presented as ghosts. He begins to fight his Introversion. \n\n###Gameplay\nSimilar to the To the Moon, A Bird Story is a 2D game developed on RPG Maker engine. The game does not feature any combat systems or mechanics whatsoever being a purely story-driven game. Not much dialogue is present in the game due to the developers using a “show, don't tell” method of storytelling. \n\nThe in-game map suggests that the game is just a bunch of memories of the boy, rather than a real-time progression of events. \n\nThe gameplay changes depending on the scene the player sees at the moment. Typically, the movement is bind to the arrow keys with the mouse being used for interacting with the in-game world and items. Spacebar is used for more specific actions like throwing. Button prompts appear on screen during the gameplay.\n\n###Game style\nBeing developed by the same people and on the same engine as To the Moon, A Bird Story features the same-ish style. The aunt of the game's designer said that the sounds are nice-ish, but they sound ripped off from To the Moon.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Freebird Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":272448,"name":"Pikuniku","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f26/f26800fe9d6aba33fed9b81195b12728.jpg","description":"Pikuniku is an absurdly wonderful puzzle-exploration game that takes place in a strange but playful world where not everything is as happy as it seems. Help peculiar characters overcome struggles, uncover a deep state conspiracy, and start a fun little revolution in this delightful dystopian adventure!\nA Vibrant Adventure for All: Explore a colorful world at your own pace, help quirky characters with their unusual requests, and solve clever puzzles that will challenge players of all levels with a 4 - 5 hour campaign.​\nCharming Cast: Meet a cast of memorable characters on your journey, each with their own problems and eccentricities to accommodate along the way.\nCooperative Mode: Join up with family and friends for local multiplayer fun in custom cooperative levels and challenges.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Devolver Digital","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":10161,"name":"Blackwake","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/360/3609a212ee012fad38d06f0cdd616091.jpg","description":"Blackwake is a multiplayer naval FPS focused on teamwork and cooperation.\nBroadside or board enemy ships as a crew with intense FPS Naval Combat based in the Age of Sail\nMan the cannons and fire off coordinated broadsides with other players to sink the opposing ship. You will fight as a crew of up to 16 real players on a ship led by another player that has been voted as captain. Modes can have up to 54 players in a battle!Coordinate and cooperate to be efficient and be a devastating crew\nIf you're part of the crew, you may help the ship in any way you see fit without being forced to a role. You can be the part of the gunnery crew by loading cannons and firing at the enemy, or be the master of repairs and help keep the ship afloat by patching holes in the ship, repairing sails, or pumping out water. Help keep your ship's fire power up by running supplies for your fellow crewman, or even board an enemy ship and conquer it!Lead your crew as the Captain and dominate the opponent or defeat an arch nemesis\nIssue commands to your crew, keep the coordination flowing as to which side to be at the ready, focusing on repairs or boarding the enemy! You can order which sides of the ship you want loaded with what, and motivate them until victory or death. Captain nominations occur at the start of the round and captain ratings improve or worsen depending on your success or failure.Game modes with variation\nRanging from a traditional duel style 1v1 ship deathmatch all the way to a 3v3 deathmatch of various ship sizes, you will be tested as a captain, your coordination with other captains, and as a crew. Weather will change with each round, spanning from a calm day with islands to a heavy storm in the open ocean. More game modes are planned to come in free content updates to make sure things stay interesting!Communication is key\nThere are multiple voice chat channels to keep coordinated, global, crew, faction, and proximity. Tell the powder monkey next to you, to fill yer' crate or the friendly ship's captain to come to your aid. Aside from voice channels there are also crew commands that are extremely helpful to people without microphones. You can expect the crew with the best communication and cooperation to win!Customization as both player and yer Ship\nName your ship, change its colors and make it known in tales told. Change your appearance and outfits to display your skill, time played and persistence as a fellow crewman.Developers that are passionate about feedback and are part of the community\nSince our early development and Kickstarter we've spoken to our players through both discord and in-game chat, taking suggestions and feedback with care in real time. Every suggestion made by our players is truly considered and discussed, and we've been careful to keep in line with the vision we set out to create for Blackwake. The result is a game that we all helped create together and can enjoy together.As long as Blackwake breathes we'll keep her fed with content\nWe want to keep developing Blackwake with FREE additional content to make Blackwake the best possible game it can be. No paid DLC to divide the community or pay to win items to give players who spend more an advantage. We have many more ideas for Blackwake, and we're excited to use them to keep the game fresh and active.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Mastfire Studios","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":4033,"name":"Draw Slasher","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c08/c085faa3f9120d5855c307fb37cabb99.jpeg","description":"Meet Hanzo. He’s a ninja. While he was training ‘out there’ the Pirate Monkey Zombies™ - stupid, ugly, smelly, rotten and disgusting creatures - kidnapped his family. Take control of his awesome blade and aid him in the quest to free them.\nYou need just a mouse to play. LMB + draw a line to jump, dash, dodge, and slash. RMB to summon powerful Ninjutsu Techniques - super-efficient against the 'rottents'.\nFEATURES:\n• Unique mouse only controls\n• Story Mode\n• Challenges Mode\n• Endless Arcade: Survival and Gatekeeper Modes\n• Upgradeable Ninjutsu Techniques\nCut, slice, snip, sever, chop, shear and trim hordes of Pirate Monkey Zombies™.\nAnd wear a helmet - you got only one brain!","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Mass Creation","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":44030,"name":"Pinball FX3","genre":"Simulation","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/151/151642ca03ea3de832698c3bef3c073f.jpg","description":"Pinball FX3 is the biggest, most community focused pinball game ever created. Multiplayer matchups, user generated tournaments and league play create endless opportunity for pinball competition.\nFREE backwards compatibility! Bring your previous Pinball FX2 purchases with you to Pinball FX3 at no charge!\nNot so hot with the flippers? Pinball FX3 features new single player modes that will help you become a better player!\nAll tables have received graphics updates including real-time lighting and shadow projection.\nZen Studios will continue to support Pinball FX3 with frequent content releases and new features!","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Zen Studios","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":10263,"name":"Toribash","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/dd9/dd9737bb37509aa151c3ba92c8e5f992.jpg","description":"Toribash is a turn-based fighting game developed by Nabi Studios. The game is free-to-play on Windows, OS X and Linux. The also used to be available on Wii Shop Channel for 1000 Wii Points (about $10). \n\n###Gameplay \nThe game revolves around 1vs1 duels between doll-like minimalistic characters against either CPU or other players via the internet. Toribash is notable for its unique mix of fighting game and turn-based strategy based on ragdoll physics.\nInstead of commanding character to perform certain attacks or special moves, the players manipulate various joints on the character’s model. It includes relaxing, holding, contracting and extending different parts of the doll’s body. After pressing spacebar, the model starts moving according to the player’s command for several frames and then the next turn begins. The goal of each match is either to gain more points than your opponent or to knock them outside the ring. Players earn points by successfully performing different punches, kicks, grabs and other moves. \nToribash multiplayer offers many different game modes. They vary depending on how many frames one turn takes, the distance between characters or specific aspects of in-game physics. There are also many player-made modifications to the game that change the dolls’ type, the way they move or add additional objects to the environment.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Nabi Studios","platforms":[{"id":0,"name":"Wii"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":59199,"name":"Divinity: Original Sin 2 - Definitive Edition","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cd2/cd2a1a360839002bceadc5a8b3c7dbf7.jpg","description":"The Divine is dead. The Void approaches. And the powers lying dormant within you are soon to awaken. The battle for Divinity has begun. Choose wisely and trust sparingly; darkness lurks within every heart.\r\n\r\nWho will you be?\r\nA flesh-eating Elf, an Imperial Lizard or an Undead, risen from the grave? Discover how the world reacts differently to who - or what - you are.\r\nIt’s time for a new Divinity!\r\n\r\nGather your party and develop relationships with your companions. Blast your opponents in deep, tactical, turn-based combat. Use the environment as a weapon, use height to your advantage, and manipulate the elements themselves to seal your victory.\r\nAscend as the god that Rivellon so desperately needs.\r\nExplore the vast and layered world of Rivellon alone or in a party of up to 4 players in drop-in/drop-out cooperative play. Go anywhere, unleash your imagination, and explore endless ways to interact with the world. Beyond Rivellon, there’s more to explore in the brand-new PvP and Game Master modes.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Larian Studios","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox One"}]},{"id":10786,"name":"ArcaniA","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf9/bf987c6a9734996d3be6838357d369b2.jpg","description":"ArcaniA is set in the world of Gothic game series and was originally announced as Gothic 4. It was eventually released as a standalone spin-off game with only minor connections to the main plot of Gothic.\n\n###Plot\nRhobar III, the king of Myrtana and the former protagonist of the Gothic trilogy, sent his army to conquer the Southern Islands. It seems that the king is possessed by an evil force. The protagonist is a young man from the island of Feshyr. As he prepares to marry, Rhobar's army invades the island, killing the protagonist's family. Now he's to become the new Nameless Hero like Rhobar once was. His goal is to avenge his family and to save the world from the madness of the king. \n\n###Setting\nThe game is set in a high fantasy universe. The world is open, however, it is divided into several regions, each of them serving as an open world in itself. To unlock a new region, the protagonist has to complete certain quests for NPCs that unlock new regions. \n\n###Gameplay\nDespite not being the proper part of Gothic series, the game shows a strong similarity to the original trilogy. It is a 3D third-person RPG with a strong emphasis on action. Some of the game's mechanics became simpler. The creators scrapped most spells from the previous games, leaving only three (fire, ice, and lightning), although they can be upgraded. There are three character classes: Warrior, Mage, or Ranger. The protagonist levels up automatically, but to distribute his XP to certain skill is up to the player. Unlike the rest of Gothic games, ArcaniA doesn't use sleep to skip time and restore health.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"THQ Nordic","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":17993,"name":"Stargunner","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/404/404eac84f1bb799e5d7d62cca9cf836a.jpg","description":"Stargunner has 34 blast-a-thon levels. Blast your way through the dark reaches of space, navigate the hostile alien world of Zile and explore the wreckage-ridden depths of the enemy’s darkened waters.Features\nInto the Face of Danger: Fly through 34 action-packed levels as you take on the forces of Zile.\nTop Gun: Destroy enemy ships to earn power-ups and credits.\nIt Pays to Slay: Spend credits on new weapons and engines - upgrade your ship.\nFight in Flight: 75 enemy craft and 33 bosses ensure there’s no shortage of things to shoot at.\nController Support: Partial Xbox 360 Controller support.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"3D Realms","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":17563,"name":"Shadowgrounds Survivor","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/173/1735a8c1a2c3386d55e2c63d8b2406e3.jpg","description":"Earthlings were badly hit by the devastating meteor shower that hit the planet. However, part of the rain was crystals, which became a source of valuable fuel. When the crystals were over, the Earthmen found a way to teleport to the planet from which these crystals flew to Earth. People moved to this planet in considerable numbers, managed to settle down there, but when they extracted crystals, they accidentally opened the portal to an unknown dimension. The portal became the door for the monsters that captured the planet. Only a small number of people remained. They want to survive. And they are trying to regain control of vital objects.\nYou can play three characters. All of them have different abilities and weapons. Everyone has their own ways to fight for life and territory. A range of improvements allows you to acquire new weapons, sharpen the methods of violence and increase the stock of life. Ammunition causes more damage, resistance to poisons appears, there are clues about invisible monsters. Yes, it is useful for surviving earthlings - it's difficult to fight off monsters. Because they are everywhere and quite reasonable. This planet belongs to them already. Hundreds times increased insects and reptiloids, abundantly armed and perceiving people either as a forage, or as intruders. From mission to mission, heroes make their way through mountains of corpses, crowds of furious beasts and through territories that have become empty under the onslaught of aliens. And this constant tension is periodically replaced by exclamations of heroes: life is beautiful!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Frozenbyte","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]}]