[{"id":17187,"name":"Champions Online","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/d07/d077c34207f8ed42d8498746c172a21b.jpg","description":"New Content\nShadow of Destruction brings us the Qliphothic Warzone, a new epic end-game zone set in an eerie otherworld where forces of evil plot the downfall of all creation. Content is designed for veteran level 40 players in teams of 2+ players, 6+ players and 20 players!\nAbout the GameChampions Online brings epic heroism back to the MMORPG genre with depth that challenges the most experienced online gamers, while its fast-paced action engages new entrants to the online superhero universe. Join Defender and the legendary Champions to stop Dr. Destroyer and his minions in the ultimate showdown between good and evil.\nKey features:\t\t\t\t\t\t\t\t\tFree-to-Play: Play a triple-A MMO experience without cost. Play from level 1 to 40 free of charge! There is no box price and no mandatory subscription. Enjoy Champions Online as you like, when you like.\nTotal Customization: Choose from thousands of different costume pieces, colors and body types to create your character's one-of-a-kind look. There are billions of possible combinations, and even in a universe brimming with the fantastic and the unforgettable, you can be completely unique!\nKeep Your Enemies Close: Every hero must have an archenemy. Design your character's supreme adversary, choosing a name, powers and costume for a superpowered foe to bedevil your hero throughout his or her career.\nEndless Exploration: The battle against evil rages across the world and into alternate dimensions. No other MMO offers players the chance to explore such diverse realms — from the shining skyscrapers of Millennium City and the frozen wastes of Canada to the hidden underwater city of Lemuria, the foul mystical dimension known as Qliphothic, and the tormented Vibora Bay.\nEvil Most Foul: Battle supervillains, aliens, giant monsters and secret, sinister organizations. Doctor Destroyer is launching new plans to conquer the world. VIPER lurks in the shadows, seeking chances to strike at humanity. The ancient Lemurians are plotting a return to power. And Mechanon won't stop until it has wiped all organic life from the planet. Can you stop these heinous threats to humanity?\nHi-Octane Excitement: Combat is instantaneous and electrifying. No more boring auto attacks and lengthy recharge times.\nBrains Required: Every enemy and super-powered threat in Champions Online has its own unique abilities and combat specialties. Use your head or wind up dead!\nBring Friends, Make Friends: Our universe is jam-packed with thousands of heroes, facing thousands of threats. Join up with other heroes, create your own super group, and prepare to take on the ultimate threats!\nYour Powers, Your Terms: There is a multitude of astonishing powers to choose from and the flexible character creation system gives you total control over your hero's abilities. You can even pick the appearance of your powers. Do you want purple force fields? Green fire blasts? Jet black claws? You decide!\nBigger and Better: Vanquish evil and your successes will be rewarded with costume pieces to enhance your powers and abilities. Then customize the appearance of those rewards to your vision of your hero's look and abilities!\nMake Your Mark: All this within a constantly changing, continually evolving story: Villains are defeated. Heroes rise and fall. Cities transform. Your actions may decide the future!\n","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Cryptic Studios","platforms":[{"id":0,"name":"PC"}]},{"id":16178,"name":"Marble Mayhem: Fragile Ball","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56a/56a3e86b1d063395b516d5834d8d50c5.jpg","description":"Developed exclusively for Windows PC by Japanese game design genius Hirofumi Hattori\nDevilishly difficult but insanely rewarding physics puzzler. Play through 85 levels of diverse and ingenious physics-based challenges. If you like Super Monkey Ball, Marble Madness, or Peggle, this one is for you.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bimboosoft Co.,Ltd.","platforms":[{"id":0,"name":"PC"}]},{"id":13121,"name":"Endless Sky","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/4e6/4e6c82a4af367d9fce2dc974ec8a7229.jpg","description":"Endless Sky is a 2D space trading and combat game inspired by the classic Escape Velocity series. Work your way up from a relatively wimpy shuttle, cargo ship, or fighter, to a highly upgraded and customized flagship or to a massive fleet of warships or freighters. Earn money by carrying passengers or cargo, escorting convoys, bounty hunting, or plundering and capturing enemy ships. Take sides in a civil war, or ignore the story line and just enjoy exploring the galaxy and blasting pirates.\nThe main story line takes about 8-16 hours to play through. The galaxy contains hundreds of star systems and planets, and several alien species with their own unique technologies. You can choose between more than fifty ships and several hundred ship upgrades. A plugin system allows anyone with a text editor and a paint program to create new ships, weapons, or missions, and the galaxy editor can be used to add new star systems and planets.\nEndless Sky is free, open source, and cross platform (Windows, Mac, and Linux). Over time, the game universe will expand as contributors add new missions, story lines, alien species, places to explore, sound effects, and artwork.\nFor more information, please visit the website or read the player's manual.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Ketchapp","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"iOS"}]},{"id":4679,"name":"Tom Clancy's Ghost Recon Advanced Warfighter 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/571/571f17c2ace00aeeef54d234bb23b91f.jpg","description":"It’s 2014, and the soldiers of the future return to encounter a new threat along the recently completed wall on the U.S./Mexico border. The Ghosts are more powerful with an upgraded Integrated Warfighter System but have only 72 hours to assess the threat and stop the rebels. With a border that’s 1,900 miles long and an enemy that doesn’t play by the rules, this is a job for the U.S. military’s most elite fighting unit, a job for the Ghosts.\n•\tAll-new battlegrounds- Defend U.S. soil from cross-border attacks.\n•\tDeploy future technology- Command lethal air strikes with jet fighters and more!\n•\tThe revolutionary new Cross-Com 2.0 will allow players unprecedented precision in developing and issuing tactical plans on the battlefield.\n•\tDynamic lighting and shadows- Optimize your assault around real-time day/night cycles and changing weather.\n•\tOnline multiplayer action!\nDownload, play and own the full game today!\nSoftware subject to license (us.playstation.com/softwarelicense).  Online activity subject to Terms of Services and User Agreement (www.playstationnetwork.com/terms-of-service).\n© 2007 Ubisoft Entertainment. All Rights Reserved. Ghost Recon, Ghost Recon Advanced Warfighter, the Soldier Icon, Ubisoft, Ubi.com, and the Ubisoft logo are trademarks of Ubisoft Entertainment in the U.S. and/or other countries","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Ubisoft","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PSP"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"}]},{"id":426096,"name":"Saints Row: The Third Remastered","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/8cb/8cb8c54422636541fece8a479694f044.jpg","description":"Experience The Full Package, Remastered. Steelport, the original city of sin, has never looked so good as it drowns in sex, drugs and guns. The Third Street Saints are at the height of power and yours to control. This is your city. These are your rules.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Volition","platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":387329,"name":"Eldest Souls","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/86f/86f6463459c4fc33078d198cc2e8d119.jpg","description":"Eldest Souls is a challenging, pixel-art boss-rush game.\nThe Old Gods have long been imprisoned. Humanity has prospered. Great Kingdoms have arisen from the now forsaken temples of worship. But no longer…\nIn their final act of revenge, the Old Gods have unleashed a great Desolation upon the world. Farmlands have turned to desert, rivers to dust.\nThe Great Crusade sent to slay the Imprisoned Gods once and for all, is all but vanished, and the human Kingdoms in disarray. A lone Warrior approaches the Citadel, ancient prison of the Gods. His objective is simple: slay them all.\nIn Eldest Souls, you will explore the vast, forgotten Citadel, in search of the Old Gods. The temple-prison will contain interesting NPC’s, exciting quests and dark mysteries. Encounters with the Old Gods will be…deadly. With fast-paced and challenging action combat, every moment counts. Yet fortune favors the bold and defeating the Old Gods may grant the player powers beyond mortal comprehension.\nFEATURES:The Old GodsSlaying Gods is no easy task. Prepare yourself to be overwhelmed by brutal, challenging encounters, in which Only the most unrelenting will make it through.Dying worldExplore and discover the mysterious, ancient Citadel. Prison of the Old Gods, this monument of the Human’s triumph has long be forgotten, and something dark has taken root deep within its mazes.Progress & AdaptEvery encounter will the Old Gods will be a unique, new challenge. Claim their power, unlock various Talents and Abilities, and slay them all.","review":"","timePlayed":0.0,"releaseYear":2021,"developer":"Fallen Flag Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PC"}]},{"id":288747,"name":"S.W.I.N.E. HD Remaster","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/aa0/aa0ffa85e792e93f2606ed8985e2fca9.jpg","description":"About S.W.I.N.E. HD Remaster\nThe S.W.I.N.E. HD Remaster is a unique edition of the remastered original game. You will not only receive the complete HD remastered version of S.W.I.N.E. improved with all the patches since its release, but you will also get three exclusive bonuses:\nSoundtrack - The original soundtrack of S.W.I.N.E.\nArt Book - An exclusive art book with previously unreleased designs and concept drawings\nMaking of S.W.I.N.E. - A developer documentary, where you can follow the origins of the game and the process of how Kite Games recreated this classic game.\nAbout the Game\nExperience again the nifty war strategy game that defined the childhood of many players in the golden age of gaming. The game was originally developed by Hungarian StormRegion and published by Fishtank Interactive in 2001. Nearly 18 years later, Kite Games, in cooperation with the original developers and some enthusiastic fans, redesigned the game in high resolution and reignited the original S.W.I.N.E. warfare feeling. In this unique, real-time strategy game, the player chooses to lead to victory either the brutal pigs or the peace-loving rabbits.About S.W.I.N.E. HD RemasterThe original game was remastered with so much care, love and attention that only the original developers and a few hardcore fans could give. For this unique edition, you will also receive the following additional extra contents:\nSoundtrack - The original soundtrack of S.W.I.N.E.\nArt Book - An exclusive art book with previously unreleased designs and concept drawings\nMaking of S.W.I.N.E. - A developer documentary, where you can follow the origins of the game and the process of how Kite Games recreated this classic game.\nAbout S.W.I.N.E.This funny strategy war game, which was first released in 2001, allows you to fight leading the aggressive pigs or the peace-loving rabbits to victory in several battles. As most strategy games, S.W.I.N.E. focuses on the strategic aspect of the battles. You don’t have to construct buildings or collect resources. Instead, the player needs to capitalize on the strategy points and use them to expand and develop their army.\n18 years later, we can relive the iconic slogans and the legendary fights. The remastered version of the game brings a new appearance and new content as well. Camera movements were modified (extended zoom range) and a more detailed battlefield was developed. Units also received a better texture and the vehicles’ undercarriages also move.\nThe official online multi-player mode will become available again, and you can also enjoy the LAN parties soon.\nBREAKING NEWS! A military coup was carried out in the Republic of the Pigs! Does this mean the end of the republic?\nOn July 26, General Iron Tusk took over the country with a military coup and after eradicating the remaining republican pig forces, he turned his attention to the neighboring Carrotland...WAR!On August 3, the National Pig Army crossed the border with Carrotland without any prior warning and launched a brutal and devastating military campaign against the rabbits. In less than two weeks, the pigs burned the whole country to the ground. The capital is under siege at the moment. The rabbit army has lost 90% of the soldiers under the great pressure. Cities and villages were demolished. The unrelenting defense of the small army wasn’t enough to deter the pig hoards.\nJOIN!The government and the staff made the following decision in their despair: as Iron Tusk’s war machine cannot be defeated with a frontal attack, they need to resort to deception. The remaining forces need to be transformed into a powerful team that is able to get behind enemy lines without great losses and cut off the army from all possible supply routes and military buildings. Now they need to find a young and talented commander who can implement this plan.\nFeaturesRemastered graphics in HD resolution – Redesigned interface adjusted to 16:9 aspect ratio, and a detailed unit texture. All the expected graphics settings: anti-aliasing, v-sync, screen selection, full-screen mode,\nImproved game experience – known bugs fixed, extended zoom, improved unit ordering, moving unit undercarriages.\nMultiplayer is back! – Travel back to old times with your friends and play this unique landmark of a game either online or on LAN – The official multi-player mode is back: stability updates, online multi-player mode and LAN support.\nBuy the game now to receive all the following extra content only available with this remastered edition:\nSoundtrack - The original soundtrack of S.W.I.N.E.\nArt Book - An exclusive art book with previously unreleased designs and concept drawings\nMaking of S.W.I.N.E. - A developer documentary, where you can follow the origins of the game and the process of how Kite Games recreated this classic game.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Kite Games","platforms":[{"id":0,"name":"PC"}]},{"id":423950,"name":"Wanderlust: Transsiberian","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/291/29135ecd06cd54c4f13a8bcddbba8fba.jpg","description":"Two men embark on a trip to the easternmost reaches of Eurasia, onboard the longest railway line in the world. For one of them, it’s a dream come true. For the other, it’s not much more than a hassle. See the Siberian odyssey through their eyes.\nExperience the longest journey through beautiful bespoke photography and rich literary descriptions that will transport you into the cold and beautiful wilderness. Make This Journey Your OwnTravel as you really would, or try something different. Be open and friendly or stay careful in unknown places. Make new acquaintances or avoid other people. Your interaction with the world shapes the way the world interacts with you.Travel to the Heart and Soul of RussiaFrom monumental Moscow to never-ending birch woods to lonely roads of Siberia, there’s much more to Russia than meets the eye. Soak up its unique atmosphere and find yourself in situations you’d probably never experience face to face.Welcome to the World of Travel StoriesStay home, but don’t let that stop you from travelling. Make this hour-long standalone expansion your introduction to the acclaimed Wanderlust: Travel Stories anthology, or expand the grand adventure of the base game.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Different Tales","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":257203,"name":"Bless Unleashed","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2af/2aff127d5caa7985bfdb5106f75052fe.jpg","description":"Bless Unleashed is the premier next-generation MMORPG, coming first to Xbox One.\nBuilt for mature audiences, Bless Unleashed takes players on an epic multiplayer journey across a vibrant persistent world, and tasks the brave with battling – and surviving –vicious, lethal monsters that inhabit this untamed landscape.\nAncient betrayal and earthshaking disaster has led to thousands of years of enmity between the mortal and the divine. Now, heavenly whispers speak. The mad mistress of the dark, great and terrible Lumenas, will return to destroy the race of man and sink the earth into endless night. How long will she remain sealed before she breaks free to wreak havoc on the world?\nGather your allies close. As the unspeakable monsters of the world salivate for your grim end, stand fast and stoke your fury.\nYour endless foes would see you weakened and beaten.\nBut you… You will make them pray.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Round8 Studio","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":28254,"name":"TEKKEN 6","genre":"Arcade","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d04/d040389a4450e86fdf00face1dd84276.jpg","description":"(Online Interactions Not Rated by the ESRB)  Download the manual for this game by locating the game on http://marketplace.xbox.com and selecting “See Game Manual\".   With over 34 million copies sold worldwide, TEKKEN is the #1 fighting game franchise.　 The series appears on the Xbox 360 console for the first time with the latest installment, TEKKEN 6!　  A large roster of unique characters, fast-paced action, a deep level of strategy, and the rich background story have all helped make the TEKKEN series the top in its genre.  TEKKEN 6 has the largest character roster to date, Online VS Battle, and other new content created for the home version. Use the improved, more in-depth character customization options to customize your favorite characters and face off against rivals online!","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":17810,"name":"NecroVisioN: Lost Company","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c37/c37e27b0eb81f7f6858359bc75f11179.jpg","description":"NecroVisioN: Lost Company is the prequel to original horror FPS shooter, taking place before the NecroVisioN story begins. It contains a bunch of unique levels, characters, weapons and gameplay elements as well as new main hero that presents the original game story from opposite perspective. Player is now one of WWI German troops that discovers the evil forces unleashed by the war, starts to fight against them and leads soldiers of all nations gathered on the front through the massive battles against the zombies and demons and finally he becomes a first Necromancer that will fight against Simon Bukner in NecroVisioN.\n10 new levels in singleplayer campaign\n15 new characters\n6 new weapons\nVariety of special weapon ugrades\nNew drivable vehicles to use in fight - FT17 tank and Halberstadt CL.II airplane\nSeveral additional close combat techniques, spells and fatalities in singleplayer\nNew unique multiplayer mode: Gas Attack\n3 new maps and several new skins for multiplayer mode\nNew visual effects like enhanced depth-of-field, soft shadows and new shaders with optimized renderer and data loading system.\n","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"The Farm 51","platforms":[{"id":0,"name":"PC"}]},{"id":10928,"name":"Leviathan: Warships","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/bf7/bf73f2f33579309375a8cc0a78fb3daf.jpg","description":"Leviathan: Warships is a turn-based strategy game developed by Pieces Interactive.\n\n###Plot\nIn a distant future, the Marauder fleet wreaks chaos upon the law-abiding citizens. The army establishes a new warship division to combat the new threat. The players have to build a new fleet and win the fight with the Marauders.\n\n###Gameplay\nLeviathan: Warships is a strategy game in which the players take turns on commanding their own warship fleets. It is possible to play in a cooperative campaign against the Marauder fleet, fight in numerous Special Challenges missions, which put special requirements on the player's play style or compete with each other in a Player versus Player mode.\n\nThe game puts a heavy emphasis on the fleet editor. This feature allows the players to create a completely new fleet with multiple ships and weapon types that can be used to create limitless combinations. The fleets usually contain less than six ships to balance the game correctly. The ships of the fleet are initially spawned bundled together.\n\nThe players have to plan their actions ahead and execute them carefully as any misplanned attempt on damaging the enemy may result in complete annihilation of your own fleet. It is essential to be careful, as most of the map is covered by the fog of war in which your enemies hide.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Pieces Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":3861,"name":"CastleStorm","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/461/461b1d304a8f67b6174cef5faaa32a49.jpg","description":"Steam Big Picture\nAbout the GameWelcome to the world of CastleStorm, a super genre mashup of 2D physics destruction mashed with tower defense brawler! CastleStorm was born out of the fond childhood memory of building and destroying LEGO castles.\nThe clouds bring rumors of war…It’s Knights vs. Vikings in CastleStorm, where medieval warfare meets 2D physics-based destruction! Controlling the battle in real time, players will harness the power of medieval artillery, manage a fearsome ground attack, and cast powerful spells! CastleStorm features a story-driven solo campaign, a custom castle editor, online multiplayer, co-op modes, and more. Building castles and knocking them down has never been so much fun!\nCastleStorm is a physics based tower destruction game, combining elements of real time strategy, resource management, and a beautiful blend of challenging gameplay scenarios.\nMultiplayer battles and Co-Op. CastleStorm features multiple modes of multiplayer action for both local and online play:\n•\t1 vs. 1 split-screen mode, simply try and beat your opponent\n•\tSurvival Co-op: Two players team up to fight off waves of enemies together! One player will control the ballista, the other controls ground forces\n•\tLast Stand Co-op: Both players control a hero and fight off endless waves of enemies together!\nBuild your own castle! CastleStorm features a tower construction editor allowing players to construct their own custom castles that will be used in battle. Castles must be constructed wisely, as choices determine which types of troops and resources will be available during battle!\nTwelve incredibly beautiful environments and a comical story. Sir Gareth leads his troops into battle against the raging Vikings to recover the stolen gem and bring peace to the realm!\nMultiple paths to victory. You can choose how to defeat your enemy. Capture the flag, destroy their castle, or complete another predetermined level objective in order to claim victory. Each level features multiple objectives, each with their own rewards!\nAn arsenal that would make any medieval warrior proud! Harness the power of medieval ballista weaponry, and launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsome ground attack of swordsmen, knights, and donkey riders in order to protect your castle gates, and if all else fails, call upon powerful spells to help keep the enemy at bay.\nYou’ve won the battle, now power up so you can win the war! As you power up in CastleStorm, new weapons and troop classes become available for use in battle.\n#StormingCastlesIsSoMuchFun","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Zen Studios","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":3640,"name":"Hohokum","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/22a/22ac17c6c060679b038f4de34ea6a133.jpg","description":"Hohokum is a platformer with a heavy focus on exploring the world and crafting your way through the levels with the help of artistic means. The title is developed by Honeyslug and is the only game within the corresponding IP.\n\n###Gameplay and features\nOne must navigate an unknown creature called Long Mover who looks very much like a worm through the 2D platforming sections composed of different-colored minimalistic objects and NPCs. 17 locations called worlds have no connection whatsoever and may be explored in any way one desires. \nThe player may affect only the speed of Long Mover — slow him down or speed him up. However, the game build interaction with an NPCs through the back-riding mechanics — all of the information about goals or secondary tasks is known from the locals who ride the player's back.\nThe purpose of almost every level is to wake the creature within its bounds by tickling its eyes.\n\n###Key features\nIt is both feature and philosophy of the game — highlighting no narrative or instructions the game lets the player move into and flow within its worlds. The absence of story, nonetheless, compensates with goals — each world has one primary and multiple secondary tasks. Meeting the requirements in all areas brings the player to “the end” — the credits meaning an apparent end of the gameplay. Namely, the play may be continued afterward.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"}]},{"id":3206,"name":"Shutshimi","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/512/5124b82e9e2cd660f3404021a206597d.jpg","description":"Shütshimi is a randomized shoot'em up about a muscle-bound fish with memory problems defending the seven seas.\nArmed with your trusty bullet-morphing shotgun, defeat or navigate through waves of enemies and collect powerups as you battle your way through each of the game's bosses. But there's a catch (there's always a catch): you've been cursed with an incredibly short attention span. Combat waves and upgrade cycles only last 10 seconds a piece, so you'd better act fast!\nBut wait, there's more (information)!\nFishy Features:\nEndless waves, endless fun!\nRapid-fire gameplay! The rules change every 10 seconds, so react quickly!\n5 different weapons to choose from!\nOver 40 upgrades to acquire! Combine upgrades with different weapons for interesting combinations!\nHats! Over 30 of them! Most hats unlock hidden \"Hattributes\" which modify gameplay even further!\nFull keyboard and controller support! Play any way you like, as long as it's either of these two options!\nYou can smoke underwater!?\nLeaderboards! Compete with friends and foes for the global top score!\nLocal Co-op! Work together or screw each other over when competing for the top score","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Choice Provisions","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":2770,"name":"Foul Play","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b65/b65219ef59e8c4b1da0661a7085148b4.jpg","description":"Play as the daemon-hunter Baron Dashforth in a side-scrolling co-op brawler set entirely on the grand spectacle of a theatre stage that rewards performance over pummeling. Perform shattering takedowns and reversals! Electrify the audience with devastating linked attacks as you have a friend join as sidekick Scampwick and use every stage-trick you know to bring the house down! Play out the most spectacular moments of the Baron’s life; improbable beasts, astonishing villainy and, at the heart of it all, the mysterious Foul Play!Supporting Cast\n22 Incredible Acts: From the deserts of Cairo to the depths of Atlantis\nOver 50 hideous enemies drawn from the Baron's recollections\nLearn 12 Electrifying stage-tricks to bring the house down\nHave a friend join as sidekick Scampwick in Local & Online Co-op modes\nBeautifully animated scene changes re-create the Baron's adventure\nNever before seen 'Daemon Diary' charts the discovery of Daemonology","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Devolver Digital","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":494382,"name":"Final Fantasy XVI","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/22e/22e68bb62b3013283972cecf98ed51dc.jpg","description":"An epic dark fantasy world where the fate of the land is decided by the mighty Eikons and the Dominants who wield them.\nThis is the tale of Clive Rosfield, a warrior granted the title “First Shield of Rosaria” and sworn to protect his younger brother Joshua, the dominant of the Phoenix. Before long, Clive will be caught up in a great tragedy and swear revenge on the Dark Eikon Ifrit, a mysterious entity that brings calamity in its wake.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Square Enix","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 5"}]},{"id":14096,"name":"Sakura Angels","genre":"Casual","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/daa/daa9ffc612ceaa868768bb91310996ae.jpg","description":"日本語バージョンダウンロード開始されました。\nFrom the creators of Sakura Spirit... comes a brand-new angelic love comedy!\nTwo girls, blessed with magical powers, are faced with the task of saving the lonely protagonist from the clutches of a mysterious witch and ancient evil, sealed away long ago by his ancestors. What does this sorceress want from our protagonist? Find out more in Sakura Angels!","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Winged Cloud","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":9849,"name":"Forts","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5ea/5eac2a8c174500d4b25e1b466edbcec3.jpg","description":"Forts is a physics-based RTS where foes design and build custom bases, arm them to the teeth and blast their opponent's creations to rubble.\nBuild an armoured fort in real-time and arm it to the teeth. Collect resources, develop your tech-tree, unlock advanced weapons to target your opponent's weak points, and feel the satisfaction as their fort comes crashing down.\nFeatures\nBuild forts of any size and shape, as you fight\nUp to 8 players in online multiplayer with co-op and team death match\n28 mission single-player campaign\nChallenging skirmish mode\nUnlockable tech-tree\nVarious materials and hidden rooms\nTen unique weapons\nThree factions\nNine commander characters with unique game-changing abilities\nPowerful replay system\nBuilt-in level editor\nDesigned from the ground up to support modsCommanders\nCommander characters are available in multiplayer and skirmish modes, providing different advantages. Each commander has passive abilities, active throughout the battle, and a powerful dynamic ability which, once charged by damage, can change the tide of battle. Choose the commander to compliment your strategy.\nEagle Eye - Eagle Empire\nPassive Abilities\nLaser sights - Snipers are fitted with adjustable laser sights.\nIncreased accuracy - Machine Gun and Minigun spread is reduced.\nBigger magazines - Machine Gun and Miniguns magazines capacity increased\nDynamic Ability\nExplosive bullets - Snipers, Machine Gun and Miniguns fire devastating bursts of explosive shells.\nArchitect - Dragon Army\nPassive Abilities\nCheap materials - Fort building materials have a reduced cost.\nHigher storage capacity - Batteries and Metal Stores enjoy increased capacity.\nDynamic Ability\n4x build speed - Weapons, devices and structures build at 400% normal rate.\nArmourdillo - Iron Bear Alliance\nPassive Abilities\nCheap Armour - Armour and Doors are less expensive to build.\nQuick open Doors - Doors open and shut at twice normal rate.\nDynamic Ability\nRapid Repair - Weapons, devices and structures are repaired at an increased rate, and for half normal cost.\nAbout EarthWork Games\nEarthWork Games is an independent game developer based in Brisbane, Australia. With over fifty five years of game development experience between us, we are eager to create games that we enjoy playing, and enjoy making.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"EarthWork Games","platforms":[{"id":0,"name":"PC"}]},{"id":9504,"name":"Vindictus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/77c/77c87b47b0cd9fe6d132aaf1f0152154.jpg","description":"Delia - Nobility's Finest Daughter\nTrained by the finest in the world. Enchanted by the chaos of the battlefield. Captivated by the deaths of her foes. The wait is finally over, as the lovely lady of the land has arrives to the battlefield, Bastard Sword in hand. Face the Fomor horde with Vindictus' newest mercenary, Delia!\nDelia wields a two-handed Bastard Sword, a heavy blade whose size is only exceeded by Hurk's massive Greatsword. The young princess has been trained to use the full length of the blade with each swing, using her momentum to plow through her foes. But don't think all she can do is hack and slash her way to victory; Delia has a wealth of special moves and powerful combos to leave her enemies in pieces.\nLearn more about Delia read the full patch notes here: http://vindictus.nexon.net/news/14804/delia-nobility-s-finest-update\nAbout the GameA malevolent force shrouds the land and monsters terrorize the last bastions of humanity. All seems lost and yet one hope remains: you.\nTake control of a mighty mercenary and leap into the heart of one of the most action-packed MMORPG experiences available. Master the art of combat as you utilize brutal combos, devastating magic and the environment itself to wreak destruction on your foes.\nThis is unlike any MMORPG you've experienced before. This is Vindictus.\nKey features:\nBrutal Combat – Experience a complex and fast-paced combat system that raises the bar for the MMO genre. There are dozens of combos to learn and spells to cast, and mastering them is the key to survival.\nAvatar of War – Choose from nine distinct characters, including hulking behemoth Karok and exiled princess Lynn. Each has their own set of skills, exclusive armor and a unique personality. Learn their strengths and weaknesses to conquer your foes.\nForged in Blood – The monsters of Vindictus are some of the most fearsome you will ever face, so massive they blot out the sun. The greater the beast, the tougher the challenge, and the greater the rewards.\nBrothers in Arms – Some horrors are too terrible to be faced alone. Team up with friends, form a clan, and take on Vindictus’ mighty raid bosses. Coordination is key, and only the strongest will survive…\nVisual Assault – With higher fidelity than nearly every other MMO on the market, Vindictus boasts highly-detailed characters and monsters, explosive particle effects and massive battle arenas.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Nexon","platforms":[{"id":0,"name":"PC"}]},{"id":17538,"name":"Chip","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/af0/af035a92eb1ba4c43034a7b3f2843a28.jpg","description":"Chip is an isometric puzzle game with robots, electricity and fancy dress! The player must help recharge Chip - a plucky little red robot - who has been imprisoned by the nefarious villain, Rust.\nThe player will interact with a wide variety of objects such as cannons, mirrors, and magnets in order to direct a blob of energy to Chip and save him from his grisly fate! Players must utilise their whimsical puzzle-solving prowess by tapping, moving, and rotating these objects to achieve victory.\nAs the player progresses through the game they will find presents hidden amongst the many puzzles in Rust’s lair, containing a variety of Rust’s fancy dress costumes. These can be used to customise your little robot avatar, for bragging rights on the leaderboard and because everybody loves a new pair of fuzzy slippers!Features:75 levels across three exciting level packs\n3 loveable characters that are fully customisable with dazzling array of accessories\n20+ achievements, do you have what it takes to earn them all?\nBeautiful visuals accompanied by entertaining animations\nOriginal music and sound effects from the award-winning composer Vince Webb\nSteam achievements, leaderboards and trading cards","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Coatsink","platforms":[{"id":0,"name":"PC"}]},{"id":12797,"name":"The Journey Down: Chapter Three","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ecb/ecb47e592f1608baf0a5270bebf2e28d.jpg","description":"In the jungles of the Underland, scattered remnants of an ancient culture speak of a great evil that dwells in the shadowy depths of the Kwayerumoshi caves. But even the darkest secrets of this lost age are about to be revealed by the brave actions of three unlikely heroes.\nIn the final chapter of The Journey Down, Bwana, Kito and Lina explore the vast reaches of the Underland and unravel its long-forgotten history. Their adventure comes to a bombastic conclusion when they learn the true nature of the Great Asili tree and the Armando Power Company.\nThe Journey Down is a classic point-and-click saga with an Afro-Caribbean vibe. Get ready to embark on an epic journey of brain-teasing adventure!Features\n* A twisting tale of intriguing adventure\n* Tons of handpainted environments\n* An all original jazzy reggae soundtrack\n* A fully voiced cast\n* HD art and animations\nhttp://store.steampowered.com/app/220090/\nhttp://store.steampowered.com/app/262850/","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"BlitWorks","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":499,"name":"Battle Islands","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/959/959b4d3c3b500a69c3e2774a6e93ed8d.jpg","description":"\"It’s 1942, and deep in the South Pacific your platoon of crack troops lands on a tropical island, but can you defeat enemy forces and hold your ground to fight another day?\nYou’ll need to act quickly in this action-packed, WW2-themed battle strategy game – Control air, sea, and land forces, build your garrison, battle against friends and create powerful allegiances!\nControl troops, jeeps, tanks, boats and warplanes over air, sea, and land  as you vie for superiority deep in the South Pacific\nBuild and improve your military might, and use it to raid and pillage enemy islands and capture their resources\nMake sure you've a strong garrison - your enemies are itching to invade!\nExciting Real-time strategy and combat gameplay\nBattle against friends in the fight for supremacy\nIT'S TIME FOR BATTLE, SOLDIER!\"","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"505 Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":19585,"name":"Etherlords II","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fc3/fc37b5147a4b22a40abaf0e68189153f.jpg","description":"The saga continues! Etherlords II takes you back to the world of Ether and into a whole new realm of fantastic possibilities. Lead your hero on an unforgettable journey through lands filled with unsurpassed beauty and danger to unlock the ultimate mystery.\nEtherlords II is an exciting mix of role-play and tactical turn-based combat in the best traditions of fantasy trading card games.\nThis version of the game supports co-op battles via Internet, including Round Table mode: round robin elimination tournament with random set of cards.Key FeaturesFive campaigns covering a magnificent fantasy world\nHundreds of spells and creatures combine to create nearly unlimited tactical possibilities\nNew monsters and magic that can be used by any of the four races\nEnhance your Hero’s skills throughout each campaign with new spells, creatures and abilities.\nNon-linear missions with multiple paths to completion\nThorough tutorial system to help you learn basic and advanced dueling tactics\n4 multiplayer modes. A dedicated master server that calculates and maintains your statistics and raitings","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"Nival Interactive","platforms":[{"id":0,"name":"PC"}]},{"id":10020,"name":"Arizona Sunshine","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a1b/a1b735e48a08900f9e80a0ffa9f41e74.jpg","description":"Virtual reality meets the zombie apocalypse! Arizona Sunshine is a first-person shooter built exclusively for VR that immerses you in a post-apocalyptic southwestern America overrun by zombies.\nWhen you hear a flash of a human voice on the radio, your hopes surge - there are survivors out in the blistering heat of the post-apocalyptic Grand Canyon state! Armed with little more than your motion-controlled weapons and the scarce ammo and consumables you find along the way, you need to navigate the hordes of zombies coming for your brain in your desperate search for human contact.\nDeveloped from the ground up for HTC Vive and Oculus, Arizona Sunshine puts you in the midst of a zombie apocalypse. Handle weapons with real-life movements, freely explore a post-apocalyptic world, and put your survival skills to the test in VR - putting the undead back to rest is more thrilling than ever before.\nReal-life weapon handling: Using VR motion controllers, handle 25+ weapons with real-life movements. Anticipate attacks, manage ammo and aim down the sights to blast your enemies to undead pieces.\nFull-size campaign: Built in bite-sized VR chunks that together form a full narrative, the campaign allows you to jump in for a short session or stay for the complete ride.\nFree exploration: Move around without restraints to explore a series of huge southwestern American environments, including treacherous canyons and deep, dark mines.\nImmersive zombie survival: Scavenge the environment, loot undead enemies and manage your ammo and consumables in a battle for survival more immersive than ever before thanks to VR.\nCo-op multiplayer: Join forces with a friend in co-op campaign mode or multiplayer Horde mode for up to four players. But beware, more warm brains mean more hungry undead.\nUnprecedented VR realism: When powered by an Intel® Core™ i7 processor or equivalent, Arizona Sunshine brings unprecedented realism to VR gaming with zombie mutilation, destructible environments, and an overall cinematic and immersive experience.\nOnly in VR: Arizona Sunshine is a VR shooter exclusively built for VR. Step into the midst of a zombie apocalypse as if you were really there and take on the undead unlike ever before.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Vertigo Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":18342,"name":"Monday Night Combat","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/e8b/e8b50920b3b0545a4ad25554b3b4c493.jpg","description":"Monday Night Combat is a class-based, third-person shooter… and the most popular lethal sport of the future! It blends intense combat, finishing moves, and gameshow-like challenges and rewards to produce an action experience unlike any other. Why fight for “honor” or “duty” when you can fight for the real American dream: cash, fame and endorsements?\nKey Features:\nIt’s the Throwback Throwdown in Monday Night Combat! Uncle Tully’s Funland is now available in Crossfire with new game play features! First up we have Chickey Cantor. He will now spawn in Uncle Tully’s Funland. Make Chickey fly away by shooting him and earn a big single-life buff for your entire team! Wait for Chickey to slam the ground and then you can grapple him. Ride him for eight seconds and earn big money! Just be careful, riders tend to be easy targets for enemy Pros. Secondly we’re introducing new bot spawners. These spawners have buttons for specifically spawning Jackbots, Black Jacks, Slims, Scramblers, Gremlins, Gapshots and Bouncers.\nCo-op\nBlitz mode allow players to defend their Money Ball against armies of robots by themselves or four player co-op over Steam. During various Blitz challenges, players can spend money earned by destroying bots to build defensive turrets around the Moneyball, upgrade one of six unique character classes, or set off robot crushing environment hazards. The Challenges vary from a ten round Exhibition Blitz to endless robot waves of ever increasing difficulty in Super Sudden Death Blitz. Money earned from each Challenge goes into a persistent Lifetime Earnings that allows players to unlock over 370 ProTags, create custom classes, and get ranked on Leaderboards.\nCompetitive Multiplayer\nCrossfire mode pits teams of players against each other over Steam. Each team is supported by an endless stream of robots fighting on their behalf; overwhelming your opponent’s stream, upgrading your Pros, and base defenses will be the key to your success!\nCustomizable Characters\nEach Pro caters to their unique style of play and comes with their own set of upgradeable skills.  Customize those skills and abilities even further with a variety of unlockable products in the Custom Class feature.\nPersistent Stats\nEvery game of Monday Night Combat earns the player money that goes towards their Lifetime Earnings. Lifetime Earnings can be spent on unlocking custom classes and buying earned ProTags. How much Lifetime Earnings you have also determines what level you are. Monday Night Combat keeps a large set of persistent statistics for all aspects of gameplay. MNC features over 370 ‘ProTags’ which are customizable tags you can show off to other players and friends.\nDedicated Servers\nHost multiple instances of MNC dedicated servers with full stand alone client.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Uber Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":11473,"name":"H1Z1: Just Survive","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ff2/ff244a89bde8395c8d3664df8dbbd332.jpg","description":"Just Survive is a post-apocalyptic survival game that immerses you in a world where humanity is fighting to take back control from the zombie hordes.\nScavenge for supplies, craft items, and build Strongholds to protect against dangers, both living and undead, that lurk around every corner.\nSURVIVAL - Though the great outbreak has passed, the undead still linger in considerable numbers outside the safety of Military Bases. Stay alert and quiet to avoid attracting them, and be prepared to either run or fight for your life at a moment’s notice.\nCRAFT - Gathering raw materials is a key part of crafting. Axes, pickaxes, and crowbars allow you to harvest the various trees, rocks, and vehicles scattered around the world. You should collect what you can, when you’re not actively fending off threats.\nTAKE BACK CONTROL - The first step in re-establishing society is to solidify a foothold in the struggle against the undead, and you can help by claiming a Stronghold in Badwater Canyon. Each location has unique advantages, so it’s wise to scout before making a commitment.\nCOORDINATE - Those that want to travel safely, access contested locations, and successfully defend their Strongholds will want to work together with other players. Note that Badwater Canyon is a desperate place, and your neighbors may find that they’re better off just taking what they need from your dead body.\nDo you have what it takes to Just Survive?\nVisit the Just Survive website https://www.justsurvive.com to learn more about this game.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Daybreak Games Company","platforms":[{"id":0,"name":"PC"}]},{"id":846499,"name":"Shatterline","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/def/def62dcd2d1751dc4dd38d662919a6f9.jpg","description":"JOIN OUR DISCORD\nAbout the GameWe are Frag Lab, an independent development studio located in Kyiv, Ukraine. Never could we imagine that we would be making Shatterline in the midst of a war…\nShatterline is a free-to-play arena FPS with a roguelike co-op mode (Expedition) as well as several traditional PvP modes such as TDM, Conquest, Plant-the-Bomb, and Escort. Players can choose from 8 unique Operatives and an armory of 25 weapons that can be customized via attachments.\nBuilding Shatterline has been our shared passion for five years and building the Frag Lab Studio for even longer than that. Several months ago we lost our publisher, but we continued to work on Shatterline. We finished key game systems, fixed hundreds of bugs, polished the gunplay, and figured out how to publish our game to Steam. Now we come back to you, the community of players, to help us shape the future of Shatterline.\nOur approach to developing Shatterline brings you, the player, into our development process. We believe this community-partnered approach to development will result in a lasting game that shooter players love.\n\nOur team is very active in Discord with the community and we play together daily. Each week we gather up Discord feedback and in-game telemetry data, then we debate about what we believe will improve the game. We put the stuff that survives the crucible of debate and community scrutiny into our future development roadmap. We keep the game fresh with monthly releases of new content and features.\nWe ask you to give Shatterline a try. We believe you will be impressed.\nShatterline is beta/pre-release software. Some features may not work correctly, and this version of the game may be unstable at times.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Frag Lab","platforms":[{"id":0,"name":"PC"}]},{"id":268363,"name":"Prodeus","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f7a/f7a0b6c68b86058de31414ebf1355acf.jpg","description":"(Make sure you full-screen the screenshots above for HD resolution)\r\nProdeus is the first person shooter of old, re-imagined using modern rendering techniques. It reaches the quality you expect from a AAA experience while adhering to some of the aesthetic technical limits of older hardware.Our Art Style:High Quality 3D Retro Aesthetic\r\nA focus on over the top visual effects.\r\nAwesome dismemberment system\r\nInfinite blood (go crazy, paint the walls red!)\r\nGameplay: Fast pace action\r\nHellish destruction\r\nDynamic Soundtrack\r\nVisceral and engaging combat scenarios\r\nHeavy duty weaponry\r\nA multitude of secrets to discover\r\nReplayability:Continuous support\r\nUser generated content\r\nEasy to use Level Editor\r\nThe Team:Prodeus is being developed by Michael Voeller and Jason Mojica of Bounding Box Software who have a combined 25 years FPS development experience, along with talented freelance artists and designers.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"Desconocido","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":16373,"name":"Age of Wonders","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ba6/ba64ae0a88c375df64a0f713fa889b5e.jpg","description":"Welcome to Age of Wonders, the authentic turn based fantasy strategy classic that started the hit series. Age of Wonders’ intimate atmosphere with painterly graphics still shines today. The game’s fully patched up,  start building your fantasy empire today!\nThe Age of Wonders, once a time of magic and peace.  An age swept into the ravaging gale of chaos by the arrival of a single, uninvited race: the Humans. The fragile balance that existed between the ancient races, Elves, Dwarves, Orcs and others, has changed into a struggle for power and survival in the wake of the turmoil the Humans have brought to the land. Prepare for a strategy adventure where you will uncover wondrous ancient artifacts, awesome magical power, and the secrets of a shattered empire. Ally with the forces of light or darkness to determine the fate of the world in the Age of Wonders!\nKey features:\nAge of Wonders is a turn-based game combining the best elements of strategy, adventure and role-playing.\n12 unique fantasy races, over 50 different heroes with upgradable abilities, dozens of spells and scores of locations to explore.\nEmploy strategic and tactical skills to command troops in capturing vital locations and defeating enemies.\nBattle your way through vast open lands, breach the outer wall in city sieges and explore deadly dungeons.\nForge strategic alliances with compatible races to leverage each race's unique skills and abilities.\nExperience captivating single player campaign playable from the light and dark side.\nPlay multi-player games against your friends through hotseat play, play-by-email, over LAN or the Internet. The latter two modes feature an additional game play mode of simultaneous turns for a fast game pace.","review":"","timePlayed":0.0,"releaseYear":1999,"developer":"Triumph Studios","platforms":[{"id":0,"name":"PC"}]},{"id":6315,"name":"Yesterday","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/545/545635980647584c3afb794579bbce2b.jpg","description":"Who is John Yesterday?\nAfter captivating players from all around the world with the mythic Runaway trilogy, Pendulo Studios presents a new adventure gaming masterpiece! This thrilling mystery, presenting a unique, dark and somber style, will not leave you indifferent! With an incredible story, superb environments, perplexing and shady characters, Yesterday throws you into an unforgettable adventure from which you will not emerge unscathed.\nNew York in 2011… Homeless people are disappearing one after another, their bodies found lifeless. Meanwhile, a Y-shaped scar appears on the hands of seemingly unrelated people. Henry White, a young and rich heir dedicated to a charitable organization, and his friend Cooper, are the first to investigate. They will soon cross paths with the enigmatic John Yesterday, whose memory seems to have been wiped clear, and who will find himself dragged into this incredible story!\nHow far will you go to discover who John really is, and what he did… Yesterday?\nAn original mystery, a terrifying secret\nA great adventure around the world\nOminous, shady characters\nAnimated film quality production","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Pendulo Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":351436,"name":"Evan's Remains","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/fe4/fe4ed73789568938d2ae60e4e2a59c01.jpg","description":"KICKSTARTER ENDING SOONCAMPAIGN HERE\nAbout the GameEvan's Remains is a mystery-thriller puzzle adventure about finding a missing boy: Evan. The game combines logic-based platform puzzles with narrative inspired by Japanese graphic adventure games.\nGameplay: Every time the player solves from two to three puzzles, the story goes forward and new mechanics are introduced. The challenge of the puzzles lies in the player’s ability to figure out what do rather than solve challenges based on skill. As the difficulty curve increases, the puzzles become more complex by combining two or more previously introduced mechanics.\nStory: Evan, the genius boy, has been missing for years. One day, a letter signed by him is received, claiming he’s on an uninhabited island somewhere in the Pacific Ocean. Nobody knows why, but he asked specifically for a girl named “Dysis” to go and look for him. The player will take control of this girl, who we don’t know much about. As we follow Dysis’s adventure, questions will start to be answered little by little. All of the little puzzle pieces which seemed unrelated in the beginning will now begin to slowly fit together as the truth is slowly revealed.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Whitethorn Digital","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"}]},{"id":62920,"name":"Mable & The Wood","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/21d/21d3c9b7a8c644310b12e29d41ea03c0.jpg","description":"You play as Mable, a shape-shifting girl who can take the form of the creatures that she kills.\nThe strange cult that resurrected you speak of an ancient prophecy that says you will hunt down the great beasts, take their shape, and use their powers to save this dying world.\nBut what if they're wrong? The prophecy is old, and words lose their meaning with time...\nWhen the world is falling apart around you, what will you do?\nIn Mable & The Wood, it's up to you to make that choice. You don't have to kill anyone, but you might kill everyone.\nWill you banish the darkness, or will you become it?\nHUNT THE GREAT BEASTS\nDefeat the great beasts to take their shape and transform into a fairy, spider, stone golem, mole, medusa and more!EXPLORE A DYING WORLD\nThe game takes place in a dark fantasy world, with each area making up part of a large, complex map that's packed full of all kinds of secrets for you to discover.DISCOVER WHO YOU REALLY ARE\nDiscover a rich story and define your own role in it. Will you become the saviour everyone's trying to convince you to be, or will your actions lead to the world literally tearing itself apart?\nFeatures\nCombat is movement and movement is combat - change shape to move in mysterious unique ways and kill enemiesA diverse cast of characters with their own take on this whole 'end of the world' thingA large and varied fantasy world, brought to life with state-of-the-art pixel technology and a beautiful original soundtrackDesigned for multiple playthroughs, with different endings, different routes to take through the world and secrets to discover","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Triplevision Games","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":59094,"name":"Youropa","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/fee/feee3f23f3d9cd5518f280a60e5ebbb9.jpg","description":"Waking up trapped in a tree, with no recollection of anything, you must explore a strange fragmented city floating in the sky to learn who you are and where you fit into the world.\nGravity Defying Gameplay - Walk upside down, on walls, in fact walk anywhere you can get to. Your suction cup feet let's you stick to any surface.\nMind Bending Puzzles - Solve complex logical & physical puzzles using your unique abilities.\nEvolve & Explore - Learn new abilities and use them to explore the fragmented city further.\nCreate Your Own Game - Built-in level, map and character editors let's you build an entirely new game using simple tools. You'll be creating in minutes.\nYou play a You (short for Youropean), a small humanoid with suction cups instead of feet, which allows you to walk up walls and on ceilings. You must use your unique ability to solve a constantly evolving set of challenges. You will encounter physical puzzles, riddles, ferocious enemies, environmental hazards and more, in an abstract but logical universe that challenges your perception of the 3rd dimension.\nExpand the game by building your own levels, cities and creating your own characters. The entire game is created using the incredibly easy to use built-in editing tools. Unlock more than 450 building blocks, construct amazing levels and build entire adventures by linking the levels together on the map.\nYouropa is a game about breaking rules, being upside down and thinking outside the box.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"frecle ApS","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"}]},{"id":21113,"name":"Dead Pixels","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/cee/ceec6d4fb36f675a52b2de3b35374104.jpg","description":"A toxic waste spill finds its way into the water supply, causing the recently deceased to rise from their graves. Now it's up to you to blast your way through the hordes of undead if you're going to escape the city. On the way to your rescue, you'll search stores and houses for supplies, and trade with other survivors.\nWith three game modes, hundreds of items, weapons and grenades, and a city that is never the same twice, there is always something new hiding round the corner in Dead Pixels.\nWhen the Dead Start Walking, It's Time to Run.Key Features: Over 100 weapons, grenades and items\nA procedurally generated city, that's different every time you play\n3 different modes of play\n4 different difficulty modes\nSingle player and two player local co-op\nOnline leaderboards\n30 achievements","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"CSR-Studios","platforms":[{"id":0,"name":"PC"}]},{"id":9726,"name":"WARMACHINE: Tactics","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/c2c/c2c1269ee4fbbc402d93fbe805ebb50b.jpg","description":"In WARMACHINE, the very earth shakes during fierce confrontations where six-ton constructs of iron and steel slam into each other with the devastating force of a locomotive, where lead-spewing cannons chew through armor plating as easily as flesh, and where bold heroes set the battlefield ablaze with a tempest of arcane magic as they forge the fates of their unyielding nations in the fires of destruction.\nTake control of an elite battle mage known as a warcaster and his army of unstoppable warjacks and deadly soldiers in this intense and aggressive turn-based tactical combat game set in the award-winning, steam-powered world of the Iron Kingdoms.\nWARMACHINE: Tactics is a next-generation turn-based tactical game developed with the Unreal 4 engine. Cutting-edge visuals, an immersive world setting, and squad customization features offer a rich multiplayer experience along with an extensive single-player campaign that will appeal to fans of revered tactical games like X-Com: Enemy Unknown and The Valkyria Chronicles.\nLearn more about the WARMACHINE: Tactics and the Iron Kingdoms at: http://warmachinetactics.com\nFeatures:\nONLINE MULTIPLAYER\n• Four armies representing the four core factions of the Iron Kingdoms. Each army contains three Warcasters, multiple Warjacks, and multiple Warrior units!\n• A point-based squad customization system that allows you to decide exactly what units and strategies you take into battle!\n• Five multiplayer maps: Forest Ruins, Trenches At the Border, Swamp Bridges, Orgoth Ruins and Snowy Valley. New Multiplayer maps will release regularly, always for free!\n• An epic single-player campaign featuring 21 missions and an engaging storyline that will immerse you in the world of the Iron Kingdoms!\n• AI Skirmish Mode!\nDEMO Features:\nONLINE MULTIPLAYER\n• Four armies representing the four core factions of the Iron Kingdoms. Each army contains one warcaster, two Warjacks and multiple Warrior units!\n• All available multiplayer maps!\n• Three missions of our epic single player campaign!\n• AI Skirmish Mode!\nJoin the fight, now!","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"WhiteMoon Dreams","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":2196,"name":"ADR1FT","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1f6/1f61b70530af6cc8b1ec8e4277e70f4a.jpg","description":"ADR1FT is an immersive First Person Experience (FPX) that tells the story of an astronaut in peril. Floating silently amongst the wreckage of a destroyed space station with no memory and a severely damaged EVA suit slowly leaking oxygen, the only survivor struggles to determine the cause of the catastrophic event that took the lives of everyone on board. The player fights to stay alive by exploring the wreckage for precious resources, and overcomes the challenges of an unforgiving environment to repair the damaged EEV and safely return home.\n\"ADR1FT brings your childhood dream of being an astronaut to life\"\n-MASHABLE\n\"Breathtaking\"\n-USA TODAY\n\"No floor, no ceiling, just cold open space\"\n-FORBES\n\"A gripping, tense experience\"\n-IGN\n\"Mesmerizing\"\n-YAHOO GAMES\n\"Stunning\"\n-POLYGON\n\"Deeply Personal\"\n-LOS ANGELES TIMES","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"505 Games","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":52336,"name":"Age of Empires: Definitive Edition","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ee2/ee26304beaa6cda35c53604868164cca.jpg","description":"Age of Empires, the pivotal RTS that launched a 20-year legacy returns in definitive form for Windows 10 PCs. Bringing together all of the officially released content with modernized gameplay, all-new visuals and a host of other new features, Age of Empires: Definitive Edition is the complete RTS package. Engage in over 40 hours of updated campaign content with new narration and pacing, jump online in up to 8-player battles with new competitive features and modes, experience 4K HD visuals with overhauled animations, get creative with the scenario builder and share your creations. There’s never been a better time to jump in to Age of Empires. Welcome back to history.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Relic Entertainment","platforms":[{"id":0,"name":"PC"}]},{"id":29185,"name":"Mario + Rabbids Kingdom Battle","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/5be/5befaab8379bd48b8e9b97cc60b0f5e6.jpg","description":"The Mushroom Kingdom has been torn apart by a mysterious vortex,\ntransporting the chaotic Rabbids into this once-peaceful land. To\nrestore order, Mario, Luigi, Princess Peach, and Yoshi must team up with\na whole new crew: four Rabbids heroes! Together, they will battle with\nweapons through four worlds filled with combat, puzzles, and\nunpredictable enemies.\n\nDeveloped exclusively for the Nintendo Switch™ system, Mario + Rabbids\nKingdom Battle is the best of the Mario and Rabbids franchises,\ncombining all that you love about Mario's iconic universe with the\nside-splitting antics of the Rabbids.\n\nMario & Rabbids universes collide in this new adventure that combines\nthe best of these two worlds!\n\nMario, Luigi, Princess Peach, and Yoshi join forces with four Rabbids\nheroes with their own unique personalities.\n\nEasy to play, difficult to master. Solo and co-op turn-based combat is a\nfresh gameplay experience.\n\nBattle with an arsenal of weapons through four new worlds filled with\nenemies, puzzles, and humorous fun!\n\nPick up and play anywhere exclusively on the Nintendo Switch system,\neven on the go.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Ubisoft Paris","platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":29051,"name":"Lost Odyssey","genre":"RPG","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/25e/25efc107f35db6be809152f0f9dc793d.jpg","description":"Lost Odyssey is the story of Kaim, an immortal character who has lived more than 1,000 years. He doesn't remember his past, and he doesn't know where his future lies. Throughout Kaim's journey, a handful of characters join him on an odyssey to discover their intricate past and destiny, leading players through a dramatic story of massive scale. Massively multiplayer online role-playing game elements are blended into the game's traditional role-playing game system, enabling players to make strategic decisions for a more immersive and deep gameplay experience. With story sequences penned by award-winning Japanese novelist Kiyoshi Shigematsu in cooperation with producer Hironobu Sakaguchi, Lost Odyssey sets a new benchmark for the RPG genre with a combination of true-to-life cinematics and an intriguing story of an immortal man. Players will witness Kaim's life as he lives through many generations, becomes part of numerous families, falls in and out of love, and confronts all of the conflicts that arise. Kaim's struggles are set in a world that is on the verge of a \"mystical industrial revolution,\" where mankind has attained dark powers. The massively scoped worlds, memorable characters and epic storyline play as an intense and unsettling blockbuster action film. Heading up the artistic demands of the title is famed Japanese comic artist Takehiko Inoue. Renowned composer Nobuo Uematsu has been recruited to create a contemporary soundtrack.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"Mistwalker","platforms":[{"id":0,"name":"Xbox 360"}]}]