[{"id":9612,"name":"Ghost of a Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cbd/cbdaa32349be63a57099669be29dc7ca.jpg","description":"Ghost of a Tale is an action-RPG game in which you play as Tilo, a mouse and minstrel caught up in a perilous adventure. The game takes place in a medieval world populated only by animals, and puts an emphasis on immersion and exploration. It features stealth elements, disguises, conversations with allies and enemies, and quests.\nYou’ll be able to explore the secrets of Dwindling Heights Keep and navigate its dangers. Tilo is not much of a fighter, so stealth and nimbleness are your allies when confronted with enemies twice your size. Talk to the characters you meet and leave no stone unturned in your quest to find Merra, your true love….About the team:\nGhost of a tale is developed by a very small team. Lionel \"Seith\" Gallat does 90% of the art, design and coding. Paul Gardner is the game's writer and an experienced game designer. Cyrille Paulhiac does coding and develops tools. Jeremiah Pena is the game's composer, while Nicolas Titeux is responsible for sound design.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Plug In Digital","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":20567,"name":"X-COM: Apocalypse","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/56f/56fd482d5e916432d88c5b23a6b8a3b8.jpg","description":"X-COM: Apocalypse is a strategy game that supports both a real-time and turn-based playthrough. It’s the final part of the classic UFO trilogy within the X-COM series. The story is set in the future, in the last city on Earth, Megaprime. Additionally to its inner problems with different factions that try to take control over the city, Megaprime is attacked by aliens. Here X-COM soldiers join the game to protect citizens.\n\nThe gameplay is focused on base building and technology development. You also train and upgrade your soldiers. The game consists of several linear missions: you get a signal about aliens’ spacecraft, you shoot it down and kill all the enemies. Another sphere of your interest is the city: you need to find allies and strengthen your authority among people. However, there’s a lack of realistic economics in the game, so you can perform illegal actions without any effect on the story.","review":"","timePlayed":0.0,"releaseYear":1997,"developer":"MicroProse Software","platforms":[{"id":0,"name":"PC"}]},{"id":3871,"name":"Proteus","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0de/0de6cfe8744a8d5b08b448ff485f2101.jpg","description":"Steam Big Picture Mode\nAbout the GameProteus is a game about exploration and immersion in a dream-like island world where the soundtrack to your play is created by your surroundings. Played in first-person, the primary means of interaction is simply your presence in the world and how you observe it.  The procedurally generated islands are home to creatures natural and imagined, tranquil valleys and ruins with magical properties.Key Features: Meditative play: the responsive world and lack of any text or hints distils an essence of curious, investigative play, and rewards patience and immersion.\nDynamic soundtrack composed by award-winning musician David Kanaga follows the mood of the world and will appeal to fans of Boards of Canada, Brian Eno.\nA distinctive 2D-but-3D graphical style with wild shifting palettes that sits somewhere between 8-bit videogames and early 20th century modernist painting.\nIslands are uniquely generated every time, and although it's theoretically possible to see everything in one playthrough, no-one ever does.\nBuilt-in \"postcard\" function encodes world data into each screenshot, allowing islands and discoveries to be saved and shared.","review":"","timePlayed":0.0,"releaseYear":2013,"developer":"Curve Digital","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":339959,"name":"Wolfenstein: Enemy Territory","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/3dc/3dcbd0d88127ee0fda5c8238552a1ff8.jpg","description":"Wolfenstein: Enemy Territory is a downloadable, free-to-play multiplayer game in which players wage war as Axis or Allies in team-based combat. It’s a team game; you will win or fall along with your comrades. The only way to complete the objectives that lead to victory is by cooperation, with each player covering their teammates and using their class special abilities in concert with the others.\n\nFeaturing multiplayer support for up to 32 players, Wolfenstein: Enemy Territory is the ultimate test of communication and teamwork on the battlefield. Players join the fray as one of five distinct character classes each with unique combat abilities. Each Axis or Allies team can divide itself into smaller fire teams for quick and easy communication using an intuitive messaging system and dynamic command map of the entire battlefield.","review":"","timePlayed":0.0,"releaseYear":2003,"developer":"id Software","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":1195,"name":"GOD EATER 2: Rage Burst","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/73e/73e4d78a55248fc26a4e06726b6bd969.jpg","description":"Three years after the events of GOD EATER: Resurrection, a mysterious red rain sparks a fatal pandemic called the Black Plague. Take control of their newest recruit as you master incredible weaponry, challenge enormous monsters, and cooperate with an iconic cast of characters fighting for humanity in GOD EATER 2: Rage Burst.\n• More Than One Way to Slay a Monster – Use “God Arcs”, massive weapons created from Oracle Cells, to hack, slash, shoot and devour Aragami.\n• Monstrous Content – GOD EATER 2: Rage Burst continues the epic GOD EATER saga, featuring new and returning heroes, rich character and weapon customization, and over 100 hours of story and gameplay content, fully voiced in English.\n• Power of Blood – Learn over 400 different Blood Arts for Melee weapons to enhance your attacks and Blood Bullets to add various attributes.\n• Squad Up – Play with up to 3 additional players online to form a cooperative four man cell, perfect for taking on the most difficult of missions.\nAdditional hardware required for Remote Play.\nAdditional hardware required for Interconnectivity.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1 player\nNetwork Players 2-4\n11GB minimum save size\nDUALSHOCK®4\nRemote Play\nInterconnectivity PS4™ • PS Vita\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\nGOD EATER™ 2 Rage Burst&©2015 BANDAI NAMCO Entertainment Inc.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Bandai Namco Entertainment","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":58549,"name":"Onrush","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/97b/97b80dc92bf8f860eba740b63c2219a3.jpg","description":"ONRUSH is a new breed of high-impact, adrenaline fuelled off-road arcade racing! It’s about speed, takedowns and teamwork with high-tempo thrills that focus on fun, excitement and the spectacular.\r\n\r\nTAKEDOWNS\r\nTakedowns are core to ONRUSH. Speed off cliff edges and traverse huge ramps flying hundreds of feet through the bold, bright sky. Land with immense force crushing any opposing team vehicles unfortunate enough to be below.\r\n\r\nRUSH\r\nBoosting at breakneck speed only gets you so far. To really gain an unworldly edge, unleash the invulnerable, euphoric blast of speed and power RUSH! Completely unique to each vehicle in both look and ability, this is like nothing seen in any racing game before.\r\n\r\nTHE STAMPEDE\r\nThe Stampede System makes sure you are always in the action. Racing is at its most exciting when you’re wheel to wheel right in the ‘thick of it’ and ONRUSH does just that. Never have a race ruined by spinning out or losing the pack. In ONRUSH you respawn right back into the mix ready to make an impact and perform the next most amazing takedown.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Codemasters","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":10069,"name":"Mount & Blade II: Bannerlord","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0aa/0aa81c3f82acec65b44e854352522cd6.jpg","description":"The horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashes of the old.\nMount & Blade II: Bannerlord is the eagerly awaited sequel to the acclaimed medieval combat simulator and role-playing game Mount & Blade: Warband. Set 200 years before, it expands both the detailed fighting system and the world of Calradia. Bombard mountain fastnesses with siege engines, establish secret criminal empires in the back alleys of cities, or charge into the thick of chaotic battles in your quest for power.\nSIEGE GAMEPLAY\nConstruct, position and fire a range of heavy machinery in sieges that will test your wits and skill like never before. Experience epic, sprawling combat across ramparts and rubble as you desperately hold on to your castle or seek to seize one from the enemy.\nHistorically authentic defensive structures offer the ultimate medieval warfare experience, as you batter a rival's gate with your ram or burn his siege tower to ashes. Mount & Blade II: Bannerlord lets you live every moment of a chaotic battle through the eyes of a single soldier.\nDIPLOMACY\nEngage in diplomacy, with meaningful consequences that impact the world. Strike historic peace deals that win land for your kingdom or free you to take on a new foe. An all-new barter system gives players flexibility in cementing deals, from marriage offers to treason pacts, offering all the options available to NPCs. Use a new influence system to direct your faction's energies or strangle the aspirations of a rival.\nSANDBOX ECONOMY\nSee the availability of goods ebb and flow in a simulated feudal economy, where the price of everything from incense to warhorses fluctuates with supply and demand. Invest in farms and workshops, or turn anarchy to your advantage by being the first to bring grain to a starving town after a siege or reopening a bandit-plagued caravan route.\nCRAFTING\nCraft your own weapon, name it and carry it with you to the field of battle! A deep, physics-based system gives each weapon you create a unique set of attributes, strengths and weaknesses. Forge a finely-tuned killing machine to match your own prowess and complement your play-style, or take the sword of your enemy and brandish it as a trophy of war.\nMODDING\nThe engine and tools used to develop Mount & Blade II: Bannerlord are being made available to the community, so that modders can re-interpret Calradia or create their own worlds! Players can now combine different mods, making it easier than ever to play the game of your dreams.\nENGINE\nAn all-new tailor-made game engine, developed in-house to fulfill the unique needs of the series, offers the perfect balance of performance and graphical fidelity, scalable with the power of your hardware.\nExperience Mount & Blade with richer, more beautiful graphics than ever, immersing you in the world of Calradia, rendering the game's magnificent battles with equally spectacular detail.","review":"","timePlayed":0.0,"releaseYear":2022,"developer":"TaleWorlds Entertainment","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series S/X"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1935,"name":"LEGO Star Wars: The Force Awakens","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/52c/52ce473a52dea733e831e1aeacce2d89.jpg","description":"The Force is strong with this one… The No. 1 LEGO® videogame franchise triumphantly returns with a fun-filled, humorous journey through the new Star Wars adventure. Play as all of the characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain Phasma.\nIn LEGO® Star Wars™: The Force Awakens™, relive the epic action from the blockbuster film in way that only LEGO can offer, featuring brand new story content from the Star Wars Universe that explores the time between Star Wars: Return of the Jedi and Star Wars: The Force Awakens.\nLEGO Star Wars: The Force Awakens introduces new gameplay mechanics, including the enhanced Multi-Builds system, where players can choose from multiple building options to advance the game, or engage in intense new Blaster Battles for the first time, utilizing surrounding environments to drive back the First Order.\"","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Feral Interactive","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":62897,"name":"The Beast Inside","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59e/59e83c7c485f9915205dd23ced6c0b12.jpg","description":"Adam, CIA cryptanalyst, leaves Boston and moves to the country with his wife, Emma. His handlers are afraid they won’t be able to keep him safe there, but Adam believes he needs a peaceful place in the woodland, to take a shot at military code and alter the course of the Cold War. As it turns out, this area is quite the opposite of a peaceful place...\nIn the attic Adam finds the hidden diary of Nicolas which, once opened, carries the nightmares of the past right into the present, putting the lives of both Adam and Emma in a great danger. How come the mysteries from Civil War era seem to be connected to what is happening during the Cold War?\nWho was Nicolas, the man who lived in that house more than a hundred years ago?\nThe Beast Inside offers a gripping new twist on thriller and survival horror genres.\nLong-buried secrets, personal tragedies and madness spanning more than a century. Story driven game merging horror and thriller. The Beast Inside seamlessly merges survival horror and thriller, offering gripping new twists in both genres.\nDiscovering complex semi-open world from first person perspective\nControlling two protagonists in two different time periods\nEvery item is fully interactive\nInteracting with the environment and solving physics-based puzzles\nBreaking and deciphering codes, looking for clues in old texts\nHiding and running from a wide range of entities\nOr fighting with them, using a revolver and environmental advantages or your wits\nRealistic graphics - achieved with the magic of UE4 engine and an extended use of photogrammetry techniques.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"Illusion Ray Studio","platforms":[{"id":0,"name":"PC"}]},{"id":13249,"name":"Xenonauts","genre":"Strategy","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/0af/0af9b0d0322516683e0a84ab79893ce6.jpg","description":"Xenonauts is a strategy game in which you control a multi-national military organisation defending a Cold War-era Earth from alien invasion, using small squads of persistent soldiers to eliminate the extraterrestrials and recover their technology in turn-based ground combat. A detailed strategic layer allows you to co-ordinate the defence of the planet, using your interceptors to shoot down UFOs and researching captured artefacts to learn about your foes and unlock new combat equipment to use on your missions.\nXenonauts is a spiritual successor to the classic X-Com strategy games from the 1990s. We aim to improve the graphics, add new content and streamline the interface whilst still retaining all of the key mechanics of the original games. Devoted fans should love this game, but we're also keen to introduce the joys of old-school grand strategy to a whole new generation of players who might not otherwise experience it!\nPlease note that the native Mac / Linux versions of the game are still in beta, however older WINE-wrapped \"ports\" are available and known to be stable whilst development of the native ports is still ongoing.Key Features\nGround Combat: Xenonauts delivers tense turn-based combat across realistic, varied and fully-destructible battlefields, against almost fifty different variants of enemy. Missions range from capturing crashed UFOs or alien bases to defending cities (or even Xenonaut facilities) against alien attack. You'll experience the chill of encountering a new alien for the first time and the joys of test-firing a new weapon for the first time. Deeply asymmetric combat keeps the battles interesting - after all, you're fighting intergalactic invaders with 1970's ballistic technology! Strategic Management: You will also be managing the defence of the planet, dealing with the invading alien UFOs with your customisable interceptors. You need to balance the needs of your funding nations with your own. Your funds are limited - are you going to spend them on battlefield equipment, more scientists, or expanding your coverage of the planet? Your priorities must be balanced carefully if you are to win the war. Research Tree: Xenonauts has an extensive research tree with almost a hundred projects to unlock, each with its own unique description and painted artwork. It slowly reveals the intentions and origins of the invaders, while also unlocking new battlefield equipment, aircraft and vehicles for you to use as you harness alien technology and turn it against them.  Persistent Soldiers: Soldiers in Xenonauts are persistent from mission to mission, improving their stats and gaining ranks with combat experience - but their deaths are always only a single bad move away. You will grow to care about the brave men and women under your command as they slowly grow from green rookies into hardened veterans, but that only makes it more painful when their heroic tale is cruelly cut short by a burst of plasma fire... Detailed, Emergent Simulation: Xenonauts contains no scripted missions, just broad rules setting the pace of the invasion. As such, no game plays out the same twice. If you shoot a Scout UFO down over a polar area, you get a Crash Site mission where you can capture a crashed Scout UFO in an Arctic tileset. Commence a battle at night and you'll be fighting the mission in the darkness with reduced sight range. If your base is attacked, you fight the defence in a perfect replica of your base. A lot of time has gone into weaving the two very different halves of the game together into something that feels both natural and enjoyable.","review":"","timePlayed":0.0,"releaseYear":2014,"developer":"Goldhawk Interactive","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":47234,"name":"Nioh: Complete Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c2f/c2fe235e65ccca9ce3ac83d25dfab400.jpg","description":"Ready to die? Experience the newest brutal action game from Team NINJA and Koei Tecmo Games. In the age of samurai, a lone traveler lands on the shores of Japan. He must fight his way through the vicious warriors and supernatural Yokai that infest the land in order to find that which he seeks.\nThe Complete Edition contains the full game, as well as the three expansions with additional story chapters: Dragon of the North, Defiant Honor, and Bloodshed's End.\nDragon of the North\nThis expansion opens up the Tohoku region, where the \"one-eyed dragon\" Date Masamune is secretly gathering spirit stones.\nDefiant Honor\nFight your way through the Siege of Osaka's winter campaign as you follow the story of one of Japan's greatest generals from the Warring States period, the brave Sanada Yukimura.\nBloodshed's End\nJoin the summer campaign of the Siege of Osaka as the Warring States period draws to a close in this, the final chapter of William's tale.\nSteam Exclusive Bonus\nEnjoy wearing the \"Dharmachakra Kabuto,\" a helmet exclusive to the Steam version of Nioh! You can claim yours by selecting \"Boons\" from a shrine.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Koei Tecmo","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":52179,"name":"This Is the Police 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/359/359ed2ec421d8efa3b45f37ccc25a297.jpg","description":"Interpret the law as you see fit in This Is the Police 2, sequel to the acclaimed noir drama This Is the Police! Run the sheriff’s department, manage your cops, investigate, interrogate, and incarcerate. Make tough decisions – and try to keep out of prison yourself! – in this story-driven mixture of adventure, strategy, and turn-based tactical combat.\nIs it a simulation? A management game? A tactical challenge? A visual novel? A puzzle? It’s all of these, and more!Dive into one-of-a-kind -story driven experience.Welcome to Sharpwood, a cold and harsh border town riven with violence, where no one is completely innocent. Smugglers, gangs, and screaming populists call this town their home. To maintain peace and order, the young sheriff Lilly Reed (Sarah Hamilton, The Longest Journey) will have to team up with fugitive criminal Jack Boyd (Jon St. John, Duke Nukem), and pray that her dangerous plan doesn’t spiral out of control.\nTake charge of the Sheriff’s department.Your subordinates aren’t just some resource; they are living people with their own strengths, weaknesses, fears and prejudices – and you'll have to reckon with all of them in order to survive. Is one of your guys drinking too much alcohol? Or always coming up with excuses for not coming to work? Or does he refuse to follow orders? You’ll have to show a steady hand if you want to impose discipline on this department.\nEngage in tactical combat.During your most dangerous operations, the game will switch to turn-based combat. Gather a team of your finest cops (or use your drunk and stupid bums – you don’t always have the luxury of being choosy!). Carefully study the terrain, adapt your plans, stealthily approach your suspects and use non-lethal weapons and equipment – if the situation allows. True, sometimes gunfights are almost impossible to avoid, but be careful: This Is the Police 2 doesn’t have hit points. A single bullet can cost a cop their life.\nBecome a true detective.Collect evidence, study case materials, interrogate suspects (or use more... forceful methods) and send the criminals to court. And if the suspect was innocent? Perhaps it's time to find out if any Sharpwood judges can be bought.","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"THQ Nordic","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":22448,"name":"Final DOOM","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/6cc/6ccd31115c74d58edb41d0855567d00f.jpg","description":"Final DOOM is a first-person shooter, a stand-alone expansion for the 1994 game DOOM II: Hell on Earth.  \n\n###Gameplay \nThe gameplay of Final DOOM is identical to previous games in the series. It consists of 32 levels (in PC version).\nIn each one, your goal is to find an exit from the level. It usually intends finding keys from multi-colored doors and fighting hordes on the demon. The player has access to different weapons such as a chainsaw, pistol, shotgun, and rocket launcher. There are many types of enemies in the game that vary in size, attacks, speed, amount of health from zombies and imps to huge cyberdemons and skeletons with rocket launchers on their shoulders. Aside from weapons, the player can use different weapons scattered throughout the map. Some of them replenish your health, ammo, and armor, and the other gives you temporary bonuses like increased damage, short-time invincibility acid resistance or invisibility. The levels are filled with secret rooms. Finding them is entirely optional but can significantly help by giving you new weapons early or providing with items and ammunition.  \n\n###Final DOOM differences \nFinal DOOM is essentially a collection of new maps divided into two packs: TNT: Evilution and The Plutonia Experiment. Different level designers outside ID Software created each pack. The game is noticeable for its hard difficulty that surpasses the level of two previous games.","review":"","timePlayed":0.0,"releaseYear":1996,"developer":"id Software","platforms":[{"id":0,"name":"PlayStation"},{"id":0,"name":"PC"},{"id":0,"name":"Classic Macintosh"}]},{"id":45156,"name":"We Were Here Too","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/a3e/a3ee2e99f5a85e4bd3fc0268ed5fd368.jpg","description":"We Were Here Too is an online only, first-person cooperative adventure, set in a fictional medieval castle. A game about teamwork through communication, discovery and immersion. As the sequel to We Were Here, it adds a whole new layer to the world of Castle Rock.\nThis game requires both players to have a working PC-compatible microphone.\n\nAs your final hour approaches, a large structure looms up in the distance - towering above the relentless storm. With nowhere else to go, you decide to enter this mysterious place, only to find yourself trapped inside… Will you be able to find a way out?\n\nCooperative – Your voice will have to lead the way. Placed in the shoes of two expeditioners, lost in a castle frozen in time, the only possession you have left is a walkie-talkie.\n\nImmersive – The warmth of life has long left the halls of Castle Rock. Immerse yourself in a thrilling experience as you and your partner puzzle your way through this abandoned fortress. Lose yourself in brand new environments and an original soundtrack.\n\nMysterious – We were not alone.. Darkness took over these once magnificent halls. Can you discover the truth behind this fate?\n\nWe Were Here Too features:\n\nChallenging communication-based teamwork – Play the game with friends or make new ones through a new and improved server browser system\nDifferent roles – Both players experience an asymmetrical storyline\nBrand new puzzles and environments - Randomized puzzle solutions ensure no playthrough will be the same!\nSoundtrack by the original composer behind We Were Here\nPlenty of secrets to be found and discoveries to be made\nA dark, twisted mystery - Was your sacrifice really necessary?\nPlay the Prologue chapter for free!","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Total Mayhem Games","platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":1999,"name":"Retro City Rampage DX","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/be1/be17f78d80b50121fa2ed6d4562d403e.jpg","description":"Retro City Rampage is a 2D action-adventure game with heavy focus on the parody of pop-culture, retro video games, and open-world action-adventure genre. The story follows The Player, a criminal who works for a crime syndicate. One day he steals a time-traveling telephone booth that sends him several decades into the future. Shortly after his time-machine breaks and now with the help of Doc Choc, a time-traveler and Emmett Brown parody, he seeks for the parts to repair the booth.  \nThe gameplay can be described as if original GTA was ported onto the 16-bit console. It mostly has a top-down perspective with several 2D side-scrolling transitions. The game is set in the big open city which player can freely explore. The game has many story missions, side missions and challenges. Like in GTA games, violent actions made by the player can attract police that would try to neutralize him. The wide a range of weapons and tools can be acquired in shops, as rewards or from enemies.  \nThe DX version was initially released for Nintendo 3DS via eShop. This version rebalanced weapons, has several gameplay tweaks and features the “prototype” version of the game which was first made as NES ROM.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"VBLANK ENTERTAINMENT","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":16188,"name":"Space Pirates and Zombies","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/5f4/5f45c8ee8faa310b6acb8f2a7aa12c09_Cv3UmIa.jpg","description":"At its core, Space Pirates and Zombies is an action based, skill oriented, top down space combat game.  It’s similar to the ones we knew and loved in years past, but now using full physics simulation and modern graphics for those oh so pretty explosions.  But as you dig deeper, SPAZ becomes much more.\nInstead of flying a single ship, you are in charge of an ever growing and evolving fleet, unlocking the rich tactical elements of SPAZ, all accessed at the touch of a button.  Issue orders, change ships, apply fleet AI settings, all on the fly.  At any moment the battle can change, and the Tactics Panel gives you the tools to make the battle turn in your favor.\nAs a layer on top of the action and tactics, we have a detailed technology and levelup system akin to what you would expect from an RPG.  Learn to build new ships by destroying your enemies.  Explore the galaxy to find components, use your hard earned research points to unlock their potential, and then customize every aspect of your new fleet.\nFinally, there is the universe in which all this strife and adventure takes place.  SPAZ features a persistent randomly generated Galaxy populated with story elements, factions, enemies, missions, items, to provide you with a unique experience each time you play.  While you are struggling to survive, uncover the secret of an ever expanding Zombie infestation that spreads by establishing its own real time multi-tiered ecosystem.\nKey features:\t\t\t\t\t\t33 ships to research, build, outfit and pilot.\n70 unique components to discover and customize your fleet’s performance.\nTotally physics based combat system.\nFight Zombie infestations, battling a full zombie ecosystem comprising four stages of un-life.\nExplore a persistent randomly generated galaxy containing hundreds of star systems.\nFreedom to explore the galaxy and take on challenges at your own pace.\nAid, flee, or exploit the warring factions in each star system.\nThe unique event system lets the player change the balance of power in any star system\nCarefully spend your hard earned research points on hundreds of upgrades across 15 categories.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"MinMax Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":440083,"name":"Call of the Sea","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/694/694ba14510656e8787536349220cb168.jpg","description":"Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband’s expedition. The search takes place on a strange but beautiful island in the South Pacific, filled with secrets waiting to be unearthed. It is an otherworldly tale of mystery, adventure, and self-discovery.\n\nEXPLORE THE BEAUTY\nExplore a stunning tropical island, brimming with fantastic sights, lost ruins and occult mysteries.\n\nDIVE INTO THE DEEP\nImmerse yourself in a story-driven adventure full of suspense and surreal surprises.\n\nMEET NORAH\nExperience an emotional, charming character study of a woman on a journey of self-discovery, fully voiced by Cissy Jones (Firewatch, The Walking Dead: Season 1).\n\nSEARCH FOR MEANING\nInvestigate the clues left by a previous voyage, piece together what happened, and solve a variety of clever puzzles.","review":"","timePlayed":0.0,"releaseYear":2020,"developer":"Out of the Blue","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series S/X"}]},{"id":11090,"name":"Absolute Drift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/f65/f65e6cd3c61deff23507b05585e42f06.jpg","description":"Zen Edition The free update Absolute Drift: Zen Edition, is now available! We teamed up with FlippFly, the developers of Race the Sun to bring several new features to the game, including:\nNew “event challenges” that will extend the gameplay in the game’s 34 tracks by challenging players to complete increasingly difficult tasks.\nDrift Lines: a new challenge in events where you must drift through all the dots.\n5 all new “Midnight Events.” These night-themed tracks are designed to challenge even the most experienced players.\nReplays and ghost cars. View your friends' runs or the best in the world!\nAn all new tutorial and in-game guide to help new players ease into the game’s features and controls.\nNew input system for better controller compatibility.\nAbout the Game Drifting: the Art Of Sliding Sideways.\nIn Absolute Drift, you will master the art of drifting. Practice your skills in Free-Roam and compete in drift events such as Driftkhana and Mountain Drifting. \nKey Features:\nDrive and customize up to 6 drift cars\n3 Game Modes: Driftkhana, Drifting, & Mountain Drifting with 34 levels\n5 Free-Roaming areas, each with unique levels and themes, from airports and docks to a floating metropolis\nOnline Leaderboards, replays and ghost cars. View your friends' runs or the best in the world!\n3+ hours of clean Drum & Bass and Electronic music by C41 and Nyte\nFull Controller Support","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Noodlecake Studios","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":29179,"name":"God of War I","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/1aa/1aa4ca34a8a6bb57a2e065c8332dc230.jpg","description":"Unleash the power of the Gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with lethal double chainblades, Kratos must carve through mythology's darkest creatures including Medusa, Cyclops, the Hydra and more, while solving intricate puzzles in breathtaking environments. Driven by pure revenge, nothing can stop Kratos from achieving absolution.","review":"","timePlayed":0.0,"releaseYear":2005,"developer":"SCE Santa Monica Studio","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PlayStation 3"}]},{"id":23576,"name":"GOD EATER RESURRECTION","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/0ca/0cab3cf814d9988277e023687ed3fd4f.jpg","description":"God Eater is a role-playing action game, the first installment in Bandai Namco’s God Eater series.  \n\n###Setting \nThe game takes place in the year 2071. The world was heavily damaged by Aragami (荒神 “violent god”), mysterious monsters that consist of hundreds of thousands of semi-sentient single-celled organisms and are capable of adapting to the most extreme surroundings. The game follows a player made character that joins Fenrir, an organization that aims to exterminate Aragami using God Arcs, the weapon made from Aragami’s cells.  \n\n###Gameplay \nThe game consists of more than 100 missions that can be played both cooperatively or competitively. The goal of each mission is to slay specific enemies with the time limit.\nThe God Arc is the only weapon available to the player. However, it can transform into three different forms: blade, gun, and shield. The character has various moves such as dashing, jumping, sprinting as well as several types of attack. These moves and using God Arc in blade form consumes player’s stamina. Using gun mode, on the other hand, consumes Oracle Points that can be replenished by attacking enemies in blade mode. \n\n###Resurrection version \nThe remaster of the game named God Eater Resurrection was released 2016 for PS4, PS Vita and Windows. It features some new gameplay mechanics from God Eater 2, the most noticeable of which is new Predator mode for God Arc.","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":18319,"name":"Painkiller: Black Edition","genre":"Desconocido","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/65b/65ba49d8a3c9ec952f1762112df19dd7.jpg","description":"Painkiller is a game about the adventures in the afterlife. The protagonist will go through Purgatory and Hell to fight the hordes of demons and eventually Lucifer himself. The game was compared to Serious Sam and Doom.\n\n###Plot\nThe main character is Daniel Garner, a man who died in a car crash. His soul is imprisoned in the Purgatory. Garner becomes involved in a war between Heaven and Hell. Archangel Samael promises Daniel a place in Heaven if he kills four arch-demons. A mysterious woman named Eve comes to his help, informing him about his enemies.\n\n###Gameplay\nThe player controls Garner from the first person view and uses firearms to defeat enemies. The monsters and levels are extremely varied. Garner goes through various historical eras and locations before eventually descending to Hell. Painkiller consists of 25 levels divided into 5 chapters. At the end of each chapter, the protagonist fights a boss. Each level has an optional objective that the player can complete and receive a powerful bonus represented by a Tarot card. Painkiller also has a multiplayer with traditional first-person shooter modes.\n\n###Edition features\nThe Black Edition includes the Battle Out of Hell story expansion with 10 more levels. It is set immediately after the end of the original game. Lucifer is dead, and arch-demon Alastor takes his place. Garner has to defeat Alastor and his demonic hordes. This edition also includes additional content, such as a map editor and a behind the scenes footage.","review":"","timePlayed":0.0,"releaseYear":2007,"developer":"People Can Fly","platforms":[{"id":0,"name":"PC"}]},{"id":10986,"name":"Syberia 3","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d0c/d0cfde21933c9075e793d6cc0c49c91d.jpg","description":"Digital Deluxe Edition\nDigital Deluxe Edition includes:\nDigital Standard Game\nDigital Soundtracks (*mp3)\nExclusive Digital 20 first pages  of the next Comic Books (*Pdf)\n1 Digital Wallpaper\nAbout the GameAuthor and creator : Benoît SokalOverview:\nThe limitless imagination of Benoît Sokal continues in Syberia 3, focusing on an entirely new adventure. After abandoning the island, Kate is found dying on the edge of a river by the Youkole tribe, a nomadic people migrating with their snow ostriches. Stuck in Valsembor village, together they must find a way to continue their journey in a race against their enemies and unexpected obstacles, not to mention Kate's past, which catches up with her.\nThe next generation in adventure games, Syberia 3 takes you inside an enchanting, mysterious universe full of life for you to explore in 3D. Plunged into the heart of a world inhabited by a cast of interesting characters, you'll discover and experience a fabulous tale as imagined by Benoit Sokal.\nA brand new tale, completely different from the first two Syberia games\nExceptionally immersive storytelling, multiplied by Benoit Sokal's unparalleled artistic direction\nExplore Benoit Sokal's poetic universe in 3D for the first time\nOriginal score by Inon Zur (Syberia 2, Fallout, Dragon Age, Prince of Persia)\nOriginal, real-time 3D puzzles and mysteriesPreviously in Syberia\nA lawyer in NYC, Kate Walker was sent to Europe on a simple mission that gradually transformed into personal quest, an adventure that led her on a voyage aboard a locomotive bound for the reaches of the Europe. Accompanied by an automaton named Oscar, she fulfilled inventor Hans Voralberg's dream, searching for the last mammoths all the way on the legendary island of Syberia.","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Plug In Digital","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":9603,"name":"GRIP: Combat Racing","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/de9/de93d51454fa924d723349110c0a5e13.jpg","description":"GRIP is bringing old-school style combat racing back with a bang. Inspired by the Rollcage games and developed by some of the original team, GRIP is a true tribute to the explosive fun had in a past gaming era.\nCurrent features (as of v.1.2.2):\n7 vehicles (3 manufacturers), with paint job, rim and tire customization.  Another car coming soon!6 Game modes: Classic Race, Ultimate Race (overall points), Elimination, Time Trial, Arena (Deathmatch) & Carkour (similar to scramble mode in RCS2)9 Racetracks,  3 Arenas, 15 Carkour courses.  (Some levels are still WIP)4 Weapons (Homing missile, machine gun, mine, leader rocket).  Another weapon next update!4 Power-ups (Shield, Turbo, EMP, Ramraider)12 Ingame music tracks (mostly Drum n Bass, but also trance and techno)Play single player (against AI), Split-screen with a friend or ONLINE versus players all over the world!\nNOTE:  Gamepad navigation in menus coming soon, apologies for the delay (it's not as easy as it sounds unfortunately!)\n---------------------------------------------------------------------------------\nIntense Racing:  Hit speeds of up to 1000 kmph, driving on floors, ceilings and walls.  GRIP's car designs allow for driving on both sides, so flipping the car no longer means game over\nAwesome Pick-ups:  Use an array of power-ups and weapons to get the edge on your opponents.  Ranging from missiles and guns to shields and turbos, we plan to have a wide array of exciting pick-ups to use\nExotic Planets:  Race on a variety of planets, from hostile icy worlds to alien jungle to sprawling non-terrestrial cities.  Use destruction as a tool to win (not yet implemented*), crashing your surroundings down on your opponents, or lose your tail by heading through an alternate track route\nBadass Rides:  Choose from a roster of armoured cars, manufactured by different companies from around the galaxy. Each car has different specs - some swift and agile, others brutish and heavily armoured.  There's a killer car for every taste\nBangin' Tunes:  Race to a thumping soundtrack from a variety of artists.  Drum n Bass is our main kick","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Wired Productions","platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"}]},{"id":5737,"name":"McPixel","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/b45/b456abdcf5d3a17e06bd8edd80a9d800.jpeg","description":"McPixel is a puzzle game developed by Polish developer Mikołaj Kamiński.\n\nThe game serves as a parody of both MacGyver and MacGruber and features a lot of references to the modern pop culture. \n\nThe objective of the game is to defuse a bomb located on the level in 20 seconds. The objective is referred to in the game as \"save the day\".  The Protagonist defuses the bombs in ridiculous and absurd ways. For example, by kicking it. The players guide the main character, McPixel himself, by pointing and clicking at the screen. The game consists of four parts, which include three levels. It is possible to unlock a secret fourth level. Each level is composed of six sequences. There are multiple secrets and easter eggs hidden Throughout the levels. The game features several pixel filters, music that was typical for 8-bit games, and free downloadable content.\n\nA level editor is also provided by the developer.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Sos","platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Android"}]},{"id":58779,"name":"Starfield","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/ba8/ba82c971336adfd290e4c0eab6504fcf.jpg","description":"Starfield is the first new universe in 25 years from Bethesda Game Studios, the award-winning creators of The Elder Scrolls V: Skyrim and Fallout 4. In this next generation role-playing game set amongst the stars, create any character you want and explore with unparalleled freedom as you embark on an epic journey to answer humanity’s greatest mystery.\n\nThe year is 2330. Humanity has ventured beyond our solar system, settling new planets, and living as a spacefaring people. From humble beginnings as a space miner, you will join Constellation – the last group of space explorers seeking rare artifacts throughout the galaxy – and navigate the vast expanse of the Settled Systems in Bethesda Game Studios’ biggest and most ambitious game.","review":"","timePlayed":0.0,"releaseYear":2023,"developer":"Bethesda Game Studios","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":12245,"name":"Late Shift","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/10b/10bbea9e3307778dd9a4dce704aede2e.jpg","description":"Late Shift is a high stakes FMV crime thriller. After being forced into the robbery of a lucrative auction house, mathematics student Matt is left proving his innocence in the brutal London heist. Your choices will have consequences from the very start, right through to the very end. One small decision could change the entire outcome in a choose-your-own-adventure style gameplay that can lead to one of seven conclusions.\nWritten by the author of Sherlock Holmes (2009 film), experience a gripping live-action crime thriller with a total of over 180 decision points. Do you steal the car or do you run away? Do you follow orders or sabotage the plan? You’ll have just seconds to decide as the film continues to roll with no pauses and no looping footage.\nShot in full HD, Late Shift’s cinematic experience blends the line between movies, games and interactive storytelling.Your Decisions Are You\n•\tMulti-optional Storytelling: One story, countless storylines, seven endings.\n•\tA completely live action, cinematic interactive thriller, filmed in full HD in London, England.\n•\tOver 180 decision points in total with no pauses and no looping footage.\n•\tDirected by Tobias Weber, and written by Michael R. Johnson, author of Sherlock Holmes (2009 film)\n•\tActing performances by Joe Sowerbutts (Matt), Haruka Abe (May-Ling) and Oliver Twist’s Richard Durden (Samuel Parr).","review":"","timePlayed":0.0,"releaseYear":2017,"developer":"Wales Interactive","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"macOS"}]},{"id":19212,"name":"Crash Time 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/358/358ff8862f5896fc991a493ee6406d81.jpg","description":"Crash Time 2 is a mission-based open-world driving game developed by Synetic.\n\nYou are one of the officers of a fictional Cobra 11 police unit. The players are free to explore the open world or just complete the missions. There are several game modes in Crash Time 2: a plain race, a pursuit, escort, shadowing, and navigation. The game's story is divided into 5 distinct cases with 10 missions to complete in each. The game features three difficulty modes which affect the amount of damage that can be taken by the player's vehicle. \n\nThe developers put a heavy emphasis on the vehicle damage model and slow-motion effects that are present in the game. An overhead map was featured in the game for the first time in the series.\n\nBefore the release of the game, developers advertised a feature where the players can drive out to a plain field and run into cows, which will plow into T-Bone steaks in a cartoony fashion.","review":"","timePlayed":0.0,"releaseYear":2008,"developer":"RTL interactive","platforms":[{"id":0,"name":"PC"}]},{"id":9606,"name":"RIFT","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/30f/30fe09ca354adfd72aeb47b34dbf153a.jpg","description":"Previously known as Rift: Planes of Telara and just as Heroes of Telara, it's free-to-play MMORPG in a fantasy setting.\n\nIn the world of the game - Telara - there is a conflict between two factions: the Guardians and the Defiant. The first worship the higher gods of Telara, among the representatives there are high elves, dwarves and the race of Northerner Mathosians.\n\nThe Defiant, on the contrary, does not adhere to any religion because of historical and cultural reasons or because of personal choice. They put more emphasis on technology and science. Among the representatives of this faction, one can find a race of highly advanced humans from the south called Eth, dark elves and a symbiosis between humans and Air-spirits called Bahmi.\n\nThe world of the game is divided into regions by the elements that are controlled by dragons-deities, personifying one of the basic elements: Air, Fire, Water, Earth, Life, and Death. In addition to the division into races, players can choose from five classes: Warrior, Cleric, Rogue, Mage or Primalis. The main emphasis in the game is made on the team raids, participation in PvP and PvE events.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Trion Worlds","platforms":[{"id":0,"name":"PC"}]},{"id":5520,"name":"Bionic Commando (2009)","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/d1b/d1b807b4dd3268a41307a3d6ce2518c9.jpg","description":"Bionic Commando is the sixth installment in the series of this name. It is a science fiction game in which the protagonist can use his robotic arm for various purposes.\n\n###Plot\nThe game directly continues the plot of the original 1988 NES game. It is set in the near future, ten years after the first Bionic Commando. The protagonist of the previous part, Nathan \"R.A.D.\" Spencer, a \"bionic\" cyborg soldier, makes a return. He is voiced by Mike Patton, the vocalist of Faith No More.\n\nDespite his heroic deeds, Spencer was framed for crimes he was not guilty of and sentenced to be executed. The government releases the protagonist after a terrorist attack that destroys the whole Ascension City. Spencer has to clear his name and earn his freedom by finding and defeating the perpetrators of the attack, the BioReign organization.\n\n###Gameplay\nThe player controls Nathan from the third person view. Unlike the original Bionic Commando, the sequel is in 3D. The level design allows the player to fully explore all three dimensions as it includes skyscrapers the protagonist has to climb. \n\nThe most definitive part of the Bionic Commando gameplay is Spencer's retractable bionic arm. The limb increases his reach and strength, allowing the protagonist to swing across the gaps and canyons and throw heavy objects and enemies. The player can also use two types of guns: the Tungsten gun for weak rapid fire and the Prototype gun for powerful single shots.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Capcom","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":4700,"name":"Dante's Inferno","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/cdd/cdd4b6cf03ac7ebf7460b0d82f9aaa09.jpg","description":"Dante's Inferno is a slasher role-playing game developed by Visceral game.\n\n###Plot\nThe game is loosely based on the Divine Comedy by Dante Alighieri. The players control Dante, a veteran of crusades, looks for his beloved Beatrice who got taken by Lucifer. As Dante descends deeper into Hell, he has to face more and more horrific creatures, his own sins and the dark history of his family.\n\n###Gameplay\nThe gameplay of Dante's Inferno is similar to most slayer games. The core mechanics of the genre are to control a character who traverses different locations and eliminates every enemy they find on their path (demons in this case). The protagonist's weapons are long-ranged, allowing for the mass murder of their enemies. \n\nThe boss battles in the game are heavily inspired by God of War, where the player firstly fights with the boss and later uses a quick-time event to finish their enemy off. \n\nMultiple platforming puzzles are present in the game. The levels itself consist of multiple interconnected platforms. There are numerous spots where the players have to jump to, not without using their weapons on several occasions. \n\nTwo weapons are present in the game: the Death's Scythe and a Holy Cross, which differ both in their usage and their role in the game's character progression system. Both weapons have their own upgrade trees which require souls. Souls can be acquired by killing enemies with one of the weapons.","review":"","timePlayed":0.0,"releaseYear":2010,"developer":"Electronic Arts","platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"}]},{"id":58783,"name":"The Walking Dead: The Final Season","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/6c1/6c1eecf30e3c34e79bbf86698b1e6515.jpg","description":"Clementine, now a fierce and capable survivor, has reached the final chapter in her journey. After years on the road facing threats both living and dead, a secluded school might finally be her chance for a home. But protecting it will mean sacrifice. Clem must build a life and become a leader while still watching over AJ, an orphaned boy and the closest thing to family she has left. In this gripping and emotional final season, you will define your relationships, fight the undead, and determine how Clementine’s story ends.\n● Emotional, Gut-Wrenching Story - See Clementine’s journey through to the end. As she builds a new life, you will have to grapple with new types of choices and live with the consequences as AJ looks on, learning from your every move.\n● More Control, More Tension - A new over-the-shoulder camera system, greater freedom to explore detailed environments, and scenes of unscripted combat capture the fear of living in a world overrun by the undead. All this creates the most engaging The Walking Dead game yet.\n● Striking New Visual Style - The all-new Graphic Black art style rips the ink from the pages of the Eisner Award-winning comic book series and brings the world of The Walking Dead to life like never before.\nIncludes access to all 4 episodes (Episode 1 available at launch, Episodes 2-4 coming soon).","review":"","timePlayed":0.0,"releaseYear":2018,"developer":"Telltale Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":52175,"name":"Battletoads","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/470/47058af09b864c2d211a08271eccfb4f.jpg","description":"Battletoads are here to fight aliens form other words. Get into the battle with the most baddest toads on the planet! These toads are here to kick some rear end and chew gum...and they are all out of chewing gum. The aliens are attempting to invade the planet and all that stands in their way are these mutant toads. Battle aliens through intense and challenging levels. Shoot the invaders as quick as you can. Don't let them invade the planet or you lose! The planet needs your help! Are you ready? Let's go!","review":"","timePlayed":0.0,"releaseYear":1991,"developer":"Rare","platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Game Boy"},{"id":0,"name":"NES"},{"id":0,"name":"Game Gear"},{"id":0,"name":"Commodore / Amiga"},{"id":0,"name":"Genesis"},{"id":0,"name":"PC"}]},{"id":4356,"name":"LittleBigPlanet 2","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/040/040ab31e36c65e6a275ada23d8a7da34.jpg","description":"Join Sackboy™ in a completely new adventure - filled with new abilities, new gameplay rules, innovative tools and a smarter LBP Network, evolving the whole PLAY CREATE SHARE™ experience.\nKey Features:\nSackboy™ is at it again! Join Sackboy™ and a lively cast of characters in a completely new PLAY CREATE SHARE™ adventure. As Sackboy™ gets recruited into The Alliance, you’ll journey to several unique worlds filled with new challenges, learn to control new tools, and discover a whole new way to play LittleBigPlanet™.\nA world of PLAY is at your fingertips! Whether it’s the 50 plus levels in the whimsical storyline, endless multiplayer fun, the over 2 million levels of imaginative user-generated content from LittleBigPlanet™ (1), or the inevitable amount of revolutionary games to be created from the CREATE tools – there’s an infinite amount of gaming fun for you and your friends in LittleBigPlanet™ 2.\nCREATE your own games! LittleBigPlanet™ 2 gives you complete access to customize everything - from your Sackboy™ ’s appearance to developing your own videogame. With access to the games’ CREATE tools, your imagination can run wild in creating any type of game you want from racing games, mini-games, action/adventure games, and even multiplayer shooters.\n©2010 Sony Computer Entertainment Europe. LittleBigPlanet is a trademark of Sony Computer Entertainment Europe. Developed by Media Molecule.\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service, this item's use restrictions, and other applicable terms located at http://www.us.playstation.com/support/useragreements.  If you do not wish to accept all these terms, do not purchase or use this item. One-time fee for downloads to up to two systems that are associated with the purchasing account.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Sony Interactive Entertainment","platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":43242,"name":"Gears of War: Ultimate Edition","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/49f/49f35940fbb28a00c4e10d7c7ef44de4.jpg","description":"Gears of War: Ultimate Edition is a third-person shooter developed by Epic Games. It is the first part of the original Gears of War trilogy.\n\n###Plot\nGears of War takes place on a planet called Sera, that is much like Earth. The radioactive fluid that was later named Imulsion became a potent energy source after the scientists found a way to use it. This substance caused mutations to the wildlife that lived in caves. 14 years later, after several wars, the Coalition of Ordered Governments is the only human government on the planet. \n\nYou play as Marcus, who gets back in the army after four-year imprisonment for disobeying his commanding officer to save his own father.\n\n###Gameplay\nGears Of War revolves around third-person combat and the usage of cover by the player. When the player is hit, the Crimson Omen is displayed on the screen. A crimson red sign that is used as the player's health indicator. To regenerate health, the players have to hide behind cover.\n\nThe game's story is divided into 5 acts that can be played both in singleplayer or in co-op mode. A multiplayer mode is also present in the game.\n\n###Multiplayer\nPlayers battle each other in 5v5 matches. All matches can be played in Ranked mode, where one's progress is tracked or create custom lobbies for your friends.\n\n###Ultimate Edition features\nUltimate Edition is a remastered version of the game, which includes new cutscenes, refined graphics, all DLCs and tweaked multiplayer.","review":"","timePlayed":0.0,"releaseYear":2015,"developer":"Epic Games","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":19415,"name":"Time Gentlemen, Please! and Ben There, Dan That! Special Edition Double Pack","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/59e/59e1eafe1c11e8bc5b727e0c69c0261f.jpg","description":"Two games that consistently develop one story with two main characters (very similar to the creators of the game). Setting of both games is described as \"humorous-surreal\". The first game, Ben There, Dan That !, puts a player in control of two characters named Ben and Dan that must complete inventory-based puzzles in order to unlock doors to various dimensions. You may swap between the characters in order to force them to work together.\nEvents of the second game, Time Gentlemen, Please !, continue from the first part.\nHeroes move in time to the past, the future and back, have a battle with the Hitler, who heads the army of dinosaurs that are also robots, Nazi and clones at the same time, meet the invasion of aliens.\nBoth games are a parody of \"point and click\" classics of the nineties. Humor is present everywhere - from setting to dialogues. The game responds to thousands of diverse actions that will only come to your head.","review":"","timePlayed":0.0,"releaseYear":2009,"developer":"Size Five Games","platforms":[{"id":0,"name":"PC"}]},{"id":304247,"name":"A Short Hike","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c38/c38deeb8f331a78c89e64ad71a1db361.jpg","description":"Hike, climb, and soar through the peaceful mountainside landscapes of Hawk Peak Provincial Park.\nFollow the marked trails or explore the backcountry as you make your way to the summit.\nAlong the way, meet other hikers, discover hidden treasures, and take in the world around you.\n\nKey Features:\n- Explore the island any way you like. Choose your own path to follow and see where it leads you. You never know what you might stumble into!\n- Hike at your own pace — there’s no need to rush to the summit! Take your time fishing along the river banks or swimming by the lakeshore.\n- Collect hidden treasures to reach new heights. Try taking a dive off the mountain peaks to soar above the forests.\n- Chat with the other hikers you meet along your route. You might be able to help each other out!\n- Listen to a lush original soundtrack by Mark Sparling that progresses dynamically as you explore the wilderness.","review":"","timePlayed":0.0,"releaseYear":2019,"developer":"adamgryu","platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Nintendo Switch"}]},{"id":17515,"name":"Rochard","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/2e0/2e0fcc99cdc363288ab3312877bb8444.jpg","description":"Rochard is a 2D side-scrolling platformer where player can manipulate the gravity with a G-Lifter which lets to manipulate big objects. There is an increasing level of difficulty, various puzzle solving missions, action and even humor. Although, the game is two-dimensional it takes place in three-dimensional world. In his journey the main protagonist of the game solves various different puzzles and encounters enemies. In order to overcome these obstacles, the player has to manipulate the gravity, weight and matter properties. With only one press of a button, the player can change the gravity. From normal gravity one can change it to the low gravity which lets player to jump higher and overcome other obstacles for example to throw heavy objects or do a recoil jump. The player also has the ability to swing on certain objects in low gravity using the Gravity Beam. There is also a mechanic in some levels where the gravity is inverted and sometimes the player has the ability to invert the gravity himself.","review":"","timePlayed":0.0,"releaseYear":2011,"developer":"Recoil Games","platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":10130,"name":"Obduction","genre":"Adventure","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/c01/c0137ea58ab81b909685b5fb78d788cc.jpg","description":"Now also playable on Oculus Rift!\nNote: This is a visually lush and detailed game. Playing in VR takes full advantage of higher-end systems - please refer to its minimum and recommended specs.\nFrom Cyan, the indie studio that brought you Myst, comes a new sci-fi adventure.\nAs you walk beside the lake on a cloudy night, a curious, organic artifact falls from the starry sky and inexplicably, without asking permission, transports you across the universe. You’ve been abducted from your cozy existence and added into an alien landscape with pieces of Earth from unexpected times and places.\nThe strange worlds of Obduction reveal their secrets only as you explore, discover, coax, and consider their clues. As you bask in the otherworldly beauty and explore the enigmatic landscapes, remember that the choices you make will have substantial consequences. This is your story now.\nMake it home.\n---\n“Immense and immersive… It was breathtaking… something that feels magical.” - UploadVR\n“Cyan has succeeded in making another adventure that feels truly timeless.” - Polygon\n“Obduction’s beautiful world is a worthy successor to Myst.” - Wired","review":"","timePlayed":0.0,"releaseYear":2016,"developer":"Cyan Worlds","platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"macOS"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"}]},{"id":739,"name":"The Bard's Tale","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/games/f59/f5930ff42471e790969566e9fd98a075.jpg","description":"Comedic action role-playing games have a certain public to appease and The Bard’s Tale, a separate title from the series with a similar name, succeeds. Players control the Bard, a cynical, sarcastic opportunist in the world of magic and swords. He is not interested in saving the world, but when it comes to getting a reward, or his own head is on the line – he’ll gladly jump into the action. And when the cult members recruited him to save the Caleigh, a beautiful princess, he considers that it might be worth his time.\nThe Bard’s Tale (2004) was a deviation from the main series, not only with a 3D environments but a moral choice system. The Bard has a choice in almost every dialogue to give either snarky or nice response, which might have lasting consequences through the entirety of the game. The game introduces summoning mechanic, which is improved with every musical instrument Bard finds during the story that allows players to call for the help of a companion. Companion specialty varied and they might be attacking defensive or utility. And because the game is focused on a musician, the player will view many musical numbers and songs.","review":"","timePlayed":0.0,"releaseYear":2004,"developer":"InXile Entertainment","platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":3545,"name":"Lone Survivor: The Director's Cut","genre":"Action","price":0.0,"state":"AVAILABLE","score":0,"imageUrl":"https://media.rawg.io/media/screenshots/ace/aceefab20a4040eb9b55e2cd9ea3948a.jpg","description":"Lone Survivor: The Director's Cut is a version of the game Lone Survivor, released as an addition to the game Lone Survivor.\n\nThe hero is a person who turned out to be isolated from other people and therefore did not become infected with a virus that turned the remaining people into aggressive mutants.\nThe hero leaves his apartment to explore neighboring apartments in search of food and other survivors. The hope to find other survivors is fueled by the messages found by the hero, which say that somewhere these survivors still exist.\n\nMirrors serve as portals for getting into the apartment of the survivor and back. This apartment is a place where you can stay safe and sleep - it will allow the hero to keep mental health, otherwise he runs the risk of going insane.\nDuring sleep, the hero comes to dreams, and sometimes hallucinations. Their content depends on the type of sleeping pills that the hero takes. Hallucinations can visit the hero regardless of sleep and cheerfulness. Because of this, the same rooms can look quite differently during visits at different times. The hero (and the player), in general, quickly realize that with the adequacy of the perception of the hero something is very wrong.\nA flashlight helps to move forward, and mutants make it difficult to advance. They can be killed, but you can pass unnoticed by them. To kill mutants, the hero uses weapons.\n\nSometimes progress is impossible without a special things that must be found.\nDepending on the choices and actions of the player, you can end the game with five different endings.","review":"","timePlayed":0.0,"releaseYear":2012,"developer":"Curve Digital","platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]}]