[{"id":19162,"name":"Sid Meier's Pirates! Gold Plus (Classic)","genre":"Adventure","price":0.0,"description":"Ahoy Mateys! From the Mind of Sid Meier, The Golden Age of Buccaneering has returned with Pirates! Gold!\nYou'll criss-cross your way along the 17th century Spanish Main in search of all-new adventures.\nYou'll lead a crew of hot-blooded buccaneers into rollicking harbour towns. And risk your booty and your life plundering enemy ships!\nHunt for magnificent treasures! Unravel the mysteries and clues of your adventure! Even battle your way through enemy waters on grueling rescue missions!\nWill you win your rightful place in history? Or will you end up shipwrecked on a distant island? The answer can only be found in the swashbuckling Pirates! Gold.\nExperience the untamed era of piracy through stunning new VGA/Super VGA art and graphics!\nFeel the ring of crossing swords and the boom of mighty cannon with enhanced sound features!\nSkewer scurvy rogues with enhanced sword-fighting capabilities!\nGain power, prestige or even the hand of the governor’s daughter!\nBombard enemy ships!\nExplore more coastal towns, each with it's own dangers\nIncludes the original Sid Meier's Pirates! game! and bonus Map, Soundtrack and Cheat Sheets.","imageUrl":"https://media.rawg.io/media/screenshots/d65/d65ae4a1290ff0bf3d7e80c135bc0cc4.jpg","releaseYear":2014,"developer":"MicroProse Software","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18836,"name":"Quell Reflect","genre":"Indie","price":0.0,"description":"An enchanting puzzle game of logic and relaxation.\nThe follow-up to the acclaimed 'zen puzzle' game, Quell, this offers another suite of ingenious levels to relax and test you in equal measure!\nFeaturing another beautiful score from acclaimed composer Steven Cravis, a beautiful 'hand-painted' art-style, Quell Reflect is the perfect game to test your powers of logic, without any hint of frustration.\nThe game also features a continuation of the side narrative - a touching story of love, loss and nostalgia.\nLike the original Quell, Quell Reflect is a haunting experience that will stay with you long after you've finished it.\nFall in love with Quell Reflect...","imageUrl":"https://media.rawg.io/media/screenshots/52a/52a3793479d50863be7e0cfbacf9b0cb.jpg","releaseYear":2014,"developer":"Fallen Tree Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"PC"}]},{"id":18082,"name":"Garden Rescue","genre":"Strategy","price":0.0,"description":"A serious menace has approached the gentle and snug garden, where various plants have been quietly living - masses of voracious insects rushed to it to fill their maws. The green defenders had to lay aside their everyday jobs to save their tiny motherland. But who will command the defense, who will lead them in action? Head this little army of garden defenders, rescue them from impending doom!","imageUrl":"https://media.rawg.io/media/screenshots/7e3/7e3913df5d7fa99ceaa039dc5555f9a3.jpg","releaseYear":2012,"developer":"Rainbow Games","libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":18017,"name":"Make America Great Again: The Trump Presidency","genre":"Action","price":0.0,"description":"In this tremendously patriotic parody, guide President Trump as he builds the wall, defeats ISIS, and overcomes the globalists by making America rich through great trade deals!\nMake America Great Again: The Trump Presidency is a unique strategy/simulation game that is challenging, addicting, and just plain fun!  It features a constantly changing world economy, action packed side-scrolling battles, plenty of gear to unlock, and (of course) President Donald J Trump.\nWith a perfect mixture of tongue-in-cheek comedic elements, references to real world issues, action and strategy Make America Great Again: The Trump Presidency is easily the most fulfilling game you're going to purchase this year!","imageUrl":"https://media.rawg.io/media/screenshots/aae/aaef49f479c33e5c74be910d1a17e972.jpg","releaseYear":2016,"developer":"Maverick Game Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17960,"name":"Magical Otoge Ciel","genre":"Simulation","price":0.0,"description":"Magical Otoge Ciel is a pure-hearted romance and comedy visual novel where you play as Ciel, a kind and ambitious princess who wants to finally go out on an adventure, set in a magical world.\nAccompanying her are two knight brothers, Florien (the loyal, fluffy, and sarcastic childhood friend) and Anton (calm, cool, and serious stick-in-the-mud). There's also a certain trickster and third wheel named Yvin who ends up following them around. He's not a thief, but he'll steal your heart in the most awkward way possible, hopefully.\nWarning: Contains mild blood.\nFeatures:\n3 routes with 11 CGs total\nApproximately 4-6 hours long total\nMade as a straightforward visual novel with no need for a guide\nAn obligatory childhood friend\nUnsolicited puns","imageUrl":"https://media.rawg.io/media/screenshots/234/234f6a4ada2dcb99b7aeba19783c7d20.jpg","releaseYear":2016,"developer":"batensan","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":17521,"name":"軒轅劍外傳穹之扉(The Gate of Firmament)","genre":"RPG","price":0.0,"description":"Synopsis:\nIn ancient times long ago, in order to find his beloved missing daughter, the divine Jade Emperor opened the gates of heaven, allowing a direct connection between heaven and earth. This was done, so that worthy mortals could appeal to the Jade Emperor and obtain divine powers, to aid in the search of his missing daughter. However, this gift was exploited and taken advantage of, causing chaos in the mortal realm. The Nine Li Tribe became a cult that worshipped demons and practiced in the occult, divorcing themselves from the businesses of the mortal realm.\nForces of evil suddenly arose, inciting wars across the continent, condemning people into a life of fears and sufferings.\nEmperor Zhuanxu feared the demon Chiyou would once again ravage the mortal realm. Limited by his own capabilities, he sought the help of the Queen of Huaxu, who once assisted Xuanyuan the Yellow Emperor in warding off the Otherworld with the Bell of Donghuang. Both Fuxi and Nuwa—the children of the Queen of Huaxu—also supported Emperor Zhuanxu in convincing the Queen, for they too could not bear to watch people suffer any longer. In the end, the gates to heaven were finally sealed with the powers of the Divine Artifacts combined.\nSince then, no mortals were able to ascend, nor were gods able to descend at will. This incident was later recorded down in history as “Juedi Tiantong.”\nFeatures:\nThis latest entry broke new grounds in comparison with previous titles in the series, including: the new lighting system that better establishes moods, creating various atmospheric scenes; as well as facial animation and lip-sync systems, MVN motion capture system to elevate the quality standard of all characters in every aspect. These new technologies not only improve visuals but also game immersion, enabling the players to fully comprehend the behaviors and feelings of the protagonists.\nThe battle system has been replaced with a real-time, encounter-based gameplay mechanism, making the battles more intense than ever. Improved returning features exclusive to the Xuan-Yuan Sword series include: the Urn of Spirit Infusion that enables demon-synthesis and equipment refinement; the Guardian System that allows your captured demons to fight on your side; and the Miracle System that grants additional attack buffs. A new “Battle Formation” system is also introduced in this latest entry, allowing for a richer and better gaming experience for the players.","imageUrl":"https://media.rawg.io/media/screenshots/dfe/dfee2efb376d889fd802bfb5dbca9f98.jpg","releaseYear":2016,"developer":"DOMO Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":17125,"name":"Karma Miwa","genre":"Action","price":0.0,"description":"You play a strange fragile flightless bird, who has been gone for too long and now wants to go home to its mate, which is far away.\nBadges :\nHowever for unknown reasons, enemies are being lured and attracted the bird. The flightless bird needs to run and jump over many enemies and obstacles on its journey home to your mate. The bird trek is long and full of danger.\nCan you help the bird to get home to your mate?\nThis game was heavily inspired by the classic game Snokie, which appeared on the Commodore 64 and Atari 800 back in th ’80s. While much of the basic gameplay is similar, the graphics, music and sound has been enhanced considerably and there are many newer enemy types.Features: Play As Miwa (slower) and Terry (faster), which each have two difficulties modes.\nOnce all lives are lost the game enters Practice Mode where you can continue the level in easy modes.\n2 hit system – the first contact with an enemy or water is non-fatal.\nThe game features 21 levels, spread over three different areas.\nThis game can been quite very hard in the pro mode. How to Play: You can only move on plain landscape and floating platforms.\nYou can only jump in either left or right, not up.\nYou cannot control your bird when its on a slope, or when its is in air.\nYou cannot touch water or any moving enemy animals.Please Note:This  game have 3 jump buttons:\nJump Left (Z), Jump Right (X) and a normal Jump (SpaceBar). Those keys can been remapped in the menu.","imageUrl":"https://media.rawg.io/media/screenshots/4cc/4cc9e7a7baad4c9394bca643919d3d2b.jpg","releaseYear":2016,"developer":"Space Fractal","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":16774,"name":"Battlepillars Gold Edition","genre":"Action","price":0.0,"description":"Battlepillars is a real-time tug-of-war strategy game from the team behind Draw a Stickman: EPIC in which you command caterpillars armed to the teeth with flamethrowers, sticky honey, mines, machine guns, and more!\nUtilize the best strategies and combinations, from blitzkrieg battlepillars armed with only their feet to heavily armored, cannon wielding, rocket launching tankerpillars. You decide! Still not enough? Perfect your strategies in the Test Zone, then take the battle online against your friends. Need to prove you’re the best? Climb up the leaderboards by tackling Endless Mode!\nGold Edition Content\nBattlepillars Gold Edition includes the Battlepillars Original Soundtrack and Concept Artbook!\nIntuitive controls and keyboard hotkeys\nImproved and rebalanced difficulty and progression\nImproved art and sound quality\nFour Ways to Play\nCampaign - Conquer your way through the single-player campaign with more than 50 unique levels and 5 menacing bosses!\nMultiplayer - Take the battle online and challenge your friends in real-time skirmish matches!\nTest Zone - Experiment with new strategies in the Test Zone!\nEndless - Survive as long as possible against the combined onslaught of the red caterpillar army with frantic arcade-style gameplay!\nFeatures\nChoose from a wide variety of weapons, armor, and support segments. Ray guns, flamethrowers, rockets, and more!\nCall upon powerful woodland allies like the Wizard Turtle and Larry the Bird!\nCustomize your game plan! Use tankerpillars to bulldoze your way to the enemy base, or send in kamikazepillars to surround your enemies!","imageUrl":"https://media.rawg.io/media/screenshots/138/138939a61b75491659f1ff505edeb136.jpg","releaseYear":2014,"developer":"Hitcents","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":15618,"name":"Survival: Postapocalypse Now","genre":"Action","price":0.0,"description":"You - a man who has lost everything. Literally. Your life, your home, your memory. Opening your eyes you find yourself knee-deep in snow in the middle of the forest. What happened? Who are you and where are you? - Unknown. You only know that you are not alone here. Have you heard the saying - \"Man to man - the wolf!\"? Now it works! And it works damn good! Do you want to survive? - A few have managed to survive with their bare hands. Arm yourself and set your way. What happened to the world around, and why world died - it is possible to find out the reason, but whether it is...is it the main issue today, eh?\n-Siberia is severe. Siberia is cold and does not give life to the weak. Do you want to survive? - Be stronger of that lad running with a riflein your direction.\n-Your Home is now here. But in the view of all your home will quickly become tempting prey. Erect your new home, strengthen and protect it.\n-Nothing is eternal. And your weapon - perhaps the most loyal friend in this world. Take care of it, darn it, and it will serve you well.\n-Hand in hand. If you feel that you do not need anyone - be on your way. You're cool. But in most cases people do not survive here bein all alone. A group of two people has the power and there will always be someone who will covered your back.\n-You - human. A human needs to eat, drink, dress...if you don't want Siberia to took you forever. Whatever happens, whatever disaster has occurred, people were going in a hurry, and a lot of useful stuff left around. You have just to look around.\n-And Again: you - the human. You're not made of steel and kilometers on your feet will not be easy to overcome. Why not use one of those cars that were left by hurrying people? All you need is to find some fuel, some battery, and something, than you would use to ignite the engine.\nCurrently we are working on porting game on Unity 5. This will allow us to fix most (and perhaps all) of the bugs and flaws. It will let us to make the game visually more \"tasty\". At the moment, the updated version of the game is in the alpha testing stage. The development team updates the Alpha test branch as often as it is possible. Thanks to you and your guests, we do \"Survival: Postapocalypse Now\" better!","imageUrl":"https://media.rawg.io/media/screenshots/ff1/ff182a04a677436455adad4bdd4d59fe.jpg","releaseYear":2015,"developer":"TB Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12064,"name":"Age of Civilizations II","genre":"Strategy","price":0.0,"description":"Age of Civilizations II - The pure sandbox strategy gameAge of Civilizations is a grand strategy wargame that is simple to learn yet hard to master.\nYour objective is to use military tactics and cunning diplomacy to either unify the world, or conquer it.\nWill the world bleed out or bow before you? The choice is yours..Approach to the HistoryAge of Civilizations II goes through the whole history of humanity, Age by Age, beginning in the dawn of civilization and leading into the far futureHistorical Grand CampaignPlay as many Civilizations ranging from the largest empire to the smallest tribe, and lead your people to glory in a campaign spanning thousands of years from the dawn of civilization to the future of mankindMain Features\nDetailed map of the world with many historical borders\nDeeper diplomatic system between Civilizations\nPeace treaties\nRevolutions\nHotseat, play with as many players as Civilizations is scenario! No limits!\nCreate own History using in-game editors\nTerrain Types\nMore detailed diversity of Populations\nEnd game timelapses\nThree playable maps\nRandom GamesCreate own world and play it!Scenario Editor, create own historical or alternate history scenarios and share them with community!\nCivilization Creator\nFlag maker\nWasteland EditorMap EditorsCreate own maps!\nTrade Zones Editor\nTerrain Types Editor\nGrowth Rate Editor\nCities EditorGame EditorsAdd and customize own Terrain Types\nCreate own pallet of Civilizations colors and share them!\nCreate own Continents\nService Ribbons Editor\nRandom alliances names Editor\nDiplomacy Colors Editor","imageUrl":"https://media.rawg.io/media/screenshots/a80/a807b06d337de20ac055717c73d19989.jpg","releaseYear":2018,"developer":"Łukasz Jakowski","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC"}]},{"id":11680,"name":"Streets of Fury EX","genre":"Action","price":0.0,"description":"Fight the gangs of Paris in this action packed Beat'Em up. Up to 4 players can join in, to cooperate, or fight against each other! Many unlockables, game modes, crazy combos and devastating furies await you in this deep fighting game.\nKey Features:\nOldschool “go right” beat’em up\n4 players local Co-op and competitive play\n17 playable characters\nThe depth of a versus fighting game in a side-scrolling beat'em up\nLots of moves, special moves, furies, cancels, chain combos, air combos, dodge, etc.\nIncrease the Security Level to unlock new characters, game modes, and more...\nStory mode : Hunt the gang leaders in their respective districts\nAlternate Story mode : Build your own gang!\nVersus mode : Free for all and team battle for some multiplayer mayhem\nSurvival mode : How long can you survive endless waves of enemies?\nChallenge mode : Try some time attack on special levels\nFeaturing a whole new soundtrack by K93 (https://soundcloud.com/streets-of-fu)\nPlay with any controller\nFeaturing famous youtuber Benzaie as the Hard Corner","imageUrl":"https://media.rawg.io/media/screenshots/03e/03eb754017338e1c707ed448335a4f75.jpg","releaseYear":2015,"developer":"Guard Crush Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11240,"name":"The Letter - Horror Visual Novel","genre":"Adventure","price":0.0,"description":"CONTENT WARNINGThis game deals with mature themes. It shows scenes that some may find disturbing, unethical and triggering. It also contains offensive language, racial slurs, sexual themes, gore and violence. Player discretion is advised.ABOUTThe Letter is an interactive, horror visual novel inspired by classic Asian horror films, Ju-ON: The Grudge and The Ring. Told through an immersive branching narrative, the game puts the players into the shoes of seven characters as they find themselves falling prey to a vicious curse plaguing the Ermengarde Mansion for centuries.\nIn this game, your choices will shape and drive the story forward: will you mend a relationship on the verge of collapse, or will you let it fall apart? Will you risk saving them, despite the consequences, or leave them to die a gruesome death? The fate of all the characters is in your hands.FEATURESNon-chronological storytelling with seven chapters, spanning over 700,000 words across all routes.\nSeven playable characters with varying personality and approach to difficult situations.\nCountless butterfly effects; the choices and endings you get for the previous chapters heavily affect how the succeeding chapters will play out.\nFull English Voice Acting (optional).\nAnimated backgrounds, CGs and sprites.\nBeautifully painted art style, with over 80 backgrounds, 100 CGs and 50 Epilogue CGs (variations included).\nOriginal soundtrack, with opening, ending and true ending theme songs.\nQuick-Time Events (optional).\nMend or break relationships.\nA branching tree that keeps track of your progress/route.\nA journal that narrates the events in chronological order, and jots down the clues found about the Ermengarde Mansion.\nOver 170 achievements.","imageUrl":"https://media.rawg.io/media/screenshots/e9f/e9fbde59d3b1be576c98f19cc09dd7b3.jpg","releaseYear":2017,"developer":"Yangyang Mobile","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":10714,"name":"Super Trench Attack 2","genre":"Strategy","price":0.0,"description":"Super Trench Attack 2 is a survival turn-based squad game set in a fictional world war setting.\nYou are Ada Frost, a lieutenant of the blue army. You find yourself deep behind enemy lines, with the stolen black army plans in your hands, you can end the war. That is, if you and your squad can make it home alive!\nOf course the Black army won't let you escape that easily, They have dispatched their top general the evil Helmut, to stop you in your tracks. Fight through the desert sands, traverse the icy peaks, and battle through the muddy trenches, get those plans to H.Q before the evil general catches you!\nGame Features\n- Tense survival gameplay,\n- Procedural generated levels, and missions\n- Over 2000 random events, no play through is the same\n- Play blackjack and hunt for food\n- Four different C.O's to choose from\n- Recruit four different character classes to your squad\n- Upgrade your troops with the flexible 'weapon pack' system\n- Goofball humor throughout\n- Enemy commanders have different tactics and A.I\n- Fight through snow, deserts, beaches, cities and forests\nThis title is the sequel to this steam game here.","imageUrl":"https://media.rawg.io/media/screenshots/611/611fa4fd3512834bbd81baf838bbf265.jpg","releaseYear":2015,"developer":"Retro Army","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10562,"name":"Rogalia","genre":"Adventure","price":0.0,"description":"Rogalia [Alpha] is the craft-based MMO-sandbox with the fantasy open world created by players. Feel free to kill people out of towns and claims. Gain useful vitamins from your meals and develop your character. Fight on Arena, battlefields and dungeons.\nBuild your own world in the tough surroundings!\nCharacter- Character levelling is based on vitamins gained from meals.\n- Every attribute of your character may reach maximum value.\n- You may share your rented patch with other players.\n- Free economics developed by players.\n- Crafted items have durability and quality attributes. Their values depend on your skill.\n- A plenty of recipes and skills: craft, animal breeding, monster hunt, building and many more!World- An open PvP world with 3 undeground layers and PvE-protected areas (towns and rented patches).\n- Vitamins, gear and bag loss after death.\n- Loss-free arena to fight people with no death fees. Battlefields and dungeons to hunt some good loot.\n- Terraforming.18+ game contentSmoking, booze, gluttony, chance games, promiscuity and, last but not least, a payment for these sins: from hangover to STDs.\n\"This is an alpha-version of the game. We are the team of two who make it and put a lot of heart in it, so we already have a spectacular community who will kindly help you with the sayings and doings.\nWelcome to the Rogalia World!\"","imageUrl":"https://media.rawg.io/media/screenshots/fd7/fd73812e9b302d7f0b2c20acbd0a1354.jpg","releaseYear":2016,"developer":"Nanalli","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10240,"name":"Nova Blitz","genre":"Action","price":0.0,"description":"Nova Blitz is a real-time, digital, card game set in a future universe ruled by five Aspects of energy: Arcane, Tech, Divine, Nature, and Chaos. As a Nova, you channel that energy to summon units, use powers, and knock out your opponent.\nSummon units, play powers, and duel in real time. Turns are simultaneous, with both players playing at once, and in combat, hidden attack and block orders let you bluff and counter-bluff your opponent.\nDUEL in a Real-Time CCG\nBUILD the ultimate deck\nCOLLECT more than 300 unique cards\nDRAFT a deck to win top prizes\nWIN global tournaments\nClimb the Leaderboard up to NOVA RANK\nBuilt from the ground up for quick games and constant player interaction, every match of Nova Blitz is a blend of strategy and action. Each turn plays out in real time, and both players play at the same time. This cuts out all the downtime players experience in a normal collectible card game, and makes game play fast – games take less than 5 minutes each.\nNO WAITING: Games are played simultaneously in real time\nQUICK GAMES: Each game takes less than 5 minutes\nSMART PACKS: Your packs contain cards you need\nCROSS-PLATFORM PLAY: One account across Steam, iOS, & Android","imageUrl":"https://media.rawg.io/media/screenshots/43b/43b770bae041f2674ca110d8cf3de706.jpg","releaseYear":2016,"developer":"Dragon Foundry","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":10013,"name":"MXGP3 - The Official Motocross Videogame","genre":"Simulation","price":0.0,"description":"Experience all the adrenaline of Motocross with the official Championship’s only videogame! MXGP3 - The Official Motocross Videogame offers the most involving game experience ever, with completely new gameplay and graphics thanks to Unreal® Engine 4. Race on 18 official tracks and in the MXoN with all riders and bikes from the 2016 MXGP and MX2 seasons and be the first to experience the thrill of riding one of the 10  2-strokes available! Render your rider and your bike unique, with more than 300 official components for a complete customisation!\nFull immersive experience\nCompletely rebuilt from scratch and based on Unreal® Engine 4 for ultrarealistic graphics and scenarios, astonishing details and incredible visual effects.\nOnly official content\nOfficial license, tracks, rosters from 2016 FIM Motocross World Championship.\nTry almost infinite variations to fully customize your bike and rider using more than 300 real items.\nMore fun with 2 Strokes\nEnjoy for the first time the brand new addition of 2 Stroke bike riding.\nChoose between 10 different bikes with massively realistic dedicated sounds and reactions.","imageUrl":"https://media.rawg.io/media/screenshots/5c5/5c5483eddf5c17c4fff3e260571a3969.jpg","releaseYear":2017,"developer":"Milestone","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":955,"name":"Blackwood Crossing","genre":"Adventure","price":0.0,"description":"Blackwood Crossing is a story-driven first-person adventure game. A haunting tale of intrigue and mystery.\nYou play as Scarlett, a teenager finding her way in the world. You wake up, disorientated, to find yourself and your younger brother, Finn, inexplicably travelling on a moving train.\nBut when a mysterious figure appears, it’s clear that this is no ordinary train ride. It’s the beginning of a magical voyage, steeped in life, love and loss.\nNavigating this powerful drama - where the world, and your abilities develop in extraordinary ways - you are forced to examine your relationship with Finn. You are orphans, and your relationship has always been strong. However, adolescence has opened the door to new interests, and you’ve been growing apart.\nAs you gradually uncover the depths of Finn’s anguish, the consequences of your remoteness become shockingly clear.","imageUrl":"https://media.rawg.io/media/screenshots/e0c/e0c76cc0fe5ee0c30e5cfd4cddb788cb.jpg","releaseYear":2017,"developer":"Vision Games Publishing","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":690,"name":"SWORD ART ONLINE: Hollow Realization","genre":"RPG","price":0.0,"description":"“Link start” into SWORD ART ONLINE: Hollow Realization, an exciting new action RPG written under the watchful supervision of SWORD ART ONLINE creator Reki Kawahara. Kirito receives a single mysterious message – a cryptic “I’m back to Aincrad” – and is drawn once again into a familiar world in which he was once trapped...\n• The ultimate single-player MMO simulation. Dive into the world of SAO and immerse yourself in an MMO-like experience like no other.\n• Old friends, new mysteries. Explore this new world of Ainground with Asuna, Leafa, Silica, Klein, and other old friends as well as 300 NPC players you can get to know and recruit into your party.\n• Robust online multiplayer. Participate in up to 8-man raids with four real players and four virtual players.\nAdditional hardware required for Remote Play.\nAdditional hardware required for Interconnectivity.\nUse of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy).\nOnline features may be terminated at any time.\n*Online multiplayer requires a PlayStation®Plus membership.\n1 player\nNetwork Players 2-4\n20GB minimum save size\nDUALSHOCK®4\nRemote Play\nInterconnectivity PS4™ • PS Vita\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n©2014 REKI KAWAHARA/PUBLISHED BY KADOKAWA CORPORATION ASCII MEDIA WORKS/SAOⅡ Project\n©BANDAI NAMCO Entertainment Inc.","imageUrl":"https://media.rawg.io/media/games/e49/e49224f4c963a5b3bb36292d31e5ad5a.jpg","releaseYear":2016,"developer":"BANDAI NAMCO Entertainment America","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":617,"name":"Wild Guns Reloaded","genre":"Action","price":0.0,"description":"Wild Guns Reloaded is a fast-paced arcade-style shooter, mixing the Wild West with steampunk. Play as Clint, Annie, Doris, or Bullet the dog with his sentry drone. Grab some friends and play together for some four player action! Each character can jump, dive, and roll to get out of the way of the barrage of bullets enemies let fly – or shoot them down with their own gun!\n•\tTwo new characters, each with their own weapons and tactics!\n•\tUp to 4 players and Online Rankings!\n•\tClassic and NEW Stages!\n•\tNEW Boss Enemies and Special Weapons!","imageUrl":"https://media.rawg.io/media/screenshots/712/71266a39cca8fcabea958368aa8506e5.jpg","releaseYear":2016,"developer":"NATSUME","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":202,"name":"Jet Car Stunts","genre":"Action","price":0.0,"description":"Race as fast as possible, master the most difficult stunts and drive the Jet Cars like no other!\nJet Car Stunts is a different breed of racing game and a remake of the iOS game of the same name.\nMaster difficult stunts, set the fastest times and let your Jet Car Stunts skills shine.\nAre you good enough to master all the tracks with elegance or will you get left behind?","imageUrl":"https://media.rawg.io/media/screenshots/33f/33f89765de1dbf77cc6f930379313b9d.jpg","releaseYear":2009,"developer":"Grip Digital","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":304239,"name":"Warlander","genre":"Action","price":0.0,"description":"DISCORD\nJump into Discord with us and become directly involved in our community-focused game development!\nFEATURE SUGGESTIONS AND BUG REPORTING\nWe are using a public feature upvoter and bug tracker to allow the community to help identify potential bugs and also have a voice in determining which features will make it into the game.\nAbout the GameWarlander is an action-packed, third-person, online-multiplayer game, with a unique style that mashes a Medieval-inspired setting, Fantastical items and abilities…and…EVEN POWERFUL ROBOTS!\nFeaturing intense competitive skirmishes and epic castle siege warfare with up to 100 players, you must use the almighty powers of god-like Warriors, Clerics, and Mages, as well as siege weapons and cataclysmic spells to control the battlefield.\nTo be victorious, you must work as a team, defend your Keep, and tactically break into the enemy’s stronghold to destroy their core!\nAcross its 2 Army Battle & 5 Army Battle game modes, Warlander combines the tactical team-fighting of a modern-day MOBA, the knock-out style gameplay of a Battle Royale, a smooth blend of 3rd person hack-and-slash and ranged combat, and a touch of 4X-inspired strategic diplomacy – all within large scale battles of up to 100 players.\nFeatures fast-paced action combat and shrewd decision-making where you must play to the role of your squad, by either defending your castle and core with anti-siege weapons - roaming the battlefield to intercept the enemy, capture towers, and fire mighty catapults - or by infiltrating the enemy Keep with siege weapons and epic cataclysmic spells. Defeating enemies, building devices, and completing objectives will earn you Valor points which can be used to bring powerful versions of your characters into the fray and help you turn the tide of battle!\nTactically maneuver and control the battlefield by following the directions laid out by your Commander, controlling spawn towers, and utilizing the available siege devices to remove the enemy stronghold fortification layers. Gates, walls, and bridges can be destroyed to create choke points or new paths into the enemy keep, and alliances can be made or broken to swing the momentum of battle.\nCreate an eclectic roster of deeply tailored class-based characters, each with their own loadout of rarity-based and customizable equipment, skills, and talents, as well as emotes, and dance moves. The choice is yours - build decks that are balanced, look to fill specific roles, or feature multiple ways to play your favorite class - then take them into battle and dominate your foes!","imageUrl":"https://media.rawg.io/media/screenshots/ae1/ae164bc0c0f69e9f98cc5ae98f41214c.jpg","releaseYear":2023,"developer":"Toylogic","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":302373,"name":"DEAD OR ALIVE 6: Core Fighters","genre":"Action","price":0.0,"description":"Game contains In-Game Purchases\nThe free version of the newest installment of the leading fighting entertainment franchise - DEAD OR ALIVE 6!\nThe long-awaited new installment of the Team Ninja's top-class fighting game series DEAD OR ALIVE!\nThis is a free version which allows use of many game modes, including online matches. However, only a limited number of playable characters is available, and the Story mode will be locked. The remaining characters and the Story mode can be purchased separately as downloadable content.\nFor more information please visit the official website at https://www.teamninja-studio.com/doa6/us/ .\nRemote Play requires PS Vita system and sufficiently robust Wi-Fi connection.\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-2 players\nNetwork Players 2-2 - Full game requires PlayStation®Plus membership to access online multiplayer\n11MB minimum save size\nDUALSHOCK®4\nRemote Play\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n©KOEI TECMO GAMES CO., LTD. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/d3f/d3fbd175462edc2ca633d59a4afc17a0.jpg","releaseYear":2019,"developer":"KOEI TECMO America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":284684,"name":"Hentai Crush","genre":"Simulation","price":0.0,"description":"As a single man who desperately wants to have a girlfriend, you have been introduced to a lot of girls via matchmaking service. Let's seduce them and advance your relationship...<h3>Game Features:</h3><br/><br/><ul><li> Lots of animated CG of beatiful girls<br/></li><li> Dating simulation elements combined with bubble shooter gameplay<br/></li><li> Interesting dialogs<br/></li><li> Lots of item to collect<br/></li><li> Relaxing and romantic music<br/></li><li> Cute and sexy native Japanese voice</li></ul><br/><br/><br/>","imageUrl":"https://media.rawg.io/media/screenshots/c57/c570e010ab69fbdce0eb584993c0876d.jpg","releaseYear":-1,"developer":"Mature Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":277994,"name":"SENRAN KAGURA Burst Re:Newal","genre":"Action","price":0.0,"description":"Limited Edition\nAbout the Game\nEvery ninja, from the mythical tricksters of old to the covert operatives of the modern day, began as a student. Today, those students train at secret schools throughout Japan, from converted old castles to normal-looking high schools. Join the finest among equals at Hanzo National Academy, or the tough-as-nails survivors of Hebijo Clandestine Girls’ Academy, as they risk their young lives (and their nicest outfits!) for honor, family, and friends.\nSee Where It All Began\nExperience a full 3D remake of the original SENRAN KAGURA Burst, featuring gorgeous new visuals, new collectibles, and a fresh take on the shinobi girls’ very first adventures.\n\nStrike With Precision\nNew parry mechanics enhance your ability to read the battlefield and time your moves and countermoves perfectly.\n\nBurst Into Action\nUnleash the fury of the new Burst Gauge. Turn the tide of battle with an adrenaline-fueled flurry of attacks, just when you need it the most.\n\nUncover Their Secrets\nFind the hidden Top Secret Files for deeper insight into the shinobi girls’ world and daily lives.","imageUrl":"https://media.rawg.io/media/screenshots/cd5/cd5d8b64f41dae66404acbf7cbc425b2.jpg","releaseYear":2019,"developer":"XSEED Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":63536,"name":"Zup! Zero 2","genre":"Casual","price":0.0,"description":"Minimal physical puzzle with explosions. The player's goal to keep the blue ball on the platform for 3 seconds in order to pass the level.\n▪ 60+ Levels\n▪ Achievements\n\n\"Zup!\" powered by Clickteam Fusion 2.5\nThe basis is taken an example of Sergio Andre\nSpecial thanks to Snaws\nMusic by Ann Sharova","imageUrl":"https://media.rawg.io/media/screenshots/fb3/fb38229038d2eed2f94d875a80c048c3.jpg","releaseYear":2018,"developer":"Quiet River","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":61535,"name":"Epic Battle Fantasy 5","genre":"Adventure","price":0.0,"description":"Epic Battle Fantasy 5 is an over-the-top turn-based RPG adventure, full of video game references, juvenile dialogue, and anime fanservice (...and also strategic combat, monster catching, and tons of treasure hunting - if you're into any of those.)\nIf you're new to the series, this is a good place to start, and if you've played the other games, there's plenty of new features for you to explore.\nEpic Battle Fantasy 5 features... Over 170 different enemies to fight, all with unique abilities and attack patterns.\nOver 120 usable skills, and more equips than you can try out in a single playthrough.\nAlmost any enemy can be captured like a Pok*mon, and later summoned in battle. (including bosses!)\nNew mechanics also include weather conditions and a cooldown system. (MP is gone!)\nSet up devastating combos with damage-amplifying status effects. (wet + thunder = death!)\n30 hours of gameplay, plus lots of optional dungeons and challenges.\nSuitable for both casual and hardcore RPG players, and is safe for kids, if offensive content is disabled. Epic Battle Fantasy 5 does NOT feature... Annoying random battles.\nLimited save points.\nDepressed protagonists.\nPoints of no return.\n","imageUrl":"https://media.rawg.io/media/screenshots/ec3/ec30ba9283efee3f7652201a5e9991c1.jpg","releaseYear":2020,"developer":"Matt Roszak","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"}]},{"id":61184,"name":"HD Poker","genre":"Strategy","price":0.0,"description":"HD Poker is the most exciting free online poker game anywhere! Compete in Texas Hold'em vs. players around the world on up to four tables in stunning High Definition.\nFeatures include:\nPoker Skill Rating Leaderboard - compete and earn Weekly Leaderboard Rewards!\nUnique PSR system that analyzes your skill and reflects your true Texas Hold'em talent.\nGorgeous graphics and hand drawn art.\nCollect your FREE Streak Bonus every 4 hours!\nPlay on 9-handed, 5-handed or Turbo Tables.\nBuddy lists so you can easily play with or message friends.\nAchievements with rewards you can earn by playing – try to collect them all!\nDetailed and immersive poker rooms.\nSend gifts to other players – buy drinks for the table or cheer up a friend.\nFrom Cowboys to Grannies, choose your Avatar and show off your best poker face!\nOpen special Chests that contain awesome, rare items.\nMulti platform - play HD Poker with friends on Steam, mobile (iOS/Android), and the web!\nGet started - play for free today!","imageUrl":"https://media.rawg.io/media/screenshots/d54/d54da1dcb1dd62e8a06e4417077aed0b.jpg","releaseYear":2018,"developer":"Z4","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":58011,"name":"Z (1996)","genre":"Desconocido","price":0.0,"description":"Z (pronounced Zed) is a 1996 real-time strategy computer game by The Bitmap Brothers. It is about two armies of robots (red and blue) battling to conquer different planets.\nA sequel, Z: Steel Soldiers, was published in 2001.","imageUrl":"https://media.rawg.io/media/screenshots/115/115f1192e2fddc60255bd5c62a1490df.jpg","releaseYear":1996,"developer":"The Bitmap Brothers","libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"PC"},{"id":0,"name":"Android"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SEGA Saturn"}]},{"id":54373,"name":"Conker's Bad Fur Day","genre":"Action","price":0.0,"description":"Conker's Bad Fur Day is a platformer video game developed by Rare and released for the Nintendo 64 video game console in 2001. As part of the Conker video game series, the game follows the story of Conker the Squirrel, a greedy, heavy-drinking red squirrel who attempts to return home to his girlfriend Berri. The gameplay is composed of various challenges that involve platforming, solving puzzles, fighting enemies, and gathering objects. The game also features a multiplayer mode where a maximum of four players can compete in seven different game types.\nAlthough visually similar to Rare's family-oriented Nintendo 64 platform games Banjo-Kazooie and Donkey Kong 64, Conker's Bad Fur Day was designed for mature audiences and features graphic violence, alcohol and tobacco use, profanity, vulgar humor and pop culture references. It was developed over the course of four years and was originally intended for a family audience, but was ultimately retooled into its current form because previews were criticised for being both too cute and similar to Rare's earlier platform games.\nUpon release, Conker's Bad Fur Day received critical acclaim from video game journalists, who praised its visual appeal and smart, funny humour. The game sold well below expectations due to limited advertising and a release towards the end of the Nintendo 64's life cycle, but has since earned a cult following due to its unique styling. A remake, Conker: Live & Reloaded, was released for the Xbox in 2005. In 2015, the game was included as part of the Rare Replay compilation for Xbox One.","imageUrl":"https://media.rawg.io/media/screenshots/621/62111bd8918fb3f55898954171432dc7.jpg","releaseYear":2001,"developer":"Rare","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":54260,"name":"Fatal Fury Special","genre":"Action","price":0.0,"description":"Fatal Fury Special (餓狼伝説SPECIAL, Garou Densetsu Special, \"Legend of the Hungry Wolf Special\") is a 1993 fighting game developed and published by SNK and originally released for the Neo Geo arcade and home platforms. It is an updated version of 1992's Fatal Fury 2, introducing several changes to the gameplay system while expanding the available character roster.","imageUrl":"https://media.rawg.io/media/screenshots/35f/35fec4f3634887057d5ff72c5efa1cf0.jpg","releaseYear":1993,"developer":"SNK","libraryGames":null,"platforms":[{"id":0,"name":"SEGA CD"},{"id":0,"name":"iOS"},{"id":0,"name":"Wii"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Neo Geo"},{"id":0,"name":"Classic Macintosh"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Android"},{"id":0,"name":"macOS"},{"id":0,"name":"Game Gear"},{"id":0,"name":"SNES"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Linux"}]},{"id":53089,"name":"The Legend of Dragoon","genre":"RPG","price":0.0,"description":"The Legend of Dragoon (レジェンド・オブ・ドラグーン, Rejendo Obu Doragūn) is a turn-based role-playing video game developed by SCE Japan Studio and published by Sony Computer Entertainment for the PlayStation.","imageUrl":"https://media.rawg.io/media/screenshots/4d7/4d7606b1a32d022beaf845920b389be9.jpg","releaseYear":1999,"developer":"Sony Interactive Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":51330,"name":"Tennis World Tour","genre":"Simulation","price":0.0,"description":"THE BIGGEST STARS IN TENNIS\n• Play as one of the 30 best tennis players in the world: Roger Federer, Angelique Kerber, Stan Wawrinka and many of the sport's legends.\nPERFECTLY REPRODUCED MOVEMENT\n• Realistic animations, carefully reproduced in the game using motion capture technology, help you learn all of the shots used in modern tennis: the slice, lob, top spin, etc.\nEVERY PLAYING SURFACE\n• 18 types of courts: hard, clay, grass, carpet and even hardwood. Each surface affects the playing conditions.\nA COMPLETE CAREER MODE\n• Create your player and experience a career worthy of a professional: training, tournaments, staff management, equipment purchases, etc.\nAN UNEQUALLED TACTICAL DIMENSION\n• Decide what strategy to adopt for each match and use your skill cards to defeat your opponents.","imageUrl":"https://media.rawg.io/media/games/cb0/cb03385179a52bf6dbed776a7c53de1c.jpg","releaseYear":2018,"developer":"Breakpoint","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":50993,"name":"Goblin Gearshop","genre":"Simulation","price":0.0,"description":"DISCLAIMER: you NEED controllers for this game! Otherwise, you can’t play it!\nOrcs started a war against goblins because they are so small and weak. Goblins aren’t the strongest so they have to be smart and that’s what goblins are for sure! You and your friends are the best goblin crafters in the world so you started a weapon shop together to craft an end to this war! Smelt, mold, and forge your own weapons and send them out on the battlefield so your goblin warriors can fight!\nDo you think you can win this war?! Gather your friends, 2-4 controllers and dive into the (small) shoes of the goblin crafters!\nROCK PAPER SCISSORS (WITH WEAPONS)\nThe orcs change their weapons a lot. They have spears, swords and axes. To beat an orc, you need to craft a weapon that counters the weapon of the orcs! So pay attention to what the orcs are fighting with! SWORD, AXE, SPEAR... GO!\nCRAFTING\nThere is lots of work to do in the goblin gear shop so divide the tasks properly! There are more than 8 crafting machines and they all work in their own unique way. Learn the process and get even better than you already were!\nSKILLCHECKS\nAll crafting machines have their own unique skill check that you have to perform. Are you doing it perfectly? Then you will make the best weapon ever! Are you doing it terribly wrong and you’re sending your trashy weapon to the battlefield? Then you’re giving the orcs a big advantage (so don’t do that, okay?). Make sure that not only you but also your goblin friends are performing the skill checks well. You are all responsible for the final product and it needs to be good. NO EXCUSES!\nNow quick, get on the battlefield and make all goblins proud!","imageUrl":"https://media.rawg.io/media/screenshots/409/4097cb0a379b6bdda6d26c815a767a29.jpg","releaseYear":-1,"developer":"Minus2","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":49246,"name":"Prophecy I - The Viking Child","genre":"Action","price":0.0,"description":"Cartoony side-scroller where you take the role of, as the title states, a viking child, in his quest to free his friends and family, held by the evil god Loki inside the Great Halls of Valhalla.\nFight your way through 16 levels with diverse scenarios, including medieval castles and mountains. Spread throughout the levels are shops in which you can buy potions and other magical items to help you along the way. Before you finally face the Dark Lord Loki, you must also defeat the 8 Apprentices of Darkness.\nThe game features colorful graphics and 22 different tunes to make the whole trip a bit more pleasant.","imageUrl":"https://media.rawg.io/media/screenshots/e2a/e2aaa1e96d2ec510b4022000210f998f.jpg","releaseYear":1991,"developer":"Imagitec Design","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":49072,"name":"Death Toll","genre":"Action","price":0.0,"description":"Beta RegistrationRegister to participate in the beta of the game. If you are selected you will get to play Death Toll before anyone and you will get the game for free. More Info is on our website.\nAbout the GameThe tension is thick. Your pursuers have caused you a lot of damage and if they find you now, they'll take everything you've worked for. You'll need to get one of the airplanes working to leave the island, but right now your priority is to find some food or you'll be too depleted to defend yourself.  From your vantage point in a second floor window, you spot a deer cautiously emerging from a grove of trees near the bottom of a wooded hill. Deer can be hunted for food, so you raise your weapon and put your crosshairs over the animal's heart. You are about to pull the trigger when you see the deer start, then run off. You pan your scope to the side and see that the deer was startled by the group of heavily armed players that are now approaching your position. It's a posse, and although they don't know exactly where you are, they know you're in the area. The Death Toll will be high today…\n\nCome join an open world first person shooter that takes the best parts of Royale and Capture the Flag games, and weaves them together to create an unforgettable experience. Explore a beautiful open world as you search for the supplies and equipment you will need to escape from the island and win the game. Find weapons to hunt the ones closest to escape, or use your tactical skills to turn the tables on the ones pursuing you.\n\nCan you win the arms race and leave the island with your life, or are you doomed to be left behind and die with the other captives?WeaponsDeath Toll includes a wealth of modern firepower like assault weapons, RPGs and grenades, along with defensive measure like camo clothing and body armor. The only problem is finding them before your competitors do!Combat VehiclesScattered around the island are an assortment of land, sea, and air vehicles. Many, like the tanks or the jets, have working weapon systems. Acquiring one of these vehicles will greatly boost your chances of success, but to use one you'll first have to repair it with the parts and materials you find scattered around the island.SurvivalYou'll need to find food if you want to survive. Canned food is available if you can find it, but the best way to keep yourself fed is to hunt. The island is home to deer, rabbits, fox, and boar, all of which can be taken for food.Features:Online competitive multiplayer\nLarge open world\nDiverse vehicles including combat vehicles with working weapons\nFamiliar combat mechanics\nUnique gameplay mode\nFull day-night cycle\nAttentive developer, dedicated to the players enjoyment.\nNo pay-to-win","imageUrl":"https://media.rawg.io/media/screenshots/536/5360e1bb5e82b037172fb6d4b4e4adb2.jpg","releaseYear":-1,"developer":"DigitalDNA Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45488,"name":"Freedom Defender","genre":"Strategy","price":0.0,"description":"Your country is in danger. Foreigners want to invade it! Lead the noble citizens of the United Freedom Country of Arsholes (UFCA) to stop the filthy enemies of Liberty who come from all around Planet Dearth – some of them may be even from outside it!\nFreedom Defender is a satirical tower-defense game which includes many references to today's political reality.\nFeatures Full campaign containing 40 levels\n20 types of units under your command\n40 types of enemies who will try to invade your country\nDifferent difficulty levels\nEndless survival mode (coming soon)\nDifferent minigames based on gambling, driving vehicles and old-school shooting\nFree beer and cheeseburgers\nAnd FREEDOM!\nAttention! Any actual names, events and likenesses are entirely fictional and are used in fictitious and parodic manner. Any resemblance to real life is completely random. The authors of the game in no way encourage the behavior demonstrated in the game, and do not call for its repetition. Players' interpretation of the in-game-content may differ from the developers' idea. Developers of the game have no purpose to insult someone's racial, national, religious, gender and/or other feelings.","imageUrl":"https://media.rawg.io/media/screenshots/d29/d29ed9bfb31bbd409398e5dfd884de3a.jpg","releaseYear":2017,"developer":"League of Sweat Ent.","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45070,"name":"The Thirst of Hearts","genre":"Adventure","price":0.0,"description":"The Thirst of Hearts is a 2D platformer where you play as a little sad Poio, which is out to collect as many hearts as possible. Your main task is to help Poio and to collect all hearts in each level to Poio, and interfere you will be unusual physics, a variety of traps and difficulty of levels that you find from the very beginning of the game.\nTo pass each level you can in several ways that differ in complexity and number of hearts which you can collect by walking along the selected route. You do not have to collect all the hearts to complete the level, but it is necessary to complete the entire game.","imageUrl":"https://media.rawg.io/media/screenshots/c7f/c7f59ead905dcfdacfcc2f6b9db8efe7.jpg","releaseYear":2017,"developer":"Mihail Melnikov","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"macOS"}]},{"id":43960,"name":"In Game Adventure: Legend of Monsters","genre":"Action","price":0.0,"description":"A top-down shooter that prioritizes the high difficulty. With a variety of clever weapons and enemies, Legend Of Monsters is an ideal game for players looking for quick and challenging fun without taking too much out of pocket.\nBeautiful and challenging: Perfect combination of retro art pixel with a frantic and challenging environment full of insane battles.\nVarieties of weapons and enemy: several types of weapons with advantages and disadvantages for each occasion and an army of intelligent and prepared enemies for combat.\nIt will never be the same: All phases of the game are generated randomly. Leaving the game different for everyone.\nArcade Mode: Have fun in random phases.\nSteam Achievements: Get Steam Achievements","imageUrl":"https://media.rawg.io/media/screenshots/7d6/7d67bf2a0313c74c5fb8901e3afa4607.jpg","releaseYear":2017,"developer":"Alysson Moraes","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":28950,"name":"NHL 12","genre":"Sports","price":0.0,"description":"(Online Interactions Not Rated by the ESRB)  The Games on Demand version supports  English, German, Czech, Russian.  Be the next legend in hockey with NHL 12. As the sport’s next superstar, earn every shift on the ice with stellar play, big hits, and spectacular goals and prove you have the toughness and skill to lead your team to the Stanley Cup®. Take to the ice in all-new interactive environments where bone-crushing hits, glass-shattering collisions, and bruising checks along the boards are always part of the action. Experience the intensity, speed, and physicality of authentic NHL hockey with NHL 12.","imageUrl":"https://media.rawg.io/media/games/4e9/4e9c4fb99ca0d7bdf6af041490f5b08d.jpg","releaseYear":2011,"developer":"Electronic Arts Canada","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":28913,"name":"SpongeBob: Truth-Sq.","genre":"Action","price":0.0,"description":"SpongeBob SquarePants has gotten himself into quite a predicament. After being entrusted by Mr. Krabs to keep the Krabby Patty formula safe, SpongeBob is overcome with grief for losing the recipe. He then relies on the help of the most unlikely companion, Plankton, who wants the secret Krabby Patty recipe for himself. With the help of his friends, SpongeBob must use Plankton’s memory machine to retrace the happiest moments of his life to find the Krabby Patty formula in time for the Krusty Krab’s Eleventy Seventh anniversary.","imageUrl":"https://media.rawg.io/media/screenshots/0d3/0d30e3707a3e451e317516863bb5c795.jpg","releaseYear":2009,"developer":"Heavy Iron Studios","libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]}]