[{"id":16962,"name":"Battle Battalions","genre":"Action","price":0.0,"description":"Battle Battalions is a free-to-play, tactical PC game that allows you to command a role-specific ‘Battalion’ of military might on a fast-paced, team-based battlefield.\n•\tBattalions are the Backbone - customize and command your personalized Battalions armed to the teeth with lethal military units ranging from stealthy Snipers to hard-hitting Juggernaut tanks.\n•\tReal-Time Tactical Combat - engage in fast-paced, real-time action by deploying ability-boosting air drones, swiveling your tanks’ turrets to blast an enemy's weak side or extracting pinned-down friendlies in trouble.\n•\tControl The Battlefield - roll your Pathfinder Recon Battalion into thick brush for added armor protection or deploy your Suppressor Mortar Battalion on elevated terrain for high-ground ranged assaults.  Taking and defending key points on the battlefield awards decisive advantages and a quicker path to victory.\n•\tTeamwork Above All - each player's Battalion fills a critical role in your 5-player teams.  Coordination with your fellow Battalions is crucial as you play to your own strengths, offset your teammates' limitations, and contribute to your team's overall battle plan.\n•\tEnhance and Advance - gain valuable experience and credit with each battle, allowing you to purchase powerful enhancements, personal customizations and perks unique to your Battalion.  Upgrade your player account to unlock a near endless variety of options to deepen and enhance your battlefield effectiveness.\n•\tEase of Play - eager to jump right in and join the fight?  Just click the big 'Battle' button at the top of the screen any time to get your Battalion's boots on the ground in seconds.   The controls are intuitive to keep the action flowing, and many visual elements in the interface offer helpful mouse-over tooltips.","imageUrl":"https://media.rawg.io/media/screenshots/0c8/0c81c6a3a90cfc0bdd1196e415d16267.jpg","releaseYear":2015,"developer":"Petroglyph","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":12556,"name":"Muv-Luv VR","genre":"Action","price":0.0,"description":"Muv-Luv VR is a short, free demo which lets you experience a small slice of the alternate world of Muv-Luv through the eyes of a soldier trapped in the hopeless battle to save humanity from the BETA in full Virtual Reality(VR™) glory.\n”The culling operation has ended in failure. The Surface pilots left behind are hiding and waiting for rescue. These soldiers have received a transmission from friendly forces, and must quickly move to the evac point for rescue.”\nWelcome to the world of Muv-Luv, where aliens have been invading Earth, and pushing humanity to the brink of extinction.\n*For enjoyment purposes, the BETA have been made much weaker -- you can easily kill them by shooting their head-shaped body parts.\nThis short demo will let you:\nCross a Tank-class BETA infested forest\nGet rescued by TSF from an army of Tank-class and Grappler-class BETA\nExamine from close up a Shiranui 2nd Tactical Surface Fighter\nLearn more about this world at Muv-Luv’s second part - Muv-Luv Unlimited:\nhttp://store.steampowered.com/app/449830\nand Muv-Luv’s third part, Muv-Luv Alternative which will be released later this year:\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=520201131","imageUrl":"https://media.rawg.io/media/screenshots/a95/a9583b3eebad9be83637c82cb9714d07.jpg","releaseYear":2016,"developer":"Degica","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":11373,"name":"johns.game","genre":"Action","price":0.0,"description":"This is johns.game, a Wasteland Survival Game.\nYou are here on Naben, a cold desert wasteland full of criminal activity, death, and loneliness. After fighting off the people who killed your only family you find yourself having nothing left but the two hands in front of you.\n\nThe world is quickly taking a darker turn. People will die, blood will lay ways to the surface of the orange, gray earth. The world will burn under your feet as the people around you fear you. You are John, a man with a cliche name and a hidden story of ethics. You don't care, you control someone with no morals and he will do anything. John... he will burn the world down, break every bone, slaughter every child, and find his truth. Do you want to know what happens in the end? John dies. Everyone dies in the end, it's just the hard truth. I am speaking to you, I just wish you would listen.Included Features:Some features that have batteries included:\nMinipulation;\nIn-Depth Questing;\nGuns;\nFarming;\nCooking;\nFire;\nDeath;\nExplosions;\nDeadly Shovels;\nSexy Ambient Music;\nMore Death;\nTowns & Locations;\nWeapons & Vehicles;\nUnique People;\nMUCH MUCH MORE!;\nHOW HAVE YOU NOT BOUGHT THIS YET?!;\n.\nExtra info from here down\nIf you find a bug or have something you think would be a good fit, please feel free to message the dev directly, complain on Twitter or just post in the disscusions in the community hub.\nThe game is moderately complicated and involves a lot of thought. There are real world aspects (for example, lighting a fire using fire, breaking a snowman gives you snow, etc.) for a slightly more realistic tone. This game is pretty community driven in the sense that if you want something you just ask.","imageUrl":"https://media.rawg.io/media/screenshots/5ca/5cae2f9b6f0f5d8f894f4d1c47ce858d.jpg","releaseYear":2017,"developer":"GCRH","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10956,"name":"Echoes of the Fey Episode 0: The Immolation","genre":"Adventure","price":0.0,"description":"Imagine being the only survivor of an explosion that kills thousands of people. That is the fate of Sofya Rykov. And survival is just the beginning of her tale...\n***\nNOTE: This game uses 3D graphics and lighting. Please check Minimum Specifications before playing to ensure a good experience\n***\nEpisode 0: The Immolation is a free, standalone chapter in the Echoes of the Fey adventure game/visual novel series. This installment will serve as an introduction to players new to the series and provide important backstory to players who enjoyed Echoes of the Fey Episode 1: The Fox's Trail, already released on Steam. Play as Sofya Rykov, before she became a private investigator and before she was cursed with unstable magic powers. An officer in the Imperial Army, Sofya is tasked with guarding Leshin prisoners at Onigrad, a city which will soon become famous for its fiery destruction.\n3d environments and dynamic camera angles via our new UE4 implementation\nEnglish voice acting (expression lines)\nOver 1 hour of story with multiple choice branches\nSoundtrack featuring new songs and remixes of Episode 1 tracks reflecting the dread of the Immolation of Onigrad\nA free introduction to a series which will span multiple episodes\nAchievements and trading cards\nIn the last days of the long war between Humans and Leshin, a tense stalemate has emerged. For years, Leshin have lain siege to the Humans over their use of Fey reactors, massive machines that draw electricity from the realm of magic. Both sides tire after almost thirty years of war, and perhaps peace is now in reach. But Leshin extremists, desperate for a victory to reclaim their power among the people, are about to stage a devastating attack that will change the world forever.\nEchoes of the Fey is a series of detective stories set in the high fantasy world of Oraz. Episode 0: The Immolation takes place before the protagonist, Sofya Rykov, becomes a private investigator. She is an officer in the Imperial Human army who believes she has secured a safe position as a prison guard in the metropolitan city of Onigrad. One fateful night, one of the Leshin assigned to her begins to act strangely. And then a massive boom rings out from the Onigrad Fey reactor...\nEpisode 0 is an adventure game/visual novel with dialog trees and several choices for Sofya that will affect the way the story plays out. Sofya will also be able to walk around the prison and learn more about the world from her prisoners, though with an impending disaster about to hit the prison, she will have to balance how to use her time before staging her escape.","imageUrl":"https://media.rawg.io/media/screenshots/f0c/f0cfce85920ef8751b3655803abfd520.jpg","releaseYear":2017,"developer":"Woodsy Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":10837,"name":"Heroes of Dire","genre":"Adventure","price":0.0,"description":"Limited Huppo Warrior Gift!Special limited edition Huppo Warrior fighters for new Steam players! Just win a battle to collect yours!\nAbout the GameHeroes of Dire is a new massively-multiplayer tactical role-playing game from Spellbook!\nYou are a powerful hero with an army of fighters battling through strategic turn-based combat to win treasure, fame, and glory for your guild!\nJoin with friends to defeat challenging deity boss raids, take up quests for epic treasure, invade enemy guild halls, and fight in brutal gladiator arenas as crowd favorites live and die for your amusement!\nCross-platform servers bring together thousands of players on desktop and mobile devices with support for Windows, Mac, Linux, Android, and iPhone!\nThe New Player Guide is available at https://dire.wiki/guide\nHeroes of Dire is all about assembling squads of fighters to make war with other guilds, monsters, and players!\nFighters come in many fantasy archetypes such as Mages, Paladins, and Healers. No two are ever the same, with unique names, races, stories, stats, titles, and equipment constructed by procedural generation with impressive and hilarious results that will always keep the game fresh.\nThe One-Eyed Knight, Two-Fingered Pete, The Laughing Horror, Georgia the Peach, or Screaming Ethel are just a few examples of the trillions of possibilities. For a few Silvers (the in-game currency) players can randomly roll for new fighter names to discover the perfect moniker, or work with a live Dungeon Master to create the perfect name!\nFighters have four gear slots: Weapon, Offhand, Armor, and Trinket.\nDifferent items help determine what role a fighter plays, such as holy wands and flasks for Healers, or poisoned dual-wielded daggers for Rogues to maximize backstabs.\nA robust crafting system allows heroes to build the perfect gear sets, with the most skilled players able to construct ultra-rare Masterwork items!\nAlmost all items in Heroes of Dire are procedurally generated with no two ever the same. Dungeon Masters will regularly appear in the world as traveling magicians or blacksmiths who can enhance your gear, or as merchants offering unique treasures.\nWhen in combat, fighters take turns moving and attacking with actions having a time cost that determines round order.\nMore expensive actions, such as splitting an enemy archer in half with a greatsword, might push your fighter to the bottom of the action list for 14 rounds, while moving would only cost 3 or 4. This turn-based combat system creates an incredibly rich strategy simulation where each decision has a direct and immediate impact on who wins or loses.\nSkilled players won't waste a single round -- One move in the wrong direction or an attack at the wrong time can immediately swing your massive lead into a crippling loss.\nEvery battle is part of a greater narrative, such as a guild war or a quest chain, and players can have multiple squads involved in many fights at the same time.\nNeed to pause the game for a moment?\nExiting a battle puts the AI in control of your squad until you're ready to return. Utilizing this AI system you can deploy multiple squads to wage multiple battles across the world map simultaneously. This system creates a truly massive multiplayer experience as guild wars can pull in hundreds or thousands of players!\nPartner up with friends and follow them into combat for hours of quests, guild wars, and special Dungeon Master events! Battles can involve up to 48 fighters, with as many as 12 players in a single fight!\nMake sure to flag your friends as \"FRIEND\" to enter battle on the same team and share world map vision, or simply join the same guild.\nGuilds play an integral role driving the story and action in Heroes of Dire! Besides social and organizational hubs, they will wage war for dominance of the world map, with members winning prizes and benefits for capturing resources, such as an ancient relic or metal ore node.\nQuests are a series of battles against NPC factions in the world of Dire, with powerful items and precious Silvers at stake. Loot can then be sold on the player-driven open market, or scrapped for extra Silvers.\nLarge-scale Community Quests are available for every hero to join, as well as Solo and Guild quests. Some quests also have\nEach player will have a custom player title. In addition to looking cool, these titles help inform us of who is who in the community. Players sporting powerful or unique titles will stand apart from the crowd, lending weight to their obviously superior opinions and impressive physiques. Everyone will have the chance to earn new titles when taking part in special Dungeon Master events, and are also randomly generated after 1,700 battle wins.","imageUrl":"https://media.rawg.io/media/screenshots/65c/65c9ff5883638df82d8a0def121a212f.jpg","releaseYear":2017,"developer":"Spellbook","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC"}]},{"id":3739,"name":"Dynasty Warriors 8: Xtreme Legends","genre":"Action","price":0.0,"description":"'Dynasty Warriors 8: Xtreme Legends' introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in 'Dynasty Warriors 8.'\nIn story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is now possible to play as the mighty warrior 'Lu Bu,' and embark on a journey that depicts his way of life.\nAdditionally, many new hypothetical scenarios to existing Romance of the Three Kingdoms battles have been added, as well as new playable characters, weapons types, growth/speedrun elements, and more!\nWhat's more, a revamped Ambition Mode and completely new Challenge Mode offer whole new ways to enjoy the 'Dynasty Warriors 8' universe.\n1-2 players\n6MB minimum save size\nHDTV screen resolution: 720p\nDUALSHOCK®3\nNetwork Features\nNetwork Players 2-2\nThis item is being licensed or sublicensed to you by Sony Computer Entertainment America and is subject to the Network Terms of Service and User Agreement, this item’s use restrictions and other applicable terms located at www.us.playstation.com/support/useragreements. If you do not wish to accept all these terms, do not download this item. This item may be used with up to 2 activated PlayStation®3 systems associated with this Sony Entertainment Network account.\nDYNASTY WARRIORS 8: Xtreme Legends©2013-2014 TECMO KOEI GAMES CO., LTD. DYNASTY WARRIORS, Xtreme Legends and the KOEI logo are registered trademarks of TECMO KOEI GAMES CO., LTD. The KT logo is a registered trademark of TECMO KOEI HOLDINGS CO., LTD. All rights reserved.","imageUrl":"https://media.rawg.io/media/games/2d7/2d7b4d407a59e63003b2e66900ff3ad5.jpg","releaseYear":2013,"developer":"KOEI TECMO America","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"}]},{"id":3229,"name":"XBlaze Lost: Memories","genre":"Adventure","price":0.0,"description":"Collect the mysterious Memory Fragments to unravel the truth!\nXBlaze Lost: Memories is a visual-novel game based in the BlazBlue universe and the sequel to XBlaze Code: Embryo! Play as the enigmatic pink-haired protagonist as she navigates through a weird and wondrous alternate reality with the help of the mysterious girl Nobody in order to save her sister, who disappeared into this unknown world! While there she is tasked with finding “Memory Fragments”, crystallized memories that not only serve as keys that will help her move on and find her sister, but also uncover the identity and story of the person those memories belong to!","imageUrl":"https://media.rawg.io/media/screenshots/0ac/0ac25cf14447cada6b4608a1b8bb547b.jpg","releaseYear":2015,"developer":"Arc System Works","libraryGames":null,"platforms":[{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PC"}]},{"id":1438,"name":"Alone With You","genre":"Adventure","price":0.0,"description":"Rei's high school life was a failure - he never made a single friend in three years. But suddenly, three months before his graduation, life gives him a chance to change everything, to brighten up the last months of school. But will he accept this gift of fate?\nThis game features:\n10 background arts\n10 CGs\nlive2d sprites with various animations and lip-sync\nvoiceovers for every heroine\nThis is a Japanese-themed visual novel created by indie developers. Yui\nCheerful and mischievous girl, Rei's classmate. Yui has two little siblings, Sora and Seki, She has to work on two part-time jobs because parent abandoned them when she was 8 years old. Miya Shy and timid girl, Yui's best (and only) friend. Her parents are very strict - they don't even let her to get home later than 8 pm. Eiko Rei's stepsister. Rei's dad Slava get her from the orphanage house when she already was 11 years old. Because she lived for a long time without parents and family, she became really aggresive. She's always mad at the Rei because he's not popular in the school.AkiraHard-working and sincere girl. Rei met her in \"Akudevi\" - an online mobile game. One day she invited Rei to meet in real life. He thought that Akira is a male, that's why he agreed easily. But she turned out to be a beautiful girl. Rei Typical japanese high school student. He likes playing mobile games.","imageUrl":"https://media.rawg.io/media/screenshots/eb8/eb85bd4abfe2015435954fb8dd4c193c.jpg","releaseYear":2016,"developer":"Benjamin Rivers","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PC"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PS Vita"}]},{"id":1435,"name":"Doodle Devil","genre":"Simulation","price":0.0,"description":"Coming Soonhttp://store.steampowered.com/app/625430\nCheck Out More Doodle Gameshttp://store.steampowered.com/app/348360\nhttp://store.steampowered.com/app/598940\nhttp://store.steampowered.com/app/538060\nhttp://store.steampowered.com/app/431640/\nAbout the GameIf You Love Doodle God…Embrace Your Dark Side with Doodle Devil!\nWhile Doodle God was busy creating the universe, Doodle Devil was also having some fun.\nThe same addictive, puzzle game play that made Doodle God a hit is back but with an evil twist. Discover the seven deadly sins and watch as the world crumbles at your fingertips as you create thousands of dastardly deeds.\nCombine fire, earth, wind & air to create demons, beasts, zombies... and much more. Being bad has never been so much fun!\nCRITICS LOVE IT!\n“It’s addictive. Insanely so! Lots of fun.” – 148Apps\n“Wonderfully unique concept. Deeply satisfying!” – GameZebo\n“Discovering each new element was an utter delight.\" – AppSafari\n\"You'll have to use your creativity…ruthlessly addictive.\" – Slide2Play\n“Giving it huge thumbs up!\" – TUAW\n\"Now I can unleash my wraith upon the world.\"\n\"Better than sinning!\"\nThe Power of Destruction is in Your Hands!FEATURES- New Demon Battle Card Game: Fight your 9 Demons!\n- Mold the combinations of fire, earth, wind and air to create a universe of your\ndarkest desires!\n- Available in 13 languages: English, German, Dutch, French, Spanish, Italian,\nRussian, Japanese, Chinese, Korean, Portuguese, Swedish and Polish.\n- New Graphics!\n- New User Interface.\n- New Demon Mode!\n- Intuitive one-click gameplay encourages thoughtful, creative play.\n- Hundreds of interesting, funny and thought-provoking quotes and sayings.","imageUrl":"https://media.rawg.io/media/screenshots/a4c/a4c2d494742829a37b7dec410d7f6082.jpg","releaseYear":2011,"developer":"8Floor","libraryGames":null,"platforms":[{"id":0,"name":"macOS"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":989580,"name":"Mouthwashing","genre":"Adventure","price":0.0,"description":"More from CR Channelhttps://store.steampowered.com/app/2601530/Regular_Home_Renovation_Simulator/\nAbout the GameMouthwashing is a first-person horror game following the dying crew of a shipwrecked space freighter.\nWho could have known what good ol’ Captain Curly was capable of? Guess he thought his crew dying alongside him was only right. But some men can’t even kill themselves properly. Maimed, limbless and unable to speak, but alive, Curly is now at the mercy of the crew he has doomed to a slow death.\nDescend into Madness Follow the lives of the crew as they weather starvation, isolation, and each other. People were never your strong suit anyway.\nZero Chance of Rescue The ship will run out of power within six months. Food rations long before that.\nImmersive Storytelling Pay attention to your surroundings.\nPsychological Scares Your eyes are lying.\nUnforgiving Narrative Hope to die, or for goodness sake, pray that everyone else did.","imageUrl":"https://media.rawg.io/media/games/ba1/ba1bf58929130f56be870b6217746aed.jpg","releaseYear":2024,"developer":"Wrong Organ","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":988673,"name":"Warhammer 40,000: Space Marine 2","genre":"Action","price":0.0,"description":"EDITIONS BREAKDOWN\nAbout the Game\nEmbody the superhuman skill and brutality of a Space Marine. Unleash deadly abilities and devastating weaponry to obliterate the relentless Tyranid swarms. Defend the Imperium in spectacular third-person action in solo or multiplayer modes.\nFight the enemies of Mankind as Lieutenant Demetrian Titus in this sequel to 2011’s Space Marine, and prove your loyalty once again as you are reinstated to the Ultramarines. Hold at bay the horrors of the galaxy in epic battles on far-flung planets and uncover dark secrets to drive back the everlasting night.\nDive into a war of galactic proportions! Enjoy intense, gory and fast-paced third-person action with hundreds of enemies on screen, and purge the relentless Tyranid swarms made possible by Saber’s trademark Swarm Engine.\nJump in endlessly brutal and replayable PvE and PvP modes as your own Space Marines, unlocking new skills and cosmetics the more you play! Fight as one of six unique classes, unlock up to 25 perks for each class, add perks to each of your weapons, and customise your appearance with a huge array of armour and weapon cosmetics!\nhttps://store.steampowered.com/app/2183900/Warhammer_40000_Space_Marine_2/","imageUrl":"https://media.rawg.io/media/screenshots/30f/30f44a25cf60d110adc0614f11c413bc.jpg","releaseYear":-1,"developer":"Saber Interactive","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":964847,"name":"Savant - Ascent REMIX","genre":"Indie","price":0.0,"description":"Prepare-se para uma viagem de elevador repleta de adrenalina que atravessa uma torre infestada de robôs. Obtenha magias poderosas e movimentos acrobáticos ao passo que você reivindica o domínio do Alquimista de uma horda de criaturas mecânicas.\nA continuação do premiado Savant - Ascent levará você a uma aventura acelerada rumo às alturas!\nEnfrente os desafios únicos a cada fase, novos inimigos e chefes poderosos! Erga-se contra a Assembleia e encare os Tubarões a Laser! Explore a escuridão das Catacumbas, o lar do elusivo de Valchemist! Lute contra os invasores em meio às estrelas enquanto ascende para enfrentar oponente supremo: o Samurai Imortal!\nUm shooter com visão de cima e uma novidade: pule ou deslize entre duas plataformas para se esquivar dos ataques inimigos ou encontre a posição certa para dar o tiro perfeito.\nEncha a barra de poder e dispare magias explosivas nos inimigos.\nColete poderes enquanto ascende para aumentar suas habilidades. Desbloqueie as músicas bônus do compositor Savant.\nVários modos para jogar:\nModo Normal: conquiste a torre no seu ritmo. Os checkpoints ficam entre as fases e antes do chefe. Colete vidas extras durante a ascensão.\nModo Hardcore: enfrente um desafio mais difícil. Domine as habilidades à sua disposição e conclua todas as fases de uma vez: sem checkpoints ou vidas extras.\nModo Survival:  lute contra o relógio. Os inimigos surgem em maior número, os chefes aparecem quando bem entendem e você que se vire para sobreviver o máximo que puder.\nConheça o mundo fantástico de um compositor como nunca visto antes em Savant - Ascent REMIX, disponível em 15 de setembro, no Steam.","imageUrl":"https://media.rawg.io/media/screenshots/2fc/2fcd58fa77cd645b5c6bdcbb1835d5b3.jpg","releaseYear":2023,"developer":"D-Pad Studio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":857623,"name":"Bonelab","genre":"Action","price":0.0,"description":"BONELAB\nSentenced to death, you embody an outcast escaping fate. Discover a pathway to a hidden underground research facility. A series of challenging experiments and discoveries await. A road to the truth calls from the void.\nPhysics to the core\nBoneworks' realistic physics systems fully improved and polished. Interact with the game world with consistent confidence.\nVisceral VR combat\nUsing a variety of ranged, melee, and exotic physics weapons, engage enemy encounters with an entire armory at your disposal.\nBe anyone you want\nCustom avatar importing enables you to play through the game looking however you want, with physical stats to match.\nLayered Narrative\nAfter discovering an underground lab in MythOS city, you will have access to a variety of game locations including arenas, obstacle courses, tactical trials, sandboxes, experimental modes, and user generated levels. Collecting items, avatars, and clues from these locations enable you to progress through the mysterious story.","imageUrl":"https://media.rawg.io/media/games/671/671e474e5a1daae9268b9724177d7ea9.jpg","releaseYear":2022,"developer":"Stress Level Zero","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":714510,"name":"Furry Love 2","genre":"Action","price":0.0,"description":"Join us! 🦊\nAbout the GameGeneral\nFurry Love 2 is an Entertaining Arcade Game, consisting of a Series of Exciting Mini-Games with the Attractive Furry Girls 🦊\nBeautiful Furry Girls, Amazing Atmosphere, Great Music, 56+ Levels with Full HD Furry Artworks.\nGreat for relaxing after a hard day at work. Join us! Unique Features\nSeven Game Modes\nDynamic Gameplay and Various Difficulty Levels\n56+ Wonderful Levels with Full HD Furry Artwork\nAmazing Atmosphere & Great Music\n100 Achievements\nCheat Code to Complete the Level - \"LOVE\"\nContact - darkfantasy.gamedev@gmail.comGame Modes\nFurry Tron\nFurball\nFurrman\nFurry Cutter\nCatch the Furry!\nPuzzle\nRock, Paper, Scissors\nMany thanks to our artists!\nTotesFleisch8\nDanomil\nMissy\nSmileeeeeee(Oduvan7773)\nPaintchaser\nHpNerd-ALS","imageUrl":"https://media.rawg.io/media/screenshots/ee0/ee098b8fec80cd876ea9cb60a8490ada.jpg","releaseYear":2021,"developer":"빌리 헤링턴","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"Linux"}]},{"id":610255,"name":"Rubber Bandits: Summer Prologue","genre":"Action","price":0.0,"description":"WISHLIST THE FULL GAME!https://store.steampowered.com/app/1206610/Rubber_Bandits/\nJoin our discord!\nAbout the Game\nRubber Bandits: Summer Prologue is a multiplayer brawler for up to 4 players.\nSun, sand between your toes and the joy of beating your friends with dead fish. That is what you get in Rubber Bandits: Summer Prologue.\nGrab whatever you can find and use it as a weapon. First to 3 wins takes the prize.\nFight free-for-all or team up for a 2v2.\nNo hassle multiplayer - Play online, locally or everyone on one PC.\nPick your favorite summer character\nBeat your friends with anything from water balloons to stranded sharks.\nThe Summer Prologue gives a taste of what you can expect when the full game Rubber Bandits is released later this year.\nIf you like what you see please make sure to follow the development on our Discord or other social channels.","imageUrl":"https://media.rawg.io/media/screenshots/235/235b75e1cbab207e42162437554fd1b0.jpg","releaseYear":2021,"developer":"Flashbulb Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":527428,"name":"Puzzle Together","genre":"Casual","price":0.0,"description":"Jigsaw puzzle fun - on your own, with friends and family, or with new puzzle pals from around the world! Voice chat lets you feel like you're all sitting around the same table. Automatically sort pieces by edges or color. Choose from hundreds of beautiful images of all kinds, or create custom puzzles from your own pictures. Features 3D pieces and physics for a realistic puzzle-making experience!","imageUrl":"https://media.rawg.io/media/screenshots/049/0491e05b99299652f3ff7d42a2359b32.jpg","releaseYear":2020,"developer":"IronZog","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":472315,"name":"Forza Motorsport","genre":"Racing","price":0.0,"description":"Witness the power of Xbox Series X through Forza Motorsport. Automotive entertainment is reimagined for a new generation.\nInstead of continuing the 15-year-old simulation racing franchise’s numerical naming scheme with “Forza Motorsport 8,” Microsoft is dropping the number for this entry in the series. It’s just going to be called Forza Motorsport — the same as the Xbox game that kicked off the franchise back in 2005.","imageUrl":"https://media.rawg.io/media/games/e9e/e9ecc560712ebfa6761e45d2523b0fb9.jpg","releaseYear":2023,"developer":"Turn 10 Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox Series S/X"}]},{"id":403043,"name":"AO Tennis 2","genre":"Sports","price":0.0,"description":"A PLAYING FIELD MADE FOR YOU, BY YOU\n• Use the comprehensive Academy editing suite to create a player just like YOU as well as your own courts, or you can download thousands of community creations.\nTHE BEST PLAYERS IN THE WORLD\n• See how you compare to the big names on the ATP & WTA circuits, including Rafael Nadal, Ash Barty, Angelique Kerber and many more.\nA COMPLETELY REDESIGNED CAREER MODE\n• Set out to conquer the world rankings  in a singles career or in doubles with a friend. Manage your Reputation, sponsors and performance to reach the top.\nNEW GAME MODES\n• Relive legendary matches or create new challenges using the scenario editor.","imageUrl":"https://media.rawg.io/media/games/3b1/3b1d53557f1e3295a10b47d5cbaa83f2.jpg","releaseYear":2020,"developer":"Big Ant Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":327224,"name":"Kingdom Hearts III: Re Mind","genre":"RPG","price":0.0,"description":"","imageUrl":"https://media.rawg.io/media/games/162/162a3a01d1fc1e5829e8a1444137138a.jpg","releaseYear":2020,"developer":"Square Enix","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":261247,"name":"Fate/Extella Link","genre":"Action","price":0.0,"description":"Picking up where the story ended in Fate/EXTELLA: The Umbral Star, Fate/EXTELLA LINK expands the roster of playable Servants with 10 legendary heroes added to the original selection of 16. These newly added Servants hail from other entries in the Fateseries and include the likes of Astolfo, Scàthach, and Francis Drake. The high-speed action gameplay of Fate/EXTELLA: The Umbral Star returns with improved visuals and new battle mechanics in both single-player and an added multiplayer mode supporting 4-on-4 online battles on PlayStation®4 system. Players will also be able to move freely around their new base camp—a medieval cathedral suspended in the sky—and interact with Servants to build bonds with them.\n\n•Combatants from Across the Fate Universes Join the Fray\nIn addition to the 16 original Servants from Fate/EXTELLA: The Umbral Star, characters from other Fate series will enter battle as playable Servants, including Astolfo from Fate/Apocrypha, Scáthach from Fate/Grand Order, and the return of Francis Drake from Fate/Extra.\n\n•A Thrilling Continuation of the Fate/EXTELLA Legend\nThe original creator of Fate/stay night and the scenario writer of Fate/EXTRA, Kinoko Nasu, returns as supervising director for Fate/EXTELLA Link. The story will further develop the lore of this universe.\n\n•Hunker Down in Base Camp\nMove freely around your army’s base camp—a medieval church suspended in the sky. Interact with your Servants to build your bonds and take on side-missions to learn their stories.\n\n•Polished Graphics and Battle Mechanics \nBoth combat mechanics and animation have been refined for the ultimate in single and multiplayer battles. Team up with support Servants to deliver devastating Chain Phantasm attacks.","imageUrl":"https://media.rawg.io/media/screenshots/e14/e141a7f02276e01e25a9a1bacdf0d9e4.jpg","releaseYear":2018,"developer":"Marvelous","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"PS Vita"},{"id":0,"name":"PlayStation 4"}]},{"id":257358,"name":"No Time to Relax","genre":"Strategy","price":0.0,"description":"No Time to Relax is a life simulation game where up to 4 players compete against each other in the ultimate game of life. The players start of in a lousy apartment, with no job or education. To win the game, the players have to get better jobs by educating themselves and through work experience. This might seem easy, but working and studying your ass off will turn the players into balls of stress. It almost seems like there is no time to relax! To win the game the player has to evenly juggle the 4 pillars of life itself, cash, well being, education and happiness.\nCompete against your friends locally, the computer or just try to beat the game in as few weeks as possible and beat your high-score.","imageUrl":"https://media.rawg.io/media/screenshots/c3d/c3d3b03eb01e40c66e2edcf1619fac7c.jpg","releaseYear":2020,"developer":"Porcelain Fortress","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":216365,"name":"Paw Patrol: On A Roll!","genre":"Action","price":0.0,"description":"PAW Patrol is on a roll!\nNo job is too big, no pup is too small! The PAW Patrol is ready to save the day in Adventure Bay on 16 exciting rescue missions, but they can only do it with your help! Help each pup use their unique abilities to rescue friends and keep their community safe. Jump into eight awesome Adventure Bay locations, including Farmer Yumi’s Farm, Jake’s Mountain, a desert canyon, under the waves, and more! Get ready for fun puzzle-platforming action that is PAWfect for kids of all ages with all the pups of the PAW Patrol!\nFeatures\n• Ryder and all eight PAW Patrol pups, including Everest & Tracker!\n• 16 daring adventures set in 8 Adventure Bay locations!\n• Special pup abilities that need to be used for each rescue!\n• Playing as two different pups per mission!","imageUrl":"https://media.rawg.io/media/screenshots/25c/25cad74bdf7305392b4c52a454f61fcf.jpg","releaseYear":2018,"developer":"Torus Games","libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"}]},{"id":65328,"name":"Dreams of Dali","genre":"Simulation","price":0.0,"description":"Enjoy the remarkable marriage of art and technology in Dreams of Dali, a virtual reality experience from The Dali Museum (St. Petersburg, FL), as you explore Dali's painting “Archaeological Reminiscence of Millet's ‘Angelus’.” Immerse yourself in the world of the Surrealist master like never before in this encounter, venturing into the towers, peering from them to distant lands and discovering surprises around every corner. We imagine Dali himself, known in his lifetime as what we now call an \"earlier adopter\" of new technology, would applaud this inspiring homage to his 1935 painting.\nThis award-winning VR experience has garnered visitor acclaim, online praise and international recognition through a multitude of industry awards, including the prestigious Cannes Cyber Lion GOLD; a Webby People's Voice award; and a Facebook Silver award for Innovation, among others.\n©Salvador Dali Museum, Inc., St. Petersburg, FL. Created for The Dali by Goodby Silverstein & Partners, San Francisco, CA.","imageUrl":"https://media.rawg.io/media/screenshots/ea4/ea489407bbfab0d8cf1bd3142456937d.jpg","releaseYear":2018,"developer":"Half Full Nelson","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":56093,"name":"The Legend of Zelda: Four Swords Adventures","genre":"Action","price":0.0,"description":"The Legend of Zelda: Four Swords Adventures is the eleventh installment in Nintendo's The Legend of Zelda series. It was released for the Nintendo GameCube home video game console in Japan on March 18, 2004; in North America on June 7, 2004; in Europe on January 7, 2005; and in Australia on April 7, 2005. The Game Boy Advance handheld game console can be used as a controller when using the Nintendo GameCube – Game Boy Advance link cable bundled with the game in North America and Europe. The game is fully compatible with the Nintendo Wii including the use of the Game Boy Advance Link Cables.\nThe game takes Link on an adventure to restore peace to Hyrule after learning that an evil counterpart of himself, Shadow Link, has been created. Four Swords Adventures was considered the 48th-best game ever made for a Nintendo system by Nintendo Power, and received an aggregated 86 out of 100 from Metacritic. It was the third best-selling game of June 2004 in North America, with 155,000 units, and has since sold 250,000 copies; it has also sold 127,000 units in Japan.","imageUrl":"https://media.rawg.io/media/screenshots/336/336e29b524e0e4f17ac2d2b9339baea4.jpg","releaseYear":2004,"developer":"Nintendo","libraryGames":null,"platforms":[{"id":0,"name":"GameCube"}]},{"id":52297,"name":"DJMax Respect","genre":"Action","price":0.0,"description":"Legendary rhythm action game finally arrives on PlayStation®4!\nEnjoy all classic DJMAX songs and brand new exclusive songs with 'DJMAX RESPECT'!\nOnline features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy).\n1-2 players\nNetwork Players 2-2 - Full game requires PlayStation®Plus membership to access online multiplayer\n27GB minimum save size\nDUALSHOCK®4\nOnline Play (Optional)\nSoftware subject to license (us.playstation.com/softwarelicense). Online features require an account and are subject to terms of service and applicable privacy policy (playstationnetwork.com/terms-of-service & playstationnetwork.com/privacy-policy). One-time license fee for play on account’s designated primary PS4™ system and other PS4™ systems when signed in with that account.\n© NEOWIZ Corp. All rights reserved.","imageUrl":"https://media.rawg.io/media/screenshots/af9/af9f2963bc54cd07e89186ffdbedf787.jpg","releaseYear":2018,"developer":"NEOWIZ","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":51758,"name":"Sacrifice Dungeon","genre":"Action","price":0.0,"description":"You are a monster slayer!\nYour job is to help the village of Riksbruk against their undead problems!\nSacrifice Dungeon is an FPS that pays homage to the FPS of old. The game is built on Ray Casting technology, simple yet challenging. Fight your way through hordes of monsters while collecting items and increasing your high score. Find the source of evil that is causing great turmoil to the village of Riksbruk!","imageUrl":"https://media.rawg.io/media/screenshots/69a/69afceb7f65142c291fadfde0b4f98f3.jpg","releaseYear":2018,"developer":"XMinutesGames","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":50635,"name":"Antigraviator","genre":"Action","price":0.0,"description":"In the year 2210, racing has evolved far beyond its expected limits. New terraforming capabilities paired with scientific breakthroughs in the field of antigravity have given birth to a new spectacle: the Antigraviator tournament.\nRace perpetually on exquisitely detailed stages, full of light-speed danger, chaos and mayhem. Guide your Grav in three gameplay modes across four different worlds with three tracks each. These dynamic courses come to life, while pushing the power of Unity to the limit.\nChallenge your friends in the fiercely competitive multiplayer modes, either online or in split-screen mode. Race yourself to the top of the worldwide leaderboard and earn special ranked skins.\nSplit-screen gameplay\nSabotage your fellow racers by activating hover mines, damaging the environment to create a rockslide, causing tunnels to collapse, firing missiles from rocket launchers along the track and many more malicious tricks.\nCustomize your Grav to your heart’s content, but choose wisely: deciding on one upgrade may mean compromising on another. Strategically tailor-make your Grav to gain the upper hand in races or face the crushing prospect of defeat. In addition to the customization options, unlockable skins will be available free of charge.\nIn this futuristic high-octane racing game, defying gravity is the least of your concerns.KEY FEATURESNo speed limit!\nPlay the single player campaign to unlock new parts, ships and skins\nRace your friends with local split-screen multiplayer for up to 4 players\nRace anybody in online multiplayer mode with rankings and leaderboards\nUse environmental traps to overtake your opponents\nPower-ups and boosts allow you to become top of the track\nShip customization gives you an edge over the opposition\nFour beautifully created sci-fi worlds with three dynamic courses each\nStunning realistic 3D graphics powered by Unity\nSoundtrack featuring 12 intense tracks that will enhance your racing experience","imageUrl":"https://media.rawg.io/media/screenshots/49e/49e3f5b1f4bc5bd7ea6fdf49393e7ef0.jpg","releaseYear":2018,"developer":"Cybernetic Walrus","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":50373,"name":"SMACKHEAD","genre":"Action","price":0.0,"description":"Your comatose and trapped in a dream. The only chance of waking up is by finding portals and advancing deeper into the dream to find a way out. But you are timed and need to collect clocks to give you more time running out will end the game.Theres enemy's you can smack  with your extendable hand and deadly traps you need to avoid. Featuring over 50 levels with bosses and puzzles to up the challenge can you complete all the levels of SMACKHEAD to escape from this strange dream and take the completion acheivement?","imageUrl":"https://media.rawg.io/media/screenshots/4b1/4b158dd44ab42699fb1fe040f3a989de.jpg","releaseYear":2017,"developer":"Kev Jackson","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":46420,"name":"Valnir Rok","genre":"Action","price":0.0,"description":"Valnir Rok is an online sandbox survival roleplaying game inspired by Norse mythology. Players will awaken to find themselves on Valnir Island and must do whatever it takes to survive in a land of wild animals, mythical beasts, and violent men. As a hardened Viking warrior, butcher your enemies in bloody combat, build and improve village structures, and form a clan to expand your power and reputation. Battle against opposing clans, place bounties on hated enemies, and discover ruin artifacts to gain favor with the gods with great deeds and holy sacrifices. Might makes right in the Viking world of Valnir Rok.Survive, Strive, and Thrive the Viking Warrior Life: Brandish swords and axes while taking on wild beasts and legendary monsters. Face other online players in combat to test skill and bravery or create a clan and conquer the island of Valnir.Craft and Discover: Scavenge and combine resources to create unique crafting recipes. A plethora of craftables are waiting to be discovered. Players can craft everything from a complete arsenal of weapons to full thriving cities. The only limit is your imagination and the enemies that stand in your way.Explore Valnir Island: Journey through the island of Valnir to discover living cities filled with NPC’s to help guide players on their journey. Explore crystal-lined caverns and witness the skeletons of giant beasts.Might of the Gods: The actions you take will gain you favor with the three local gods of Valnir. Earn their favor and be greatly rewarded... or betray them and receive divine retribution.Grand Quest System: Experience Viking lore as you complete quests written by award-winning author Giles Kristian or take the story into your own hands by creating your own quests for a completely customized experience.","imageUrl":"https://media.rawg.io/media/screenshots/e92/e92229c390c66df95f68d61ddd6db7f0.jpg","releaseYear":-1,"developer":"encurio","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":45388,"name":"Megaton Rainfall","genre":"Action","price":0.0,"description":"'Megaton Rainfall' is a first-person superhero game. A global alien invasion is taking place and you must face it – alone. Chase massive destruction devices at supersonic speeds around an Earth that's as large as the real thing and populated with semi-procedurally generated cities.\nThen finish off the alien devices with your lethal energy blasts. Just be careful to avoid human casualties! You are so powerful, you'll leave a trail of collapsed buildings if you miss your targets!\nFeel unprecedented freedom of movement as you fly through buildings, break the sound barrier, and accelerate to extraordinary speeds. Then rise above the atmosphere, circumnavigate the Earth in seconds, and get ready for your next battle. 'Megaton Rainfall' is the ultimate superhero experience!","imageUrl":"https://media.rawg.io/media/screenshots/b49/b496256a3f12b6001422fc1aa1b18662.jpg","releaseYear":2017,"developer":"Pentadimensional Games","libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC"},{"id":0,"name":"Nintendo Switch"}]},{"id":44604,"name":"Red Wake Carnage","genre":"Action","price":0.0,"description":"WHAT IS RED WAKE CARNAGE?\nRED WAKE CARNAGE is a chaotic first person shooter that confronts heavily armed players with the most horrifying animals that ever roamed the earth.\nTHE SETTING\nThe world of Red Wake Carnage is filled with animals which have enough of humans careless behaviour and destroying our planet.\nThat is why they decided to act and destroy humanity as we know it.\nTHE PLOT\nThe story starts when animals have united and started humanity wipeout, you are the only one capable and standing between us and extinction.\nFEATURES\nVariety of animals to shoot and dice, ranging from hippos, rhinos, lions, up to crocodiles and zebras.\nMultiple bosses to defeat with wide arsenal of weapons, ranging from ak47 to fireaxe\nRed Wake Carnage will take you on a ride that you will never forget and you will finally appraise the fact that your local store has bleach on the shelves.","imageUrl":"https://media.rawg.io/media/screenshots/06e/06ebd0680e54e3dddee25bab429fe4f4.jpg","releaseYear":2017,"developer":"Racing Bros","libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"macOS"},{"id":0,"name":"PC"}]},{"id":39110,"name":"Fallout 3: Broken Steel","genre":"Action","price":0.0,"description":"You may have dealt the Enclave a serious blow at Project Purity, but their forces are still out there, and still pose a grave threat to the people and security of the Capital Wasteland. In Broken Steel, you’ll continue your current Fallout 3 character past the events of Project Purity, and work with the Brotherhood of Steel to eradicate the Enclave threat once and for all. You’ll travel to new locations like the Olney Powerworks, wield destructive new weapons like the Tesla Cannon, fight powerful new creatures like the Super Mutant Overlord, marvel at the destructive power of Liberty Prime, earn new Perks like the devastating Nuclear Anomaly… and play Fallout 3 all the way to level 30!","imageUrl":"https://media.rawg.io/media/screenshots/af0/af0493df6c5ddb56aed3c23056b5d619.jpg","releaseYear":2009,"developer":"Bethesda Game Studios","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 3"}]},{"id":25163,"name":"Scarface: The World Is Yours","genre":"Action","price":0.0,"description":"They thought you were dead, but Tony Montana doesn’t die so easy. Sosa\ntook everything you had. Now you’ve got nothing, but that never stopped\nyou before. You’re back with a vengeance, ready to reclaim your turf and\nrebuild your empire. All you’ve got are your balls – and your word.\n\nLive the turbulent life of the infamous Cuban drug lord who redefined\nthe American Dream, in an original, explosive script by famed\nscreenwriter David McKenna (Blow, American History X). Wheel, deal and\nclimb your way back to the top. First you get the money, then you get\nthe power, then you get revenge!","imageUrl":"https://media.rawg.io/media/screenshots/fe4/fe4139d39decbb1f877426628bc3ced9.jpg","releaseYear":2006,"developer":"Radical Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"Xbox"},{"id":0,"name":"PC"},{"id":0,"name":"Wii"},{"id":0,"name":"PSP"},{"id":0,"name":"PlayStation 2"}]},{"id":22401,"name":"Over The Void","genre":"Indie","price":0.0,"description":"Made with love, \"Over The Void\" is an experience, an exploration of a strange, beautiful and sometimes psychedelic universe. An original 3D platformer in which you will rediscover the art of wandering...\nEach level is a unique universe to explore, but they all have a common point: the VOID. To get through each of them, you will have to find a way to open the doors which are over the void! Use the tools at your disposal to move in a 3 dimensional environment.\nBeware: Gravity is your main enemy. One misstep and it will be quickly over.\nThe main intention of this game is to make you feel relaxed! Empty your mind, wander around, enjoy the view, the colors, the forms and the amazing music.\nBut still, you have to move with dexterity to avoid falling down. It's like having a walk in an abstract street with abstract bridges and caves, wherein you can throw platforms in the air and jump on as if you were dreaming.\nFly away like nothing else matters.\nKEY FEATURES:\n- Original, beautiful and totally unique universe\n- Simple and funny platformer mechanics\n- Dexterity and contemplation combined\n- 9 unique levels to unlock\n- No princess to save","imageUrl":"https://media.rawg.io/media/screenshots/f9d/f9ddb44623fb483f464ba32c0c45a879.jpg","releaseYear":2014,"developer":"Marie Ronnaux Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":21690,"name":"The Treasures of Montezuma 3","genre":"Adventure","price":0.0,"description":"Darkestville Castle Coming Soon\nSpecial offer for Steam owners of Montezuma 3!\nOnly for the owners of Treasures of Montezuma 3 and 4 on Steam we grant an additional 50% discount for the Treasures of Montezuma 5 till the 31st of March!\nAbout the Game\nMatch tokens to unlock incredible riches in The Treasures of Montezuma 3! With Casual and Timed modes to enjoy, 160 levels to beat, and dozens of mind-bending mini-puzzles to solve, you could be in the jungle for months!\nEnjoy Casual and Timed modes!\nUpgrade your power-ups between stages!\nUnlock incredible riches!","imageUrl":"https://media.rawg.io/media/screenshots/51a/51a630f107b8035639d26e9392319c39.jpeg","releaseYear":2011,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"iOS"}]},{"id":21193,"name":"The Happy Hereafter","genre":"Strategy","price":0.0,"description":"Darkestville Castle Coming Soon\nSave 90% with Buka! Summer sale\nAbout the Game\nWelcome to The Happy Hereafter, a casual sim in which you guide the newly dead as they build an afterlife for themselves and their fellow lost souls. Possessing uncanny management skills, you'll control a legion of zany characters as they arrive at their eternal destination and settle in. There will be no rest for the wickedly funny as you put them to work building houses, harvesting resources and earning money to build a village to rival Paradise. Explore weird but wonderful landscapes, discover cleverly hidden secrets, and complete dozens of challenging missions in your quest to create a little slice of Heaven in the underworld!\nSix locations\nOver 100 missions\nDozens of wacky characters\nComic book style story scenes\nLearn-as-you-play tutorial","imageUrl":"https://media.rawg.io/media/screenshots/b7b/b7b12e1aded02b6e51f607e9ab6ec4ee.jpg","releaseYear":2014,"developer":"Alawar Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20359,"name":"Pixel Star","genre":"Action","price":0.0,"description":"Pixel Star embodies arcade philosophy; brutally challenging, fun and rewarding. With a focus on progressively intense fast-paced action, player freedom, and solid gameplay, Pixel Star reimagines the shoot-em-up genre. From black holes to space centipedes, nebula storms to stray satellites, there is always something new to discover.Features:\nLoads of power-ups and customization options\nUnique, varied enemy AI\nMerciless boss battles\nProgressive difficulty and intensity\nOpen-space environment\nGorgeous particle effects","imageUrl":"https://media.rawg.io/media/screenshots/0fe/0fe9bcc736faf799485f494ad67d427e.jpg","releaseYear":2015,"developer":"Soul Forge","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]},{"id":20339,"name":"MiniDrivers","genre":"Simulation","price":0.0,"description":"The craziest races are now on your hand with MiniDrivers! The animated serie which is loved by millions of people around the world has a new main character: You! Create your own stores or change the rules becoming World Champion.\nIS TIME TO RACE!\nIf something is peculiar with MiniDrivers is their way to see the sport. Who said races are boring? Surprises will be in every corner with the power-ups that you’ve seen on the animated series. Freeze your rivals with the Freeze-o-Kimi, throw a boomerang as the Australian drivers or smash your rivals as the most “shocking” driver does in real life.\nEnjoy three different game modes, like the Tournament that will make you show that you’re the best driver. The season mode will allow you become the 2015 MiniDrivers World Champion and the online tournament that will allow you to show everyone that you’re the best driver with the weekly challenges against your friends around the world. Also you can enjoy the chapter of your favorite cartoons and see all the chapters from our app.\nA SEASON TO REMEMBER\nRace on the 20 most known tracks of the series full of details and surprises that will shock you with the full grid for this 2015 season of MiniDrivers. Will you be able to beat Minicedes with your favorite driver? Now you can do it! Change the story and specially… Change the rules!\nMINIDRIVERS AS YOU HAVE NEVER SEEN BEFORE\nRealistic graphics adapted to the retina display of your Mac's. Also you will be able to change the amount of detail. You will see everything!\nBECOME AN ENGINEER\nRealistic physics for the most exigent drivers with an arcade handling for the little ones. All the people can race at MiniDrivers the videogame! But don’t forget to upgrade your car if you want to be on top and beat your rivals.","imageUrl":"https://media.rawg.io/media/screenshots/624/6246b2eb895a76daf0e8ffa6811ba535.jpg","releaseYear":2015,"developer":"Ivanovich Games","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"}]},{"id":19022,"name":"Putt-Putt Goes to the Moon","genre":"Adventure","price":0.0,"description":"Humongous Tees Now Available!Official Humongous Entertainment T-shirts featuring Pajama Sam, Spy Fox, Freddi Fish, and Putt-Putt are now available on Amazon.\n\nAbout the GamePurple Car Lands on the Moon!\nDue to a freak accident at the Fireworks Factory, Putt-Putt® is blasted to the moon. There he meets Rover, a lovely little lunar terrain vehicle left behind by the astronauts. Putt-Putt® and Rover must work together to rebuild a rocket, and accomplish a few good deeds for the Moon People before they meet the Man in the Moon and are homeward bound. Putt-Putt® Goes to the Moon teaches the benefit of cooperation and the lasting value of friendship.\nPutt-Putt® Goes to the Moon is an adventure game designed especially for children. Bursting with state-of-the-art animation, dazzling sound, hundreds of Click Points, and fully talking characters to thrill you and your child, Putt-Putt's® world unfolds around your child's actions - enhancing problem-solving skills and teaching valuable lessons along the way. Putt-Putt Goes to the Moon is like no other game for children or adults!\nCosmic Cooperation: Kids learn the value of cooperation as they help Putt-Putt® and his stranded pal, Rover, work together to get back to Earth.\nIt's not rocket science: Kids help Putt-Putt® and Rover move along and make choices with a simple click of the mouse. Kids' problem-solving skills are sharpened as they discover how their decisions affect what happens to the world around them.\nFun City: You never know what you'll unearth when you click on a moon crater, a doorway or a lunar gas tank. Aliens pop up, music starts, things explode - all the stuff kids love. With so much fun going on, they learn not to overlook a thing!\nPutt-Putt® blasts kids off to a helpful new world: Kids learn math by counting moon crystals and learn how repeating music patterns can help them open a secret gate.\nThis product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.\nFor more information, please visit - http://www.scummvm.org\nThe GNU GPL can be viewed here - https://www.gnu.org/licenses/gpl-2.0.html","imageUrl":"https://media.rawg.io/media/screenshots/87e/87e5efde500acd82e1163b41ddc22d8a.jpg","releaseYear":1993,"developer":"Humongous Entertainment","libraryGames":null,"platforms":[{"id":0,"name":"PC"},{"id":0,"name":"macOS"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Android"}]},{"id":18532,"name":"Three Days","genre":"Adventure","price":0.0,"description":"Timed gameplay-\nNot often attempted, with modern survival games, is the sense of seriousness to escape in a period of time. Three Days gives a new perspective on urgency by adding a 72 hour - three days - time limit allowing the player to get involved in gameplay with an incentive to escape. We have fine-tuned ThreeDays to suit most players without it being impossible,and for the more casual players we have created an endless mode which has no time limit allowing a less intense experience.Unique creation system-\nThree Days has its own unique crafting system: simply take a movable resource and drag it onto another resource to see what you can create. No inventory, no fuss.Procedurally generated islands-\nThe game includes islands that are randomly generated every time you play allowing diverse gameplay every time it’s played. Not only this, but each island has its own original name and generation and all resources that are generated on the island will be placed elsewhere.Stats-system-\nThree Days contains a dynamic ever changing stats system, where the player is in constant need of attention to survive which is achievable by looking after the players hunger hydration and temperature. The system is ever changing is and the player is always in a new procedurally generated island, meaning different amounts of resources and different weather effects to survive with.Auto-mine-\nThe automine mechanic was influenced by playing other games with different mechanics requiring the player to hit or hold a button to break and collect resources. Personally, I disliked this system and wondered how I could do it differently and came up with the automine feature. The player is simply brought over to the resource desired to break and it will automatically start to break.Upgrade/levelling system-\nThreeDays also allows you to collect experience from breaking primary resources such as trees and boulders, this allows level ups and PPs (Perk Points) which can be spent on 15 different upgrades for the character, such as killing and catching fish without a rod to slowing the timer down. The level system will also directly affect the player’s fate at the end of the game via 4 cutscenes.\nPersonally, I enjoy a game with a bit of context and I really wanted to bring this to ThreeDays. Its unique storyline was managed by allowing the player to play and learn, for instance throughout your time in game you will discover random notes around the shoreline, washed in by the tide, which explain the backstory and what really happened.\nThis is a fan made SCP game which has not been endorsed or made by anyone from the website. I have spoken with the foundation and have done everything legally under the Creative Commons Attribution-ShareAlike 3.0 License http://creativecommons.org/licenses/by-sa/3.0/ this means that I am allowed to release this game and will credit the SCP foundation website for its inspiration to my unique fan made story.","imageUrl":"https://media.rawg.io/media/screenshots/09e/09ebdda6e165d05cb43d2d9d7a4dac91.jpg","releaseYear":2016,"developer":"Lewis Bergin","libraryGames":null,"platforms":[{"id":0,"name":"PC"}]}]