[{"id":219964,"name":"City Builder 2016: County Mall","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219963,"name":"Unknown: Evolution","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219962,"name":"Tap Legends: Tactics RPG","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219961,"name":"Army Commander","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219959,"name":"Upgrade Your Weapon: Shooter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219958,"name":"Project D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219957,"name":"Dagdak Knights: Idle RPG","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219956,"name":"Tile Connect: Tile Match Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219955,"name":"Sheep Sheep 3tiles","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219953,"name":"Modern Gun Shooting","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219952,"name":"MasterChef: Cook & Match","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219951,"name":"Dyno Master","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219950,"name":"Sea Lords","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219949,"name":"Starlost: Space Shooter","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219948,"name":"Escape Room that Moon Night","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219947,"name":"American Commando","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Gear up for an explosive journey into the heart of a twisted war! American Commando combines the razor-sharp wit of Duke Nukem, the mind-bending aesthetics of Wolfenstein, and adrenaline-pumping blitzkrieg-style gameplay. Brace yourself, soldier, and rewrite the course of history!\n\nGet ready to immerse yourself in a nostalgia-fueled, 90s-style FPS adventure that will leave you grinning from ear to ear. Embrace the pixelated charm we all adore and prepare to unleash havoc on hordes of Nazi soldiers. Armed with a formidable arsenal of traditional WWII weapons and mind-bending Wunderwaffe prototypes, obliterate your enemies in style!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6hr3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219945,"name":"Animal Cars Kids Racing Game","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Animal Cars Kids Racing Game is a fun and exciting racing game for young kids and toddlers. With 16 different Animal Cars to choose from, like the cat, dog, lion, penguin, elephant and much more, your child takes control of the animal car with simple controls so it’s easy for them to pick up and play.\n18 different worlds to race in, Collect and eat fruit along the way to unlock more animal cars with the prize claw! If your kids love animals and cars, then this game is for them.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219944,"name":"Alter Dogma","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This RPG features a 2D dungeon that lets you explore the world and find clues regarding the Tree of Life 'Sacred Tree' by managing the Knights hired by the Order.\nDecide on the Knights that you want and lead them by embarking on a journey into an unknown world!\nNurture your Knights with strength, intelligence, vitality, dexterity, agility and luck - six abilities you can distribute strategically to enjoy an extensive type of combat by using nine types of knights and specific operating skills.\nUsing ten different unique character-related skills and common abilities can be useful in combat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219943,"name":"Alpaca Farm!","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get ready to build the most exciting alpaca empire! Take care of amazing alpacas. Build and expand your farm. Beat the competition in exciting trade shows.\nYou will build an alpaca paradise, with stables, shearing rooms, spa, fitness room, … All your amazing animals generate lots of wool, that you craft into fashionable wares for the market. Hire sales managers to sell your wares on the market and earn money to expand in your farm.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8fhh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219942,"name":"Air Hockey Black","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Arcade style Air Hockey with 8 tables to choose from, each with varying levels of difficulty!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219941,"name":"Beyond the Wall","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"You ring your friend's doorbell, but still, no one opens, although the light is on? Discover what happens one summer’s night Beyond the Wall of the garden with the tall house. Immerse yourself into a mysterious world where fantasy meets reality with a pinch of humor. Beyond the Wall is a classic point-and-click adventure with a magical atmosphere and captivating music. Solve puzzles, collect items, and overcome obstacles that await you on your journey in ten unique levels Beyond the Wall. Developed by Rocking Toy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219940,"name":"Between Portals","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Between Portals is an exploration through the intricacies of the universe. Go on a mission to increase humanity's understanding of foreign star systems and discover new stars. As new star systems can be tricky to navigate, you need to alter the flight path of the space capsule to spend as much time exploring as possible. Portals in each star system have a strong gravitational pull, forcing the capsule to take the shortest route on its own.\nFind 270 stars in 90 different star systems on your journey through three galaxies. Use cosmic dust clouds and wormholes to your advantage. Expect to be puzzled and challenged when navigating space labyrinths with hours of good fun and even longer to unlock all 270 stars.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219939,"name":"Ascender","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Ascend from the depths of the abyss in this original 8-BIT style arcade game.\nNavigate through challenging terrain and defeat enemies while trying not to overheat your engine.\nThis simple arcade game will have your heart pumping as you approach the next checkpoint.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219938,"name":"A Detective's Demise","genres":[],"avg_score":0.0,"description":"A Detective’s Demise is a dark, tech-noir inspired 3D audio adventure experience. Take on the role of the “Detective,” a Lambton enforcer with a few tales to tell; as you delve deep in the grime and mystery of a future District 5. Traverse the mean streets of Dusklight’s most brutal district as you search for “her,” encountering all manner of creatures, the lowest of the low, emboldened with heightened technology at your side. Pitch Black: A Detective’s Demise.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":219936,"name":"CubicTourPlus.","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"With simple rules, a cool look, and players all over the world, Cubic Tour has now been updated extensively with new features!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219935,"name":"Crossy Animals Road","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tasty Candy that will leave you hungry for more and hours of fun!\nHow FAR can the deer go? Why did the DEER cross the road? Discover how many roads and logs can the deer, frog and more animal characters can cross!\nDon't let the cars and trains hit you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219934,"name":"CrimeStory: In the restaurant","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"All the restaurants we go to. Quiet music, friendly atmosphere, delicious food. But the inner life of the restaurant is hidden from prying eyes. What's going on in the kitchen? Whether employees are satisfied with the chief? Robbed chief. Who is the culprit? Read it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219933,"name":"ChengDu Mahjong","genres":[],"avg_score":0.0,"description":"This game is based on the rules of XueZhan mahjong of Chengdu, China, which been proposed by Chengdu local developer.\nAll the special rules of Xuezhang mahjong are supported, such as XueZhan (players who still not win can continue play the game until only left one player or haven't tiles), added glory to a gong, robbing a gong, must lack suit, self drawn award, etc.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219932,"name":"Brain Switch Out","genres":[],"avg_score":0.0,"description":"Brain switch out is the ideal memory trainer game for everybody who loves to play addictive brain challenging games. On the off chance that you appreciate playing memory match games then you will love this new free endless game!\nThe main objective of this addictive endless game is to watch the emplacement of some cubes and try to find them correctly after we hide them. But, keep in mind that you should remember the correct place of each cube as you can find them easily or you will lose. Remember also that there is no timer, so you can take as much time as you want to find the cubes and go to the following level.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219929,"name":"Invert pixels","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Invert pixels have a minimalistic pixel graphics because gameplay is most valueable.\nSome of the puzzles will have more difficulty but you can try as many times as you like!\nIf you like interesting block game try this one because it have all the charm of the puzzle game: simple, fun, attractive and suitable to everybody. Remember this is very simple and addictive gameplay.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219928,"name":"Go Zero","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Get ready for a fun, new challenge!\nSlide numbers to make zero and score!\nComplete 8 beautiful islands with unique challenges!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219927,"name":"Free the Fobbles! For Two","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219926,"name":"Flip Pigs","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Explosively fun, colorful pigs, this game tests your ability to ‘find’ and ‘match’ pigs in 2,3,4,5 in a row. Flip pigs in a fundamentally re-imagined match 3 game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219925,"name":"Firefly Sky","genres":[],"avg_score":0.0,"description":"To Catch the fireflies you tap your screen to throw the jar in the air. The longer you hold the tap the higher the jar will go. Tilt your device left or right to move the little girl. The jar will move with the girl even while in the air.\nYour aim is you catch the yellow fireflies on each level. Each new level will have more and more fireflies.\nBe careful of the red ones. They fly slower but they'll make you lose a heart. If you lose all your hearts the game is over. Now and then a very fast pink bug will appear. If you catch it you'll get a bonus life!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219924,"name":"Fallcone","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Simply just TAP and change the direction, but think ahead about acceleration.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219923,"name":"Escape Z Town","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Escape Z Town is a role-playing game with turn-based combat about escaping a zombie-infested city.\nThe player finds himself in the middle of a town filled with zombies, bandits and marauders. To survive in this dangerous place, you need to find weapons and supplies, fight against a huge variety of enemies, find loyal comrades, improve your skills and abilities and find a way to escape from 'Z Town'.\nThe game can be quite challenging for casual players.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219921,"name":"Earth School","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"How did the universe begin?How was life born on earth? Where did water on earth come from?Welcome to earth school, Earth School is an educational kids apps containing 18 different mini games. It will show the big bang to earth generation, from life beginning to dinosaur extinction, enjoy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219920,"name":"Dungeon RPG: Abyssal Dystopia","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Humankind is on the verge of extinction after being overrun by monsters.\nYour village was destroyed by monsters, and you lost all your friends. Aim for the abyss in the sage's labyrinth and unravel all the mysteries and your destiny.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219919,"name":"Da Vinci Cannon 2","genres":[],"avg_score":0.0,"description":"Capture the enemy's castle!\nDestroy everything around with the aid of an ingenious invention of the great scientist Da Vinci.\nHis gun is ready to bear the destruction!\nBut do not forget! There are prisoners who should free Au. And the treasures that will help you go to victory.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219918,"name":"Dice Wars","genres":[],"avg_score":0.0,"description":"Dice Wars is a unique new turn-based strategy game from Powerise Interactive. Using nothing but dice and a randomly generated territory map made of hexagons, the game is similar in gameplay to that of the board game, Risk, though much simpler and quicker to play. The objective is to conquer all territories and eliminate all your opponents by attacking them with dice.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219916,"name":"Lettermon","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Meet lettermon! the monster-catching... word game?\nyou're familiar with word shuffle games, where you rearrange letters to make as many words as you can. enter lettermon - you'll have 26 cool new friends, each representing a letter from a-z. your lettermon will be an extra letter you can bring in to any word shuffle level, so you can make even more words!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219915,"name":"Loose Nozzles","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Built by a veteran game developer around his young son’s artwork, Loose Nozzles is a slapstick arcade game of flight and rescue. Use simple, two-button controls to pilot your rickety rocket and save endangered colonists over 25 levels of increasing intricacy and menace.\nThe child-like look masks a grown-up challenge; each collision risks losing a piece of your rocket, turning a mission of precision flight into a chaotic struggle to survive. Master the controls and learn to fly “smooth” – fast, close, and free of injury – to make your way up the leaderboards.\nLoose Nozzles is free to play to completion, and a one-time purchase unlocks: unlimited lives, restarting from any level, rocket upgrades, skins that look and fly differently, and alternate play modes for even greater challenge.\nLoose Nozzles is a labor of love from Foster and Family Games. We hope you like it!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co689v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219914,"name":"Lost Frequency","genres":[],"avg_score":0.0,"description":"Using your deep space scanner, you inadvertently make contact with Captain Paul Renzo of The Orion Project. A space explorer of the Allied Space Exploration Cooperative, who is stranded on a foreign world and has lost his crew. His life is on the line and he needs your help! Why is he there? What happened? How will he escape the predicament he is in? Only you can help him navigate the dangers he faces on this foreign planet where he has crashed. You choose the adventure he will have. Play the game over and over picking new paths each time, you never know where Captain Renzo will end up.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219913,"name":"Pixel Shrine: Jinja","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Pixel Shrine Jinja is a sandbox simulation game about an ancient Japanese shrine.\nYou can create beautiful shrines in a world of pixel art.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219912,"name":"PrimeMate","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Meet Babu, the smartest Rhesus macaque alive.\nBabu decomposes numbers for a living.\nYeah, that’s right. Modern cryptography relies on monkeys to obscure your secrets.\nSurely you would have no problem filling in for Babu, right?\nOn the other hand, this game can get brutally hard.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219911,"name":"Our Ways","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Our Ways is an experience-based puzzle game about exploring relationship. Using two fingers, control the two color dots to move, approach and meet. Each level represents a relationship. Experience and overcome different situations like 'Obstacles', 'Uncontrollable', 'Lost', etc.\nEach individual like me or you is different, so as every relationship. In Our Ways, the result of each level depends on how far and how many steps the two color dots took. Just as our relationships, there is no perfect one, no right or wrong. It only depends how we see them. Play and get your own results!\nFind your way in Our Ways.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219910,"name":"Mystery Lighthouse 2 HD","genres":[],"avg_score":0.0,"description":"The sequel to the hugely popular 'Mystery Lighthouse'.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219909,"name":"My Monster Eats Furniture","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Embark upon an epic and emotional journey with CAT and Dylan about love, dealing with loss and grief. Exciting, hilarious, and fun, yet at times touching and poignant; Dylan learns that inevitably you need to deal with the pain of letting something go.\nCollect over 200 pieces of gear and dress up exactly how you want. Feeling like a cheerleader today? A punk rocker? Or maybe just running around town with your cell phone and favorite coffee wearing the D.A.R.E. t-shirt you got at school. It's all possible in My Monster Eats Furniture!\nBattle 90 Soul Pops (which can be earned as pets) and 10 powerful bosses across 10 locations in Samuton, the happiest town on earth.\nLevel up to unlock skills on the skill tree. There are 19 to choose from ranging from passive, active, and buffs.\nCreate and eat 11 different pieces of furniture to give CAT helpful boosts, take on requests on the job board and so much more!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219908,"name":"Miika","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Miika is a beautiful 3D puzzle game based on camera perspectives combined with the use of optical illusions. Miika challenges players with mind twisting puzzles mixed with a surrealistic four seasonal feel.\nEngage in the journey through the world of Miika encountering puzzles which feature illusions of perspective traveling, landing and existence.\nLet your imagination run free as you try to solve the perspective mysteries that appear in front of you. Think outside the box and enjoy the fun and charm of Miika. Enjoy the weird and colorful world of Miika where everything is possible, so don’t be afraid to take on Miika’s puzzle adventure!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219907,"name":"Runner: Preamble","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Preamble is a future-noir visual novel experience that tells the story of \"Vice,\" a former smuggler turned corporate cog on the colony world of N-351, and the events leading up to the opening moments of RUNNER. Featuring a fully voiced interactive narrative with a veteran cast, unlockable CGs, and an incredible vaporwave soundtrack composed by Fat Bard.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219906,"name":"Road Redemption Mobile","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Play the beginning for FREE. A one-time in-app purchase unlocks the full game.\nLead a motorcycle gang on an epic journey across the country in a brutal driving combat road rage adventure!\nRoad Redemption is an action racing game set in a post-apocalyptic world ruled by a ruthless dictator. Fans of Mad Max will feel at home here.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219905,"name":"Radar Commander","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Take control of the airspace with Radar Commander !\nManage your weapons and protect your radar site from waves of enemies.\nCompete on the global leaderboards with other commanders.\nImmerse yourself thanks to highly polished GUI and very detailed soundscape.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219904,"name":"PuzzleManiak","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"PuzzleManiak is a collection of 24 puzzle games: Sudoku, Pattern (Picross like), Bridges, Dominosa, Filling, Galaxies, Loopy, LightUp, Mines, Net, Rectangles, Slant, Tents, Unequal, Untangle, Blackbox, SameGame, Pegs, Mastermind, Map, Magnets, Singles, Range and Netslide.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219903,"name":"PrismaDrop","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Ever had an adrenaline rush while waiting in line? PrismaDROP is the fastest, most intense puzzle game for iPhone, iPad and iPod touch. In just 30 seconds you'll smash one hundred glittering blocks and earn thousands of points. Then you'll do it again. And again, and… it's night already?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219901,"name":"Soccer Physics Fight","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Soccer Physics Fight is a football game and is developed to play in single or 2 players mode.\nTwo teams are fighting for a ball and the one who scores a goal will be the winner. There are two buttons used to control the players of each team. Pressing it will make the players jump upwards and also kick the ball or team of the other side.\nEvery new round there will be given new balls to play, other characters and backgrounds.\nThis is game is developed to play with your friends, family and sometime also nice to make bets with you opponents!\nJust a very simple game for football lovers!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219900,"name":"Super Footbag - World Champion 8 Bit Sports","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Are you tubular? Do you love retro 8 bit NES classics? Do you have what it takes to be the 2014 footbag world champion? Then try the Super Footbag!\nThis radical game has the gnarliest footbag moves! Pull them off with great timing and a simple tap mechanic. Depending when you tap and where the ball is, you can pull off a fresh outside kick, an awesome head nod, or mondo inside kick. Keep the hacky sack in the air the longest to win!\nCompete with others worldwide to be the best at footbag! Leader boards and achievements available. You can do it!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219899,"name":"Survive: The Lost Lands","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Prepare to test your survival skills to survive on this mysterious island where you found yourself after crash. Craft items, collect resources, hunt and fight with animals and savages! New sandbox game: Survive: The Lost lands is waiting for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219898,"name":"Tappi Bear All in 1","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219897,"name":"The Nodus","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Get ready to press undo - a lot - as you try to find that tricky solution in over 30 puzzles. Guide coloured blocks to their goal through a series of mazes and see if you can find the treasure at the end. Crafted in crisp, colourful pixel art with relaxing music, The Nodus will fire your brain cells on a nostalgia trip. How many levels can you solve? Can you find the treasure? Jump into The Nodus and find out!​","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219896,"name":"Warship Solitaire","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Warship Solitaire is a fun logic puzzle game that's similar to Sudoku and Picross.\nYour objective is to locate the hidden enemy ships on the map, using the given hints and the number indicators within the map. Test your mind in over 125 challenging levels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219895,"name":"Vincents Dream","genres":[],"avg_score":0.0,"description":"Put Vincent to bed!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219894,"name":"TwoTime Portal","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Welcome to TwoTime Portal.\nWe evaluate your robot vacuum intelligence.\nIf you manage to dust off our insurmountable and unrealistic chambers, you may eventually be rewarded.\nWe issue certificates so that you can show off in your social networks.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219893,"name":"Tower of Hanoi Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Tower of Hanoi is a mathematical game or puzzle.\nIt consists of three rods, and a number of disks of different sizes which can slide onto any rod.\nThe puzzle starts with the disks in a neat stack in ascending order of size on one rod, the smallest at the top, thus making a conical shape.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219892,"name":"Korean BBQ Simulator","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A fun and wacky -* cough* I mean, totally realist physics-based grilling game based on Korean cuisine. Take control of the grill at a Korean BBQ restaurant and become the master of meats. Can you compete with others online and earn the ultimate title of Korean BBQ Master?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f54.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219891,"name":"Tile Tales","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Embark on a journey through the forest and solve numerical puzzles to unfold wondrous creatures.\nTile Tales is a unique puzzle game that combines playing with numbers with innovative gameplay. The player’s goal is to navigate through different tilesets and form a path that leads to the highest score. In these tilesets, the player will be faced with different modifiers and obstacles that form the unique and interesting aspect of the gameplay in Tile Tales.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219890,"name":"Tilt and Roll","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Stay calm and relax while you tilt your device and roll the ball as far as you can!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219889,"name":"Time Raiders","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Delve deep and explore the vast eastern undergrounds.\nTreasures? Monsters? Who knows what awaits you...\nGather a trustworthy team and battle against all types of undead creatures and ghosts. Discover buried treasures, use your unique sight to authenticate them, and battle against the undead.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219888,"name":"Konzerthaus Berlin VR","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Welcome to the Konzerthaus Berlin! In two different applications you can explore the house and experience the Konzerthausorchester Berlin. Soon you will also be able to discover new music in a completely new way in the interactive composition \"Umwelten - Environments\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f53.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219883,"name":"Zen","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Zen is an innovative puzzler with original gameplay that combines precision, reaction and inventiveness. Your goal is to guide the ball though a labyrinth towards the gates, avoiding collision with sparkling blocks. Move the ball using combination and sequence of waves, the number of which is limited for each level, so make sure to choose the shortest way. And cut corners.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219880,"name":"Keep Out: Black Protein","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Keep Out: Black Protein is a rogue-lite, hack and slash, TPS, action game that tells the past story of previous release, Keep Out. You can create your own new combination and clear method by repeating the game. Become your own toy and protect the world of toys from corrupted toys!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219878,"name":"Galaxy Bowling 3D Free","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219877,"name":"Champion Dragon Tournament: Z Warriors","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219876,"name":"PurrChess","genres":[],"avg_score":0.0,"description":"PurrChess is the first 3D mobile cat-themed chess with customized boards. These dangerously adorable felines are on a mission to capture kings and hearts. Command cats and try out different openings or defenses against opponents from all around the world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219875,"name":"Zeroverse","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219873,"name":"Death Race: Shooter Game","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219871,"name":"Kalt","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Explore and survive in the harsh weather conditions of northern lands.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4t.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219870,"name":"Marsaction: Infinite Ambition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219869,"name":"Kaboom","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Become a Kaboom Master destroying your enemies!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219867,"name":"Final Frontier: Space Idle RPG","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219866,"name":"Immortal Guns","genres":[],"avg_score":0.0,"description":"Immortal Guns is a multiplayer mobile FPS with a powerful sandbox level editor. Build, share and play your levels with friends. Create custom terrain and add from a selection of over 100 objects to make your own levels. Go further by tweaking engine settings like run speed and game modes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219865,"name":"Levistone Story","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219864,"name":"Imaginefield 2042","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Imaginefield 2042 display a battlefield with two kinds of vision, and use various weapons and tools to destroy all targets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219863,"name":"Escape Games: Bar","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219861,"name":"Gangster Crime, Mafia City","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219860,"name":"Legends of Chronos","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219859,"name":"IL-2 Sturmovik: Battle of Stalingrad - Spitfire Mk.XIV Collector Plane","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Spitfire Mk.XIV","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219858,"name":"Power Rangers Dino Charge","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ahs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219857,"name":"Squad Alpha: Action Shooting","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219856,"name":"Soccer Manager 2023: Football","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Soccer Manager 2023 is the latest iteration of the in-depth football manager simulation game. Built on 16 years of development experience and over 50 million downloads, Soccer Manager 2023 introduces a worldwide Bundesliga licence, the brand-new career mode Create-a-Club and dynamic live transfers along with improvements in the 3D matchday engine. If you are passionate about the game, it is the ultimate football manager game for you!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7xpn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219855,"name":"IL-2 Sturmovik: Battle of Stalingrad - Battle of Normandy","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"IL-2 Sturmovik: Battle of Normandy brings the air war surrounding the successful Allied invasion on France in June 1944 to life on computer screen!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219853,"name":"Lazy Jump","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219852,"name":"IL-2 Sturmovik: Battle of Stalingrad - Arado Ar 234 B-2 Collector Plane","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Arado Ar 234 B-2 Jet Bomber","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219851,"name":"Wind Runner: Puzzle Match","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219848,"name":"I Feel Fine","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The meteorite will hit your space station in 3 days, and you’re bolted to the floor. Can you convince someone to free you? Meet, persuade, and escape certain doom with a large cast of characters in this bittersweet and hilarious adventure game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219846,"name":"Outfire","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219845,"name":"BattleStrike Gun","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219844,"name":"Square Sort","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219843,"name":"Hunting Labyrinth","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Shelared found that she had been cursed by a powerful monster in the labyrinth. There is no other way to remove the curse than to conquer the labyrinth. Shelared, who was sent to the church, began to conquer the labyrinth in order to remove the curse.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9eq1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219842,"name":"Monster Quest: Seven Sins","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219840,"name":"Embers: Last Duel","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219838,"name":"Block Cat Puzzle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219836,"name":"Hover Muscle","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Hover Muscle is a modern take on old school arcade racing games featuring V8 Powered \"Hover\" Muscle Cars, tons of customization, competitive leaderboards and a high energy Rock OST.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67sp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219835,"name":"Dirty Revolver","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219834,"name":"Heroes Raid","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Enter a dark dystopian world that combines demons, guns, swords, magic, monsters and modern technology. Raid alone or with your friends, craft your unique playstyle by mixing and matching abilities between heroes. Raids, Builds, Team PvP, and Solo PvP await.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yvn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219833,"name":"Naui Yeou Yukseong Ilji","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219832,"name":"Hentai Aim Practice","genres":[],"avg_score":0.0,"description":"Practice your aiming skills with the help of sexy hentai girls!!!!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4d.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219830,"name":"Dragonscapes Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219829,"name":"Switchcraft: Magical Match 3","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219828,"name":"Wood Block 99","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219827,"name":"Hello, Fucking World!","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is the story of Libre, who in the numbness of life came across a poem that has been marked into his heart for a long time, and meets his senior, Hershey. The story of two people who, as they gradually feel empty in their lives, find their own touching stories as a result of this reunion","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f4c.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219824,"name":"Heartless","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A casual 2d Cave Escape game","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f49.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219823,"name":"Elysium Lost","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219822,"name":"Proton Bus Simulator Road","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mkb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219821,"name":"Charlie's Delivery","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The game includes love, peace, environment, science, dreams, friendship, ambition, passion and NO SAVE. TRY IT NOW!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f47.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219819,"name":"Bread Barbershop Differences","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219818,"name":"Mushroom Card RPG","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"An RPG/visual novel engine. Visualized no-code editing.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f46.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219815,"name":"Alice Order","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219814,"name":"Havenview","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Havenview is a rogue-lite looter shooter based in the nineties. Battle your way from Suburbia to the depths of the alien mothership as you search for upgrades to your lazer to help you banish the invaders of Havenview. Coming soon!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f44.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219812,"name":"Relic Heroes","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219811,"name":"Skyfall Chasers","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219810,"name":"Hard Life","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This game is a survival game. Even though there are zombies in the game, the biggest challenge is the cold-temperature balance. The SandBox mod of the game is under construction. Apart from that, there are 3 different sections. The goal is to reach the farthest corner of the map.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f42.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219809,"name":"Hard-Life","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Did you ever think Half-Life was way too easy? Hard-Life corrects that issue.\n\nHard-Life is a mod that aims to change how you play Half-Life. The game was difficult back in 1998 but we've all nearly memorized enemy patterns and locations. Rather than raising enemy health and damage in an artificial manner, we decided to overhaul how the the AI works. Enemies are more evasive, they move quicker, react faster, and are more deadly with their aim.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f41.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219808,"name":"Grand City Car Driving","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219807,"name":"Graviteam Tactics: Mius Front - Bird Grove","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In September of 1942 38A was assigned the mission to draw enemy reserves from the Voronezh to the assisting the offensive of the Voronezh Front to capture the city. The main effort directed towards Olkhovatka, was the sector where the German 377ID held carefully prepared defensive positions...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219804,"name":"Grapple Gal","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A linear 3D platform where you race through a destroyed future. Play as Bullet, an augmented human with incredible abilities and speed. Navigate environments using your grappling arm, using the momentum you've built to fly through stages at amazing distances.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3w.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219799,"name":"Go Go! Flambeau!","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Go Go! Flambeau! is a physics-based 3D action platformer rogue-light, about escaping a mysterious well outside of time and space. Run, jump, and dodge through procedurally generated crypts. Solve quirky action-based puzzle rooms. Fight using unique physics-based \"Battle Tennis\" mechanics. Go! Go!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3t.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219797,"name":"Gnomonic","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Gnomonic - The watercolored RPG that knows you're playing! After a displaced wanderer notices your influence, help your new friend leave the mysterious world of The Shade.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8tg0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219795,"name":"Girbal","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Girbal\" is a single player sci-fi Puzzle platformer in which the player solves various puzzles including matching sequences, object size manipulation, and much more using number of tools such as a grappling hook, jet-pack, gravity well generator, and more to overcome these obstacles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219794,"name":"Forbidden World","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Penetrate deeper into the Forbidden World. Fulfill your fantasies in your own private dungeon. From the creators of SinVR, Forbidden World is the destination for provocative and amusing adult entertainment, for your PC or in VR.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219793,"name":"Order of Battle: World War II - Order of Battle: Allies Victorious","genres":[{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219791,"name":"Fluffy Smash","genres":[],"avg_score":0.0,"description":"Smash your cat opponents with epic CATastrophic destruction in Multiplayer Madness.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219787,"name":"Divine W: Perfect Wonderland","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219786,"name":"Fists of Stone","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play these activity-based obstacle courses and compete against yourself or others in multiplayer mode. Also a fun way to improve your overall fitness.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3h.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219784,"name":"Magic & Sanctuary","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219783,"name":"Fight Until Death","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Are you ready to Fight Until Death?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3f.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219781,"name":"Banui Moheom: Idle RPG","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219780,"name":"Gamedec: Definitive Edition - Free Characters Bundle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3e.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219775,"name":"Camping Cat Family","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219774,"name":"Fallen Feather","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A turn-based RPG that encourages diversity. A young man begins his crusade for social change in this opening act of a multi-part series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f38.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219773,"name":"Fairy Tag: A Game of Divinities","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Beware the Cat Sith ! In this party game for four, Fairy folk must run away from the Cat Sith chasing them. Those mischievous creatures can’t stop themselves from playing with it.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f37.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219772,"name":"Zen Lines","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219771,"name":"New Gangster Crime","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219770,"name":"Tank Duel 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f35.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219769,"name":"Ocean Bubble Shooter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f34.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219767,"name":"Fabric of Reality","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In this game, you are the bullet hell. Face off against 100 waves of enemies and bosses by collecting a deck of attack cards that activate in real-time to unleash destruction upon everything in sight. There's an insane amount of customizability leading to an infinitely replayable experience.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62at.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219766,"name":"Alox Poker","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f31.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219765,"name":"Dungeon of Final Glory","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Roguelite turn-based RPG game with pencil drawn graphics. Fight the big waves of Lovecraftian monsters and experience a journey of unholy hero through the horrors of underworld.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f30.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219762,"name":"Droid Death VR","genres":[],"avg_score":0.0,"description":"Droid Death VR is a Multiplayer Shooter in Virtual Reality set in a sci fi universe where maps are designed around specific planets to have fun shooting your friends and other players.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2y.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219761,"name":"Sonolus","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sonolus is a next-generation mobile rhythm game that aims to provide maximum freedom to players and level makers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":219760,"name":"Tm Driver","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219759,"name":"Drift racing car","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This is a racing game that can drift flexibly. You can make your own game vehicles, vehicle hubs and friction smoke. Multi vehicle viewing angle, arbitrary switching","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2w.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219758,"name":"Dragonfield","genres":[],"avg_score":0.0,"description":"Fight in epic medieval fantasy sandbox battles! Use swords, shields, bows, magic spells, ballistas, catapults and more. Ride armored horses and fly giant dragons. Or just watch armies of bots battle it out with ragdoll physics and destructible environments!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219754,"name":"Doomsday","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Amid the desolate remains of a once-thriving city, only the rumbling of robots breaks the cold winter silence. Chita and Yuri, are the last survivors in the war-torn city. Scavenging old military sites for food and parts, the two girls explore the wastelands to pass the time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219753,"name":"Might & Magic Heroes VII: Ultimate Edition","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Enhance your Might & Magic Heroes VII experience with the Ultimate Edition.\nThis edition includes:\n- The main game,\n- An exclusive hero\n- A scenario map\n- The Lost Tales of Axeoth extensions and the Trial By Fire add-on!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219752,"name":"Doomsday Contact","genres":[],"avg_score":0.0,"description":"Doomsday Contact is a FPS tactical shooter game which allows you to be deployed in a operation as a special forces and fight the monsters and complete the objective for extraction. You must do what it takes to complete the mission and save the world!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219751,"name":"Don't Get Eaten!","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Test your survival skills in this third person shooter. Defend your base against a never ending zombie horde. Try different tactics and see how many nights you can survive in \"Endurance Mode\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219750,"name":"Disembowel","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Disembowel is a cooperative horror game for 1-4 players. You are a reporter who travels around the world documenting the darkest secrets and mysteries that inhabit the planet. Prepare your camera, gather a team and start suffering.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2m.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219746,"name":"Crazy Click Thursday","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Crazy use your fingers to have all kinds of crazy interactions with beautiful girls~","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219745,"name":"Court Sort VR","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Court Sort VR is a small arcade-style VR game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2h.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219743,"name":"Command: Modern Operations - Falklands","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Command Falklands contains fifteen scenarios and two bonus missions that put you in charge of the most significant units during the war between Argentina and the United Kingdom over the Falkland Islands off the coast of South America.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219742,"name":"Colectricity","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Unique take on co-op games genre where players set out on a fascinating journey through the world of a computer using an asymmetrical core gameplay mechanic about managing energy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f2e.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219735,"name":"Cannon Shoot Plane","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A Light 2D Shooter Game. Planes will come from both sides. Don't let them escape. 25 levels in total.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f27.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219734,"name":"Camouflet","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Camouflet is a short first-person action-horror game During WW1, You are placed in a fighting tunnel under the front lines. With just a shovel, you must recover lost weaponry, reopen passages and place explosives at your objectives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f26.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219732,"name":"Bullet Priest","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Control your enemy's bullets in this fiendish reverse bullet hell.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f25.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219730,"name":"B-Side","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Flip the world to survive & piece together what remains in this narratively driven 2-D puzzle game about friendship, identity, and growth.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f23.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219728,"name":"Bottle","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Bottle is a 2D pixel-based platformer, that may or may not have rage-like elements (depends on how good you get at it).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f20.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219727,"name":"Bowling","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Grab your best bowling shoes and get ready to play this fun and easy to play bowling game anytime.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1z.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219726,"name":"BoozeBall","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Booze ball is a casual sports game. Test your aim and reactions against an increasingly difficult computer player to see how many levels you can beat!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1y.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219725,"name":"Bonded Forever","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Bonded Forever is a co-op game that combines horror and puzzle elements. In this game, you and your friend try to go back to the place where you live in your childhood and solve the mysteries that happened while you were away and try to overcome the problems you will face by working together.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219723,"name":"Beyond the Pines","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Beyond the Pines is a first-person, story-driven, psychological horror game, inspired by the partnership between Owner and Dog, and the impact when that relationship is threatened, set in a remote cabin, with influences from Welsh folklore and beyond.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co71qk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219721,"name":"Swords of Legends Online: Deluxe Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Swords of Legends Online: Deluxe Edition includes exclusive extras! Deck out your mystical hero all in gold. You’ll radiate grace and command respect in the additional costume and luxurious weapon skin.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219720,"name":"Swords of Legends Online: Collector's Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Deck out your mystical hero all in gold with the additional costume and opulent weapon skin. Or slip into an all-black ensemble and take to the shadows. You also get some fantastic wings, plus a set for expanding your residence with an enchanting garden.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1t.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219716,"name":"Auto Immune","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A virus is attacking your cells, and its up to you to defend them! Buy and combine cells to assemble your immune response. Discover powerful synergies to overcome a constantly evolving enemy in this physics-based auto battler. Outlast your opponents or work together to achieve immunity.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219714,"name":"Astral Tournament: A prequel of the Astral Masters","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This DLC contains a special collection build of Astral Tournament game dedicated to it's 20th anniversary (first published on SEP-23-2002). This is the first game of the Astral games series and the direct ancestor of Spectromancer game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219711,"name":"Anxiety.exe","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Relaxing, cute and informative game about anxiety disorders and mental health in general.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219710,"name":"Annihilation","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Annihilation is Character Based 60 Players Battle Royale and 5v5 online shooter game.You have to focus on surviving and understand your operator's skills to be the Last Man Standing.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219709,"name":"Ankh Tower: Protect the Fortress with Dark Magic","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Ankh Tower is a dark-fantasy rogue-like strategy. In the depths of darkness, the Ankh remains the only bastion of life. Build your tower wisely using the offensive, defensive and magical capabilities of its floors. Develop your arsenal of spells to defeat evil forces. Protect the Ankh and survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219707,"name":"A Friend Called Loneliness","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A Friend Called Loneliness is a third-person exploration game based on the song from The Beatles, Eleanor Rigby. Uncover the truth of our main character Norra, as she will leave you clues through her poems that she has written.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76uj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219702,"name":"Adventure of Elysia","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Experience a new adventure on the mysterious island of Elysia! Follow the hints, explore the world, solve dungeons and unravel the mystery of the island. Will you be able to uncover the truth?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1c.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219701,"name":"Adanath","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Adanath is a 2.5D side scrolling single player, action and exploration oriented, story based adventure game with a fluid & innovative PvE combat system.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f1b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219700,"name":"Actala: The Hero's Shadow","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The fairy tale is over. The Hero won. But the story is just beginning. Explore the web of intrigue in this emotional, suspenseful visual novel, depicted with hundreds of unique, animated illustrations. Who is the hero, and who is the villain? Who lives, and who dies? Your choices will decide.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7gii.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219698,"name":"Absorb","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Absorb is a reverse horror game in which you navigate through a series of sci-fi environments devouring all the astronauts, soldiers, and cyberpunk heroes you come across.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f18.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219693,"name":"AntiShatter","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Pilot your own Spaceship in this Sci-fi Space Shooter game! Shoot Asteroids to collect Antimatter, Metals, and Pickups! Use the Metals and Antimatter you collect to upgrade your Spaceship! Level up to unlock stronger Metal tiers to collect, craft or buy Parts from the Store! Survive endless Space!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f0o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219692,"name":"Huntscape","genres":[],"avg_score":0.0,"description":"Huntscape is a multiplayer (4vs4) PvP survival game where 4 players play as Hunters and 4 play as Prey. Hunters must hunt down Prey, while they try to sneak around, survive and escape","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f0q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219691,"name":"Slave of Lust","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Slave Of Lust is a visual novel exclusively for adults! This story tells the story of two university students who came to help a teacher. But they are locked in the same room. At this point, instincts kick in and the students get closer...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f0p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219687,"name":"Square Rounds","genres":[],"avg_score":0.0,"description":"Square Round's is a Shooter Survival Round based game. Can you survive all 350 rounds? If you can, you shall be compared to a Legend. Game difficulty increases. Saves your High score and High Round to try to beat your own records. There is a Armor and Health system.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f0l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219680,"name":"Africa Empire 2027","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Lead your African empire in an empire building turn based strategy war game. Are you ready to lead, Supreme Commander?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f0b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219673,"name":"Dangerous Fists","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"This is dangerous fists, the real experience of fighting in VR, the video game when you can fight to the end, there is no rules, no limited time to beat your opponent, fight to win!.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f06.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219668,"name":"Melting Point","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Melting Point is an action puzzle game for all ages. How to Play: Run your Fire Sprite through the many puzzle levels and clear out as much Ice as you can, while keeping an eye on your health, for each Ice Block will cost you one unit of health, while Blue Ice will cost you two.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f01.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219663,"name":"KFZ","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"KFZ is a Zombie wave based shooter featuring 9 levels and plenty of Gore","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219662,"name":"Godland: The Fire Quest 2","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This visual novel puts you in the place of Ruban Gusandar fighting for the freedom of his people, lead your people against an overpowering empire and select the best possible choices...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219661,"name":"Ryewood Town","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Ryewood Town is a relaxing, RPG-Style farming adventure. Grow your land, tame wild animals, fight monsters, craft new items, and personalize your home!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219659,"name":"Albert's Journey","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Albert’s Journey is a 2d platformer adventure game with a pixel art look.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219658,"name":"Ayyylando","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Ayyylando is a chill strategy game where you build happy little cities in the sky. Explore a variety of colorful islands, care for your buildings' happiness, evolve your buildings to help you grow, and when solid ground is no longer cool enough for you - expand onto the cliff sides.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219656,"name":"My House is Haunted","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A Multiplayer Strategy Horror game which you can play as a Ghost or Exorcists. Play as a ghost and you can use abilities such as Clone, Possess, Summon clone, fly around, Move through walls, Locate players, etc. Play as Exorcists and protect the family who commission you.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ezh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219653,"name":"Tireless Pig","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A simple and fun game about a pig. The adventure of a pig for every member of the family. Funny game for leisure. Help the pig to go through all the obstacles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ez9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219652,"name":"Evil Nightmares","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Bell is ringing and there is no escape. The world is quickly shrouded in darkness and horrifying creatures lurk for Marv. He must face his fears and find a way out of this nightmare or he will be trapped in hellfire forever.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ez8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219650,"name":"Dark Moon Motel","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Dark Moon Motel is a horror comedy game set in a run-down motel in the middle of nowhere, where the guest are a little bit monstrous. Gather clues, solve puzzles, avoid monsters, take out the trash, and try not to die while doing it.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ez5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219646,"name":"Ragdoll Slayer","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Welcome back to the Medieval Era! Here only the strongest survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ez0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219644,"name":"Rubber Brawl","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Roll into a crazy 32-player Brawler Royale of pumped-up tires to be the last one standing. Overcome the laws of physics, perform aerial tricks and knock down tires to survive against the other players! Be a Rubber Brawl legend!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eyz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219639,"name":"To Eternity","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Play as a hero who wants to seek eternity, face unknown monsters, do tense and exciting slashing, gain the ability to purchase attributes of gold, and defeat the final Boss, forward to eternity in your mind!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eyt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219633,"name":"Motel Life Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This is your chance to be the owner of Motel. Build, Renovate and expand your Motel empire. Clean the rooms and look after the needs of your guests like Food, Entertainment and Comfort. Create a ultimate Road side stop for everything a traveler needs.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eyb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219632,"name":"Motherless: Season 2 - Chapter 15","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sunny's life couldn't be going better, but there's trouble on the horizon...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219631,"name":"Motherless: Season 2 - Chapter 14","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"After getting into an interesting situation with Anastasiya, Sunny will have to find a way to bring her back to her senses.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219630,"name":"Motherless: Season 2 - Chapter 13","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sunny is getting ready to fly back to the U.S. when Florencia shows up wanting to go with him, leaving him no choice.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219629,"name":"Motherless: Season 2 - Chapter 12","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The story picks up right after the plane takes off to Italy, where a tired Sunny heads to the bedroom... just to be surprised by an unexpected guest!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219628,"name":"Morbid","genres":[],"avg_score":0.0,"description":"Morbid is an atmospheric psychological horror game; experienced as Senior Detective J. Taylor, unfold haunting and morbid events that will question your sanity.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eya.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219625,"name":"Nukepath","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Nukepath is a post-apocaliptic action roguelike, where a survivor must get out of town before a nuclear bomb explodes everything.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ey3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219623,"name":"SCP: Facility Manager","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Build and manage an SCP Foundation site!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219618,"name":"Sentient Noir","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A dark, dystopian alien City. Four factions want the incredible powers of a Detective Hunter for their own ends. With these powers, you're able destroy the sentimant populous. You are feared but by maybe that can change as you discover the secrets of the sentient city.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219617,"name":"Seasick","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Assume the role of marine life in this casual turn-based strategy game and overcome the ultimate danger, pollution and climate change. Will you evolve and adapt to the new harsh conditions or will your ecosystem wither and become extinct?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gpt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":219616,"name":"Sea Scenes","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sea Scenes is a boat and ship driving game. There are no gameplay objectives or missions, just WASD-based boat driving in 3 different levels and 7 different ships.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219612,"name":"Sawdust","genres":[],"avg_score":0.0,"description":"Sand saw and nail your way through this chaotic couch co-op game for one to four players. Gather your finely-grained team of carpenters and carve out your oak-shaped fortune. Make sure you keep up your production line to keep every customer satisfied.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219609,"name":"Ships Simulator 2024","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Play as the captain and take the controls of one of the many available ships. Perform various tasks, plan the route yourself and admire the views as you navigate between the largest European ports!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219608,"name":"Shuffled Words","genres":[],"avg_score":0.0,"description":"Shuffled Words is a casual word guessing game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219607,"name":"Siana Tales","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In this mysterious \"Shana continent\", there is a tree of life that can transform objects into human-like creatures, called \"object spirits\". The world is currently under attack by demons from the abyss, and you, as a warrior, are needed to save life. And you will exploring your true identity.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7icw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219603,"name":"Shadow Jump","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Shadow Jump is a challenging fantasy platformer game focused around difficulty and freedom of movement. There are no set routes or strategies; players will be able to carve their own route to the top. Success will require determination, precision and a lot of patience...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5exc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219596,"name":"Sokosignal","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sokosignal is a puzzle game in which you send a signal with each move you make.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ex3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219595,"name":"Solar Expanse","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Explore the Solar System. Mine and drop asteroids. Colonize and terraform. Lead the space race and compete with other corporations on your way to profit. Watch the expansion of human race over the centuries. Then go beyond and conquer the galaxy!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7rnj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219589,"name":"Sonder: Lights of Little Tokyo","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sonder : Lights of Little Tokyo is a short and casual 2D adventure game with beautiful hand-drawn pixel art. Explore Little Tokyo, meet bizarre characters, complete quirky quests.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219587,"name":"Space Adventure: Escape from Siphilus 1b","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Space Adventure - Escape form Siphilus 1b is a point & click adventure with challenging puzzles, funny dialogues and beautiful graphics. It's a rather quiet, chilled game accompanied by a harmonious electronic sound.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219586,"name":"Sorted!","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Sorting trash has never been so much fun! Be the change you want to see in the world - sort, fight against time, practice your skills and find valuables!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69lr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219585,"name":"Sumiii","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sumiii is a punishing challenge in which everything kills you. Evade to advance.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219582,"name":"Super Bloo Kid Adventure","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Super Bloo Kid Adventure is a classic fast paced 2D retro-style platformer experience with lovely designed pixel-graphics and a full chiptune soundtrack. Master brutal bossfights and discover lots of secrets in the world of Super Bloo Kid Adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219578,"name":"Super Jigsaw Puzzle: Generations - Food","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Puzzles of Food!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219574,"name":"Supreme Ruler 2030","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Supreme Ruler 2030 is an updated and remastered addition to the Supreme Ruler game series, one of the most comprehensive Real Time Geo-Political Strategy Games for PC.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219573,"name":"Surfwords","genres":[],"avg_score":0.0,"description":"Surfwords is a fast-paced word building game. Letters drop from the top of the screen in two columns. You have to choose which column to take at each row, in order to build up a series of words. Bet you can't last 30 seconds!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219572,"name":"Survive the Forest","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You need to Survive the forest from infected. You need to get resources and survive from infected and you need to build up and you need to find out what happened to you. They are infected with F virus and you need to try to find a vaccine for them if you don't humanity will be lost.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219571,"name":"Survive the Troll","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Survive the Troll is a \"Chill\" Real Time Strategy game in which you play as a Troll, a charismatic Hero you can upgrade in your base, or as an Elf, a builder which is common food for the Troll. Cooperate or destroy. You choose.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ewd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219570,"name":"Task Force Admiral: Vol.1 - American Carrier Battles","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Experience the thrill of leading American aircraft carriers to victory in this innovative full 3D command simulation wargame set in the Pacific in 1942. First-person or God’s eye, you lead your fleet and planes right from the center of the battle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9f8s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219569,"name":"Tarzan VR: #3 The Dead of the Night","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"As night draws in, the jungle swamp poses all manner of hidden dangers. Jane is in mortal peril, and only the strange fruit found in the heart of the Valley of Forever can save the life of Tarzan’s true love. Features \"The Strong Bow\" and its flaming arrows of vengeance.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219568,"name":"Tech Invaders TD","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Have you ever wanted to eliminate ALL the stupid hackers on the internet? And then create your own Anti-Hacker company? So buy and play Tech Invaders!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219567,"name":"Technikiller","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Technikiller is a sci-fi shooter set inside a mega-factory. Hack in and take control of a hulking mech to blast your way through hordes of killer robots. Fight your way to the core and shut it down.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219566,"name":"The 22nd is Serda. F0a178","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Age of spiritual inequality concentrated in one yard. Because today the environment around us is diversified with guests and mirror reflections, a walk can be helpful. 9490.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219564,"name":"Tale of Two Sardines","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Guide Miko through her daily life in alternate-universe Japan! Help her do her homework, clean up the dishes, re-arrange time and space, and more! And quickly, because the world may or may not be coming to an end!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ig2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219563,"name":"Tabula Sono","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Tabula Sono is a free-to-play 3D virtual tabletop. Play any grid-based RPGs like DnD, Pathfinder, Lancer, and Monster of the Week with your friends online. Sono is inspired by that in-person tabletop experience — sitting around the table with friends, whiteboard markers, and miniatures.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5s45.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219562,"name":"System Restore","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Play as an Elite Agent of SRF the System Restore Force, with the sole purpose of purging the Virus and it's corruption, climb through the different layers of the Source code and uncover it's mysteries, defeat bosses, and find the Master of the infection, allowing you to RESTORE THE SYSTEM!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219561,"name":"Swimming Pool Cleaner","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Swimming Pool Cleaner is a once-in-a-lifetime opportunity to become a one-person pool cleaning team. Take on rewarding tasks of cleaning pools and modifying them. Make them come to life and earn money while doing it!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219559,"name":"Swarmed: Nuts & Bolts","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In deep space, your robot transport vehicle crash-landed on a barren asteroid. The robots have escaped and are hungry for both revenge and crunchy humans. You are their only hope. Battle your way through multiple waves of rouge robots to avoid being SWARMED in this retro, heart pounding game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ew0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219557,"name":"Suspicious Shuffle","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Mario Party meets Geometry Wars in this minigame adventure for 1-6 players! Combine speed, memory, brains and finesse to help the Dealer restore balance to the Suspicious universe.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219556,"name":"Swap","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Swap is a top-down shooter with unique gameplay mechanics, slow-motion and jump & run elements. Select between three energies to damage your enemies, be healed by them or to send them to hell with your RageFire. Use various weapons, abbilities, physics and slow-motion to fight in style.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219555,"name":"The Escape","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Help Johnny Jones Junior in this platformed and puzzle adventure to discover a surprising ending.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219554,"name":"The Electric Odyssey","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"We are all familiar with the apocalypse. The end of the world, beginning of a new age. It isn't over for everyone though, some resist. There is a way out, but it won't be easy. Androids were predictable, but it still seemed too sudden. Could someone else be pulling the strings?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219552,"name":"The Darkest Emptiness","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A short novel dealing with the problems of loss of taste for life, existential emptiness and the crisis of psychological assistance in Russia. Will you be able to get out of the rut of destructive thoughts?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219551,"name":"The Crypt of Treasure","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Crypt of Treasure is an endless, procedurally generated dungeon crawler focused on fast-paced and intense combat, loads of content and unique weapons to match your playstyle, replay value, and making difficult judgments about which door to enter is least likely to result in your death...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219550,"name":"The Chronicles of Overlord","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Chronicles of Overlord is the ultimate turn-based strategy experience. In a race of the Undead, the main player fights against the human world to subjugate people and form an army strong enough to defeat the world destroyer Gruymed. Prepare for 40+ missions in compound mode.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219549,"name":"The Boundary Condition","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A 3D/2D/1D puzzle-platformer. Discover how your interactions with the world change when you exist in less than 3 dimensions. Explore computer-hardware-themed environments and experience a personal story about working alone on a complex project.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219548,"name":"The Blood Amulet","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A turn based RPG, with randomized loot, tactical game play and loot sorting. Stylized Visual Arts unlike any other game. Epic Boss fights. Home made music/art. Story Mode, text based game. ---Set out to defeat the Goblin Tribes and destroy The Blood Amulet. By any means.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219547,"name":"The Beauty Cult's: Nectarmancer","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Nectarmancer tells the story of Aisa, the conscripted Nectarmancer for The Throne in this visually stunning action platformer and \"gardenvania\" by The Beauty Cult.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7df4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219543,"name":"Touhou Kimono Blast","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Touhou Kimono Blast is a danmaku strip 'em up shooting game, full of Touhou famous characters. A huge mystery light shooting form the dark forest. Can the girls going to defeat the monsters and solve the mystery?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219542,"name":"Touch Love","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Which correct route can touch the hearts of beautiful girls?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219540,"name":"Train Valley 2: Workshop Gems - Ruby","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Train Valley 2: Ruby includes 50 new levels with a smart combination of different mechanics and train ages. Try to beat all the brain-teasing missions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5sen.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219538,"name":"Trainz Railroad Simulator 2022: Industrial Mayhem","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A fictional route built in the rust belt of the United States. This map has hundreds of baseboards, miles of track, and thousands of assets with many industries that need products delivered and shipped, and passengers needing transport. Challenge yourself with the 7 sessions included in this DLC.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219537,"name":"Trainz Plus: Industrial Mayhem","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A fictional route built in the rust belt of the United States. This map has hundreds of baseboards, miles of track, and thousands of assets with many industries that need products delivered and shipped, and passengers needing transport. Challenge yourself with the 7 sessions included in this DLC.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219534,"name":"To the Top","genres":[],"avg_score":0.0,"description":"Accompany Maya and her little companion on an adventure where the only thing that matters is reaching the top.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5evb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219532,"name":"Uncounted Isles","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Travel the Islands of the Uncounted Isle Archipelago to fight and loot. Learn new skills and customize your character for the fights ahead. Trade Equipment you found, but don't forget to store some items in your safehouse, you may need them later...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eva.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219531,"name":"Umbra","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Being hopeless is the feeling you will encounter when you see the dreadful horrors that you will have to face in Umbra, an abyss where the worst horrors that a human can imagine reside, do you dare to face them?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ev8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219530,"name":"Ultimate Waifu Battle Online","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"UWBO is a Tower Defense game about some cute waifus that try to prevent the invading monsters from absorbing the energy from the Energy-Crystals. Play it in coop mode with your friends to help each other and of course the cute helpless girls.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ev7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219528,"name":"Typo","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In this VR narrative game, you must fight your way to escape Athena's testing facility. After she enslaved the planet, you now find yourself doomed to repeat the same arbitrary tests, however, you may be able to escape... Do you have what it takes?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ev4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219527,"name":"Trophy Knight","genres":[],"avg_score":0.0,"description":"Battle hordes of enemies and bosses in this level based action platformer. Find new weapons and level up your hero along the way. Explore deep dungeons to retrieve epic treasures for your trophy room!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7imo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219524,"name":"V3: Kommando","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"V3/KOMMANDO is a competitive multiplayer military FPS where players can choose their respective country's very own commando unit and play against other players online.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ev0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219523,"name":"Vagrus: The Riven Realms - Seekers of Knowledge","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In Vagrus’s second free DLC, delve into the harrowing halls of the Sunken Tower – a place spoken of only in the most knowledgeable of circles as a deathtrap harboring untold horrors and forbidden secrets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f3d.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219520,"name":"Vehicular Rampage","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Strap in, start your engine, and get ready to start your rampage! Tear through multiple interesting locations that are packed with fun easter eggs, all while tearing through hoards of terrified pedestrians. Revel in a retro visual style and feel while enjoying modern driving physics and controls!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5euy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219519,"name":"Vestige Memoria","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Vestige Memoria is an episodic horror game, in which we take paranormal stories, and turn them into horror experiences. In these thrilling horror experiences, take control of the survivors of these memories, living through these experiences as described by the person.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eux.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219518,"name":"Violet's Party Mania","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Violet is hosting a party and is still missing some items! Help her search through the clutter to save the day!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5euv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219517,"name":"Virago: Trepidation","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Virago Trepidation is about a girl called Willow who after her stalker is released from prison, begins to manipulate her with threat and causes her to lose sight of what is real and fake","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5euw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219516,"name":"Village Defender","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"【Village Defender】is a simple and easy-to-use city defense survival game that combines elements of war, levels, equipment, cards, etc. In addition to the combat targets on each battlefield, you can also challenge yourself to fight against how many waves.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5euu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219512,"name":"4th Dawn","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A game about choice with multiple endings, set in a cyberpunk dystopia constantly running out of time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eus.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219497,"name":"Songs for a Hero 2: March of Malachi","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Songs for a Hero 2: March of Malachi is an upcoming sequel to the 2D musical platform game, with a brand new story about a world that lives in the shadow of the memory of a once prosperous king, that has been mysteriously dethroned by a ruthless tyrant who rules through fear and brute force. But when the world needs saving most, legends from the past bring forth a new Hero. Experience a new chapter of this saga with a brand-new hero and his many allies, each one of them with their own singing voice. Unravel the mysteries behind the new Hero, help him develop his skills, fight iconic bosses and face Malachi's terrifying army!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ety.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219493,"name":"Halt","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"HALT is a story-driven run-&-gun platformer that combines classic RPG-style gameplay with intense arcade action-platforming.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eto.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219489,"name":"Kalyskah: Jungle Trouble!","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"In this short story, the vampire Kalyskah and her friend Merishya, a succubus, explore a jungle searching for a portal that could take the demoness back home. Things were going well until funny things started to happen.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219479,"name":"Brick Breaker: Ball Shooter","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Welcome to the classic brick breaker game! Shoot and break bricks and become the ball master! Keep up with the bouncing ball and deflect it with your paddle in this classic breakout game! Join the brick world and enjoy all the different challenges and puzzles that await you!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fd4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219478,"name":"Memory: The Original Matching Game from Ravensburger","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Everyone knows it, everybody loves it: hardly any other game manages to bring young and old together more than this.\nPick up two cards: if they match, you keep them and can uncover two more cards. If they’re different, they stay in play and it’s the next player’s turn. The player with the most pairs of cards at the end is the winner!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co64vn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219471,"name":"Demolish Derby: Nitro-Battle","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Are you looking for a game where you can have fun destroying your vehicle? Speed up and go crazy in the newest driving game with realistic physics!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219468,"name":"Eagle Simulator","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Soar through the skies and live your life as a majestic eagle! Your mission is to be as fast, determined and wise as an eagle, but you have to be careful because any little mistake will cost you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219464,"name":"Kayko & Kokosh Coloring Book","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219463,"name":"Frogy World","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Frogy World is a 2D platformer game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fvr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219461,"name":"Draw and Color: Kawaii","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Coloring books are a great way to spend your time. It is a good way to settle the nerves and relax! It also develops your brain... just like eating fish. Use one of the pre-made templates or create your own illustrations.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219460,"name":"Classic Games Collection Vol.2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"This is a second installment of the series in which we present you with popular classic games from across the world! Prove your mastery in those titles by playing against the AI or a friend in a local co-op mode. This is a perfect game bundle to get your brain juices flowing!\n\nGames included in the bundle:\n\n- Mahjong - Traditional Asian game in which you will have to match sets and pairs of tiles.\n- Word Search - find all the words hidden in the puzzle!\n- Battleships - Choose a right strategy to guess the placement of the enemy ships on the map!\n- Hangman - Can you guess the right word before the stick man hangs?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fvq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219457,"name":"JDM Drag Racing","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"JDM Tuner Racing is the game you have been waiting for to speed through the streets and let your potential flow.\nDrag race and enjoy the opportunity to customize your air filter, exhaust, ECU, intake, head, pistons, turbo, gearbox, nitrous, tires and others.\nThe game lets you be in charge of the transmission so you can discover the underground in your own tuning. You chose the make, the color and all other details for your car so you can level up, earn money, and unlock more available features.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219456,"name":"World of Deadliest Catch","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In Deadliest Catch, you will have the opportunity to take part in dangerous sea races for prey and catch as many crabs as you could not imagine! Your task is not an easy one - you will have to struggle with time, catch quotas, migration of crabs, and, most importantly, with the sea itself. This is your destiny in the waters of Alaska!\n\nYour ship will be in the same conditions as any ship sailing out of Dutch Harbor every autumn in the hope that the deep sea will bestow its treasures on it. He will be afloat in any weather - like a breeze, a strong wind and even a storm - you don't care. The restless sea, the soaking wet deck, the ship swaying on the waves - you can handle everything!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219453,"name":"Drift Horizon: Racing, Driving & Parking Trial Simulator Games","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Become a legendary drifter! Tune and upgrade your car, install parts and boost performance!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219452,"name":"Elite Soldier Shooter","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sometimes there are tasks where SWAT can not handle... and then you appear — Elite Soldier. You are the \"champion\" on special assignments.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gcl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219437,"name":"New Joe & Mac: Caveman Ninja - T-Rex Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":219414,"name":"Our Passing Thoughts","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"【 It’s like catch but the ball is the ability to jump. 】 Take on the role as one of two creatures in this imaginative co-op experience that tests how well you and your friend get along. Explore a broken world together and discover what is valuable, and what remains just a passing thought.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5es9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219413,"name":"VanillaBeast: Retro Knock-Out!","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"VB Retro Knock-Out! is the first prequel chapter to VanillaBeast: Ace in the Hole. Follow Vanilla as he works through the boxing ranks facing off against tons of parody boxing opponents on his way to the undisputed champion of the Venereousville Boxing Association.. Tike Myson.\n\nExperience nostalgic game play and visuals as you battle over 30 parody opponents in your quest to become the champ. Retro Knock-Out! is a “pick up and play” arcade boxing game with beautiful pixel art, incredible arenas, mature story, and fast-paced arcade style game play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5va8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219410,"name":"Water City","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Slice, burn, torment, throw water, and smite those repulsive dark creatures","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5es4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219409,"name":"Bandit Realms","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A medieval turn-based strategy card game with a procedurally generated world map to explore and conquer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5es3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219407,"name":"Government Simulator 2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Government Simulator 2 is based on real world statistics and data and lets you control a whole country, like the USA, Germany, UK, France, Russia, and others: Change laws, taxes and budgets, and see what happens. Manage emergencies, impose tariffs, start wars.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8geu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219404,"name":"Dusted Dusk","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Embark on a journey into a dark, fantasy world, wielding a host of weapons, sub-weapons, skills, and spells, to battle demonic entities in this immersive, true-to-form, Metroidvania.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eru.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219400,"name":"Path to Ruin","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"- Classic turn-based combat - Story and exploration driven progression - Hybrid visual style combining hand-drawn and pixel art - Dark comedy combined with heartfelt character interactions - Original soundtrack specifically written to fit the story and events","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ert.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219399,"name":"Veridian Expanse","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Explore the depths as you drill, craft, and fight to escape from a mysterious asteroid deep in the Veridian Expanse.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5err.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219397,"name":"Nether Garden","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Join the Hunter Society and explore an open world, building up your character with equipment and upgrade materials gathered from enemies and bosses. Venture into the underworld to unlock new abilities, and develop your training rooms in the overworld, and eventually automate the farming process.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5erp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219395,"name":"Police Interceptors","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"High-speed, adrenaline-packed car chases right in the middle of rush hour in a big city. Face multiple challenges and put your skills to the test. There’s a call coming in – bring those perps into custody!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ern.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219394,"name":"The Adventures of Rob-1E","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Explore an open world full of puzzles and challenges as self-aware robot Rob-1E. Along the way, collect and upgrade cute companions, visit memorable locations, and unlock Rob-1E's true powers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5erm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219393,"name":"Little Witchelsa: Pumpkin Peril","genres":[],"avg_score":0.0,"description":"Enter the world of witches and solve all kinds of puzzles in this fun blend of match 3 and hidden object game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5erk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219392,"name":"The Human Story","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The Human Story is a hidden object game set in a colorful, historically accurate miniature world. Explore different cultures and ages. Find characters, objects and little stories about our ancestors. Learn about their lives and piece together the history of humankind.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5erl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219385,"name":"Pac-Man Colour Handheld LCD Game","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Uses a light sensor to project the screen onto a mirror. An alternate, seemingly unauthorized version was produced (by Zeon Tech themselves) titled \"Arcade Classic\", which features Pac-Man wearing a cowboy hat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8kuz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":219379,"name":"Chess Classic Board Game","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Challenge your friend to a chess duel in this popular board game! Awaken your skills as a strategist, because only in this way you can outwit your opponent and checkmate.\n\nIf there are no friends nearby, then play against a virtual opponent by choosing one of three difficulties. Are you a chess master or a beginner? Regardless of this, you will find a difficulty level suitable for your chess skills!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gcf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219377,"name":"Stickman Trenches","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Stickman Trenches is a Real Time Strategy game in which you need to manage your men and weapons and build up your defenses in the brutal trenches of Stick World War 1.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5esm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"}]},{"id":219376,"name":"Big Adventure: Trip to Europe 2","genres":[],"avg_score":0.0,"description":"Prepare for a journey through 30 amazing tourist spots around Europe! Hunt for hidden objects and solve brain-teasing mini-games as you visit the Paleontological Museum in Paris, see the Pena Palace in Portugal, enjoy a walk in Bruges, and even ride the tram in Lisbon!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219375,"name":"Intimate Codex","genres":[],"avg_score":0.0,"description":"Free form text exploration","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219373,"name":"YAS: Yet Another Shooter","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Kill them all!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219372,"name":"Pulse","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Race to clear each stage before time runs out in this furious action-puzzler exclusively on Playdate.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219371,"name":"Ripper","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Rip some circles in this comfy hypercasual game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219370,"name":"Blocks","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A fun little puzzle game for Playdate","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":219367,"name":"Corebreaker","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Corebreaker is a fast-paced action-platformer game with rogue-like elements. Play as Nova, a robot designed to awaken when humanity is extinct by the machines. Unlock abilities, upgrades and powerful weapons as you fight your way through supreme robots to find out your purpose!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5pb0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219364,"name":"Zodiac Mall Ball","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Be the Baddest Bladekid! Collect the Cutest Pins.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219356,"name":"Touhou: Dreamland of Infinity","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"Helping to construct my dreamland, you can take away an artifact of your choice from the dreamland...\" To help Doremy Sweet, the Master of the Dreamland, using different Gensokyo girls and their magnificent projectiles, facing the challenges in the endless dreamland!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219340,"name":"Billiard: Classic 8 Ball Pool","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"In our billiards you can play both with a virtual opponent and with friends on one device! Challenge a friend to a duel and compete with him in skill, dexterity and accuracy, because only these skills will help you achieve victory! The rules of the game …","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5h1q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219339,"name":"Galaxy of Void: Bounty Hunter","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"An action-adventure roguelike with a bit of RPG tossed in. Shoot, defend, combine found items in an unexpected way. Complete contracts and uncover secrets to defeat the mysterious enemy. Ahead is a labyrinth filled with insidious dangers, anomalies and many rewards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219336,"name":"Geared for Fear","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Geared for Fear is a heist-themed car combat game, with a focus on giving each car a unique playstyle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219335,"name":"Geese and Gats","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A take on the classic round-based survival game. But the geese have spears","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219332,"name":"Ghost Knight: A Dark Tale","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Ghost Knight: A Dark Tale is a 2.5D action platformer, set in a toon dark fantasy world, where a mad king, in search for immortality, opens portals to a dark dimension. As Ghost Knight, a spirit bound to a suit of armour, you must traverse an epic land of monsters to stop The Mad King.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eql.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219331,"name":"Ghost of Fall","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Ghost of Fall\" is a 2d side scroller adventure, story driven game with rythm based combat, high quality pixel art and high production value soundtrack.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219330,"name":"Ghost of Ice Valley","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Ghost of Ice valley is a Visual Novel where you follow multiple different storylines and make choices according to what you believe the characters may do in that situation. Interact in the Interview system to find out more about the characters and about yourself as you go along.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219329,"name":"Gimmiko","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The world is frozen in an endless night, trapped under a shadowblighted moon. Demons from the collective subconcious are leaking into reality. Save the world from the curse of the Jabberwock in this wacky dicebuilding roguelite!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8of3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219326,"name":"Girls vs Zombies","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Third person wave-based game. The concept is that you must survive a zombie apocalypse as a girl who wakes up in the middle of the disaster in her underwear. You don't have anything and you must arm yourself and defeat the zombies before they eat you.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eqf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219317,"name":"Forest Spring","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"With the arrival of spring, it is necessary to clear the forests, but you will get blood, not dust, on your hands. Do you have the courage for this ?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eq5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219315,"name":"Forbidden zone","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Be a survivor in a massive open world with the radioactive mutant. Explore the new ultra-realistic world, find your community, crafter your best weapons, and survive the regions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eq3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219313,"name":"Fly Missions","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eq1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219307,"name":"Frogice","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The adventure of a Chubby Frog trying to reach the Pond! In levels, You need to reach the flag but you can't reach the flag but your long tongue is too good to pass these levels. He has a long tongue! And he can use it very well.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219305,"name":"Eagle Simulator","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"If you’ve ever wondered what it’s like to be a bird with wings that flies, then Eagle Simulator is the perfect game for you!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ept.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219302,"name":"Corrupt Political","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Your wildest dreams will become reality in this political strategy and simulation game that shall introduce you into world known to a corrupt oligarch.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219301,"name":"Car Mechanic Pinball","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Play pinball using a car instead of a ball!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219300,"name":"BOT.vinnik Chess 2","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Learn the secrets of chess masters with the finest instructor!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219299,"name":"Blobufo","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Blobufo Platformer Game with Diffrent Mechanic on Space! Our character moves with the power splash from his weapon. Complete the levels in this space without hitting the enemies and Thorns! Don't look easy! Seriously hard!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219298,"name":"Fenderball","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Plunge into the world of Fenderball, an arcade-style sports game where a pinball machine is the arena for scrappy goal-scoring showdowns.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219297,"name":"Animals Transport Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Become an animal transporter driver.Hurry to get as many orders as possible. Get behind the wheel, but also be careful with the animals. Fun but challenging game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219290,"name":"Fantasy Kingdom: Fantasy Tiny Forest","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Survival mode: avoid the pursuit of monsters, defeat the monsters in the way, maze-like game levels, explore the map to find the end. Musou Mode: Unparalleled mowing gameplay, a large wave of monsters attack, quickly defeat them, find the Boss and defeat it, and complete the game clearance.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5epd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219281,"name":"School Race GP","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Eric Eraser and friends are racing at school!?\nSpeed through a variety of hazards as fast as you can!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ep6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219280,"name":"Sudoku Casual Puzzle","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sudoku is a relaxing puzzle for the mind and attentiveness!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ep5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219279,"name":"The Zombie Smasher","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get behind the wheel and crush all zombies to the last, use the force of velocity to destroy and erase the zombies from existence.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ep3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219277,"name":"Isekai Musume to Konkatsuchuu: Isekai Bride Hunting - Fia Edition","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In a universe where the Earth has merged with another world, the hunt for a bride from another world begins!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ep1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219269,"name":"Carwarz.io","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219268,"name":"Idle Food Empire Tycoon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219266,"name":"Orc Invasion Tower","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219265,"name":"Family Town","genres":[],"avg_score":0.0,"description":"Makeup and clothing stylist Chloe decides to conquer Hollywood with her boyfriend, but events take an unpredictable turn when she finds out about her pregnancy! Find out how her boyfriend reacted to the pregnancy and go through this journey together with Chloe!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eov.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219264,"name":"Stack Tower͏","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In the highly addictive arcade game Stack Tower you stack 3D blocks to a tower.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eou.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219263,"name":"Down in the Depths Blind","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eos.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219262,"name":"Blumgi Castle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7s85.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219261,"name":"Oil Tycoon 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Oil tycoon 2 is a fun pipe puzzle game, perfect for those situations where you need to kill time. You have to connect all sources to objects. Rotate the items you will need to reconnect each object. At first glance, it seems simple, but with each level of play becomes more difficult. There are a total of 385 levels available. You are challenged by leaderboard system as well as timed against the clock. The controls for game use simple tap gestures that are very responsive. Pipes rotate a full 360 degrees and can be activated at any time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219259,"name":"Warpaws","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Let slip the dogs of war or embrace your inner feline and settle the age-old question of Cats vs Dogs, in this quick-to-learn classic RTS game where players fight over territory to eventually destroy their opponent’s base. One side may have nine lives, but even the good bois can get ruff!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219257,"name":"Umbral Core","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Umbral Core is a 2.5D fighting game set in a world of dark high fantasy. It features rollback netcode, uncapped FPS, engaging combat mechanics for players across all skill levels and lots of customization options. Kickstarter and public demo coming soon!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eol.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":219254,"name":"Escape Chase Monster","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"\"Escape Chase Monster\" is an action game. Run away from monsters, shoot guns and reach the goal.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219253,"name":"Erina & A Mansao Rosaria","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Explore the Rosaria Manor and its surroundings, discover its secrets, break curses, fight monsters and save your friends in this action-adventure game with RPG elements.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eog.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219252,"name":"Epic Survivors","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Time survival game. rogue-lite elements. Legend Looper travel different world to complete missions. Try Power up themself become immortal. Survive with thousands of monsters attack.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eof.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219250,"name":"English A-Game","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"English A-game is a comprehensive English course in the form of a video game. It is a fun English language game to teach you basic English up to upper intermediate level. Included are an in-game user guide and English grammar tutorial for self-study. Designed for Polish learners of English.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eod.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219249,"name":"Endless Engines","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Endless Engines is an endless roguelike dungeon crawler where you play as a bandit aboard the Endless Engine, a never-ending train that travels through time and space.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219248,"name":"Elland: The Crystal Wars","genres":[],"avg_score":0.0,"description":"After 20 years, experience the never-before-released Game Boy Advance game Elland: The Crystal Wars. As an ace raptor pilot, protect the Gatherers as they harvest the precious Crystal from the remote desert world of Elland from the vicious forces of the Trafford Corporation.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eob.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219247,"name":"ElementalMaster Luna: The Moon Goddess And Lost Memories","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Elemental Master Luna\" is a 2D side-scrolling action game in which you must defeat the great spirits scattered throughout the land and regain your lost divine powers. Control the goddess Luna, who has lost her memory and powers, and learn various types of magic to conquer the stages!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eoa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219246,"name":"Eclipse: Shine of Dawn","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Eclipse: Shine of Dawn is a game with a Fantasy RPG aesthetic that combines the best of storytelling and hack 'n slash elements, unique characters, memorable enemies, and immersive puzzles in a pleasant setting, whether to think, admire, or beat down hordes of monsters. As you progress through the story, unlock new weapons, abilities, and emotions that deliver unique moments in a completely epic way.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ge2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219245,"name":"Dirty Land","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A videogame about being a real estate salesman in the 80s","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eo7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219236,"name":"DeerHunterFan.com TV: The Season","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Hunt Deer that act and react differently depending on the time of the season, weather and rut stage. Bucks very in size and you will be able to hunt monster bucks that have potential to score well over 200 inches. Each successful hunt gains you EXP and you can purchase / upgrade gear and firearms.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5enw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219229,"name":"Corrosion","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Shoot your way through waves of robots, collect new weapons, upgrades and skills, fight difficult bosses and gain better loot! It is your task to try and find out what happened to all life on Earth!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eno.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219228,"name":"Conspiracy Girls:The Madness of Madison Delaroux","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"/Conspiracy/ Girls is a visual novel about cute and funny girls who go around exposing conspiracies, and get into all sorts of trouble for doing so! A kinetic (linear) visual novel for enjoyers of internet memes, anime and anonymous message boards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5enn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219226,"name":"Cold Renegade","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Low Poly FPS/TPS with modes like Deathmatch, Elimination, Team Deathmatch, Gun Game, Domination, and Zombie Wave Survival. Including mechanics like Killstreaks, Pre-Game Lobby, and Room Browser. You may have just found your time killing game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5enl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219225,"name":"Cavalier","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The King's pup levels up! Cavalier is a single player hand drawn Metroidvania. Combat enchanted creatures while you explore the expanding map, and restore the magical kingdom in this charming medieval adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co97g4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219224,"name":"Catellite-609: Feline Space Adventure - Mysterious Sphere","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"After several successful surveys, the team noticed strange glowing metal parts overboard. Collecting them can get something? What will come of it? Find out first!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219222,"name":"Carrot Revenge","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Rabbit was taken from his family, unknowingly where he is or for what purpose and he will be looking for revenge.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5eni.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219221,"name":"Cards from the West","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Make your way through the dangers of the Wild West with your revolver and your deck of cards","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5enh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219220,"name":"Capital Profit","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Capital Profit is a game based on gathering resources and crafting them into objects that you can sell to NPCs via your very own shop. You can try to get the coolest items or the most money, it is up to you to decide.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5enf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219219,"name":"Canvas Legacy","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Canvas Legacy is a sandbox MMORPG with a fully player-driven economy, featuring open-world housing where all shops are run by players. Explore dungeons, fight bosses, participate in Kingdom wars and even become King yourself. Or just build your dream house and paint nice things.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ene.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219218,"name":"Cannon Foundry Simulator","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"You set up a cannon foundry. You have to go through the entire process of creating an old cannon from the very beginning. Build your workshop and start production. You start with the most primitive medieval guns. But you're still developing.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5end.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219214,"name":"Building Destruction","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Multiplayer sandbox with destructible environment. Destroy different maps, build your own, and play with your friends and other people online","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219213,"name":"Blue Intervention","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Blue Intervention is a tactical FPS game. You cooperate with your police partners in various situations and environments. Neutralize criminals, rescue civilians!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219211,"name":"Blockpop Heroes","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A parodic minimalist runner focused on jumps.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219208,"name":"Blackjack at Carrot","genres":[],"avg_score":0.0,"description":"Modern 2D Blackjack game with customizable table rules. For up to 4 local players.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219207,"name":"Billion Bastard Bots","genres":[],"avg_score":0.0,"description":"Intense first-person bullet-hell arena-shooter in a fully randomised city-scape.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219206,"name":"Bill Hates Videogames","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A comedic misadventure game about a jerk named Bill who gets sucked into a videogame. Eat trash, solve things and fart at anytime. Also it's supposed to be funny, but I don't guarantee that.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5en0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219204,"name":"Beyond the Shadow","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"As the sole specialist sent into a quarantined part of the Midwest , discover all you can about the mysterious corruption rapidly taking over. Utilize all you can find around you to survive the evolving area, find the source and eliminate the threat. Will you defeat what lies Beyond The Shadow?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219203,"name":"Beverage Hills","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Beverage Hills is an outrageous RPG adventure with a turn-based combat battle system containing some very recent current events.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219202,"name":"Athereon: Advent I","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Athereon is a parallel universe immersed within an epic fantasy party-based RPG.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219200,"name":"Astro & Luna vs. The Entire Solar System","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"After being kicked out of his own solar system, Astro teams up with Luna and together they take revenge on the elitist planets that betrayed him. Use Luna to fight back in this gravity-based SHMUP and show those planets what it means to be “too small”!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219198,"name":"A Smooth Game Unlike Life","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Little Jessie's adventure to find a reason to stay alive. Playable with only one hand (WSAD). Continue eating those chips with the other hand(s).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ems.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219197,"name":"Asia Empire 2027","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Lead your Asian empire in an empire building turn based strategy war game. Are you ready to lead, Supreme Commander?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219195,"name":"Arabia Palace Builder","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In Arabia Builder you will get the chance to prove yourself as the most skilled artisan in the medieval Middle East. Repair palaces, dig aqueducts, tend to beautiful gardens and make the realm fit for a sultan!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219194,"name":"Aquapark Renovator","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Build your own water park! Use plenty of tools to renovate the aquapark. Tear up what’s old, put up the tiles and paint the different elements. Choose from multiple water slides, giant fountains, plants, and relaxation zones. Use your creativity and have fun while doing it!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219192,"name":"Ninja Robo Hero","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219191,"name":"Zoo Life","genres":[],"avg_score":0.0,"description":"Build the zoo of your dreams & take care of your animals!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219187,"name":"LimBall","genres":[],"avg_score":0.0,"description":"Limball Game By ASW Studio for Windows Store !\n\nWhat could be in a mystery book?\n\nThe little boy starts reading the LimBall book he found in the library.\n\nAs he reads the adventures of LimBall, this incarnation protagonist is drawn into the book.\n\nCan you help LimBall reach his goal in this unusual and fun adventure?\n\nUnlock all levels! Share with your friends","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5emf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219164,"name":"Last Fortress: Underground","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Castle, the largest community of survivors, has fallen.\n\nOnce a beacon of hope in the post-apocalypse, it now shares the same fate as the rest. Amidst the chaos, a small group of survivors managed to escape into the barren wilderness.\n\nYou are the Commander of these survivors. While escaping the zombie horde that utterly destroyed your last sanctuary, you come across a strange building jutting out from the ground. Low on supplies and left with little options, you decide to take refuge in this building. So begins your campaign of survival in this zombie-infested world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5elh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":219159,"name":"Portal: Prospekt","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A Portal Recreation of the Nova Prospekt Aesthetic in the early to mid 2005 beta.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5iuc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":219148,"name":"Low Fast","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Short game with 4 minigames, your mission is to complete them all without time running out!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ek7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219141,"name":"SinxHolic","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"An episodic visual novel currently in development.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ejf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219119,"name":"Line Wobbler","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Line Wobbler is a one-dimensional dungeon crawler game with a unique wobble controller made out of a door-stopper spring and a several meter long ultrabright LED strip display. The player navigates obstacles and fights enemies to reach the exit. Movement is controlled by bending the Wobble controller left and right, while enemies are attacked by wobbling.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ei1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219114,"name":"Isekai Demon Waifu","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219063,"name":"Untitled Racing Game","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":219035,"name":"Cirno's Perfect Punchout!!","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Indulge in Cirnos dream-world of overconfidence and beat up all the frogs you can find before she wakes up!\n\nUnlock additional modes by becoming stronger than the strongest frog!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5e1b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219033,"name":"Dogfighter: WW2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219030,"name":"Summer Lesson: Chisato Shinjo","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219028,"name":"Romance of the Three Kingdoms XII: Competition Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219020,"name":"Ninja Spirit","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dzj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":219017,"name":"RoboCop 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dzg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":219015,"name":"ReBoot","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dze.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":219014,"name":"Pink Panther","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dzd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":219007,"name":"Assassin's Creed Ezio Auditore Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dyg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219006,"name":"Tom Clancy's Ghost Recon: Gold Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dyf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219004,"name":"Trials: Gold Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dye.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219003,"name":"Assassin's Creed: Modern Revolutions Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dyd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219002,"name":"The Crew: Silver Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dyc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":219000,"name":"Assassin's Creed American History Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dsz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218998,"name":"Phone","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An cancelled horror game made by Ben \"Yahtzee\" Croshaw.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"DOS"}]},{"id":218996,"name":"Adventures in the Dimension of Insidual Cruelitude.","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A cancelled sequel to Adventures in the Galaxy of Fantabulous Wonderment made by Ben \"Yahtzee\" Croshaw.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"DOS"}]},{"id":218995,"name":"Assassin's Creed Rogue: Deluxe Edition","genres":[],"avg_score":0.0,"description":"Completion of the Siege of Fort de Sable is required in order to generate and unlock the chest that contains all items in the explorer pack.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7oi3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218993,"name":"Broken Boughs","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An cancelled Silent Hill inspired first person adventure game made by Ben \"Yahtzee\" Croshaw.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dsc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"DOS"}]},{"id":218992,"name":"The Rise and Fall of Odysseus Kent","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An abandoned sequel to The Trials of Odysseus Kent made in Adventure Game Studio by Ben \"Yahtzee\" Croshaw.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dsb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"DOS"}]},{"id":218991,"name":"Fear of Bugs: The Fear Experience","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218984,"name":"Work x Work","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218983,"name":"Nikakudori","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218976,"name":"Zombies","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Zombies is a round based survival game following a sole surviver and thier blood lust for killing the undead.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dl7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218972,"name":"Dead House: Saisei","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218961,"name":"ZooRacers","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Get ready to rev your engines and unleash the competition in ZooRacers! This electrifying, free-to-play 3D battle kart game is packed with non-stop action and endless fun. Show off your skills and attach some seriously cool NFTs to boost your character's performance. With a play-to-earn mode, you can rack up rewards while dominating the competition. Get creative and customize your karts, drivers, weapons, and more to leave your opponents in the dust and climb to the top of the leaderboard! The race is on, are you ready?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dkd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"}]},{"id":218942,"name":"RoboCop","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dix.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218936,"name":"McDonald's Work Challenge","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dir.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218935,"name":"Tetris Jr. 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5diq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218934,"name":"Tetris Jr.","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dip.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218933,"name":"Bull's Eye Barbecue Sauce","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dio.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218927,"name":"Top Gun: Airstrike 3","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dij.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218925,"name":"Top Gun","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dig.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218919,"name":"Star Trek","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5di6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218907,"name":"Kanban Baseball","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dhm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218906,"name":"Beatmania","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co964k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218895,"name":"Everyone's Tsume Shogi: Intermediate 1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218893,"name":"Nobunaga's Ambition Online: Chapter of Heaven","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7sbj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218892,"name":"Gal Gun: Double Peace Bilingal","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218873,"name":"Tavern Tapper","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":218856,"name":"Samurai Unicorn","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"An action horror game with retro-graphics, set in the sprawling megacity of Sydney3.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co79l0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218852,"name":"Cardseer","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Cardseer is a fantasy deckbuilding game combining old school RPGs like the original Final Fantasy's with card games Yugioh, Hearthstone and Gwent. features a story based campaign, taking you across the continent to stop a mysterious evil force, and a challenging roguelike Gauntlet mode. Engage in fast paced card combat against a horde of villains, carefully traverse the hazardous map and strategically collect game-changing artifacts to emerge victorious!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5d81.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218850,"name":"My Little Idol","genres":[],"avg_score":0.0,"description":"My Little Idol is an AI-based dating simulation game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dbb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218843,"name":"Warsaken","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"A modern military-themed deck construction game in which you can battle other players.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5d70.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":218842,"name":"Valor & Victory: Arnhem","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Arnhem Sunday 17th September. Lt-Col John Frost's 2nd Battalion, The Parachute Regiment, reach Arnhem Bridge little knowing the fierce battles they would be fighting over the next few days.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218839,"name":"Air Splitter","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The racing game where you don't steer your car! It's all about how you handle your speed in this frantic racing game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5d3j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218825,"name":"Prima Doll Encore","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Prima Doll Encore is the fourth and final volume of a kinetic novel series based on the multimedia project Prima Doll, depicting the aftermath of the Kuronekotei café.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218797,"name":"Austin Powers: Mojo Rally","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Austin Powers: Mojo Rally is a cancelled racing game for the Sega Dreamcast based on the Austin Powers movie series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8wnc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Dreamcast"}]},{"id":218796,"name":"Die Hard 2: Die Harder","genres":[],"avg_score":0.0,"description":"Die Hard 2: Die Harder is a cancelled Sega Master System game based on the movie of the same name. The game was developed by Tiertex and meant to be published by Grandslam in December 1991, however after not meeting the release cycle it was \"indefinitely postponed\" in mid-1992 because Sega had concerns with the quality of the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Master System/Mark III"}]},{"id":218790,"name":"The Evil Within: Season Pass","genres":[],"avg_score":0.0,"description":"The Season Pass is a DLC for The Evil Within. It includes three add-on packs: The Assignment; The Consequence, which revolve around Juli Kidman; and The Executioner, where you play as The Keeper.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6vud.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218780,"name":"Monika After Story","genres":[],"avg_score":0.0,"description":"Monika After Story picks up where Doki Doki Literature Club left off, allowing you to spend the rest of your days with Monika as your virtual girlfriend.\n\nUse the new dialogue system to have conversations with Monika about subjects ranging from video games to the nature of god and existence. Or wait for a little while and she'll muse on dozens of new and interesting topics with new art and expressions not found in the original game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6tg4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218773,"name":"Defender","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A handheld clone of Defender by Gakken.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cdb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218772,"name":"Space Invader","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A handheld clone of Space Invaders by Gakken.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cda.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":218766,"name":"Prima Doll: Kouto Tantei","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Prima Doll: Kouto Tantei is the third volume of the kinetic novel series based on the multimedia project Prima Doll, which is a sequel to the anime series.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218730,"name":"Worms Forts 3D","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A turn-based artillery game for mobile phones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bzh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":218715,"name":"Effigy","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A retro FPS/metroidvania set on a prison moon overrun by a cult of former prisoners.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bz4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218712,"name":"Exilio","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Discover all the secrets of the island thanks to the revelations that you will live in your dreams, in which you will have to flee from death itself and make decisions that will have consequences when you wake up, and can even cause the death of the people who cohabit with you.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bz0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218709,"name":"The Cat Maze","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"it is a 2d solving puzzle game, the maze is subvert your imagination, you need to find the start point and end point by yourself that to solve the cats maze. there have many type of cats have special power to help you to solve it, there have 499 level waiting for you to solve!!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218706,"name":"Spliced","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Spliced is a hybrid roguelite deck-builder. Play as a symbiotic ooze, taking the parts and abilities of enemies you defeat. Use cards to battle enemies and navigate the environment.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218703,"name":"Click to Sail","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Build a team of sailors to navigate around the world using only your mouse!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218701,"name":"Crab and Fish","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218700,"name":"Idle Mining Empire","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218699,"name":"Chicken and Duck Brothers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218698,"name":"Cruise Ships Manager","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bym.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218697,"name":"Prisonela","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218696,"name":"Endless Siege Online","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218695,"name":"Crime Moto Racer","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218693,"name":"Northgard: Hræsvelg, Clan of the Eagle","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Carried by the winds, the agile explorers of Hraesvelg do not need to occupy a large territory, for they will readily venture outside to gather resources. Their profound knowledge of the terrain and their ability to exploit it to its fullest allows them to survive in the most desolate of areas.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218692,"name":"Beacon Pines: Collector's Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bye.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218691,"name":"Steamworld Dig 2 + Steamworld Dig","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218689,"name":"Deep Stories Bundle","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5byc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218687,"name":"Dad by the Sword","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dad by the Sword is a First Person Swordfighting game with a heavy focus on tactical dismemberment, dynamic slicing, giant spraying fountains of purple blood, and dad jokes. Play as YOUR DAD in his quest to fight evil hot dogs, Wizzards, things hatched from eggs, and other vile Anti-Dads.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co627l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218686,"name":"Supermarket Manager","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Supermarket Manager: Lead, manage, develop, and upgrade your own stores. Choose the right products and employees. Increase your revenue to create a strong supermarket brand.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bya.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218685,"name":"Dismantled 2","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Dismantled 2 is a survival horror game, and is the sequel to Dismantled. The game will see new characters involved in the story, 4 years after the events of the first game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5by8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218683,"name":"Cathedral of Sorrow","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Enter an evolving, procedural nightmare: Once a sanctuary for the bereaved, now a labyrinth of the lost - the Cathedral is a horror game run by an AI-model trained on human fear. Traverse its depths; evade its terrors; and free its captive souls in a non-linear and character driven game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5by6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218682,"name":"Nanokings","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Nanokings is a rogue-lite infused game where you try to survive the onslaught of evolved beasts and viking tribes augmented by steampunk machinery. Increase your power by collecting mysterious powders that allow you to choose items or upgrades in the norse dystopia of Myrkrafjordur.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5by4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218680,"name":"Dungeon Knight","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A fun and simple pixel platforming puzzle game where you play as a small telekinetic knight, and your goal is to escape the dungeon in which you are held. Also has 30 levels and usually takes around 20 mins to an hour to complete.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5by3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218678,"name":"Paperplanes","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A Third Person Action Adventure game where you explore the conflicted land of contemporary India in a post climate change crisis as an eighteen year old Hope.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5by1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218676,"name":"The Lost Bloodline","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Lost Bloodline is a game where you will venture into an immersive story developed in medieval times, endowed with a lot of action, exploration and a touch of fantasy, we recommend you to venture into this great epic journey.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218675,"name":"Detective Stories","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are a detective who has to solve mystery and cold cases. Only a few clues will help finding murderer. Was it just an accident or a murder? Thief broke in to steal something? Money? Or was it just a broken heart revenge? Well, you`ve got a chance to solve this case...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218673,"name":"Broilers","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Broilers is a turn-based game that resembles chess and similar board games, but only externally. The basis of almost all of the mechanics in Broilers, is selection (breeding). Learn how to breed new species and their characteristics in order to win the online challenge.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218672,"name":"Rikua","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Rikua is a 2.5D action platformer ninja cyberpunk game surrounded in beautiful, realistic and futuristic 3D aesthetics, and introduces a unique hack-and-slash/third-person-shooting mechanics that will keep you constantly on the edge!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218670,"name":"The Door Project","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Set up in a beautiful little town, you will have to investigate the mysterious disappearance of your friend and his community. Based on a high interactivity with the world, be prepared to use your brain and the tools around you for this unique first person adventure!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218669,"name":"Spooked Hide & Seek","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Spooked is a crazy hide & seek game in a huge magical castle with up to 10 hiders playing against one dangerous seeker. Maybe you will be sneaky enough to complete all the tasks and get out of the mysterious castle or enough determined to hunt everyone else down","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218665,"name":"Panda Roll","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"With a puzzle mechanic controlling both heroes at the same time, guide Pandara and Mulatta on an adventure of challenges and friendship, to find the mighty Sun Bamboo, and cure the Mulatta's mother.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218660,"name":"CyberHeroes Arena","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"CyberHeroes Arena is an autobattle roguelite. Choose your cyber hero, create your build and destroy all cyber monsters to survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bxe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218648,"name":"Corridor 8: Galactic Wars","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Corridor 8: Galactic Wars was the planned sequel to Corridor 7, a first-person shooter by Capstone Software. The sequel used the Build engine and was supposed to be released in early 1997. However, Capstone and its parent company Intracorp Entertainment went bankrupt in 1996. One of the former developers published an early prototype including the source code and a design document of this game.\n\nAccording to the document, Corridor 8 was planned to have 6 episodes with 10 maps each. The episodes were broken up into two sides: the human \"Allied\" and the alien \"Axis\", three episodes for each side. This game was also supposed to feature 18 characters plus 6 aliens redone from Corridor 7, 20 weapons to choose from and a secret weapon, and multi-player network gaming for up to 8 players.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6qi3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"DOS"}]},{"id":218640,"name":"Astral Guard","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Astral Guard is an interplanetary RPG adventure following a group of aliens trying to stop a vicious hivemind from taking over the solar system. Find friends, fight foes, and travel the stars!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ley.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218620,"name":"Super Cult Tycoon 2 Deluxe Edition","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The game’s set in a small Colorado town, and basically has you driving around recruiting the townsfolk, putting them to work, raising cash and ultimately getting enough gear together for your cult’s mothership to arrive and whisk you all off to a better place.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bun.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218594,"name":"Darius Cozmic Collection: Consumer Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218586,"name":"Tekla","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Blast your way through an endless horde of enemies in this pixel art top-down shooter. Collect their remains in order upgrade your character for increased combat abilities. Tekla is a top-down shooter with roguelite elements.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bre.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218585,"name":"Altar War","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Altar War is a virtual SLG + tower defense battle game with the alternate history as the background. It achieves the hegemony of the unity of the world by upgrading cities, building appropriate buildings, upgrading arms and training generals.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5brf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218584,"name":"Eat Me Alive","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"In dependency of where in the body you are positioned, you get different bonuses. In general you will get Bone, Blood and Tissue with which you can create more bugs. In addition to that you will be able to research different bug types which have bonuses themself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bra.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218583,"name":"Death Corp","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Death Corp is a classic 2D Point and Click Adventure game where you play as the young new intern for Death's own company.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67tl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":218582,"name":"Emi's Country Store and Farm","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Play relaxed or timed in this Onet/Match 2 Game. Enjoy the nice graphics and the cute colorful tiles. Look beyond the nearest option and make every level a 3-star win. Catch the mouse while playing, earn bonus coins and create the nicest Country Store and Farm for Emi.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5br7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218546,"name":"Biohazard RE: 2 - Z Version: Deluxe Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218545,"name":"Raccoon City Edition: Z Version","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218534,"name":"Slide N' Go","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218519,"name":"Graveless","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Graveless is a single-player third person dungeon crawler Hack and Slash Action RPG set in the realm of chaos when immortality is no longer a myth and fiction.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bgo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":218516,"name":"Century: Age of Ashes - Myth Starter Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218512,"name":"Mr. Pumpkin and a Cat Reporter: Adventure Bundle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218506,"name":"Klonoa Phantasy Reverie Series: Digital Deluxe Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co97l5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218504,"name":"Endzone: A World Apart - Complete Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218498,"name":"SD Gundam Battle Alliance: Ultimate Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218497,"name":"Temple Dash: Jungle Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218495,"name":"Century: Age of Ashes - Dragon Eggs Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218492,"name":"Century: Age of Ashes - The Journeyer Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218491,"name":"Century: Age of Ashes - Valkurian Prelude Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218489,"name":"Butterfly Bundle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218479,"name":"Meaningful Adventures","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218477,"name":"Red Ball Escape Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218473,"name":"The Lifetime","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"After falling through a void for an entire lifetime, you land in a mysterious underground world, with a mask you can't remove. All you're told is that you need to collect time so you can return to your former life back up on the surface. But time moves in mysterious ways down here...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bfq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":218472,"name":"Out in Space","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Out In Space is an online cooperative escape game in which you and your teammate will put your communication skills to the test in order to escape from a space wreck doomed to destruction. Will you make it out in space ?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bfp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]}]