[{"id":11355,"name":"Starcraft: Ghost","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"StarCraft: Ghost is a cancelled military science fiction stealth-action video game previously under development by Blizzard Entertainment. Part of Blizzard's StarCraft series, the game was announced on September 20, 2002, and was to be developed by Nihilistic Software for the Nintendo GameCube, Xbox, and PlayStation 2 video game consoles. Several delays in development caused Blizzard to move back the release date and the game has not yet materialized. Nihilistic Software ceded development to Swingin' Ape Studios in 2004 before Blizzard bought the company, and plans for the GameCube version were cancelled in 2005.\n\nBlizzard announced in March 2006 that the game was put on \"indefinite hold\" while the company investigated seventh generation video game console possibilities. Subsequent public statements from company personnel had been contradictory about whether production was to be renewed or planned story elements worked into other products. The continued delay of Ghost had caused it to be labeled as vaporware, and it was ranked fifth in Wired News‍'​ annual Vaporware Awards in 2005. In 2014, Blizzard president Mike Morhaime confirmed that Ghost was officially cancelled.\n\nUnlike its real-time strategy predecessor StarCraft, Ghost is a third-person shooter, and was intended to give players a closer and more personal view of the StarCraft universe. Following Nova, a Terran psychic espionage operative called a \"ghost\", the game is set four years after the conclusion of StarCraft: Brood War and covers a conspiracy about a secretive military project conducted by Nova's superiors in the imperial Terran Dominion. Very little of the game's storyline has been released; however, in November 2006 after the game's postponement, a novel was published called StarCraft Ghost: Nova, which covers the backstory of the central character.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2wby.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Nintendo GameCube"},{"id":0,"name":"Xbox"}]},{"id":11296,"name":"Allison Road","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Allison Road is a survival horror game developed in Unreal Engine 4, played in first person view with optional Oculus Rift support. \n \nYou will take on the role of the unnamed protagonist who wakes up one day without any recollection of prior events. Over the course of five nights It is your objective to uncover the whereabouts of your family, unravel the mysteries of the house, and face off against Lily and other dark entities that are nested deep within the house, while the clock is relentlessly ticking towards 3:00am. \n \nWhat would you do if you could feel something stalking you in the dark in the safety of your own home? \nIf you couldn't tell what's real and what's not? \n \nAllison Road combines old-school survival horror and adventure game mechanics with next-gen graphics and optional VR support. \n \nThe game was initially developed by one person but then the team slowly grew to its current size of 6 people.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1hvn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":11264,"name":"Blitzkrieg: Iron Division","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11255,"name":"The London Heist","genres":[],"avg_score":0.0,"description":"Be transported to London's gritty criminal underworld and step into the shoes of an east end gangster. You will experience coming face to face with a psychotic gangland enforcer, pulling a heist on the Russian mob and surviving a high octane shoot out on the streets of London. Become immersed in unique gameplay in a way you have never experienced before with two unique demo experiences.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11239,"name":"Rektangle","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Rektangle is an upcoming bullet-hell game for PC and Xbox One.\r\n\r\nHand crafted by the Crabs at Smashed Crab Studio, Hull, UK.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/y3ujhi5mn7vszlcu5try.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11181,"name":"Eitr","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Shield Maiden, as with all mortal Norsemen, was to have her fate determined by the three fate- weaving Norns and their sacred loom before she even entered the world. However, her destiny was shattered when the mischievous god Loki interfered, dripping spots of the wretched substance Eitr into the unwoven loom, forever altering the Shield Maiden’s path and engulfing the great tree Yggdrasil in darkness. Now the Shield Maiden must venture into the nine Norse worlds connected by Yggdrasil and unravel the mystery of her fate.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ybgktrgpnzvb00hdm5y0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":11136,"name":"Ion","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"From the creator of “DayZ” and inspired by the cult favourite “Space Station 13”; “ION” is an emergent narrative massively-multiplayer online game in which players will build, live in and inevitably die in huge floating galactic constructions as humanity makes its first steps colonizing the universe. Technology from Improbable allows ION to have a massive interconnected universe with fully simulated environments such as power grids, air pressure and heat; all to help stave off the unending vacuum of space.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/symqzda2kvi5bu5iqnvr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":11115,"name":"Alligator People","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"You are lost in the deepest part of the jungle. Six of your friends have fallen under the spell of the Alligator People. They are slowly being transformed into alligators and you are the only one in the world who can save them!\nTo stop this transformation, you must inoculate each of them with a special antidote that you gather throughout the swamp. You don't have a lot of time! Not to mention, the alligators are chasing you as you attempt to gather vials of the antidote! The longer you wait, the more antidote you need to reverse the effects of the Alligator People!\nAlligator People is an unreleased prototype based on the movie of the same name. This prototype, discovered by Ben Liashenko, appears to have been completed and was set for release in 1983.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/w7hwrrmmsd2p6wn20lqx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":11109,"name":"Great Battles: Battle of Tobruk","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11103,"name":"Battle Isle: Threshold Run","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11102,"name":"Battle Isle II: Data Disk I","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/sosq7nunyun6rlbdjx7p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11066,"name":"Corpses 'N Souls","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Corpses ‘N Souls is a Metroidvania - ARPG set in an incredibly detailed world created using a custom-built 2D HD graphics engine.\n\nWelcome to Corpses ‘N Souls - a game full of unique experiences. Progressive loot & crafting mechanics, tactical combat, spell-craft and adventuring are just some of the options available. Set in an intricately detailed sci-fi world, Corpses 'N Souls delivers a vibrant yet ghoulish atmosphere for the player to immerse themselves in.\n\nYour journey takes place in our own galaxy, here amongst the planets of the Epsilon-K star cluster, you will choose to represent a species and class in order to take on the challenges set before you.\n\nBecome the master of harvesting corpses and souls, or fall victim and be harvested yourself. As the dawn of the 'Soul Revolution' approaches, no one’s corpse or soul is safe. Only you can choose the fate of your species. Be the one to help piece together the key to immortality, gaining the upper hand in the impending 'Soul Wars'.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2sdn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":11045,"name":"Catacomb Armageddon","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Catacomb Armageddon is the sequel to Catacomb Abyss, only now set in the present day. The levels featured, among others, towns, forests, temples, torture chambers, an ant colony, and a crystal maze. It was developed by Softdisk and was later republished by Froggman under the title Curse of the Catacombs.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11034,"name":"Versailles Mysteries: Oscar and the Athanor","genres":[],"avg_score":0.0,"description":"The devious Du Noï wants to find the Athanor’s secret and it’s up to you to stop him! Alchemy, cunning spies and foul treacheries will enthral you through many hours of surprising twists and turns in the court of reigning King Louis XIV. \n \nLive the life of a 17th century gentleman using humour, logic and shrewd judgement to avoid the deadly traps of the Sun King's court in an adventure set across 25 historically accurate locations. \n \nMeet more than 30 characters, some fun, others deadly, including Totiri the Huron, The Marquess of Armantas, Batistini the painter and Master Theodore the great alchemist. \n \nMini-games will teach you essential skills: learn to dance the Menuet in an historical interpretation of popular interactive dancing games, train to use a dagger and grappinou by proving your courage in a fight, and discover how to decipher fiendish enigmas.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ipzzvds6zcgy2xbs6mon.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11033,"name":"Versailles Mysteries 2: The Royal Spy","genres":[],"avg_score":0.0,"description":"Let’s embark on 15 hours of thrilling detective adventures ! Take on the role of detective, privateer, engineer and strategist to foil the plans of your fiendish enemy who is out to destroy the Sun King. Explore the stunning Castle of Versailles and its surroundings on a journey punctuated with mini-games.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/monvkcrv9htfzbj76h7c.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11019,"name":"My First Trainz Set","genres":[],"avg_score":0.0,"description":"Trains, Tracks, Army Men, Buildings ... Sick of cleaning up all the kids toys all over the house? With My First TRAINZ Set you won't have to!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7b49.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":11017,"name":"Trainz Simulator 2010: Engineers Edition","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"TS2010: Engineer's Edition is the latest release in the Trainz series. Notable improvements are the use of SpeedTree, tutorial mode, and customizable menus.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qp7por0jdrvhotgds326.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11015,"name":"Trainz Railroad Simulator 2007","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/wlktz1xl2ko534km4ny8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":11011,"name":"Too Many Me","genres":[],"avg_score":0.0,"description":"Too Many Me is a runner that breaks the rules of the genre by including platform games mechanics \n \nBut more importantly, in Too Many Me, you can clone your character! \n \nSo you don't have one, two, or three characters, but you can control over thirty of them at the same time! \n \nToo Many Me is also a One Button Game, and this is exactly where it gets hard. If it isn't easy to jump through a Canabalt or a Bit Trip Runner, just imagine what it's going to be like when you control simultaneously an army of clones!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/inkmhu2umrwmdqbtypxs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10986,"name":"The Tudors","genres":[],"avg_score":0.0,"description":"Political intrigue spans national borders in this historical hidden object game. When King Henry VIII asks you to be his eyes and ears in Europe, you are drawn into a world of deception and murder. As you assume the role of the spy, you will find that even the simplest objects can hold vital clues.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/fz34dksutr91gnn1giez.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10972,"name":"The Inquisitor: Book 2 - The Village","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Eymerich is asked to investigate the heresy reining in Calcarès, a remote village inhabited by the worst demons the world has ever known. Eymerich will have to learn about its inhabitants' fiendish secrets and, with the help of a handful of survivors, attempt to cleanse this village soiled by the Devil.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ku4nooyxok9cwhg96lig.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10971,"name":"The Inner World: The Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Inner World - The Puzzle offers a completely new puzzle-experience and a big challenge to the players' skills as they try to combine the various pieces of 100 puzzle motives from Germany's award winning adventure game.\nThe game offers three single player modes: In 'Search & Find', the right piece from different piles has to be put in a predetermined place. Two other modes require puzzling via \"Drag & Drop\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/l06nk8q3quwiexlvdalu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10935,"name":"Sword of the Stars: A Murder of Crows","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The second expansion to Sword of the Stars. In addition to new techs, weapons, and ship sections, AMoC adds a sixth race, the bird like Morrigi","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2rid.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10925,"name":"Stealth Force 2","genres":[],"avg_score":0.0,"description":"The eagerly awaited sequel to the 100,000 unit selling Stealth Force: The War on Terror, this epic new instalment spans three decades in the quest of the elite Special Forces unit ‘Stealth Force’, to eradicate the world of international terrorist cells.\n\nYou will take on the role of Jackal, squad leader in charge of black ops missions deep behind enemy lines – issuing tactical combat commands to locate key installations, rescue hostages and finally take out the leaders of the network.\n\nYou are solely accountable for the outcome of these vital missions and your squad members’ lives are in your hands… failure is not an option.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10915,"name":"World at War: Operation Somalia","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"World at War is essentially a tactical first person shooter with all-out-warfare elements that are set but not limited to the events which occurred on a military operation codenamed “Operation Gothic Serpent” or better known as “Black Hawk Down”. Teamwork is the key to success, and is promoted extensively through gameplay elements, such as a hybrid version of the popular game mode, Assault and Secure. World at War is a true to heart tactical shooter which is set in a believable and unforgiving environment where players take part in a virtual war like never seen before.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/tg9esfvxaysz8nig3zqw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10893,"name":"Sylia","genres":[],"avg_score":0.0,"description":"Three gigantic and mysterious Cubes have landed on Sylia's main islands. Inside them, unknown creatures (… Aliens) are gathered and plot on how to take control of the lands and ultimately extract the planet's energy – that would be the end of all life. Is Sylia a realm about to fall?\n\nMaybe not! A group of heroes is not willing to let that happen! They are Sylia's finest knight, wizardress, cleric and warrior. Supported and guided by their nation, they must enter the Cube where the Aliens' Queen (a mysterious woman by the name of Lady Godiva) is and stop her! But the task seems overwhelming…\n\nWho is going to win the fight for Sylia? Will the land thrive or will the Aliens gain its energy and destroy every life form in the process?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qacigcmnfybhraqeruts.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10884,"name":"SSV8 Superstar V8 Racing","genres":[],"avg_score":0.0,"description":"Powered by some of the most important car manufacturers in the whole world, such as BMW, Audi and Jaguar, and sporting top class production cars, Superstars V8 Racing offers the utmost realistic impression of the Championship. From car design to technical engine features, from the setting of the races to the turns of the tracks, everything has been designed in great detail. Every single car behaves in a complete different way accordingly to its real technical features and the settings tuned by each team competing for the title in order to get the best performance out of the powerful engine.\n\nGame play mode variety is enriched by each cars' peculiarity and it can be appreciated for the pick-up-and-play game mechanics, thought for the casual gamers, as well as for the top notch quality of the most experienced ones.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10883,"name":"SSV8NC Superstar V8 Next Challenge","genres":[],"avg_score":0.0,"description":"Hear the tyres scream in the second edition of the 4 wheels racing game by Black Bean! Next challenge brings the Superstars V8 series to a new level of realism and fun: New and improved in-game physics and damage, the exclusive Evolving Track system and the cockpit view lets you enjoy speed and adrenaline like never before. Plus, top-class cars from 7 different manufacturers, living and breathing 3D environments and online multiplayer for up to 16 challengers on the track at the same time!\n\nGianni Morbidelli, the last 2 years champion of the Superstars competition, has contributed to the fine tuning of the car behaviour and the tracks layout.\n\nFeatures - up to 16 players online - Realistic settings with many performance and aesthetics improvements - Exciting tracks, extremely realistic graphics and physics. - All the official drivers including champions such as Gianni Morbidelli and Stefano Gabellini - 19 faithfully reproduced cars racing simultaneously such as BMW 550, Jaguar S, BMW M5, BMW M3 e Audi RS4. - All the official tracks such as Mugello, Monza, Valencia, Adria, Misano Adriatico, Adria, Kyalami, Portimao e Vallelunga and other never published before tracks such as Magione e Varano.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10871,"name":"Skyward Collapse: Nihon no Mura","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Japanese enter the fray on Luminith: their faction has a very strong military and a very strange pantheon: their gods are much more aggressive than their Greek and Norse counterparts, and each has three god creatures rather than three god tokens. Learning to play this new faction effectively is a fun new challenge: given how powerful the Japanese military and mythology are, you have to be very creative in how you help the Norse and Greeks drive back this threat. Remember, no faction is supposed to dominate the other! \n \nHamlets are new non-combative, non-factional villages that can be built in the remains of the fallen towns. But it's never that easy! Hamlet buildings can only be placed from a limited queue that cycles as you place them. Hamlet buildings generate (or lose) Culture depending on what pre-existing tiles were adjacent at the time you placed them. Culture allows you to activate four powerful new abilities, including creating Large Towns or even turning back time. Amass enough Culture and Sunstone and you can even win the game via a new Cultural Victory!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xnqeoabgewqxc5vua920.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10868,"name":"Sins of a Solar Empire: Rebellion - Forbidden Worlds","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The war between the loyalists and the rebels within the TEC, Advent and Vasari continues within the depths of Trader Space. Yet, this sector of the galaxy has far more worlds and far more history than any of the factions are aware. Survival forces each to expand into the unknown, discovering worlds of hazard, wealth, risk, and mystery. Most ominously, the Trader factions have been loathe to expand to these worlds due to the dark myths that surround them.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10864,"name":"Asghan 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10863,"name":"Magic: The Gathering - Arabian Nights","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10833,"name":"Skara","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In a world broken apart by cataclysm, how long can you stay alive?\n\nFight for what’s left in Skara, the first versus fighting game of its kind.\n\nChoose from among five races and join up to 16 players online to engage in close combat. Enjoy the freedom to customize your character’s look, equipment and fighting style. Then prepare for battle, be it for five minutes or five hours.\n\nIn Skara, actual players are the protagonists. Dominate Skara’s arenas individually or as part of warring factions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10821,"name":"Shaman Odyssey: Tropic Adventure","genres":[],"avg_score":0.0,"description":"Protect your villagers from ghosts, pirates, sharks and more. The people of your tribe are disunited for many years now. And although a tropical Laguna seems like a heavenly place to live, not everything is simple. Pirates are getting closer, sharks and surrounding islands, and storms and tornados are threatening peaceful villagers and their families.\n\nIt's up to you to give your best and help your people to reunite and build a new safe place to live.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10820,"name":"ShadO","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"In this unique Tower Defense, you will travel through William’s mind in a colored and dreamlike universe, made of a mix of pieces of memories, emotions and feelings.\n\nWill you be able to drive the fog of oblivion away and help the boy recover his memory? Your many companions’ light will be your best ally in this world distorted by fear and mystery.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/iatjdyytylvs7tzxfbrc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10804,"name":"Safety Driving: The Safety Simulation - Car","genres":[],"avg_score":0.0,"description":"A driving simulator engaging and enjoyable that teaches the basics of driving immersing the player in a detailed and realistic urban environment. A tool widely used today by schools, government, driving-schools and health associations.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10785,"name":"Royal Defense 2","genres":[],"avg_score":0.0,"description":"Royal Defense - Invisible Threat is a Tower Defense game for PC, mobile and other platforms. Follow the exciting story of the dwarven kingdom's eternal struggle against the troll hordes, who want only to crush the dwarves and claim their territory.\n\nUnique units, a wide range of structures, spells, gold and various resources make this the TD game that you will return to again and again.\n\nEvery single-screen level sees the player's headquarters assaulted by wave after wave of troll forces.\n\nTo defeat these monstrous hordes, you must construct defensive towers and units and learn to wield powerful spells. Tap anywhere you like for a handy pop-up menu listing all the units and structures you can build in that location. Tap existing structures to see how you can upgrade your forces with ever-more powerful improvements!\n\nAll your towers and units have specific stats: Damage, Fire rate, Damage radius, Damage type, as well as various other features, such as enemy slowdown and Damage Over Time.\n\nEach level also brings new units and structures to help you fight the troll menace. You’ll never be lacking for new and exciting ways of decimating those nasty trolls!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10781,"name":"Rockefeller: The Black Gold","genres":[],"avg_score":0.0,"description":"Rockefeller: The Black Gold makes you become the ultimate Oil Mogul. Take over the role of an oil industrialist and search for oil in different places all over the world, build pipelines, refineries, petrochemical plants and factories.\nIt is up to you to satisfy your investors! Research various technologies that give you the ability to manufacture new products, reduce the cost of transportation and boost the development of cities.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10778,"name":"Road Works Simulator","genres":[],"avg_score":0.0,"description":"You are responsible for the streets and roads in your city. With so many people in a city, there is always the need for new living space, which has to be opened up with roads. In addition, the residents ask here and there for wider and faster roads. Under certain circumstances you get contracts for plaster work, the creation of pedestrian and bike paths, or the replacement of gas, water and power lines in existing roads.\n\nFor a realistic representation, a 3D graphics engine is used, which represents the events at any time clearly and realistically. Step by step the player gains experience and thus more extensive special orders. A level is considered to be solved, if within the specified time, the given tasks have been fulfilled. But be careful, unpredictable events always affect the current happenings.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10777,"name":"Road Construction Simulator","genres":[],"avg_score":0.0,"description":"They are the unsung heroes that keep the world's traffic flowing. Referred to by their brethren as the \"boys and girls of the black stuff\" these dedicated engineers work all year round, through all weathers to repair and construct the road network.\n\nPut on your hard hat and head for the highways! From repairing country lanes, to constructing huge motorways your engineering skills will be put to the test in this ultra-realistic simulation.\n\nLay out the traffic cones and punch through the concrete with your pneumatic drill as your new roadway starts to take shape. All of the tools of the trade are at your disposal including an asphalt planer, steamroller, marking machine and the whole gamut of machinery required to transform a building site into a super smooth motorway.\n\nAs your skills grow you will be able to embark on a range of diverse missions. Country roads, pothole repairs, lane widening and motorway construction are all in a day's work for the hard hat highway heroes!\n\nAll of the equipment has been painstakingly recreated in full 3D to provide the ultimate in accuracy, complete with detailed cabs and sound effects. From the initial excavation to the satisfying conclusion of laying the black stuff - the smooth layer of tarmac that signals a job well done - we promise an engineering experience so authentic you can almost smell the bitumen!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10757,"name":"Police 1013","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The aim of Police 1013 is to bring the good guys into focus. This game isn’t for cowboys. It’s not about how many kills you get or how big the explosion is. It’s also not about the Police being mere cannon fodder as is the case with just about all games on the market. It’s about being an effective Police Officer in a City like most cities around the World. It’s about doing things the right way. It’s about showing how difficult it is but also how rewarding it is to be a good Police Officer. \n \nWe want to continue to honor the work Police Officers do. This game brings with it the opportunity to feel what it’s like and to experience what Police experience. Our mission is to show Police for what we believe they are; real people doing a real job. On that Journey there will also be massive highs for our players to really enjoy the experience. \n \nWhen ever you ask a Police Officer about their job, they say “I love what I do, I love being a Police officer”. This game needs to have the same effect. We want Police fans to LOVE jumping into their patrol car and to experience a whole new open world whilst waiting for thousands of random events to pop up at a moment’s notice.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dvmj61whzyhmlkmvaq6r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":10756,"name":"Real World Racing RWR: Z","genres":[],"avg_score":0.0,"description":"RWR: Z is a zombie-themed DLC for the top-down racing game Real World Racing.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10739,"name":"Microsoft Train Simulator 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A planned sequel to Microsoft Train Simulator that was cancelled in 2009.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ecxm1g9txxpgnhzecrot.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10726,"name":"Pro Riders Snowboard Extreme Edition","genres":[],"avg_score":0.0,"description":"Turn your PC/Laptop into the ultimate snowboarding experience with the new Pro Riders Snowboard Extreme Edition. Use your computer’s webcam to control the game with your body. Swish and move as if you were on the real slopes. Use touchscreen controls for your Xbox controller for those more relaxed moments. No matter how you play, you can be sure you’ll always feel like You’re in the Game!\n\nRealistic settings bring you the fun of international competition while enabling exhilarating gameplay for the most hardened snowboarding veterans and newcomers alike. This family-friendly sports game is as intuitive as it is fun with some of the simplest controls ever designed. Pro Riders Snowboard features real-world physics electrifying gamers with tricks, jumps and grinds like you've never seen before. Show off your talents by unlocking achievements. Play with family and friends in a race to the bottom of the hill or to see who can do the fanciest footwork. Experience the most intense ride of your life in this winter's most anticipated snowboarding game. Pick up your copy today.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10698,"name":"Pinball FX2: Paranormal","genres":[],"avg_score":0.0,"description":"As a paranormal detective, your job is to investigate mysterious and supernatural phenomena. You'll have your hands full with hauntings, weird creatures, and inexplicable lapses in the laws of nature! Even the silver ball is not immune to the erratic forces at work within this table.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10695,"name":"Pinball FX2: Epic Quest Table","genres":[],"avg_score":0.0,"description":"It is the sworn duty of every knight to seek out evil, defeat it, and take its stuff. One such knight is Max, whose enthusiasm for combat is surpassed only by his love of rare and valuable loot.\n\nJoin Max as he battles hordes of evil (or just evil-looking) monsters, rescues a wealthy princess, and accumulates the loot and xp that make good worth doing. If Max suffers a defeat, never fear! He will return in the next game with all of his hard-won loot and experience levels intact.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7vou.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10694,"name":"Pinball FX2: Civil War Table DLC","genres":[],"avg_score":0.0,"description":"The controversy over the Superhuman Registration Act has led to the unfathomable Super Hero Civil War. Choose between Iron Man, who leads the SRA's supporters, and Captain America, who sees it as a threat to personal liberties, as you assemble your team and experience one of the most dramatic conflicts in the Marvel Universe.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10666,"name":"Bodycheck","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Bodycheck is a medieval sports game for PS Vita with no rules against foul play, magic powers, and up to four teams on the pitch at once. It's fully multiplayer too, yes - up to four players locally, or head-to-head across the wider internet.\n\nPunching, scratching, and general unnecessary roughness are all actively encouraged during play. Just remember to score more points than your opponents.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7yzb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Vita"}]},{"id":10638,"name":"Old Village Simulator 1962","genres":[],"avg_score":0.0,"description":"Have you ever wondered how farming looked like 50 years ago?\n\nNow you can check it out! Old Village Simulator will take you back in time to mid sixties, so you can sit behind the wheel of vintage tractors and harvesters.\n\nYou'll also participate in many unique events to see, who's the fastest in ploughing and seeding the field, baling straw, harvesting wheat or mowing grass. There are even tractor races! But you have to pay attention - older machines required much more precission and skill from their operators.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10636,"name":"Ocean City Racing","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Ocean City Racing is an open world driving game powered by Unreal Engine 3. OCR features the biggest, most detailed and alive open world city , advanced driving physics and highest quality visuals ever seen in a low price indie driving game. Featuring a free roam , time-trial and a race mode on a massive environment.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co86fd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10599,"name":"Night at the Grindhouse","genres":[],"avg_score":0.0,"description":"In a world that wouldn’t allow them to survive, an entire cast of clichéd combatants meet one fateful night and unleash bloody carnage on their equally-contrived counterparts in this year’s smash hit, The Showdown Effect. Filmed in special 2.5D RenderVisionScope, The Showdown Effect’s multiplayer mayhem blasts its way from the silver screen to your home computer.   Finishing off this unique double feature is one of the most sadistic, diabolical, sinister tales ever told. Three heroic adventurers , in search of fame and fortune, travel to a mysterious theme park overseer – the mythical Dungeon Maestro. Join forces with two of your doomed friends and attempt to take down the treacherous Maestro. Or play the role of the Maestro himself and terrorize the hapless human-controlled heroes. You can’t escape the shock, the terror, the pure insanity of...Dungeonland.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10597,"name":"Nicky Boom","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Nicky looks like a common little boy. But as we said, you can’t judge a book by its cover.\n\nIndeed, Nicky is far from being an ordinary boy. Through out both games in this pack, you will discover a Nicky eager to live adventures and to save the world from evil forces.\n\nIn the first opus, Nicky will be on his way to save his grand-father from the crual witch Zoldrane who locked him up in a really dark keep, to drag from this old man the secrets of his tribe. In the second game, facing monstruous creatures, Nicky will try to get his country away from darkness’ influence.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10590,"name":"Naval War: Arctic Circle - Operation Tarnhelm","genres":[],"avg_score":0.0,"description":"Operation Tarnhelm is the first expansion for the unique real-time strategy game Naval War: Arctic Circle. Named after the mythical helmet of Norse mythology that makes its owner invisible, the new scenarios detail daring attacks. Experience NATO’s offensive deep in Russian territory, and Russia’s devastating counter-attack on Northern Europe. Four additional units will provide new tactics and possibilities. This expansion provides unprecedented firepower with stealth aircraft and new warship designs. Who will rule the waves in the 21st century?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10575,"name":"My Landscape","genres":[],"avg_score":0.0,"description":"My landscape in an original and funny game, Favoring the creativity and the reflection which the scenario is changing in a magical and peaceful universe. It addresses a wide audience and from an early age.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10559,"name":"MorphShift Wars","genres":[],"avg_score":0.0,"description":"Morph Shift Wars… take a dogfight game; add a bit of sci-fi; sprinkle in some custom shape-shifting aircraft; pour in lots of enemies; sit back and wait for the carnage.\n\nCombining the very best of sci-fi and aerial dogfighting gameplay, MorphShift Wars delivers a totally new gaming experience. Create your very own shape-shifting vehicle and control both the sky and the ocean.\n\nBuild your own bespoke aircraft, from mainframe to wings. Dominate the skies then watch your aircraft morph in to a silent underwater killing machine as you chase your enemy in to the darkest depths of the ocean.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10534,"name":"Mah Jong Quest III","genres":[],"avg_score":0.0,"description":"Make life choices that escalate you through battles with dragons, unrequited love, a jilted career path, and much more. The Quest for Balance unfolds based on the decisions you make. When it's all over, you just may find inner peace and happiness in Mah Jong Quest 3.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10533,"name":"Mah Jong Quest II","genres":[],"avg_score":0.0,"description":"The world has fallen into a state of imbalance, splitting our teenage hero Kwazi into the male Kwazi White and female Kwazi Black. You must help the Kwazis advance through the elemental Moon Gates by solving Mah Jong puzzles. Make your way through eight mystical lands, matching pairs and triplets like never before. Only you can restore harmony to the world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10529,"name":"Fault Milestone Two Side: Below","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"From the visual novel series \"fault,\" comes the latest in the series after a six-year hiatus!\n\nWhile keeping the emotionally-charged storyline, the adventure elements and visuals are renewed and enhanced from previous titles!\nEnjoy the new world of \"fault\" as a cinematic adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co321u.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10523,"name":"Lost City of Z","genres":[],"avg_score":0.0,"description":"Explore the exotic rainforest to find valuable clues and follow the trail of a missing National Geographic researcher! Using the tools you discover along the way, trace the paths of past explorers who searched for an ancient civilization and find the missing adventurers. Use your Hidden Object skills to decipher mysterious messages and uncover the trails of generations of explorers in Lost City of Z.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10520,"name":"Lords of Football: Eastern Europe","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Now you can play in one of the three following Eastern European countries: Poland – Play the Polish National League and the Polish National Cup competitions. Russia – Play the Russian National League and the Russian National Cup competitions. Ukraine – Play the Ukrainian National League and the Ukrainian National Cup competitions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10517,"name":"Little Kingdom","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"You are the leader of a small kingdom aiming to conquer this serene world simply by strengthening your economy (NO war or killing!) Expand your influence, gather new resources and construct stronger buildings to strengthen your position. With a healthy dose of strategy coupled with bribing or absorbing your enemy’s strength; you can claim the kingdom in your name!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2qks.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10508,"name":"Legacy Tales: Mercy of the Gallows","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Follow the trail of clues to solve this untold story in Legacy Tales, Mercy of the Gallows. Meet the ghost of a sad, young woman who needs your help and start this pirate adventure! Why is she warning you about the captain and who is “the Raven”? Go inside the castle, find your way to the mighty battleship, the Batavia, and unravel the mystery!\n\nStrange things happen in and around the dark castle at the Dutch coast. Find out how William van der Decken, famous for his battles against pirates, and his lovely wife Isabelle vanished. What happened to her and why was the captain found dead, dressed as a pirate?\n\nStart now and puzzle your way through this exciting adventure filled with breathtaking scenery, classic hidden object games and original mini games.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/p0mk0bwbl99tshia59r2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10506,"name":"Laxius Force: Heroes Never Die","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10505,"name":"Laxius Force III: The Last Stand","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The absolutely stunning finale of the trilogy! Random is finally going to meet the Grand Commendanter! What will be the outcome? Will the Laxius Force or the Order win the war? Take control of Random, Sarah, Luciana, Coryool, Wendala, Xander, Brussian and many, many more characters, and find out!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zx7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10499,"name":"Woodcutter Simulator","genres":[],"avg_score":0.0,"description":"The player assumes the role of a timber worker who slowly works his way up from small to huge orders, where he even has to fell mammoth trees. You receive orders for the safe removal of trees in gardens or parks, the preparation of building sites and the production of firebreaks. In addition to the tree felling you have to take care of the processing, such as debarking or sawing as well as the wood transport to the processing facilities.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kcefwhmcu7ilgnbwjswj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10488,"name":"King's Legacy","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Build your medieval kingdom and protect your people, explore, trade, gather resources, learn magic and spells and enjoy the spectacular full 3D graphics in King's Legacy.\n\nThe fair king died of old age. His people, all over the kingdom, cried and grieved. But finally they wiped the tears from their faces happy in the prospect of the dead king's son, replacing his father on the throne. But, suddenly, from the shadows, the dead king's evil brother emerges. He has waited his chance to claim the throne for a long time. A panic and fear spread among the people.\n\nThe young prince will protect his citizens by any means necessary, even if it means fighting his own uncle! No one will harm his people, no one will bring misery and pain to his people.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ksyqihj8nogdfiz4n6bo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10478,"name":"Judge Dee","genres":[],"avg_score":0.0,"description":"A strange mystery is hovering over the small town of Wu Ling. Even as the population is struck by the curse of the God of the City, the mayor's son, Chen, is found dead on his birthday. Everyone turns to the famous Judge Dee in the hopes he can solve the mystery and put an end to the fate that has befallen them.\n\nPlay the role of Judge Dee in an exotic and mysterious adventure set in ancient China, and take part in a rich and detailed story written by the scriptwriter of the Nancy Drew series.\n\nA world with exceptional graphics, in which you will have to find all the clues of the investigation in 40 locations, with 30 hidden objects scenes and 25 puzzles to solve.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/fm62zb6acnhmcmxlqwkx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10476,"name":"Jewel Quest Solitaire 3","genres":[],"avg_score":0.0,"description":"Rupert and Emma’s friend, Ratu, has discovered a valuable tablet in the ruins do an ancient civilisation. Little does he know that the find is just the beginning. When his beloved assistant Yumi is abducted, Ratu is propelled into a treacherous game of cat-and-mouse.\n\nTravel with Ratu in this Jewel Quest Solitaire sequel, and experience compelling Solitaire layouts and addictive new Jewel Quest boards. Fresh features and power-ups, plus 100 boards of combined play, will make Jewel Quest Solitaire III feel brand new again!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10469,"name":"Jagged Alliance: Back in Action - Shades of Red","genres":[],"avg_score":0.0,"description":"It's time to get \"Back in Action\" with the new Jagged Alliance \"Shades of Red\" add-on content. The nefarious terrorist Ante Silevic has captured an atomic weapon and plans to attack a meeting of the world leaders in Eastern Europe. Three hardened mercenaries are our only hope to save the world from total chaos. But in an unfortunate turn of events, Fox is captured by Silevic's henchmen before the mission even starts. Can you manage to free Fox, complete the mission and save the world?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kvg719dksukqcsijykei.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10419,"name":"Hunter's Trophy 2","genres":[],"avg_score":0.0,"description":"More complete, fun and realistic than ever, the Hunting Challenge series has earned a reputation as the best hunting simulation for consoles. \n\nRealistic animal behaviour, a variety of environments, weapons, animals, hunting plans, equipment and skills to unlock, online leaderboards, training in shooting at fixed and moving targets… all are brought together to offer a unique gaming experience which will delight experienced and novice hunters as well as players just looking to experience something new.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10416,"name":"Hostile Makeover","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Solve a fashion murder mystery in this unique Hidden Object game! The world famous supermodel Amanda Manville has been murdered! Help smart and sassy Lacey Smithsonian investigate nine quirky suspects to find the killer in Hostile Makeover. Explore Washington DC, searching for clues and interviewing suspects. Along the way, collect and wear new fashions that grant special sleuthing abilities to crack the case!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lvyppwhwnfusrqoihxwg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10412,"name":"Hidden Mysteries: The White House","genres":[],"avg_score":0.0,"description":"Take a tour of one of America’s most historic and important landmarks while enjoying hours of educational and entertaining hidden object gameplay. Unravel the secret history of the White House and uncover ancient conspiracies in this enthralling puzzle adventure – Start your journey today!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10409,"name":"Herod's Lost Tomb","genres":[],"avg_score":0.0,"description":"Explore the wonders of the biblical King Herods lost tomb in this stunningly scenic Hidden Object Game! Follow the intrepid eye of National Geographic as they recreate the mysterious life and death of one of historys most infamous rulers! Thrill to exciting footage from the National Geographic television event as you hunt down elusive hidden objects and test your mettle with challenging mini-games. Delve into National Geographic presents Herod`s Lost Tomb today!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10405,"name":"Heavyweight Transport Simulator","genres":[],"avg_score":0.0,"description":"As a haulier focused on heavy transports there is no transport problem you can’t deal with. Whether \"normal\" heavy cargo or loads of more than 400 tonnes (800 000 pounds), you transport each single freight safely to its destination. Powerful tractor units in different classes of load capacities and the required, matching semi-trailers are loaded in delivery order. Even in the event of special transports with unusual and challenging dimensions you keep cool and calm and know exactly how to remove obstacles, such as signs and stones efficiently from the road.\n\nGood planning is the basis for a smooth work flow. Therefore careful preparation of the routes, precise time management and the gauging of loading and unloading facilities are among the routine tasks of your team. But only if you are aware of all the possible challenges will you be able to work uninterrupted!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10396,"name":"Headlong Racing","genres":[],"avg_score":0.0,"description":"Go fast, go furious.. go Headlong! Jump a super car at 100mph, crash a monster truck in a forest, drive a dumper truck through the power station or drive a classic hot rod to street racing victory; it's all here! Get ready for aggressive driving, high speed crashing and crazy exploding fun with vehicles of all different types. Each vehicle has a unique driving style for you to master, in both quick race or career modes. A rock soundtrack orchestrates the blasting as you use nitrous to fuel the ride and ram other racers out of existence in this exciting, all-out arcade racing game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10394,"name":"Hacker Evolution: Hardcore Package Part 1","genres":[],"avg_score":0.0,"description":"The Hardcore Package 1 DLC for Hacker Evolution brings you 2 new levels designed for gamers who like a challenge that is harder than the original game.\n\nIngeniously designed these levels are guaranteed to push your skills to the limit.\n\nOnce again, you take on the Xenti Corporation and try to hack into their high security compound to gain access to their core server.\n\nIt's far from being easy and you will have to use tactics never before used in the game to achieve your objectives.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10378,"name":"Sword of the Stars: Ground Pounders","genres":[],"avg_score":0.0,"description":"Ground Pounders is a hex-based, turn-based strategy wargame. Inspired by classic strategy games like Panzer General, and steeped in the lore of the Sword of the Stars universe, Ground Pounders offers a new generation of gamers an updated taste of turn-based strategic warfare. Best of all, you can play it cross platform between desktop machine and mobile devices.\n\nGround Pounders lets players control an army from one of three factions. Each army is comprised of dozens of different unit types. You will lead your ground pounders across a variety of worlds, increase their experience levels and abilities over the course of three campaigns, and use them to unlock special action cards that can add special effects to single-player games, or to up the stakes in your cross-platform multi-player battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dfx4f8wxqg7ybttltlmh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10361,"name":"Ghost Whisperer","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Ghost Whisperer consists of 2 different stories centered around the characters and themes raised in the hit television series. In Ghost Whisperer, players will take on the role of Melinda Gordon (played by Jennifer Love Hewitt on the television series) as she responds to the pleas for help from several different spirits who have unresolved issues that must be addressed before the ghosts are able to cross over to the other side. Other characters from the series (Melinda’s husband Jim, business partner and friend Delia, Delia’s son Ned, and ghost listener Eli) also play prominent roles in the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/y3lpknz4tkprwcrhxjhk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10330,"name":"Forklift Truck: The Simulation","genres":[],"avg_score":0.0,"description":"Here is your chance to take a seat of a fork truck and move around goods without causing extensive damage! Original forklifts offering a very realistic ride, an authentic physics engine simulates the exact loading of different transport goods. Use your skills to move the forklift carefully in the full 3D environment, without harming any container or barrels. Different scenarios will lead you through confusing warehouses, huge freight terminals and lively harbor districts.\n\nForklift Truck – The Simulation offers realistic first person controls including short area turns and the special multi-level hydraulic lift system. What makes this game special is the variety inside the gameplay and the game modes: A game can last minutes or even hours, it’s totally up to your ability and the missions you are playing, but one thing is for sure: this challenging game will keep you entertained for a long time!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10328,"name":"Football Director","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Choose any of over 200 clubs from leagues across England and Europe and get ready to take your team to league triumph and cup glory. Buy and sell players, hire and fire staff, build and train your squad, then call the shots on match day.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dglnpfxjfaqec5h0obrn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10320,"name":"Find Your Own Way Home","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"For the past few weeks, Ruby has been on assignment with the rock band, REO Speedwagon. Tonight the band’s new album debuts and Entertainment Now will be airing Ruby’s stories from the time she spent with the band on tour and in the recording studio. A star-studded album release party at a fabulous oceanfront estate is to follow, but Kevin Cronin is missing! Use your Hidden Object skills to find the legendary front man in Find Your Own Way Home!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/v2mtmng960flqlaiwlik.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10314,"name":"Farm Machines Championships 2013","genres":[],"avg_score":0.0,"description":"Participate in the ultimate farmers' showdown. Sit behind the wheel of tractors and harvesters to see who is the fastest and most accurate farmer in the competition. Compete in many different events, that require speed and accuracy - harvesting wheat, ploughing the field, bricking the straw and many more. Your tractor is not good enough to win? Upgrade it to gain advantage over your rivals or buy a new one. There can be only one world champion!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hcci6ytxb8h0bkjvze1f.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10312,"name":"Farming Simulator 2013: Official Expansion 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The second official expansion for Farming Simulator 2013 brings a harvest of new content for your game including vehicles and machinery and tutorials to create your own content.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10311,"name":"Farming Simulator 2013: Official Expansion","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Discover the official expansion of Farming Simulator 2013® bringing a lot of novelties to extend and enrich your experience!\n\nAn entirely new American backdrop has now been added to the extensive European environment, which will double the size of the gameplay area in Farming Simulator. Inspired by typical American farms, this new and monumental terrain represents a total change of scene, with new locations, fresh development opportunities for your farm and even bigger fields suitable for the largest agricultural machinery available in the game. The game also offers new vehicles providing a huge selection of farming vehicles the player may use and drive to develop their farm!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10309,"name":"Farm 2","genres":[],"avg_score":0.0,"description":"You're back on a happy farm full of funny animals and plants that require your care.\n\nJohnny and Annie go on holiday to their uncle's farm. Upon arrival they find their uncle sick in bed and decide to take care of his farm.\n\nHelp them out and see how the small farm grows into a big family business. Buy new pens and upgrade already owned. Then plant new plants or buy animals, so you can produce more goods and deliver more orders to a nearby town.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co40l0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10308,"name":"Fantasyche: Mike","genres":[],"avg_score":0.0,"description":"Journey to the land of o'Fabrica; a fantastical land enriched with ancient majiques and powerful kingdoms.\n\nSet both in the real world, and in the majiqual land of o'Fabrica, you play as Mike; a young man who uses this fantasy realm to deal with manifestations of his own mental afflictions.\n\nTeam up with manifestations of Hope, Faith and Determination in an effort to defeat Mike's Self-Doubt, Grief and other negative emotions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10276,"name":"Endless Space: Disharmony","genres":[],"avg_score":0.0,"description":"The Endless Space: Disharmony expansion will bring many enhancements and additions for Endless Space players. A tenth faction, known as “The Harmony”, basically consisting of living rock, will make its appearance, along with its unique play style and objectives. Space battles have never been more intense, with the addition of fighters and bombers, battle formations, a new targeting system, a redesigned weapon system and enhanced planet invasion mechanics. Revamped AI opponents will now offer vastly more unpredictable and cunning behaviour to make the Endless Space even more dangerous.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10244,"name":"Dreamatorium of Dr Magnus","genres":[],"avg_score":0.0,"description":"The town doctor Macario Magnus has lost his wife and daughter in an accident where their car has fallen from the bridge into the river. He finds her wife’s body in the river, buries her and retreats from the life of a doctor. The daughter’s body was never found.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10205,"name":"Star Wars: Return of the Jedi - Ewok Adventure","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Star Wars: Return of the Jedi - Ewok Adventure, also known as Revenge of the Jedi: Game I is a cancelled 1983 shoot 'em up video game based on the Star Wars: Return of the Jedi film. The game was developed by Atari Games and to be published by Parker Brothers on the Atari 2600, Atari 7800, ColecoVision, and Intellivision video game consoles.\n\nAlthough it was completed, the game was never released for sale, as the marketing department of Parker Brothers considered the controls too difficult to master. A prototype cartridge surfaced in the early 2000s.\n\nIn Ewok Adventure, the player takes the role of an Ewok in the hang glider corps with the mission to destroy a shield generator of the Imperial army. The player can control a hang glider with the joystick and has to evade enemies. Depending on the game mode, the player can either make the hang glider climb and decent by pulling back and forth the joystick, or he can reverse the vertical directions. Hitting the ground results in a game over. Furthermore, the player can pick up rocks to drop on enemies when flying over them.\n\nOnly one physical copy of Ewok Adventure is currently known to exist. Larry Gelberg, designer of the game, gave the only known prototype of the game to his son in the early 2000s, who later sold the game for $1,680.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1piv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"},{"id":0,"name":"Atari 7800"},{"id":0,"name":"ColecoVision"},{"id":0,"name":"Intellivision"}]},{"id":10202,"name":"Lock On: Flaming Cliffs 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/yfrkcrlq6zf85kt4ctsz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10185,"name":"DieselStormers","genres":[],"avg_score":0.0,"description":"DieselStormers is a roaring run 'n' gun for up to 4 friends in co-op multiplayer mode with RPG elements, procedural level generation and a combinatoric weapons system that lets you make your own guns from a huge number of looted parts.\n\nThe game is set in a medieval metropolis where diesel-powered Knights clash with the Orcs for control over the city districts. It bellows and clangs with smoke and steel. Lightning arcs across pits of bubbling goop, and jet-assisted assaults tear through the streets for pure awesome carnage!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10179,"name":"Deluxe Hotel Imperium","genres":[],"avg_score":0.0,"description":"Who does not dream of luxury and wealth? In “Deluxe Hotel Imperium” this dream is within one’s reach. Start as a small hotelier with a bed and breakfast and rise to an international economy magnate with deluxe hotels all across Europe. The road to an own emporium is stony and many obstacles occur. Schedule wisely, manage with great skill and keep the hotels profitable. Only the right strategy leads to the top of an international successful hotel chain.\n\nBefore the player can dream of luxury and wealth, he starts with a badly suited small hotel in one of Europe’s metropolises. First, a cheap property must be bought to build the first hotel. The player can choose properties in three different sizes to place one of nine different hotels onto the ground. Once the quality of services fits to the needs of the customers, the hotel will be profitable in no time and the first expansion can be done. With this approach, the player is able to transform a bunch of small hotels into a hotel chain. But be careful, who expands to fast will go bankrupt in no time.\n\nAs soon as the first hotels are profitable the international market is waiting. Twelve Metropolises in whole Europe are waiting for the player. The player can buy properties, build hotels and expand his emporium in every single metropolis like Berlin, Munich, Paris or Monaco.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10176,"name":"Deep Eclipse: New Space Odyssey","genres":[],"avg_score":0.0,"description":"Deep Eclipse: New Space Odyssey is the ultimate space thriller in the best tradition of the genre.\n\nYou're the pilot of a space fighter, accidentally catapulted into a parallel universe populated by hostile alien creatures; and they're not happy to see you! To get out of this hell, do your best, to destroy hordes of enemies.\n\nBe prepared to be part of this world, if you want to survive. Develop and upgrade your space fighter with a wide range of role-play features.\n\nDestroy to survive! Survive to return home!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10115,"name":"Criminal Minds","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Join with the BAU to solve two thrilling cases! Hunt for clues in 25 tricky and beautiful Hidden Object Scenes. Get closer to the truth as you work with JJ, Hotch, Morgan, Prentiss, Reid, Garcia and Rossi as you interrogate suspects with special Criminal Minds Profiling Mini-games! Use the information you gather from over 40 taunting puzzles and codes to find the criminals as they try and lead you astray!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/zoatcwrzxkcmbkhmrplw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10086,"name":"Chronicles of a Dark Lord: Episode 1 Tides of Fate - Nightmare Vision","genres":[],"avg_score":0.0,"description":"Delve into the mind of Magus Drakhen Lee as he becomes trapped within his own fragmented dreams.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10081,"name":"Cherry Tree High!! My! Girls!","genres":[],"avg_score":0.0,"description":"Cherry Tree High I! My! Girls! is the sequel to the popular slice-of-life adventure game Cherry Tree High Comedy Club. The game picks up the story where Cherry Tree High Comedy Club left off, but this time as a kinetic (single story branch) visual novel that adds new areas, new music, and three new characters to the roster!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/clfxjhvhue9exbnanf2f.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10079,"name":"Chernobyl Underground","genres":[],"avg_score":0.0,"description":"The player is one of the mercenaries sent into the Zone. Officially he is to test the radiation levels around and inside the Plant. Unofficially he is to test the latest in the illegally modified combat technology. Since he is the first who may make it alive through the Plant interiors, his mission has been handsomely paid for by the Death TV - and they hope for a good show, paying extra for every kill - the more gruesome, the higher the bid. The game contains a very helpful and workable HUD with several cool features - energy shield, enemy detection, night vision and time slow-down. It also features 2 different gameplay models. Not different by mechanics (this is similar), but much different in how the player perceives it. Fighting outside, the combat is dense and fast - against many opponents. Inside the Dome it is dark, creepy, with horror sounds and stenchy atmosphere.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ilzlgkcuntskrb49wua2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10072,"name":"Caribbean!","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Caribbean! is a mix between an economic strategy game and an open-world RPG, set in the pirate era of the XVII century's Caribbean region. The game is based on the significantly improved Mount & Blade: Warband engine. Caribbean! lets players decide their own role and create their own adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/jfvnfzr3szqczgua9clr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10066,"name":"Bungee Jumping Simulator","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Based on the motto ‘do not just watch – participate’, the Bungee Jumping simulator offers countless venues - from the ordinary crane above bridges and dams to buildings and even hot-air-balloons.\n\nWith the increasing degree of difficulty and experience of the player the jumps take place in ever higher positions. Those who show the most beautiful jumps and even perform combos (sequences) will be rewarded with high ratings.\n\nAn additional fat bonus can be racked if you go for a touchdown, where you slightly touch the ground or water. In higher levels you even have to determine the cord type and the length of it yourself. But take care - those who act recklessly live dangerously.\n\nThe game provides a global highscore list due to which players can compete in all classes with their remote competitors. The motivation doesn’t dwindle, as there are daily, weekly, monthly and eternal highscore lists.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dltggulbcink3jfnirjc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10051,"name":"Blake & Mortimer: The Tables of Babylon","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Explore, enjoy and think! This is the key formula of Blake and Mortimer & Tables of Babylon, an exciting adventure amusement full of mini-games that will lead to the search of the first origins of writing in ... -3200 BC in the Sumerian empire.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uhfzlhivxowbeb3rvnpv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10042,"name":"Battlesheep","genres":[],"avg_score":0.0,"description":"The sheep’s civilization has survived a horrible catastrophe but now it suffers from civil strife and wars over territory. It’s useless to rely on justice cause everything here is being resolved by brutal force of explosives. You have a whole lot of enemies, they are aggressive and tireless but who says that there’s safety in numbers?\n\nYou are right in the center of violent sheep fighting so just grab the nearest bomb and throw it in your enemies while they grow in number with each new level. Sure you can choose the best level of complexity for yourself but don’t count on it to save you cause this game is for life-and-death.\n\nDon’t let the colorful graphics and nice background music fool you, this is serious, you have just one life and many enemies with a single goal to destroy you. To make this unequal fight easier on you, use bonuses like first aid box, vest and accelerator, and your victory on each level will increase your score so that you can show it off to your friends in OpenFeint.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10025,"name":"Basketball Pro Management 2013","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Basketball Pro Management 2013 is the perfect mix between management and basketball. Become the coach of your favorite team and bring it to the top!\n\nThis results in the management of a multitude of parameters each day: Managing your rosters, trainings, staff management, tactics and even search for new talents!\n\nManagement and tactical aspects of Basketball Pro Management 2013 offer a unique experience in a management game that will delight the finest tacticians as beginners. Indeed, you can create your own systems to infinity (by choosing the positions and actions of each player at every time) and call them before each possession during matches! Enjoy a playing time almost unlimited with the new mode “Create your team” (you can also choose your team among 25 championships) Fight for the title, avoid relegation or win the European cups? Just choose a goal and start playing!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10019,"name":"Babel Running","genres":[],"avg_score":0.0,"description":"Welcome to Babel Running! Your mission: bring as many stones as possible to the Tower of Babel to build the structure that will get you closer to the Gods. Beware of the godly wrath and the numerous obstacles you will find on your way! Improve your score and beat your friends' records on an unlimited journey. And for even more fun? The Bonus mode will spice up the race: intensified rhythm, invincibility, super score multiplier...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pkrmyrcjxsht7n1alnnz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10018,"name":"Babel Rising: Sky's the Limit","genres":[],"avg_score":0.0,"description":"The Humans are defying you once more! Embody a vengeful god and get it over with the waves of heretics who try to build two new towers. Let’s unleash your mighty powers and confront new vicious types of units in exciting exclusive levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/fbbbpsgaarcslndgmofo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10015,"name":"Aveyond 3: Orbs of Magic - Chapter 4: The Darkthrop Prophecy","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10014,"name":"Aveyond 3: Orbs of Magic - Chapter 3: The Lost Orb","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10011,"name":"Aveyond 2: Ean's Quest","genres":[],"avg_score":0.0,"description":"You play as a young elf called Ean who lives in the magical land of the Vale with other Elves. Your best friend is missing but nobody remembers she even existed. The strange happenings in the Vale compel you to journey to the world of man to seek anwsers to this mystery and find your friend.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hh0qc6feexkvu1frykhx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10004,"name":"A-Train Version 3.0: Railway Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10003,"name":"A-Train 9 Version 2.0: Professional Edition","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":10001,"name":"A-Train DS","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":10000,"name":"A-Train 7","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9985,"name":"Arson and Plunder","genres":[],"avg_score":0.0,"description":"Arson & Plunder is a 2D arcade/beat'em up adventure based on the genre classics of the 90's. The classic gameplay has been brought up to speed with the latest developments and trends and is now available on your mobile Apple end devices! In typical beat'em up style, playing an orc or an elf you wade through hordes of enemies out to kill you.   \n \nThe game features beautiful 2D visuals, interactive scenarios and a humorous story. Your objective in Arson & Plunder is to survive over 25 different missions in five difficulty levels. During your adventure you can always switch between being an orc or an elf. This feature makes the gameplay significantly dynamic. The controls are always intuitive and help you to carve your way through an adventure bursting with humor and action.  ","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pntxah6vw5g6gqts5a5i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9974,"name":"A Moon for the Sky","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Send your moon to the highest in the sky! At each new millennium, Astrolunia sees its Moon die and loses the balance of its world. To predict this phenomenon, the people band together to send a new moon in the sky that will restore the ecosystem. Help the residents and send your Moon as high as possible! Attention during your ascent, you will be hindered by various obstacles.\n\nA Moon For The Sky has a simple gameplay: Draw a ligne and that’s all Progressive difficulty through 18 levels, 8 types of obstacles and 5 Bonus / Malus. Customize your Moon and join the Endless Mode to challenge friends and the whole world raising your Moon the highest possible. Will you manage to unlock all levels, winning all the medals and unlock all achievements in the game?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/c4cu5hcogieepaljwvf7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9967,"name":"Alien Spidy: Easy Breezy","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Unlock 3 more challenging “Special” levels, one within each environment.\n\nGo back to the forest and really learn how to spin your web and swing the way gravity intended! Take this with a pinch of salt, as the level is easy to complete but ridiculously challenging to unlock your stars. Do you think you can master this?\n\nVenture through the ponds once more and find yourself avoiding alien fish, spikes and deadly under water plants. This challenge is dedicated to perfection. Will you be able to out manoeuvre the Alien Fish before your protective bubble runs out of energy? Did we mention that once this is done you still have to get all your stars as well?\n\nFind yourself trapped in a cave! Don’t worry though… if the sharp red crystals, poisonous fungus or deadly mosquitos are avoided, you will be just fine! Escape this challenging cave with the help of a large number of power-ups, but no help from re-spawn checkpoints. Can you escape?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9960,"name":"Airport Control Simulator","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"As Air Traffic Controller you will experience the stress, the hectic pace and the satisfaction of landing all of your planes as safely and as quickly as possible. Avoiding collisions at all times, direct planes to their correct landing path and runway, while monitoring their fuel load closely. Your results will be strictly monitored, a score attributed and new airports unlocked – but any accident will result in your immediate firing. Features in Airport Control Simulator.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kr3bekarbwayo2lxctfe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9959,"name":"Airline Tycoon 2: Honey Airlines","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Mamma Mia! Airline Tycoon 2 gains Italian flair with this DLC. Mario Zucchero is back in the airline business, and just like in the good old days, it’s all about power, dough and amore. Play the entire previous campaign plus two new missions with Mario, and learn what’s driven the fiery Italian back to the airline business. As an additional feature, this DLC introduces cargo flights, opening another source of income to aspiring Tycoons.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/g5dpxk3clntixdgbtq3w.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9956,"name":"Airline Tycoon 2: Falcon Airlines","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"He’s back! Siggi Sorglos, synonymous with German diligence, punctuality and cuckoo clocks, returns to the airline business with this DLC for Airline Tycoon 2. Play the entire campaign form the main game plus two brand-new missions with this blonde winner and learn why he has returned from his well-deserved retirement. This DLC also brings the possibility of establishing branch offices in foreign airports and thus receiving access to a larger selection of charter flights. But that’s not enough! For even the popular last-minute counter is celebrating its comeback with this DLC. Whoever reliably fulfills the contracts offered there will rake in a lot more money.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/txrpzibd7dkrpvn84wnk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9944,"name":"Northern Shadow","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Northern Shadow is a first person perspective RPG where you can build and manage your own kingdom. It has both sandbox elements, and a classical RPG story.\n\nThe game starts after the great defeat of the Northern Kingdom, at the hands of an unknown enemy. Some of the survivors have traveled to distant lands in hopes of rebuilding the now fallen kingdom.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/zv7nbbjjgjtz4llrzegn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":9923,"name":"Disrupt","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"In Disrupt you emerge into the cyber warfare world in the role of a hacker who has gained access into the secret governmental operating system called NexOS. The operating system allows you to play the role of Big Brother and control the main cyber-infrastructures of cities. You will be facing choices throughout the game, from hacking police servers for personal gain, stealing research data, framing people to being a Robin Hood of modern time - diverting the dirty money of politicians to the people in need, or just keeping it for yourself. Your decision will have an impact around the environment, making news outlets turn you image into a villain or hero.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co460u.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9922,"name":"Zeta Fighters","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Zeta Fighters is a free-to-play blend between mobile cave shooter and MOBA . Fight online, upgrade your spaceship and work your way to the top. With 15 unique weapons, stunning graphics, and intuitive touch-screen controls, Zeta Fighters makes it easy to jump into quick action-packed real-time space battles no matter where you are.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/c1vwu74gs6iusqf0ascr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9896,"name":"Bionic Girl","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Bionic Girls is a 2D action platformer.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":9873,"name":"Moonrise","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Moonrise combines the deep strategy of a collectible card game with the tactical pacing of a head-to-head fighting game. \n \nThroughout history, the enigmatic event known as the Moonrise has periodically caused widespread fear and destruction. As its corrupting shadow spread across the land, peaceful creatures known as Solari were transformed into savage Lunari, attacking towns and cities for months until the effect faded. In recent times, Moonrises have been rare, sometimes separated by centuries, and their corruption lasting mere days. But that’s changing now, as the cycle intensifies once again, and the world faces an age of danger and uncertainty. \n \nNow it’s time for you to set off on a grand adventure to protect your world and fulfill your destiny to become a master Warden.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2qqi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"Mac"},{"id":0,"name":"iOS"}]},{"id":9872,"name":"Cadalion Online","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Cadalion Online is a 3D MMORPG under development (massively multiplayer online role playing game) that is based on elements, puzzles, hidden passages and platforming with an entertaining combat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":9832,"name":"Topsy Turvy","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ustxmathwi2itu0hmlzq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9729,"name":"Miegakure","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Miegakure is a puzzle-platforming game that lets you explore and interact with a 4D world. The fourth dimension in this game is not time, it works just like the first three: it is a mathematical generalization.\n\nYou see three dimensions at a time and at the press of a button one of the dimensions is exchanged with the fourth dimension, allowing for 4D movement.\n\nYour ability to move in the fourth dimension in addition to the usual three allows you to perform miraculous feats like seeing inside closed buildings, walking through walls, stealing objects from closed containers, binding two separate rings without breaking them, etc...\n\nThese actual consequences of the mathematical formulation of 4D space have been thought about for more than a century (in the 1884 novella Flatland for example) but it is the first time anyone can actually perform them, thanks to the video game medium.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2fal.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":9725,"name":"Izle","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A procedurally generated action RPG about resource gathering, rebuilding a lost world with terraforming powers, creating new islands and fighting off evil forces. Developed by former Ubisoft veterans.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aflpiv6yhukyf9na4jgv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Wii U"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":9687,"name":"Little Devil Inside","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Little Devil Inside is a truly engaging 3D action adventure RPG game where you are thrown into a surreal but somewhat familiar setting with men, creatures and monsters to interact with, learn and hunt – survive and discover the world that exists beyond.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2jfa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":9679,"name":"Orcish Inn","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Orcish Inn is an orc tavern simulation game. You raise crops, brew beer, create your tavern and serve your orcish guests. My name is Steven Colling, I'm from Germany and I create this game on my own with the help of Tilmann 'headchant' Hars, who is responsible for sound effects and music. I enjoyed farming and business simulation games as I was a child and I want to share my passion for calm and deep, strategical experiences.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mvxourlziuvywuuift73.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":9650,"name":"Soul Orb","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"DOS"}]},{"id":9612,"name":"Perfect Stride","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Perfect Stride is a first person skateboarding game for Windows & OSX based on old school FPS movement exploits (Quake jumping, Tribes skiing, CS surfing)","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lulkubmk91my5iwriyyp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":9581,"name":"Dark Eternal: Dissolution","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Several thousand years ago, a great war ravaged all the known galaxies. This enemy, shapeless and seemingly invincible, left nothing in it's path untouched. In desperation, a mag elite from the planet 'Nocturne' cast a forbidden spell that seperated reality into three different realms, in effect, 'locking' this new enemy within one of these realms.\n\nOn that day, a new-born child inherited the power to control and shape the realms as he saw fit, this child would later be refered to in legend as the 'The Eternal'...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qzyu7hx1epsgdktgzvbn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9576,"name":"Family Farm","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Work the farm in this game of 19th century farmsteading and build a home for your families. Clicking cows won't earn you any cash. This is a simulation of a farmstead experienced in stories which span a generation. Keep them fed, develop their skills, and grow their land in to a Family Farm! Enjoy RPG and board game mechanics designed by the creator of dozens of board games.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2k1s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9551,"name":"Oort Online","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/eorklojbipv6vgthr4xv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":9544,"name":"Little City","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xzctht6shmjyfcrzcuhw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9529,"name":"Starsweep","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":9480,"name":"Snowcat Simulator 2011","genres":[],"avg_score":0.0,"description":"Everybody knows the giant vehicles preparing the white tracks for skier. No slope is too steep and no snowbank to huge. As driver of such a monstrosity, you are responsible to prepare the rundowns in a giant ski area. Everyday crowds of people arrive at the peak of the mountain, ready to ski down the tracks on perfect prepared rundowns. It is up to the player to make their wish come true. In order to fulfill this duty, the player must handle snowcats in various sizes. In addition to the rundowns, the player must keep the roads to the ski area clean as well, using the snow blower machine.\n\nThis job is not easy. Strong wind and heavy snowfall exuberates the work on the rundowns. There is only one way to get the job done, enter the snowcat, start the engine and get this monster moving. By day or by night, it does not matter, the rundowns must be prepared before the first vacationers arrive. Lower the shield of the snowcat and smooth the snow or groom. If the weather is getting to bad use the wiper to keep a clear view.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/daifcqm3prbdn5cf9yqk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9466,"name":"Streetdance 3D","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"StreetDance 3D is an action-packed dance game inspired by the recent 3D movie and requires nothing more than your PC keyboard and some musical rhythm.\n\nThe game features stunning motion-captured dance moves (recorded at Pinewood Studios) and music from the film. Try to out-dance your computer-controlled rival at five unique locations. The game includes several difficulty levels and trophies to win. Can you achieve the ultimate reward and earn the 'StreetDance Gold Bar'?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ew54k0dfc7pn3evcrbpo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9451,"name":"Towing Simulator","genres":[],"avg_score":0.0,"description":"You are the owner of a large, very unpopular parking area and an armada of breakdown trucks for large as well as small vehicles. With this kind of work you can make good money, because car owners have to pay a pretty penny to redeem their car. So it's high time to get on the gravy train.\nBut watch out - you have to drive the tow truck yourself and in narrow streets car body damage happens too easily. Such incidents are not only annoying but also expensive. Only those who get their job done quickly and accident-free can expand their business.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kydd5cmuanuutixtlkdn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9434,"name":"Valkyrius","genres":[],"avg_score":0.0,"description":"Valkyrius combines the intense classic arcade action you'd expect from a 2D shoot 'em-up with an innovative warping mechanic that lets you effortlessly weave in and out of enemy fire. Fight across 6 unique stages with unique enemies and huge bosses. Take the weapons of your destroyed enemies and add custom powers to your fighter. Follow the story of Colonel Valterra as her battle to reclaim the Earth for the Space Colonies turns into a war for the future of humanity. Features 1 and 2 player modes, 5 difficulties, boss rush mode, stage select, online high score tables, unlockable concept art and soundtracks.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9411,"name":"Red Baron History","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"In Red Baron History you can play a German or an ally pilot between 1915 and 1918 in the campaign mode, relive legendary battles in the historic mode or pilot the plane you want and choose your enemy, location, climatic conditions… in the single mission mode. Use the mission builder and your imagination to create your own fights! ","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9398,"name":"The Dark Stone of Mebara","genres":[],"avg_score":0.0,"description":"The Dark Stone From Mebara is set in 1924 Massachusetts. You take on the roles of Arthur Pendleton owner of the Pendleton Detective Agency and his two employees – Detective Aloysius Monroe and Professor Webley. The team has come in to procession of an eerie black rock with strange properties. As they try to discover the stones cosmic origins, they find themselves battling against madness, vicious cultists, and unspeakable horrors!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ksvyfkip8s85yxiawiga.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9353,"name":"Delta Force: Angel Falls","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"This game title was cancelled.\n\nIn the near future, set in the north-west region of Central America and spanning both Colombia and Venezuela, “Delta Force: Angel Falls” presents the rural, sparsely populated areas of this exotic locale.  The South American environment provides a premise which is naturally beautiful and full of new millennium conflicts.\n\nMarginal governments, involved in local expansionism, continually scuffle with one another and with major global powers. Complicating matters, drug cartels have evolved beyond money to political forces rivaling established governments. Influenced by current events, the game is both topical and novel.\n\nThe sometimes local philosophy of “your enemy is my friend and your friend is my enemy” gives rise to a multitude of ever-changing alliances and conflicts which drive the game’s rapid action. The culmination of the conflict takes place in the Angel Falls area of Venezuela providing both a spectacular setting and a surprise ending.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hu6dzolhxyzzx44ucyg6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":9314,"name":"Youda Farmer 2","genres":[],"avg_score":0.0,"description":"When the mayor calls for your assistance to fight Big Boss, your adventure to help the poor villagers starts by quickly gathering materials to rebuild the destroyed buildings. Rebuild your farm and the villagers’ favorite shops to recover from the evil tricks of a real estate developer trying to take over the nostalgic little village!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dr5t4c9gcjvwm8mfnurz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9313,"name":"Youda Farmer 3: Seasons","genres":[],"avg_score":0.0,"description":"Fight the seasonal weather conditions as you harvest and process farm products to rebuild and resupply the entire village after a horribly destructive winter storm. Build new farms and shops to handle all the takeaway orders and buy tools in the pawnshop to improve your workflow. Save up to build your very own hotel and serve hungry guests your finest dishes. Eventually show off your farming abilities in different challenges during the annual country fair.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kjjcfjel0qmeh41y0la0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9312,"name":"Youda Jewel Shop","genres":[],"avg_score":0.0,"description":"Design the most astonishing bracelets, rings and earrings, serve your customers quickly and turn your very own Jewel Shop into a glittering success! Once you mastered the basic techniques of jewelry design, you go on the journey of a lifetime encountering ‘The Russian’ , the mystical Zen Lady and thieves that try to rob your shop!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/vdnrgsherxopuiw7javm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9304,"name":"Youda Safari","genres":[],"avg_score":0.0,"description":"Give tourists a once in a lifetime holiday experience as you guide them past rebellious rhinos, hilarious hippos and much other wildlife in your own safari park! Groups of enthusiastic and eager safari tourists depend on you to show them the most exotic animals in their natural habitat when they book a safari. Experience the beauty of wildlife when you go on one adventure after the other.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kfg6ftopjjhwo1qcqugm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9303,"name":"Youda Survivor","genres":[],"avg_score":0.0,"description":"Survive like a real Robinson Crusoe after stranding on the funniest and most mysterious island! Depend on some basic tools and the local wildlife to survive. Find out how to escape this island while you fight off angry pirates and work together with an exotic native tribe under the scorching sun. Prove that you have what it takes to survive anywhere and under any circumstance.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/llqinkaflgkk4gn8fv4a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9302,"name":"Youda Survivor 2","genres":[],"avg_score":0.0,"description":"Survive an exotic adventure as you work together with a friendly tribe to find a missing talisman! Fight off pirates, harness some magic yourself and be the hero. As you meet exotic creatures, learn new potion recipes and explore caves for hidden treasure, equip yourself with magical tribal marks to improve your chance of survival.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/axzk6hv6hi7lusrhjezu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9301,"name":"Youda Sushi Chef","genres":[],"avg_score":0.0,"description":"Quickly serve sushi-hungry customers the right dishes to slowly build up a restaurant empire! Use memory and skills to create the right pieces of Asian cuisine. Become everyone's favorite sushi chef by decorating your restaurant, performing knife tricks or serving some sake to waiting customers. Stay focused to reach your daily targets even when reservations and takeaway orders might distract you. Keep the sushi coming to earn nice bonuses and extra money.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/tunuzesugncpqy7512y1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9300,"name":"Youda Sushi Chef 2","genres":[],"avg_score":0.0,"description":"Step into the delicious world of Youda Sushi Chef 2, where you put your culinary skills to use. Prepare dishes in 6 restaurants all over the world. Learn mouth-watering recipes from the local cuisines by heart. Serve a 'Diner Delight', the 'Venice Pie' or a spicy 'Tortilla Poncho'. Don’t forget to keep an eye on your supplies and order fresh ingredients on time. Manage your restaurant like a pro.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dcmueotjn6ziukm6rgsx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9252,"name":"Rail Racers","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/peduavvwt51um8tdegcc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9251,"name":"TechnoRun","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9237,"name":"Turbo Finger Swipe","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Swipe your way to victory in this arcade turned 3D action-packed thriller!  \n\n~ Survive ~ \nBattle against time, get points and sick combos as you fight to survive as long as possible! You wont be able to stop swiping in this intense, dynamic level. You'll need to develop ninja-like reflexes if you want to get far in this game.  \n\n~ Enjoy ~ \nExperience a stereoscopic-3D game unlike any that you have ever seen. This game takes full advantage of your screen's 3D capabilities, you wont believe the incredible depth in the level.  \n\n ~ Explode ~ \nAnnihilate the level and reach new high scores with any of the Game's several traps including : \n- The Wormhole (Suck the tiles into a vortex instead of swiping them!) \n- TNT (Blow the crap out of the level!)  Whats Next?  We have a lot more planned for this game that we hope to share with future flightdeck users! This is only the beginning!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mdszv4dmbuxm0s7akw5b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":9217,"name":"Omerta: City of Gangsters - The Japanese Incentive","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Irish mobsters, Ku-Klux-Klan racists, a mysterious business man from the far-east and a beautiful Japanese woman – it’s time for another episode in the life of The Boss!\n\nIt’s a story from a time when love was more important than keeping your cool. In “The Japanese Incentive” add-on, experience an all-new campaign and enjoy a wealth of gameplay improvements. Take on a challenging new AI and set Atlantic City on fire with this brand new expansion for Omerta: City of Gangsters that includes lethal new weapons, expansive maps, engaging characters and more.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qfzr0npyzfdax3x1zfju.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9185,"name":"Windwalkers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/jaa0pybjmrwe3wvy9vlg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9135,"name":"Five A Day","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9114,"name":"Totem Tribe II: Jotun","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aa0xu69r5cdaxy1zt2hc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9055,"name":"The Dead Linger","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The Dead linger is a zombie survival game where you have to scavange goods in order to survive. The Dead Linger have an infected feature where you become a zombie if not treated, however it can be treated with medicine whichs only delays the inevitable. You as a surivor has to defend yourself in a post apocalyptic world that is randomly generated, with hordes of zombies at your tail.\n\nIn january 2015 Sandswept changed their plans of a random generated \"planet sized\" world because they could not pull it off properly in Unity. They switched to UnrealEngine 4 and created a fixed map called \"Pepper Valley\" which is 18x18km. Their goal is to create a realistic and well designed map, which can be modded via Watertower, a house made modding tool with planned workshop support.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pynswdezgghnikoqfjok.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9050,"name":"Time Ramesside","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":9042,"name":"Scale","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Scale is a first person reality manipulation game about exploring environments by changing the size of the objects inside them. Instead of a gun, the player wields a device that can make any item any size. A tree, a wall, an enemy, a passing cloud, even the levels themselves are all \"SCALEable\".\nSpace is relative in the game so progress is as much conceptual as it is physical. The player cascades through different orders of magnitude. Secrets are hidden in levels of understanding and paths are concealed behind unrealized implications.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ukwjvphjewo9hon1xbdt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":8948,"name":"Routine","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Routine is a First Person Sci-Fi Horror title set on an abandoned Lunar base designed around an 80’s vision of the future. Curious exploration turns into a need for survival when a lunar base goes completely quiet. Searching for answers puts you face to face with an enemy who is certain the main threat is you. Discoveries lead to deeper unknowns and the only way to go is forward.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4uk6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"}]},{"id":8627,"name":"A Clumsy Adventure","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/utflqa9msg43qzwwirfe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":8393,"name":"AstroSlugs","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Astroslugs is a puzzle game that is extremely easy to pick up. It features interesting puzzles which require you to fit a number of different shapes upon a board. You fill all available spaces with all the available shapes to solve each one. We have focused on simplifying the role of placing pieces so there is no moving pieces into place and clicking buttons to rotate and flip. Instead, you use your mouse to draw them into place, while drawing over an already present shape will remove it. It's a very simple mechanic which anyone can easily understand. The story of the game revolves around the evil but slightly incompetent Astroslugs who strife to leave their home planet and conquer the universe. Their only problem: They have no source of energy to jumpstart their space craft. Now they turn to you to fix this problem and get them on their way to the stars.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hvpjlvplh1dhv0mtfqqw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":8367,"name":"Jurassic Park : Aftermath","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Aftermath is a one man ,non-profit fan project re-creating a small portion of Jurassic park to explore.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lsp2lc4mqocqaetwwbuj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":8346,"name":"Babylon 5: Into the Fire","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"An ambitious space combat simulator based set in the Babylon 5 universe, it was cancelled within months of its expected release.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5vur.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":8289,"name":"Legacy of Kain: The Dark Prophecy","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Legacy of Kain: The Dark Prophecy was a cancelled Legacy of Kain game – the planned sixth title in the series, and sequel to Legacy of Kain: Defiance. It entered development at Ritual Entertainment in 2004, with consultancy from Crystal Dynamics, but production ended for unknown reasons after three to six months of work. The project was never officially announced by publisher Eidos Interactive, but its existence has been acknowledged by Crystal Dynamics' Chris Bruno and Daniel Cabuco, and by several artists formerly employed at Ritual Entertainment.\n\nEvidence of Legacy of Kain: The Dark Prophecy's development was largely publicized by Legacy of Kain fan and community member, Divine Shadow, between 2008 and 2012, in the form of screenshots of Malek's Bastion in the Legacy of Kain: Defiance engine, and concept art of the pre-banishment Hylden. Kain was to feature as the main character in the game, much of which would take place in the Demon Realm, and would further the storyline surrounding the Hylden, the Hylden Lord, and Janos Audron. Targeted platforms included the PlayStation 2, Xbox, and Microsoft Windows.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3jd2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"Xbox"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":8287,"name":"Deus Ex: Insurrection","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Every nation needs you. Every nation fears you. The five superpowers of the 2020's will rise or fall based on the kind of intelligence only you can deliver. Underground  laboratories, military bases, skyscrapers, capital buildings, embassies... no haven is so well-defended that you can't hack, sneak, bribe, fight, or talk your way in.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/vqp9diyg30d6nwazzbpq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":8062,"name":"Cheetahmen II","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Cheetahmen II wasn't completed and was never officially released. In 1996, however, 1,500 copies of the game were located in a warehouse, and eventually put on sale on the secondary market. All copies of the game were reused Action 52 cartridges, some with a small gold sticker reading \"Cheetamen II\". This cartridge is now very rare and hard to find, though numerous ROM images exist on the Internet.\n\nIn Cheetahmen II the player again assumes the role of one of the three Cheetahmen (Aries, Apollo and Hercules); after defeating a boss at the end of the second level, they switch to the next Cheetahman for the following two levels, as in the Action 52 version. Due to a bug, it is impossible to get to the levels in which one plays Cheetahman Aries without altering the ROM image or experiencing a glitch that very rarely starts the game on these two levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ntu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Entertainment System"}]},{"id":7898,"name":"Cave Fighter","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Commodore 16"}]},{"id":7617,"name":"Shadow Realms","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Shadow Realms is a cancelled action role-playing video game previously under development by BioWare's Austin studio.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/e6lkj8r168e9pr5pc0vf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7613,"name":"The Devil's Men","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Devil’s Men is/was a 2D Point and Click adventure game announced in 2014 by Daedalic Entertainment. It was quietly canceled in the spring of 2018, after years of development.\n\nIt's unclear how much of the game was completed at the time, but there was an art book published, numerous images released, a public campaign to allow fans to add their story to game, and numerous press articles and features.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lcci2tfdco2rzjh3gkdj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7611,"name":"Silent Hills","genres":[],"avg_score":0.0,"description":"Silent Hills was a planned next Silent Hill installment developed by Kojima Productions using their Fox Engine. It was officially cancelled on 26 April 2015.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2863.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":7608,"name":"WiLD","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Wild is an open world action adventure created by Michel Ancel.\"\n\n\"WiLD is set in a lush, expansive world where you will learn and adapt to the ever changing world around you, whilst uncovering the secrets of the land.\n\nAs you would expect from mother nature, the world will continually change through different time of day, weather and seasonal changes.\n\nOnce you get used to your surroundings, you will learn Shamanic abilities in order to take control of animals and exploit their unique abilities to assist with your survival. Discovering the relationship between man and nature is the essence of WiLD. As you can take control of any animal in the world, this opens up huge potential for emergent gameplay that will be unique to you.\"\n\nAnnounced in 2014, information about the game stopped soon after Paris game's week in 2015 but little else followed the news.\n\nSony recently, March 2019, filed a trademark for the game's title and new activity on Facebook ahead of E3 likely means more information to come at the event.\n\nThe game uses Linguini Engine developed by Pastagames Studios in collaboration with Wild Sheep Studio.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1jeh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":7607,"name":"Hollowpoint","genres":[],"avg_score":0.0,"description":"Hollowpoint puts players in charge of secretive Organizations of corporate mercenaries, taking on missions for pay and prestige alongside three other players in online co-op. Developed by Ruffian Games, the team behind Crackdown 2, Hollowpoint brings classic 2D side-scrolling action into the next generation with seamless 3D targeting into stages’ backgrounds.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2igb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"}]},{"id":7575,"name":"The Lays of Althas : Sundered Order","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Lays of Althas: Sundered Order is a single-player, medieval-low-fantasy RPG. The game features an expansive, living world that will evolve and grow by itself, instead of revolving around the player's actions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7568,"name":"NES-Retku: The Game","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ig23hszvputtw3rvbcy4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7522,"name":"0 A.D.","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"0 A.D. is a free, open-source, historical Real Time Strategy (RTS) game currently under development by a global group of volunteer game developers. As the leader of an ancient civilization, you must gather the resources you need to raise a military force and dominate your enemies.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1ngm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":7445,"name":"Marooned: Arcanus Island","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Marooned: Arcanus Island is a hardcore, survival, exploration game in which the player - or players (cooperative) - attempt to survive and eventually escape a lush tropical island. You must build a shelter to protect yourself from both the elements and the dangers that the island presents as well as tangle with everything from the wildlife to the islands natives. With beatiful graphics from Crytek's CRYENGINE, you will find yourself immersed in this intense sandbox survival experience.\n\nEngross yourself within the single-player story: as the last survivor of a boat lost in a storm, you find yourself washed up on the shore of an island untouched by modern society. With a lush and beautifully detailed tropical island and fleshed out underwater corals, you will find yourself experimenting on how to survive the multiple threats each environment throws at you.\n\nIf surviving alone is too much of a strain on your mental state, become the victim of a plane crash in an alternative cooperative story - struck down by the same storm - with up to 4 players with a different outcome to the single-player finale.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xy7o2ln7vaiq0ydgg1xm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7440,"name":"The Settlers: Kingdoms of Anteria","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"The latest sequel in the long running Settlers series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/azsly3jzbhfpajciiexh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":7345,"name":"Scalebound","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In Scalebound, the next great adventure from critically-acclaimed developer PlatinumGames and renowned Game Director Hideki Kamiya, you will experience the journey of a young loner, Drew, who is pulled into the strange, beautiful and dangerous world of Draconis. There Drew is bonded to a fearsome and noble dragon, Thuban, the last of his kind. These two, lone-wolf heroes thrown together by fate must learn to fight as one to defeat the powerful enemies that threaten Draconis, Earth and a vast universe of parallel worlds.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co99c2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":6881,"name":"Assault","genres":[],"avg_score":0.0,"description":"A mothership drops aliens, up to three on screen at a time. There are ten per level. You must shoot them but avoid the items they fire at you. You fire by pushing up on the joystick. Pushing left or right makes you go left or right. If you hold down the button, pushing left or right makes you fire left or right. Later enemies will drop fireballs that chase you along the ground or split in two smaller enemies when shot. If you fire non-stop, you will build up heat as indicated by the green bar at the bottom right. If you overheat or are hit by an enemy, you loser a life. The game is over when you lose all lives or reach a score of 999,999. You get a new man (4 max) every 10,000 points.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co71d9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":6740,"name":"Operation: Black Mesa","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Experience the Half-Life expansion packs like never before. Operation: Black Mesa features reimaginings of both Half-Life: Opposing Force and Half-Life: Blue Shift through two unique campaigns. How will you survive the Black Mesa Incident? It's time to choose.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4idm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":6341,"name":"Dwarf Fortress","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Dwarf Fortress is a single-player fantasy game. You can control a dwarven outpost or an adventurer in a randomly generated, persistent world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2yqt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":6117,"name":"Sega Mahjong","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Mahjong by 1C Wireless LLC","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nd4ym3cjrokiuz0ma73v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":5627,"name":"Nosgoth","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Nosgoth was a free-to-play multiplayer action game, developed by Psyonix and published by Square Enix for Microsoft Windows through digital distribution. It was a spin-off from the Legacy of Kain series of action-adventure games, and took place in its eponymous fictional universe. Nosgoth employed a player versus player system in which each match consisted of two rounds. Teams were composed of characters assigned to one of two races: vampires, designed around hack and slash combat; and humans, whose gameplay was styled after third-person shooters. Between rounds, teams would switch to control the opposing race, and the team which accumulated the most points by fighting their counterparts won the match.\n\nInitially announced in June 2013 following internet leaks, Nosgoth was the first Legacy of Kain-associated game to debut in almost ten years, preceded by 2003's Legacy of Kain: Defiance. Though once intended for release as part of a single-player project, Legacy of Kain: Dead Sun, it was reconceptualized and continued development as a standalone title following Dead Sun's cancellation. When officially revealed in September 2013, Nosgoth attracted negative reception for its conceptual departure from the traditional single-player and story-driven Legacy of Kain formula. Initially beginning its closed alpha and opening up its servers to registered players in late 2013, the game's open beta began in January 2015 and ended in May 2016.\n\nOn April 8, 2016, Square Enix Europe announced that Nosgoth's servers would shut down on May 31, 2016. Nosgoth's official forums also shut down on June 14, 2016.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2quw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":5624,"name":"Fable Legends","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Return to Albion, a picturesque land full of thrilling stories, exciting combat, and high adventure. It’s no surprise that millions of players have visited and adored the welcoming countryside of this once upon a time storyland. “Fable Legends” brings you to a place where history, myth, and folklore are practically the same thing. Of course you’ll also find monsters, villains, and even the occasional disaster, but you shouldn’t take it too seriously. Albion is a unique fantasy land where epic, tragic, and comedic stories all combine for a one of a kind experience.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ptuixqkjbfwd5ipsvkpz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":5149,"name":"Novus AEterno","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Start with a home planet that you can never lose. Expand your control outward across an unlimited universe of galaxies. It’s a sandbox in space where you can build your empire– and influence over other players. Do it anyway you wish: through diplomatic channels, intelligence, military might or economic power. Thousands and thousands of players at one time on one seamless map.\r\n\r\nThe game never stops; even when you are offline. There is always a way to rebuild and recover, and there are always potential new allies and foes ready to engage you on a truly galactic scale. The strategic choices you make today will affect your tactical efforts next week, next month, and even next year!\r\n\r\nEverything in Novus AEterno is completely up to the players who inhabit the universe.There are no pre-set missions and there are no pre-determined linear scripts that every player must progress through. Story arcs in the future will be based on the Lore and will occur galaxy-wide for every player to deal with at the same time, regardless of how long they have been playing. What you learn from the revelations of the story arc, and how you choose to respond to these new developments will determine how your galaxy and the larger universal map progresses.\r\n\r\nControl the galaxy by constructing a huge, near limitless variety of player-designed ships. Your ships have directional armor, weapons, varying speeds and can even be knocked around from explosions. Design your fleet tailored to the way you want to play.\r\n\r\nShip Customization lets you develop the perfect ship for the objectives at hand. Select your Ship Hull, then add weapons, shields, armor, engines and any specialty modules that you’ve researched. The tradeoffs and choices allow special task fleets to be fitted for specific operations or more generalized combat readiness. Will it be long-ranged maneuverable sniper fleets or fast and short-range brawlers…or something else? You decide!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uff5xdbfv4pdn9hegedc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":3318,"name":"Barbie: Vacation Adventure","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Barbie: Vacation Adventure is an adventure video game that takes Barbie on educational field trips throughout the United States of America. It was planned for release in 1994.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co25bn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"},{"id":0,"name":"Sega Mega Drive/Genesis"}]},{"id":3250,"name":"Hellraid","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Join a group of fierce combatants to repel the demonic invasion and close the gates of Hell in the thrilling Story Mode. Master the levels, collect points, and climb up the leaderboards in the highly replayable and challenging Mission Mode, or fight for your survival against hordes of enemies in the nightmarishly hard Arena Mode. Experience this bloody adventure in both single-player and 2-4 player co-op.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co49m2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"}]},{"id":3229,"name":"Retro World","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Retro World takes you on a fantastic journey to a parallel universe where video games come to life. Experience 30 years of gaming evolution, from the early pong days to the modern games of today. Attend midnight game launches or test your skills in competitive in-game tournaments. Read in-game magazines for tips, tricks and reviews, or for the latest rumors about the new Gametron 9000 XZ. Essentially Retro World let's you relive your gaming childhood as a retro sprite.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6w7b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":3137,"name":"A Vampyre Story: Year One","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An episodic prequel starring Mona, the opera-starlet-turned-vampire, and Froderick, wisecracking bat, as they explore more of Castle Warg and Draxsylvania, solve fiendish puzzles, and outwit hideous new creatures.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76xh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":3021,"name":"Terraria 2","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Terraria 2 is the sequel to Terraria.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":2942,"name":"Project Reality 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Project Reality contains some of the deepest cooperative gameplay seen in video games today and is designed to promote both technical realism and teamwork without sacrificing accessibility in doing so. The result is a virtual battlefield that continually proves itself to be both enjoyable and intense to all manner of players, whether they be military enthusiasts or gamers looking to experience an intense and challenging firefight with friends where teamwork is just as important as a quick trigger-finger.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xak6lvhyixvbnvrduxwe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":2387,"name":"Thrill Kill","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Hell Hath No Fury Like... THRILL KILL\n\nEight fighters, eight souls. Each has died and descended into Hell, except it's not the classical Dante's Hell. It's a modern day Hell based on the real world of today's deviants. The characters are the physical manifestations of their mental illnesses or vices on earth. Marukka, the God of Secrets, is bored and decided that it would be fun to pit them all against each other with the prize being rebirth. Each character is battling for nothing more than self-preservation and the hope to be born again.\n\n-Fast and furious 4-player deathmatches!\n-Battle to the death in chambers of horror like he Insane Asylum, the Slaughterhouse and the Morgue!\n-Face 11 malformed freaks including a Psycho Redneck Cannibal, a Maladjusted midget on stilts, and a Queen Demon straight from the depths of hell!\n-Gang-up and cooperative moves never before seen in a 3D fighter: Hold your opponent while others beat the pulp out of him!\n-Advanced AI that will force you to constantly come up with new solo and team moves!\n-One of a kind Kill Meter that promotes offensive game play!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3dl1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":2339,"name":"Gespalten","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"At a student trip to the island of Oscarsborg. A student named Mikael Herman blacks out and wakes up in a nightmarish version of the 9th of april 1940, the day the Norwegian defence forces sunk the German transportation ship Blücher. With problems remembering how he got there, Mikael must struggle to escape the dark, and find his way back to the present 2010, through a place of the fears and horror created by war.\n\nIt is a horror driven story where the player is sent from 2010 to1940 and experience the historical events of the 2nd world war in Norway first hand, he needs to escape the darkness, and find his way back to his own time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/w97pglof7osp7qksflx9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":2244,"name":"Fire Birds","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An indestructible space-ship sets out extra-terrestrial Fire Birds who will attack the Earth. You can stop the invasion of the Fire Birds!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lnqspsqm4jizgn0sx59u.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":2034,"name":"Brothers in Arms: Furious 4","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Furious 4 was initially revealed as a new title in the Brothers In Arms series by Randy Pitchford during the Ubisoft press conference at E3 2011. The game seemed like a major turning point in the series. Rather than focusing on realistic battles, the game introduces four comical characters who are out on a crusade to kill as many Nazis as possible during World War II with whatever weapons they can get their hands on.\nIn August 2012, it was announced that the game would no longer bear the Brothers in Arms name and become its own IP. Randy Pitchford has gone on record to say that he never wanted this game to be a Brothers in Arms game but got pushed by Ubisoft to attach it to a recognizable brand. They agreed to let the public decide by showing it at E3 2011 and the reactions clearly indicated that press and fans did not feel Furious 4 should be a Brothers in Arms title. Furious 4 was then to be re-revealed at Gearbox Software's Community Day on September 25, 2012.\nIn 2015, Randy Pitchford said in an interview that Furious 4 \"is not a thing anymore,\" and that elements of it has been turned into what is now Battleborn.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1k31.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":2007,"name":"East vs. West: A Hearts of Iron Game","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"A grand strategy game based on the Hearts of Iron franchise, focusing on the Cold War. It was cancelled after a prolonged development.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ftclhuzrb1ueq87joeqe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1999,"name":"AquaNox: The Angels Tears","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This was to be a remake of Aquanox 2: Revelation for PS2, but it didn't pass Sony's software quality assurance tests and because of that the studio was closed and the game got cancelled.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8qg0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":1943,"name":"Whore of the Orient","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The next title from the team behind L.A. Noire.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/k9doe3nt9ib7ympoqure.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1938,"name":"Human Element","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Human Element is the first game from Robotoki. It is about zombies and survival. The game is on hiatus as of January 20, 2015.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aw4dvjwze7ln6hvfvatd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Ouya"},{"id":0,"name":"Wii U"}]},{"id":1936,"name":"Beyond Good & Evil 2","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Beyond Good & Evil 2 marks the return of one of Ubisoftís most beloved games. The prequel will transport players into a profoundly multicultural world, capturing the spirit of the original with unforgettable characters, grandiose decors and intense dramas that play out across a vast universe. Players will rise from lowly pirate to legendary captain at the helm of massive star-faring vessels, adventuring alongside crews of unforgettable characters to fight for freedom and theright to determine their own fate among the stars. Ubisoft Montpellier will be developing the game alongside its community of fans.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2pjv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1920,"name":"Agent","genres":[{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Agent takes players on a paranoid journey into the world of counter-intelligence, espionage and political assassinations during the height of the Cold War at the end of the 1970s. The trademark for the game's title was renewed in 2013 and 2017, and abandoned by November 2018.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2lcr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]},{"id":1909,"name":"Nuclear Union","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Nuclear Union was an upcoming postapocalyptic nuclear-strike video game developed by Best Way, and published by 1C Company, to be released in 2014 Q2 exclusively for Microsoft Windows. The story begins during the Cuban Missile Crisis of 1962, with the majority of the narrative and gameplay taking place in an alternate, modern-day Soviet Union.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6pje.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1903,"name":"End of Nations","genres":[{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"End of Nations was a free to play \"tactical\" MOBA developed by Trion Worlds. It's development was put on hold in 2013.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2sc1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1901,"name":"Command & Conquer","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Command & Conquer (previously known as Command & Conquer: Generals 2) is a cancelled real-time strategy video game in the Command & Conquer series. It was being developed by the now-closed video game studio Victory Games for Microsoft Windows.The game was set to use the Frostbite 3 engine and would have introduced downloadable content to the series.\n\nIt was supposed to be the first game in the series to be developed by Victory Games, making them the series' third developer after Westwood Studios and EA Los Angeles. Command & Conquer would have been available exclusively on Electronic Arts' Origin distribution service.\n\nThe game was originally announced as Command & Conquer: Generals 2, a direct sequel to 2003's Command & Conquer: Generals. It was then re-purposed in August 2012 as what would have been the first in a series of free-to-play games set in the Command & Conquer universe. The skirmish multiplayer platform was slated for release for free around Christmas 2013, with 'pay per play' campaign missions releasing by Q1 2014.\n\nHowever, on October 29, 2013, EA ceased development of Command & Conquer and shut down Victory Games, citing negative feedback over the economy-based experience as a reason","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co20kc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1898,"name":"0x10c","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"In a parallel universe where the space race never ended, space travel was gaining popularity amongst corporations and rich individuals.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/v0u1zdymhws2qbkefrg4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1855,"name":"Tom Clancy's Rainbow 6: Patriots","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Tom Clancy's Rainbow 6: Patriots is a cancelled first-person shooter video game, part of the Tom Clancy's Rainbow Six series, announced on the cover of the December 2011 issue of Game Informer. It was to be published by Ubisoft, and was developed by the company's Montreal studio, with additional development by Ubisoft Toronto and Ubisoft Red Storm.\nDue to the death of Tom Clancy in October 2013, concern was raised that this game would become the last to bear his name. Ubisoft has since stated that they will continue putting Tom Clancy's name on future Tom Clancy titles out of respect for the late author.\nPatriots was cancelled in 2014 after it was announced in 2011. Instead, Ubisoft started development on a new Rainbow Six game called Siege.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1yhh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":1386,"name":"Star Wars: 1313","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Star Wars: 1313 is a cancelled third-person action-adventure video game that was being developed and published by LucasArts. The game would take a more mature, gritty direction compared to past Star Wars video games and emphasize fast-paced, gadget and weapon-based combat using tools exclusive to bounty hunters rather than Force and lightsaber-based combat.\n\nOn April 3, 2013, it was announced that The Walt Disney Company had closed down LucasArts and ceased internal development of all their projects, including Star Wars: 1313. Company representatives have indicated that the game may be revived through a licensing deal with an outside studio, but until then Star Wars: 1313 remains on hold.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/q66qh9qbhunbkx2re5mg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"}]},{"id":1366,"name":"Gan! Gan! Pirates","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ab8qjsya3kxw83vuie0p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":1239,"name":"Tekken X Street Fighter","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"A crossover game that is planned to have Street Fighter characters in the 3D fighting style of a normal Tekken game.\nThe reverse of Street Fighter x Tekken which put Tekken characters into the 2D fighting style of a Street Fighter game in 2012.\n\nThe game has been stuck in development since its 2010 announcement and the game was put on hold officially in 2016, though early character models and some gameplay systems were said to be finished at the time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ab8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"Xbox One"}]},{"id":1044,"name":"SiN Episodes","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Planned as an episodic sequel to SiN, set 4 years after the end of the game, only 1 of the planned 9 episodes were released.\nThe episodes were going to be playable in any order with independent story segments, planned playtime of 4-6 hours, with an overarching story.\n\nInitially aiming for a development cycle of 4-6 months between releases, there was plans for changing future episodes depending on what players did in the previous ones. To do this, specific gameplay data was recorded and could be uploaded anonymously by players at any time.\nThis information included gameplay options like the difficulty level, assistance level and use of cheats as well as stats like weapon specific kills, deaths per map, secrets found, completion time and highscores for those playing on Hardcorps mode.\n\n\"SiN Episodes: Emergence launches the new era of episodic gaming. A first person shooter powered by Valve's award-winning Source technology, SiN Episodes offers unprecedented interactivity, an engrossing story, and a revolutionary dynamic difficulty system that provides a custom experience based on your skill level and play style.\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":525,"name":"Prey 2","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Prey 2 is an open world sci-fi shooter about an Air Marshal, Killian Samuels, who is abducted by a cruel race of aliens. The game was announced as cancelled on October 30, 2014.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co232o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":511,"name":"Ape Escape 4","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6003.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"}]}]