[{"id":232470,"name":"Origin","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"\"Minimalist puzzling with a unique mechanic\" ...Appzoom.com\n\"Origin ... leave your brain puzzled\" ...Apppicker.com\n\"Solving Pretty Looking Puzzles\".... nineoverten.com\nOrigin will tackle your brain in a different way than Brainsquare.\nEasier to grasp, so it seems…\nRules are the same, link all pins of the same colors with their corresponding square tiles to solve each board.\nLogic and ability to see forward is still required to complete the level.\nComplete the levels in the number of moves allowed for each level, and share them on Facebook, especially if you manage to beat the minimum moves allowed.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232463,"name":"D-Paddle vs. Crankquet","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"A bespoke 2-player ping-pong game for the Playdate with D-pad controls for P1 and crank controls for P2.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232462,"name":"Chromosome Evil: Map Editor","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60zy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232451,"name":"Cookie Match: Enhanced Edition","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Cookie Match is a game that everyone can enjoy. To match cookies and cookie cutters or icings, you will face different tricks in each room, that gives you a unique experience and entertainment. Clear all the stages and reveal cookies' true stories!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60zl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232448,"name":"Car Parking 2","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Car Parking 2- Meet the continuation of the first part! Get behind the wheel of the same cars and get to the finish line in the shortest possible time!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60zh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232447,"name":"Castle Capture Topkapi","genres":[],"avg_score":0.0,"description":"Multiplayer, medieval archery. Numerous characters, and classes to choose from. Use a bow or crossbow to snipe at your enemies or throw an axe for high damage. Use a sword, axe, hammer, mace, or fists for close combat. Exact copies of real-world castles, including Topkapi Palace.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60zj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232441,"name":"Light the Backrooms","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You will be hounded by ghosts in the Backrooms of a ghost hunting company from midnight to 6 am. New kinds of crazy ghosts will be introduced daily, but you will also be notified how to deal with them. Take advantage of the two types of lights and survive five days of crazy business.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60zb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232439,"name":"Medieval and Secrets","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Medieval and Secrets - 3D, game, In which you observe the Middle Ages, look for precious objects","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60z8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232435,"name":"Rogue Blaster","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Rogue Blaster is a shooting game that adds a twist to the FPS genre by adapting some rogue-lite aspects. The planet you crash-landed on is teeming with monsters! Use different equipment and items to survive the attacks until your ship is ready to leave.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60z5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232429,"name":"The Tongue of Doge","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Play as a licking doge! Climb peaks with superb tongue skills! Pursue the hot cat! Get back on your feet after countless drops! Stick to your heart in ridicule! Will the final outcome be to embrace beauty or find the true self?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7qqn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232423,"name":"Green Sans","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The first UNDERTALE fangame TO BE GOOD.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8s1r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":232404,"name":"O-o-o","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The essential turning point strategy game!\nKeep the board moving as you rotate discs to chain colors, connect corners and rack up high scores. Keep a level head under pressure as you clear as many lines as possible.\nEarn perks to improve your chances, including Rewind giving you a second shot, Rainbow to chain with any color, and Bombs to clear out the board.\nCombine perks and discover new tactics - drop a Rainbow and Rewind for better placement, or Rewind drop a Bomb? The choice is yours.\nThoughtfully designed with minimalist aesthetics and a rich ambient soundtrack, unwind while keeping your brain and body sharp.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232403,"name":"Light the Way: 10th Anniversary","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Originally released in 2012, Light the Way saw favorable success and ratings before being taken down in 2015. Now, for it's tenth anniversary, the game has been rebuilt from the ground up, sporting a fresh coat of paint and a handful of QOL improvements!\nLight the Way brings a twist to the classic memory game genre! A sequence of tiles will light up across the playing grid. It is your job to memorize which tiles light up and the order that they light up in, then recreate said sequence. Sounds easy, but as you reach higher difficulties, the playing grid becomes larger and the sequences longer, testing how effective your memory truly is!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232402,"name":"Granny","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Many monsters and enemies in the city. Granny need to defeat them, this is a war, fight back and get treasures and save hostages.Earn more money to save town.Make granny become hero.\nYou can play everywhere ,every time. It is a boring killer game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232400,"name":"Bubble Bobble 2 classic","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Bubblun, Bobblun, Kululun, Cororon have been cursed by Superdrunk after reading the sealed book then turned to bubble dragon and trapped in the world of the book.\nIt is an action game that selecting one of 4 character with different ability by shooting bubbles to trap the enemy, then pop it with horns or scales to defeat them.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232399,"name":"Legend of the Moon: Shooting","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You can play the game combining with other\ndevices Find the key to save the earth\nby destroying entities posing a threat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232398,"name":"Crush the Monsters: Cannon Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Make mincemeat out of monsters! In this action puzzle game, you can destroy a variety of monsters in many different ways - blow them up with cannon fire, incinerate them, smash them, chop, saw or tear them to pieces (and that’s not nearly all!) And if regular monsters are too simple for your tastes, test your mettle against the epic bosses of the Underworld!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232397,"name":"Monthly Dystopia","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A dystopian survival experience inspired by George Orwell's 1984.\nIn Monthly Dystopia, you need to find a way to survive in an authoritarian world. You can serve the dictatorship by being a model citizen or you can try to flee the country by cooperating with the Resistance. You live under a regime in which love is forbidden and using words banned by the Party is punishable by death. Choose your words wisely if you don't want to commit a thought crime. Remember, there's always a screen watching you. The paycheck from your job at the ministry editing the past is barely enough to buy the food needed to keep you alive, so it is crucial that you find a way to flee this dystopia where even thinking is forbidden.\nYou can serve as a loyal citizen, fall in love and constantly fear getting caught, work with the Resistance against the dictatorship, and choose freedom or servitude.\nThe daily tasks you perform in your apartment are your only way to survive. Remember that your time is just as limited as your supplies. You'll have to choose between cooking before going to work, taking medication for your illness, or doing activities that benefit your mental state. You can try to protect the people around you by making conscientious decisions or you can escape this dystopia by sacrificing them.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ujd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232396,"name":"Lillie is the Keeper","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You’ve always wanted a lighthouse of your very own.\nGet up, find some open space, and step into a first-of-its-kind embodied AR experience.\nThe year is 1905. An uncanny catastrophe maroons Lillie Flora Pine in distant Switch Rock Light Station.\nWhere you go, Lillie goes - across the room, up the spiral stairs, or into the drink. Explore an atmospheric world between rolling seas and endless skies. Your iPhone or iPad is your controller. Examine objects. Operate machinery. Read logbooks. And try to ignore “Mrs. Noonday.”\nBecause Lillie is not an ordinary hero. Only 15, she suffers from intrusive thoughts. Now, they’re her only companion.\nBecause Lillie is the keeper.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232395,"name":"Ram Setu: The Run","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Journey from one action packed situation to another, with star cast avatars inspired by the film Ram Setu, starring Akshay Kumar.\nRam Setu: Run - The Running game is a single and multiplayer non-stop action game. It’s a race in a quest to collect tokens, gems and power-ups, all while surviving the onslaught of enemy attacks, robotic drones, and wreckage.\nDeal damage to enemies and escape the unpredictable as you ride, roll and jump, through this epic story deeply rooted in Indian culture and heritage.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232394,"name":"Dracula City Master: Idle Army","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to Dracula City Master - the ultimate idle horror tower defense game! Lead your own vampire army on a quest to conquer the world, expand your army with the tap of your finger and unleash hordes of hungry vampires into the world, with one goal - total domination!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232393,"name":"PXL Play","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"“PXL Play” is the first character you’ll meet in this adventurous endless runner. His happy bright color grabs your attention, and he’s hungry for pixel points. And more friends.\nContinue your adventure with PXL, enjoying achievements and surprising boosts in this stress-free and colorful pixel world. The ability to shrink and grow, accelerate, earn more pixel points and expand your collection of playful characters is limitless.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232392,"name":"Gallag","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Remember the game, Galaga?\nThis game is not what it used to be\nbut try to keep the memory of classic games.\nIf you miss the nostalgia of the past, give it a try.\nSimple control and intuitive interface, etc.\nIf you are first on it. You can get used to it easily,","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232391,"name":"Bearable - Return to Candyland","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Candyman and his tribe of merry elves have returned to the island of Bearadise, turning everyone - and everything into delicious treats! - Exclusive to the App Store","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232390,"name":"Angle Me","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The best free game ever to build your spatial, geometric, and tangram skills!\nFun and challenging for people of all ages!\nEnjoy solving challenging puzzles by filling the board with a number of triangle shapes, fitting them together by form and colour.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232389,"name":"Connect 4 Faces: Match & Play","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Connect 4 Faces is a fun modern version of the classic connect 4 game. It consists of two major parts:\n1) A virtual world map as the matchmaking room: meet people from all around the world and find your perfect match. Exploring the match room is a lot of fun in itself. Fly around, collect some gems which you might need later in the game.\n2) The actual connect 4 matches: To make this classic more exciting, you have limited time to complete your turn and you will loose health points if you missed it. Also, do not place your avatar offside, or you will loose more health points.\nBe sure to delight your opponent player with some extra struggles. For instance you can create a game quake to make it difficult for him or her to exactly position his or her avatar. Or you can shorten the amount of time available for your opponent, shoot with baseballs, position turning windmills, hide your move or place a bomb to remove a threatening disc of your opponent. Some of the \"attacks\" (game quakes, time shortening) can even be defended.\nAfter the match has finished you can send a message to your \"opponent\".\nIn the menu you can click \"Recent Matches\" - there you will find all matches you played in recent days. In this dialog you can \"like\" other players. That is, you can permanently see them in your \"Liked Players\" list and directly invite them to matches when they are online.\nYou can also check messages received form other players.\nNo game account needed. Just make sure that you have an iCloud account and that you have enabled iCloud Drive! No costs, no ads, no in-app purchases. Just fun playing. We hope you enjoy this game and we appreciate any feedback or thoughts you might have.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232388,"name":"SailCraft GO","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Fully upgraded from the global feature winning \"SailCraft,\" simulating the classic Battleship board game. Battle enemies under the fog of war, detect their position in advance, and eliminate their fleet at one stroke! SailCraft GO!\nThe all-age casual game that allows you to find new joy with families and friends. Classic Battleship and Attrition Battle modes. Match with players from all around the world anytime, anywhere. Intense and exciting PVP ladder league. Come find me at the Poseidon tier!\nBrand new Sailing Road story mode and Siege Breakthrough instance. Challenge Sharkmen, Vikings, Skeleton Lord, Valkyries, Zeus, and other powerful bosses in legends and become the king of the seven seas!\nDon’t want to play alone? The glory of the guild is calling you! Upgrade the Guild Frigate, compete in the Guild War, collect treasures in Exploration, conquer the sea with friends!\nPlease note! Downloading and installing \"SailCraft GO\" is free, while you can also purchase in-game items with real money. To cancel this feature, disable in-app purchases in Settings on your device.\nIn addition, this game requires an Internet connection.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232387,"name":"Mahjong Lonely Island: Majong Star Tower Deluxe","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Mahjong - your task is to clear the board by removing a pair of identical tiles. This game is familiar to all, but not all are as interesting as this one! Here you will be able to go through many levels, that don’t seem to you very boring and simple. If you run out of moves, you can move all the tiles. Those who loves more beautiful color can change the background. There are also some tips.\nDisassemble the pyramid and have a lot of fun!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232386,"name":"Push IT: Sokoban Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Push IT is a Sokoban style puzzle game. Your goal is to push all boxes to the target area.\nCurrently it has 100 levels!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232385,"name":"Ones!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A very simple rule, but once you start the game, it's hard to stop.\nYou will be addicted to play this game before you know it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232384,"name":"Tip & Tumble","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"An extended collection of tilt mazes from Andrea Gilbert, the original clickmazes designer. Includes three variations with different goals.\nThink you’ve seen it before? Think again! Tip the grid to start the balls rolling. Once tipped, stays tipped, until all balls are at rest. No dexterity required, just forward planning and logical thinking. Find the right sequence of tips to solve the puzzle.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232383,"name":"Kids Jigsaw Puzzles: Fun Games for Girls & Boys","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Jigsaw puzzle is a simple exciting game which millions of kids and grown-ups all round the world enjoy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232382,"name":"Mahjong Solitaire","genres":[],"avg_score":0.0,"description":"Enjoy hundreds of tile-matching puzzles. Equip themes and backgrounds, including \"Stranger Things\" ones, to change the game's look and feel.\nSimple but never easy, the game challenges players to match tiles to remove them from the board. Clear all the tiles and you win!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7fld.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232381,"name":"Tap Bingo","genres":[],"avg_score":0.0,"description":"BINGO game with your family during family nights, or with your friends or co-workers during a party setting. Spend the whole afternoon with your buddies, or even by yourself while competing with virtual players and earn virtual coins!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232380,"name":"Sudoku Portal","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"the objective of sudoku is to fill a 9 × 9 grid with digits so that each column, each row, and each of the nine 3 × 3 subgrids that compose the grid contain all of the digits from 1 to 9. The puzzle setter provides a partially completed grid, which for a well-posed puzzle has a single solution.\nare you looking to solve some interesting sudoku look no more, enjoy solving exciting sudoku in a beautiful and relaxing environment where the Portal takes you to the highest pikes of sea cliffs and the coldest regions of the pole where Eskimos live build igloos, and rest their wooden sleds and the silent of desert canyon where you enjoy the base campfire and a full moon and wonderful waterfalls?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232379,"name":"Beyond Chess","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Chess has evolved! Welcome to Beyond Chess, the sequel to chess! Move a piece, then shift a square. The board is now an active part of the game! It truly is the natural evolution of chess!\nTake your chess skills to the next level and renew your passion, whether you’re a casual player or a grandmaster. Whatever your experience, Beyond Chess will be the most exciting and challenging game of chess you’ll ever play!\nBuild your own board design or choose from a growing library of 180+ designs! Then play friends or compete against players worldwide to see who is truly the greatest chess player in the world! Each board layout offers all new chess challenges to explore. Countless possibilities. Endless fun. It’s the universe of chess in your hands!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232378,"name":"Chess Minis","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Chess Minis has launched World Wide! Solve fun handcrafted puzzles or play online and collect 3D Chess sets designed by amazing artists. Play completely free with NO ADS!\nPlay free with no ads interrupting you, ever!\nPlay puzzles that are full of tricky, but elegant solutions. From beginner to expert, play to learn, train for just for fun!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232377,"name":"Cat Tiles: Matching Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Welcome to Cat Tiles! Get calm in a super relaxing match-3 puzzle game experience!\nUnwind yourself by dressing up and interacting with cute kittens!\nDecorate rooms to create a chill-out space for relaxation!\nAn endless array of new cats to meet and new rooms to explore!\nCat Tiles features relaxing match 3 puzzle, combined with the fun of playing with cats and room decorating.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232376,"name":"Econia: Crypto Idle Tycoon!","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Earn crypto in the NFT P2E game. Get tokens and sell them on the market\nTired of boring city simulators with monotonous gameplay? Econia is a mix of the best mechanics and genres: clicker, farm, idle, tycoon, city builder with resource crafting and quests!\nWelcome to Econia: build the city of your dreams! This is a well-thought-out city business simulator for the construction and development of your metropolis. You can play alone or build huge cities together with other players - the choice of play style is up to you!\nUse the most innovative economic strategies to become the market leader and overtake other players. Econia will surprise you and give you a unique gameplay that is definitely not found in other city sims, city simulators, idle, city tycoon games and clickers!\nEconia: build the city of your dreams has everything you love in idle tycoon games: city building, economic and business simulator with a well-thought-out quest and trade system, farm mechanics and resource gathering.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232375,"name":"Supermarket Cashier","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Supermarket simulator is fun supermarket Cashier management game.\nSupermarket simulator game has plenty of stores, cash register, fruits, vegetables, grocery department, fun zone, food zone, refreshment area and much more!\nBecome a manager of market and sell product of all the departments like local village market.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232374,"name":"Monopong","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Monopong is a minimalist arcade game a bit like that one with the ball and the paddles, but just for you.\nTest your reactions with global leaderboards, and achievements throughout the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232373,"name":"Puzzle Journey: Match 3 Blast","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Our heroes Aary, Fizzi, Garin, and Skuik find themselves locked in a hidden lab where their wonderful and mysterious adventure is about to begin.\nEngage in a dynamic and colorful puzzle game, use special techniques and abilities, like gravity distortion, to clear all bubbles. Help our heroes solve the secrets of the delicious fruit juice and reveal the real purpose of the Big Machine.\nGet challenged in an amazing world of over 150 handcrafted levels giving you the chance to extend your smart play with the use of the unique Super Sonic Bubble Powers. Extraordinary laboratory environments, heroes with special super powers, lots of sweet colorful bubbles full of delicious and mysterious fruit juice.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232372,"name":"Match & Merge","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match & Merge is an addictive puzzle game in which you match 3 or more blocks with the same color and number, and merge them into higher numbers.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232371,"name":"Up All Knight","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Utilize the unique size manipulation abilities of the knights of UPtara to scale the castle, avoid deadly obstacles, and rescue the damsels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232370,"name":"Vegas Royal Jackpot CSS","genres":[],"avg_score":0.0,"description":"Spin the best free slots games, compete in leagues, join clubs and hit Jackpot.\nIn our huuge casino. Spin Slot machines and win Huuuge Jackpot starting with a welcome bonus of 5,000 In-Game Coins! What are you waiting for? All Hail the New Las Vegas Casino Game Ultimate Experience! Vegas Royal Jackpot Party Casino is here to fulfill your Wild Dreams, Winner at Billionaire Casino!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232369,"name":"New FreeCell Solitaire HD","genres":[],"avg_score":0.0,"description":"FreeCell is one of the popular solitaire games that requires skill and patience to win! This is a card game with amazing graphics and ease of use to bring you the best experience.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232368,"name":"Dice Fight","genres":[],"avg_score":0.0,"description":"3D graphics, online multiplayer, intuitive controls, and spells and charms lead you on an exciting journey through the ancient orient! Get it now to enjoy the classic fun of throwing the dice with a hi-tech touch!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232367,"name":"Banzai Dice","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"BanzaiDice is a fun little puzzle game that is easy to pick up but hard to master. Beginners will find the controls very intuitive and the game easily accessible but advanced players will still have their strategic planning abilities challenged!\nTo get started, simply slide the dice up from the row below so that they form \"strings\" - sequences of dice of consecutive values or sequences of the same die face. The more strings you can get in one move the higher your score will be! Simple, yet dangerously addictive!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232365,"name":"New Ludo","genres":[],"avg_score":0.0,"description":"Ludo is one of the most popular dice board games in many counties. This New Ludo, support \"Team Mode\" creatively, you can play together with friends in one team against others in another team. Also you can 1 vs 3 if you like!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232364,"name":"Crazy Pirate Slots","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"ARR! It's one part Slot Machine and one part Shoot-Em-Up! Tap the skulls to take their gold, but careful matey too slow with your musket and they’ll steal some of yours! Spin and blast your way to the treasure chests for ‘Bonus Booty’!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232363,"name":"Card Games: Solitaire and more","genres":[],"avg_score":0.0,"description":"Do you like playing cards for fun or do you enjoy a tough competition?\nCard Games is a collection of games played with one (or two) deck(s) of cards that meets both needs.\nRelax while you play\nSolitaire,\nFreecell or\nPyramid (a Solitaire like game).\nJoin a table, and compete against other players on\nKoltsina and Xeri game","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232362,"name":"Vegas Casino Slots Mania","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Bigger payouts! Bigger bonuses! Bigger wins!\nPlay Vegas Casino Slots Mania on your iPad, iPhone and iPod Touch.\nFun themes to play","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232361,"name":"Animalz Pop-em","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Animalz Pop-em is a fun, engaging, challenging and easy to learn puzzle game.\nPlay with friends or compete online!\nAnimalz Pop-em is powered by Skillz to give you a fun and unique multiplayer experience!\nPlay for fun! Test your skills against people from around the world to climb up the leaderboard.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232360,"name":"Poker Kingdom","genres":[],"avg_score":0.0,"description":"Welcome to addictive new Poker game.\nPoker Kingdom is a collection of Poker games offering the newest redefined poker games, which is fun and challenging. The first available game is Chinese Poker. It is simple and surprisingly addictive. This game is suitable for all gamers. Try it and you can't put it down! It's the best time-killing when waiting in the line.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232359,"name":"Slots Frenzy","genres":[],"avg_score":0.0,"description":"Brand new from the makers of the Jewel Frenzy comes Slots Frenzy, a great way to enjoy Vegas style slots on your mobile!\nA simple interface means you can start playing in seconds. Just tap to SPIN!\nEnjoy tons of different slot machine themes: Farm Village, Fairy World, Dragon Ville, Rome City, Monster World, Arabian Night, Wild West, Basketball and many more…","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232358,"name":"Slots Pharaoh's Way Casino App","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Fun, excitement and entertainment! Welcome to Slots - Pharaoh's Way!\nThese slots play just like a dream - Easy to understand, big wins and amazing bonuses!\nGorgeous graphics, smooth animations, fantastic bonuses and atmospherical sounds guarantee a premium slot experience.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232356,"name":"Top Deck slotmachine","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The good old 80's slot machine now in your pocket!!\nThe old 80's machine back in 2016 with an online score list.\nBelong to the Top 20 of best players","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232354,"name":"Beach Casino HD","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Beach Casino is EASY to play and easy to WIN BIG! If you enjoy slots games, then you'll have tons of fun searching for the Fortune!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232353,"name":"Superstar DJ","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Superstar DJ... the Music DJ themed slot machine!\nGet on the decks and match musical symbols to unlock exclusive music from artists on the Spiralking label including Matt Laws from Binary Finary.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232352,"name":"Double 345 Slots","genres":[],"avg_score":0.0,"description":"Welcome to Double 345 Slots- the Vegas-style 2x 3x 4x 5x pay slot machine!\nDouble 345 Slots is a mobile version of the classical 3-reel, 9-payline slot machine - perfect for the novices and the experts of Vegas-style slot machines!\nBegin with 700 credits and use the on-screen controls to place your bet. Then, just press ‘Spin’ to spin the reels! Play all the 9 paylines and get bigger win!! See what you can win and climb the leaderboard with your total wins. Double 345 Slots is fun, addictive and free-to-play!\nAre you feeling lucky today? Play now and win big - Double 345 Slots - the addictive slot machine game for mobile!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232351,"name":"Mugalon Poker","genres":[],"avg_score":0.0,"description":"Mugalon Poker is a free texas holdem poker game to play online with friends","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232349,"name":"Button Board","genres":[],"avg_score":0.0,"description":"Button Board is a fun and educational game for preschoolers that introduces colours through creative play.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232348,"name":"Ice Cream Rush","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Are you crazy about ice cream? if so , be careful of your saliva, since we will bring you a fantastic ice cream decoration game .this is a brand new puzzle game.\nmore than that, your creativity will be trained ,when you choose the coveted ice cream ingredients.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232347,"name":"Connectrode","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The game has no time limits - play at your own pace. Once you master the gameplay, try for a high score and discover new depths of challenge and strategy - and land a high score on the Game Center leaderboards.\nThe \"boards\" you play in Connectrode are randomly generated - you'll never run out of new challenges. Post your score on a board to Twitter or Facebook, and friends can use your link to play the very same board - they may even beat your score and send a challenge back to you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232346,"name":"Super Juicy HD","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Super Juicy is bringing a new kind of action to the popular genre started by Bejeweled. The point is still to match like objects, but instead of jewels or parrots Super Juicy is all about the bubbles, baby. Moving bubbles that float, squeeze and grow in an ever-changing dance that kept me engaged for all 38 levels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232345,"name":"Frozen Slushy Maker","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"make fun frozen slushy maker","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232344,"name":"Dead People Driving HD","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"That Corpse and His Friends Just Stole My Car!\nJump into this free underground street racing app where you will be racing with friends to escape the cops, but you will have to do it as zombies!\nIt's your corpse, your buddies versus the cops!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232343,"name":"Super Balloon Rush","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Take the coolest journey ever from the creators of the #1 smash hit THE IMPOSSIBLE TEST series with over 25,000,000 downloads!\nJoin Toby's adventure as he pops balloons using awesome weapons! Use a remote control tank, baseballs, fireworks, magic wand, ninja stars, ray gun and other juicy weapons to give Toby a fighting chance against all the balloons!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232342,"name":"Tiny Sheep: Pet Sim on a Farm","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"One day as you were strolling in a beautiful meadow you spot a fluffy white object descending from the clouds.\nAs you get closer you realize it is a tiny white sheep! You stood flabbergasted as you watch it floating down.\nYou walk towards the sheep, it looks at you with big, adorable sheep eyes.\nWhat should you do with this fluffy white sheep?\nSurely, this must be a sign from the heavens that you should become a sheep farmer...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232341,"name":"Bonzai Bounce","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bonzai Bounce is a 2D platformer with a unique graphical style. Your mission is to control the ball and collect orbs that are spread throughout the 6 levels. Clear the levels as fast as you can with as many orbs as possible to get the highest possible score. At your disposal is the environment, use bridges as slingshots and platforms to reach new heights.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232340,"name":"TrumpGate","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tap to make Trump jump and avoid falling off the grid.\nCollect as many recordings you can to avoid being impeached and get as higher score as possible.\nRecordings can be used to unlock more Trumps to use in game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232339,"name":"Hit the Pillar","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Hit the pillars and score as many points as possible! How far can you go?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232338,"name":"CCG Deck Adventures Wild Arena","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Collect awesome Cards, Build your Battle Deck and enter the Wild Arena for epic card wars! Forget turn-based, go realtime against player constructed decks (PvP simulation)!\nIn this intuitive and beautiful trading card game (TCG), you’ll be unleashing powerful cards with special abilities in minutes. Battle fast & accessible real-time fierce card wars, battle duels on the go with spectacular fantasy magic spells and effects for the cards. Will you win your battles and become one of the deck heroes of the world?\nEnter the exciting card deck adventure journey with awesome graphics and tactical gameplay, find the best tactics and strategies to defeat opponents through multiple arenas in the order and chaos ahead all the way to the top. Whether this is your first card exchange game or you are an experienced pro, join the community and the depth and charm of this Wild Arena adventure will draw you in. The savage animal magic fantasy theme makes is very intuitive right from the start.\nFinally an EASY TO LEARN, HARD TO MASTER Trading Card Game (TCG)! If you never played a TCG/CCG before, you’ll finally understand that collectible card games can be insanely fun! But warning: this will be your #1 game for the upcoming years! Will you become one of the deck heroes, in this order and chaos building the best ccg / tcg deck in the animal kingdom there is?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232337,"name":"Arabian Princess: Dress Princess Match 3","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Arabian Princess: Dress Princess Match 3\nThe Arabian Desert is full of mysterious treasures that are yours for the taking.\nUncover the mysteries of the Arabia, legend by legend. Match 3 tiles in a row to remove them from the grid. Collect special objects by removing the tiles beneath and letting them fall to the bottom. Clear all the special objects to finish the level, then claim your riches!\nSwap to match 3 or more tiles in a row.Eject all items from the bottom of the plahying field to complete each level.\nMatch three or more tiles to reveal the picture hidden behind the game field.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232336,"name":"Norm of the North's Digit Dodge","genres":[],"avg_score":0.0,"description":"The Lemmings aren't just Norm's indestructible A-team, they’re also math whizzes! So...when Norm can't get any of the answers right, the Lemmings (like all the other animals in Norm’s life) have a whale of a time teasing him. Well, Norm's not having any of that!\nJoin Norm and the Lemmings for no-holds-barred, mathematical winter warfare! Pick a side and answer math questions correctly to launch snowballs at the enemy. Solve them quickly, though. If you don't, then you’ll be the one who gets pelted with snowballs and put on ice!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232335,"name":"Trigger on the Road","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The game that drew over 5million game players world widely! And now the adventure series “Trigger-on the road!! Is out!\nTrigger-on the road provides new types of adventure driving game to everyone.\nThe game player drives through spectacle stages and escapes from unexpected obstacles to discover “Golden Key”.\nAll the exciting themes and adventures are waiting for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232334,"name":"Freak Run","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Freak Run is an online multiplayer running game that you can enjoy with other players around the world. Compete with randomly selected players to run the race faster.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232333,"name":"Little Boat River Rush","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Start the journey of a lifetime on a high-speed river ride into the world of eternal summer. Feel the power of water, hop into your boat and get ready for a breathtaking adventure. Learn cool stunts, flush out birds, maneuver through obstacles and merge with nature. Join the championship, set new records and taste the victory.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232332,"name":"Driving Speed HD","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Race in high powered V8 muscle cars from classic era to modern day. Highly realistic physics, audio, car handling and performance set this game apart.\nCompete in career mode where you can experience a real racing career. Start off with a small amount of money to purchase a car and enter into organized series events. Winnings from the races will allow purchase of more cars, repairs and performance upgrades. Build your way up to compete in elite series events.\nModify your car by purchasing upgrades for performance and see exactly how each type of upgrade specifically improves the power and torque of the engine on a dyno chart. Purchase upgraded transmissions for faster gear shifts. Purchase better tyres for increased grip and road handling. Purchase weight reduction for better handling. Purchase suspension setups that lower the car and improve the handling from a lower center of gravity.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232331,"name":"Endless Jump: Infinity Loop","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Can play at any time, 1 minute spare time is enough.\nSimple game rule, control the ball jump across the columns. Keep it jump forever.\nIt is very hard, anything go wrong will be game over. You hard to keep play over 1 minute.\nYou can think this game is 1 minute challenge.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232329,"name":"BMX Champions Cartoon Network","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Ride your bike through fun-packed tracks with jumps and loops in this simple and fast-paced head-to-head biking rampage racing game. Whether you are into stunts, one-wheeling, dirt biking, stoppies, or speed thrills, BMX Champions will have you displaying your best skills while you manoeuvre your way through the obstacle course mayhem! Play as your favourite Cartoon Network character and jump on your customised bicycle ride and line up against other Cartoon Network characters. You will have to boost, balance and power to the finish line in this crazy racing course!\nBMX Champions is a simple yet fun bike racing game where you have to race through a track and try to be the first to cross the finish line. BMX Champions features racing tracks full of hills, curves, sharp edges, and many other obstacles to add to the challenge. Race your bike like never before while performing front and backflips, you will certainly have fun doing insane stunts and wheelies! With multiple racing courses to master, there are plenty of coins to collect and earn on the way to unlock special upgrades to customise your ride!\nBMX Champions offers endless customisation with 11 unique body frames including a chopper, bmx, dirt bike and motorbike to crazy go-karts, buggies, hotdogs and even unicorns! There’s 20 wacky wheels along with 10 additional extras to enhance your unique look. Not enough? Well, how about a spray-booth that lets players customise base colours for the body AND 21 types of trails that you can leave behind for your opponents to admire!​","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232328,"name":"Tunnel Hero 3D","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A game in which a car passes through a ladder-shaped maze in a tunnel.\n​","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232327,"name":"Escape Room: Uncharted Myth","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"HFG Entertainments proudly presents the most fabulous point and click escape game, Uncharted Myth. Enjoy three different stories in one spot. Come and join the world of fantasy & adventure to escape from the crux you have been trapped into.\nBecome a Pearl to break from the tangled realm of dreams. Explore a world you've never seen before, a story you've never heard of, and unforgettable twists and turns with unlimited levels filled with various themes ranging from fantasy, mystery, and detective thriller to fiction, you may test and increase your brain IQ while having fun and excitement.\nFinally, to get out of each knock-knock stage, take a big leap and solve the riddles, and hunt for hidden objects.\nGame Story:\nWitch Greed:\nBeing a little Jack you are on your way to saving your mom by grabbing a rare cure herb. But, fate entraps you by a witch who descends you into the group of crystal worlds. Seek a way out by solving the mesmerizing solving with your intelligence to have a hand with your companion. Finish the challenging puzzles quest to escape away from the curse to save your mom.\nDream Chronicles:\nStepping into Dream Life, you are Pearl, the protagonist agreeing to help your guardian angels’ research. Unforeseen you are entangled in a dream with enormous hurdles feeling fragile. With your thirsty collectibles, and unsolvable solving you will find a way to lead out of the trap. Complete the mind-blowing puzzles and hawk the hidden objects to escape away from the last stage.\nLost Space :\nDue to the black start impact, the earth loses half of its mass and gravity. Wealthy people formed hexagon communities & departed from the Earth in the year 2899 to the new Earth. You are a scientist named Hiro Lucas, the one among the poor people left behind on the earth. By solving the riddle solving, traveling to unexplored places, doing as much as hunt for new things, and math mating the puzzles to bring a solution to the Earth for saving its gravity, unlike becoming like Mars to save the extinct mankind.\nReady to explore the unopened doors of a different world. And immerse in the chronicle of escaping from each trap. Welcome to the world of escape game by escaping from reality.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232326,"name":"Swipe That","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Swipe, fill and win.\nSwipe it is simple minimalist casual action puzzle game.\nSwipe around but don't get blocked.\nSkip block but don't get outside the grid.\nEndless fun enjoy breath taking challenging levels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232325,"name":"Rebound Hockey","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A fun hockey game designed specifically for a smartphone and a tablet. The main rule: The puck should rebound from a player, a wall, or a stick. Choose the stage you like and win a hockey match. Or you can arrange a tournament for the World Cup or Olympic medals! Or do you want to participate in legendary hockey matches? Complete stages with 3 stars, collect super-hidden and super-bonus ..ears (Shh!!!).\nBut don't take a slapshot at the players. Or at the glass... ever!\n\nSTAGES\n100 different stages are waiting for you. These hockey rinks are really something you have never seen before! Forgotten clubs, cones, crates and tires (what are they doing here?) - everything is useful when it comes to rebound. Collect stars of skill and lead your hockey team to victory.\nCompleted all stages? Don't worry! There are also NG+ and NG++. The higher your skill, the fewer attempts there will be to notch a goal.\nAnd if it's difficult, watch the demo on how to score a goal.\n\nLEGENDARY GAMES\nHave you ever dreamed of playing in the matches that have become legends? USA vs. USSR, the 1980 Olympic Games final. Have you heard of this match? Can you repeat the success? Or, maybe, you can change history by winning the ill-fated match of the 2002 Olympic Games final?\n\nTOURNAMENT PLAYOFF\nPlay against the strongest hockey teams in the world: Finland and Russia, Canada and the USA, Sweden and Germany, Czech Republic and Slovakia. Can you win and get the Super Cup?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232324,"name":"Blogick","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Blogick is a block puzzle game for all players who love logic puzzles.\nFollow the blocks, remove obstructive blocks, find hidden routes and lead the yellow character\n(mouse, dog or some kind of monster) to the goal.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232323,"name":"Sand: An Adventure Story","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"It’s the 1920s. Leo Parker, renowned archaeologist and explorer, is in Giza working on an excavation for the British crown. Soon to head home, Leo gets wind of the discovery of a new tomb. His exploration of this tomb begins an adventure that will lead him to discover not just about the ancient past, but about himself as well.\nSand is part puzzle game, part adventure, part graphic novel. Unravel the story of the long-dead Pharaoh Anat as you solve puzzles and discover clues across a variety of Egypt-themed settings. Delve tombs, trace clues in the stars themselves, haggle with merchants, unlock ancient doors and journey back to ancient Egypt itself in search of answers.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232322,"name":"Escape Room: Haunted Mystery","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"100 Doors Horror Escape Games is a classic point and click horror game, full of mystery riddles, thrilling plot twists. You are in the haunted ghost house escape room, something very horrifying is going to happen to this sinister ghost.\nWhat happens next in this scary house will be an endless mystery for you, everything is scary, an adventure journey starts into mysterious and forsaken places. discover all sorts of unique puzzles, 50 horror rooms, collect hidden objects, a horror mansion and try to escape from your unique horror town adventure and scary mystery talelike terrifying horror escape games 2023.\nCan you escape the 100 rooms? The mystery escape game combines your skills of puzzlesolving and mysterious secrets to uncover the thrilling mystery.\nTogether with a mystery spirit you will face a scary journey in the haunted house to discover new escape mysteries. Can you survive?\nA fear escape game is waiting for you!\nIn 50 levels you can prove that you can combine well and try to escape.\nYou have to find out hidden clues to escape from the evil haunted house, try finding keys to unlock the doors. Panic escape room plan to get out safely from the mystery house.\nPlay is a mystery adventure escape that will test your brain abilities and observation skills and find the hidden objects in this puzzle quest. One of the most exciting escape room games with a hidden mysterious adventure.\nEveryone is waiting for you in your hidden mystery house. Come join the adventure journey!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232321,"name":"Rocco's Island: Pocket Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Join Evelyn on her quest to save a mysterious island in a puzzle-based atmospheric adventure with a story that spans across 30,000 years of time. Interact with fantastic characters to learn past secrets and transform the Four Elements’ kingdoms, leading up to an epic finale with shocking reveals.\nIt is YOU who triggered the end of days!\nAn angst-ridden teenager's innocent mistake becomes a race against time that could change the course of history. Against the backdrop of a mysterious island inhabited by strange characters, our protagonist must undo her mistake to save everyone.\nEngage the Island's denizens at your risk!\nYou wake up on an unfamiliar island that is fantastical as it is unsettling, only to realize that you are now responsible for the lives of every one of its denizens. The denizens themselves vary in temperament as much as their looks, and your only hope of saving them is to interact at your own risk!\nConnect the Secrets of the past with the present\nThe journey is as much about one's own past and self-discovery as it is about handling the present. With more knowledge gained the stakes are raised higher and the depths you must explore increases in both breadth and complexity.\nRocco's Island is best enjoyed with a good pair of headphones.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232320,"name":"Contradiction","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Contradiction is a fully interactive crime drama. Everything you see is live-action video, with real actors in atmospheric locations. You decide where to go, where to investigate, who to speak to and what to ask. As the story unfolds you'll meet new people, witness new events and discover new places.\nYou investigate with Inspector Jenks, who has been assigned to the case of a student found murdered in an idyllic English country village.\nYou meet several characters during the game, most of whom you can visit as often as you like. You can ask these characters about any item of evidence or information that you've collected along the way.\nThe aim (and name) of the game is to spot contradictions in what they've said. By consulting your notes and pairing together two contradictory replies, Jenks will interrogate the character and they will be forced to reveal new information, allowing you to progress further through the game.\nReveal all the contradictions to complete the game! Playing with headphones a must for a complete experience.\nContradiction is also available in HD and with added features on Steam for PC and Mac.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232318,"name":"Warlord Arena: Evolution","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Survival io of heroes evolving to survive!\nFrom strong orcs, noble elves, to legendary wizards\nVarious races in the fantasy world start a war to determine the ultimate victor.\nIf you can't avoid it, use a craft to subdue your opponent.\nIf you survive the fierce battle to the end, victory is yours.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232317,"name":"Egg Head in Space","genres":[],"avg_score":0.0,"description":"Egghead in space is an arcade platform games .\nTravel Space to find the right way.Be careful some monsters are in your way.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232316,"name":"Circle: Endless Spinning Game","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Circle is an Exciting Arcade Game where you have to rotate around a circle to dodge enemies!\nTap the screen to Change rotation direction and dodge all of the endless obstacles ahead. Can you beat the high score?\nAs you tap you will rotate, overtime the game gets faster and harder, but never touch the obstacles or it's all over!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232315,"name":"Atomic Spider","genres":[],"avg_score":0.0,"description":"You are an Atomic Spider! Created in a lab, you are now our universe's only hope to fend off alien interlopers from another dimension.\nAtomic Spider introduces a new touchscreen game mechanic married to intense gameplay and bright vector-style visuals. Battle your way through 50+ levels chock full of tricky monsters and bosses.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232314,"name":"Soccer: Goal Keeper cup","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Goal keeper challenge: Hit left or right, there is no time to think. Be the hero tonight and save the team!!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232312,"name":"The Second Word: Crossword","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Second Word is a 2 in 1 crossword puzzle game with brain challenging hidden words . Use hints to solve the amazing word puzzle.Rearrange the jumbled words in order.\nGiven are the words at the centre of a board game. Your task is to find the second word or the letters hidden on either side of the words. Complete the word puzzle and advance to next level.\nAs of now your task is to find the 7 letter word. This game consist of 99 levels with endless game mode.If you like this game and support me I would make more word challenges just for you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232311,"name":"Pine Tar Poker","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Welcome partner. We don't have much around here, but we still like a lil entertainment every now and then.\nGrab that deck a cards and the paper there, let me teach ya a game. Now this here game ain't gonna get ya in touch with the rhythm of the universe, but it might just put a smile on yer face.\nIf ya think magick might help ya win... well partner, ya just might be right...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61sq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232310,"name":"Linko: Relaxing Loop","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Linko is a very simple and calming puzzle game.\nAll you need to prepare to play Linko is your phone and one finger.\nLinko is not difficult or complicated, so anyone, regardless of age or gender, can enjoy it.\nCalm your mind and proceed as if solving a simple maze.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232309,"name":"Party Minigames 2 3 4 players","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"It's time to beat your friends in mini-games playing at the same time on the same device. Senior Games presents you this compilation of quick games for 1 2 3 4 people. 2 players, 3 players and up to 4 players at a time can enjoy a unique multiplayer experience.\nFun is assured with this collection of party mini-games to play on the same mobile or tablet several friends. Start the battle of 2 players, 3 players or up to 4 players. Have a great time with competitive multiplayer games. Many games in one and all you need is a smartphone or tablet and you can play offline.\nIn the cool multiplayer games from the party games collection you can play with two players, but if you have more friends or family and you are many players you can challenge 3 players or 4 players. Have fun with this competitive multiplayer game. For those times when you are alone, play in 1 player mode against the bot and improve your skills to become the best. You don't need an internet connection to play. Play offline for free!\nAll the party games and fun pastimes in this board game have simple controls and simple rules that are easy to understand. Party games is ideal for people of all ages; the very young, adults and even senior players. With 2 3 4 players of any age, fun is guaranteed. Let the party begin!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232308,"name":"Word of Prey","genres":[],"avg_score":0.0,"description":"Battle against others to be the first to get the word right!\nWord of Prey is a game featuring head to head match-ups where you race against your opponent for every word. Speed is the name of the game; once you get a word right it switches to the next word for you and your opponent. Compete for every word to come out on top!\nAs you win more games, you unlock lobbies that feature harder words with more letters- think you have what it takes figure out a scrambled eight letter word?\nDownload Word of Prey, and let the games begin!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232307,"name":"Memo Raise: Memory Game","genres":[],"avg_score":0.0,"description":"Memo Raise: Memory Game - Game Mode:\nClassic:\nTap the buttons that was highlighted in order.\nDescribe Me:\nTap the button that fits the description.\nMirror:\nMemorize the position of the BLACK buttons and tap it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232306,"name":"MazM: Hyde and Seek","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A story-based board game you experience with a set of dice and fistfights!\nKate, the 'London's Flaming Fist,' is waiting for you to join her exciting adventure!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232305,"name":"Dot Line Link","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Dot Line Link means a new game style - touch the Dot between Line or cross corner Link to clear the jewel!\nCan you believe there are more than 30 million people ever played this kind of game in Asia? Now you can try this popular game on your iPad by downloading Dot Line Link for free! HD version!\nThe rule is very simple, just touch any empty cell that connects two or more same-colored jewel either in a line or at a crossing corner, then you can clear that gems and get points. Yes, simple, but full of fun!\nDot Line Link is not just a copy of that original game, but an improved version with better scoring, special cards, multiple modes with versus.\nHave one for free NOW! It's a gems blitz for you, rank No. 1 in the world!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232304,"name":"Jigsaw Puzzles: Photo Puzzles","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Get ready to play the first competitive multiplayer jigsaw puzzle game ever, on one puzzle board, and where the most points wins! It's a brand-new way to play, and something that promises to bring a whole new level of excitement to jigsaw puzzles. When you need something less competitive, play solo jigsaw mode and select from thousands of beautiful Free puzzles to play at your own pace. The jigsaw puzzle game offers multiple games modes, and endless hours of fun for adults.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232303,"name":"Maze Gobbler","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"\"Maze Gobbler\" is a simple yet addictive puzzle game.\nDraw the way with your fingertip for the cute caterpillar to follow to escape the Maze.\nAvoid Monsters. A Monster cuts the body of your cute caterpillar.\nA Monster changes to a Fruit every few seconds, and seconds later the Fruit changes back to the Monster.\nIf your caterpillar eats a Fruit, one block of tail is added to the caterpillar (and Game Money too)!\nDon't spend too much time, as more Monsters will appear as time goes on!\nClick the Buttons at the bottom of the Screen: \"AddSpeed\"(Speed Booster, X2, X4) and \"AddTail\"(add one block of tail to the body). These are very useful!\nStrive to make the body of your caterpillar longer. The longer the body, the higher the Score!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232302,"name":"Number Smash 123","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Get ready for a smash-tacular Number smash fest.\nNumber smash is a simple one touch arcade game. Your objective is to smash as many tiles as you can before the timer runs out. Compete with your friends. Brag about your high scores on Twitter and Facebook. Earn achievements and try to climb your way to the top of the leaderboard.\nIf you're good enough you'll be able to play the crazy frantic Number smash mode.\nHit us up on twitter for any feedback. Tap on the Developer Website to contact us!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232301,"name":"Join 4","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"\"Swipe\" the screen and all the pieces move toward the wall in accordance with the law of physics defined by our physics engine.\nOnly exclusive pieces are joined together!\nYou will earn 10 points each time you place 4 different colors of triangles or 4 different colors of dots into a square area.\nUse the \"CHANGE PIECES\" button to change some pieces when necessary.\nChallenge your geometric imagination and hand-eye coordination.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232299,"name":"Numbers Game 2: Number Match","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Numbers Game 2 is the new and improved version of the addictive logic puzzle game! The classic time killer and number match game with simple rules, enriched with many new features.\nMany of you know this Number Match logic riddle from school or university when you have played it with paper and pen. Now \"Number Match Game Numberama 2\" is also available for your smartphone. Matching brain games & logic puzzles for everyone.\n\nIn this numbers game you have to match and cross out numbers or digits on the playing field. Two numbers can be merged, if the numbers are the same, or add up to ten. For example you can combine numbers like 7 and 3, 9 and 1, or 6 and 6.\nThe two digits have to be side by side or on top of each other. The right side of the number board wraps around to the left side, so numbers on the right side are next to the numbers on the left, but one row down. The two numbers can have crossed-out number blocks between them.\nIf you cannot or do not want to merge numbers, and you do not want to use Boosts, you then press \"Check\". All the numbers remaining on the board are then copied after the existing numbers and the numbers game continues.\nNumber Match Game Numberama 2","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232297,"name":"Fishdom Solitaire","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Never Fishdomed before? Take a deep breath and dive into an underwater world of card-based craziness with Fishdom Solitaire, an all-new free game!\nTry challenging and fun solitaire gameplay as you decorate aquariums to create cozy homes for lovely, talking fish. Feed them, play with them, and watch them interact with each other. Your finned friends are waiting for you, so dive in now and enjoy this amazing underwater adventure!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232296,"name":"Flipper Island","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"As simple as it may be, playing pinball with a dynamic island is not an easy feat!\nRelaxing at heart, fun in nature, in this game you can expect a rollercoaster of emotions!\nCompete with your friends for the biggest score\nHint: Hit fast to gain extra points\nCan you do it?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232295,"name":"Voxel Santa Skiing","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In Santa Rush world, you'll help Mr. Santa slide through a slippery, full of obstacles, snowy path amid a beautiful pine forest, to collect Christmas presents for all the children!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232294,"name":"Side Swap 2D: Endless Fun","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Side Swap 2D is an Exciting Arcade Game where you have to dodge the obstacles by switching sides! Do you think you can beat it?\nTap the screen to swap direction and dodge all of the endless obstacles ahead. Can you beat the high score?\nAs you tap you will swap directions, overtime the game gets faster and harder, but never touch the obstacles or it's all over!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232292,"name":"Trucked","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Test your trucking skills and see how far you jump, dodge and travel to hit the hi-scores!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232291,"name":"Twin Towers 3D","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"It is a game to build individual towers composed of odd and even numbers of balls.\nOdd numbers can be stacked on a soccer ball and even numbers can be stacked on a basketball.\nTo increase the difficulty, towers will collapse on collisions with multiples of 3.\nAlways be careful.\nGood luck.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232290,"name":"Farkle mania","genres":[],"avg_score":0.0,"description":"Someone calls it yahtzee or yatzy. The name is different, but the game is the same.\nNew social board game experience! You can play with people from all over the world in Online Play.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232289,"name":"Goldrush Coin Falls","genres":[],"avg_score":0.0,"description":"Progress through the game to unlock or upgrade thirty special features, special coins, special bonuses, precious gems and collectable toys - this game has it all.\nEach time you level up, there's always something new to see, so you'll be coming back again and again for just one more go. Who knows what that next level up will unlock...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232288,"name":"Lumz","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Colors have no secret for you, so live the Lumz experience!\nTravel to different countries, and discover symbolic places, through a color palette.\nYou lead Lumz, it's an entity composed of the primary colors, Red, Green and Blue.\nYou compose new colors, by playing on each component.\nYou take up different challenges, solve puzzles, find paths, reconstitute the right colors of the flags...\nHave a good trip !","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232287,"name":"Glow Unblock","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"This game Included Two Game mode\nUnblock Me and Move Me Out !","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232286,"name":"Ancient Games Of Nations: The Royal Game Of Ur","genres":[],"avg_score":0.0,"description":"The Royal Game of Ur is a 5000-year old Mesopotamian strategy board game which is wonderfully easy to learn. Download free for iPad the high-quality reconstruction of a game board from 2600 B.C., found in the Royal Tombs of Ur (Mesopotamia). You can play in single- or local two-player mode on a single device, at the difficulty level of your choice from beginner to advanced. This is the first piece in the AGON – Ancient Games of Nations series, a collection of amazing traditional board games for iPad.\nAbout the history of The Royal Game of Ur:\nIn the 1920s, British Museum’s archaeologist Sir Leonard Wooley (1880-1960) found two of these game boards in the city of Ur. There is evidence that The Royal Game of Ur was the most popular game of the era. It is a typical race game, the ancestor of the genre. The rules applied in this iPad reconstruction are based on a cuneiform tablet from the 2nd century.\nThe framework application that comes with AGON - Ancient Games Of Nations is a virtual box which has twelve compartments to accommodate further board games. These will be made available one by one by Private Moon Studios. All AGON board games purchased will automatically integrate in the collection. The series will include various game types from all over the world: ancient Mesopotamia, Egypt, Japan, Korea and many more.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232285,"name":"Snakes and Ladders NoLimits","genres":[],"avg_score":0.0,"description":"One of the most popular boardgames Snakes and Ladders and the most beautiful on your iPhone and iPad!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232284,"name":"Chef Master Slot","genres":[],"avg_score":0.0,"description":"The most famous slot machine is now available for free on your device.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232283,"name":"Nasty Bottle","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Do you need the ultimate challenging game in parties?\nDo you seek for the number one Spin The Bottle application for your iPhone and iPad?\nDo you want to play the best Truth or Dare game?\nIt’s time to get nasty...\nNasty Bottle HD is the nastiest \"Spin the Bottle\" and \"Truth or Dare\" game on the world! Playing Nasty Bottle you can unleash your imagination and create a great atmosphere with your friends! Just spin the bottle and complete the various truth or dare challenges that will appear! For the lovers of classic values, Nasty Bottle provides also a version of the classic spin the bottle game, in which players can spin the bottle and decide their own rules. Nasty Bottle is the ultimate ice-breaker for parties, especially when the players are both men and women. Try the unique \"Sex Mode\" raise your libido to the limit!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232282,"name":"Dice World: 6 Fun Games","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"6 great dice games in a friendly gaming community for everyone to enjoy!\nAs always it is completely accessible to the visually impaired, allowing EVERYONE to play on a level playing field!\nThe fun going viral around the globe! Join in and meet new people while playing new dice games!\nIncludes Farkle, Yatzy, Pig, Threes, Balut and 1-4-24! Easy tutorials for all games!\nPlay friends, play tournaments, play funny computer players, play online or offline, play however and whenever you want. On YOUR schedule!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232281,"name":"Stunt Extreme Legends","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"From the creators of Offroad Legends, the next generation of endless racers is here!\nDrive your car through tracks, be fastest to get 3 stars!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232280,"name":"Yatzy Yacht Free","genres":[],"avg_score":0.0,"description":"Roll the dice, place your results carefully and go for the highscore! Yacht Dice Games is an addictive dice game where you can choose between classic Standard rules (same as in Hasbro Inc's Yahtzee) or try another variant: Scandinavian (yatzy).\nCPU opponents lets you play vs the artificial intelligence. The computer is no slouch, but skillful Yacht players should be able to triumph. Activate them by tapping on the robot icons when you start a new single player/hotseat game.\nTo switch between the score table and the dice box on the iPhone/iPod Touch, simply swipe left and right!\nYacht Dice Games comes with three multiplayer modes: Hotseat/Shared Device, Local Network (Bluetooth, for 2 players) and Game Center (for 2-4 players). Challenge a friend or go for a game against a random stranger using Game Center's multiplayer matchmaking!\nWith full Game Center support, you can compete against friends and the whole world for the top spots on the Leaderboards, or chase achievements to earn points and bragging rights.\nAs a lone indie developer, I strive for perfection in my games. If you encounter any bugs, experience any difficulties or have any suggestions on how to improve Yacht Dice Games, please contact me directly at","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232279,"name":"Poker with Words","genres":[],"avg_score":0.0,"description":"Poker with Words is Texas Hold’em Poker with a slight twist - you gamble using letters and words! Each letter is assigned a point value based on its frequency of use in words. Use the three cards in your hand and the five cards on the table to create a word that is worth more points than the words created by the other players at the table. Bet, Call, Check, and Raise along the way in order to increase the total amount of money you can win! Can't spell a word? Try to outsmart your opponent by bluffing! Its Texas Hold'em Poker, but with Words!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232278,"name":"La Fattoria (Farm Slot)","genres":[],"avg_score":0.0,"description":"The most famous slot machine is now available for free on your device.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232277,"name":"Cribbage Live","genres":[],"avg_score":0.0,"description":"Play cribbage and chat online with real players - hundreds of players from all over the world at all hours!\nHigh quality and easy-to-use cribbage board, cards and fast play.\nCribbage Live is a social gaming platform where cribbage players from all corners of the planet come together to play this popular board game.\nCribbage Live features one-on-one cribbage games, multiplayer cribbage tournaments and multiple game variations.\nCribbage Live supports tournaments from both GameColony.com and cribbage.org ACC (American Cribbage Congress)\nIf you had an internet disconnection, Cribbage Live will reconnect you. Cribbage Live will play fine with either WIFI or 3G connection.\nSix Card Cribbage is a two-player game of skill that uses a standard 52 card pack. The goal is to be the first to score 121 points over several deals. Points are scored for card combinations that occur during the play or in a player's hand or in the crib -- the cards discarded before the play.\nFive Card Cribbage variation is an older traditional version that is still popular in England. 5 card Cribbage differs from the more modern 6 card cribbage by the number of cards in hand (initially 5) and by the score to play - usually it is played to 61 points.\nPaul Rice of Wells, ME who plays in US national cribbage tournaments says that in cribbage \"75 percent or more\" depends on the skill of the player. Per Paul Rice: \"in cribbage, every card you play and every card your opponent plays, you're trying to throw a curve ball in there\"... \"you can be dealt a gosh-awful hand and if you play it right, you can advance up the board.\"\nCribbage Live uses a fast cribbage central server supporting different cribbage clients in addition to iOS-based cribbage client.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232276,"name":"Blackjack Thunder","genres":[],"avg_score":0.0,"description":"Blackjack thunder is the coolest blackjack game with real time fun and experience. Grab this offine casino games to have Blackjack multiplayer fun.This casino game blackjack for your device to get gambling and casino betting fun on your hands.\nAre you ready to play in High Roller Tables ? If So, try our new tables wherein minimum bet to enter is high and there is no limit for maximum bet! Play the most realistic blackjack Simulation of casino card game with options to surrender, split or Double the deal.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232275,"name":"Jungi Mania","genres":[],"avg_score":0.0,"description":"Jungi Mania, is the next fruity jumpy Match 3 game, that is guaranteed to keep you entertained for hours !\nYour Objective is to Connect colorful fruits to solve over 100 levels in this compelling puzzle adventure. Challenge your friends to make a bigger splash !","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232274,"name":"Mini Crush Casino","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Now experience the excitement and thrill of playing bingo roulette in the real Vegas casino\non your mobile device. Develop you own strategy to beat the highest score online.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232273,"name":"Keno Gold","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Traditional keno gameplay plus 3 exciting bonus features including Free Games, Win Multiplier and Extra Balls to enhance the experience.\nKeno Gold provides hours of fun and enjoyable gameplay with rich graphics and casino-style sounds. You'll feel like you're at the casino, except that you'll still have your money when you're done!\nIf you like slot machines, poker, Texas hold'em, solitaire or other casino games, you'll love Keno Gold.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232272,"name":"Tripeaks Solitaire Classic","genres":[],"avg_score":0.0,"description":"TriPeaks Solitaire Classic is a relaxing, smooth version of the popular Tri Peaks Solitaire game. This card game is easy to learn and a delight to play.\nTripeaks (sometimes known as Tri Towers or Tri-Peaks Solitaire) is an original card game with simple rules. All you must do is match cards that are one higher or lower than the card in your hand. An Ace is both high and low, and you place a 2 or King on it. The longer the run the better. Use the free wildcard for when things get a little too tough. If you can’t find a match, just turn over another card from the deck and continue! To win remove all three peaks of cards.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232271,"name":"Go Domino","genres":[],"avg_score":0.0,"description":"Go Domino! Our version of this classic game is simple, fun to play and it provide some of the most common rules & variations (see How-To screen or contact us via email for clarifications). You can play Draw or Block games, choose the target score (from 100 up to 500pts), scoring options (at end, all 5s, or all 3s), game start options (last winner, highest double, or heaviest domino), and opening spinner options (no spinner for 2 trails or first spinner only for up to 4 trails).\nGo Domino has tons of cool features including a full view of domino trail, Drag and Drop dominoes to the table (1 finger gesture, just touch the domino and drag it to the available position on the board), game log, zoom in/out, stats box and more features and variations to come in future releases.\nPlay the game against 1, 2, or up to 3 virtual players at a time. There are a total of 9 different virtual players, and each one of them has its own expertise level (Beginners, Intermediate and Advanced). Go ahead and play against all of them.\nCustomize the game by selecting the table (or theme) of your choice. There are 12 different options including marble tables, wood tables, bamboo, classic game tables, and an outdoor concrete table. Also, you can select the style of domino to play with from 3 options white, colored dots or black.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232270,"name":"Money Swipe","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Similar to match 3 games but with a fun and simple style of gameplay. Match the money symbols and score high points! 'Classic Grab' version included, with the option to purchase additional game modes. Plan your strategy to save your last move on all the high values, or just swipe all the pairs. Occasionally, a WILD x10 symbol will appear but use it wisely on the high values. After each game, your score is saved on a local High Score list & global leaderboard Game Center for you to compete again the next time. Retina graphics and fun music, you can play over and over.\n4 Game modes: Classic Grab, Timed Grab, Money Stash & Fast Cash.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232269,"name":"WhatsSlot Halloween","genres":[],"avg_score":0.0,"description":"Slot Diamond Season for Halloween!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232268,"name":"Flashloft's Slots","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Slots is the perfect Las Vegas style slot machine experience for your mobile phone.\nBeautifully themed Slots, ! Fun themes including: Burger Max, Crazy book store, Go Go Train, Fruit joy, Ghost Link Line, X'mas gifts, and More!\nFlashloft's Slots is free! Choose your adventure, your bets and your lines and play as long as your heart desires!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232267,"name":"Millionaire Show","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A show that the whole world enjoys, where a dream of becoming a millionaire comes true, is hosted every year.\nIn order to become a millionaire, they must play a game with danger.\nIf they win the game, they get to turn their lives around in a second.\nMany people participate in the show. They either become a millionaire or are disabled for life.\nYou, living a normal life, decide to participate in this millionaire show to have a chance at turning your life around.\nWill you be able to become a millionaire?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232266,"name":"Adventure Slots HD: Titan's of Las Vegas Fortune Casino","genres":[],"avg_score":0.0,"description":"“One of the best slot games I’ve ever played”. Jump into Casino Adventure with this exciting multi-line slot game. Spin the bonus wheel to win big fortune! This virtual video slot game gives you that Las Vegas feeling without losing you real money. Feeling lucky?\nYou’ll enjoy many perks while playing this exciting game: for your entertainment you will get access to 6 machine themes: Greek Gold, Amazon Queen, Jurassic Jackpot, Queen of the Nile, World War and, Pirate Slots.\nWith multiple levels, bonus games, hourly bonuses, and loads of machines, this is the slot game for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232265,"name":"Mine Blast!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Blast the mine around the screen to reach the goal. Try and get the mine to the goal in as few explosions as possible!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232264,"name":"Angel Archer Run: The Lost Temple of Oz","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Not all angels are nice! Some are naughty, and this one is seeking adventure! Run, jump fly and shoot your way to the lost temple. Will you make it there alive?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232263,"name":"Bivoj","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Originally designed 2D and 2.5D mobile game. As Bivoj, you must save the beautiful Kazi from the bloodthirsty pigs. A difficult journey full of various tasks and traps inspired by an old legend. Will you accept this request? :)","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232262,"name":"QuizPig","genres":[],"avg_score":0.0,"description":"QuizPig is a 100% free (no ads, no in-app purchases) general knowledge quiz game covering 5 main categories: General Knowledge, Geography & Cultures, Entertainment & Sport, History & Politics and Science & Nature.\nGet questions right to earn stars and unlock more quizzes.\nBe prepared for a challenge though, as some of these questions are seriously tricky!\nAt launch we have over 300 questions, and more are on the way in an update very soon.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232261,"name":"Where is Ploppy?","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Where is Ploppy?, a colorful fun hidden object game for everyone, is designed with your child's safety in mind. In addition to Apple's guidelines for children's games, we go one step further and firmly believe that any data about your children belongs exclusively to you and your children and should stay that way. Therefore, Where is Ploppy? does not store any of your children's data! There are additional security mechanisms in place to prevent your child from being routed out of the app while playing. This means that as soon as a link is called up, such as to rate the game, a short math problem must be solved beforehand. Furthermore, the game is also designed for the colorblind and children who can't read yet.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232260,"name":"Catchy Chips","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Chips are falling from the sky! Catch them all to fill up the packets. Sounds easy? You wish! Avoid collecting the burnt chips or it’s game over!\nPlay through the levels and collect all the stars or play classic mode and set a new high score! You can play offline too!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232259,"name":"Jacky's Hidden Items","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"\"Jacky's Hidden Items\" is a unique search and find hidden objects game featuring the drawings of the ingenious artist Jacky Jackson in a new interactive hidden objects puzzle experience.\nJacky's drawings are colored black and white with a rare style and humor, each hiding an object, animal or a person which seems to be part of the drawing... but it isn't! Challenge your illusionary brain to see if you can find all the hidden objects on each level.\nThe game is nothing like the classic \"hidden object\" games that you already know - download to discover special gameplay, story, art, and design which makes it a truly unique and original brain teasers puzzle game unlike any other.\nThe game's concept is simple and lovely and suits all ages - from kids to adults alike. But don’t let this fool you, “Jacky’s Hidden Items“ will require you to solve challenging mind teasing levels in a clever and rewarding experience as you’ve never encountered before.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232258,"name":"Jello Bubbles: Pop Color Balls","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Play the new fun and addictive Jello Bubbles shooter game for FREE. Enjoy solving original bubble puzzles and relax popping colorful jelly balls.\nMatch 3 or more bubbles with the same color and clear levels, accomplish the game objective to advance to the next one.\nAim & shoot with the Jell-O-Matic Machine, to drop & blast all bubbles. A funny hummingbird helps you with nice boosters. Tap on the screen and drag the mini bubbles aim and lift it to shot. Take your time to aim and hit your desired bubble to make it pop.\nEasy to learn, only aim, match, and pop all the balls in this fun color-matching adventure. Use your puzzle-solving skills to clear levels and unlock new cities around the world. Travel with our heroine and discover amazing monuments, from Barcelona to the world. Clean the Jello and save the kidnapped birds.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232257,"name":"Garbage Truck City Tycoon","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"\"Let’s clean the world together! Join EMKA - waste disposal company, on their quest to save our planet from getting covered in trash. Welcome to Garbage Truck City Tycoon. In this game you as a player take control of a recycling ECO truck, equipped with special vacuums that harvest garbage. By cleaning the environment you can invest in new trucks, upgrades and green technologies that will improve your gameplay. The main goal of this game is to highlight the importance of ecology. Various environments starting from forests, cities and deserts you will encounter in the game will show you how garbage crisis affects the environment. Features:\nBuy and upgrade trucks, for better performance\nCollect special boosters with various effects\nUnlock legendary trucks\nConstruct and upgrade structures of garbage processing\nExpand your business\nDozens of levels with various environments to unlock\nHelp us clean the world together with EMKA!\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232256,"name":"Train Simulator PRO USA","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Tracks. Diesel. Railroad. Huge Map of the USA. Train Cars. Coal, Tractor or even Tank Freight. Authentic Stations. Realistic Locomotives. Picturesque Scenery. Passenger Wagons. Railway Turntable. Air Brakes. Long Haul. Open World. FREE. With lots of Air Hissing and Steam. The list goes on and on. Don’t hesitate no more - just download now!\nTrain Simulator PRO USA gives you all you could imagine from a realistic train simulator. Jump into the driver's cabin, use coupling to attach your railway trucks and drive your goods to make the highest profit.\nWith tons of challenges to complete, over dozen different railcars and cargo types, numerous realistic cities and stations to unlock and explore and above all beautiful scenery of the United States of America which you can discover through the windows of the most iconic passenger and freight locomotives this game is a must for every simulator fan out there.\nDownload and become a railway tycoon now!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232255,"name":"Olly's San Francisco Rush","genres":[],"avg_score":0.0,"description":"Rush through the streets of San Francisco!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232254,"name":"Cracké Rush Endless Run & Fun","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"RUN as fast as you can to catch your precious eggs!\nTurn yourself into Ed and play Cracké Rush, a free, easy-to-play, high-speed endless runner with zany antics and addictive gameplay mechanics for the whole family!\n\nA very anxious and overprotective dad ostrich, Ed will do anything to keep his adorable eggs safe. But these rollicking eggs just want to go on an adventure and have fun exploring the world. It’s time to join Ed and stretch the limits of what it means to be a GREAT parent in his endless crazy running quest to take care of those precious eggs!\nCracké Rush is a casual run and fun game that will make you cry with joy!\nPlay this egg-citing new runner game for free now and save your eggs!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232253,"name":"Scream Timbernote:the game of voice controller","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Timbernote is a voice control and magic games.Support bluetooth wifi close range multiplayer, support single player, support scream play, support classic play.\nJust 50 decibels to the microphone, you can switch it left or right, without sound, without any switch,and tap to chopping!\nTimbernote is an oldschool arcade style casual game. Become a Timbernote, chop wood by tapping and avoid the branches by screaming. Sounds like an easy task? It's easy to play but hard to master. Master your skills for the top records on the leaderboards.\nTake your axe as every lumberjack does and chop the tree as fast as you can!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232252,"name":"Traffic Race 3D: Highway","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Burn the rubber. Show your skills.\nThe ultimate highway traffic race with addictive gameplay, Superb 3D graphics and varying terrains.\nPlay a quick highway race and enjoy your spare time. Shift gears and move very fast upto 300 Km/ph and evade crashing into moving traffic on highway.\nBe the new speed star on the street, race as far as you can go and bend the rules.\nCrash your car, rise from the dust and try another race. It just keeps pushing you for more.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232251,"name":"BraveNine Story","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"An extraordinary adventure story of the unstoppable mercenary group!\nBrave Nine mercenaries are back in a new Visual Novel RPG, BraveNine Story!\nWhy did this young noble man from a prestigious family become a runaway overnight?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vhe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232250,"name":"Ski Challenge","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Feel the excitement and thrill of ski racing on your mobile devices whenever and wherever you are with Ski Challenge 365 days a year!\nRace down popular, real-world-inspired and fictional ski tracks against the timer or compete against your friends. Only the fastest win!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232249,"name":"Metarails","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"All train collectors, strategy players, and tycoon enthusiasts sit up! Metarails merges the best from classic tycoon games with the train collecting element, and brings it to mobile devices! The complex Metarails tabletop maps, copying real North American areas, are built to give you a relaxing yet immersive gaming experience. You can collect dozens of unique high-quality locomotives, and a variety of trains, and expand your train empire across a single-player campaign.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232248,"name":"StackLands2","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Stacklands is a village builder where you stack cards to collect food, build structures, and fight creatures. For example, dragging a Villager card on top of a Berry Bush card will spawn Berry cards which the villagers can eat to survive. Play your cards right and expand your village!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232247,"name":"Legend Magician","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Immersive RPG with dot-pixel 2D graphics and auto-play\nI’m a god? I thought I was just a fox monster!\nYour journey to becoming a true god begins!\nAn Idle system which allows you to become stronger without accessing the game!\nAuto level-ups! Use your own gear and skills to automatically fight the endless waves of monsters and develop your heroes!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232245,"name":"Trial of Dragon","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This is a pixel style classic turn based strategy (SLG) game. You need to form a multi-class team to adventure. With the Roguelike each game map is random, challenging different enemies, defeating the powerful Boss, obtaining various props and equipment, and upgrading heroes of each class.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232244,"name":"Pocket GM 3: Football Manager","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Following the success of Pocket GM 2021, it's time to manage your very own American Football franchise once again!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232243,"name":"Pixel Race: Endless Retro Racing","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Pixel Race is an endless racing game which you earn badges, unlock and\nupgrade cars while trying to win the Legendary badge.\n4 CARS\nEach new car is smaller and stronger than previous one!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232239,"name":"Vivid Relapse","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232237,"name":"Skeletons and Skulls","genres":[],"avg_score":0.0,"description":"Skeletons and Skulls is a game about a necromancer who summons skeletons to help himself.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232236,"name":"Dark Spasm","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232235,"name":"Wilbler Park","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232234,"name":"Mercury Station","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232232,"name":"Barbara vs. Zombies","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232231,"name":"Void Rogue","genres":[],"avg_score":0.0,"description":"Void Rogue is a Shoot Em' Up Platformer for Game Jolt Contest 9. Controls are found in the game itself. The game features fully procedural level generation, and three unique enemies to fight.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232230,"name":"Shopping Nightmare","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232229,"name":"DUCK: Dangerous Ultimate Cartridge Kidnapper","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232228,"name":"Room Cliker","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232227,"name":"Dead Zed Redemption","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232226,"name":"Faithful Friend","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232225,"name":"Picking up the Pieces","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232224,"name":"Run, Gun, Key, Fun","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232223,"name":"WrongKynd","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232222,"name":"Space War","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232221,"name":"Pandemonium Heart","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232220,"name":"Land of Traps","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232219,"name":"Dr. Moni Little Hospital","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232218,"name":"King of Fighters: Pocket Battle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232217,"name":"Tuber","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232216,"name":"Lokopolis","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232215,"name":"What's In the Safe?","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232214,"name":"Red Thread","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232213,"name":"Broken","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232212,"name":"Lord of Chaos","genres":[],"avg_score":0.0,"description":"You are an entity of disorder. The flow of time neither concerns nor binds you; you traverse worlds at your leisure, and you exist for only one purpose...To destroy!!!\nYou are the Lord of Chaos, a being that feeds on destruction, death, and rivers of blood! This is but a glimpse into the existence of the Lord of Chaos, as he appears on the site of a medieval field of battle, to lay waste to either side of the conflict.\nThe question is...how much destruction can you bring before the Lord gets bored, and moves on?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232211,"name":"Welcome Home Jacob","genres":[],"avg_score":0.0,"description":"\"Welcome Home Jacob\" is a dark and unnerving experience targeted at mature audiences. It was made in under 72 hours for the Meatly Jam.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232210,"name":"The Path","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232209,"name":"Sheltered Deep","genres":[],"avg_score":0.0,"description":"Sheltered Deep is a psychological horror game about desperation, cruelty and thin lines between right and wrong. Will your choices be your salvation, or will they doom your soul for eternity?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232208,"name":"Nitrovista","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232207,"name":"Innoquous 4","genres":[],"avg_score":0.0,"description":"The fourth in the series of gravity-flipping platformer games, Innoquous 4 is over four times the size of its predecessor! 75 levels with five distinct game modes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232206,"name":"Disco Rock","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232205,"name":"Jumpstart Apocalypse VR","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232204,"name":"Stone Cage","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232203,"name":"Black Evil 2","genres":[],"avg_score":0.0,"description":"Black Evil 2 is an horror puzzle action game in FPS. The game takes place in an obscure and realistic environment that will test the survival skills of the player. Look around yourself and use the objects wisely. Fear and stress will not leave you...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232202,"name":"The Red Planet","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232200,"name":"Letter Bank: A Free Strategic Spelling Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Letter Bank is a free strategic multiplayer spelling game. Compete against your friends to control the alphabet! Strategy and patience will guide you to victory. Better get out a dictionary.\nNot into competitive play? Letter Bank has 3 single player modes to practice your letter-fu... Each game mode has achievements to track your progress!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232199,"name":"Think About It!","genres":[],"avg_score":0.0,"description":"English:\nGuess the word! You have two lifelines available: revealing third word, or letter from left side. Just think about it!\nPolish:\nGra dostępna także w polskiej wersji! Zgadnij słowo. Masz dwa koła ratunkowe: odkrycie trzeciego słowa, lub litery z lewej strony.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232198,"name":"Hidden Objects Kids Room","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Are you ready for the latest hidden object game? If you're a fan of find hidden object games for kids, you're at the right place! Hidden Objects Playground is waiting for you! Spend hours of fun while playing this excellent find objects game! Hidden object games with colorful graphics and intuitive gameplay are the right choice for you! Enter the magical hidden object world and let the adventure begin. Crack the mystery by finding all the hidden items in wonderful pictures! Search and find hidden things in beautifully designed playgrounds. No matter if you're a kid or you're an adult – this awesome hidden object game 2018 will take your breath away! Start playing today, reveal the mystery object and find it in the pictures!\n1000+ objects!\nMagnificent graphics!\nCatchy sounds!\nHint system to help you!\nAwesome zoom feature!\nHidden Objects Playground is a high quality puzzle game for all generations of players! If you're looking for seek and find hidden objects with puzzles, this awesome educational game is exactly what you need! Enter the magical mystery world of playgrounds and have tons of fun by playing hidden objects for kids! Download hidden object games and start playing today – these phenomenal find the missing objects games will help you revise your vocabulary or learn some new words and will also test your concentration! Hidden object with levels of the best design – for your entertainment only! Find hidden objects in pictures of cute playgrounds for kids – look for hidden toys, sunglasses, food, drinks, and other things in magnificent levels! If you're ready for a true hidden object adventure, buckle up for the best find objects experience ever! We guarantee that you'll spend good quality time playing this photo puzzle game! Enjoy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232197,"name":"Wurds","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Wurds is a unique, varied and hugely enjoyable word puzzle game.\nNot only are there literally hundreds of millions of unique FREE puzzles that you can play as much as you like. You can also create and share your own games for a truly endless experience.\nCreate enough words to fill the board from the letter tiles you are given before running out of time to advance through the levels and up the leaderboards. Play without time limits in laid-back mode or create a globe of words in word matrix games.\nEach level is generated dynamically, so there are an almost limitless amount of levels to play. The words you have to find are not predefined either, so as long as you enter a real word that fits on the game board, you can play it.\nCreate your own custom games by defining a set of letters and words to find. Add a time limit, or not, and share it for any of your Wurds friends to play.\nOptional, plural and singular word checking and automatic entry. Say goodbye to the tedious process of entering slightly altered words over and over again.\nYou can play the standard game, free forever. You never have to buy anything.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232196,"name":"Big Head: Guess Words & Head Charades","genres":[],"avg_score":0.0,"description":"Big Head! is an amazingly fast, fun and exciting multiplayer game for you and your best friends / family / colleagues!\nTry to guess the word on the card that’s on your head based on your friends clues before the timer runs out and your head explodes :)","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232195,"name":"Wordium","genres":[],"avg_score":0.0,"description":"Wordium is a free-to-play asynchronous, turn-based word game where players take turns building the highest-scoring words using adjacent letter tiles.\nAs players score a word, the used letter tiles disappear and new ones drop onto the board, resulting in a constantly moving, always surprising gameplay experience! Players compete for 10 rounds: high score wins!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232194,"name":"Word Life: Crossword puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Thousands of levels, three different game modes, and regular special events to play! Download Word Life for free and start training your brain today.\nYour daily brain training is now called Word Life! Discover stunning landscapes while you sit back, relax, and play word puzzles.\nUnveil hidden words by combining letters and learn new ones with the app's dictionary. Puzzles start easy, but get challenging fast! Do you feel like refreshing your French? In Word Life, you can have different progress paths in several languages.\nIf you feel like going for an extra challenge, you can try out the Multiplayer mode, in which you'll be able to outsmart your opponent. Keep your brain fit and bask in the beauty of nature with Word Life.\nEmbark on this beautiful journey and level up your mental agility while you progress.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232193,"name":"Scrabbled Eggs","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Scrabbled Eggs - It's a word game\nWelcome to Scrabbled Eggs; a game all about making words - kind of like Scrabble - but on a vertical board... and against yourself... so not really like Scrabble. Maybe a little.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232192,"name":"Monsters have feelings too!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Monsters have feelings too! is a single player word game with role playing game elements. Battle monsters with your words and spend their money on shiny hats.\nThere is a princess to be saved. She may or may not have a sexy elbow.\nWoo her with your sesquipedalian arsenal. Go now, woo.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232191,"name":"Wordspie","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Love word games?\nWordspie is a game to make you adept at words.\nWordspie is an addictive word search game. The game presents to you 8 letters in each level. Keep forming words using those letters till you complete a level. You complete a level by earning points needed to complete the level in the provided time. You earn points by forming words having 3 or more letters. Each letter carries a point and the points you earn with a word is the sum of those individual letter points.\nImprove your word search skills","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232190,"name":"Word Peril Free","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Word Peril Free combines elements of multiple game genres and packs them into one addictive, fast-paced, and fun game.\nGuess the puzzle (without going bankrupt) by using visual and textual cues from within the game. You begin with 00 virtual dollars. You are rewarded 0 for each correct guess. If you guess incorrectly, you'll put yourself in jeopardy by losing 0 for each missed letter. Successfully completing the mystery word or phrase nets you 0.\nUse your Free Letter and Skip Puzzle tokens sparingly, as they are only refreshed upon reaching the next level.\nPersonal High Scores and Global High Scores (participation optional) are available so you can compete against yourself as well as the world!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232189,"name":"Word Tactics","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A real competitive online word game is finally available!\nDiscover the Word Tactics application, adaptation of the famous word game.\nPractice in solo mode to warm up and then challenge other players around the world by creating or joining duels. Try to beat your opponents and take the top of the leaderboard to become the Word Tactics champion!\nThe object of the game is to find a word made up of a fixed number of letters. Well-placed letters are marked green, existing but misplaced letters are marked yellow.\nPlay as many word grids as possible in single player mode.\nIn multiplayer mode, you win the duel if you manage to find more words than your opponent.\nDownload the free Word Tactics app available on iPhones and iPads.\nAccessible to all, the application will delight lovers of words, the French and English language and respect for spelling rules!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232188,"name":"Burn: Multiplayer quiz game","genres":[],"avg_score":0.0,"description":"Bored of lockdown video calls and run out of conversation?\nAsk questions > Write an answer > Vote for the best one.\nBurn lets you throw shade at friends, test your general knowledge skills, and have fun in a more interesting way. Choose between the following modes for each round:","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232187,"name":"Jewel Tycoon: Dig & Build","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sell created pieces at your shop to earn a fortune and expand to become real jewellery boss. Manage and customize you storefront to maximize profits and outperform the competition.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232186,"name":"AR Flappy","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Play Flappy bird in AR. Simply use your phone to view the space around you while you play.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232185,"name":"Triple Zoo","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Triple Zoo is a match 3 game combined with adorable animals to care for.\nBeat all levels to build your zoo.\nCollect all the animals and gold medals.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232184,"name":"Ninja Ponk HD","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232182,"name":"Super Bunnies Show Free","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"These funny bunnies are tired of doing tricks for their tough magician just to obtain a measly handful of pellets. Bunnies love fresh veggies and dream of escaping to the countryside. Luckily, now they can count on you to help them run away from the magician's top hat.\nDuring tonight's show, you will have to use all your talent to save as many bunnies as possible using the classic handkerchief trick and different types of trick cards that will distract the magician for a short time. But be careful, the magician will get angrier as more bunnies escape and things will get harder and harder.\nAfter saving a nice herd of bunnies, you will have the chance to play with them in two super funny additional modes to win carrots that you can trade for trick cards.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232181,"name":"Dr. Dino -Doctor & Dentist games for boys girls","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Play with Dino Hospital, be a doctor! Kids can do: Fill teeth, Check Vision & Colorblind, Injection, X-rays and joint broken bones, Check-up, and etc. Dr. Dino includes 8 department: Trauma & Emergency, Orthopedics, Dentistry, Ophthalmology, Otolaryngology, Gastroenterology, Physical Examination and Ward. Every department contains several fun puzzles and mini-games. There are 28 puzzles & mini-games supply for your choice.\nHurry up, Doctor! Dino Hospital needs you! It's so fun and fantastic!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232180,"name":"Space Rockets: Spaceship Rocket Simulator","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Isn’t it everyone’s dream to dive into space? Get ready for the ignition and have fun exploring the universe in this spacial adventure with fun and challenging missions!\nBrave the unusual terrains of Artiska, Platunia, Vulkar and Wentura in your daring journey and try to land with perfection on the most uninviting places.\nSolve the levels in multiple ways with your own strategy, but watch out for obstacles and be careful not to run out of fuel.\nCollect the bonus star of every level to get even more points. Attaboy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232179,"name":"Donut Maker","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Tie on your apron and come fry up some warm, delicious donuts! Roll up your sleeves and join in on the greasy and messy fun! The original developers of the 'MAKER' series bring you Donut Maker!\nFirst, mix the donut dough ingredients. After the dough is thoroughly mixed, roll it out using the rolling pin. Then, use the donut cutter to cut out each individual donut. Now, place each donut in the fryer until it is golden brown. Be careful not to forget about them or they will disappear in the grease!\nOnce the donuts are done to perfection, you get to decorate them! There are several categories to choose from so your donuts have just the right amount of icing and sprinkles! The decorating categories are:\n- Plates: Choose from a variety of fun plates to place your yummy donut on!\n- Icing: Select your base icing from an array of cute colors!\n- Paint on Icing: Find a contrasting icing color to paint on your own creative design!\n- Icing decorations: Select fun icing swirls and designs to add to your donuts!\n- Icing accents: Add some stars, dots, and loop-de-loops!\n- Candies and nuts: Sprinkle on fun colored candies! There are even cute holiday ones!\nFinally, it’s time to eat your donut… or two… or three!\nPost it on Facebook or email it to a friend!\nOr, save it in the fridge to show off or eat later!\nFor more fun, be sure to try your hand at Chop Shop and test your chopping skills or take the food challenge and see how many cupcakes you can eat in 30 seconds!\nDonut Maker is brought to you by the inventors of the MAKER series of games. If you enjoy our games, tell your friends, and write a review! Enjoy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232178,"name":"Math City HD","genres":[],"avg_score":0.0,"description":"This unique game gives children the freedom to study\nwithout stress. It equips pupils with logical reasoning,\nproblem-solving skills, and the ability to think in\nabstract ways.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232177,"name":"Cannon Basket HD","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Cannon Basket provides you a unique game play where you need to control the cannon direction with the help of your finger.\nTo the power release the touch and try harder to score more in the basket.\nThe interesting part of the game is that the basket will change its position at every level and becomes harder & harder to score more...! You have to shot the maximum of 25 levels of the game to become a Cannon Master and unlock Free Throws Mode!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232176,"name":"Pocket Farm","genres":[],"avg_score":0.0,"description":"Pocket Farm is the farming game you have all been waiting for on the iPhone! Unlike other farming games this one doesn't require you to buy additional points or virtual items after you've already paid for the game! Pocket Farm is not a clone, it's a unique experience you won't find in other farming games.\nNow you can build your farms wherever you go! Pocket Farm is a casual sandbox game that lets you build farms at your own pace and sell your harvest in a fun mini-game.\nWith only a shovel and a handful of seeds, build your farm from the ground up into a money making business. Buy fields, fences, a barn, tractor, pond, and a variety of animals. Place them where you want to design your farm the way you like it. Water the crops from your pond, or use a tractor to plow all the fields at once.\nWhen you've harvested enough vegetables that are in demand, head to the market where you'll have to pack customer's baskets with vegetables without letting them fall off the conveyor belt. Fill adjacent baskets to chain them together and collect bonus multipliers to earn the most cash!\nThis extremely addicting combination of harvesting and selling will keep your fingers moving and brain entertained!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232175,"name":"Aerial Austen","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"What was the weapon of choice in Jane Austen's time? Gossip. Tap tap tap to rise above, while avoiding the whispering windbags and prattle of mindless babblers in this Copter game parody. Tap to change direction as you fly up through weathered beams and talking heads. Help Jane Austen ascend to a new high score, but be careful, life is much harder than it looks!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232174,"name":"Find the Differences Detective","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Classic Find the differences now in digital format with funny images\nFun for everybody","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232173,"name":"Monster Sweetie","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Monster Sweetie is a cute 3D monster collecting RPG.\nVarious game scenes","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232172,"name":"Cats Are Jerks","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Want to swat birds out of the sky? Of course you do. Cause you're a cat. And cats are jerks.\nTap once to jump into the air. While in the air, tap again to punch birds right in the face! Avoid the Jetpack Dog or he'll punch YOU in the face. Cause sometimes dogs are jerks too.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232171,"name":"Pet Paradise Story","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Pet Paradise Story is a funny and joyful game where you’ll travel through a match 3 puzzle adventure! Come join our cheerful doggie, grumpy cat and little guinea piggie for their exciting journey! Travel through the countryside, beach, farm and pets resort looking for tasty treats!\nA joyful match 3 game for pet & animal lovers to make your day happier! Woof woof meow!\nDuring the adventure are offerings of achievements, combos and power ups.\nSwitch and slide the board of delicious foods to create matches of 3 or more as you trigger combos and feed your beautiful pets yummy treats. Reward them with tinned meat, fish, milk, dog biscuit, vegetable and hay cube they love!\nThe game also has a lot of interesting power ups like magic bomb, magic shuffle and super pet power that will help on difficult levels. Come challenge your friends and invite them to enjoy the amazing FREE puzzle games!\nSwitch and slide the board of delicious foods to create matches of 3 or more as you trigger combos and feed your beautiful pets yummy treats. Reward them with tinned meat, fish, milk, dog biscuit, vegetable and hay cube they love!\nThe game also has a lot of interesting power ups like magic bomb, magic shuffle and super pet power that will help on difficult levels. Come challenge your friends and invite them to enjoy this amazing FREE puzzle game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232170,"name":"Animal Village Rescue","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This game will spirit you away! The magical village is a mess and all of the cute creatures have disappeared. These little animals need your help!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232169,"name":"Learn Colors Shapes Preschool Games for Kids Games","genres":[],"avg_score":0.0,"description":"Teaches color identification and recognition by combining exciting card matching game play with professional narration, fun music and positive feedback. It's fun and easy for kids to use.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232168,"name":"Pet Peaves Monsters","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Three new spooky species have emerged...Battle them in an all new Haunted Hallow-arena! Then raise new pets and see if you can discover your own to keep!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232167,"name":"Coloring Animal Zoo Touch to Color Activity Coloring Book for Kids and Family Preschool Ultimate Edition","genres":[],"avg_score":0.0,"description":"Welcome to the Coloring Animal Zoo, where interacting with every page is easier than ever; simply touch to color! But that’s just the beginning!\nComplete fun tasks like popping bubbles in the aquarium, chasing the parrot in the aviary and helping cute little birds clean the hippo’s teeth!\nAs you complete each page new things appear to color! Touch the barrel and monkeys pop out, Touch each monkey to put silly hats on their heads!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232166,"name":"Car Factory Simulator","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Especially for fans of economic strategies, we made this game. An automobile factory is at your disposal. To be precise, you start with an empty factory and you will have to build it already.\nIt will be necessary to start with the installation of the first workshops - stamping and welding, where body parts will be manufactured. Next, the body will need to be assembled and painted. By the way, you can also choose the color of the car yourself.\nAt the same time, you will have to adjust the release of the suspension, as well as the motor. After that, in a special workshop, combine these components.\nNext, you will need to install the seats and dashboard and check the build quality. That's all this and much more, the players will have to organize in their car factory.\nWe have been working on this game for a very long time and tried to do everything so that you like it.\nWe will gladly respond to your feedback and wishes. The game is constantly evolving and improving, including thanks to our players.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232165,"name":"Orixo Hex","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Orixo Hex is here! If you like Orixo, you'll love Orixo Hex!\nSimilar to its predecessor, the goal is to fill all the empty hexagonal cells with the correct order of actions. As simple as it may seem, it can get quite challenging.\nDiscover an immersive puzzling experience through hundreds of hand-crafted levels and enjoy the relaxing soundtracks that accompanies you in your journey.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232164,"name":"Rally Drifters Racing Cars 3D: Ultimate Fast Car Gang Challange","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Rally Drifters Racing is a drift based rally game and not a traffic racer. Drive with hill climb, asphalt drift, and real dirt drift. Rally with drift together. This category redefined with Rally Drifters Racing. Rally Drifters Racing introduces best realistic and stunning controls for a rally game. Have fun with drifty and realistic tuned physics with detailed graphics, vehicles and racing tracks. Be a rally racer, drive as Ken Blocks, and Collin McRae on the tracks not in the traffic.\nFasten your seat belt and take the control of your extremely Powerful Car!\nYou have mastered acceleration, braking and steering!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232163,"name":"Legendary Racing","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Legendary Racing is a racing 3D game for iOS device for FREE !!.\nLearn the story of old glory racing from 60's to the modern world! Complete Career Mode and become a legend of Legendary Racing.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232162,"name":"Jumpy Road Race","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Survival on the Road. avoid obstacles and sink holes.\nMatch yourself with world racers\nInstructions: Use the phone's acceleration to move the car, and Tap to jump.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232161,"name":"Dirt Racing 2 Sprint Car Game","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Experience the Speed, Drifting, and Fun of all-out arcade Sprint Car Racing 2!\nThis is not your usual old school top view racing game. Sprint Car Racing is fast paced, slide around corners just as they do in real life. Win sprint car coins to upgrade the Engine of your car, or even better purchase faster and better sprint cars. Sprint Car Racing fun to it's extreme!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232160,"name":"Stick City Run 2 By Lettu Games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232159,"name":"DMBX 2: Mountain Bike and BMX","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The game is featuring Mountain Bike and BMX action... completely new levels and characters... new and more bikes... completely new physics... easy trick-steering and much more! Start your virtual biking season right now and try DMBX 2 for FREE !","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232158,"name":"Evil Zombies: Death on the Road","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"This game is a real find for those who sometimes likes to just stare at screen and turn away from the bustle of the surrounding events. Here you do not need to think about strategy, tactics or their actions. Choose a car and go on the road crush evil zombies. In the end, in addition to adrenaline and money, you get a status that reflects your personal style.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232157,"name":"Scroll Driver Lite","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Scroll Driver is a fun time-based vertical scroller driving game that makes use of the iPhone's accelerometer.\nThe object of the game is to navigate your car along a straight road that is littered with obstacles as fast as you can without crashing. There is a leader board, so your best times are stored.\nThis is my first iPhone game so the game play is quite simple. I am adding new features and game play based on comments and feed back from the community.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232156,"name":"Air Racer: Sky Traffic","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Air Racer is simple and interesting game. Overtake other racers in the sky traffic and earn scores. Collect stars and unlock new airplanes.\nSimple one-tap control: Tap screen and hold to fly up, release to fly down.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232155,"name":"Out of Brakes: Endless Racer","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Feel the Rush – Drive to Crash!\nOut of Brakes is an arcade-style racing game with destructible environments, eye-catching graphics, and varied vehicles.\nOut of Brakes offers a fresh gameplay mechanic that allows you to recapture the excitement you got from playing with toy cars when you were a kid.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232154,"name":"Survival Express","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"\"Surprise surprise!” - saboteur said and pushed the cart with a miner into deep cave darkness. Little he knew that exploring unreached areas will bring more fun than fear. There was no other choice for the miner than accept this upcoming challenge. The slight problem was that the railway seemed to end very soon… The good news is that it’s not the end of the story. Use your finger to build a safe track to continue this dangerous and dynamic journey. Avoid approaching rocks, collect gold and ride as long as you can keeping the miner alive. Super easy controls let you concentrate only on the gameplay action. Rail track follows your finger position on the screen. Simple as that!\nThink fast, use your reflexes to react quickly and dive deep into cavern ride!..","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232153,"name":"Aestha: The runner game","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Try Aesthar now! Explore magical worlds playing as the brave Kara and his mount Balkar, a magical rabbit that will help you overcome the most difficult obstacles that you will find along your adventure to defeat the evil Zelius. Aesthar stages will surprise you with its control system of the characters and incredible aesthetic. Aesthar features a soundtrack that will make you live a unique experience. Aesthar is the perfect game for your phone!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232151,"name":"Caribbean Rhythms Lite","genres":[],"avg_score":0.0,"description":"Play your favorites songs in this amazing caribbean percussion kit.\nConga, timbal and bongo!\nReal and cool sound, everything you need.\nEnjoy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232150,"name":"Dance Fever HD","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Dance across 16 cool places around the world. Life is music… welcome to Dance Fever!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232149,"name":"Beet: Drum Machine Game","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Beet is the finger drumming game that puts your grooviness to the test.\nExplore over 200 spicy beats designed by real producers.\nEarn shiny stars to unlock new beats.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232148,"name":"Rainbow Infinity","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bend your fingers and set your hands on fire with this unique piano-like game about spheres and spikes! Master your own eye-hand coordination while feeling like the unknown great-grandchild of Mach or Bozart (two incredibly renowned 18th century Rainbow Infinity virtuosi).","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232147,"name":"Not Match","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"\"Not Match\" is a fresh original reflex game with deep malice.\nOne tap to switch blocks and NOT match them!\n\"Not Match\" may break your heart, but you would like to suffer it.\nIf you start to challenge levels, don't to be scared at the begging.It may be easier in new levels, may be harder too.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232145,"name":"Chip Beat Blaster","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Chip Beat Blaster is a rhythm platformer game featuring a world-class artist lineup. It's made by people who love rhythm games, chiptunes, and old school games.\nHelp Riff Radical save the world from evil catfish attorney Bill Johnson using the power of chip music and his homemade 'famiguitar.'\nChiptune music is electronic music made using the sound chips of vintage computers and video game consoles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232144,"name":"Tiny Fat Hero","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Tiny Fat Hero is here to clean the city","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232143,"name":"Tap Tap Ants","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232142,"name":"iMimic: 80's Vintage Electronic Memory Game","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"The 80's are back! And your memory will be challenged by this retro-style electronic game*. Repeat the sequence of tones and lights played by iMimic - it starts with a single tone and every round the sequence gets one tone longer\nThe faster you tap the sequence, the higher you score. Climb up the leaderboards. Collect all achievements.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232140,"name":"Drum Girl","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232137,"name":"Glitch","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Its probably supposed to be like that. Maybe.\nYes, Glitch looks a lot like Pong. Its supposed to. It doesn't play much like it, however. Glitch takes common bugs made in game development and makes it the point of the game.\nOr, maybe the point is to just sit across from someone see how long you can play, despite the Glitches.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232135,"name":"Soccer Cup: World League","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Equip with the latest soccer AI moves, this is the ultimate soccer game. The Arena is designed with HD graphics and an enthusiastic crowd. Enjoy the ultimate 11 player soccer simulation.\nSoccer fever is high! Do you love soccer? Then this is the game for you! Download this game and polish your inner champion.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232134,"name":"Scream Barbellman","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Use voice to lifting barbell , gradually it will be play difficult for you , an obstacle appears , you need to lift the bar by miss obstacles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232133,"name":"Snake Champions","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A fresh take on the classic snake game of the 90s. Hone your skills and play against players around the globe to win real money/prizes or just play for fun. Eat the same type of fruit consecutively to score big combo bonus points, collect power ups and unlock all playable snake characters. Powered by the Skillz multiplayer eSports platform ensuring fair skill based competition with features such as leaderboards, tournaments, trophies and a loyalty program which rewards you just for playing. Embrace your inner competitive self and become a Snake Champion!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232132,"name":"Rope Basketball","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"This game is for those who want to throw the ball endlessly into the basketball hoop.\nIf you score 31 goals in a row, you can move to the next level.\nLet's go to the new world of basketball.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232131,"name":"Golf knight","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Play through various mysterious lands, Ice Mountains, and the hidden caves, and unravel their hidden secrets!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232130,"name":"Rope Apple Golf","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"It's a new golf game where you hit the target.\nOf course, it also includes the traditional way of putting the ball into the hole.\nIt is not easy to hit a moving target.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232129,"name":"Twin Kickers","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"It's a game where you kick all the balls like crazy.\nThere are two kickers who kick the ball, but it is not easy because the ball is fast.\nMoreover, the more the game progresses, the more balls there are, and the speed of the balls increases.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232128,"name":"Madfut 23","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to the new '23 season, with more amazing content and modes than ever before!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232125,"name":"Eat Your Words: Word Puzzles","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Those of us who enjoy Sunday mornings with a hot tea and the crossword section know that there is nothing quite like a great word game. The combination of racking our brains because we “know this one” and the sweet satisfaction of finally solving the puzzle warms us to the core. We word game lovers are a special group of word-aholics and Eat You Words is here to give you your fix!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232124,"name":"Hex Words: Word Search","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Whether you’re a crossword contestant or just an active anagram athlete, Hex Words will help you fill your day with more word finding fun!\nWhy find only a handful of words when you can find them all? Compete in the Daily puzzle to see where you rank amongst word-wise users worldwide.\nOr if competition isn’t your cup of coffee, try Adventure mode! Each puzzle hides 6 related words, and it’s your challenge to find them. There’s only 19 letters on the board, how hard can it be?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232123,"name":"Letter Pick","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Choose your letters to create the best word possible. Letters are scrambled differently each day. Easily compare your score to those of your friends.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232122,"name":"Letterary","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Letterary is a contemporary word search.\nFind the hidden nine-letter word by sliding from letter to letter.\nThe finished word will always form a 3x3 square.\nFor a tip, check the clue or opt to reveal letters.\nOn the results screen, tap a word to revisit its clue or see the definition, or share a digest of your solves.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232121,"name":"Experdle: For Word Experts","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Experdle is a great challenge for everyone!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232120,"name":"Emojly: Emoji Logic Puzzles","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The task is simple: Solve the emoji wordle combo in 5 tries or less. Each combo has 3, 4 or 5 emojis.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232119,"name":"Chain Letter","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Daily Word - Everyday A nine letter word is waiting to be unscrambled, use the hint, solve the puzzle. Come back everyday to play a new word and build up your streak.\nAlphabet grid - Want to learn the mechanics, or simply pass the time? put the alphabet in the order within the time limit, play as much as you like and build your streak.\nTake on the four by four and five by five alphabet grids, more letters, more moves, not enough time, how fast can you put the grid in order?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232118,"name":"Booblyc TD: Tower Last Defense","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A guy fell asleep at the table, playing his favorite war strategy game on a smartphone. He dreams of an unusual dream that he gets just in the heart of td battles with orcs. The local empire warriors greet him, telling him that it would be nice if such a mage helped them in the castle siege. And now you can't tell the difference between the dream and reality...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232117,"name":"Multiplication: The Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Are you tired of motivating your child to learn multiplication tables? Then let’s play Multiplication - the game!\nIn this game, multiplication tables are practiced and consolidated in a playful way. The high score hunt provides motivation to keep practicing.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232116,"name":"Aircraft Flag Quiz","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Aircraft Flag Quiz is a quiz-game that let's you test your worlds flags knowledge and your finger reflexes. Enjoy easy touch screen control. Learn, memory new flags every day.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232115,"name":"Kuma 2015","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Survive four secret scenes to get the mysterious treasure! Complete all levels, and try to get three stars in each level!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232114,"name":"Pictables","genres":[],"avg_score":0.0,"description":"Pictables is a unique Picture Pronunciation Word Game.\nFor each puzzle, a series of images are presented that help form a common phrase of one or more words.\nPhrases include famous people, places, things, historical events, etc..\nPlayers are awarded token points each time they correctly guess the phrase.\nPlayers can spend their tokens to view the image sequences additional times or to see hints.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232113,"name":"Don't Step White Tile: It's Me!","genres":[],"avg_score":0.0,"description":"Don't Step White Tile - It's Me is the most popular leisure and entertainment game,which can test your speed and accuracy!\nPlaying is simple, but the process is very exciting. Come and experience it!\nstep, step, step ......","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232112,"name":"Quiz Movie!","genres":[],"avg_score":0.0,"description":"Do you love movies? If so, you’ve found the right game for you! Think\nyou're a true movie expert and can guess any popular movie without\neffort?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232111,"name":"Hi Guess the Movie 2016","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Watch the pic and guess the movie out!\nThousands of movie puzzles available. The hottest 2016 charts added.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232110,"name":"Ancient Demons","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Collect elements to attack your demonic foe or increase your own energy. Collect spirit rings to assist in your plight. But beware of demonic pentagrams causing destruction. Prove your abilities on Game Center. Success is not guaranteed.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232109,"name":"Charlotte's Table","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Welcome to Charlotte’s Table where you can create the restaurant of your dreams!\nChoose your menu items and the look & feel of your restaurant. From interior design to table settings to food plating, Charlotte’s Table offers many choices to create both a lavish and welcoming restaurant for you to call your very own.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232108,"name":"Xmos","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Santa has an overload of things this year and needs your help to reduce them!\nCombine three or more of any kind, and they will disintegrate. The longer you can keep up, the higher the score.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232107,"name":"Joggle: Word Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enjoy a word puzzle game unlike any other you have ever played.\nYou get a clue and a six-letter word. Solve the clue by changing two letters in the given word. You have 60 seconds.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232106,"name":"Fantasy Solitaire: Card Match","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"All Fantasy Solitaire puzzle and story content can be experienced without purchase. Ads are optional as part of a prize wheel (they are not in the rummy card puzzles game). Play our rummy and solitaire card puzzle game as much as fits your day!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232105,"name":"The Tower of Muuda","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Simple & speedy puzzles on the stage you saw in the past\nA match-3 puzzle adventure where you fight with items!\nFind hidden treasures and reach the top floor of the tower!\nThe second game that never crosses generations!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232104,"name":"ReDrawn: The Tower","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A mysterious tower holds the secrets to untold power and the little girl who wields it. Iris is the key to your world’s future and can bring her art to life, but an unknown evil wants to keep her from her destiny. When she’s captured and trapped somewhere in the tower, only you can rescue her and save the kingdom in the process!\nCan you traverse the worlds inside her paintings to reach her in time? Find out in this spell-binding Hidden-Object Puzzle adventure!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232102,"name":"Drum Beat Jump","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Do you have the reflexes to be a percussion master?\nFind out now!\nDrum Beat Jump is a music game, where you are rewarded for keeping\na steady beat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232101,"name":"Chicobanana: Space Pong","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play Pong with a monkey as ball!\nOne or two players, you can play together with your friend at your side on the same device. Chicobanana loves to play this crazy game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232100,"name":"Round Space","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"\"Round Space\" is a fresh and original sci-fi style arcade.\nWarning: If you are not a good pilot, you may feel dizzy.\nFlying around an damaged planet, collect stars and avoid obstacles.\nInclude endless mode and 100 levels mode.\nWhen you are playing, you will get coins to unlock more fighters or continue games.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232099,"name":"Halloween Run!","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Strategically navigate your way through this minimalistic Halloween poster inspired game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232098,"name":"Pixel Pro Snow Fight","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The aim of Pixel Pro Snow Fight is to conquer a smorgasbord of enemy hideouts, collecting various medals as you go. To achieve this, players command an elite squad of snowball slinging warriors who must capture the enemy snowmen and flags.\nSnow Fight provides a fun control system, combining drawing and taping. Players direct their commandos by drawing the path they would like them to take, then throwing snowballs at all-comers as they follow the path.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232097,"name":"Woozzle Reborn","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Woozzle is a puzzle game about finding the right path for crazy marbles. You have to be smart to understand the labyrinth of cross-roads and quickly set the right path for each color marble to its correct dock. This game brings a steady dose of fresh techniques and puzzles coming at you at all times. Tens of different obstacles and features allowed us to create amazing levels with many different mechanics and twists. Try Woozzle for free and buy full game later, no ads, no disruptions. Just pay once and play forever. We have plenty of new ideas and pile of new levels in the queue.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232096,"name":"Grows: Journey to the Sunshine","genres":[],"avg_score":0.0,"description":"There exists a journey,beautiful and colorful Scenes,Peaceful and quiet music, extremely interesting grows trip.\nA seed,go through dark mud,pass hard and big stone,avoid the attack of all kinds of animal,finally,break the limit of mud and appear on the ground,all of which make your blood go fast in the vain.\nThere must be something make your heart beat faster,may be it is a piece of music,or may be a beautiful scene…","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232095,"name":"Band Land","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"How many bands can you name?\nFind it out in the most comprehensive music bands trivia game in the app store!\nWrite the name of the pictured band to clear a level. Do it as fast as you can and earn high scores and earn Band land coins!\nStuck in a band you can't name? Use the coins to get valuable hints or ask your friends to aid you via Twitter or Facebook.\nLevels are unlocked progressively, but don't forget to clear them completely in order to get all the achievements and the highest ranking in the GameCenter leaderboard!\nFeaturing more than 200 bands to guess divided in 10 levels of ascending difficulty: from the most popular classic to the most obscure title only true audiophiles will be able to identify!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232094,"name":"SuperStar: Oh My Girl","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"You're invited to the rhythmic secret garden with Oh My Girl\nWeekly Oh My Girl Song & Card Theme Update","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232093,"name":"Music Star: Life Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Less than 1% of musicians make it on the path to super stardom! Start at the bottom of the music world and climb the ladder of fame as you create chart topping hits, negotiate record deals and create a musical legacy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232091,"name":"Trombone Hero","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Trombone Hero is the mobile trombone-based rhythm music game. Unlike most music games, you can freely play any note at any time. You're not just following along with the music, you're actually playing the music!\nThe better you play, the more points you earn!\nImprovise and play whatever you want in freeplay mode!\nCollect every song from the collection and become the true trombone champ!\nPlayable with just one finger!\nEntertaining for all ages","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232090,"name":"Rock on: A SongPop Adventure","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Crank up the volume and join the band - it’s time to ROCK ON! Quiz yourself on the best of Rock in this spin-off of SongPop, the award-winning music trivia game.\nEmbark on an adventure through the world of Rock ‘n’ Roll! Listen to clips of Rock hits and guess the correct artist or song. Shred your way through Classic Rock, Heavy Metal, Punk Rock, Pop Rock, Indie Rock, and more. Master each level and become a Rock Legend!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232089,"name":"Lessen","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Special art work, you will never forget.\nStack stripes to make a beautiful rainbow shape when it lessening.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232088,"name":"Spellt","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"SPELLT is a daily word game. Find as many words as possible from a set of letters. A new puzzle comes out every day!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232086,"name":"Dylan the Driller","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Help Dylan build his city!\nDylan The Driller is a construction-based tower building game that is extremely addictive. Try to build the tallest building. Experiment with different tower shapes. Remember, the tower takes the shape of a construction that you make, which gives you the power to make unique buildings.\nPlace the buildings that you like in your city. Try making the coolest city possible. it would be pretty cool if the highest skyscraper was in your town!\nAlso, you get different accessories from the chest and from completing some achievements, you can combine those accessories to make some interesting outfits for Dylan.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232085,"name":"Wrestle Champs","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Take control of a wrestler's career, from hiring, to training and of course watching them wrestle matches as they go from a green rookie to a seasoned veteran!\nCollect move cards, training cards and create a deck of cards for each of your wrestlers!\nWrestle Champs is a unique community driven multiplayer game. Hire wrestlers, enter them into wrestling shows that happen at real times during the day and watch as they compete against other wrestlers from players all over the world!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232084,"name":"Olympic Games Jam Beijing 2022","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Welcome to the world’s biggest winter celebration! Olympic Games Jam: Beijing 2022 is a wild party game where up to 20 players compete in real-time through a series of chaotic mini-games until one champion emerges. Weave your way to the head of the pack in snowboard cross, pull insane tricks in slopestyle, and hog up all the power-ups in skeleton as you race to the top of the podium. From top hats to Yeti suits, customize your avatar to bring your unique style to the competition. Play to earn NFTs that can be traded for money on the nWayPlay Marketplace. Let the Olympic Games begin!\nMAYHEM EN MASSE\nIt’s Olympic sports like you’ve never seen before. Connect and compete with up to 20 contestants from around the world in a series of randomized wild mini-games until only one player remains.\nYOU DO YOU\nWhile the competition may be stiff, at least look your best when you flop. Customize your avatar from astronaut helmets to hot dog suits to express your individuality and stand out from the pack.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232082,"name":"Xmas Santa Mad Sleigh Run","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The fastest Santa Sleigh ride on earth! Slide down the mountain and avoid the trees!\nX-mas Santa Mad Sleigh Run, is an easy to play arcade game.\nJust drag your finger left and right to move Santa.\nWatch-out for the Trees, Snowman and huge Candy Cane\nas you slide down the mountain.\nStart slow and build speed as you go down the mountain\nuntil you get almost supersonic!\nWith one hand, one thumb controls, this game is\neasy to play, fun to master!\nIf you're looking for free Christmas\nfun games you've just found it!\nHave fun this Christmas holiday season:\nGet it now!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232081,"name":"Odin's Adventures","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"If you like games with cool design, great music and interesting gameplay, then game \"Odin's adventures\" is what you are looking for.\nImmerse yourself in the relaxing world of Odin, admire the beauty of the Swiss Alps, but do not forget about obstacles on your way.\nHelp Odin, experienced extreme rider, to conquer the mountain. Go around the rocks, accelerate on the slopes, jump over pits, but watch out for tire wear.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232080,"name":"Basketball Games!","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Dunk the ball through the hoop and aim for the perfect swish! Jump and rebounce from wall to wall up into the infinite sky.\nAre you ready for this new challenge against time?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232079,"name":"Mad Freebording Snowboarding Free","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Mad Freebording is a skating game featuring the new sport Freebording. It feels like snowboarding the streets. This game offers over 30 missions on 18 levels, large variety of clothes and items, realistic levels and pure fun. Ride, level up, improve your skills, customize your clothes and get involved with the world of freebording! This game is the successor of Freebord The Game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232078,"name":"Plumber Crack","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Throw stuff at the traditional Plumber Crack under the kitchen sink. Or, go for the second most popular crack sighting: the IT Technician under your office desk. Plus we're adding new scenes all the time for you to hone your \"crack\" throwing skills.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232077,"name":"Timber Roller","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Test your skills in this funny fast paced arcade game where Timberman goes roller skating!\nRoller-skate as far as you can! Jump over the river and get to the new world!\nRide across the suburbs, snowy winter streets, post-apocaliptic city, disco club, beach and the space station!\nUnlock all the funny heroes including a pirate, baller, cop, ninja, knight and a princess!\nRemember - in Timber Roller every tap changes skater movement direction!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232076,"name":"TapKick 2014","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Join the Tapkick 2014 tournament ! - Simply tap when the ball is between the lines\nSee if you can keep the ball up longer than your friends !\nThe simple \"tap\" gameplay (famous from Flappy Bird) turns Tapkick 2014 into a game for everybody and all ages.\nPick your country from any of the 32 competing countries, and beat your friends high-scores and become the Tapkick 2014 king!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232075,"name":"Wolf Game: Wild Animal Wars","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Team up with wolves from all over the world to fight with other wild animals - to survive, explore, hunt, challenge, and revenge. As the Alpha of your wolf packs, you will lead your wolves to defend your den and rise to the top of the food chain in the wild!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232074,"name":"MaxWord","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"MaxWord is for busy word game lovers looking for a diversion when they have a few minutes between meetings, chores and appointments. Enter correct words with the letters provided to make them disappear before the grid fills up. This is a multi-level game and the user may choose to post their scores to our web site.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232073,"name":"Elevate: Brain Training","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Elevate is a brain training program designed to improve your mind’s focus, memory, speaking abilities, processing speed, math skills, and more. Each person is provided with a personalized training program that adjusts over time to maximize results.\nThe more you train with Elevate, the more you’ll improve critical cognitive skills that are proven to boost productivity, earning power, and self-confidence. 90%+ report improved vocabulary, math skills, and overall mental sharpness when they frequently use Elevate.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232072,"name":"Word Pop: Endless Brain Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Challenge your vocabulary and speed with this awesome word game!\nFind as many words as you can while you race against the clock. Every word you find earns you points and adds more time, while more letters are added to the grid. The longer the word, the more points you get!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232071,"name":"Slice Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Slice Words is a fascinating mix of crossword and puzzle.\nChoose from two game modes:\nRestore a crossword puzzle from pieces of words using a clue, or test your knowledge of foreign words and learn new ones in Language Quiz","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232070,"name":"Reveal! Multiplayer Edition","genres":[],"avg_score":0.0,"description":"Reveal Multiplayer Edition is a turn based picture guessing game where you can play against friends or random opponents. It's fast, fun and super simple - just scratch the image and guess the answer! The less you reveal, the more points you earn!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232069,"name":"Guess the Celebrity","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Are you interested in famous people? You’ve found the right game for you! Do you think you know celebrities better than others? Let's see if you can prove it!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232068,"name":"Japanese Dungeon: Learn J-Word","genres":[],"avg_score":0.0,"description":"Are you still trying hard to memorize Japanese words?\nLet's learn it in easy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232067,"name":"Word Strike","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"What's the word we are looking for?\nEach puzzle contains four words that are associated to the answer, can you figure it out?\nFor instance, what do Superhero, Joker, Robin and Alfred associate to? Or, can you figure out what Antarctica, Ice, Water and Titanic have in common?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232066,"name":"War of Words 2","genres":[],"avg_score":0.0,"description":"Get ready for the ultimate word battle! An exciting blend of turn-based strategy and crossword game, War of Words 2 pits you against up to 3 other players for an all-out word destruction brawl!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232065,"name":"Word Cafe 21","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Are you looking for a unique and challenging word game? In Word Cafe 21 you are presented with words related to a topic. The letters are all scrambled and you have to move them into the right places to guess the words. Sounds easy, right? Wait until you give it a try.\nCategories include: Box of Chocolates, Movies and Things, Famous Authors and Lyrical Lane.\nEasy, Medium and Hard levels control the words presented per topic. Move the pieces by tapping on letter and then space or pushing them around. Get more points for getting the words on earlier tries!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232064,"name":"Trivia Town: Quiz Duel","genres":[],"avg_score":0.0,"description":"Knowledge is the key element in Trivia Town. You compete to see who knows the most and can come up with the biggest amount of right answers. Trivia Town is all about quizzing, and you battle friends and new faces. With 20,000 questions, the game is a constant challenge. If you are a genius, it will soon become apparent to all, when you take part in this fair and fun online pop quiz feud. Even though fairness ranks high within Trivia Town, you still have the opportunity to influence your fight against your opponents. When you play the game, you can bet on your answers. For every question, you can choose whether to bet 1, 2, 3, 4 or 5 points when you submit your answer. In this way, you can crack your opponent in one of two ways: By being the biggest knowledge genius, or by playing the game strategically. In other words: Trivia Town is a challenge for all types of players.\nA battle within Trivia Town takes just under two minutes, so finding time for a quick pop quiz and a fun game between friends is nearly always possible. The 20,000 questions are divided into ten topics: Music, Movies & TV, Geography, Society & Politics, Science & Tech, Nature, Sports & Games, Food & Drink, History and Art & Literature.\nTo help you look for the right answer every question has been equipped with a picture. At the same time, you get to play in peace, free from disturbing ads and unfair power ups. We have worked hard to make sure that Trivia Town is a “clean” brain exercise with no interruptions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232063,"name":"WordPlus: Unique Word Game","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"WordPlus is a word search build game to test your word power and analytical thinking power.\nYou have to plan your moves wisely to defeat your opponent.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232062,"name":"Game of Skulls","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In Game of Skulls you are playing against an AI, trying to predict its moves and come up with a counter strategy. The rules are simple but coming up with the right strategy is a serious challenge.\nBoth you and the AI start with 12 cards. In each round, you both play a card on different stacks collecting penalty points. Whoever has the least amount of penalty points at the end wins. You can play multiple rounds and keep track of your overall score.\nThe game has two difficulty modes. One mode for beginners that doesn't keep a persistent score and a challenge mode.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232061,"name":"God of Math: Train Your Brain","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The overall difficulty level is so that elementary school students can enjoy it, and play and enjoy the four rules operation as a game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232059,"name":"Font Quiz","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Can you recognise these famous fonts from movies, brands, video games, tv shows and bands?\nFont Quiz is a free app with more than 200 different fonts to identify. Simply tap on a font and type in the name..","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232058,"name":"Football Players Quiz","genres":[],"avg_score":0.0,"description":"Test Your Football knowledge with our Football Players quiz!  Guess the names of the top 275 football players by correctly identifying their face. To help you along the way you can earn hints and tips as well as stars that will reveal the less obvious ones! If you still get stuck you can also ask a friend on Facebook and Twitter to help you with the answer.  So you think you know football? Lets see how far you get....    More Tips for your success:  Type the full name of the player for maximum points or alternatively type just the first name, surname or nickname for a pass.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232057,"name":"What Belongs?Find Hidden Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Follow the given hints to reach the hidden word.\nThe less tips you use, the more points you collect.\nThe new dimension in the word puzzles.\nAre you ready for sleeplessness?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232056,"name":"Flappy Dot Up!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The game is really simple,But you can't stop it!\nTap the screen to jump,Avoid the moving square.How long can you get!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232055,"name":"Line Points: Challenge your coordination","genres":[],"avg_score":0.0,"description":"This is a game that very test coordination of hands, you need to use both hands to control two points on the screen, through angle forming from the line between two points to control the movement of the ball, eat stars as much as possible. There are 6 balls in the game for players to switch, respectively, basketball, football, tennis, billiards, golf, baseball. Each ball has fixed weight and flexible setup, and there will be a totally different sense for control.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232054,"name":"IG Arena: Idle RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"When the three realms of Heaven, Mortal, and Hell were experiencing a chaotic period, their kings started to become greedy. All of them craving for a throne that could dominate the three realms, and their desire leads them to an epic war that seems to be endless.\nParticipate with thousands of players in a NEW AFK 5v5 PvP interesting game ever! Summoning immortal gods, build your own squad, collecting gems, diamond, lethal weapons and many more attractive items.\nWho will be the Only King? Drown into our addictive Idle RPG battle of Immortal Gods Arena to find out!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232053,"name":"Emoji 2 Words: Guess and Sort","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Emoji 2 Words Guess and Sort is a brain challenging puzzle game. Search and find hidden English words by combining two or more emojis .","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232052,"name":"Wolf Boot Camp","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Do you know the three little pigs and the wolf story? Do you know the story about the wolf after it? If you know or do not know, Come and try this game. If you are looking for a fun game, Come and try this game.\nWolf Boot Camp is a young wolf on the story of growth and exercise.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232051,"name":"Stay in the White Line: Level Version","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"It’s never been so easy to play, you just have to control ball on the screen and try to stay in the white line reach the goal.\nThe game is the test of your patience and the stability of the hand. Complete the level is not difficult, but it's hard to better scores. Can you complete within 3 seconds?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232050,"name":"Icontrivia: Guess All Things Christmas","genres":[],"avg_score":0.0,"description":"From Santa Claus to Rudolph and all their friends in North Pole, it’s time to guess all things Christmas! Guess all your favorite things about Christmas from decorations, traditions, characters, foods, clothes and others, in this highly addictive word guessing game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232049,"name":"Magic Memory Match Free","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Magic Memory Match is a matching game featuring basic elementary level themes with some fun ones thrown in. See how fast you can match all of the cards! Keep track of your best time for each category.\nA magical matching game, fun for players young and old!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232048,"name":"Islands and Ships logic puzzle","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Islands and Ships logic puzzle has a really delightful gameplay and it can be a great brain training tool for you as it features 1700+ logical problems divided into 1700+ levels and will allow you to have a lot of fun while providing amazing brain exercise.\nYou can enjoy this solitaire logic puzzle game offline for hours anytime, and it's free to download!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232047,"name":"Fall Jo!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In this challenging game a ball is falling by gravity. Your goal is to guide the ball to the ground by avoiding nasty obstacles. Tap the screen and get a boost. This way you can get through the obstacles. Game Center for high score leaderboards!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232046,"name":"Candy Adventure HD","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Forgive us, can not give you a bottle of drink. But to believe that we can give you a different experience\nGo into the Candy Adventure, We will give you a cool summer.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232045,"name":"MapaboX: Trivia & Quiz game","genres":[],"avg_score":0.0,"description":"If you love TV shows like “Who Wants to Be a Millionaire?” Or “The weakest link”, then you will definitely like mapaboX.\nThe game consists of 10 rounds and up to 4 people can participate in it.\nThe goal of the game is to get maximum points. Your knowledge, intelligence and ability to make the right move will be the key to winning this game.\nIf you want to have fun with your loved ones, friends or other people from all over the world, mapaboX is a great choice! It doesn't matter if you speak the same language.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232044,"name":"Dead Giveaway: Zombie Quiz","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The game show of the dead. Don't let the zombies rattle your nerves, earn your freedom before it's too late.\nIn this zombie quiz game, you will have to answer some of the craziest questions and pit your wits against the leader of the zombie revolution.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232043,"name":"Pop-a-Chick","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A fun, simple and intuitive 10-minute carnival style skills game to play and replay to beat high scores.\nGrandma & Grandpa are at the carnival for the day, you're in charge. Don't let the chickens out and catch 'em quick before they return!\nInspired from traditional bean bag toss with a touch of rhythm and surprises at each level. The chickens escape randomly for a unique challenge every time.\nIncludes awesome Bluegrass music which you can also mute to play your favorite tunes in the background player of your choice.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232042,"name":"Dig!t","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"There are three simple rules + one secret rule. Tap on an empty field to fill it with a number. Each tap increases the existing number by 1. Adjacent boxes filled with a number increase each other.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232041,"name":"Ridiculous RPG","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ridiculous RPG - Boy - Hurry to School is a 8-bit RPG game. You are 'Boy', a 15 years old student who is hurrying to school to take the exam. On the way to school, you aware that the 'Dark Power' is awakening, the power that can destroy the world!\nOn the other hand, another character called 'Kid' is going to investigate the boss behind the power. During the investigation, Kid's real memory is gradually awakening. Kid is not a normal kid. He has a dangerous power that is much dangerous than the Dark Power, the power that can destroy the whole galaxy!!!\nYou'll encounter different monsters in different dungeons. Fight the monsters with cards. Choose a 'Sword' card if you're going to attack the monster. Choose a 'Shield' card if you're going to protect yourself. There are also 16 'Special Cards' during the battle. e.g. Poisons the enemy\nYou'll get coins and knowledge points in the game. Use coins to upgrade weapons. Use knowledge points to study hard in academic subjects to increase your own strength. Defeat the monsters to gain experience.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232040,"name":"Four Horsemen","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Four Horsemen, a battle strategy game, provides you with an outlet to multiple gameplay based strategies. It is available for everyone who desires to play a survival adventure game with revolutionary war game layouts. You can jump into this adventure anytime, anywhere to defend your troops in battle and protect your shelter, offering MMO strategy challenge missions for players to play in their free time in an online multiplayer style format.\nStay alive in this post-apocalyptic battleground by battling unexpected enemies and outwitting top strategic alliances. Hone in your strategic skills by upgrading your troops, developing captain enhancements, and joining up with others to fight for survival.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232038,"name":"Pizza Turtle 4evr","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Be the turtle. Eat the pizza. Eat pizza 4evr. Tap to fly and eat pizza.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232036,"name":"Slingshot Blitz: Rewarded Play","genres":[],"avg_score":0.0,"description":"This is the first Slingshot Shooter Game of its kind, with real-world rewards and cash prizes (where available)! Shoot the bottles strategically to earn the most points and win the game.\nA quick and enjoyable Slingshot Shooter that is easy to learn but challenging to master.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232035,"name":"Minor Miner: Mining Action","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Avoid the High-Tech Goblins and Conquer the Mines!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232034,"name":"Talking Tom Time Rush","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Run fast through the Magic Gate! Tom, Angela, Hank, Ben, Ginger and Becca dash into an awesome adventure together!\nTalking Tom Time Rush is the all-new runner game! Tom and friends have found a Magic Gate but the Rakoonz crash the fun. They steal the Crystals and escape into a fantastic world!\nPlayers join Tom and friends as they jump into wonderful worlds, explore unique side paths and discover special surprises together. It’s an epic chase after those rascal Rakoonz to recover the Crystals!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232033,"name":"Catch Bus","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"We've all been there. Your bus comes and it's a race to the bus stop. Play 3 levels of difficulty in catching the bus! Run!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232031,"name":"Sticky Castle","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The story of how a group of sticky blobs are going to rescue the Queen of Stickiness who is held captive in a big castle! During this adventure, our sticky friends will use their stickiness to fight enemies while avoiding dangerous traps and escaping from a deadly pool of lava, yikes! They will also smash bottles to pieces. A lot of bottles.\nSticky Castle is an exciting fast paced action game, that is easy to control, but definitely very, very hard to master. Help your slimy and sticky friends to rescue the Queen of Stickiness. Use your strategy and timing skills to perform incredible stunts, avoid dangerous hazards, defeat enemies, complete missions and just be epic. Do you have what it takes to reach the top?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232030,"name":"Speedy Stacks","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Test your hand eye coordination as you tap to drop the blocks and stack to the goal line. Things get difficult quickly as you cruise through the levels in Speedy Stacks!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232029,"name":"Cathode's Journey","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Cathode the TV Cat traverses polychrome fields of light while the Infinite Spiral shifts and twists in endless ways. Dancing in the timeless space around you the Neon Butterfly flirts, ever out of reach, only to transport you to the next level - if you dare!\nCathode's Journey is an experimental audio-visual indie game. There is no distinction between music or sound effect; your actions play a part in a duet, which is also a playful duel. Time and speed is elastic, controlled by how well you manage to collect jewels and avoid obstacles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232027,"name":"Rooms of Dread","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Rooms of Dread sweeper game is a new take on classic mine or miner gameplay. Easy to pick up and play. No need to learn complex mechanics. However, mastering the game will require some serious skill.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232026,"name":"Room Escape: Scary Horror Game","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Room Escape: Scary Horror Game - start your creepy adventure in one of the best escape games and scary horror games and be the first to solve all the mysteries and riddles of the new escape game! The deadly horror survival games for offline escape.\nLooking for a brand-new horror escape game? Like to compete with horrifying 50 rooms? Halloween escape has got you covered! Join us to enjoy the best-haunted house escape online for free！\nThe Dark Night Mystery - Find ways to solve mystery puzzles to the escape room plan\nExplore the horror hospital, find hidden clues, solve terrifying puzzles, open locks to doors and advance your investigation. The goosebumps game is a mixture of Halloween and scary escape quests.\nIf you like horror games and creepy adventure experiences – fear room xscape is the game for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232025,"name":"Don't Touch the Island","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Use the paddle to swipe across the screen to defend the ball that's destined to hit the island on the top.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232024,"name":"Trough the lab","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232023,"name":"Perypetie Boba","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232022,"name":"Four Color Puzzle","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A chill puzzle experience. Set the colors of the pieces so that no two adjacent pieces have the same color. Complete 30 handmade levels, or explore infinite randomly generated 3D puzzles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60vq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232020,"name":"Uh Oh, UFO!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232019,"name":"U.G.O","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232018,"name":"Underground","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232016,"name":"Unluck Quest","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232015,"name":"Unloop","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232014,"name":"Us vs. Them","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232013,"name":"Vital","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232012,"name":"Voyage","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232011,"name":"Voidrun","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232010,"name":"Warbox","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232009,"name":"What has become of us..","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232004,"name":"Slime wants music!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232003,"name":"Musical Chairs with Bulldozers and Other Heavy Equipment","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232002,"name":"Choreo: Legend of Loco","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232001,"name":"Abelardo:- Steakhouse Musician","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":232000,"name":"Wolf","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231999,"name":"Xenomorph","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231998,"name":"ZigZag","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231997,"name":"Zombie Cubes","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231996,"name":"Zuwaka","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231995,"name":"Nightmare no Sekai: Tortured Souls","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231994,"name":"Rearmed Trials","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231990,"name":"Drift Spark","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231988,"name":"Korean Flower Name Game","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231986,"name":"King of the West","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231984,"name":"Avatara","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231983,"name":"Arm Wrestling Clicker","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231981,"name":"American Truck Car Transport","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231980,"name":"Airship Knights","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Airship Knights X WEBTOON Guardians of the Video Game Collaboration\nGuardians of the Video Game where the secret workers roll the game unbeknownst to everyone!\nTheir mission of successfully supporting the warriors to the end is underway!\nThis time, their work place is Airship Knights!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231979,"name":"Age of Chaos","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231978,"name":"Arena Car Racing","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231977,"name":"Car Crash Racing: Stunt Master","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231976,"name":"Call of Death Zombie Invasion","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231974,"name":"Bouncy Jump Ball","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231973,"name":"Bless Global","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6mxn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231972,"name":"Billiards Merge 2048","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231971,"name":"Big Name: City Lovin","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231969,"name":"Balloons for Kids Pop","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231968,"name":"Baby Panda World","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231966,"name":"Egg!","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231965,"name":"Draw to Collect: Sorting Line","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231964,"name":"Dinosaur Simulator 2019","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231963,"name":"Defense & Protect Epic Towers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231962,"name":"Deesse: Love and War","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231961,"name":"Cube Solver","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231959,"name":"Chief Almighty","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231958,"name":"Cat Rescue Helicopter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231957,"name":"Cats the Commander","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Easy to play for anyone! Super cute and hyper RPG!\nBeginners are welcome!\nOf course game freaks and children are also welcome!\nLet cats take over this world!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231956,"name":"Final Warfare","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231953,"name":"Find It: Hidden Object","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231952,"name":"Football Battle: Touchdown!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231951,"name":"Fulger McQueen Off road","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231950,"name":"Gas Station: Trucker Parking","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231949,"name":"Galaxy Shooter Space War Games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231948,"name":"Grader Simulator: Road Work","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231947,"name":"Ghost Survivors","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231946,"name":"Gravity Blast","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231945,"name":"Grail Tale","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231944,"name":"Jumper Platform","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231943,"name":"Jet Ski Driving","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231942,"name":"Jack Blacksmith","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231941,"name":"Iris's Adventure: Time Travel","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231940,"name":"Infinite Stairs","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7bfk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231939,"name":"Imperial Destiny: Path of Gold","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231937,"name":"Idle Cinema Empire Tycoon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231936,"name":"Horror Scary Granny Pink Barby","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231935,"name":"Gun Head Shot","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231934,"name":"Melon Playground","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231933,"name":"Magia Record","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231932,"name":"Little Panda's Candy Shop","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231931,"name":"Little Big Robots","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Fast-paced multiplayer battles with giant armed to the teeth robots! Fight in real-time battles with players all over the world! Operate a giant heavily armed robot and do whatever you want.\nCrash entire cities, smash your rivals, step across rivers, set ambushes to catch you enemy by surprise and have a good time while gunning down your enemy. Play with friends or solo across a variety of game modes from 4v4 to Battle Royale.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231930,"name":"Life Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231929,"name":"Kitty in the Box 2","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231928,"name":"Kings of Battleground","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231927,"name":"King of Kings","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231926,"name":"Kingdoms of Merge & Magic","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231924,"name":"Pirate Ship","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231923,"name":"Peaceful Dog Escape","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231922,"name":"Pacifix War Iwo Jima","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231921,"name":"Onet 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231920,"name":"Oath of peak","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231919,"name":"My SuperMart","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231918,"name":"Mine Hunter","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231917,"name":"Mind In Despair","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231916,"name":"Rucoy 2: Mirror World MMORPG","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231915,"name":"Rise of Dragons","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231914,"name":"Real Grand Gangster Mafia war","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231913,"name":"Rank Insignia Super Explosion","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231912,"name":"Ragdoll Playground","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231910,"name":"Pulling Pin: Pull the Pin","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231909,"name":"Project: Tempo","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231908,"name":"Progear: Airplane Shooter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231907,"name":"Prison Empire Tycoon: Idle Game","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231906,"name":"Rush Legends PvP FPS","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231905,"name":"Semantica: Semantic game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231904,"name":"Shadow Matching Puzzles","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231903,"name":"Shaper Runners","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231902,"name":"Shoot 8 Ball: Billiards Pool8","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231901,"name":"Shoot to Escape","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231900,"name":"Shuffleboard 2023","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231899,"name":"Sigma Battle Royale Shooter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231898,"name":"Snowball.io","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231897,"name":"Soccer Defense","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231896,"name":"Solitaire Card Deck Game '23","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231895,"name":"Solitaire Classic: Card Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231893,"name":"Stickman Battle War","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231892,"name":"Stickman Red boy and Blue girl","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231891,"name":"War of Dragons 2016","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231888,"name":"Toilet Rush Draw: Poo and Pee","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231887,"name":"The Only Survivor: Open world","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231886,"name":"Tegra: Post Apocalypse Survival","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231885,"name":"Tank Hero: Awesome Tank War g","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231883,"name":"Tag After School Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231882,"name":"Survival Island: Evolve","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231881,"name":"Super Boy Commander Bros","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231880,"name":"Number Match: Number games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231879,"name":"Block Puzzle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231878,"name":"Landlord Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231877,"name":"Search","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231876,"name":"You Are Mine2 Otome Love Story","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231875,"name":"Yokai Watch Go","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231874,"name":"The Savior of Darkload","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231873,"name":"Wonder Land","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231872,"name":"Blade Exload","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231867,"name":"Super Smash Bros. Brawl: Limited Edition","genres":[],"avg_score":0.0,"description":"This Limited Edition version of Super Smash Bros. Brawl was a European release that featured the standard release of the game in a collectable slipcover.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60uz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231866,"name":"Regular Home Renovation Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Regular Home Renovation Simulator is a simple simulation game about fixing a house. Replace floors, clean up dirt, fix walls! Who needs an electrician when you've got a perfectly fine screwdriver?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9483.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":231863,"name":"Clash of the Undead","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Lead the Habitant of Nardia To Defeat The Undead. Clash Of The Undead is a Roguelike Auto Battle Simulator, Where You Fight The Undead Army And Purge Them From The land. Plan your strategy, Use Magic Powers And Recruit New Fighters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60ul.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231860,"name":"Nitro: Stream Racing","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Nitro is a high-speed, streamer-led, chat-plays racing game played live on stream! Earn rewards to build out your garage of customizable cars and characters. Climb the leaderboard with your community to earn trophies and qualify for the end-of-season Streamer Grand Prix!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60u7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":231853,"name":"No.13 Shelter","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"1 3D story text adventure playing game","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60ti.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231844,"name":"Air Attack VR","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Arcade avia/auto simulator. Complete various missions, controlling a fighter in the sky and an armored vehicle on the ground. Win air and ground battles, capture enemy bases, improve available vehicles, and thrive in this action-packed game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231842,"name":"Not Born to be King","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Not born to be King is a simulation game where you embody a medieval king and try to lead your kingdom to success. Face a large variety of events, build a strong economy, and make the right decisions to prosper in this ruthless world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231839,"name":"2048 7x7","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"2048 7x7 is another variant of the popular 2048 game. Here, it is played on a 7x7 grid and two new tiles are added each turn. Statistically speaking, this option should make it much easier to reach the tile with 2048 written on it.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":231837,"name":"Vacation Adventures: Park Ranger 14 - Collector's Edition","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Help run Pinecreek Hills and Puerto Rico's Tropical Rainforest Parks","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231836,"name":"Avoid the Rain 2","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This is an agile parkour game. You can dodge quickly to avoid raindrops falling from the sky and go to the designated place.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60so.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231832,"name":"Video Ezy: In the Movies - Interactive DVD Trivia Game","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Test your knowledge of movies past and present while you race, your family, friends, and the clock to become the ultimate movie trivia champion.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60si.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"DVD Player"}]},{"id":231830,"name":"Dark Eden","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"It is a cancelled Nintendo Game Boy Advance games from Rival Dreams, a short-lived studio created by three employees at Acclaim. As one of the developers, Kynan Pearson, stated, they were highly influenced by Symphony of the Night and Metroid. You journey around a castle collecting four different power ups: the run, the wall jump, the fire sword, and the super jump. A prototype was released in Oct 2022. It is a metroiodvania style game, there is about 6 to 8 minutes of gameplay.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":231824,"name":"Archer Hero Must Die","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"‘Archer Hero Must Die' is a casual game. Players control an archer and defeat one powerful enemy after another.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60sa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231820,"name":"Dreamland coffee","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Du Qing, the heroine, opened a cafe in a foreign country alone after the adventure of Wonderland Lovers. A new story began when she took in a little boy who lingered outside her door on opening day...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60ru.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231819,"name":"Activate","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Use items and your wisdom to activate the block maze!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60rv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231818,"name":"DJMax Respect V: Clear Pass - S8 Premium Ticket","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231796,"name":"Space Escaper","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"It's a pixel art space shooter that has some other ways to help defeat enemies besides just shooting/bombing them directly. Different abilities to help you avoid damage or defeat enemies. You also can upgrade your aircraft to defeat powerful enemy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60z6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":231783,"name":"Softstar Games Bundle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co60o5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]}]