[{"id":42529,"name":"Dharma Dojo","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Dharma Doujou is an obscure puzzle game in which you attempt to match like-colored pieces by relentlessly hitting everything with a big hammer (proving once again that there is no puzzle that cannot be sufficiently solved by hitting it with a big hammer).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4brj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Famicom"}]},{"id":42522,"name":"Sound Fantasy","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sound Fantasy, titled Sound Factory during development, is an unreleased video game for the Super NES/Super Famicom. Designer Toshio Iwai was inspired by his earlier interactive installation art piece titled Music Insects, to develop a video game at Nintendo between 1993 and late 1994. The completed product was inexplicably canceled by Nintendo, and the game's key elements were later developed into Maxis's 1996 PC game release titled SimTunes.\n\nSound Fantasy contains eccentric concepts and untested game mechanics. Music games, especially on home consoles, were not popular in the early 1990s, and it wouldn't be until much later in the decade that they gained mainstream attention. The Sound Fantasy prototype contains four different games in one cartridge.\n\nPix Quartet was inspired by Toshio Iwai's Music Insects. There are four insects of different colors, where the player can select different insect to each represent a different instrument. They crawl all over the screen, where the player can draw. Insects that crawl over a colored pixel make a note. Each color represents a different note for each insects. Sample Demos can be loaded to demonstrate the capabilities of this game.\n\nBeat Hopper contains three different modes: A-type, B-type and Training. A-type is a rhythm game in the style of Q-bert, where an insect on a pogo must make every block disappear after stepping on it as many times needed. Each block makes its own sound and the order does not matter. The player can improvise a song with each block. B-type requires the player to follow a path of blocks that appears every time the player touches one. The player must make as many steps as possible without losing three lives.\n\nIce Sweeper indicates two modes: A-type and B-type. This game is a Breakout clone with a few new twists added after a few stages, such as four bats controlled by a single player.\n\nStar Fly is inspired by music boxes, where the player can set a sequence of stars in the sky, to compose a song. A higher star corresponds to a higher musical note. The player may set the speed and the tone.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4aku.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Famicom"},{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42494,"name":"Jeff's Shoot'Em Up","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Jeff's Shoot'Em Up, is a Super Nintendo top-down shooter in the vein of Smash TV, never actually made it into production but rather served as an in-house tech demo for Iguana Entertainment to test how many sprites could move on the screen at one time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5z1k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42493,"name":"The Irem Major Title","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42488,"name":"Mickey's Playtown Adventure: A Day of Discovery!","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Mickey's Playtown Adventure: A Day of Discovery, or Mickey's Playtown Adventure for short, is a 1994 video game published for the Super Nintendo Entertainment System. The game stars Mickey Mouse as he goes on an adventure in Toontown to solve puzzles and riddles involving letters, numbers, shapes and objects. The game was cancelled before it could be released, despite being finished.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3rqk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42468,"name":"RHI Roller Hockey '95","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Cancelled port of Brett Hull Hockey, including the RHI license.\n\nAl Michaels provides a full running commentary, while a mode allowing the player to improve their game with Brett's help is also included. The game is viewed isometrically, with all the realistic fouls and gameplay situations included. Full pre-match analysis and forecasting is provided, as are post match statistics.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5z9g.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42465,"name":"The Shadow","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"The Shadow was once a vicious criminal captured by a mystic and taught the powers of the mind. He became the nemesis of evil.\n\nNow, donning his sweeping cape and disguise, The Shadow takes on his most dangerous foe yet; the last descendant of the great Genghis Khan.\n\nJoin the fight and with your help, The Shadow will be victorious.\n\nThe Shadow was a canceled SNES game published by Ocean. It is based in the film of the same name. It is currently available for download.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4akw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42453,"name":"Super Shadow of the Beast","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Super Shadow of the Beast was going to be an enhanced port of the action-platform Amiga game Shadow of the Beast by Psygnosis. It was never officially released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co40cu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42414,"name":"Fist of the North Star 6","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42372,"name":"Little Master: Niji Iro no Maseki","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42344,"name":"Buck Rogers: The Arcade Game","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"This game emerged into the world as Jim Power: The Lost Dimension in 3D, starring Loricel's own flagship character instead of the better known, media-spanning space hero.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yxw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42286,"name":"Looney Tunes: Road Runner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42284,"name":"College Slam 2017","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42246,"name":"Eurit","genres":[],"avg_score":0.0,"description":"Eurit is an action game that was being developed by Radical Entertainment. It eventually was retooled and released on various 32 bit platforms as Grid Runner.\n\nThe game is basically a souped up version of childhood games of Tag and Capture the Flag. The game features a split-screen and is an ideal two player game. A near complete beta of this game was discovered by DreamTR.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yyz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42244,"name":"Fireteam Rogue","genres":[],"avg_score":0.0,"description":"Fireteam Rogue was a promising action-adventure game developed by Accolade, set for release sometime between 1994-1996. Issues with development led to its cancellation.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co555y.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":42201,"name":"Rockman Soccer","genres":[],"avg_score":0.0,"description":"A Megaman strategy game released only in some parts of Asia. You play as Megaman and are tasked with defeating the 12 Constellation Droids.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/wfgaajdwnbs7ufgsha0l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42197,"name":"Household Budget Management","genres":[],"avg_score":0.0,"description":"Most of us would like to be able to make our money go further than it does. We all realize that better control of our finances requires careful and realistic management of our money. The Household Budget Management module helps you manage your money better by systematically recording, analyzing and storing your personal financial history. You can set up a budget system to coordinate income and expenditures for the coming year — month by month, category by category. As the year progresses, you can compare your actual income and expenses with the dollar figures you budgeted to see how well you're doing. You can identify your greatest expenditures, discover where you're right on budget, and how much you're underspending or overspending. The module is simple to use — just follow the instructions — and with the computer acting as your guide, you can: \n- design an individual or family budget plan. \n- track income and expenses on a monthly and yearly basis. \n- analyze your spending habits and project your current expense trends for the remaining year to see the effect on your budget. \n- record and save your monthly income and expense figures to establish a personal financial history.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42196,"name":"Fractional Numbers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42195,"name":"Beginning Grammer","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42194,"name":"Alligator Mix","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42193,"name":"Addition and Subtraction 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42192,"name":"Addition and Subtraction 3","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42191,"name":"Addition and Subtraction 1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42190,"name":"Meteor Belt","genres":[],"avg_score":0.0,"description":"released 1983 by ITT Family Games","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qdqct6jrrbfoxts7a0vo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42189,"name":"I'm Hiding","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42188,"name":"Integers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42184,"name":"Multiplication 1","genres":[],"avg_score":0.0,"description":"Because children learn mathematics in different ways and at different rates, it is necessary to have resource material constantly available to them. Continuing their policy of providing educational material that is both instructional and entertaining, the staffs of Scott, Foresman and Company and the Texas Instruments Learning Center expand their mathematics series to include the Multiplication 1 Solid State Software™ Command Module. The Multiplication 1 module shows your child the \"Magic of Multiplication\". It provides a strong foundation not only in the basic facts, but also in later work with larger numbers. Colorful graphics and lively music transform the learning of factors and products into an exciting experience — almost like magic! The Multiplication 1 module contains eight activities: \n- EQUAL GROUPS changes an addition problem into a multiplication problem using the concept of number grouping. \n- FACTORS 2 TO 5 explains horizontal multiplication problems for factors 2 through 5. \n- FACTORS 0 TO 5 demonstrates multiplication of a factor by 2, 1, and then 0 (zero). \n- FACTORS 6 TO 9 increases the multiplication skills to include the factors 6 to 9. \n- MULTIPLY ANOTHER WAY presents a smooth transition from the horizontal multiplication problem to the vertical problem. \n- HOW MANY IN ALL uses a random number of hats \"sprouting\" a random number of flowers to demonstrate solving for the product. \n- COMPLETE THE BOX provides one factor while your child selects the other and then solves for the missing number (the product of the two factors). \n- REVIEW THE FACTS offers 28 multiplication problems with factors 0 (zero) to 9. A stage is set complete with a magician and audience that stands up each time your child correctly answers the displayed problem. \n \nThe Multiplication 1 module advances your child to more difficult drills according to the number of correct responses given in each activity. The computer automatically advances to the next activity if your child answers 80 percent of the drill problems correctly. If less than 60 percent of the problems are answered correctly, the computer returns to the appropriate activity, providing your child with more practice. This automation helps alleviate anxieties caused by consistently incorrect responses, making the learning of mathematical skills a pleasurable and rewarding experience. With this module, Texas Instruments continues its tradition of applying innovative Solid State Speech™ technology to educational activities. Multiplication 1 is designed to work with or without the Texas Instruments Solid State Speech™ Synthesizer (sold separately). However, the Speech Synthesizer must be attached to activate the voice of the computer. The computer's voice then gives directions, reads the equations, and encourages your child to \"Try again\" when he or she gives an incorrect answer. The addition of speech strengthens the learning process since your child can hear, as well as see, the correct answers.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42182,"name":"Plato Interpreter","genres":[],"avg_score":0.0,"description":"Welcome to a new experience in learning! Plato courseware was developed by trained educators in both basic and advanced subject fields. Plato educational programs provide the most valuable features of computer-based learning and offer an educationally sound program created to meet your individual needs. With Plato courseware, you interact with the computer on a one to-one basis. The educational programs are self-paced and provide reinforcement that is troth positive and immediate. The material is screen directed, so the computer tells you exactly what to do as you progress through a curriculum. In addition to these advantages, Plato courseware is an exciting adventure intended to make learning a successful and enjoyable challenge.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42174,"name":"Division 1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42173,"name":"Dragon Mix","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42172,"name":"Fractions","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42155,"name":"Androne","genres":[],"avg_score":0.0,"description":"Your Tandy computer has been invaded by the Data Bugs. These microbite creatures are feeding on your computers's memory cells (little blocks inside the computer that store information). Your computer will lose its entire memory bank if the bugs are not immediately destroyed.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ofetfgmcn1cfedhkje1i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42153,"name":"Bustout","genres":[],"avg_score":0.0,"description":"Super bustout is a unique TRS-80 Color Computer game for one to four people. It's your job to break down a wall on the screen by knocking out individual bricks, gaining points for each one you destroy. You can play all alone, with a partner, or against as many as three other competitors.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42152,"name":"Castle Guard","genres":[],"avg_score":0.0,"description":"Your challenge is to defend your castle from the soaring fireball. Maneuver your pike in a way that will keep the ball from striking your castle-while sending it back to the opponent's. Be warned! Merlin's pikes are spellbound and seem almost to have power of their own!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42151,"name":"Color Baseball","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The stands are filled to maximum capacity ... the crowd sits anxiously awaiting the magic \nthat is America's favorite pastime-Baseball! \n \nColor Baseball is an action-packed simulation of the sport made popular by Abner Doubleday \nat Cooperstown, New York, in 1839. You control the action and strategy. You can even give \neach player a name and a batting average to add more excitement to the game. Intricate \ncolor graphics enhance the realism from your \"press box view.\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42149,"name":"Desert Rider","genres":[],"avg_score":0.0,"description":"Test Tandy's all-terrain XR-2200 racer by taking it to its limit on a treacherous cross-desert race track. The object is to complete each course as fast as you can, and avoid crashing into the other riders and obstacles that you encounter along the way. After you complete the fourth race, the three race tracks become more difficult and are selected by random.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42148,"name":"Doubleback","genres":[],"avg_score":0.0,"description":"The player controls a dot on a black background, on which objects begin to appear randomly. If the dot crashes into an object, the player loses a life. Some objects, such as roller skates, move about; magnets even track and follow the player. Others, such as skulls, merely clutter up the screen and serve as obstacles","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42144,"name":"Super Storm","genres":[],"avg_score":0.0,"description":"Super Storm, was one of a number of titles Atari ported to other platforms under their Atarisoft brand. A number of Super Storm game cartridges for the Texas Instruments TI-99/4A were manufactured, but were not released after the company was purchased by Jack Tramiel.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dzz0vr97rju1ataqlb5r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42141,"name":"Bombman","genres":[],"avg_score":0.0,"description":"Japanese Tomy Pyuuta title, part number 001E, released in 1982.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/y5e5yrrmjsngstjlalmh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42134,"name":"Space Assault","genres":[],"avg_score":0.0,"description":"Save the world from attacking hordes of enemy alien beings by destroying as many invaders as possible! Score points for every enemy ship you destroy! Win bonus points by blasting the parent ships!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42133,"name":"Starblaze","genres":[],"avg_score":0.0,"description":"Star Blaze is a new adventure in space exploration for your TRS-80 Color Computer. As the commander of a patrol ship, you are responsible for defending the 64 sectors of your galaxy. Aliens are attacking the galaxy, trying to destroy the fuel and repair stations set up in several sectors. You must hunt down the aliens and destroy them before they ruin the galaxy's supply stations. Your patrol ship, superior in speed, maneuverability, and attack power, is your best ally in the fight against the aliens.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42132,"name":"Temple of ROM","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Star Blaze is a new adventure in space exploration for your TRS-80 Color Computer. As the commander of a patrol ship, you are responsible for defending the 64 sectors of your galaxy. Aliens are attacking the galaxy, trying to destroy the fuel and repair stations set up in several sectors. You must hunt down the aliens and destroy them before they ruin the galaxy's supply stations. Your patrol ship, superior in speed, maneuverability, and attack power, is your best ally in the fight against the aliens","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42131,"name":"Wildcatting","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"\"One to four wheeler-dealers pick drilling sites. A surveyor's report gives the chances of striking oil. Watch out for dry holes! Hit a gusher and you're in the money - for a while, anyway. Production soon decreases, and taxes and drilling fees start to mount. Earn the highest profits in 10 rounds to win\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42042,"name":"Mesopotamia","genres":[],"avg_score":0.0,"description":"Action game where you play a kind of pink slinky that climbs up walls and shoots from its middle section.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42026,"name":"Final Soldier: Special Version","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Final Soldier was part of the Caravan Festival organized by Hudson Soft in 1991 and a limited edition of the game exists. This Special Version comes as a single HuCard and offers two short Time Attack modes (two and five minutes) in the Caravan Festival tradition.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42025,"name":"Gunhed: Taikai","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Gunhed was part of the fifth Caravan Festival organized by Hudson Soft in 1989. A non-commercial and very limited edition of Gunhed exists - Gunhed Special Version comes as a single HuCard, and offers a 2 and 5 minutes Time Attack modes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42024,"name":"Soldier Blade Special: Caravan Stage","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Soldier Blade was part of the 8th Caravan Competition organized by Hudson Soft in 1992. A non-commercial and very limited edition of Soldier Blade exists - Soldier Blade Special Version comes as a single HuCard, and offers a 2 and 5 minutes Time Attack modes. Other Special Versions exist (Gunhed and Final Soldier) but Soldier Blade Special Version is probably the most \"common\" one, although extremely rare. It was also the end of an era - Soldier Blade was technically the last Star Soldier game to be featured in the Hudson Soft Caravan Festival.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42021,"name":"Mirai Shounen Conan","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Straightforward platform game based on famous anime director Hayao Miyazaki’s TV series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2l3h.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":42007,"name":"Space Fantasy Zone","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co48hb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Turbografx-16/PC Engine CD"}]},{"id":42006,"name":"Xak I + II","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Xak I & II is a re-release of Xak and Xak II, a fantasy role-playing video game series Xak developed and published by the Japanese software developer MicroCabin and Telenet Japan's development team Riot. This set contains both the first two Xak series games back-to-back on one complete Super Cd-Rom^2 with enhanced graphics and sound. In a similar style to Ys Books I & II, also for the PC-Engine system, Xak II, the second game in the series picks up immediately as the first game concludes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3bgn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42004,"name":"Mahjong Lemon Angel","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Mahjong Lemon Angel is a Miscellaneous game, developed by Micronics and published by Naxat Soft, which was released in Japan in 1994.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4sg7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":42001,"name":"Horror Story","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Demon's World, released in Japan as Horror Story (ホラーストーリー?), is a platformer arcade game that was developed by Toaplan and published by Taito in 1989. This game is multi-regional, meaning that it can be configured for different regions via the DIP switches. These settings change the legal warnings, can display the Taito licensing message and can change the title between the English version (Demon's World) and the Japanese version (Horror Story).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6dqe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41999,"name":"Slime World","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Slime World is a side-scrolling platform game by Epyx and published by Micro World. Captain Todd is on a mission to explore the green and inhospitable underground world of a mysterious Slime Planet and retrieve all the precious Slime Gems hidden in its depths. Our hero has to visit endless caverns and catacombs filled with green and gooey slime. Six stages are available from the start and each one of them is based around upon a particular scheme - from straight arcade action where Todd has to blast as many enemies as possible, to logic action when the player has to use his brain rather than his fire-power. Todd can run, jump, climb walls or use his water-gun to defeat all the various hordes of slimy enemies the game throws at him. More weapons and special items are available, such as bombs, jet pack or shields. When hit, Todd doesn't lose any life but instead turns greener and greener until he dies - unless he can find a water pond and clean himself up.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41996,"name":"Super Schwarzschild","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Part of Kogado's strategy series, Super Schwarzschild was released in 1991 for the PC-Engine, and in 1993 for the Sega CD as Mega Schwarzschild.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/vkuq8goto3xapaqfiofh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41993,"name":"Doukyuusei Classmates","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/d1tjxna8w66w1apaavm1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41871,"name":"Persona Q: Shadow of the Labyrinth - Wild Cards Premium Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41868,"name":"A Personal Nightmare","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41817,"name":"Blades of Triangulum","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"An Indie 3D Fighting Game about greatsword duel between alien race and artificial living machines in an unknown planet at the Triangulum galaxy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41816,"name":"Blades of Triangulum","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"An indie 3D Fighting Game about greatsword duel between alien race and artificial living machines in an unknown planet at the Triangulum galaxy. The game focus on character's movement, finding strategies to out maneuver the opponent, and finally deliver the precise blow. Blades Of Triangulum has single player, hack and slash, campaign mode, beside it's core one on one versus.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mphczxkgzansdy2vgwa7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":41756,"name":"Exoide-Z","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A space shooter game on the MSX computer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4n2o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41643,"name":"Sniper Elite 4: Limited Edition","genres":[],"avg_score":0.0,"description":"WELCOME TO ITALY, 1943 Discover ultimate sniping freedom in the largest and most advanced World War 2 shooter ever built. Experience tactical third person combat, slick stealth gameplay and epic longshots as you liberate Italy from the grip of Fascism. With an expansive campaign for 1-2 players and dedicated co-op and competitive multiplayer modes, Sniper Elite 4 aims to deliver a definitive tactical third person shooter with unrivalled sniping freedom across environments many times the size of those seen in Sniper Elite 3. Running in native 1080p on both PlayStation 4 and Xbox One, Sniper Elite 4 is the first game in the series built from the ground-up for next generation hardware and the first game to offer true next-generation sniping. Set in the aftermath of its award-winning predecessor, Sniper Elite 4 continues the series' World War Two heritage by transporting players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to colossal Nazi megastructures, ancient forests and hidden mountain monasteries. Covert agent and elite marksman Karl Fairburne must fight alongside the brave men and women of the Italian Resistance to help free their country from the yoke of Fascism, and defeat a terrifying new threat with the potential to halt the Allied fightback in Europe before it's even begun. If his mission fails, there will be no Operation Overlord, no D-Day landings, and no Victory in Europe.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co84vr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41641,"name":"Dragon Ball Xenoverse: Trunk's Travel Edition","genres":[],"avg_score":0.0,"description":"Only available for Europe, the Collector Trunk's Travel Edition for Dragon Ball Xenoverse features the Trunks Master Stars Piece 25cm figurine with exclusive colouring!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7zos.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PlayStation 4"}]},{"id":41638,"name":"Final Fantasy Type-0 HD: Fr4me Limited Edition","genres":[],"avg_score":0.0,"description":"This Limited Edition includes unique FR4ME packaging, featuring a design letting users to customise the look using the various artcards included. Display the case horizontally using the artwork provided, to create a collectible picture-frame style!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2uka.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41619,"name":"Hitman: Collector's Edition","genres":[{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"HITMAN Game and Collector's Box - Get your copy of HITMAN in this premium collector's edition box\nAgent 47 \"Chessmaster\" Statue - A massive 10\" statue of Agent 47, considering his next checkmate\nTie & Clip Set - The iconic tie of Agent 47 and logo-emblazoned clip for going out in HITMAN style\nArt book - A hardcover art book with 60 pages that take you deeper into the World of Assassination\nDigital Game Download - Contains your code to download your copy of the full game","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/rqvzzphg92z3oi9ey9wo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41578,"name":"Mr. Roboto!","genres":[],"avg_score":0.0,"description":"Prototype \n \nIt´s the year 8048 and mankind has been anhialated. The computers and machines that were built to help man have become smart enough to rule over – and eventually destroy – all civilization. Now, the once united machines have fractured, and the machines have begun to battle with each other. Two factions remain. Each side has a CPU master and 6 robot warrior servants. The CPUs can´t move, so the robots are sent out to do the dirty work. The goal: shutdown the opposing side´s CPU. Many obstacles are in place to prevent this: the other robots, energy surges, firewalls, viruses, and the CPU´s own laser defenses.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41576,"name":"Puzzle Piece Panic!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41573,"name":"Electronic Volleyball","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/higezavxprkwydp8depx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41570,"name":"Night Fighter","genres":[],"avg_score":0.0,"description":"Prototype","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41538,"name":"Mentis Cohorts","genres":[],"avg_score":0.0,"description":"Homebrew game released in 2011","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/i6jwswnwb0kfrgvyamoz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41526,"name":"Sho Chiku Bai Pachinko","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41518,"name":"Bailout Wars","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41515,"name":"Coolson's Pocket Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41511,"name":"Incoboto Mini","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41510,"name":"Amazing Runner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41509,"name":"Pilot's Path","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41508,"name":"League of Evil 3","genres":[],"avg_score":0.0,"description":"League of Evil is an iOS game developed by Ravenous Games Inc. and released by February 3, 2011. It was followed by League of Evil 2 (2012)[1] and League of Evil 3 (2013).[2]","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2sfr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41507,"name":"A Ride Into the Mountains","genres":[],"avg_score":0.0,"description":"\"A Ride into the Mountains\" is a retro action game depicting an adventure of a horse rider into the mountain woods. In a leisurely fashion, the player could experience the contemplation between movement and stillness while riding and shooting.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lohyrgklgozscwe44kko.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41506,"name":"Rerave","genres":[],"avg_score":0.0,"description":"ReRave is a rhythm/music game developed by Step Evolution for the iOS, Android, and arcade platforms. It was first released in 2011. In the game, players hit markers to the music.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/n6d6jpli7o39teiz8so0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41502,"name":"Soul Seeker","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Soul Seeker is a mobile game that offers both PvE and PvP. It has arena, guild siege events, 3 different difficulties of Scenario and many unique craftable items.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/i8scq891p0h8pcgvahhq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41495,"name":"Scarfinger","genres":[],"avg_score":0.0,"description":"[Unfinished 1984]\n\nThe last two agents we sent on this mission didn't come back. You're the only one we have left for the job. Mr. Andreas Skarfos, alias 'Scarfinger',has seized an island and set up a fortress there. He has a number of missiles capable of delivering nuclear warheads to any part of the globe, and unless we answer his demands, he will destroy us. His installations are all but invulnerable to surface attack, but we've discovered a tunnel which leads under the island. If one man could somehow reach the tunnel, they could stop Scarfinger!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76qq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Intellivision"}]},{"id":41494,"name":"The Flintstones' Keyboard Fun","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Unreleased 1983 ECS\n\nIt's fun to learn keyboard skills when The Flintstones and their friends are your teachers. Now everyone can enjoy the action of a colorful and exciting video game and develop useful keyboard skills at the same time! An easy way to put the whole family in touch with the computer age. Includes our unique curriculum guide.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/m87zyxfa0fxjav6yuafx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41492,"name":"Masters of the Universe II: Super Masters!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"With the success of Masters of the Universe: The Power of He-Man, Marketing scheduled a sequel. Once again, the game would be in two parts, with one part assigned to Ray Kaestner and one to Rick Koenig. Ray and Rick developed some game screens using fancy new Intellivision effects, but no final name or plot for the game was agreed upon before Mattel Electronics closed. (Asked recently to describe his half of the game, Ray shrugged and replied \"He-Man ran around fighting guys.\")\n\nM Network versions were also scheduled for Atari 2600 and Colecovision, but little or no work was done on either.\n\nThe screens Ray developed for Masters of the Universe II -- He- Man fighting bad guys on a multilevel 3-D game field with moving walls -- didn't go to waste; he recycled them in the INTV Corp. release Diner, a sequel to his game BurgerTime.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1pfd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Intellivision"}]},{"id":41484,"name":"Once Upon a Runner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41461,"name":"Super NFL Football","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"[Unreleased 1983 ECS] A one or two player football game developped at Mattel Electronics. Define and edit plays that can be saved and loaded from tape. Requires the ECS Computer Adaptor.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76qj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Intellivision"}]},{"id":41460,"name":"Yogi's Frustration","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Yogi's Frustration is a unreleased game from 1983 about Yogi Bear who is put to work on the Jellystone Park conveyer belt. Your goal was to help BooBoo get picnic baskets of goodies up to Yogi to keep him working fast.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76ql.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Intellivision"}]},{"id":41427,"name":"Bomb Fight","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Bomb Fight is a local-multiplayer action party game. Destroy your friends or cooperate with them in a frenzy of bombs without destroying your self.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3mgt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41425,"name":"Baseball: Explorer Time & Fun","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41423,"name":"Las Vegas - LCD Game Digital","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41422,"name":"Hippo Teeth","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":41421,"name":"Chicky Woggy","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":41419,"name":"Zatsugaku Olympic Quiz Part II","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"An adult game in which answering various quiz questions correctly within a time limit will slowly remove panels from a picture that usually reveal a nude girl.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41389,"name":"Sailor Fuku Bishoujo Zukan Vol. 1","genres":[],"avg_score":0.0,"description":"A pornographic action game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ut5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41388,"name":"Sailor Fuku Bishoujo Zukan Vol. 2","genres":[],"avg_score":0.0,"description":"A pornographic action game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41387,"name":"Sailor Fuku Bishoujo Zukan Vol. 3","genres":[],"avg_score":0.0,"description":"A pornographic action game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41386,"name":"Sailor Fuku Bishoujo Zukan Vol. 4","genres":[],"avg_score":0.0,"description":"A pornographic action game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41385,"name":"Sailor Fuku Bishoujo Zukan Vol. 5","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41384,"name":"Sailor Fuku Bishoujo Zukan Vol. 6","genres":[],"avg_score":0.0,"description":"A pornographic action game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41378,"name":"Bishoujo Shashinkan II: Moving School","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Adult simulation game created by HARD in 1987.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uzcyjucp4eoivbwok9m8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41377,"name":"Bishoujo Shashinkan I: Studio Cut","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Adult simulation game developed by HARD in 1987.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kb5rt6z03qs6qbjdinjy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41372,"name":"Casino De Pink","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"A pornographic gambling simulation","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41341,"name":"Aki to Tsukasa no Fushigi no Kabe","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Eroge puzzle game developed by New System House Oh! in 1988.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/r3z0x6iumzimfwvcnjbg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41339,"name":"Bishojou Mahjong Club","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Bishoujo Mahjong Club is a Board / Tabletop - Adult game, developed by Super PIG and published by Mimi-Pro, which was released in Japan in 1988 for the Nintendo Famicom Disk System.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41309,"name":"The Golf: Bishoujo Classic","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/bg3f7ykjotl1xuvqnmq5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41197,"name":"Devil Assault","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Defeat the Bombing Raids by Vampire Bats, only to be attacked by Robots after which the Sproings will try to destroy you. The Devil attacks at the higher skill levels. Choice of three colour screens. Five skill levels. Superb full colour graphics and sound in true Ken Kalish style. High speed arcade action game. Machine language.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41196,"name":"Ultimate Adventure 4","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Being the adventurer you are, and having survived the Mansion and the Arabs of Jerusalem, and walked the streets of Williamsburg, you are now qualified to undertake the Ultimate Adventure. You start your adventure with $250 at a Traditional Market where you purchase an array of items to assist you with your adventuring. Your goal is to accumulate $1000 or more and return to the market. It sounds easy!!! But on the way you will encounter attacking Alligators, Quick Sand, Charging Polar Bears, Pythons, Meteors, Bandits, Deserts, Land Mines, Sharks and much much more, Good Luck!!! You will need it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41195,"name":"Invaders Revenge","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"As the last space invader your mission is to destroy the human ships that prowl the space lanes. The human laser base fires at you with deadly accuracy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41184,"name":"Viking","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"WELCOME TO VIKING\n\nThis game is a simulation of the government of a people Viking in 750. You will have to decide on purchases, sales and taxes next year. All decisions are related. They improve with practice.\n\nVIKING LOADING\n\n1. Insert the tape into the cassette, rewind and press PLAY.\n2. Type CLOAD and press ENTER.\n\nThe program will load and run automatically.\n\nPLAYING VIKING\n\nWhen starting, the program will prompt you to enter the number of players (1-4) and the level of difficulty (1-9). You also have to enter the name of each player.\n\nThe computer decides who starts the game. On each turn, the player is presented with a series of questions to answer.\n\nThe success or failure of your people depends on your answers.\n\nIn addition to the above problems, there is always the possibility that you suffer a catastrophe, like a plague, a revolution or attack. However, it can be avoided with good management.\n\nThe following points may be helpful:\n\n1. The slaves do agricultural work.\n2. Ferrets are employed to kill rats.\n3. an individual tax per person living in the area is paid.\n4. There are seven hierarchical levels up to the king or queen; landowner, knight, baron, count/countess, duke/duchess, prince/princess, king/queen.\n\nIt takes a long time to become a knight, but things go faster after that.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/beqhab13io2wc3rhenub.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41181,"name":"Everyone's A Wally","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41150,"name":"Mad Nurse","genres":[],"avg_score":0.0,"description":"In Mad Nurse you take on the role of a midwife in a maternity hospital. In this hospital the babies run amok, leaving their cots to stick their fingers into electrical sockets, drink whatever medications they can get their hands on, fall down lift shafts and engage in other fatal activities. This makes it difficult for a trainee nurse such as yourself to bring them under control and it's your job to keep them alive. \n \nEvery time a baby jumps out of its cot, you must chase after it and rescue it from potential harm by picking it up and putting it back into its cot. The hospital ward is on three floors linked by a lift. Babies appear randomly at the left of the screen on any of the floors and crawl towards the right of the screen where, if they survive that long, they will fall down the lift shaft. To rescue the little dears you must run to them, pick them up, run to the nearest cot and put them down. \n \nThe player has three lives, or trainee nurses, to play with. A nurse is fired if too many babies die on a ward. Keep enough babies alive on your ward for long enough and your nurse moves onto the next ward. Advance through sufficient wards and you get another life (a new trainee is assigned to you). Points are awarded for babies picked up and put into their cots and for medicine bottles picked up. Also, to aid you in your task to save the babies you have a gas button that, when pressed, stops all the babies in their tracks while leaving your nurse free to move around. \n \nThe game has three levels of difficulty. The easy or 'No Problem'' level starts on ward 8, the intermediate or 'Problem!' level starts at ward 16, and the hard or 'Fat Chance' level starts at ward 24.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/e6cspbn9ipbqxhtqsqu0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41149,"name":"The Adventures of Bond... Basildon Bond","genres":[],"avg_score":0.0,"description":"The player controls Basildon Bond, whose task is to collect a series of codes within five hours, under orders from 'P', who had his codename changed to 'B' to confuse the KGB. To unlock these codes, Basildon must piece together several jokes, which are found in various rooms inside a television studio. Once Basildon has collected a joke, they must be entered in the main computer. \n \nCollecting the jokes is not an easy task for Basildon. For one thing, to use certain objects, some other object must be collected first. For another, moving TV cameras roam around in some rooms, and if Basildon comes into contact with any of these, he returns to the computer room and ten minutes of his time is lost. \n \nHowever, to deal with the cameras, Basildon is equipped with ten Cooperblasters which can be used to summon Cooperman. Once Cooperman has been summoned, the player is free to navigate him toward the camera, and once Cooperman comes into contact with the camera, it is destroyed. If the player leaves and re-enters the room, the cameras return and the player has to summon Cooperman again, wasting precious Cooperblaster ammo. Cooperman can only be summoned ten times, and the player is unable to collect more ammo, so they need to use Cooperman wisely. \n \nOne summon out of ten introduces the player to another character known as Blunderwoman, who does far more damage than Cooperman because whereas Cooperman just flies from one side of the screen to the other in a straight line unless the player interferes, Blunderwoman flies diagonally across the screen and back again without the player's involvement, killing any cameras that she does not kill the first time. \n \nThe game ends when the five hours are over.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41141,"name":"Jaw Breaker","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Unlike the Apple II and Atari 8-bit versions, the Commodore 64 version of Jawbreaker is not a Pac-Man clone. Instead, you have a screen with five horizontal levels. There are dots, candies, if you will, on each level. You must eat all the candies to get a teeth brushing and advance to the next, harder, level. Also on each level are happy faces. They are happy to knock your teeth out, which they will do if you touch them. This will lose you a life. When all lives are lost, the game is over. \n \nOn occasion, a lollipop will appear in the center of the maze. This grants extra points. On the four corners are special dots that, when eaten, will change the color of the maze, allowing you to eat the happy faces for a short time. The maze color will change again, briefly, before returning to normal, as a warning. To move from level to level, there are moving openings on the levels. Be careful not to get trapped with a happy face with no way out.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/jbzyruy9s7nqpllnfz0c.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41093,"name":"Columns 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Columns II: The Voyage Through Time is the sequel to Columns. It was released in Japan for the Sega System C. A port was included in the compilation Sega Ages: Columns Arcade Collection released for the Sega Saturn in Japan in 1997. Columns III however, would be released in North America on the Sega Genesis","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/f71wlh5wivxnae8ybu0x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41072,"name":"Schoolgirl Strikers: Twinkle Melodies","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"An idol rhythm action game released on iOS and Android devices.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2r90.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":41070,"name":"Spacerunner","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Space Runner run on the Space and shoot the Comits to Destroy every level has difrent Dificulty you can upload your score on the owr facebook page.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/abkavwrus6dpfktx6fad.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41044,"name":"Life of Tar","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41029,"name":"Smashing the Battle VR","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"In the year 2085, a huge multiplex construction site becomes a victim of a massive scale hacking incident.\nDue to the hack, the construction robots start to attack the workers on site.\nWhat could have possibly happened?\nNow you can witness it yourself, with two unique heroines to control and two different stories to unfold!\"","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/z3nmpiv0xhebhwwwfp0a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":41005,"name":"Footballer of the Year","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"You're a 17-year-old apprentice in the 4th Division with only £5,000 and 10 goals to your name. Have you got what it takes to cope with the trauma of transfer deals, injuries and other match day problems, while displaying skill and professionalism in matches throughout Europe. Rise through the divisions, out-classing rivals on the way to prove you are the best and gain the highest accolade... FOOTBALLER OF THE YEAR!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ycd77vuogvamvtyxkew1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41004,"name":"Footballer of the Year 2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Can you handle the pressures of a professional footballer whose aim is to become the number one striker and Footballer of the Year? Take the challenge in this fast and frantic football simulator to find out if you can be the best!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41003,"name":"Football Manager: World Cup Edition","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7xq5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41002,"name":"Game, Set & Match","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":41001,"name":"Game Set and Match 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40967,"name":"Lake House: Children of Silence","genres":[{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Long-forgotten memories bubble to the surface when the past invades the present in The Lake House: Children of Silence! Located at the edge of a gloomy lake and shrouded in fog, the house at the center of this story has stood empty for 15 years. Beckoned by what appears to be a ghost, a woman who lived there as a child returns to the house to solve a mystery that begins with an old photograph and ends in a secret room. Find hidden objects, solve puzzles and prepare yourself for an ending that will take you to a place darker than you can imagine!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mwspdgypfg40pmbp5nd3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":40959,"name":"Phantoms of the Asteroid","genres":[],"avg_score":0.0,"description":"The earth is under threat from an asteroid hurtling towards it. You have been sent to the asteroid to destroy it and save the Earth from invasion by a swarm of blood-thirsty phantoms.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40939,"name":"Roy of the Rovers","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Roy of the Rovers computer game was split into two parts: the first an adventure game, in which—taking the role of Roy Race—the player had to find and rescue the kidnapped Melchester team, before then playing the second part, which consisted of a charity match to raise funds for the club. The fewer players recovered before the match began, then the smaller the team who could take part. In the extreme, Roy would be the only player for Melchester.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/qqjoj93epzbzrhjfylbs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40933,"name":"The Young Ones","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The game takes place in the students' house. The player can choose to play as either Mike, Neil, Vyvyan or Rick which then you explore the house and enter different rooms. The other characters become computer controlled players. All characters can move around the house, pick up and drop objects, as well as break and fix things. The characters often talk, giving your player clues as to what the character intends to do.\n\nThe aim of the game is to try and move out of the house with all your character's belongings in the shortest time possible. This is not so easy because your possessions are typically not in their preferred condition, or are hidden around the house, and you will need various tools to get to them. The other characters will move around the house, behaving in-character, occasionally moving all your possessions around, and occasionally damaging them - making your life harder.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hyd8c7tkcjmxiclhwrm5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40930,"name":"Moon Buggy","genres":[],"avg_score":0.0,"description":"Moon Buggy is a clone of the classic Atari game Moon Patrol. The player is the moon base commander, out on patrol in the ATMB (All Terrain Moon Buggy). Al alien attack has penetrated the base's outer defences and its the players job to see that this incursion is stopped. \n \nThe game features flying saucers that drop bombs, craters that must be jumped, boulders that must be blasted, incoming missiles, tanks and land mines. The buggy tracks left to right across the screen, it can accelerate, decelerate, fire missiles and jump but it cannot go backwards. Points are scored for enemies destroyed and distance travelled. The game records the top five scores for the gaming session.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40927,"name":"Fall Guy","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"An unreleased game that partially takes place on the road. This was based upon none other than the 1981-86 TV series \"The Fall Guy\" starring Lee Majors. This was planned for release in February 1983.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7n6r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"ColecoVision"}]},{"id":40922,"name":"Donkey Kong","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"In the early 2000s, incomplete prototype versions of Donkey Kong and Donkey Kong Jr. for ColecoVision were discovered. Both cartridges actually postdated the ColecoVision releases and were seemingly ports of the versions from the Coleco Adam computer, which featured more levels and cutscenes. The games were re-compiled into hacked ROMs titled \"Super DK!\" and \"Super DK Junior\" respectively; the unaltered ROMs were never released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7mhf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"ColecoVision"}]},{"id":40921,"name":"Donkey Kong Junior","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"In the early 2000s, incomplete prototype versions of Donkey Kong and Donkey Kong Jr. for ColecoVision were discovered. Both cartridges actually postdated the ColecoVision releases and were seemingly ports of the versions from the Coleco Adam computer, which featured more levels and cutscenes. The games were re-compiled into hacked ROMs titled \"Super DK!\" and \"Super DK Junior\" respectively; the unaltered ROMs were never released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co95q7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"ColecoVision"}]},{"id":40917,"name":"Frogger 64","genres":[],"avg_score":0.0,"description":"Your task in this arcade conversion is to guide a frog across a treacherous road and river, and to safety at the top of the screen. Both these sections are fraught with a variety of hazards, each of which will kill the frog and cost you a life if contact is made.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/grahxniig3s0kwxekog0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40884,"name":"ThunderFox","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 8-bit"}]},{"id":40883,"name":"Bug Hunt","genres":[],"avg_score":0.0,"description":"Bug Hunt (Atari Corp, 1987) was a light gun game bundled with the Atari XE and the XG-1 light gun peripheral.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40881,"name":"Mister Do","genres":[],"avg_score":0.0,"description":"You control Mr. Do has he tries to harvest all of the cherries on the screen. However, there are numerous bad guys out to get him! Mr. Do can defend himself from the badguys in two ways: first he can push the apples located throughout the playfield on top of the enemies and crush them. Secondly, Mr. Do is armed with a power ball. This can be thrown to destroy an enemy. Mr. Do has only one power ball, though, so he will need to wait for it to return to him before it can be used again. From time to time an alpha monster will appear on the screen bearing one of the letters in EXTRA. If you use the power ball to destroy an alpha monster you earn that letter; when you've earned the complete word EXTRA you receive an extra life. When you successfully collect all of the cherries, you will move on to the next, more difficult level.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/d0rvha2ouxcualdgobrf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40876,"name":"Blue War III","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40874,"name":"Battle Probe","genres":[],"avg_score":0.0,"description":"A long time after the Human Race left Earth and traveled to the Solar System of Sol, some thoughts about returning to Earth came up. As aliens occupied the abandoned earth, The “Council of the Confederation of Human Kind” decided to send a ship to Earth to conquer the home planet again. \n \nOf course, the player takes control of that Battle Probe and fights his way through 65 levels to expel the aliens by simply killing all of them in this vertical scrolling shoot 'em up game. \n \nThe player is attacked by shooting and moving aliens, but also must avoid any ground obstacle dropping a shadow carefully, because those will instantly kill the player. During the level the player's ship is consuming fuel, which has to be refilled by flying over “Fuel” fields. On the ground there are also often colored eyes found: a blue eye rewards some extra points, a yellow eye rewards an extra life and a green eye releases a random effect. On collecting extras, the game is playing a voice sample telling you which item you collected.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uhvao2ba4le6oylzbmob.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40873,"name":"Crime Buster","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A light gun shooter game for several Atari 8-bit consoles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/rpxr7eo8fogsqcwwsikp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40872,"name":"Advanced Destroyer Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40861,"name":"Dragnet","genres":[],"avg_score":0.0,"description":"A cancelled Atari Lynx game that was planned for release in February 1995.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari Lynx"}]},{"id":40855,"name":"Marlboro Go!","genres":[],"avg_score":0.0,"description":"Prototype. Never released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/u0nnw6vbr2179ptlhooj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari Lynx"}]},{"id":40838,"name":"Fidelity Ultimate Chess Challenge","genres":[],"avg_score":0.0,"description":"On your own against the Fidelity Ultimate Chess Challenge - the world's most powerful hand-held chess game - or against a friend, the stunning 3D graphics and advanced technology of this latest game from Telegames has to be played to be believed. \nThe Fidelity Ultimate Chess Challenge uses the most powerful chess playing technology from the laboratories of Fidelity - the premier manufacturers of dedicated chess computers are developers of the world's only USCF certified Master rated (2325) chess program. \nSwitch from 3D to overhead view for the final attack - or use one of the many options available to review the game to date. \nFull on-screen statistics giving score, times, moves etc. and many other features on this the world's fastest color hand-held chess game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40795,"name":"Star gunner","genres":[],"avg_score":0.0,"description":"Stargunner is a scrolling shooter for the Atari 2600 written by Alex Leavens and published by Telesys in 1982.[1] Leavens also worked on ports of Gorf and Crazy Climber for the 2600, released by CBS and Atari respectively.[1]","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40793,"name":"Sky Patrol","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The game was inspired by designer Brad Stewart’s experience with helping a hot air balloon’s ground crew, while he was in college, and was planned to be a race between two balloons (with a 2-player option). Although the artwork depicts WWI-era biplanes/triplanes, none were planned.\n\nThe playing area is 2 screens high and 27 screens wide.\n\nAlthough nearly finished and showcased at the Winter CES in 1983, the game was never released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7mqs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40784,"name":"Seemonster","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40781,"name":"Clowns and Balloons","genres":[],"avg_score":0.0,"description":"Clowns & Balloons is a clone of the 1978 Bally/Midway arcade game CLOWNS, which itself was a clone of the 1977 Exidy arcade game CIRCUS. Your mission is to bounce your clown off of a moving trampoline and try to burst all of the balloons. The longer you keep him jumping, the higher (and faster) he will go, which you need to do in order to burst the highest balloons. You get bonus points for completing each row of balloons as well.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nzrvyhepvug0eb60so8n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40780,"name":"Hot Wave","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40774,"name":"Pompeii","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An incomplete ROM of this game was rediscovered in 2001. Supposedly there was a finished version of the game that was ready to be ported to the Atari 800 by Apollo programmers. The box scan was taken from a prototype shown at the 1983 Las Vegas CES.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yls.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40768,"name":"Air patrol","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40764,"name":"Paris Attack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40763,"name":"Billard","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40762,"name":"Joust Pong","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40760,"name":"Mine Sweeper","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Have you ever wanted to play the Windows time waster on your old Atari 2600? Well now you can!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40757,"name":"Brick Kick","genres":[],"avg_score":0.0,"description":"Brick Kick is an Action game, published by R. J. P. G., which was cancelled before it was released","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40748,"name":"Venetian Blinds","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"As the name implies the Venetian Blinds demo isn't a game, but a demo that simulates a pair of Venetian blinds! The joystick can be used to raise and lower the blinds by pushing up or down. When the blinds are raised a nicely done sunset is visible out the window. The story behind the Venetian Blind demo is rather interesting.\n\nIt was not released publicly until 2003, as part of Activision Anthology for Windows, macOS, and Game Boy Advance. It was later released in 2010 through the Game Room retrogaming service for Windows, Xbox 360, and Windows Phone 7.\n\nAs most people know, Activision was founded by several ex-Atari employees who had left due to Atari's policies on programmer recognition (or the lack thereof). One of these employees was Bob Whitehead, creator of the \"Venetian Blinds\" technique, which was first used in Atari's Video Chess to display eight objects in a row instead of the normal six. Even though Activision had never used the Venetian Blinds technique in any of their games, that didn't stop Atari from threatening to sue Activision for \"stealing\" the technique along with other various proprietary information. Since Activision knew that they hadn't stolen anything from Atari, they decided to play a little joke on Atari. According to David Crane, when the Atari's lawyers questioned them about the \"stolen\" Venetian Blinds technique David showed them this demo and said \"Is this what you guys are referring to?\". Apparently Atari wasn’t in a laughing mood, and they went through with the lawsuit. In the end Atari ended up losing the case and Activision went on to become the most successful of the 2600 third party companies.\n\nAlthough Activision never made a game out of this demo it didn't go completely to waste. The sunset was later used in the background of Barnstorming.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8zdy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40745,"name":"Yahtzee","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Yahtzee is a homebrew game for the Atari 2600.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4lwg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40744,"name":"Scuba Diver","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40742,"name":"Bi! Bi!","genres":[],"avg_score":0.0,"description":"This is an unlicensed version of Sea Hunt by Froggo that was released by Rainbow Vision for the Atari 2600. The game has a bug the causes the player to get stuck at the beginning of the second level.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40739,"name":"Curtiss","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Curtiss is an unlicensed version of Atlantis, originally developed by Imagic.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40673,"name":"Encounter At L5","genres":[],"avg_score":0.0,"description":"Beyond the orbit of the moon, a defenseless space colony is under heavy attack \nfrom the ruthless Megalytes. You are their only hope. Armed with packets of \nantimatter, you take control of an Antimatter Launcher. Suddenly the sky is \nablaze with Megalyte war ships. You must destroy them before their formidable \nparticle beams destroy you and the peace-loving colonists of L-5. It will \ntake every ounce of skill and cunning at your disposal to blast the evil ones \nout of orbit.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40671,"name":"Harbor Escape","genres":[],"avg_score":0.0,"description":"Harbor Escape is an Action game, published by Panda Entertainment, which was released in 1983.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40668,"name":"Mini Game Collection","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Mini Game Collection is a Collection of 3 Mini-Games written by Rick Skrbina: Adventure 1K, Assembly Line & Snake. \n \nAdventure 1K - Plays like the original Adventure, but sized down a bit to compete in the 2010 Mini Game Compo 1K category. You must recover the sacred chalice while avoiding dragons. \n \nAssembly Line - In order to fill your quota, you must key in the proper codes to do your part on the assembly line. If you fail to do so, you'll get fired! \n \nSnake - The classic growing snake game. Eat as many fruits as possible.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40665,"name":"3-D Genesis","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"PEACE THROUGH SUPERIOR FIREPOWER!\n\nIn the far future, the planet is overrun with enormous, super insects, who fiercely battle each other for survival. You've chosen a side to fight for, and the enemy has been funneled into a deep crevice, but now you're outnumbered. You put their numbers to the test. They saythe meek shall inherit the Earth, but how long can you defend it?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6jxe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40664,"name":"3-D Havoc","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Your stellar cruiser begins to shudder as the hyperwarp drive suddenly cuts out. Slowing down, you realize you've entered an asteroids field. A BIG asteroid field. You bolt for the high-density laser-pulse inverter. Your only chance is to blast your way out. And you better start now...\n\nOriginally planned for December 1983 release on cancelled \"Power Play Arcade\" 3-in-1 cartridge. Eventually released as limited edition standalone cartridge under the Video Soft label in 2010.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6gfc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40657,"name":"Gingerbread Man","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Unrefined sugar, flour, ginger and heat have combined magically to produce consciousness and mobility in a delicious culinary confection. You, a Gingerbread Man, find yourself baking in a gas-fired oven, and you must find a way out! Gingerbread Man is based loosely on the popular children’s story of the same name. And although this game is appropriate for children, it’s not child’s play! \n \nIn Gingerbread Man you must fight your way through 20 levels consisting of five unique game-play screens, facing a variety of obstacles and challenges in order to survive! In the first level you begin in a hot oven where you must escape before being cooked alive! Once you break free from the oven, you find yourself in the dining room where you need to collect all of the balloons and float up to the roof through the chimney. Now that you're on the roof you must build a bridge to a nearby tree while fighting off cats and birds that want you for a tasty treat! Once in the tree, you need to evade all the dangerous creatures in the forest (will you ever get a break?) And if you do escape the forest, you enter a cave where you must fight off your most fearsome enemy yet! \n \nOnce you defeat the boss, to your dismay you are captured again and put back in the oven too cook some more, and this time the heat has been turned up! Will you ever escape? Can you battle through 19 levels to have your chance to out-fox the final boss and win your freedom? \n \nGingerbread Man includes three game variations: \n \nSelection 1 is the default. \nSelection 2 is expert mode. \nSelection 3 is a special mode for children.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nz38gldzrv5tzgbaj0lt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40656,"name":"Gunfight","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"It's shoot-out time and you've got to be faster than your opponent or the computer. Move, dodge, or hide behind a covered wagon or cactus. But whatever you do, don't waste your time because your opponent is shooting back. Take your position, aim, and fire before he gets you... \nGunfight is the first release from Manuel Rotschkar and is heavily inspired by the 1975 Midway arcade game Gun Fight. Gunfight features eight-way movement with the following gameplay modes: \n \nStandard Duel: The first player to score 7 points wins \nSixshooter Duel: The first player to score 7 points wins \nEscape Scenario: The left player wins when scoring _once_! The right player wins when surviving 99 time units. \nTarget Shooting: The first player to score 77 points wins. Hitting a target scores 1 point. Hitting the opponent scores 5 points.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ety6e4ahhrjnszvijtej.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40653,"name":"Dukes of Hazzard 2","genres":[],"avg_score":0.0,"description":"This is another prototype with the Dukes of Hazzard name. However, this is a modified version of Stunt Cycle, another unreleased game. In this case, the graphics have been changed to a Dukes of Hazzard theme.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40643,"name":"Dragon Treasure","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dragon Treasure is a Canadian-released copy of Imagic's Dragonfire.\n\nThe goal of Dragonfire is to avoid the dragon's fireballs and capture the king's treasure. In the first screen, you run across a bridge, ducking and jumping over fireballs. Then, in the treasure room, you pick up the various treasures, avoiding the dragon's fireballs, and leave through the door you came in. Then you start again. Although Dragonfire is a novel game, it gets boring pretty quickly.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hjw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40639,"name":"Dumbo's Flying Circus","genres":[],"avg_score":0.0,"description":"Dumbo's Flying Circus was scheduled to be part of Atari's children's series (which included characters from Peanuts, Sesame Street, Disney, Muppets, and Garfield), but for one reason or another it never saw the light of day. Atari advertised Dumbo in European Atari catalogs and even had a prototype box made, so the decision to shelve it must have been made quite late. Even though Dumbo was developed as a children's game, the gameplay is quite difficult which may be the reason why it was never released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61mn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40613,"name":"A Mysterious Thief","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"A Mysterious Thief was canceled before its release. In the game, players control a thief who must rob as many houses as possible without being spotted by residents or hit by enemies.\n\nUsing a platform-based system, players need to reach the purple line to move up or down floors. But be careful—many enemies will appear to hinder your progress.\n\nOnly a prototype version is available for play, as A Mysterious Thief was canceled prior to launch. The objective is to grab items that appear in the windows, but it’s not easy, as you’ll need to dodge dogs and apartment residents along the way.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co90vy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":40610,"name":"Bloody Human Freeway","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Prototype for Freeway. According to David Crane, he got the idea for Freeway from watching a man trying to cross Lake Shore Drive during rush-hour traffic while attending Chicago's Consumer Electronic Show.\n\nFreeway originally featured people crossing the road instead of chickens since that was the scenario that inspired David Crane. However some people at Activision complained that they didn't like the idea of people being struck by cars, so chickens were substituted for people before the game was released.\n\nPublicly released as part of Activision Anthology Remix and the GBA port of Activision Anthology","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7s3n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40606,"name":"Bifrost Breakout","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40605,"name":"Deep Pockets-Super Pro Pool and Billiards","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Deep Pockets: Super Pro Pool and Billiards is a billiards game for the Intellivision. It was developed for market in 1990 but never released. It is notable for being the last game completed for the Intellivision console. It was later included in intellivision lives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76q5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Intellivision"}]},{"id":40592,"name":"Super-Ferrari","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Typical racing game. You have to dodge the other cars with your Formula 1 car to become first in that Grand Prix. Its cool though how day and night and the weather changes. It´s from the famous \"Quelle\" games (Quelle was a big german mail order company that also made video games for the Atari 2600). Although Super-Ferrari is a rip off of the racing game \"Enduro\" by Activision it´s fun to play. \n \nQuelle games are in Europe and especially in Germany highly unpopular amongst collectors. Interesting fact: James Rolfe, the Angry Video Game Nerd, owns at least one of those games.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40565,"name":"Lotlot","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/yja0noncrb2ujufvlvtv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40523,"name":"Caelum: Into the Sky Vol. 1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40345,"name":"Ixion","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A shooting game where you collect the letters to spell the word IXION to reach the Kailo Round. Shoot enemies and avoid being shot to yourself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5vud.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":40281,"name":"Chimera Beast","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"An underwater shooter where a worm-like beast shoots at different enemies and ugly bosses. Jaleco never released this game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8utd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":40164,"name":"Splendor Blast","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"\"La más excitante carrera de vehículos espaciales \n-7 pantallas \n-4 grados de dificultad \n-Continuación de partida con nueva moneda \n-Nº 1 en Japón\"","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/k7vocvieepa1fdweotwb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40160,"name":"Aerolitos","genres":[],"avg_score":0.0,"description":"Versión de Asteroids, con textos en español.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40158,"name":"Coco Loco","genres":[],"avg_score":0.0,"description":"Coco Loco es un Juego original de Petaco inspirado en Pac-man y fabricado en 1981. \n \nEstá basado en procesador 6502, permite jugar hasta 4 jugadores alternándose y pueden aparecer hasta cinco fantasmas enemigos. El juego se controla con joystick y un botón adicional que permite acelerar la velocidad del comecocos.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/gizcmxy9hiugrk1mouke.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40141,"name":"Ganbare Marine Kun","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/t1taghunmjcokjnd1mxu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40137,"name":"Farmers Rebellion","genres":[],"avg_score":0.0,"description":"AKA いっき. Two farmers created a rebellion to fight against the lord.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40125,"name":"Goal92","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40124,"name":"Grand Cross","genres":[],"avg_score":0.0,"description":"A futuristic video pinball game set in space where you use the 2 flippers to send the ball to many different enemies.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40087,"name":"Kodure Ookami","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40085,"name":"Land Sea Air Squad","genres":[],"avg_score":0.0,"description":"Land Sea Air Squad is a 2D top-down shooter, with similar gameplay like Ikari Warriors (and controls from Commando). The player is a soldier, who must defeat an enemy army. As in Ikari Warriors, the player can control vehicles - tanks, helicopters and boats. He has a gun with unlimited ammo and grenades. At the end of each level, the player must beat a heavily armed vehicle.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40077,"name":"Mania Challenge","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/e7ifiucsh0hjspv9apko.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40064,"name":"Gun Dealer","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Gun Dealer features a playfield five columns wide and several rows tall. \"Blocks\" in the form of playing cards gradually fall into this area, and the player must arrange them into \"poker hands\" of three cards or more (straights, flushes, etc.)\n\nAt any time, the player has a three-card \"hand\" displayed at above the playfield. The player can use a joystick to move the falling blocks/cards left or right, and use a button to cycle amongst cards in the hand. A downward movement on the joystick will \"drop\" the active card/block to speed up play.\n\nThe objective of each level is to clear through a buffer of remaining cards for that level (shown by a count on the right side of the screen). At that time, the player is penalized (with a point deduction) for any cards still remaining onscreen. If, after this tally, the player's score is less than zero, the game ends. If, on the other hand, the player score is positive, the game continues and the player is treated to a soft porn intermission of a cartoon pinup girl before the next (more difficult) level begins.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40045,"name":"Dr. Toppel's Tankentai","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/wpuxqbql3qkli9zaazh1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40044,"name":"Exerizer","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The game is a vertical shoot 'em up in the style of Galaga and Phoenix, but with eight-way movement across the screen and parallax scrolling for the stars backgrounds. At the player's disposal to fight the approaching enemies, some of them made in pseudo-depth 2.5D graphics with scaled sprites, is a small space fighter capable of firing two types of projectiles: the unlimited but slow rockets and the fast laser shots that are limited by draining the ship's power. The power can be refilled, and the ship itself upgraded, through collecting the power-ups that appear after destroying certain enemies. \n \nThe game can be played by up to two players in alternating turns. Similar as in Gorf, it features several different types of waves (stages). For instance, one stage features space witches saddle-perched on either serpentlike Chinese dragons or Western-style winged dragons: the dragons must to be hit repeatedly in the weak point of their heads to be killed, after which the riders themselves can be shot for a score bonus. The player progresses through most of them by either destroying all the enemies (resulting in the score bonus and power-up awards) or alternatively just surviving their attacks for a long enough time. \n \nThe game was mostly well received by Western game critics, albeit some criticized it for its depiction of women.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40040,"name":"Finalizer: Super Transformation","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The player starts out as a ship fighting over North America. Capsules are shot from the ground, that when shot open contains either a ship upgrade or powerup.\n\nTransformation\n- The very first item that comes out of the capsule is an upgrade that transforms the ship into a flying robot that has a shield. This shield can take a few hits before transforming back into a ship.\n- With each upgrade the robot transforms and gains a different type of weapon.\n- Pressing button 2 (B) will let the Robot use his shield to block shots head on.\n\nPower ups\n- After shooting the capsule open, if they player shoots again the ship upgrade will change to a power up.\n- Power ups include bonus points, stopping enemies for a certain amount of time, and becoming indestructible for a limited amount of time. During this indestructible phase, the ship/robot cannot shoot but can fly into enemies for tremendous amounts of points.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4q01.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40035,"name":"Ganbare Ginkun","genres":[],"avg_score":0.0,"description":"Ganbare Ginkun is a Mini-Games game developed by Tecmo in 1995 for the Arcade.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40022,"name":"Cop 01","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ghhutuqyivuuyotn1osg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40019,"name":"Sinbad Mystery","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nte717g5tghxn6berxwf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":40002,"name":"Tecmo Knight","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"The protagonist Tecmo Knight has the assistance of \"Smokeman\" and \"Tiger\". Pressing the \"change\" button allows Tecmo Knight to switch between the two. Smokeman uses powerful punches and kicks against enemies while Tecmo Knight rides him. While riding the tiger, Tecmo Knight has the use of a spiked ball and chain less powerful than Smokeman's attacks, but with greater range. When collecting the special dragon skull that randomly appears after defeating an enemy, the Tecmo Knight will summon the most powerful creature to ride on in the game: the Flying Dragon. Tecmo Knight is immune to attack while riding Flying Dragon, whose breath kills any monster in the game instantly, including the stage-end bosses. Using the \"jump and attack\" maneuver, Tecmo Knight can bound Smokeman or the tiger onto enemies and pummel them. \n \nSometimes, if Tecmo Knight runs low on life, a blow by a weak monster will kill only Smokeman or the tiger, leaving Tecmo Knight to fend for himself with a very weak short-ranged attack. It is extremely hard for him to survive at this point. All bosses in the game appear in \"pairs\" making it harder for a single player to corner them. The only exception is the last boss. Currently, there are two \"extra life\" bonus skulls known to exist in the game. Players can also utilize \"props\" like bombs and stone-rollers placed around the map to their advantage. \n \nMuch like the 1988 arcade beat 'em up Ninja Gaiden, Tecmo Knight is hard for beginners, because it requires more patience than button-pounding. Like Ninja Gaiden, the game features a rather disturbing continue screen, where Tecmo Knight is about to be swallowed by an unseen monster. If the player does not continue before the 10 second countdown ends, Tecmo Knight is heard screaming as the monster swallows him. Afterwards, the screen will black out, and a monster will tear through the screen shouting \"NO FUTURE!\", along with \"Game Over\" appearing under the monster.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nfgrtxow2eja4jmylzpg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39991,"name":"Cosmic Guerrilla","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39987,"name":"Pinbo","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/t3cayfvlsgkyssunvi1p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39972,"name":"Gun Loco","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Gun Loco was an Xbox 360-exclusive shooter in development at Square Enix Europe which has been canceled.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ltb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":39959,"name":"Spin Master","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39956,"name":"Legend of Succes Joe","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39954,"name":"Miss Mister World '96","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39935,"name":"Final Tetris","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Final Tetris (파이널 테트리스) is an unauthoritised Tetris arcade game. Similar to Bloxeed and Tetris Battle Gaiden, players gain special abilities by clearing lines containing special blocks. The game is always played against another player, where the ultimate goal is to force the other player to top out or have a more filled playfield when the timer runs out.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/tljze5uuo2pwh2scx5o1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39897,"name":"Deletar","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39868,"name":"Eight Forces","genres":[],"avg_score":0.0,"description":"Eight Forces is a weird game. Everything about it, the visuals, the music, the theme, it’s all quite bizarre, but fascinating. Not many people know its actually related to the Star Force series, more so as a kind of ‘gaiden’ than a continuation of the story, though none of us will really know for sure considering the games story is incredibly mysterious and nothing is really known about it. Despite the English title displayed, the direct translation from the Japanese katakana of the game is ‘Eight Force’.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3ofg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39850,"name":"Silent Dragon US","genres":[],"avg_score":0.0,"description":"Silent Dragon was produced by Taito in 1992. \n \nOther machines made by Taito during the time period Silent Dragon was produced include Arabian Magic, Dead Connection, Dino Rex, Euro Champ '92, Galactic Storm, Star Trax, Warrior Blade: Rastan Saga Episode III, Racing Beat, Pu-Li-Ru-La, and Power Blade.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39847,"name":"Water balls","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Puzzle game published and developed by ABM in 1996.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uessykcfa3efjkq6bnou.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39834,"name":"Exciting Soccer II","genres":[],"avg_score":0.0,"description":"Exciting Soccer (エキサイテイング・サツカ一) is an arcade game from Alpha Denshi, released in 1983. It is an association football game which includes penalty shootout if the game ends in a tie. If you win the game you move on to the next level, each time the opponent gets harder to beat. When you start playing you can choose one of 6 teams: Italy, England, Brazil, West Germany, Austria, or France. The sequel Exciting Soccer II was released in 1984 with Japan replacing Austria and new music, but identical gameplay. The game can be played on a PC with the MAME emulator. \n \nThe game let one or two players play, had a control scheme where they could tackle, shoot, short pass, and long pass, and had realistic touches like corner kicks, throw-ins, penalty shots, and cheerleaders, as well as digitized voices and an influential overhead view.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/x8imveqywaswbbulvm9z.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39828,"name":"Cycle Warriors","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Cycle Warriors is a driving/brawler arcade motorbike game, predating Road Rash.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kc2b5pdaom1z9p9yh7wr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39826,"name":"Drift Out '94 - The Hard Order","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Super Drift Out: World Rally Championships (スーパードリフトアウト?)[4] is a 1995 rallying video game developed by Dragnet and published by Visco Corporation for the Super Famicom. It is the third game in the Drift Out series, and was followed by Neo Drift Out: New Technology; unlike the previous Drift Out '94: The Hard Order, it resembles the first Drift Out and is sometimes referred to as a port or remake for that reason. \n \nAll races in this video game are based on the 1994 World Rally Championship season. Two different types of background music ('normal' and 'hard' beats) and three racing levels (easy, normal, and hard) are available. The top six times are tracked in each of the rally legs; including the super special stage. \n \nA North American release was planned by Accolade, though it was never released. The North American version would have featured fake manufacturer names.[5]","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uotjfdkejm4te2kjbdus.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39825,"name":"Driver's Edge","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aszcxbxw1fbvqtack26q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39813,"name":"Kamikaze cabbie","genres":[],"avg_score":0.0,"description":"A game in which you drop of customers at their desired destination.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6hpo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39812,"name":"Yam yam","genres":[],"avg_score":0.0,"description":"Yam! Yam!? was produced by Dooyong in 1990. \n \nDooyong released 11 different machines in our database under this trade name, starting in 1990. \n \nOther machines made by Dooyong during the time period Yam! Yam!? was produced include Wise Guy, Last Day, The, Gun Dealer, Pollux, and Gulf Storm.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/othfqoeqej81ui04ew54.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39811,"name":"Go go mr yamaguchi","genres":[],"avg_score":0.0,"description":"Go Go Mr. Yamaguchi is an Action game, developed and published by Taito Corporation, which was released in Japan in 1985.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39807,"name":"Xyonix","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Another Tetris-like falling object puzzle game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/utshdjwk3dlpnaild8kv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39790,"name":"Virtua NBA","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pcrgqwvboleszk7rvfjd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39779,"name":"Virtual Insanity","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A first person psychological horror game created for VR. Have you lost your mind? Or has the world around you gone mad?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/cmto5sdahtdnhigjevox.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"}]},{"id":39736,"name":"Bingo the Multiva","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"A fast paced indie platformer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8uc3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"}]},{"id":39729,"name":"Jump Kids","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/wmwxhnnxssicdxvlavbq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39722,"name":"Moon Quasar","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39720,"name":"Mr. TNT telco","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39717,"name":"Mysterious Stones","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39703,"name":"Marine Boy","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ajms4q9a1gsmahogpnpe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39690,"name":"Mariner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/kmilpur9smatbs1z87up.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39685,"name":"Funky Fish","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/il9vtr6fqsbqqxbnyzsz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Atari 2600"}]},{"id":39684,"name":"Gardia","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/jtnseexhzalrxvzq3ehs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39676,"name":"Crazy Cop","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A shooter where you play as a green-haired dude. This game is the Japanese version of Gang Busters.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39673,"name":"Dyger","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Dyger was produced by Philko in 1989.\n\nPhilko released 7 different machines in our database under this trade name, starting in 1988.\n\nOther machines made by Philko during the time period Dyger was produced include Twin Falcons, Whizz, Xyonix, Atomic Point, Lock On, and Turtle Ship.\n\nAn air combat shooter.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4n2m.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39671,"name":"Faster Harder More Challenging Q*bert","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Hop on all the squares to change them into the correct color. Avoid hitting Coily and Q*Bertha. Jump on the platforms to be carried to the top of the pyramid and maybe make an enemy jump to its doom.\n\nBelieving that the original game was too easy, Davis initiated development of Faster Harder More Challenging Q*bert (also known as FHMC Q*bert) in 1983, which increased the difficulty, introduced Q*bertha and added a bonus round. However, the project was canceled and the game never entered production. Despite this, Davis later released FHMC Q*bert's ROM image onto the web.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7o1t.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39658,"name":"Super Slams","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39636,"name":"Carnica","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Two players control a spaceship defending a city by shooting enemy spaceships throughout many different levels. \nSuccess, the Dcon maker, released 7 different machines in our database under this trade name, starting in 1989. \n \nOther machines made by Success during the time period Dcon was produced include Cotton 2, Cotton Boomerang, Guardian Force, Psyvariar, Zooo, and Cotton.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/p4og7xoj3i8q6plzegv3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39631,"name":"Digger Man","genres":[],"avg_score":0.0,"description":"An excellent and addictive puzzle game with 32 levels. The player must control character and gather 20 jewels to open a doorway to the next level before his life gauge expires. Eat fruit for more life and avoid bugs and falling rocks.\nFace, the Digger Man maker, released 7 different machines in our database under this trade name, starting in 1988.\n\nOther machines made by Face during the time period Digger Man was produced include Gururin, Money Puzzle Exchanger, Nostradamus, Sand Scorpion - Sasori, Quiz DNA No Hanran, and Albatross.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7m66.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Neo Geo MVS"},{"id":0,"name":"Neo Geo AES"}]},{"id":39604,"name":"MegaPony","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39563,"name":"Tattoo Assassins","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Tattoo Assassins was a Mortal Kombat \"clone\" which never got officially fully released due to the waning popularity of Arcades in the late 90s. The game was essentially completed before it was cancelled, though it has some minor gameplay and sound glitches, and prototype cabinets were released to test markets in 1994.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3cuj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39533,"name":"Gridlee","genres":[],"avg_score":0.0,"description":"Gridlee is a game that was never released. It was developed by Videa, Inc. in 1982, on hardware designed by Howard Delman. Videa was eventually acquired by Pizza Time Theater and formed the core of their new Sente Technologies division. The hardware that Gridlee ran on evolved into the Bally/Sente SAC I system, which provided a cartridge-based arcade gaming platform that supported such games as Snake Pit, Stocker, and Hat Trick.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39525,"name":"Defend the Terra Attack on the Red UFO","genres":[],"avg_score":0.0,"description":"Destroy all the small flying saucers then destroy the mothership.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39513,"name":"Teeter Torture","genres":[],"avg_score":0.0,"description":"Teeter Torture is a game that has rather mysterious origins. Only a single cabinet has even been found for it. (Fortunately it has been making regular appearances at the California Extreme show for a number of years.) For years there was even confusion as to whether it was an Exidy-produced prototype or some bootleg running on the Exidy hardware.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39511,"name":"Load Runner 4","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39505,"name":"Tail to Nose","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39456,"name":"Nebulas ray","genres":[],"avg_score":0.0,"description":"NebulasRay (ネビュラスレイ Nebyurasurei?) is a vertical scrolling shooter arcade game that was released by Namco in 1994 (but was first referred to, in the Katakana syllabic writing system of the Japanese language, in the ending for Tinkle Pit in 1993); it runs on the company's NB-1 hardware, and the players assume control of two spaceships called the \"Fighting Rays\" (red for Player 1, blue for Player 2), through six areas (Exeo, Evergrenes, Lost Marinarc, Sandvurn, Stream Drive, and Master Fortress), along with an \"extra\" one called the \"Challenging Area\" (which is the same as the first one, but the players will only have one life to get through it, for their remaining lives will have been added to their scores, after defeating the sixth area's boss). If one player is playing the game alone, another one cannot join him or her on this area, and if either player dies on it, they will not be able to continue - also, if one player was playing alone and enters his or her initials on the game's high score table after losing his or her last life and not inserting another coin to continue in time, dying on the Challenging Area, or clearing the Challenging Area, the other player's score will always be given as 7650 (Namco's goroawase number, even though, unlike in Toy Pop, Cosmo Gang: The Video, and Lucky & Wild, both scores are not combined).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ief3yt4ejuowsnmpqras.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39444,"name":"Chase 1929","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39438,"name":"Maximum Speed","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A car racing game from Sammy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ggtd17gpem3y06yqj9hm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39433,"name":"Sega Bass Fishing Challenge","genres":[],"avg_score":0.0,"description":"Sega Bass Fishing, also known as Get Bass, is an arcade fishing video game developed in 1997 by Sega for the Sega Model 3 hardware. The game has since been ported to the Sega Dreamcast, Microsoft Windows, Xbox 360, Sony PlayStation 3 and Nintendo Wii.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39432,"name":"Sega Clay Challenge","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"An arcade target-practice game by Sega focused on the sport of clay pigeon shooting.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/re9mcf0virx2rsigudbl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39431,"name":"Sports Shooting USA","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"A competitive 1 to 2 player shooting game where players, using optical guns, must shoot a number of required on-screen targets within a certain time limit to qualify and proceed to next round.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7xvc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39430,"name":"Extreme Hunting 2: Tournament Edition","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39427,"name":"Warrior Blade","genres":[],"avg_score":0.0,"description":"Player chooses one of three warrior characters and battles fantasy creatures in a land of swords and sorcery. Specific joystick/button combinations make the characters perform special offensive moves against the enemy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3h6x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39421,"name":"Fishin' Frenzy","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39398,"name":"Pigskin","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39390,"name":"Roc'n Rope","genres":[],"avg_score":0.0,"description":"You play an archeologist whose mission is to return the missing feathers to the golden Phoenix. Use your harpoon-gun to fire a rope to higher platforms and then climb up. Use your flashlight to dazzle stun the attacking dinosaurs and cavemen.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39378,"name":"Pig Out","genres":[],"avg_score":0.0,"description":"In this game, a bunch of little piggies run around in a gym-like maze trying to eat up all the goodies on the road. They must avoid an evil butcher and several big bad wolves chasing them.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39374,"name":"Hat Trick Hero '94","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ajqlf2rwodsuibtdwidu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39310,"name":"Port Man","genres":[],"avg_score":0.0,"description":"Port Man was produced by Nova Games Ltd. in 1982. \n \nNova Games Ltd. released 4 different machines in our database under this trade name, starting in 1982. \n \nOther machines made by Nova Games Ltd. during the time period Port Man was produced include Intrepid, New Multi Game 5, and Street Viper. \n \n \nGame Play \n \nCatch the luggage that falls from the top conveyer belt and throw it up into one of four berths on the ship. You need to get four in each berth without getting hit by a rock thrown by the man on the ship, getting run over by the luggage cars or before running out of luggage on the conveyer belt. The second level, you throw a rock up at some crates of dynamite, knocking one down. You need to catch it before it hits bottom. When a crate reaches bottom it explodes, removing the lowest level of your playing area. If you are hit by a rock thrown by the man on the conveyer belt or if you are on the same level with the exploding crate, you lose a life. You get points for every crate you catch. Then you return to the ship only this time the speed has inceased.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lmcyjvuygbgc7vwl46uk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39303,"name":"Astro Zone","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A New Dimension...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/sltxp5lkblbcj0h8oycx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39296,"name":"Twin Eagle II: The Rescue Mission","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Twin Eagle II puts you in command of a helicopter in the middle of urban warfare. After the first-and frankly mediocre-Twin Eagle, this new section provides two or three enhancements that make it a bit less undrinkable. But good ideas without proper implementation have never been successful ...\n\nYour vehicle is equipped with two shots: a direct hit and a missile on the ground. These missiles on the ground are theirs alone sheer madness: they allow you to destroy everything on screen! You like to destroy buildings, trains passing by? Then you can give to their heart. Moreover, these missiles are the only way to destroy enemy ground. Your fire front can be customized by momentarily enough bonuses in the game, but always keep the same configuration, namely two parallel shots. And lastly, your helicopter has a special attack which is also rotating think Zero Gunner.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co996c.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39281,"name":"P-47: The Phantom Fighter","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"P-47 is a two-dimensional, scrolling shooter type of game. You play as the pilot of a P-47. Your mission is to basically destroy as many of the enemies as you possibly can. This means eliminating as many air and ground units as you can. You will be going through four missions (each being broken up into two parts) and at the end of each of these parts is an enemy boss for you to tangle with. Although you have unlimited ammunition, the enemy will make you pay for the invasion into their homeland. You will be able to accomplish this with various power-ups and also a second player (if they buy in). Your mission won't be easy but it is necessary so you can secure both the skies and ground for our troops.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/atrk96mvi1gzfzwj6ech.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":39272,"name":"Deer Hunter 2017","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"From the creators of Deer Hunter 2014! Return to the wild and hunt across the globe in the world’s greatest hunting experience.\n\nHUNT AROUND THE WORLD\nPursue trophies in unique and beautiful locations that span the globe from Alaska to Zimbabwe.\n\nBAG BIG GAME ANIMALS\nHunt animals so real they nearly jump off the screen! Track down and bag the world’s most exotic and elusive game.\n\nSHOOT LIKE A PRO\nDevelop a steady hand, line up your sights, and master the skills to take the perfect shot.\n\nGET THEM BEFORE THEY GET YOU\nTake down predators before you become the prey.\n\nCOLLECT TROPHIES\nCompete for bragging rights and bag the biggest animals with achievements and leaderboards!\n\nBUILD YOUR ARSENAL\nCollect and customize your firearms with scopes, magazines, barrels, and stocks as you perfect your weapons for each hunt.\n\nHigh-end, immersive tablet gameplay!\n\nIt’s Open Season - join the hunt today!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/syn7cmxcfwcqnxlz8rm8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":39268,"name":"Aptoide","genres":[],"avg_score":0.0,"description":"Aptoide is the game-changing alternative Android App Store. With over 150 Million users worldwide, 3 Billion downloads and 700,000 apps, Aptoide gives a new meaning to the way we discover and install apps through social collaboration, tailored recommendations and the opportunity to create and share your own personal store. \n \nDevelopers, OEMs, and Telecommunication Companies have access to a fully customizable app store distribution and a competitive revenue share model, worldwide. \nWith an ever-growing community and a solid number of partnerships, Aptoide is now one of the leading players in the Apps world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39258,"name":"Pixelmon Hunter","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39256,"name":"Underworld Empire","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Mafia-RPG Mobile Game","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/cwtzvzzno2b5hu762zfq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39255,"name":"Dawn of Gods","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aksntv3deuknkglbrvo3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39247,"name":"Arma Tactics THD","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Arma Tactics is a turn-based close-combat strategy game, where the player takes control of a four-member Special Forces team. There are no given strategies, rails to move on, or paths to follow; it‘s up to the player to decide how he will play through both the story-driven missions and generated missions with randomized objectives. Whether using stealth or a more direct approach, players will need to use their strategic thinking and use both basic and advanced weaponry while facing many different opponents - ranging from unorganized local militia to smart and skilled mercenaries. \n \nWith highly replayable missions, achievements, weapons to unlock and whole campaigns to be regularly added, Arma Tactics offers many hours of intense ever-changing action.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/y5w2xc9qxesujjaj8k88.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39246,"name":"Defenders: TD Origins","genres":[],"avg_score":0.0,"description":"Defenders: TD origins merges classic tower defense gameplay with collectible card mechanic. \nYour towers, spells and traps - all are the magic cards. Collect them, fuse them and get them even more powerful! Freeze, burn, poison, explode and slash countless enemies with unique Magic and Tower collection! \nChoose your cards carefully, play them strategically and expect heavy resistance along the way - from small and harmless mutated fungi to powerful giant goblins and dragons! \nEnhance your hero spells and skills, be strategic and try Heroic Mode to become the greatest Defender. \n \nKEY FEATURES: \n \nStunning 3D-graphics with amazing effects truly best in their genre; \nUnique mix of tower defense strategy with collectible card game elements; \nOver 26 battle towers - the greatest TD arsenal ever; \nUp to 25 levels of tower upgrades to improve the devastating experience; \nOver 13 kinds of deadly magic spells to burn the evil; \nOver 36 types of violent monsters: underground, exploding, swarming, intelligence, phantom and mighty bosses with unique abilities; \nYour own strategy for every map - find the unique combination of towers and magic to build an incredible defense! \nSpecial placements on the map and anomalies to boost your powerful attacks; \nHeroic mode for truly experienced TD Veterans \nCaptivating storyline with 23 missions, extra boss levels, and randomly generated missions; \n \nHEARD ON THE MEDIA: \n \n«It is truly one of the most beautiful TD titles to ever hit Android» - AndroidHeadlines \n \n«The graphics are fantastic and the few changes in an established formula makes for a great little game» - tech-tongue.com \n \n«Getting strong towers and magic and using them intelligently is a lot of fun, especially since there’s no arbitrary energy to limit how much you can play» - TechnologyTell.com \n \n«TD That's More Than a Pretty Face» - toucharcade.com \n \n«A lot of fun and one of the best tower defense games on the market»- gamingnexus.com \n \nAwesome 3D graphics, ultimate TD arsenal, immersive environment, powerful towers, deadly spells, Runes, Totems, heroes and dragons and even more amazing features! \nTry it right now and claim the Prime!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39243,"name":"Doug Dug","genres":[],"avg_score":0.0,"description":"Doug is a dwarf that loves digging. How far can he go?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/t4hlxvubes7yqmvkjir8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39242,"name":"Ant Raid","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Ant Raid is a Plants and Zombies-esque iOS game developed by Prank Ltd. and released July 6, 2011. \n \nThe game has received universal acclaim, garnering a rating of 90% on Metacritic, based on 8 critic reviews","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39235,"name":"Rival Kingdoms: Age of Ruin","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39229,"name":"Dash till Puff 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39226,"name":"Stickman Battlefields","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39225,"name":"Fail Hard","genres":[],"avg_score":0.0,"description":"Try to crash your bike in this goofy arcade game \n \nYou control a stuntman named Johnny whose goal is to collect as many gold coins as possible. He does this by riding his bike onto ramps, through pipes, over boats, and a variety of vehicles. In order to progress to higher levels you must collect a certain amount of gold coins. Overall, the tone of Fail Hard is light-hearted and displays cheesy jokes on loading screens. \n \nMuch of Fail Hard comes down to trial and error: you'll crash a few times just to figure out where are all the coins are located and how to reach them. This isn't particularly annoying and it's nice that Fail Hard doesn't force you to make in-app purchases to play for long periods of time.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39221,"name":"Nitro Nation Online","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39220,"name":"Bladelords: The fighting game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39219,"name":"East Legend","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39215,"name":"Pot Farm - Grass Roots","genres":[],"avg_score":0.0,"description":"Pot Farm: Grass Roots is a social farming game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ih8xp2q3mldnukn3nzfw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39212,"name":"Siegecraft TD","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39199,"name":"Rockbot","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mbscffofgngkaxf5hcpz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39196,"name":"King of Solitaire","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39195,"name":"Prop Hunt Portable","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39189,"name":"High School Story","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39187,"name":"Multicraft","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Multiwinia: Survival of the Flattest – challenge your opponent to digital warfare in this the retro-arcade RTS. Only the flattest will survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/gcat8iutl3iqiah11ufd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39186,"name":"Modern War by Gree","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39183,"name":"Devil Maker: Tokyo","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39178,"name":"Spirit Stones","genres":[{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Spirit Stones combines a match puzzle game with card collecting.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/zjwqdo3iah0gyhkmviny.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":39176,"name":"Brave Brigade","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39173,"name":"Galaxy at War Online","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Galaxy at War Online is a mobile resource-based strategy game, with planet colonisation and player alliances.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uynzqyc8lgxh3alilf0j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39170,"name":"Westbound: Pioneer Adventure","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39169,"name":"Aces Spades","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39168,"name":"Dizzy: Amstrad Action Special Edition","genres":[],"avg_score":0.0,"description":"A special edition of the first Dizzy game created especially for Amstrad Action Magazine which sees you as Dizzy creating the potion to defeat Zaks, but you can't reach him in this game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nkdynbghz4gwwmb6q2cy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39167,"name":"Super Seymour Saves the Planet","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Join Seymour in his first action film, saving the Earth from nuclear waste in this Bomb Jack clone.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mvicqbpyej5936hdxqi2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39166,"name":"Sergeant Seymour RobotCop","genres":[],"avg_score":0.0,"description":"Seymour's at it again. Fight crime in this futuristic parody of Robocop.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39165,"name":"Stuntman Seymour","genres":[],"avg_score":0.0,"description":"Seymour is now careering as a stuntman. Get him through numerous levels and earh his pay.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39162,"name":"Herores Rescue","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39157,"name":"Silicon Dreams - Snowball","genres":[],"avg_score":0.0,"description":"Plot \n \nAs the Snowball 9 approaches Eden, something goes wrong. A crew member murders her shipmates, destroys the communication system and sets the ship on a collision course with the sun. The robots, being little more than automata, continue their everyday operations oblivious to the danger but the ship's computer, capable of thinking, awakens Kim Kimberley before the deranged crew member destroys it. She exits her modified stasis chamber with the goal of finding a way to reach the control room and avert disaster. \nDevelopment \n \nSnowball was originally released during 1983 as the company's fourth adventure game using the A-Code system.[1] Nick, Mike, and Pete Austin headed development. Though Level 9's previous games featured a fantasy theme, the Austin brothers chose a science fiction theme.[5] The original release used version 1 of this system[6] and was initially released only for the BBC Micro, Sinclair ZX Spectrum and Nascom,[7] but was later followed by versions for the Commodore 64, Camputers Lynx, Oric-1, Atari 8-bit[8] as well as for the Memotech MTX, Amstrad CPC, Enterprise and MSX.[9] It is noteworthy for including over seven thousand locations. To achieve this sixty-eight hundred locations on the passenger disks form a colour-coded maze with minimal descriptions. \n \nAnother peculiar aspect of the game was the confusion behind the main character's gender. In an interview for Sinclair User, Chris Bourne asked, \"Is the androgynous Kim a man or woman?\" Pete Austin pointed out that \"there's a credit at the end for the design of 'Ms Kimberley's costume,' \" but also admitted that Kim Kimberley was \"a deliberately unisex name.\" The debate came to an end with the release of Return to Eden, where it was made more explicit that Kim was not a man, because the surviving crew members confuse her with the woman who tried to destroy the ship.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39156,"name":"Silicon Dreams - Return to Eden","genres":[],"avg_score":0.0,"description":"Plot \n \nWith the Snowball 9 orbiting Eden, the surviving crew members put Kim on trial. The only evidence against her is the \"mempak\" from the control room, which shows her as the hijacker rather than the saviour. Despite the fact that the recording is damaged and thus is unreliable, they sentence her to death. About to be thrown into space, Kim manages to escape aboard a \"stratoglider\" and an hour later, lands on Eden. At this point the game starts. \n \nThe first thing the player must do is find a shelter for Kim, because a few moves into the game the Snowball 9 crew use the ship's engine to try to burn her down. The native robots take this as proof that the Snowball 9 is not the ship they were expecting but a hostile alien craft they must destroy. The objective is to contact the robots before time ends for the Snowball 9 and everyone aboard it. \n \nDevelopment \n \nUnlike its predecessor, Return to Eden only had about two hundred and fifty locations, but it was Level 9's first game to feature graphics.[5] Other adventure games had included graphics before, but version 2 of the A-Code system, allowed Level 9 to encode location graphics into as little as forty bytes. This size made it possible to add graphics to every location of the game for all formats with more than 32 K RAM. The user could choose not to display them and play the game in text-only mode. It was released for the same platforms as its predecessor. \n \nThe game's first cover depicted a robot fighting a monster plant in Enoch. The robot resembled a comic book character, so to avoid legal troubles, Level 9 commissioned Godfrey Dowson to do a new cover. Dowson's illustration depicted another robot in the jungle looking towards Enoch. Level 9 was not satisfied with the result and asked Dowson to do it again. They liked the third cover so much, they hired Dowson to do artwork for the re-release of their old games as well as for their future titles. \n \nPete Austin commented on the game: \"It's an alien theme park gone wild. The Eden universe is more like Larry Niven's future space.\" and \"...is intended as a comment on superpower intervention in the Third World.\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39155,"name":"Silicon Dreams - The Worm in Paradise","genres":[],"avg_score":0.0,"description":"Plot \n \nA hundred years after the arrival of colonists aboard the Snowball 9, planet Eden has become home to half a billion people. In this paradise managed by robots there is not any crime, taxes, unemployment, or freedom. The population lives in a domed \"megapolis,\" and perhaps due to the war that occurred during Return to Eden, there is not any contact between the cities and the surrounding natural world. The occasional sighting of flying saucers keeps the population afraid from going outside. \n \nThe main character, a nameless citizen of Enoch, starts the game in a beautiful garden where everything seems fine. He picks an apple from a tree, a worm pops out, and the player follows it outside the garden, through the desert, and then he awakens. It was only a simulation, one of the many forms of entertainment available during the reign of the third Kim. This \"Garden of Eden as a prison\" allegory sets the mood for the entire game. The objective is to explore the city, and while doing so the player must gather clues to unmask the government conspiracy behind the flying saucers. \nDevelopment \n \nThe Worm in Paradise is the third and final instalment of the Silicon Dreams trilogy and is a departure from the previous games. It \"evolved alongside a 12 month enhancement on Level 9's own adventure system. Standard features include a 1,000 word vocabulary, a very highly-advanced English input, memory-enhancing text compression, the now familiar and very much appreciated type-ahead, and multi-tasking so a player need never wait while a picture is drawn.\" This was the first game using version 3 of the A-Code system. It was released for four fewer platforms, excluding the Lynx, Memotech MTX, Nascom and Oric-1 compared to the two previous releases. \n \nAnother difference is that the player has only seven days, within the game's clock, to complete the game. Quests are also time-based and require that the player arrive at certain locations at specific hours to achieve the desired goal. And while game play remains the same, the backdrop is no longer an action adventure, but a political thriller that resembles the novel Nineteen Eighty-Four. Similar to what happened when Snowball was released, there was certain confusion about the main character's identity and the time when the story is set. The Level 9 Fact Sheet says: \"...a couple of years later, Kim Kimberley has become a legend on Eden.\" Another article stated: \"Worm in Paradise is set 100 years later. You are now Kim Kimberley III...\" Furthermore, Pete Austin said, \"Worm is set on Eden, about 50 years in the future\" and \"The player is not Kim - she becomes mayor and runs the place.\" Notice that these sources termed the game by its original name, Worm in Paradise.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39149,"name":"Rex Hard","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Music","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Rex Hard, encontró un viejo pergamino español donde se narraban las vicisitudes sufridas por los colonizadores, ataques de los nativos, enfermedades, etc., hasta que encontraron lo que el autor de la crónica definió como el \"rayo diabólico\". Rex, clásico tipo amante de las emociones fuertes, puso rumbo hacia la selva amazónica en busca de tan excepcional artefacto. Buena aventura, ¡Vive Dios!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aptc3b4emdhjdpbuqyl3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39148,"name":"Roland in Time","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"El pobre Roland ha sido arrojado a la Tierra por el diabólico Maestro. Los cristales que dan poder a su ultra-moderna nave han sido desperdigados por el pasado y el futuro de la Tierra. Tu misión es guiar a Roland a través de las eras de la Tierra, buscando los cristales que le permitan volver a casa.\nMientras te mueves de escena a escena, vigila las criaturas y objetos que tratarán de destruir a Roland. Necesitarás de toda tu habilidad para buscar las 53 escenas en las que están escondidos los cristales.\nLa ventaja es que tienes bastantes tanques de regeneración en tu nave, pero sólo se pueden usar 9 veces.\n¡BUENA SUERTE!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hyqfcnddfhez1vahyw6p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39147,"name":"Roland Ahoy!","genres":[],"avg_score":0.0,"description":"After loading, press the DEL key and the ship is now under your control, in \nthe Map Scene. \nTo move the ship up, down, left or right use either the AMSOFT JY1 Joystick \nor the cursor control keys. \nTo move from the map !o another scene, you must dock the ship against the \nquays (the grey zones). Your first visit must be to Powder Quay to collect \nammunition. After Roland has collected ammunition, he must move as far as \npossible to the left and then jump on board using both the fire button and \nleft direction simultaneously. The map will then reappear with the ship in the \nappropriate position. \nTo fire a cannon ball or to make Roland jump upwards, press the joystick \nbutton or the key marked X on the keyboard. To make Roland run left or right \nuse the joystick or the left and right cursor control keys. \nAfter losing a life, the boom is rebuilt, but Roland retains the ammunition \nand treasure that is on board the ship. \nAfter treasure has been deposited at the back of the cave, or has been stolen \nfrom the harbour, Roland boards the ship automatically as he reaches it. The \ngame then returns to the map scene and you must repeat the sequence to obtain \nfurther items of treasure. There are many items of treasure which are stolen \none by one. After obtaining three of a kind a new treasure appears in the \nharbour. \nNOTE; The program prevents the moves below, so no cheating is possible! \n \nOnce you have collected cannon balls, you may only use them to fire at the \nboom. Firing is not possible at point-blank range. \n \nYou may not enter Powder Quay with ammunition or treasure. \n \nYou may not enter the harbour with treasure. \n \nYou may not visit Treasure Cove without treasure.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39142,"name":"Spannerman","genres":[],"avg_score":0.0,"description":"Tú y tu maravillosa llave inglesa sois los únicos que podéis salvar el mundo del desastre nuclear. Las tuberías refrigerantes del reactor de la estación de poder nuclear local están goteando. ¿Podrás evitar las ratas antimateria y los escombros que caen, o iréis al otro mundo tú y tu reactor?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39141,"name":"V - The Visitors","genres":[],"avg_score":0.0,"description":"There were two popular sci-fi television miniseries called V in 1983 and V: The Final Battle in 1984 which led to one season of a television weekly series also in 1984-1985. The plot involved an alien invasion of Earth by a reptilian race known as \"The Visitors\". In this game, you play as Mike Donovan, a resistance leader who enters the visitors' huge spaceship in order to blow up its reactor by setting explosives at key points. \n \nThe aliens will try to stop you as will surveillance, cleaner, maintenance, and security robots. If you touch any robots or are shot by them, a static charge will cause your hearbeat to increase. If this happens several times you have to rest or it could kill you. In 8 different laboratories you will find formulas for Red Dust which is lethal to the aliens - releasing it into air purification plants will kill many of them and also slow the robots. You can use a laser or when its charge runs out, you can jump over or roll under enemies. \n \nThe gamescreen has three sections. The middle and upper are corridors you are going through and one above or below you. The bottom of the screen is a communiputer with various sections. One allows you to monitor the aliens' messages and to send messages of your own to confuse them; another shows your score and time remaining, and levels of health and laser power. There's a six-button menu: pause/quit, ship info, lay explosives, return to game, display secury code, and info on anti-Visitor red dust formula. Also, there's six number keys (the aliens count in base 6) which you need to type in security codes to unlock doors. You can also move between levels using teleport pads. Finding the key points in the ship is crucial before you set the explosives which will be on a timer so you have a chance to get out before they blow the ship up.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39135,"name":"Super Pipeline II","genres":[],"avg_score":0.0,"description":"As Foreman Fred you must defend the pipework supply against the attacks from the manic power drills as they cause leaks and protect your workmen from gnawing caterpillars and ferocious hammers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/isbgyic5hkrwrtq7hfye.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39133,"name":"Starstrike 2","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In Realtime's previous Starstrike game (not to be confused with Star Strike), the evil Outsiders attacked the Federation and had to be forced back. This time, the boot's on the other foot, as the Federation have sent their Starstrike II vehicles in to take them out. Armed with sophisticated computers, lasers and shields, all it needs is a good pilot, such as yourself. \n \nTwenty-two planets fall under Outsiders control, and each has grid-based defenses which must be taken out, complete with all their command computers and production droids. The planets are split into five groups, each of which can be chosen at the start of the game. \n \nThe combat is intense, and aims to create the likely feel of space combat, with lots of ducking and weaving to set up shots. The game features filled-in graphics, unlike the Elite-esque wireframes of the first game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dgexmtalggjalz6umnhs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39130,"name":"Pulsator","genres":[],"avg_score":0.0,"description":"Tu Pulsator no tiene opción Ha sido colocado en el centro de una serie de laberintos altamente peligrosos. Para escapar, debe rescatar a los cinco «pulsies», cada uno de los cuales está cautivo en un nivel distinto del laberinto. \nPero no está solo. Una gran variedad de Pulsators enemigos patrullan por el laberinto, cada cual más inteligente y mortífero, con su peculiar manera de hacerte la vida más difícil. \nHay cinco niveles en el juego, cada uno de 49 salas. Tienes que completar un nivel antes de poder llevar a tu Pulsator al siguiente. En cada nivel hay un «Pulsie» que rescatar. Esto se hace encontrando la llave que abrirá la puerta de su cárcel. \nLos Pulsators enemigos se hacen más peligrosos con cada nivel que alcances. El laberinto también se hace más difícil según cambias de nivel. \nEl juego es bastante más complejo de lo que parece, no es cuestión de liarse a tiros y de encontrar la salida del laberinto. Hay seis tipos de puertas, numeradas del uno al seis, que se pueden abrir o cerrar pasando sobre unos sensores. Los sensores también están numerados de uno a seis. Si un tipo de puerta está cerrada y pasas sobre su sensor correspondiente, la puerta se abrirá. Sin embargo, si la puerta está abierta, pasando sobre el sensor, la cerrará.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39129,"name":"Welcome to Amsoft Side B","genres":[],"avg_score":0.0,"description":"When a user bought a 464 (tape) model of Amstrad/Schneider CPC there was a demo tape in the box. \n \nSame with disk (664/6128) models, there was a demo disc included, that was later changed with games. \n \nThe tape offered a short and simplistic demonstration of the CPC's graphical and sound capabilities, promoting the fact that the CPC was a good all-aroun machine, equally for business and games.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39128,"name":"Welcome to Amsoft Side A","genres":[],"avg_score":0.0,"description":"When a user bought a 464 (tape) model of Amstrad/Schneider CPC there was a demo tape in the box. \n \nSame with disk (664/6128) models, there was a demo disc included, that was later changed with games. \n \nThe tape offered a short and simplistic demonstration of the CPC's graphical and sound capabilities, promoting the fact that the CPC was a good all-aroun machine, equally for business and games.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39124,"name":"Venom Strikes Back","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Venom Strikes Back is a single player side scrolling, two dimensional, shoot-em-up. It is the third game to be based on the popular MASK comics, TV series, and books of the mid 1980's.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39117,"name":"Campeones","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Only champions reach the finish line. With your prototype you can take part in the most exciting rally race in the world in Campeones. Up to eight runners can participate in the same race, taking turns at the start. The test consists of six stages, having to go through them in a specified minimum time to be able to move on to the next one. You must have a lot of skill to finish the stage without crashing before you arrive, or not running over the race commissioner, because you will also be disqualified.\n\nIf you're ready, get behind the wheel of your racing car and race!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39116,"name":"Cessna Over Moscow","genres":[],"avg_score":0.0,"description":"Relive a flying adventure with Cessna Over Moscow, a super-arcade game. Reflexes, dexterity, audacity and speed will not be enough to achieve the aerial expedition to more than 1000 km, with the autonomous limits of the plane, within a region controlled by radar and at the mercy of the Soviet \"MIG\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pyih4bp5lqo02mselgky.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39114,"name":"Charly Diams","genres":[],"avg_score":0.0,"description":"Charly Diams is an action adventure game about a young man Charly searching for a hiding place of a treasure with blue diamonds. Help Charly collect seven miraculous flowers scattered around the world in order to unveil this place.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dojmvpbo70fuvtvzyshu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39113,"name":"Cheril of the bosque","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39112,"name":"Le Chevalier Blanc","genres":[],"avg_score":0.0,"description":"Le Jeu : \n \nAngola : Monseigneur, je dois la vie au Chevalier blanc. C'est lui qui m'a \nsauvé des griffes des monstres du chateau. \n \nLe Roi : Chevalier par queUe magie as-tu réussi ce prodige. Personne n'est \njamais revenu de là-bas! \n \nChevalier blanc : Ah! Monseigneur, il fallait que voire fille soit aussi \nbelle et que votre bras soit puissant pour m'armer de courage car la bataille \nfut terrible. Votre fille m'avait demandé de l'escorter dans les champs afin \nde cueillir un bouquet lorsque nous f�mes assaillis par les monstres de la \nforêt. \n \nJ'eus beau en tuer une dizaine, ils réussirent à me ravir voire fille et mes \narmes. \n \nJe pris alors mon courage dans une main et capturai un cheval de l'autre. \nNous travers�mes les marais o� les monstres, sans doute fatigués par les \nmorsures de voire fille, avaient abandonné là mes armes. Lorsque je fus devant \nle ch�teau, je donnais à mon cheval des fleurs magiques gr�ce auxquelles il \nfil un bon fabuleux au-dessus du pont levis. Alors je dus visiter le ch�teau \net me battre contre mille démons pour ramener la princesse. Pour récupérer les \narmes dans les marais : on ne peut prendre que les armes qui clignotent. Elles \nsont indispensables pour passer au tableau suivant.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39109,"name":"Codename Mat 3D","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Codename MAT - MISSION: ALIEN TERMINATION - the desperate plan to place in the \nmind of a teenager the combined tactical skills of all the planetary leaders in \nthe solar system. MAT is mankind's last hope. \n \nFor decades the Myons have sought to dominate the Solar System, whose fleets \nare now ragged and depleted. They have launched an all-or-nothing attack, \nknowing that Earth is developing revolutionary space-craft. Only the prototype \n- USS Centurion - has been built, and it must be pressed into immediate service \nas both battle-cruiser and tactical command centre. \n \nPiloting the craft in battle and controlling the Planetary Defence Fleets is \nbeyond any normal human... MAT is created. \n \nNow your mind is MAT's mind. Take control of the Centurion and blast off on the \ngreatest adventure of all...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39106,"name":"Curse of Sherwood","genres":[],"avg_score":0.0,"description":"Sherwood Forest has been taken over by the evil cult of Sagalia. You play the pan of Fnar Tuck, who must decipher the blood-stained parchment found on the body of the Bishop of Derby. \n \nThe first part of the rhyme on the parchment requests you to gain fire protection by finding werewolves fangs and a scrying glass. Then you must trek through the misty wood until you find the abode of the Witch of Good. Give them to her. and she will give you fire protection in return. \n \nThe second verse tells you that if you find the \"man of solitary means\" he will give you a map. However, this map is hard to decipher, but is meant to help you get safely through the forest \n \nTucky makes his way around the forest, encountering all manner of nasty creatures. They shoot at him and he can fight back by throwing swords and, if he finds them, other weapons. \n \nI like this game very much. It has given me many hours of pleasure. It is easy to get into, yet difficult to get out of. I still don't know how the scoring works. I think it works on tasks done\" like the first pan of Short Circuit. Graphics, although simple and single-colour-ed, are still ample for the game and do not detract from the overall appeal. Sound is just the standard bang-bang.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39105,"name":"The Devils Crown","genres":[],"avg_score":0.0,"description":"\"... as the Pirates slowly remove the Sparkling Stones they feel a cold eerie \nwind pass through their hair. Suddenly, as the final Stone is removed from the \nCursed Golden Crown a massive Devil from the darkest depths of Hell, is \nunleashed, murders all on board and sinks the ship... with the treasure\". \n \nAfter many years of careful research the position of the pirate ship has been \ntraced and legend speaks of death and evil on board. Do you dare to return to \nthe sunken ship and recover the Seven Jewels which have been scattered around \nthe 40 rooms of the wreck, and replace them in the Crown. Before you recover \nthe jewels you must first prove yourself by replacing each flashing object \nwith the equivalent solid object also hidden around the ship. Only then is a \nflashing jewel revealed which must be replaced by a solid jewel. \n \nHowever, with pirate ghosts guarding the jewels, killer fish and other \nnastiea your task is not an easy one, especially when you are in desperate \nneed of oxygen. \n \nCONTROLS \nJOYSTICK","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39104,"name":"Gazza's Super Soccer","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ffn0ej6dbq65bvo9sxuv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39099,"name":"Advanced Art Studio","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39098,"name":"Almirante Graf Spee","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"El juego está basado en los archivos de los hechos ocurridos a la expedición suicida \"Graf Spee\" en el Atlántico Norte y Sur. Un pixel intermitente te indicará en el tablero la presencia de barcos enemigos en el Atlántico. El año es 1940, como capitán del Almirante Graf Spee, tu tarea será hundir los barcos enemigos, utilizando para ello tus 6 cañones de 11\" y los torpedos. Patrulla la zona, localiza el barco y utilizando los instrumentos a tu disposiciónm que incluyen velocidades variables, posibilidad de dar la vuelta, combustible, distancia del objetivo, estado de munición y torpedos, maniobras dentro del campo de visión para atacar. Pero el enemigo puede tomar acción evasiva. Recargar el combustible te pondrá en una posición vulnerable y los cruceros y barcos de querra británicos tratarán de destruirte. Para que tu búsqueda y persecución sea un reto constante, los barcos enemigos cambian de posición mientras recargas el combustible. \n \nHay 7 niveles de dificultad que van desde FACIL a CASI IMPOSIBLE. Al principio, la pantalla te mostrará un mapa del Atlántico Sur para que localkices el objetivo, pulsando \"S=SEARCH\" la pantalla te mostrará el área local donde se encuentra el navío enemigo. Cuando estés en el área de fuego, la pantalla te mostrará el objetivo que ha sido destruido (si le has alcanzado), así como tus propios daños.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/q9e1nstxanf6okmclpnd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39096,"name":"Crafton et Xunk","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39094,"name":"Megachess","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"A Spanish language chess game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ijklqruz8qpzxirhmdp5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39092,"name":"Suspended: A Cryogenic Nightmare","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39086,"name":"Caverns of the Death","genres":[],"avg_score":0.0,"description":"Juego MALISIMO e INJUGABLE","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/tayuhbrqw0xxoolera6w.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39076,"name":"Bivouac","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39075,"name":"Fire & Forget II","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A German turn-based trading simulator.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mrwtfoj65cljm8axiyrp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39074,"name":"American Tag Team Wrestling","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39069,"name":"Infernal Runner","genres":[],"avg_score":0.0,"description":"Infernal Runner is a platform computer game released in 1985. It is one of the first works of game designer Eric Chahi.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/rtid10ylw2eofuz3mfwi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":39050,"name":"L'Affaire Santa Fe","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38998,"name":"Red Sparrow","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Red Sparrow - is the first original FTG game. It's a game with traditional arcade game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38949,"name":"Booper, Get Home!","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"As a kid with autism, speaking doesn’t come easily – especially when you’re lost and looking to find your way home. Booper Get Home! is a 2D puzzle platformer (with some RPG elements) in a 3D world in active development for VR, with art assets created by a 6 year old on the spectrum.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3mhi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38937,"name":"Skateboard Party 2","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Skateboard Party 2 brings all the fun of skateboarding to your mobile device allowing you to ride in 8 completely unique locations. Jump on your board, learn new moves and improve your skateboarding skills to land sick combos. \n \nPlay with your friends using the new online multiplayer mode or challenge skaters from all over the world using the online leaderboards. Complete achievements, gain experience and upgrade your favorite skater. You can also customize your outfits, boards, trucks and wheels with real brands. \n \nHIGH DEFINITION \nSkateboard Party 2 includes next generation 3D graphics specially optimized for your mobile hardware to provide you with the best skateboarding experience. \n \nCAREER MODE \nComplete over 40 achievements to unlock new items and locations. Gain experience to upgrade your favorite skater’s attributes to perform better and achieve higher scores. \n \nFREE SKATE \nPractice and improve your skateboarding skills without any time constraints. \n \nONLINE MULTIPLAYER \nChallenge your friends to a skateboard battle and let’s see who can land the baddest tricks! Share and brag your results with your friends on Twitter. \n \nMASSIVE SELECTION \nSelect between 9 characters and customize each of them to your preference choosing your favorite gear. A massive collection of boards, trucks and wheels are available including items from Powell & Peralta, Bones, Golden Dragon and Tork Trux. \n \nLEARN TO SKATE \nOver 40 unique tricks to master and hundreds of combinations. Follow the tutorial to get started and progress as you go. Execute the craziest combos and trick sequences to rack up some impressive high scores, gain experience and make a name for yourself. \n \nGAME CONTROLLER \nCompatible with most game controllers available. \n \nCUSTOMIZABLE CONTROLS \nNew fully customizable control system to configure your own button layout. Use the right or left handed control mode, select a control preset or create your own. Use the analog stick or accelerometer option as you wish. Adjust your truck tightness to change your steering sensitivity. \n \nLOADED WITH FEATURES \n•Supports all the latest generation devices and optimized for high resolution displays. \n•Online multiplayer mode to play against your friends or other skaters online. \n•New fully customizable control system. You can adjust everything! \n•Learn over 40 unique tricks and create hundreds of combinations. \n•Massive skateboard locations to ride including a trailer park, army base, shopping mall, ski resort, campus, funfair beach and a big open city. \n•Customize your skater or board with tons of exclusive content including outfits, boards, trucks and wheels from licensed brands. \n•Play often to gain experience and upgrade your skater’s attributes. \n•Share your results with your friends on Twitter. \n•Extended Soundtrack featuring songs from Voice of Addiction, Sink Alaska, Beta, Hitplay!, Moovalya, We Outspoken and Melodic in Fusion. \n•Ability to purchase experience points using in-app purchases. \n•Available in the following languages: English, French, German, Italian, Spanish, Russian, Japanese, Korean, Portuguese and Chinese","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pwliknsq5qggu4tcrwlg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38936,"name":"Skateboard Party 3","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Skateboard Party is back! This third edition of the popular sports franchise features professional skater Greg Lutzka. Skateboard Party 3 brings the thrill of skateboarding to your mobile device! Hop on your board, learn new tricks and improve your skills in 8 completely unique locations. \n \nPlay with your friends using the online multiplayer mode or challenge skaters from all over the world on the leaderboards. Complete over 70 level objectives and achievements, gain experience and upgrade your favorite skater with the coolest gear. Customize your outfits, shoes, boards, trucks and wheels with licensed brands. \n \nCAREER MODE \nComplete over 70 achievements and level objectives to unlock new items and locations. Gain experience to upgrade your favorite skater’s attributes to perform better and achieve higher scores. \n \nFREE SKATE \nPractice and improve your skateboarding skills without any time constraints. \n \nMULTIPLAYER \nChallenge your friends to a skateboard battle and let’s see who can land the baddest tricks! Share and brag your results with your friends on Twitter. \n \nMASSIVE SELECTION \nSelect between 16 skaters and customize each of them to your preference choosing your favorite gear. A massive collection of outfits, shoes, boards, trucks and wheels are available including items from Osiris, Onnit, Nectar, Jammypack, FKD Bearings and Darkstar. \n \nLEARN TO SKATE \nThere are over 40 unique tricks to master and hundreds of combinations. Follow the new interactive tutorial to get started and progress as you go. Execute the craziest combos and trick sequences to rack up some impressive high scores, gain experience and make a name for yourself. \n \nGAME CONTROLLER \nCompatible with most game controllers available. \n \nNVIDIA SHIELD SUPPORT \nOptimized for NVIDIA SHIELD with 1080 support, Anti-aliasing, Bloom, HDR, and Custom Blur Shaders! \n \nCUSTOMIZABLE CONTROLS \nNew fully customizable control system to configure your own button layout. Use the right or left handed control mode, select a control preset or create your own. Use the analog stick or accelerometer option as you wish. Adjust your truck tightness to change your steering sensitivity. \n \nLOADED WITH FEATURES \n•Audio Powered by Dolby \n•Supports all the latest generation devices and optimized for high resolution displays. \n•Online multiplayer mode to play against your friends or other skaters online. \n•New fully customizable control system. You can adjust everything! \n•Learn over 40 unique tricks and create hundreds of combinations. \n•Massive skateboard locations to ride including the OC Ramps Skatepark, Venice Beach, Chinatown, San Francisco, Moscow, a Nature Museum, drainage ditch and Medieval Plaza featuring a mega ramp. \n•Customize your skater or board with tons of exclusive content including outfits, shoes, boards, trucks and wheels from licensed brands. \n•Play often to gain experience and upgrade your skater’s attributes. Complete all level objectives for Greg to reach maximum potential. \n•Share your results with your friends on Twitter. \n•Extended soundtrack featuring songs from Chaos Delivery Machine, We Outspoken, Voice of Addiction, Templeton Pek, Sink Alaska, Pear, Closer and Melodic in Fusion. \n•Ability to purchase experience points or special items using in-app purchases. \n•Available in the following languages: English, French, German, Italian, Spanish, Russian, Japanese, Korean, Portuguese and Chinese.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38930,"name":"N.O.V.A. 3: Freedom Edition","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The most immersive and impressive sci-fi FPS franchise on smartphones is now completely free! Fight for humankind's survival! \n \nFour months after Kal Wardin defeated the Volterites, President Folsom is assassinated and the beleaguered colonies surrender to the Volterite Protectorate. \n \nSince then, Kal has been lying low, but a desperate plea from Yelena calls him back to save Earth and humankind… \n \n• An epic storyline: Humanity finally returns to Earth after years of exile! Fight in 10 immersive levels across the galaxy, from a war-torn Earth to a frozen Volterite city. \n• Multiple weapons and powers: Run, shoot, drive vehicles, and pilot a mech to defeat hordes of enemies. \n• Join 12-player battles in 7 multiplayer modes (Capture the Point, Free-for-All, Capture the Flag, etc.) on 7 different maps. \n• For the first time, multiple allies can jump inside the same vehicle and spread destruction on the battlefield.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38919,"name":"Roundy","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In Roundy you have to keep the ball bouncing inside the circle until the timer expires. There are up to 15 levels to defeat (but you won't) and more are coming! \nThere are 9 balls to collect in the game, some of them have their own perks. You will be able to buy these balls with coins that you can earn throughout the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/gm4ipsqquiykajjcmu9e.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":38917,"name":"Dawn of the Immortals","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38910,"name":"Ruzzle Adventure","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Ruzzle Adventure is a word puzzle game released for iOS and Android.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/uya7p316gkkemgsh3lm7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38909,"name":"Pocket Mine","genres":[],"avg_score":0.0,"description":"A free-to-play mining game on mobile devices.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/drct63f0oygzgzmeio1z.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38906,"name":"CastleVille Legends","genres":[],"avg_score":0.0,"description":"CastleVille Legends is a strategy game in which the player is immersed in a magical and mythical world that is inhabited by Woodsmen, Wizards and Dragons. The player's goal is to make the realm flourish, trade with other players, rescue heroes and visit magical nearby places.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38902,"name":"Rift Mobile","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38894,"name":"Gangster Granny","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38891,"name":"Trade Nations","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38885,"name":"Village Life: Love & Babies","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38881,"name":"Dark Guardians","genres":[],"avg_score":0.0,"description":"From the graphic designer of \"LUMI\" selected by Apple for the \"app of the week\", Dark Guardians is the most epic adventure game on the App Store. \nBetween a runner game and a rhythm game, Dark Guardians awakens all your senses. \nFight monsters of darkness and travel across fantastic and mystical landscapes. \nGame Features: \n-Tons of beautiful Environments \n-Outstanding music by Valentin Lafort \n-Upgrade your Hero \n-Summon the legendary Dark Horse","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pfue1ypyb2tcgod8yvle.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38880,"name":"MapleStory Live","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"MapleStory (Korean: 메이플스토리 Revised: Meipeul Seutori?) is a free-to-play, 2D, side-scrolling massively multiplayer online role-playing game, developed by the South Korean company Wizet. Several versions of the game are available for specific countries or regions, and each is published by various companies such as Nexon. Although one may play the game for free, one can only purchase some character appearances and gameplay enhancements from the Cash Shop with real money\n\nIn the game, players travel the \"Maple World\", defeating monsters and developing their characters' skills and abilities as is typical in role-playing games. Players can interact with others in many ways, such as through chatting, trading and playing minigames. Groups of players can band together in parties to hunt monsters and share the rewards and can also collaborate forming guilds to interact more easily with each other.\n\nIn July 2010, the Korean version of the game was completely revised in a patch named the \"Big Bang\". Other versions followed suit and have since received the Big Bang update. Later in the year, the Korean version received the Chaos update which introduces PvP (player-versus-player) and professions to the game. Its sequel, MapleStory 2, was released in July 2015 and features updated 3D graphics and a similar storyline.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38879,"name":"Space Evader","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38878,"name":"Shipwrecked: Lost Island","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38871,"name":"GraalOnline Classic+","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38869,"name":"The Tribez & Castlez","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get ready for an unforgettable journey to the magic world of the Middle Ages! You will meet your old friends, Professor and Aurora, and help Prince Eric rebuild his kingdom and protect it from the evil plans of villains! Fight treacherous monsters, explore new territories, construct various buildings, search for the magical artefacts and play with your friends online!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38863,"name":"Morteville Manor","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Mortville Manor (French: Le Manoir de Mortevielle) is a point-and-click adventure game developed and published by Lankhor in 1987 on Atari ST. There were several adaptations, amongst other Amstrad CPC, Amiga, IBM PC compatibles. The game was released in French, English and German. Its speech synthesis was a first at the time. \n \nYou are Jérôme Lange, a famous private investigator, involved in the strange events of the Mortville Manor. The game can be solved extremely quickly if you are given the solution. After a French computer magazine published a walkthrough, allowing its readers to solve the game without even having understood the plot, an altered version was published and replaced the original. This new version was completely identical except that at a specific point in the adventure, the player had to correctly answer a series of questions about the game's plot to be allowed to continue further. \n \nThe game was written by Bernard Grelaud and Bruno Gourier, with illustrations by Dominique Sablons with Maria-Dolores. Music and voices were provided by Beatrice Langlois and Jean-Luc Langlois. \"Le Manoir de Morteveille\" was subsequently translated into English (Mick Andon) and German. A version for PC was released in 1988, adapted by Clement Roques. \n \nMortville Manor was followed by its sequel Maupiti Island, taking place on a tropical island.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38862,"name":"Facination","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fascination is a mature-themed adventure. The game is about a business man who has invented a chemical drug that increases the sex-drive. Unfortunately he was assasinated, and you accidentally get hold of the drug sample. Your mission is to try to deliver the sample to the right person and avoid being made out as the murderer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2s6a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38860,"name":"Wizkid","genres":[],"avg_score":0.0,"description":"Wizkid: The Story of Wizball II is a computer game for the Amiga, Atari ST and IBM PC computers, developed by Sensible Software and released by Ocean Software in 1992.[1] Wizkid is officially the sequel to the earlier game Wizball, developed and released by the same companies.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38840,"name":"Wendetta 2175","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38820,"name":"Shelly Duvall's It's A Bird's Life","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38813,"name":"The Last Tree","genres":[],"avg_score":0.0,"description":"A 2D pixel-like Metrovania game, exploring the game world with a unique atmosphere. In a mysterious and huge tree world, as time goes by, trees and plants have withered, the ecology has become worse, life has become scarce, and who will save the world that is about to break.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5n6h.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38785,"name":"Tactics Forever","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Build your armada of physics-based spaceships and watch them get destroyed by thousands of other players across 8 platforms.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/z4s40vyergwaowygx5fo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38718,"name":"Running Shadow - RPG Runner","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Running Shadow is a unique mix of a parkour game and a fantasy RPG. Simple game mechanics are enriched with a mythical plot full of secrets and intrigue. \nYou take on the role of a fortunate thief and assassin in possession of a unique artifact: the Gauntlet of the Celestial Guardian stolen from the adepts of a dark and ancient cult. Like in classic RPG games, you will be empowered with wondrous and unique abilities. Get ready for a never-ending adventure full of danger: age-old castles, gloomy dungeons and treacherous enemy ambushes, dozens of exciting levels and unique quests. You will need all your experience from running games and all your extreme parkour skills to win. Embark on the path full of danger and win the title of Master Shadow! \n \nKey Features: \n \n✔ Intriguing locations in the best traditions of fantasy games: noblemen’s castles, bandit layers, sewers, town prison, and many others \n✔ With more than 20 unique characters, including a majestic draconid, an elf and a goblin, the game will keep you playing for hours on end. \n✔ More than 8 outfits for the main hero, including swords, armor, and masks \n✔ Unique battle system: you fight regular foes with sword, and subdue Nephilims with magic. Can check for yourself this is not your average run and gun game. \n✔ Secret elven tricks to learn to overcome obstacles \n✔ Special magic abilities to let your character become a shadow, restore his mana, replenish his health and increase his rage while fighting enemies. And, of course, the powerful Gauntlet may as well prove indispensable in battles. \n✔ 300 collectible items to be gathered while passing your quests \n \n✔This game works in offline mode without Internet – play it on the plane, in subway or on the road. Enjoy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38703,"name":"Prism 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38701,"name":"Retro Defense","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38700,"name":"Robo Defense","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A popular tower defense game for the Android platform.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co695a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38699,"name":"Squibble","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/veddvxeaazsv1g8zfm4y.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38698,"name":"TurboFly 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38696,"name":"Blazing Bajirao","genres":[],"avg_score":0.0,"description":"Are you prepared for the ultimate battle experience? \nHere’s your chance to be the Peshwa Warrior himself. After the epic motion graphic web series, Eros Now presents ‘Blazing Bajirao –The Game’.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38691,"name":"Eternal Arena","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38690,"name":"Zenonia S: Rifts in Time","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62ah.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38688,"name":"Star Legends","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38685,"name":"Aby Escape Deluxe","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Enjoy Aby Escape at its full potential! \nAby Escape Deluxe offers you more than 20.000 coins of unlocked content: \n \n- Get instant access to all the story mode level! \n- Change your character with Trump, Sheepard, Suggy, Kastor and Ycell! \n- Keep running further with all power-ups included in the first level: Magnet, Health Ghost Boost and Agility! \n- Enjoy the multiple environments of the game: Winter Rush, GreenStone, Dunderville and the famous Route 66,5! \n \nRun Aby! Ruuuun! \n \nAby Escape is a free race game operating completely in 3D and offering varied gameplay, which will require you to be as quick as you can. Help Aby, the unluckiest and clumsiest raccoon, in his mad race to escape from his assailants. Whether being pursued by the hunters in his native forest, by the police in town or by the bikers on Route 66.5, Aby never stops running to escape from all these dangers. \n \nTake a look far ahead and make your way through the 2 game modes: \n \nUNLIMITED MODE \nAby Escape offers an unlimited game mode devoted specifically to scoring. Slide, jump and accelerate to dodge all the obstacles in your path! Collect coins and unlock loads of power-ups. Achieve the best score you can and complete 50 exclusive challenges. \n \nSTORY MODE \nIn Aby Escape, progress through the 30 levels of the game, split across 3 different universes, and take on every kind of obstacle and unique situation: a catapult, an American football stadium, elephants, trucks, and a cemetery, just to name a few. Get an overview of the next update by completing Story mode. \n \nFeatures : \n \n-50 challenges to take on in Unlimited mode \n-30 game levels in Story mode \n-Lots of enemies to shake off or avoid (hunters, policemen, bikers, footballers, elephants, etc.) \n-Lots of power-ups available (Ghost, Magnet, Extra life, Shield, etc.) \n-Objects to unlock (characters, shoes, etc.) \n \nBut watch out and don’t get hit in the face by a tree, elephant or American footballer! \n \nDiscover the free Aby Escape game available now!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38682,"name":"Mini Motor Racing WRT","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38676,"name":"Ace of Arenas","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fight together with friends, creating a formidable team to dominate your rivals and annihilate their base! Level up and strengthen your Champions to tactically decimate enemy players, turrets and ultimately, the Core of their base in furiously paced head-to-head multiplayer battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/d4ncq3h2g3e71tesiuuu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38674,"name":"Retimo Adventure","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38671,"name":"Action Potato","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38669,"name":"Everland","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2q3v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38667,"name":"MX Moto","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38666,"name":"Nintaii","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38665,"name":"Pocket Racing","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38660,"name":"Haunted Legends: The Stone Guest","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":38655,"name":"Mr.Do!","genres":[],"avg_score":0.0,"description":"The object of Mr. Do! is to score as many points as possible by digging tunnels through the ground and collecting cherries. The title character, Mr. Do (a circus clown—except for the original Japanese version of the game, in which he is a snowman), is constantly chased by red monsters resembling small dinosaurs, and the player loses a life if Mr. Do is caught by one. The game is over when the last life is lost. \n \nCherries are distributed throughout the level in groups of eight. 500 bonus points are awarded if Mr. Do collects eight cherries in a row without stopping. A level is complete when all cherries are removed, all monsters are destroyed, \"EXTRA\" is spelled, or a diamond is found. \n \nMr. Do can defeat the monsters by hitting them with his bouncing \"power ball\" or by dropping large apples on them. While the power ball is bouncing toward a monster, Mr. Do is defenseless. If the ball bounces into an area where there are no monsters to hit (such as behind a fallen apple), Mr. Do cannot use it again until he has retrieved it. When the power ball hits a monster, it then reforms in Mr. Do's hands after a delay that increases with each use. \n \nMr. Do or the red monsters can push an apple off the edge of a vertical tunnel and crush one or more monsters. If an apple falls more than its own height, it breaks and disappears. Mr. Do can also be crushed by a falling apple causing a loss of life.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xlr1oc57fk0kuxqfccea.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38613,"name":"Chewing Gum","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Chewing Gum is a casino game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38581,"name":"Moon Alien Part II","genres":[],"avg_score":0.0,"description":"A very obscure Galaxian clone with energy bar timer.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38577,"name":"Mayday","genres":[],"avg_score":0.0,"description":"The game itself is not a direct copy of Defender. It has an 8-Way joystick, two fire buttons (forward and backwards) and a Mayday button. The Mayday button slows everything on-screen down for a few seconds and makes the screen flash. Although it only scrolls from right to left, you can speed up and slow down your ship's forward momentum. The first wave that is over the sea of submarines. The submarines, which look a lot like Baiters in Defender, shoot along the bottom of the screen and fire up at the player's ship. The player's shots are aimed diagonally down at the waves. The second wave is flying through a cavern with swarms of aliens flying and bouncing from right to left towards the player. Unlike Defender, you can crash into the cavern walls. The third wave is set over a gently rolling planet surface. Later waves follow a similar pattern.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38572,"name":"Invader's Revenge","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A strange Space Invaders knock-off, a kind of missing link between the original and Galaxian.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/nrhblwansj5vi1mlmlgw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38564,"name":"Rescue Raider","genres":[],"avg_score":0.0,"description":"You pilot an armed vehicle that is trying to gather secret plans. These plans will reveal what an area of your map is hiding. You can also take hostages, gather fuel and better weapons. You seem to have unlimited lives but limited fuel. If you run out of fuel you can by more with a quarter.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/rjsotgucfoi6ycjecdml.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38415,"name":"Universal Soldier","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Universal Soldier is a cancelled video game based on the 1992 movie starring Jean-Claude Van Damme. You control Van Damme's character, Luc Deveraux, as he turns against his platoon and attempts to bring down the corrupt government organization that created him.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co40e4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":38364,"name":"Jelly Boy 2","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Smart Ball 2 is an action game, developed by Game Freak and published by Sony Music Entertainment, which was cancelled before it was released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2uwn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Famicom"}]},{"id":38300,"name":"Steven Seagal Is The Final Option","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Steven Seagal is a legendary runner, but commanders dislike his loose style and contempt for rules. His partner Jack Fremen, was killed on their last mission. There is no evidence to support it, but many wonder if he might still be alive had Seagal followed orders.\n\nTrish Morgan, another veteran runner, has been assigned his new partner. She's tough as any but has the attitude that commanders look for.\n\nNow, the rebels will attempt the ultimate mission: an assault on Nanotech's main campus. High command nervous about Seagal. They know he's out to avenge Freman's death. But he's the best chance they have.\n\nHe's the only choice...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yt4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"},{"id":0,"name":"Sega Mega Drive/Genesis"}]},{"id":38289,"name":"Congo the Movie: The Secret of Zinj","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Congo: The Secret of Zinj is an unreleased Super NES game based on the hit 1995 movie. The game was cancelled after a short development turnover and play tests indicating that the game was not good enough for release. Also contributing was the fact that the movie was a bit of a flop.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co49ve.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":38266,"name":"Chrono Trigger: Crimson Echoes","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Chrono Trigger: Crimson Echoes is a fangame developed by the international team Kajar Laboratories as a ROM hack of Square's role-playing video game Chrono Trigger for the Super Nintendo Entertainment System. It was conceived as an unofficial installment in the Chrono series, set between the events of Chrono Trigger and its sequel Chrono Cross.\n\nIt was originally set for release on May 31st, 2009. However, on May 8th, 2009, Square Enix sent out a cease and desist letter to Chrono Compedium.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2u2d.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":38200,"name":"Futbol Colombiano 96","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38187,"name":"Futbol Argentino 96","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"This game was successful in Argentina, Brazil, Colombia and Peru, generating many unlicensed ROM hacks distributed on pirate cartridges using ISS Deluxe as a base. The game was altered so it would match Brazilian teams instead of world national teams. All players names, shirts and powers were altered. The first game was \"Campeonato Brasileiro 96\". After that, each year a new version with updated players status and teams was released. In 1997, the name changed to Ronaldinho Soccer 97. There was also a version of the Argentinian championship called \"Fútbol Argentino 96\", the Colombian version of \"Fútbol Colombiano 96\" and Peru \"Fútbol Peruano 97\". These hacks also replaced the American English commentary with Spanish and Portuñol.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6s7x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38177,"name":"Battle Racers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38116,"name":"Zig Zag Cat","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38115,"name":"Zig Zag Cat","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38100,"name":"Blodia","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Puzzle games. Don't you just love 'em? Classics like Tetris, Puzzle Bobble, Klax....and then there's Blodia. The concept behind Blodia is very simple: 1-You have a screen of pipe-work. 2-There is a ball travelling down the pipe. 3-If the ball drops down a gap in the pipe you have to start again. That's it. So what this all amounts to is you frantically sliding the tiles around block-puzzle style to keep that cursed ball bearing on track. God forbid that you think the ball is moving too slowly, you can even push a button to speed the damn thing up, but you have to wonder why you would ever want to do that. \n \n(from the PC Engine Software Bible)","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/mbbttfxqosfm9uwaoddj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38094,"name":"Gomola Speed","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38091,"name":"Alice in Wonderdream","genres":[],"avg_score":0.0,"description":"Obviously based on Alice in Wonderland, Fushigi no Yume no Alice is a cute and colourful platform romp. You adventure through forests, caves, castles and such, defeating the many enemies by letting out a loud scream that shoots across the screen. The scream can be powered up by holding down the button, but leave it too long and you'll get out of breath and stand there panting, defenseless for a few moments. Aside from your voice, you can also jump on enemies to dispatch them. As you progress through the stages (each with a boss at the end of course) you also gain magic powers in the form of books. By pushing RUN then selecting your power with BUTTON I, you get the chance to do such things as show hidden power-ups and become invincible for a short time.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38063,"name":"Heroes and Castles","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38062,"name":"Heroes and Castles","genres":[],"avg_score":0.0,"description":"Heroes and Castles is a third person action role-playing game from Foursaken Media.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ijfyytwvugiky2v499es.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38061,"name":"Heroes and Castles 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38054,"name":"Dizzy: Prince of the Yolk Folk","genres":[],"avg_score":0.0,"description":"Dizzy Prince of the Yolkfolk is an adventure video game published in December 1991 by Codemasters for the Amstrad CPC, Atari ST, Commodore 64, ZX Spectrum, DOS, NES and Amiga. It was the sixth game in the Dizzy adventure series","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/sapwbug3bpwdmbc3ihog.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38051,"name":"Franco Baresi World Cup Kick Off","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38049,"name":"Skate of the Art","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Skate of the Art is a skateboarding game that is based on the Commodore 64 game Rollerboard. The two game have almost identical gameplay but have different level designs. The Amiga game also features completely remade graphics. The game is side scrolling and the player's task in each level is to get to the finishing line without crashing on the obstacles that lies in his path. When starting out there are five skateboards available and for every crash one is lost. When all out of skateboards the game will end. All action is controlled with the joystick. Pressing the button increases the speed while pulling the stick in different directions causes the skater to jump, brake or to climb. By combining button presses and stick pulling the player can also make various tricks such as normal and double flips.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38046,"name":"Leashed Soul - Survive & Rebuild Beydo Block World","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":38030,"name":"Phantomers Insurreccion","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Phantomers is a cancelled free multiplayer online shooter. Closed beta began in 2015, ultimately leading to its full cancellation.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1nj0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":37885,"name":"ShadowHawk","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"A WHOLE NEW ERA BEGINS HERE! When Eddie Collins and his father moved to New York, Eddie was given a mystical helmet and became the last in a line of legendary heroes dating back to Ancient Egypt. But does even ShadowHawk have the power to stop the man called BackLight? Even if he does, a new mystery waits in the wings as a mysterious talker attempts to uncover ShadowHawk's secret identity. Based on Jim Valentino's hit comic book series!\n\nScheduled to hit the Super Nintendo sometime during the 90s, the game struggled to find a publisher and ended up canceled. It was leaked onto the internet in 2016.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2wb2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":37870,"name":"Rap Basketball","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Rap Basketball is a Sports game, developed by Bonsai Entertainment Corp. and published by Eware, which was cancelled before it was released.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67fh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":37765,"name":"World Class Service Super Nintendo Tester","genres":[],"avg_score":0.0,"description":"This is a rare box used by World Class Service and repair centers to test Super Nintendo systems. It plugs into the cart slot and has cables to both controller ports and the video port. When powered up the software in the tester checks video signals, clock timing, internal memory, and controller data. After that it runs a series of tests like sprite mirroring, scaling, transparency, and music channels. The entire sequence runs about 2 minutes. \n \n \nThe box itself has Super Famicom labelled on top, but works in a USA NTSC Super Nintendo system. There is a button to select which video output to check (RGB, S, VIDEO) and a button to test which clock to check (CIC, SYS, 21M). The clock output goes to an RCA socket which would most likely connect to something like an oscilloscope. There are also buttons for BACK and NEXT. The NEXT button is used during the video test when prompted. The colors of the case are much closer to the NES than the SNES. Gray bottom is slightly lighter, tan top is slightly darker. Overall this one is in very good condition with no visible damage and no yellowing. The board inside is labelled as SNS-TEST A-01 1991.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37749,"name":"Zaitaku Touhyou System: Spat4-Wide","genres":[],"avg_score":0.0,"description":"This cart was used to bet on horse racing, using a NTT modem. The cart isn't really emulated at this point, and the logo capture above is likely not using the correct palette. These horse betting carts came in a black shell.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37728,"name":"Terra Cresta II","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37644,"name":"5-in-1 Fami Collection: NES Collection Nr 1","genres":[],"avg_score":0.0,"description":"5-in-1 Fami Collection: NES Collection Nr 1 is an unlicensed multicart released for the PC Engine/TurboGrafx-16 in 1993. It contains five NES ports.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6o7f.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"TurboGrafx-16/PC Engine"}]},{"id":37642,"name":"6-in-1 Fami Collection: NES Collection Nr 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"TurboGrafx-16/PC Engine"}]},{"id":37640,"name":"Xanadu II","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Falcom has pretty much established themselves as one of the finest RPG makers in the business, and Xanadu II - an offshoot of the Legend of Heroes series shows exactly why. The sequel to the first popular Xanadu game, Xanadu II is also an action RPG. This game retains the simple Ys inspired walk-into-the-enemy attack style which works very well and also the side-on action scenes used for boss battles. Being untranslated, the story is a little hard to plot out, but you play Arios and start out aboard a ship in search of your friend, whose own ship (as shown in the intro) was attacked by dragon riders. Eventually you get blown overboard in a vicious storm and end up on a beach near the city of Razan...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37637,"name":"Cyber City Oedo 808: Attribute of the Beast","genres":[],"avg_score":0.0,"description":"Cyber City Oedo 808: Attribute of the Beast (CYBER CITY OEDO 808 獣の属性 Saibāshiti Ōedo Hachimaruhachi: Kemono no Zokusei?) is a graphic adventure game released on March 15, 1991 for the PC-Engine CD-ROM² by Nippon Computer System exclusively in Japan. The storyline is completely original and not an adaptation of any episode.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37632,"name":"Metal Angel II","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sci-fi life simulation in the style of Graduation.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hgbduxkeayqlccfynbq3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37630,"name":"Ranma 1/2","genres":[],"avg_score":0.0,"description":"This is a puzzle game in which players play as Ranma and to complete each level he must push blocks to collect items, avoid his rivals, and save Akane.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37626,"name":"Shin Nippon Pro Wrestling '94: Battlefield in Tokyo Dome","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"A port of the Super Famicom hit, featuring higher quality music, G1 tournament, and bloodshed.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7duq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Turbografx-16/PC Engine CD"}]},{"id":37620,"name":"Strider Hiryuu","genres":[],"avg_score":0.0,"description":"Strider, released in Japan as Strider Hiryū (ストライダー飛竜?) is a 1989 side-scrolling platform game released for the CP System arcade hardware by Capcom. It became one of Capcom's early hits before Street Fighter II, revered for its innovative gameplay and multilingual voice clips during cutscenes (presented in English, Japanese, Mandarin, Russian and Spanish).\n\nStrider is set in a dystopian future in the year 2048, where a mysterious dictator known as the \"Grandmaster\" rules over the world. Hiryu, the youngest ever Super A Ranked[2] member of a organization of high-tech ninja-like agents known as the \"Striders\", is alone tasked with the Grandmaster's assassination. Hiryu begins his mission by infiltrating the Grandmaster's capital at the Kazakh Soviet Socialist Republic.\n\nNEC Avenue produced a PC Engine version of Strider Hiryu, which was released exclusively in Japan on September 22, 1994. The PC Engine version was released as a CD-ROM² title which requires the Arcade Card expansion. The PC Engine port features an all-new desert stage that was not in the arcade version, as well as newly recorded cut-scenes, music and dialogue, with Japanese voice actor Kaneto Shiozawa as the voice of Hiryu and Kōji Totani as the Grand Master. The PC Engine version is notable for its long development process, having been planned in various formats, including the ill-fated SuperGrafx at one point","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2kug.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37619,"name":"Motoroader MC","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37609,"name":"Super Air Zonk","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Super Air Zonk is an Action game, developed by Dual and published by Hudson, which was released in Japan in 1993.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37602,"name":"4 In 1 Super CD","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This compilation disc was packed in with the TurboDuo in North America, giving buyers easy access to Bonk's Adventure, Bonk's Revenge, Bomberman, and Gate of Thunder. Despite appearing to contain only three games, Bomberman can be accessed by pressing Up, Right, Down, Left, II at the game select menu.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2ix8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Turbografx-16/PC Engine CD"}]},{"id":37587,"name":"Choujikuu Yousai Macross 2036","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Choosing to move on with a new story rather than that of the Macross anime, the creators of Macross 2036 brought in the original character designer, Haruhiko Mikimoto, for this horizontal shoot 'em up. The game features extensive anime sequences between levels to recreate the feeling of the show, and these are well drawn although quite heavy in dialogue. The gameplay itself is nothing new - you have a primary weapon and optional secondary weapon that is extra powerful, and you have to mow down the Zentradi forces in your Valkyrie (which only gets to transform at specific points). Power-up pods increase your firepower a little each time, while hidden Minmay heads give extra lives.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37581,"name":"Iga Ninden Gaiou","genres":[],"avg_score":0.0,"description":"A Ninja Gaiden-esque action adventure","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37546,"name":"Fire Emblem: Dream of Five","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The story follows a young promising Aukeman officer, Renair. Her job is to protect the border from bandits who attack civilians. Whilst doing her job, she finds herself fleeing the country, getting deeper into a plot that threatens the entire continent they live on, Kalias.\n\nThe project was declared cancelled in 2016 with 14 chapters (both routes).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co49uv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":37539,"name":"Spike Goes Skiing","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Public Domain game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37464,"name":"Tane Wo Maku Tori","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37424,"name":"MX Bikes","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"MX Bikes is a realistic motocross simulator, based on a scratch built physics engine that accurately simulates motorcycle dynamics and setup options.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2qrb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37411,"name":"ElectriX: Electro Mechanic Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"ElectriX: Electro Mechanic Simulator - a simulation game of electronic equipment repair with a dark conspiracy twist. In the game we'll be able to fix modern and retro electronic devices like: consoles, computers, mobile phones and other electronic equipment. During our casual work we will be involved in the dark conspiracy intrigue and only our skills and knowledge will help us. Come to ElectriX to fix some electro stuff!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co23za.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":37378,"name":"Project Battle","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Project Battle - A game about fighting other characters to earn XP and Coins. Use these coins to buy power ups, potions and spells, skills and new characters with new attacks.     \n     \nProject Battle was made by taking ideas from Pokemon and Undertale's battle mechanics, to create a fun time-waster.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/lvy8yen6q6amse7e9hf3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":37338,"name":"Honey Dolls","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37337,"name":"Hyper Pacman","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37331,"name":"Namco classics volume 1","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Namco Classic Collection Volume 1(ナムコクラシックコレクション) is a compilation arcade game that was released by Namco in November 1995. It is a collection of three popular Namco arcade games - Galaga (1981), Xevious (1982) and Mappy (1983). In addition to the original games, there are \"Arrangement\" versions that are essentially sequels to the original games, with updated graphics and sound. Super Xevious (1984) can be selected from the \"Xevious\" menu.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37328,"name":"Namco classics volume 2","genres":[],"avg_score":0.0,"description":"Namco Classic Collection Volume 2 (ナムコクラシックコレクション Namuko Kurashikku Korekushon Tsū) is a compilation arcade game that was released by Namco in 1996. It is a collection of three popular Namco games - Pac-Man (1980), Rally-X (1980) and Dig Dug (1982). In addition to the original games, there are \"Arrangement\" versions that include 2-player simultaneous play, additional enemies, updated graphics and music. Rally-X Arrangement did have 1-player only, unlike all other \"Arrangements\". In addition the game New Rally-X (1981) is selectable as well. Pac-Man Arrangement is the most notable of the \"Arrangement\" games.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37323,"name":"Name that tune","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Music","games":null},{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Name That Tune was produced by Bally Sente in 1986.\n\nBally Sente released 23 different machines in our database under this trade name, starting in 1984.\n\nOther machines made by Bally Sente during the time period Name That Tune was produced include Spiker, Stompin', Moon Quake, Night Stocker, Shrike Avenger, Team Hat Trick, Toggle, Mini Golf, Mini Golf Deluxe, and Street Football.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/gjuhkkbnwd8tn3ec6zv0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37301,"name":"Puzzle of Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"New way of learning words by having fun\n-Lots of puzzle images\n-Many language options\n-Different game styles\n-Learn how the words are pronounciated\n-Learn how the words are written\n-Puzzle package store\n-Race with your friends on the scoreboard","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/fvilvsazb1doxzclv7g7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":37284,"name":"Tie-Break","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37274,"name":"ThunderCats","genres":[],"avg_score":0.0,"description":"Thundercats is a side-scrolling action-platformer based on the toy and cartoon franchise of the same name.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/cghw6v06drzkkzsh2pea.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37268,"name":"Maniax","genres":[],"avg_score":0.0,"description":"Maniax is an Amiga tron arcade game released in 1989 by Kingsoft.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37264,"name":"Ranx Xerox","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37263,"name":"P47 - The Freedom Fighter","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"P-47 Freedom Fighter is a side scrolling, single-player, keyboard controlled shooter where the player flies the P-47 against waves of planes and ground based installations. It is a freeware game inspired by the arcade game P47 Thunderbolt.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37262,"name":"Famous Five Adventure","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Famous Five: Five on a Treasure Island is an Amiga graphics/text adventure game released in 1991 by Enigma Variations.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37244,"name":"Push Over","genres":[],"avg_score":0.0,"description":"This is duplicate. \n \nRedirect to original: https://www.igdb.com/games/pushover","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37239,"name":"BSS Jane Seymour","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37226,"name":"Slopestyle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37217,"name":"F17 Challenge","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37216,"name":"Fighter Duel Pro 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37192,"name":"When you're gone","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"When You're Gone is about Sam and Emma, how they meet, fall in love and fall apart. We follow Sam as he relives his past by invading the mind of his younger self. \n \nYou will help Sam fight his insecurities and emotions in turn-based combat. With the help of some peculiar allies, you push and shove your way forward to find the point where it all went wrong.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1kk8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":37181,"name":"Kangoorun: Fly to the Moon","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Will a kangaroo be able to build a space rocket and fly to the moon?   \n   \nKANGOORUN!   \nWelcome to Kangoorun the best free runner with a kangaroo! Kangoorun is an adventurous side-scroller with beautiful graphics!   \n   \nOUTRUN!   \nControl kangaroo and outrun the little aborigine Abo! He is always ahead of you and takes the most interesting!   \n   \nOUTSTANDING MECHANICS!   \nIts really cool to control such responsive characters! Just try all those mind-blowing jumps, catch a PELICAN and fly over jungles or ride a RHINO and turn into a smashing machine! And all of these with just ONE FINGER!   \n   \nSPEED!   \nEach second you run faster and faster! What is the highest speed in Kangoorun? We dont know either!   \n   \nMAKE GEOGRAPHICAL DISCOVERIES!   \nDream of becoming a pioneer? Explore the island and discover new locations! Forests, fields, deserts, caves, volcanoes and much more are waiting for you on the island!   \n   \nBUILD A SPACE ROCKET AND GO TO THE MOON!   \nParts of a space rocket are scattered around the island. Find them and send a lunar mission to find out if our planet is as beautiful from the space as they say!   \n   \nSUPERPOWER AMULET!   \nKangaroo has a cool SUPERPOWER AMULET! Earn SUPERPOWER GEMS, upgrade them and equip your amulet with them!   \n   \nKANGOBALL!   \nDuring your adventures on the island, you will catch flying balls for sure! Throw them into a basket and earn coins and gems!   \n   \nPLAY WITH FRIENDS!   \nChallenge your friends and earn their gems!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/g2sjrxb82jfb8wihs4hg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37122,"name":"Life Stage, Virtual House","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37120,"name":"Gunslinger Collection","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37106,"name":"Donk","genres":[],"avg_score":0.0,"description":"Donk is an ordinary duck who benefits from having been raised by samurai warriors, who've taught him everything they know about combat psychologies, strategies and skills. To prove himself he has set off to collect crystals from 112 levels of earth.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37105,"name":"Emerald Mine II","genres":[],"avg_score":0.0,"description":"Emerald Mine II is an Boulder Dash variant and features no gameplay changes in comparison to its predecessor besides the new level editor. The player's goal is to collect diamonds which are surrounded by dirt. When walking over an dirt spot, it is cleared and an stone above it will fall down - with unhealthy results if the player or a monster is hit by it. Other items are dynamite to clear out boulders and keys for certain doors. \n \nThe need to plan ahead and find out the required steps to reach the diamonds give the game a puzzle-solving character. Besides the about hundred levels in single-player, there are additional levels for two players.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37098,"name":"Turrican III","genres":[],"avg_score":0.0,"description":"After many generations of peace, the Dark Forces have assembled again, and as a member of the USS Freedom Forces, it is your job to defeat them once again. This means you will have to complete numerous large levels always searching for secrets to pick up and enemies to shoot. To do this, you can pick up three different, upgradeable shots: a multiple, a laser and a rebound. You can also go into wheel-mode (as long as you have enough special energy) or use a rope. In wheel-mode, you are invincible and can lay mines or explore previously unreachable areas.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37090,"name":"Star Child","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"A VR action adventure from Playful.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4qbf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation VR"},{"id":0,"name":"PlayStation 4"}]},{"id":37042,"name":"Light Gravity Cube","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A game made for any type of audience, with a learning curve according to it, with moderate difficulty and simple gameplay. That's Light Gravity Cube, a labyrinth that you'll try to escape, can you do it?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":37009,"name":"CW: Chaco War","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Chaco War immerses players in the most important war experience in South America on 20th century. Players will have to make teams to survive the extremely distressing and tough battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3nze.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36997,"name":"Pure Farming 17","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36973,"name":"Vulture Strike","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Vulture Strike is a side-scrolling shooting game in which you have the ability to travel between 2 parallel timelines whenever you want.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3okq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36960,"name":"Super Nano Jumpers","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Super Nano Jumpers is a retro hard as nails platformer with tight control mechanics, This semi autorunner's controls are simple enough - tap the left side of the screen to halt, tap the right side to jump. With over 75 levels to play across 4 different worlds and 2 different Game modes(Arcade & Time trial) you need to survive these dark dungeons,unlock new characters and make it to the end.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36959,"name":"The Quest: Thor's Hammer","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Quest - Thor's Hammer is an expansion to The Quest, a beautifully hand-drawn open world role playing game with old school grid-based movement and turn based combat. \n \nThis expansion has been designed for low level characters. Best experienced with a newly created one. \n \nAfter enabling the expansion, you can explore new areas and adventures. However, if you don't have The Quest, you can also play the expansion as a standalone game. \n \nThrough the winter, Thor's Hammer reverberated in the heavens, bringing thunder, lightning, even dragons. Omens of evil were clear. By summer, fierce marauders from the North came in their longboats. Theft and destruction became the norm. They looted Holy Island's abbey. No one has dared resist them. They and everyone seem under a curse. \n \nHeroism is needed, so you were summoned. Is your sword arm still strong? You'll face Viking steel, giants, trolls and new diseases. Grab your weapon. Are you ready to board ship for Hell? \n \nTo access the new areas (not applicable if you are playing the expansion standalone), go to Matras harbor and talk to captain Verra, then select \"Thor's Hammer\" as your travel destination.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36953,"name":"Seed","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Seed was a sci-fi MMO that is considered to be the shortest lived MMO ever, lasting only 149 days.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/hkhukza2dqorks4zyf75.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36934,"name":"Omen: Flesh Metal & Magic","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Omen is an indie real-time strategy trading card game. This will be released as free to play game for PC. Alternative platforms are being considered.\n\nThis game is designed to accommodate the best mechanics of real-time strategy and trading card game. Giving the players the ability to level up cards while using the spells on a real time 3d board.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/sy2082xtwekqxjdwhbxr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":36927,"name":"Hazelnut Bastille","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Hazelnut Bastille is a top-down Metroidvania with mechanics, design and art-style rooted in the SNES classics of the early 90's.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3wv0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":36925,"name":"Outer Orbit Sushi","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36871,"name":"Destiny Chronicles","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Inspired by classic action JRPGs, Destiny Chronicles is an action role-playing game about a squire named Celeste who begins a journey to prove herself worthy of becoming a true knight. Her quest takes her far from her home, across the continent in pursuit of a thief whose actions stem from a sinister plot.  \n  \nIts character-driven plot focuses on the interactions between Celeste and her companions as they hunt down the thief. Our goal is to make the game lighthearted and humorous, yet still tell a compelling story.  \n  \nDestiny Chronicles features an exciting and fast-paced action combat system like that of Kingdom Hearts and Celeste’s fighting style can be customized to suit your playstyle with a talent tree and upgrade system.  \n  \nThe game is currently in the early development phase and we will be running a Kickstarter soon.\"","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/iyrdqyn2jrlu1cutgk8l.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36857,"name":"The Mummy: Prodigium Strike","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In the experience, players will take on the role of a Prodigium agent who has been tasked with locating and capturing the ancient Egyptian princess Ahmanet, a task complicated by the hordes of ravens, spiders and undead. Players will need to protect fellow agents as The Mummy increases in power. Like the movie it is based on, The Mummy: Prodigium Strike is set in Universal's 'Dark Universe' - a shared cinematic universe similar to Marvel's cinematic universe.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36835,"name":"City of the Dead","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The master auteur of horror takes his chilling tales of the Living Dead to a new form in this videogame based on his film series.\n\nThe game is set on the Island of Ningun Futuro (Spanish for No Future), located off the coast of North America. The island is home to a secret operation military base, whose primary role was to testing weapon effects on cadavers. When the dead begin to rise, Dr Rocane the head Pathologist, thinks it is Christmas.\n\nDue to financial difficulties at publisher Hip Interactive, this game fell off development and is not expected to be resurrected ... or become an undead videogame. While never announced, the game is expected to be completely cancelled.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xuq2abkvcnxa7pljmhyc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox"}]},{"id":36795,"name":"Super Doomed'n Damned","genres":[],"avg_score":0.0,"description":"Super Doomed'n Damned is a \"super version\" of Doomed'n Damned, released last year for PC and Mac. This enhanced version brings more content, revised level design, 2.5D art, more levels, enemies and bosses, but keeping the same 16 bit platformer arcade game atmosphere and challenging difficulty.\n\nYou control the prince Askan Eisen, the son of the kidnapped king of North Hollow, a land dominated by Murk, an ancient evil creature that came back from the darkness for revenge, and his Legion of Chaos. In order to bring back the peace and order, Askan must fight the legion, engage dark creatures, collect the Ancient Stones and defeat Murk once for all.\n\nThe game has many influences from classic platformer games, but adapted to the nowadays market. It is develop by Arc-gen games and co-developed by Dolores Entertainment.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36788,"name":"The Raft","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36786,"name":"Conner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36785,"name":"Dander","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36778,"name":"Hellgate: London VR","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36776,"name":"Smash Derby","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36772,"name":"Little Hawk","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36770,"name":"Elementerra","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36769,"name":"Project Crossfire","genres":[],"avg_score":0.0,"description":"Project Crossfire (Working Title) was a game in development by Starbreeze set in the Crossfire universe. The development was discontinued in 2019 as part of the reconstruction process of Starbreeze.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6pv8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36768,"name":"Project Golem","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36765,"name":"Airport Architect","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1scm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":36757,"name":"Breaking Bad: VR Experience","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co53mb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation VR"}]},{"id":36756,"name":"Mystereet F: The Detectives' Curtain Call","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A game combining a remake of detective visual novel Mystereet: Fukagyaku Sekai no Tantei Shinshi and the brand new sequel Mystereet 2: Farewell Encounter.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ru4ydvyakeop17xgisgn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36617,"name":"Dystoa","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Dystoa is as much a surreal, poetic, and minimalistic exploration game as it is an homage to the beauty of life and death and thoughts from one or another world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3wtt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":36609,"name":"Conan Exiles: Day One Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Conan Exiles is an open-world survival game set in the brutal lands of Conan the barbarian. Survive in a savage world, build your kingdom, and dominate your enemies in fierce combat and epic Warfare. Start with nothing but your bare hands and forge the legacy of your clan, building anything from a Small home to gigantic fortresses and entire cities. Wage war using swords, bows and siege weapons, and even take control of giant avatars of the Gods, laying waste to enemy cities. Explore a vast, seamless world full of challenge and opportunity. Hunt animals for resources, slay monsters for treasure, and delve deep underground to discover the secrets of ancient civilizations. Conan exiles can be experienced in both local single-player and in persistent online multiplayer. Day One Edition Includes Conan's Atlantean sword. The famous Atlantean sword was wielded by Conan in the original 1982 movie “Conan the barbarian” and has since become an iconic piece of weaponry. Wield the Atlantean sword and slay your enemies like a true Warrior King!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/xsnhr6iwuhzldt678eiu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36604,"name":"Dawn of Crafting","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36547,"name":"Panic!","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Panic! is a top-down action puzzler for PlayStation Mobile that requires quick thinking and fast reflexes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/aee3gfgqwy240m4yrhyp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36538,"name":"Six Days in Fallujah","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Six Days in Fallujah (SDiF) is an unreleased historical third-person shooter video game that was developed and left unreleased by Atomic Games. It's said that it was going to be the first game to focus directly on the Iraq War (which was still ongoing at the time). Konami was going to be the original distributor.\n\nThe premise of the game was the subject of controversy in 2009, with questions raised as to its appropriateness, especially given the fact that the true events the game is based upon was recent at the time. It was originally to be published by Konami, however, in April 2009, a spokesman informed the Associated Press that Konami was no longer publishing the game due to the controversy surrounding it. The game was originally slated for a 2010 release, but it was cancelled due to controversy; the game was put on hold until 2016 after its original studio, Atomic Games, went bankrupt in 2011.\n\nEventually the game would get picked up again in 2021 by Highwire Games and finally released under the same name by a different team and publisher.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6nov.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 3"}]},{"id":36487,"name":"Pencil Story - Free Logic Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"This is an interesting logic game where you should paint cells on a paper with a pencil to get to the exit.   \n   \nRules of this conundrum game are pretty simple:   \n1) pencil can go across cells which do not have the same color as the pencil;   \n2) you can change color of the pencil, to do that you should put it on a cell with a little pencil icon;   \n3) no turns are allowed within a single move - pencil can go only along a line.   \n   \nHave fun solving interesting puzzles and train your brain!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/dpxzeycurdoplanaclpp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":36471,"name":"Battle Commanders","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A competitive battle simulation game that brings the MOBA genre closer to its RTS roots by allowing you to take full control of the battlefield. Take part in an intense, fast-paced battlefield and seize victory on the mythical battlegrounds like Ergenekon, Avalon, Zerzura and more!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2pd0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":36415,"name":"Future Perfect","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Development Updates\n\nTo receive updates on Future Perfect's development progress, subscribe to the Dev Updates mailing list by clicking here.\nAbout the Game\nFuture Perfect breaks down the barrier between having an idea for a game, and playing it with friends. The Future Perfect interface allows you to create, play, and share multiplayer games quickly and easily.\n\nGames created with Future Perfect are published on Steam Workshop. You can browse, rate, and download games that interest you. Models, animations, textures, effects and other assets are also shared, so you can pick and choose the compents you want to create your game.\n\n\n\nFuture Perfect is in the early stages of development. It's not ready for Alpha, Beta, or Early Access.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":36334,"name":"The Last Crown: Blackenrock","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Last Crown: Blackenrock is the highly anticipated next installment in the spooky horror adventure series of 'Crown' games. In Blackenrock, you join ghost-hunters Nigel Danvers and Lucy Reubans on a spine chilling adventure, packed with authentic paranormal activity, to unravel tales of murder and mystery. Be warned, seeking answers from the dead can have bitter consequences.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/ci6yoxetulrbgvoqp1vp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":36227,"name":"Disney Princess: The Princess and The Frog","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Learn with Tiana for Leapster","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4kii.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Leapster"}]},{"id":35928,"name":"Refactor","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Refactor is a physics-based platformer taking elements from classic Metroidvanias. Placed in a world that is a puzzle itself, you can literally turn the world upside down by rearranging the map and building your own pathways through the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2m9x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":35807,"name":"Kitten Super Adventure","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Kitten Super Adventure is a game where you play as a kitten and explore 20 worlds, your mission is to collect the stolen catnip bags and bring them back to Cat Islands, only then can you save your kitten companions and stop the islands from sinking!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":35741,"name":"Bonetown: The Power of Death","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3sj5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":35335,"name":"Fazbear Nightmare","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The residents of Trillium County will know the feeling of an old wound.\nTime has passed and doors that seemed locked forever are opened once again and the timing couldn't be any worse.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co3zmd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":35085,"name":"Quasar","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Quasar is an online multiplayer top-down arena shooter. Reminiscent of old shoot'em up games updated with modern graphics using Unreal Engine 4, it blends fast action with high impact gameplay and visual intensity that will leave you wanting more. Quasar is quick to learn but tough to master.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/pvp9trbj7bsisi2dyjcr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":34760,"name":"The Last Sunshine","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Last Sunshine is a fast paced top down shooter inspired action game. Earn a variety of skills, then mix and match them with your customized stats to dispatch droves of dark aggressive enemies. Will light win against the darkness? It's the end of the universe!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co43ws.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":34736,"name":"Mutato Match","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Planets all over the galaxy are in need of creature re-population! Travel through systems in your rocket ship lab making Mutato species needed to save the planets. Grab a Mutato in each hand and bop them together to create unique offspring in this VR room scale experience for the HTC Vive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/sodqp7egjkkxpfkntc7a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Oculus Rift"},{"id":0,"name":"SteamVR"}]},{"id":34388,"name":"Sentou Gakuen: Revival","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You are one of the student of Sentou Gakuen, a random school in Japan, filled with delinquents, perverts, and of course some good students. How will you spend your days in Sentou Gakuen? Find your own path to choose, make friends or foes, the choice is yours.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8r54.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":34296,"name":"6","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A small game about climbing out of a horror dungeon filled with bad entities out to get you","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":34252,"name":"Antegods","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Antegods is an action-packed arena game in which the remnants of the Mayan civilization have taken to space. Two teams of 4 players each control customizable stonepunk mechs to hunt for energy and fight off opponents in a procedurally generated and highly destructible map. The ultimate goal is to activate enormous ‘titan’ statues that will bring explosive mayhem down upon the enemy team. Whoever wins these tactical battles climbs an intergalactic tournament ladder, ultimately becoming gods themselves.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2pfk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":34119,"name":"Rite of Life","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Rite of Life is a life-sim RPG. It features a player-driven open world where you start with a small encampment. Through exploring, battling and gathering resources you can turn your home into a prospering town.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5aqy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":34024,"name":"Soldiers: Arena","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Soldiers: Arena is a restart of the exclusive real-time tactics multiplayer gameplay. Perfect combination of the best traditions of famous series (Soldiers: Heroes of World War II, Faces of War, Men of War) with new features!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co1ibf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":33683,"name":"Fractal Space","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Live the memorable experience of a First-Person Adventure & Puzzle Game! Jump over lasers, avoid terrible moving saws, dodge giant crushers, use your Jetpack and Taser-Gun to think your way through Zero-Gravity puzzles of this mysterious space station.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7nj1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":33651,"name":"Space Battle Core","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Space Battle Core is a new 4X sci-fi game combining turn based hex combat gameplay with a real-time exploration experience.\nAfter the Earth’s demise, it is your task to recreate and spread human civilization in space.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":33616,"name":"Ira","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A child reaches for the stars, burdened by circumstance. Folks chained by debt, indentured to the powers at large. Mankind thrust to the stars following after a signal spanning the void of space and time itself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co2mbp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":33514,"name":"Prism","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Prism is a 360° spatial shoot'em up, with RPG mechanics, like randomly generated enemies, events, stuff and much more. \nYou move around a Prism that empowers your bullets and  2 fire modes ability","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":33426,"name":"Double Death","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Double Death is a crazy arcade brawler & shoot'em up with the heart of soul of those over the top 90's beat'em up games combined with the flair of modern survival and squad-based games, packed along with multiplayer and an integrated modding system.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":33251,"name":"What the Dark Keeps","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Open-world roguelite shooter. \nKill, survive, repeat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]}]