[{"id":233081,"name":"Tiny Goalie","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Dive your goalie to save oncoming soccer balls and avoid flying water bottles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233082,"name":"Too Many Snakes","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Help Jessie the mouse escape from bothersome snakes using super-psychic-mouse powers!\nCan you solve all 75 mind-bending puzzles and help Jessie get back home safely?\nA literal twist on the classic sliding-blocks puzzle game, Too Many Snakes swaps rigid blocks for flexible snakes that must be pulled and bent out of the way to reveal the exit for Jessie to escape. Collect Gold Stars by solving levels in the fewest moves possible!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233083,"name":"Toon Puzzle Island","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Toon Puzzle Quest is an interesting match 3 game. Challenge your hand-eye coordination and reaction! The game is highly addictive and challenging.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233084,"name":"Hentai Gyaru","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Hentai Gyaru is a relaxing puzzle game. With the theme of gyaru and 24 unique sexy girls. Enjoy sexy girls pictures and relaxing music to complete the puzzle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61tb.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Hentai works","games":null},{"id":0,"name":"GentleDriver","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":233085,"name":"Swipey Maze","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Find the key to unlock the block and escape the maze!\nEscape quickly, or master each labyrinth by collecting all 3 stars first!\nSpend keys to unlock new trail effects!\nCollect stars to prove your skills!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233086,"name":"Tales of a Viking: Episode One","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Tales of a Viking: Episode One is a small-scale turn-based strategy game with rpg elements.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233087,"name":"Tank Squad: Battle Hero","genres":[],"avg_score":0.0,"description":"The Dark Tanks are trying to conquer our land! Guard your headquarters! Destroy all enemy tanks! As a hero captain, fight for honor!\nPocket Tank Wars is a modern style NES / FC Battle City with new attractive elements.\nRemember, you are not fighting alone! In Pocket Tank Wars, there are ally tanks who will defend the base with you. Come and lead your teammates to fight with the enemies!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233088,"name":"TapLab","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Greetings, Professor Taplab here!\nAfter much experimentation I have discovered the key to infinite possibilities.\nI've created a formula so amazing, it will create anything you can imagine!\nbut is not with out its risks... I need your help!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233090,"name":"Tap to Dive","genres":[],"avg_score":0.0,"description":"A simple tilt-and-tap game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233091,"name":"Hentai EroElf","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Hentai EroElf is a relaxing puzzle game. With the theme of elf and 24 unique sexy girls. Enjoy sexy girls pictures and relaxing music to complete the puzzle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61tc.jpg","releaseYear":2023,"developers":[{"id":0,"name":"GentleDriver","games":null},{"id":0,"name":"Hentai works","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":233092,"name":"TD Quest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This game contains real time strategy elements, tower defense rules, and a innovative combat system. In combat, players can operate front-row characters to confront enemies or avoid enemy attacks, while back-row characters assume the roles of damage, control, heal and so on. A player can switch the jobs of the rear characters according to the combat situation and must protect the crystal from being destroyed.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233093,"name":"Technopoly: Industrial Empire","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Hi Boss! Are your ready to become the industrial are construction management tycoon?\nAre you ready to become the ultimate business manager in one of the most exciting factory building management game? How about putting your construction management skills to use with this tap tap factory building manager? Spend your time looking after your very own industrial area and make money from the proceedings. In this building simulator, you must look after the industrial building establishments and be patient enough to make money and collect it on the correct time.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233094,"name":"The Flute","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Experience a masterpiece inspired by the work of a genius.\n The game follows the adventure of Prince Tamino who fights serpents and creatures in his quest to rescue Princess Pamina,  the daughter of the Queen of the Night.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233095,"name":"The Harvest 3D","genres":[],"avg_score":0.0,"description":"In this science-fiction-themed action RPG set in a distant future, hostile aliens are out to turn Earth’s organic life into cyborgs. These aliens, known as The Harvesters, use humans and animals to create cyborgs: crude amalgamations of flesh and machinery.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233096,"name":"The Numzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"You have to combine numbers which are equal or 10 in total. Clear all numbers to win the sheet.\nThere are 360 levels to pass and the classic game which can be played for hours. Started games are saved so you can continue later.\nTrain your brain and master the most difficult levels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233097,"name":"One Hit Cowboy","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"One Hit Cowboy is featured as “New game we love” and \"Best new updates\" \"in more than 120 countries(regions) ! Including US, Canada, UK, France, China, HK, Taiwan etc..\nOne Hit Cowboy is a very addictive and challenging arcade game.\nYou're a lone cowboy, armed with your trusty revolver. You only have one bullet for dealing with each bandit.\nTime your shots, pull the trigger fast and precise. Miss one? You're dead as a door nail.\nAre you ready to face-off with all kinds of gunslingin' bandits? Let's see if you're the fastest gun in the West!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233098,"name":"Mini Crossword Puzzles","genres":[],"avg_score":0.0,"description":"If you are a crossword puzzle fan, that’s great. I you are not a crossword puzzle fan, the time has come to become one! ‘Crossword Games Mini’ will soon become your favourite mini crossword puzzle.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233099,"name":"AutoCompete","genres":[],"avg_score":0.0,"description":"Can you guess the crazy, funny, weird ways Google will autocomplete popular searches? Play the four basic categories: Culture, People, Names and Questions. And, exclusively for the app, play new categories such as Food, Movies, and Music!\nChallenge your friends and see who can get the most points!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233100,"name":"Flurry Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A stunning word game for everyone! Do you know how many words you use? Do you know more than your friends? The average person knows about 8000 words; do you consider yourself above average?\nChallenge your friends! Challenge your relatives! Challenge your foes to a word battle! The world has never seen a massacre as aesthetic as this one! Many have fled, but will you? Use your mind to become the one and only champion amidst all the witty others!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233101,"name":"Icontrivia: Guess the Dogs","genres":[],"avg_score":0.0,"description":"From to Chihuahua to Great Dane it’s time to guess all your favorite dog breeds.\nHow well do you know about our four legged companions? Guess all the canine friends in this highly addictive word guessing game.\nHints & Help: Struggling to guess an dog? You can reveal or remove letters to help you figure it out.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233102,"name":"SpellUp","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Relax and Lose yourself in a magical world of Zodiacs and Words in SpellUp, an addictive word game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233103,"name":"Letris 4","genres":[],"avg_score":0.0,"description":"Letris is one of the most popular AppStore word games. You have to build words to keep the screen clear and empty for as long as possible. It’s based on a simple idea that will keep you hooked, encouraging you to go on to the next level and beat your own record.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233104,"name":"Spell Breakers","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"SpellBreakers is the most advanced and the only real-time action word puzzle game ever! Spell Breakers will test your skills and knowledge.\nSimply, you capture your opponent's letters by spelling words.\nEach player tries to dominate the board to get even more letters. When the time is up, the highest scorer wins.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233105,"name":"Letter Fall: Swipe Letters","genres":[],"avg_score":0.0,"description":"A rain of letters is awesome, but not all the letters are good. There are \"bad letters\" that you must prevent them...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233106,"name":"Letter Stack","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Letter Stack is a fast-paced word stacking game where you challenge friends to see who can unjumble and stack words the fastest. Easy to learn, hard to master! Drag and stack letter blocks to form words. Stack as many words as you can before time runs out!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233107,"name":"Spell Caster: Puzzle RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sharpen your vocabulary and test your language skills at the same time by playing this spelling game with RPG elements. Battle against cool, vicious monsters as you progress further into the dungeon. Words get more and more complex the further you get, making the enemies more and more difficult to defeat. Level up as you progress to give you a fighting chance. Make it to the end to see all of the different enemies and areas.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233108,"name":"Flip Trip","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Flip Trip is a game of precise timing! Stay on your hands and feet and keep flipping as far as you can! Beat your high score and make it on the leaderboards! Unlock special characters and flip your way to victory!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233109,"name":"SailCraft","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Forge your naval fleet and enter the Arena! \"SailCraft\" mixes classic battleship rules with brand-new warship skills, we are trying to create the most amazing and innovative gaming experience for you.\nYou can recruit a variety of warships into your fleet, including glorious human warships, tough dwarf submarines, and elegant elf magic ships. From the numerous fleet combinations, formations and various tactics, there must be one that was made for you perfectly!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233110,"name":"Canyon Miner: Minecart Rush","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Get ready for the seat of your pants wild ride of your life - on a minecart! Navigate through the Old Mine as you search for Gems! This isn't the friendliest mine though. Bottomless pits, sharp hanging rocks, and giant Bats and Spiders make this one challenging run. Can you handle the pressure? Can you fill your pockets? Gamecenter lets you compete for high scores.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233111,"name":"Great Race: Route 66","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Cruise across America on the famous Route 66, all the way from lush Illinois to the shores of California!\nChoose your favourite Classic Car from a vintage collection and beat the competition, but remember to stop every now and then to enjoy the attractions along the way.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233112,"name":"Freaky Racing","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The ultimate retro racing experience for your phone or tablet!\nHow long can you stay on the road in this addictive retro racer?\nDodge opponents and potholes as you power down the racetrack at blazing speed!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233113,"name":"Robot Clash Run","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Run, dash and clash with robots and drones in Robot Clash Run! Sprint through a unique, fun, fast and challenging endless runner with endless colorful slopes, twists, turns and tunnels.\nJump, kick, fly and switch lanes as you run through fun arcade-style levels, catching as many burgers, fries and pizzas as you can! The more you grab, the more points you earn! Test your reflexes in this addicting platformer that leaves you running back for more.\nClash and defend Earth from a Clan of Evil Robots and Drones as you run, jump and kick them off every platform, even in the sky! Sound easy? Dodge hundreds of obstacles and see how far you can run!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233114,"name":"Demolition Dodge","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Buckle up and get ready for the ride of your life with Demolition Dodge - the new exciting and addictive survival racing game from insurance specialist Adrian Flux.\nBattle your way around the carnage-packed arena in your chosen car, collecting rewards, racing and dodging the deadly opponents trying their best to get between you and your prize.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233115,"name":"Shavalyn Pop","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Help our friend Shavalyn Pop escape from this alien trap.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233116,"name":"Apex Race Manager 2019","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Are you up for the Apex Race Manager challenge?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233117,"name":"Horse Racing Manager 2020","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Become the number one horse racing manager to grace the tracks! Race, train, breed from the local derby to the Ultimate Championship.\nCompete against other jockeys online from around the globe and compete in new events daily!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233118,"name":"Shop Heroes Legends: Idle RPG","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Shop Heroes Legends—the much anticipated sequel to Shop Heroes is about to be released worldwide! On this wonderful journey of forging, you can solve brand new challenges, develop your business globally and become the Epic Shop Tycoon!\nOne day, you were led to your Uncle's poorly managed equipment shop by his best friend Jack. The shop almost went bankrupt because of your uncle's mismanagement. Now, it is your mission to take over this empty little shop and miraculously turn it into a business empire. Are you ready to become a Shop Tycoon?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233119,"name":"Shot Online: Golf Battle","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Enjoy real-time (parallel) golf battles and experience our incredible golf clubs.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233120,"name":"8 Ball Legend: Online Pool","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"8 Ball Legend is the best and most realistic billiards legend pool game on mobile phones. Play billiards online with people in over the world. Can you get to the top of the leaderboard?","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233121,"name":"Ace Arrow","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"It is an archery game that shoots a moving target with an arrow.\nThere are various patterns of mobile targets.\nTest your archery skills.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233122,"name":"Fun with Cubes","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Rotate cubes to create patterns, and enjoy the beauty of your creations.\nIn the mood for a little competition? Try and match patterns with as few moves as possible, and get yourself a place on the global leaderboard.\nHave fun.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233123,"name":"Collect iT 3D","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Do you like puzzle type of games?\nWell, this one will be fun, because it is physics-based where you have to collect all balls and have them all added into the basket or the bin. In other words, you have to arrange things on each level where all yellow balls fall into the bin.\nYou control a magic saw that can cut through platforms in order to make a clear path for the balls to move. Each level has a different setup and some levels are relatively easy to play. It gets more challenging as you progress, so there's definitely a level progression. You have an option to skip a level if it is too challenging, but that's up to you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233124,"name":"A Nanobot","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Not so long time ago in a galaxy far away Censorship bugs were born. To infect everyone is their purpose. The only hope is you. Be brave you must and feel no fear.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233125,"name":"Fist Tower","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Repair buildings with your fists. Reach higher floors!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233126,"name":"Kumdor no Ken","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In this touch-typing JRPG for PC-98, created by Michiaki Tsubaki with ASCII, you play as the Milky Way's #1 typist, summoned to planet Kumdor to fight mysterious monsters with typographic magic — but you lose all your keyboard keys and your QWERTY skills in a crash landing. Worse yet, the planet suffers from a petrified economy and natural disasters. Can you recover your skills, prove your identity, and save the world?\n\nThe game has a surreal atmosphere, quirky dialogue, and a distinctive visual style. It also features a control scheme built entirely around touch typing, using no directional keys or joypad input. By improving your typing accuracy and agility, you must travel across a classic JRPG overworld, helping people and fighting off monsters to improve yourself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61tk.jpg","releaseYear":1991,"developers":[{"id":0,"name":"ASCII Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC-9800 Series"}]},{"id":233127,"name":"Metal Gear Solid","genres":[],"avg_score":0.0,"description":"Before being cancelled, a version of Metal Gear Solid was in development for the ill-fated Game.com, a portable console released by Tiger Electronics in 1997. It seems that the game was going to be a port of Metal Gear Solid PSX.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8jf6.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game.com"}]},{"id":233128,"name":"Kekcroc's Pizza Delivery","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61to.jpg","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233130,"name":"Trevor Daison in Outer Space: Chapter One","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"After a long sleep Trevor Daison needs your help to escape from a space station.\n\nLet the real adventure begin . . .","imageUrl":"Sin imagen","releaseYear":2007,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233131,"name":"Trollbound","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In a different twist for adventures you play a Goblin called Gonj who used to be friends with the Humans but now hides away underground in your home to stop yourself from being killed. Your problem is that your pantry is nearly empty again so you must go up to the surface into the castle above and steal food. This then begins various adventures and quests.\n\nTrollbound is a graphic text adventure where you see a picture of your surroundings and text to describe them. You type in commands to control your hero.","imageUrl":"Sin imagen","releaseYear":1986,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Commodore C64/128/MAX"}]},{"id":233132,"name":"Tropic Jim's Sweet Island Adventure","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Have you ever wanted to vacation on an island where nothing will go wrong? Where there aren't any plans involving you and two others who came to this island? Where there are no mandatory sunscreen checks?\n\nTropic Jim's Sweet Island Adventure is a short-ish point and click made in adventure game studio. Read notes, solve puzzles, and uncover what's happening on this totally very unassuming island.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[{"id":0,"name":"yatoimtop","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233133,"name":"Ultizurk III: The GuildMaster's Quest","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Ultizurk III: The Guildmaster's Quest is a shareware top-down fantasy role-playing game that is visually similar to Ultima VI. As the eponymous Guildmaster, the player must save the kingdom from a mysterious threat.\n\nThe player controls a party of two: the Guildmaster and his companion Losi from the previous adventure in The Great Ultizurkian Underland. Basic interaction with the game world is accomplished by using the mouse, talking to NPCs requires the player to type keywords highlighted in yellow. The game boasts a great degree of interactivity, with the player being able to manipulate most items in a way they would behave in real life (e.g. fill a bucket with water and then put a burning torch out with it).","imageUrl":"Sin imagen","releaseYear":1994,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"DOS"}]},{"id":233134,"name":"Umbra Mortis","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"When a man is infected by a strange, devastating virus, he must find answers : what exactly is the nature of the dread infection that grips him? How is it ravaging his body? How will he face the darkening shadow that grows within?\n\nUmbra Mortis is a Horror/Sci-fi Visual Novel from Crux Game Studios that touches on sickness, insanity, and loss, and the deepest, darkest fears that plague us.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[{"id":0,"name":"Crux Game Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233135,"name":"Under the Brine","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"There’s something off in this town, and the forest is one of them.\nYour whole life flips upside down the day you stumble across a dead body at the beach that nobody seems to recognize.\nIt’s up to you to find out what really happened and save him before it's too late.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"Donna Draws","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":233136,"name":"Under","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You woke up in the middle of WW2 and realized that all of your comrades are gone. You now have to explore the place to find out the truth about what really happened and where do all your comrades go.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"SolitaryStudios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233137,"name":"Unfair","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You're a young lawyer, offered a last-minute murder case to defend you can't reject... or win...","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233138,"name":"Unsung Heroes","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sir Gaelin, the Commander of the Knights of the Stormlands finds himself in an uphill battle against the Sovereign King and his Lords. This is the beginning of his tale...","imageUrl":"Sin imagen","releaseYear":2017,"developers":[{"id":0,"name":"PVGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233139,"name":"Velnor's Lair","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Earth is in trouble from the Black Wizard Velnor, as he has finally found the tomb of Grako to turn himself into a demon. Time is short as he prepares for the change and so instead of sending a huge army to stop him, you have been chosen for this quest. You have arrived at Mt. Elk and you must enter the mountain and find Velnor hidden in the Goblin Labyrinth to stop his evil plan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co80be.jpg","releaseYear":1983,"developers":[{"id":0,"name":"Atlantis Software Limited","games":null},{"id":0,"name":"Quicksilva Ltd.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"ZX Spectrum"},{"id":0,"name":"Commodore C64/128/MAX"}]},{"id":233141,"name":"Escape Game: Timeless Room","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is a simple escape game. Let's get out of this world by solving the items and gimmicks scattered in the mysterious world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ty.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233142,"name":"Meet Ball Girls","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Boys like to play ball, and they prefer to play with beautiful girls. . .","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61tz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233143,"name":"Carta Nostra","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Carta Nostra is an educational virtual reality game, a compelling interactive narrative dealing with the theme of the Mafia. You will have a pack of cards to defeat the mafia, each card will have positive or negative consequences throughout the city. Make your choice and play the card!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co65ew.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233144,"name":"Bots Boom Bang","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"The coolest bots ever.\nDive into the world of bits & bytes and experience the grooviest bots of all time. Bots Boom Bang is funky, groovy, fun - in a word, different. A brand new challenge awaits you: solve the schematics to help the bots find each other. Use the power items to clear your path through the levels. Use the craziest wheel of fortune you've ever spun and win great prizes. Are you in?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233145,"name":"Baby Flash Cards: Car Sounds","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233146,"name":"Mans Not Hot","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Man can NEVER be hot!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233147,"name":"Rock Hero: Guitar Legend","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"You love music? You love Guitar Hero game?\nYou love Rock Band game?\nYou will love this tap tap music rhythm game.\nA fun way to play with your music.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7y9r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233148,"name":"Gnome Dash: Rise of the Trolls","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fly, Bounce, Run, Dig, and Laugh through an Endless Magical Adventure!\nLong Ago a wise Gnome foretold of a day when trolls would rise up and take these magical lands from the Gnomes... Today is that day and with the help of wise fairies and joyous creatures it is up to you to search and scour the magical worlds with wit and speed to complete all quests and find the pieces to put together Project: SWIFT a cybernetic fox, or it may be the end as we know it...\nAre you Gnome enough to save us all?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233149,"name":"Four Squares","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Four Squares is a game of memory, skill, and concentration. Watch what happens each turn and repeat what you see. Each time you successfully repeat the sequence it is lengthened, the speed increases, and your thinking time is shortened. Keep practising, work your way up the leaderboards, and challenge your friends.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233150,"name":"Pogo Pogo World","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to Pogo Pogo World! Maneuver Pogo Bunny through the spikes and over the mushrooms, but don't pogo too high. Stay close to the ground in this endless running POGO adventure! Check out the ad free full version.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233151,"name":"Rush Galaxy","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Fearless warriors, wear your helmet, set foot on your ship, and go toward the deepest of your universe! The only thing you need is speed.\nDo you want to drive the super speed of the spaceship in the vastness of the galaxy? Do you want to experience the thrill of the shuttle in a messy meteorites? Do you want to challenge your reaction speed and limitation? So, you can't miss this game - Rush Galaxy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233152,"name":"Startales","genres":[],"avg_score":0.0,"description":"Sail away into the sky to find your true love! Soar into the heavens and as far as outer space to touch the stars, balance from cloud to cloud and use momentum to acquire speed so you can zip along at high speeds traveling ever farther and farther. Two tiny stars in the sky, an impossible love affair, a relentless shadow pursuing you : You are the last hope for their union, so they can dance and glow together in the glorious night of their love.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233154,"name":"7 Pips","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"7Pips is a little less casual than those games, this game may need a little simple math (actually there is a in-game help to smooth things out), and plenty of strategic placement planning! Place dice on board, same color adds, different colors subtract, form dice faces with 7Pips to score. Fill up the board and it's game over, last long and score high!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233155,"name":"Percy the Potty Pigeon","genres":[],"avg_score":0.0,"description":"In this side-scrolling egg-em-up, released in 1984, take on the role of Percy as he struggles to build a nest and feed his needy offspring. Contains both the Commodore 64 and ZX Spectrum versions of the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61u6.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233156,"name":"The Dark Side Of Mars","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Survival horror game where you need to find your way through the maze that is the Red Arc Facility. You need to Find four Key cards and one Space Suit to escape the facility alive. Some enemies run and some relentlessly follow you and all you have is a torch.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61u7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233157,"name":"Real Street Basketball 3D","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Real Street BasketBall Dude 3D\nHey Dude! Are you are a Basket ball Freak; so play this new 3D real street basketball ..\ndribble the ball, dunk the ball in the basket.\nA very addictive and fast paced sporty game to immerse you in the real streets of the NY..","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233158,"name":"CardSurvival: Tropical Island","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Card Survival: Tropical Island is a card-based survival experience from the creators of Card Quest.\nExperience what life would be like if you were stranded on a desert island, all in a card format.\nExplore, craft tools and manage your needs in order to survive in this hostile environment.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233159,"name":"Karza Football Man 2017","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Karza Football Man. 2017 is a funny old-style football management game!\nYou'll have to take the helm of a glorious team which is on the brink of failure.\nWill you be able to bring it back to its place in the football hall of fame?\nPossibly the most important characteristic of Karza Football Man. 2017 is that the game can be played almost forever, and every time the game will be completely different!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233160,"name":"Soccer Swipe & Match 3","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Test your reaction and agility in this exciting soccer themed swiping and matching game, featuring four different and addictive modes. Use awesome power-ups to help you along, and play through numerous levels as you try your hardest to master the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233161,"name":"One More Run: Endless Cricket Runner","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"One More Run is the perfect blend of cricket and endless arcade games. You'll have a tough time finding a more fun cricket game!\nT20 is fast and furious. One More Run trumps the breakneck pace of T20 cricket by always putting you in the last over. Hang on to that last wicket and keep going for One More Run! - an endless cricket runner that will have you coming back for more. How much can you run? How far can you go? How many matches can you win?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233162,"name":"Real Steel Champions","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Fight alongside 100 million+ fans of Real Steel World Robot Boxing in an epic sequel. Build Your Own Robot Champion and Dominate 10 inspiring Arenas. Create 1000s of unique robots from exclusive and legendary robot parts. Defeat the Legends of the New Real Steel Era & an All-New Mysterious Super Boss to Reign Supreme as The Undisputable Champion!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233163,"name":"Slam Mania","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Slam Mania is in a tribute to classic 80s arcade wrestling games, with controls lovingly adapted to the touch screen. Battle a crew of rowdy professional wrestlers including Jobber Joe, Chen Lee, Mad Moose, El Diablo, Kid Turbo, and Beardo.\nPlay vs. computer to capture and defend the belt, or locally versus a friend in hotseat mode.\nKnock down a flung opponent to earn stars. Use stars to dish out heavy damage with power slams, or leap off the turnbuckle for a high flying finishing move!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233164,"name":"Save the City","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Each of us would like to drive an ambulance at least once in a lifetime ... In real life it is not so easy to do, but in this game, you can safely travel around the city and provide the people caught in accidents with medical care! You can earn money by performing routine mission in the game, and the \"non-stop\" where you gain bonuses for the damages caused to other road users. Collect the right amount of money, and buy a new, powerful car! Good luck!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233165,"name":"Mad Road Driver","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Only a madman would take this road, but you have no choice!\nBuckle up and test your reflexes! Burn rubber and outrun the crazed trucker chasing you through the desert wastes.\nSwerve around obstacles, collect power-ups and nuts - you're gonna need them!\nPut the pedal to the metal and race your friends to the top of the leaderboards!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233166,"name":"Antarctic Escape","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An unusual penguin, 'Penpen' is very sensitive to cold.\nHe has explored all around The Antarctic to find a warm place, but he hasn't found yet.\nOne day, 'Penpen' heard about the tropics.\nHe really wants to go to the tropics, but the Antarctic sea is too cold to swim with him.\nFinally, he decided to skip across the surface of the Antarctic sea.\nHelp 'Penpen' escape the Antarctic!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233167,"name":"4 Cats","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Simple timing game!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233168,"name":"HotBlood Drift","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Download Hotblood Drift, a racing game by which you can feel thrilling drift and exhilarating driving comfort, now, and experience the pleasure yourself.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233169,"name":"Stick Sprint","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"High octane bite-sized challenges await you in a unique hybrid racing experience. Stick Sprint combines the daring acrobatics of Sprint Trucks, the purity of drift racing and frenzied head to head Sprint Car action - all in a stunning stadium setting.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233170,"name":"Circadia","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Tap dots and make all the rings hit the white dot at once.\nSimple?\nSure, keep telling yourself that.\nTry it and see for yourself.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233171,"name":"Alone in the Dark","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The iOS port of Alone in the Dark.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co855p.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Kung Fu Factory","games":null},{"id":0,"name":"Atari","games":null},{"id":0,"name":"Infogrames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233172,"name":"Micro Battles","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Using two buttons (one for each player) on a single device, you can place your portable battleground practically anywhere and challenge any friend you'd like.\nBattles are changed on a daily basis, so be sure to open the app every day for another fun challenge.\nLet the Micro Battles begin!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233173,"name":"Line the Balls","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Connect all colors and fill the board. But watch out, lines will break if they cross or overlap! In some levels, there're tubes that 2 balls can come inside.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233174,"name":"Blocky 6","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Blocky 6 is a challenging puzzle game that you won't be able to put down.\nWarning: Each \"blocky\" only lasts for few turns before turning into rock!\nHow long can you prevent the rock from filling the board.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233175,"name":"Boxing Holic","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"I know you have sorted out iPhone and iPod folder.\nBoxing Holic is new paradigm puzzle game from sorting out iPhone folder.\nGet high score to sort out droped block in a huddle.\nBoxing Holic provides Game Center Service, so you can compete ranking with your friends or international user.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233176,"name":"Burning Metal","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"3D combat car refit and multiplayer online competition game. Featuring straightforward gameplay, stunning graphics and breathtaking battle scenes, the game provides intense combat car battles that immerses you in a world of speed, pursuit, collision, and firepower.\nThe game gives players the chance to experience true speed and multiple well-designed combat cars, A variety of map styles. Up to 10 players can compete simultaneously, with leagues consisting of multiple players!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233177,"name":"Caroline's Camera - Rhythm Game","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Caroline finds a new part-time job!\nThe newspaper office is now in crisis as they have no photographer. We are counting on you, trainee photographer Caroline!\nFrom the development team of \"Caroline's Work\", the new game \"Caroline's Camera\".\nPick up the rhythm of photographing, press the shutter in the righting timing, and snap an brilliant shot. Take better picutres to hit the headlines. Save them and share with others.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233178,"name":"Sleep In Office","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"What's wrong with sleeping on the job?\nNapping at work is now a game!\nSleep In Office is a game about full-on sleeping on the job.\nIf you do this at your real job you'll get fired, but in the game sleep as much as you can until you get caught by the boss!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233179,"name":"Bubble Fire Story","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bubble Fire Story is a casual game, an addictive bubble-shooter game.\nThe rule is simple, just shooting the enemy's bubbles by your own bubbles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233180,"name":"Airman X","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Reporting!\n「Airman X」 is a casual game that is a challenge against the reaction speeds of its players, in which they can take control of the paratrooper and help him thread his way among obstacles.And you will successfully complete your mission after the paratrooper’s safe landing.\nNever forget to collect the medals you win at each game level. For later on you can unlock the endless mode and challenge the extreme mission.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233181,"name":"Puppyman","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"New critters are introduced as the player progresses, with Pork N Bean making an appearance in higher levels. The player will overcome each enemy using a different tactic including jumping, waiting or running. Touching an enemy causes Puppyman to lose bones and reduce the overall score for the level. Some enemies will chase Puppyman causing him to miss collecting his treasures. Avoid the critters, save Pork N Bean, and collect all bounty to achieve the highest possible score.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233182,"name":"Pocket Dinosaurs to the Moon","genres":[],"avg_score":0.0,"description":"Dinosaurs, land-locked for millions of years want to escape Earth!\nBut the Evil Alien in the space certainly cannot let the Dinosaurs do this.\nThe Evil Alien drops Meteorite to take down the Dinosaur's space tower.\nHelp the Dinosaurs to the moon!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233183,"name":"Special Forces-S","genres":[],"avg_score":0.0,"description":"Will the agents deployed to stop a nuclear development underway successfully make it out?\nThey need your help!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233184,"name":"Maglev Metro","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In Maglev Metro, utilize state-of-the-art magnetic levitation technology to build a metropolitan rail system, transporting workers and robots beneath the city. Replace aging Manhattan and Berlin subway systems with newer, faster, quieter technology. Enhance your rail system's abilities so that your passengers arrive at their destinations first.\nEfficiency is your key to success in this pick-up-and-deliver, tile-laying, engine-building game. Transparent tiles allow your route to overlap your opponents' tracks, winding you along from station to station. Robots efficiently upgrade and adjust your abilities, leveraging unique goals to maximize points. By the end of the game, the game board has morphed into a modern subway map, with brightly-colored routes connecting stations all over the city.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233185,"name":"Stickman Awakens","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Stickman Awakens is a brand-new card role playing game. It sets after League of Stickman II which has been downloaded over 1 million times. We strive to restore the rich fighting skills of the stickman and the strategic lineup mechanism is added to this game. In the game, you will lead your stickman team to take on an amazing adventure, and the super rich gameplay will definitely make you unable to stop!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233186,"name":"Seize Halloween Knight","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A Unique Strategy game with NEW FRESH Hallowmas Skin. Let's capture the Escaped Sleepy Hollow!\nNot like your old puzzle and Strategy games, but even if there were. The ancient Sleepy Hollow gradually awaken, we need to use our wisdom to capture him with magic pumpkins. It is actually now or never for us! Move!\nOtherwise, “Seize Halloween Knight” is one of the best-looking games of its genre which also runs smoothly on older devices. Endless and challenging capturing fun! Tons of Stunts to complete!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233187,"name":"Planet Soccer 2018","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play a happy physics' soccer with super simple controls. The planetary field affects the ball creating different situations. You choose left or right to control your player. Kicks are automatic but the timing and precision are yours. Win the matches and you can be the World Champion. Play against the CPU or with a friend (two players mode).\nPlanet Soccer is a super casual game. It has an easy gameplay, where you can play with one finger only, but using both hands you can have a better response time, and the agility needed to win the matches. Your controls are: move right and left. Kicks are automatic when the ball reaches your leg. So timing for moving, and a good strategy is the key to become the winner.\nThe game simulates a tournament, and winning the matches you'll advance in the competition. The game includes 36 teams, with all countries present in the cup among other important nations. Win the matches and become the world champion.\nWhile playing your XP points will increase, and you can release new content, different balls to vary your matches.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233189,"name":"Earwyrm","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Try different tracks, and see if you can beat your friends at your favourite music.\nEarwyrm always provides a reliable gameplay experience from song to song - each level is uniquely derived from your choice of music - and is the same for everyone who tries to race that music.\nYou don't have to wait - the level is generated in real-time as you listen to the track, and dynamically recognises changes in the music and visualises them immediately.\nEarwyrm is a visceral reactive music game like no other. Play it on maximum difficulty to get the highest scores, but look out for when the bass drops!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233190,"name":"Ranch Escape","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ranch Escape - The horse collecting arcade game\nOh no! - The horses have escaped the ranch and are running free.\nCan you gather them back to the ranch?\nTest your skill at collecting as many horses as you can within the time limit - Try against your friends.\nWho can collect the most?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233191,"name":"Gravity Line","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"GravityLine is the code name for a super-secret operation, whose aim is to save the world. In a top-secret lab, brilliant scientists (aka players) are working hard to destroy the HEB - huge and incredibly evil bacteria infecting everything it comes into contact with and threatening the world’s existence.\nThe objective of GravityLine is to lead a very dangerous bacteria through an infected object without bursting its bubble, and to destroy it once and for all in a special chemical mixture. If you burst the bubble, the bacteria (or as we call it - HEB - Huge Evil Bacteria) will spread and your mission will fail! HEB is very vicious, and extracting it from the infected objects can be really tricky - we hope, for the sake of the world, that you'll be able to complete this mission. If not - HEB will spread and all hope is lost! Good luck!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233192,"name":"Space Surf: Shark Attack","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"You are Tyrone Stallion, a world famous surfer riding some of the gnarliest waves ever surfed! But there’s trouble in the water. A 10 foot great white shark named Brutus is after you! Surf waves, whales, dolphins, birds, airplanes and UFO’s to stay ahead of Brutus the shark!\n\nSurf past as many islands as you can and discover all the incredible things you can interact with in this exciting, action packed surfing endless runner!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233193,"name":"Base Under Attack!","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Can you save your base and protect your planet from hordes of alien ships, commander? Arm your base with advanced arsenal of turrets and unique upgrades in this highly addictive action packed defense game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233194,"name":"Daytona Rush","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The official Daytona game now on mobile!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233195,"name":"Bike Trials Junkyard 2","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Since you like the first one we are now giving you the second part of the game, Bike Trials Junkyard 2! With 20 new challenging stages, drive and balance your bike in the rough terrain of the junkyard. It's never going to be a smooth ride in this game. So better put on your helmet because it's going to be a bumpy ride...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233196,"name":"Blocky Warriors: Amazing Race","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Welcome to Blocky Warriors! This is a real-time running game with characters of Blocky style. Try to outrun 3 other players in real-time battle and become the best player in the world! If someone blocks your way, just use your skills to smash the enemy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233197,"name":"Dunker.io","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Start dunking in an insane multiplayer .io basketball court, yup!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233198,"name":"Shopping Cart Defense","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Shopping Cart Hero invades the defense genre! Fight off waves of groupies through epic battles of bananas, pitchforks, and the occasional UFO. Work your way through the farmlands and the snowy mountains to see if you can triumph over what lurks in the mysterious jungles. You probably can't. Don't bother trying.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233199,"name":"iZumas","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Are you a match 3 fun? Are you a nostalgic person?\nIf you are, this game will bring you back to the classic fun!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233200,"name":"Amber Route","genres":[],"avg_score":0.0,"description":"Amber Route is a trip to the land of the Slavic beliefs, monsters and magic. Might and magic, heroes, destiny, order and chaos, duels, fate, monsters and adventure. In this game full of surprises embark on a dangerous journey leading his caravan through more and more new areas. The path which you will defeat is however treacherous. At each step, they will persecute traps, sinister creatures and ancient magic. To win, plan your moves carefully, protect ambers, gain extra bodyguards and try to reach as soon as possible to your destination.\nAmber Route turn-based game will satisfy even the most demanding fans of board games. The game offers four types of gameplay. So we try our hand at Campaign mode, where we are waiting for as many as 20 boards, play one of the special missions in Single or stand face to face with the enemy using the options Duel (playing on one device) or Multiplayer. The game also offers three difficulty levels, and more than a hundred unique cards.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233201,"name":"Letter Wizard Arcade","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Arcade version has a limit of 50 words meaning when you find 50 words the game is over. Score as many points as possible with only a 50 word limit.\nTry the full version Letter Wizard (on the App Store) to play with unlimited words.\nConnect letters to make words. Use bonus tiles to increase the word score. When red tiles reach the bottom the game is over.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233202,"name":"Capitals Battle","genres":[],"avg_score":0.0,"description":"Capitals is a free and addictive social word game. Play against your friends to spell the best words and expand your territory. Use strategy to defend your capital and knock out your opponent’s!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233203,"name":"Badaboom","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Badaboom is a rhythm game that brings the player to a pre-historic world of Dinos and Cavemen, where you must play the drums in the right time to command Obo (our hero) to fight and conquer his food, his weapons and, above all, his right to live in peace.\nThe game has 2D platform style, with simple controls that allows to command Obo through the combination of drum's sounds. Combining 4 sounds like \"Ba Boom Da Bing\" Obo starts to get aggressive and attacks it's enemies with a spear.\nWith upgradable weapons and calling the help of Natural Elements, Obo can use many strategies to beat a level and to do it in the less time possible, going on to other scenarios and facing bigger challenges.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233204,"name":"Night Bars","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match the falling bars from the top with the bars at the bottom as they keep falling in various speeds and numbers.\nTest your tap-eye coordination and leave your mark in the game leader-boards","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233205,"name":"Beast Farmer","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Beast Farmer is a living, breathing, experience which will transport you to the mythical lands of Beast Planet.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233206,"name":"Cardboard Football Club","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Cardboard Football Club Premium is a highly addictive skill-based soccer game. Combining outstanding gameplay, colorful graphics, great audio effects and local multiplayer.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233207,"name":"Galaxy Hero H2H","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"This retro space shooter lets you battle head to head to find out who is the greatest Galaxy Hero!\nChallenge people around the world with Skillz, a competition platform complete with leaderboards, trophies, cash or virtual currency prizes, and an amazing loyalty program that rewards you just for playing!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233208,"name":"Simon's Cat in Purrfect Pitch","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Simon's Cat has arrived in his very own app! Now you can have Simon's Cat performing for you in the palm of your hand!\nPurrfect Pitch is a creative musical app and a game too! The creative mode allows you to compose your own tunes, save them, and then watch as Simon's Cat sings them back! The game mode sees you taking on Simon's Cat, as he tests your ability to follow his lead in a series of increasingly difficult musical challenges!\nSure to raise a smile, this app is a must for any Simon's Cat fan!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233209,"name":"Mad Finger Marathon","genres":[],"avg_score":0.0,"description":"Run with you fingers as fast as you can to try and get to the top of the leader board.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233210,"name":"Hunger Crunch","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233211,"name":"Moyashibito DX","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Since its release, it has been much talked about around the world and in the manufacturer community!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233212,"name":"Irbot","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"iRBot is a highly addictive and playable 3D side scrolling platform game. Featuring super cool graphics and game play as you try and lead iRBot through the space station complex to freedom.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233213,"name":"Amoeboid","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Lead Phoebe the Amoeba through a microscopic world full of food, friends, and foes. Eat food particles, collect strands of DNA, and meet other microbial pals all while avoiding infection from the nasty viruses. If you get infected 3 times it's game over! Restore your health by finding \"Happy Pills\" then go \"Radioactive\" as the viruses attack in waves! How many levels will you make it through?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233214,"name":"Mesa","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Welcome to Mesa: a completely original game of strategy and friendly domination. Carefully select tiles to fuse powers and decimate your opponent in head-to-head gameplay.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233215,"name":"Rainmaker: Ultimate Trading Game","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Fun and exciting way to experience stock trading with best companies on stock markets around the world. Become rich! Make millions and billions on high stake trades! Compete and compare your strategy against your friends.\nRainmaker offers fast paced trading experience in a nutshell. In just 30 seconds, you’ll experience 2 years of ups and downs in stock price changes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233216,"name":"Clash of Elements","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Clash of Elements is something more than a typical puzzle game! It combines best features from puzzle games and multiplayer world.\nThe Element is in you! Just pick fire, wind, water, stone, earth or thunder. Name your character and start fighting with your friends, random players or bosses.\nThe fight starts with laying stones - powerful pieces of elements that you need to destroy to get either attack or defence points. As usual you can create combinations or special pieces. If you are really smart and quick you can destroy your opponent with just a few swipes hitting him with great balls of fire, tsunami waves or giant stones.\nAre you ready to fight?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233217,"name":"PunPics","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"PunPics is a guess-the-picture game with a twist–it’s all puns. Use that squishy brain of yours to solve a growing collection of visual pun puzzles and riddles.\nTest your wits against our punny mind benders, brain teasers, and visual rebus puzzles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233218,"name":"Hidden Objects: Messy Kitchen","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Hidden Object – Messy Kitchen – the ultimate puzzle solving adventure and a cool mystery game for kids and adults! Can you clean up the messy kitchen and find all the mysterious objects in the pictures?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233219,"name":"SilhouetteGirl Zan","genres":[],"avg_score":0.0,"description":"Silhouette girl series fourth bullet\nThe latest work \"Silhouette Girl Cutter\" finally released!\nThe stage is \"Japan\" -\nGrowing up in a world devastated by mystery\nI do not remember the faces of my parents\nThe girl who spent with the sword \"Kurosu\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233220,"name":"On the Wind","genres":[],"avg_score":0.0,"description":"Take control of the wind and guide the leaves through a beautiful and stylish world. Try to survive through the year as the seasons change and the leaves fall.\nYou are the wind, guide the leaves, flourish in the summer, survive the winter.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233221,"name":"Andromeda Zombies Colonies","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Andromeda Zombies Colonies is an First Person Shooter video game featuring zombies. You awaken near a station on a red planet but an experiment turn wrong and now, hostile aliens have invaded the colonies, and they target you. You must survive using the weapons at your disposal.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ub.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233222,"name":"DizzyRoids","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Are you up to the challenge? How long can you play before you are completely dizzy?\nA totally new twist on a retro classic, DizzyRoids takes the old school fun of shooting asteroids and flips it on its head.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233223,"name":"Eggсellence: Eggs Bounce","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Don't just be good - be egg-cellent! Catch the eggs falling from many directions in a chicken coop. How long can you go on without cracking an egg? Challenge your friends and show them who is the real egg savior!\nEggсellence is a 2D family arcade game about farming. Meet Russ Eggsavior, a nice hard-working guy who is doing his best to keep his little chicken farm in order. Help Russ at the farm, and don't drop the eggs!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233224,"name":"Hidden Object: Underground Treasures Gold","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An adventure lover dreams the same dream every night, of a huge cave shining with numerous treasures.\nAfter waking up, she finds that her younger brother has run away.\nWhile looking for her brother she finds a hiding place with an old tree.\nSo begin her incredible adventure in search of treasures hidden deep underground.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233225,"name":"Docking Donuts2 in 1","genres":[],"avg_score":0.0,"description":"You should sell the donuts ordered.\nYou'll be supplied with donuts one by one.\nThen you just lay it in the tray.\nOf course, you should not lay it carelessly.\nTo sell and get money,\nJust put three or more donuts together then the donuts will be sold(removed).\nAs time goes on, the screen will be filled with the donuts from the bottom.\nSell the donuts ordered before it is overflowing.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233226,"name":"Sugar High","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Meet Biscuit, a dog with a huge sweat tooth. Every time he falls asleep, he dreams about worlds full of candies to eat. Run with Biscuit through sugar-filled levels, avoid obstacles, collect power-ups and eat all kinds of sweets.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233227,"name":"Lane Splitter","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ride your motorcycle at insane speeds through ever changing traffic. Your reflexes will mean the difference between surviving or crashing in spectacular fashion.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233228,"name":"Stickman Downhill Monstertruck","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Stickman Downhill Monstertruck is the third edition of the Stickman Downhill series. Experience ultra realistic and fast paced action packed Monster Truck racing in stunning environments. Choose from more than 15 different trucks, including very special ones like a school bus, shopping cart, crane, a kerosene powered rocket turbine truck and even a mini RC Monster Truck. Race in various different locations, ranging from tracks in deep forest to mountain tracks high up in the air. Every truck is designed by hand with its own physics, handling and realistic sounds.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233229,"name":"Racers Islands","genres":[],"avg_score":0.0,"description":"Compete against some crazy drivers","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233230,"name":"Satan's Zombies","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"In Satans Zombies you are one of the last remaining survivors in the Zombie Apocalypse, and you're a badass bikie tearing through the highway of a megapolis shooting zombies and kicking rival bikers.\nThe game is similar to other endless runners but is more violent, contains a lot of blood, guns and action movie cameras.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233231,"name":"Hilltop Hotrods","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Meet Undead Ed, Doc Ocular and their friends in this easy to learn, but difficult to master racing game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233232,"name":"Bounce Lounge","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Experience sensual immersion in this audio-visual trip of hand-crafted stages, each ft. an original soundtrack with colorful animations. Test your skills & reflexes in endless, an infinite mix of color and obstacles that is unique every play.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233233,"name":"SwayBods","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bubble monsters are sad and get delighted when they are swaying. Tap them to get them swaying! ... but then they dislike bumping into each other.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233234,"name":"Ninja Runner","genres":[],"avg_score":0.0,"description":"You think you are the best ninja in history?\nwell, You have to prove it!\nIt’s time for a test and show everyone what you're capable of! You’ll have to fly over between building rooftops. Well, Let's test out how much you can handle the speed.\nPress and hold for longer jump!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233235,"name":"Rainbow Slide","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Slide your way up the rainbow, jumping from level to level through the colored gates. Time your jump and watch out for the spikes! How far can you get?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233236,"name":"Bubble Wrap Frenzy","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"OK, ready for the most addicting, mind-blowing, fun action packed game for you and your family? Look no further, this game app will have you going in a Bubble Wrap Frenzy !!! Easy instructions on how the game works. Simply try to pop all the bubbles before time runs out but be careful not to pop the wrong ones. Now before you get started, loosen up those fingers because they are about to get one heck of a workout! Now the true question is, can you finish all levels of the game? Many have attempted, few have accomplished. Lets see if you are ready to take the ultimate challenge.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233237,"name":"Rugby Hero","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Kickoff the Rugby World Cup 2015 with infinite ‘TRY’ scoring fun and win Glory with your favorite team. Be the famous player of your heroic team and have fun running past defenders this Rugby season. Show off your skills by running hard to fend off endless tackles and Score the highest to celebrate victories.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233238,"name":"PowerSkate","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Bored with those plain small games? Loving challenges? Why not try PowerSkate!\nExtremely cool action, gorgeous special effects, plentiful levels but accessible control. Come and Conquer!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233239,"name":"Battle Tap Tap","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"This is a tapping battlefield. You get 1 minute to tap as many times as possible\nIt is simple but challenging. Can you be the final winner?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233240,"name":"Bounce Time!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Demolish as many bricks as you can by bouncing the ball before the blocks reach the bottom. The blocks are numbered according to how many hits it takes to demolish them, the number of hits goes up as the game progresses. Collect the white objects to get more balls and the yellow coins to unlock the other characters with various superpowers, also, the coins can enable you to have another chance even when the game is ‘over’.\nGet Ready, Aim, Fire, Have fun!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233241,"name":"Super DJ","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"In Super DJ, players get to become the DJ of an epic 3D party. It’s up to you to keep the music going by guiding the flying record through a trippy obstacle course filled with neon rings, blocks, and tunnels. Hovering over different colored blocks changes the tempo of the music, allowing you to create your own remix. Each block has a distinct sound so you can get really creative with each track.\n\nAs you rock the crowd, you earn points that you can later use to unlock new music tracks like techno, hip hop, electro, and reggae. In this 3D game, the party never ends! Plus, just like a real DJ, you can make scratch sound effects by swiping your finger back and forth quickly.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233242,"name":"DuoXBall","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"DuoXBall is a fun foosball game for 1 or 2 players. There is a selection of 11 tables with range of themes. Play on the same phone against your friend or challenge the computer.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233243,"name":"Sports Car Challenge 2","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"High-end racing on mobile enters the next round with Sports Car Challenge 2. Drive a total of 20 exclusive super cars by international top-brands such as Audi, Bentley, Bugatti, Lamborghini, Porsche and Volkswagen. Enjoy photo-realistic 3D graphics and spectacular attention to detail. Show your skills on the asphalt in three ambitious game modes and make your way to the top of the global leader boards. Fill your trophy room with the rewards from dozens of challenging achievements!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233244,"name":"M.U.D. Rally","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"If you are looking for real mobile rally simulation, than you are in the right place. Race at 60 fps in mud, snow, dirt and asphalt in this fast-paced racing game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233245,"name":"Spinny Path","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Race the Spinny Path and reach the finish line!\nGet addicted to this fast paced racing game!\nExcellent graphics and an endless supply of levels will keep you hooked\nGet the frenzy star and smash your way to the goal!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233246,"name":"Blowup!!","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Time to gear up!!! Blowup!! is an iOS puzzle game where you try to connect eight or more of the same colored blocks to blow them up. Developed by Cravemob, the application works on the iPhone, iPod Touch and the iPad. Try to connect as many of the same colored blocks to transform them into robots which in turn will blow up. The music in this game changes depending on how far you can last. One song can have a variety of mixes which adds an addictive quality to the game just to hear them all.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7jdh.jpg","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233247,"name":"Cake5","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Cake5 team members need your help! CC, GBM, Taro, Brownie, and Rainbow - have been sent on a mission far from home by the Sweet Queen and Dr. Puff to find the lost sweet taste that's gone missing from the Sweet Planet. Help the Cake5 team explore the Universe and visit magic ovens on distant worlds, asking them for clues and fragments of the magic recipe stolen from Sweet Planet by the Crystal Fox. Help Cakes complete their mission and find the sweet taste.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233248,"name":"Hidden Object: Hunter Secrets of Aztec and Mayan Tribes","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Hidden Object: Hunters Secrets Of Aztec and Mayan Tribes\nThe game has 50 levels in which you need to show the ability of mindfulness, agility, fast thinking, and precision of your actions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233249,"name":"Maze Forever","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Maze Forever gives you the benefit of countless hours of fun while polishing your puzzle solving skills. A beautiful minimalistic design helps you focus on the gameplay while enjoying each well crafted puzzle level. Golden coins are sprinkled in random locations and you’ll need to collect them to unlock special characters and maze themes. The ultimate goal is to access the worldwide leaderboards and show off to the world how good your puzzle solving skills are. Think you are smart enough to do it? There’s only one way to find out, install Maze Forever!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233250,"name":"Ridge Runner","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Ridge Runner is a game of reaction and skill as you try to escape the castle. Collect stars to unlock different characters including a knight on horseback, a fireman or even a selfie-obsessed teenage girl. Game features high quality 2D visuals, retro inspired custom soundtrack and a variety of fun characters to unlock.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233251,"name":"Return to Abyss","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Return to Abyss is a mowing survival game with Rogue-Lite elements, upgrade your weapons and use your fighting skills to fight through over 10,000 monsters on screen until defeat the culprit who broght chaos!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ua.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Joychasing Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":233252,"name":"Bat of Dead","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You are waiting for adventure and emotion. 2 for the price of one.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ud.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233253,"name":"Forest of Frequencies","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Step into a world where music, magic and nature collide.\n\nForest of Frequencies is a single player music adventure strategy game where you can explore a world filled with dangerous creatures, breath taking flora and spirits looking for their bodies. Music, visual art & gameplay comes together to form a unique experience made for those who love the interplay and combination of art forms.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61uc.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Dapper Pigeon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233254,"name":"Fly!!!","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Do you like flying in the blue sky? If you like flying feeling, play with the Ostrich and learn to fly with him.\nFly to earn money, buy rockets and glider wings to fly further.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233255,"name":"BattleSquared","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"BattleSquared is a fun turn-based pass and play game that relies heavily on both strategy and luck. Your objective is to eliminate the entirety of your opponents forces by finding items throughout the map and utilizing them against your opponent while simultaneously avoiding environmental roadblocks.\nDodge strafing runs, mortar shells, and enemy gunfire all while trying to hunt down weapons and armor to defeat your opponent!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233256,"name":"Dragon Scroll","genres":[],"avg_score":0.0,"description":"A true warrior is the one who is capable to understand the quests of life in every situation. Find the warrior within yourself. Inspired from pool, Dragon Scroll gives you a striker marble and your aim is to collect all the target marbles on the screen. There will be obstacles, some you must avoid and some you may use.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233257,"name":"Pixa","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Do you love classic video games from the 8-bit era? Do names like \"Pitfall,\" \"Combat,\" \"Adventure,\" or \"Haunted House\" bring back warm memories of fuzzy televisions and pixelated landscapes? Pixa offers all the nostalgia of an 8-bit classic with all the polish and depth of a modern hit. It will take you on a smile-inducing quest in true old-school style. Simple. Classic. Engrossing. Try it now!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233258,"name":"Pixelogic","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Pixelogic is a fun and challenging puzzle game where you use logic to reveal a hidden picture made of colored cells. Like a mixture between sudoku and minesweeper, numeric hints are used to uncover a pixelated surprise.\nPixelogic is based on a japanese logic game commonly referred to as Picross, Nonograms, Griddlers, Pic-a-Pix, Hanjie and Paint by Numbers.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233259,"name":"Hidden Object: Adventures Duke of Richelieu","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A new story in the style of Hidden Object. In 1734, the Duke of Richelieu tries to seize the throne of the King of France. The Musketeers of the King of France Louis do not allow to capture the throne of King Louis. Help the Musketeers of the King of France Louis is not true of the plans of the Duke of Richelieu\nEnter lush paintings and meet fantastic characters in mysterious world. Original music score composed specifically for each area of the adventure.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233260,"name":"Super Quest","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"You can go on an adventure with just one finger in your spare time. Explore dungeons to slay monsters, level up, go to towns & buy equipments, then defeat boss!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233261,"name":"Pocket Claw","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A cute claw machine in your pocket!\nIntroducing the free claw machine, Pocket Claw from Magic Cube!\nThe characters of the popular games of Magic Cube are appeared as a toy in the Claw Machines.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233262,"name":"Black Eye","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Play puzzle game to earn points and collect \"Eyes\" for the game \"Capture The Flag\".\nPlay multiplayer stratygy game \"Capture The Flag\" to beat your friends or other people playing this game and conquer more \"Eyes\".\nBoth games have animated Tutorials.\nMore Games:","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233263,"name":"Soccer Match","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Test your reaction and agility in this exciting soccer themed swap and matching game, featuring three different and addictive modes. Use awesome power-ups to help you along, and play through numerous soccer packed levels as you try your hardest to be top of the league.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233264,"name":"Madness/Endless","genres":[],"avg_score":0.0,"description":"Darkness, despair, challenge... The world as we know it is run over by eldritch monstrosities. Survivors are few and far between, stuck between living in this new, grim world and scheming to overthrow others. You have been chosen to bear the greatest burden - the Herald’s Blade. Are you going to help your covenant or take over as the new overlord? Do you really have a choice?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7fx3.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233265,"name":"Dante's Quest","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Darkness has fallen on princess Emilia’s castle. The evil king has sealed away all life and locked everyone in the castle walls. In her moment of need, Emilia calls to Dante, her loyal knight, to save the castle and defeat the king! Do you have what it takes to defeat the darkness and save Emilia’s castle?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233266,"name":"Front Mission: 1st Remake - Limited Edition","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null}],"avg_score":0.0,"description":"The Front Mission 1st Limited Edition includes:\n- The base game\n- 2 lithographs\n- An exclusive lenticular box\n- A printed game manual","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7qz6.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Forever Entertainment S. A.","games":null},{"id":0,"name":"Microids","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":233267,"name":"Coffee Talk: Episode 2 - Hibiscus & Butterfly: Collector's Edition","genres":[],"avg_score":0.0,"description":"Each copy of the Collector's Edition includes:\n\n- A physical copy of the game\n- Acrylic Standee w/ 6 changeable café-goers\n- Double-sided Tote Bag\n- Mini Comics Collection\n- Tea Towel\n- Wooden Charm\n- Memo pad featuring characters from the game\n- Sticker Sheet (11 Stickers)\n- Soundtrack Download Card\n- Collector's Edition Box","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6sqz.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":233268,"name":"Coffee Talk: Single Shot Edition","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two.\n\nSingle Shot Edition includes:\n- Physical Game\n- Soundtrack download card\n- Wooden charm\n- Sticker Sheet","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7n71.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Toge Productions","games":null},{"id":0,"name":"Chorus Worldwide","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":233270,"name":"Coffee Talk: Episode 2 - Hibiscus & Butterfly: Single Shot Edition","genres":[],"avg_score":0.0,"description":"Each copy of the Single Shot Edition includes:\n\n- A physical copy of the game\n- Wooden Charm\n- Sticker Sheet (11 Stickers)\n- Soundtrack Download Card","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6rlx.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Chorus Worldwide","games":null},{"id":0,"name":"Toge Productions","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":233271,"name":"Coffee Talk: Double Shot Edition","genres":[],"avg_score":0.0,"description":"Each copy of the Double Shot Bundle includes:\n\n- A physical copy of each game\n- Bundle-exclusive Coffee Mug\n- Bundle-exclusive Embroidered Patch\n- Acrylic Standee w/ 6 changeable café-goers\n- Double-sided Tote Bag\n- Mini Comics Collection\n- Tea Towel\n- 2 Wooden Charms\n- Memopad featuring characters from the game\n- Sticker Sheet (11 Stickers)\n- Sticker Sheet (9 Stickers)\n- A Soundtrack Download Card for each game\n- Collector's Edition Box","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7738.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Toge Productions","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":233272,"name":"Fairy Fencer F: Refrain Chord - Day One Edition","genres":[],"avg_score":0.0,"description":"Fang and the gang return in this all-new Tactical RPG, directly connected to the story of Fairy Fencer F: Advent Dark Force. Fang and the others run into a mysterious woman named Glace, who has the ability to brainwash other people with her song. Another woman named Fleur joins their party, who also has the power of song. The two are known as Muses, and are able to boost or change other peoples’ abilities with the power of singing. ​ What could Glace's motives be?​","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ryz.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":233275,"name":"The Archipelago Promise","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Explore a forgotten Archipelago deep in the Bering sea. Sail the cold seas, learn about the environment, evade the dangerous wildlife, and survive the harsh Alaskan weather to find your lost brother.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8702.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Breda University of Applied Sciences","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233276,"name":"RPG Architect","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"“RPG Architect has been in development for almost two years, but can already produce a number of simple, playable games. We have been on the Patreon platform for almost half a year (and in private testing for a year and a half) with a number of people asking for a true \"release\" on a larger platform. Steam Early Access offers us a better way of distributing RPG Architect to a larger group of people.\n\nRPG Architect's goal is to make a game development environment, inspired by the community. As such, we want the wider community to help shape how RPG Architect gets to its full Release version, as well as beyond!”","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ul.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233277,"name":"LEGO Legends of Chima Online","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Explore the vast and dangerous World of CHIMA ruled by animal warriors in the brand new, free-to-play LEGO Legends of CHIMA Online game. Play co-operatively with friends or venture out as the solo hero in an action-packed multiplayer adventure game based on the highly popular toy line and cartoon series from the LEGO Group! Choose from the Lion, Eagle, Gorilla and Bear tribes and customize your very own warrior. Smash LEGO objects to collect studs, bricks and special items. Build and expand your Outpost to craft powerful weapons, armor, powers and gear to defeat the Croc, Raven, Rhino and Wolf tribes. Solve fun puzzles, complete challenging missions, and unleash the power of CHI in epic battles!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61um.jpg","releaseYear":2013,"developers":[{"id":0,"name":"WB Games Montréal","games":null},{"id":0,"name":"Warner Bros. Interactive Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"iOS"}]},{"id":233278,"name":"Do Not Fall: Run For Your Drink","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Do Not Fall is an intense and thrilling action-platform game. Playing as a fearless adventurer who lives inside a special vending machine, you will go through seven different adventure worlds to collect enough ingredients to produce and dispense the drink for the machine! It might sound and look easy, but player will need to prove their reflex is quick enough to avoid disappearing tiles, obstacles, and traps along the way. The player will do whatever it takes to avoid being knocked off or drop from the surface! Multiplayer is also available if you want to take your skills to challenge other players in different multiplayer game mode. So gather your friends and start an awesome battle to see who will be the king “on”the floor. You can run. You can dash. You can jump. However, whatever you do, DO NOT FALL!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61un.jpg","releaseYear":2013,"developers":[{"id":0,"name":"XPEC Entertainment Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233280,"name":"Ford Racing: Full Blown","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ford Racing: Full Blown is a racing game released by Sega in 2006. The game is an arcade port of the 2005 console and PC title Ford Racing 3 (also developed by Razorworks but published by Empire Interactive) but with some adjustments made for arcade play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co856z.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Sega Corporation","games":null},{"id":0,"name":"SEGA Amusements Europe","games":null},{"id":0,"name":"Razorworks Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233281,"name":"Frenzy Express","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Frenzy Express is a fast-paced simulation game that builds on the worldwide fad \"Scooters.\" The machine's biggest feature is the level of interaction the player gets.\nThe machine contains a actual scooter which the player uses to travel around the stages. The handlebar enables the player to steer and the brake is locate at the back of the scooter. Acceleration is achieved by a wheel with grips, which is located on both sides of the scooter. The player push off the wheel much like he/she would push off the ground if you were riding a real scooter.\n\nGameplay is similar to Crazy Taxi, except instead of picking up and dropping off passengers, the player is a courier and must pick up and drop off packages. The way you reach the drop off point is entirely up to the player, but there is a time limit and each second that ticks by means less money at the drop off point.\n\nTo make the game more fun, there are many ramps and other objects suitable for jumping and performing aerial acrobatics which earns the player bonus points.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8op5.jpg","releaseYear":2001,"developers":[{"id":0,"name":"Innovative Concepts In Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233282,"name":"Gaelco Championship Tuning Race","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Gaelco Championship Tuning Race is a car track racing game where players race their cars around a circuit. There are several tracks to choose from, and players can tune their car to personalise them and enhance them.\n\nThere are two modes: Arcade Race, where the player will race against other cars (human or computer opponents) and Tournament Time Attack, where the player can race alone to score their best possible lap time. Players can choose from four different cars and four different racetracks. The four different circuits vary in difficulty and players can choose dry, variable and wet weather to race in for each of the tracks. Players accumulate points during their race and may use these points to buy accessories with which to tune their car.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61us.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Gaelco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233283,"name":"Ghost Squad Evolution","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ghost Squad Evolution is a follow up to the 2004 game Ghost Squad. It was released for Lindbergh Red hardware in 2007. Improvements over its predecessor include additional weapons, costumes and more difficulty levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ekm.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Sega Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233284,"name":"Hummer Extreme Edition","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Hummer Extreme Edition is an update to Hummer, and was released by Sega for Sega Lindbergh arcade hardware in 2009.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61uu.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233285,"name":"K.O. Drive","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Back in 2012, Sega unveiled a new combat driving arcade game called KO Drive at the DEAL 2012 trade show in Dubai. Afterwards, the game made an occasional appearance at other trade shows, but ultimately was cancelled. This easy to pick up battle-racing game has been designed with multiplayer action in mind. Tracks include London, Vegas, Shanghai, Toronto, Cairo and Rome.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61uv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233286,"name":"Let's Go Safari","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Let's Go Safari, is an educational arcade game which teaches young children about wildlife. It is part of the Let's Go! series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61uw.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Sega Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233287,"name":"Otoshu DX","genres":[],"avg_score":0.0,"description":"This expanded sequel of Sound Shooting!! features all of the original game's songs along with new songs and updated gameplay. Like the original game, this blends sidescrolling arcade shooting and rhythm gameplay; this time, the rhythm game sections feature extra lanes for added difficulty.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ux.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233288,"name":"Hanabi Zekkei","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Hanabi Zekkei is based off a real Japanese slot machine, emulated to run on mobile.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61uy.jpg","releaseYear":2022,"developers":[{"id":0,"name":"UNIVERSAL ENTERTAINMENT CORPORATION","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233289,"name":"Sonic Dash Extreme","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sonic Dash Extreme is an arcade version of the mobile phone game, Sonic Dash, developed by Sega Amusements and released by Sega. The arcade version features daily and all-time leaderboards and different control methods for large-sized d-pad controllers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8yqy.jpg","releaseYear":2015,"developers":[{"id":0,"name":"Hardlight","games":null},{"id":0,"name":"Sega Amusements International","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233290,"name":"Trouble Witches AC","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Trouble Witches AC is an arcade-exclusive update to the original Trouble Witches. It features streamlined gameplay, removing the non-arcade oriented gameplay from the original PC game along with some balance and gameplay refinements. It also adds several new characters and integrates them into the plot.","imageUrl":"Sin imagen","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233292,"name":"Wartran Troopers","genres":[],"avg_score":0.0,"description":"Wartran Troopers is the sequel to World Combat (Warzaid).\n\nGame Play:\nIt is a different story then the first version. Player needs to equip up with a huge range of weaponry found on the battle field. It's the only chance of tackling the vast range of enemies. Each player will have their own skills and attacks. The rapid machine guns can take down infantry.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61v2.jpg","releaseYear":2004,"developers":[{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233293,"name":"Yu-Gi-Oh! 5D's Duel Terminal 6","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"The Duel Terminal was designed by Konami to assist in introducing the then new Yu-Gi-Oh! 5D's anime to new and existing players. The Duel Terminal itself looks like a traditional arcade machine and has a variety of game modes, using cards from the Yu-Gi-Oh! Official Card Game. Players can either use a Deck chosen by the system, or the Duelist can use his/her own cards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61yb.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":233294,"name":"Sandbox War Dispatch","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"An rts 1v1 battle game, the background is the sandbox simulation of modern military warfare. You can command the coordinated operations of sea, land, air and space, play tactics freely, and experience military art, to fight until the enemy's capital is destroyed to win;","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61v5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233295,"name":"Doomsday Fodder","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Get yourself a Hero Squad and survive huge waves of enemies, trying to break the game with mindful choices. DOOMSDAY FODDER combines rogue-lite, autochess, bullet-hell and survival elements in a unique blend of action and strategy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co64ec.jpg","releaseYear":-1,"developers":[{"id":0,"name":"MoreGames Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233296,"name":"Hartenjagen","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"A variation on the popular card game Hearts, literally translated from Dutch as \"Chasing/Hunting Hearts\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co82if.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":233297,"name":"Crank Tanks","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A new take on the classic artillery game genre","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co709j.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":233298,"name":"Gravity Express","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"In Gravity Express, you battle gravity while transporting cargo through abandoned mines.\n\nClients will demand speedy delivery, fuel economy, and won't be paying for your funeral. You better find your way fast while avoiding the rocky walls, magnets and cannons that spell your doom.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ht3.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Nino van Hooff","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":233299,"name":"Pocket Vikings","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233301,"name":"Bento Fujiyama Tamagoyaki","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7yzc.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Pygmy Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Vita"}]},{"id":233302,"name":"Zombies Rocket Boom Boom","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Welcome in this casual game of Zombies Rocket Boom Boom.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co65ec.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233303,"name":"Bunny Hop Hare Trigger","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Hone your movement skills and strive for the fastest times in this speedrunning/parkour platformer!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61vc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233304,"name":"Hadelia Quest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Hadelia Quest is a Japanese fantasy RPG.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62va.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233305,"name":"Dodge It! Online","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"In this online competitive game, you will have to do your best to survive as long as possible by dodging balls that can kill you in no time!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7gtx.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233306,"name":"Super Jigsaw Puzzle: Generations - Random 5","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Puzzles of incredible random images!","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233307,"name":"Shadow Gambit: The Cursed Crew","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Welcome to the Lost Caribbean! In this stealth strategy game, join a ghost ship with a living soul and assemble a cursed pirate crew. Embrace magical powers to defy the menacing army of the Inquisition, who stands between you and the mysterious treasure of the legendary Captain Mordechai.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67is.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Mimimi Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233308,"name":"Peak.53","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Peak.53 is a tactical shooter developed by Dirty Bird Games - bringing back close-quarter fights, skill-based tactical combat, nostalgic inspired gameplay, and unique team communication.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co625g.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Dirty Bird Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation"},{"id":0,"name":"SteamVR"}]},{"id":233309,"name":"Get Mouse","genres":[],"avg_score":0.0,"description":"Get Mouse is a mouse-feeding puzzle game by Sen (MouSe) made in Wolf RPG Editor. A simple ten-minute game with 8 stages where you have to get the mouse his cheese.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61vt.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Sen","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233310,"name":"Grabe 4x4","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Grabe 4x4 is a beat 'em up game where players must fight in the Philippines and outsmart their enemies by selecting the correct two attacks out of the four available buttons on the controller.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62gj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233311,"name":"Death By Misstep","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Death By Misstep is an upcoming First-Person Rhythm, Stealth and Horror game set on a party cruise where a massive massacre by robots is happening.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61w3.jpg","releaseYear":2025,"developers":[{"id":0,"name":"Misstep Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233312,"name":"Spider-Cube","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Play as a Spider-Cube and Jump on the Platforms!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61w0.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233313,"name":"4=10","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"4=10 is a casual number puzzle game for both young and old.\nThe goal is to create an expression with 4 given numbers equal to 10. For example 1+2+3+4=10\nThe game uses only basic math and starts off easy, gradually becoming more difficult. Hopefully players should also become better at it.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wd.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233314,"name":"Mario vs. Donkey Kong e+: Tobiori Chuui!","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"One of the levels released for Mario vs. Donkey Kong via e-Cards in Japan. It was released at the 20th Next Generation World Hobby Fair on e-Card ID 18-M001. It was given to attendees at the event, being very rare. It was not released in the Mario vs. Donkey Kong e+ set.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wh.jpg","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233315,"name":"Apple Bowl","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Apple Bowl is a 1-player bowling game for the Apple II.\n\nPlayed from a 1st person perspective at a bowling alley, the player bowls in lane, while occasionally another member at the bowling alley will bowl in lanes. A throw indicator scrolls slowly along the bottom of the screen, and the player starts their bowl when the ball is in their preferred position. The player controls the power and spin of the ball using the game paddles, and the game attempts to accurately simulate the physics of bowling. Follows standard 10-pin bowling rules with a total of 10 frames of bowling.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wf.jpg","releaseYear":1979,"developers":[{"id":0,"name":"Apple Computer","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Apple II"}]},{"id":233316,"name":"Mario vs. Donkey Kong e+: Nagaai Michinori","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"One of the levels released for Mario vs. Donkey Kong via e-Cards in Japan. Released through CoroCoro Comic sweepstakes on e-Card ID 18-M003.","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233317,"name":"Mario vs. Donkey Kong e+: Athletic","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"One of the levels released for Mario vs. Donkey Kong via e-Cards in Japan. Released through CoroCoro Comic sweepstakes on e-Card ID 18-M004.","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233318,"name":"Gotris","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Gotris is the impossible mix of the ancient game of GO and the mighty Tetris. Surround pieces from one colour with the ones of the other colour in order to clear them and earn points!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61w9.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Tuxedo Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Master System/Mark III"}]},{"id":233319,"name":"Mario vs. Donkey Kong e+: Dossun no Toride","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"One of the levels released for Mario vs. Donkey Kong via e-Cards in Japan. Released through CoroCoro Comic sweepstakes on e-Card ID 18-M008.","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233320,"name":"WekaInvaders","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Each one of Weka Invaders' 40 levels consists of a certain number of blocks which hide several Wekas that will eventually emerge and chase Waimanu, and even shoot at him sometimes.\n\nWaimanu should drive each Weka out of the blocks and eliminate them before the time runs out. Wekas can be eliminated by either shooting at them or by shaking them off the floor.\n\nPoints are awarded for each block destroyed and for each eliminated Weka. Also, points are given for destroying the passing UFO, for powerup pickups and for each second left after completing the level. An additional life is awarded when 25,000 points are reached and you can earn one more life every additional 50,000 points after that.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wa.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Disjointed Studios","games":null},{"id":0,"name":"SMS Power!","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Master System/Mark III"}]},{"id":233321,"name":"Mario vs. Donkey Kong e+: Dangerous Flowers","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"One of the levels released for Mario vs. Donkey Kong via e-Cards in Japan. Released through CoroCoro Comic sweepstakes on e-Card ID 18-M010.","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233322,"name":"Mario vs. Donkey Kong e+: Laser Panic!","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Released through CoroCoro Comic sweepstakes on e-Card ID 18-M011.","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":233324,"name":"Venator","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"The von Penumbrus are famous parapsychological hunters fighting mummies, vampires, ghosts, werewolves, ... since several generations. But... the youngest member of the family, Gilbert, is not really a promising hunter. He is rather lazy, determinedly peaceful, not really very bright... and after some painful training sessions, this is the night of his first hunt.","imageUrl":"Sin imagen","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233325,"name":"Vestigial","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sometimes, nightmares follow us into the waking world, leaving us with only pieces of ourselves. Better get back to where you belong before your pieces run out.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[{"id":0,"name":"Rabbit Run Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233326,"name":"Vor Terra","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In Vor Terra the player takes on the role of a Knight, who is attempting to restore order to his land and become its ruler, after the old King died and the kingdom turned into a wasteland in chaos, it's inhabitants now suffering from plagues, thieves and monsters.","imageUrl":"Sin imagen","releaseYear":1996,"developers":[{"id":0,"name":"Softdisk Publishing","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"DOS"}]},{"id":233327,"name":"Wake Up","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Have you ever been stuck in a nightmare? No? This time you did. Try to find a way to wake up.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"Ludzik","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233328,"name":"Wanderers","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A short story with quick battles! Wander around, fight monsters, drink beer, make a friend.","imageUrl":"Sin imagen","releaseYear":2021,"developers":[{"id":0,"name":"Phantogast","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233329,"name":"WarWizard","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"WarWizard is a role-playing game in a medieval fantasy setting. The player takes on the role of a WarWizard, a powerful character skilled both in combat and magic arts.\n\nAs the story goes, a Dark WarWizard rose to rule the land. It is the player's task to recover the Ancient Armor that was used to defeat the previous dark WarWizard, and rid the land of the current menace. The player starts alone and must build up his skills and acquire equipment and resources. Eventually, up to three other characters may join the player's party.","imageUrl":"Sin imagen","releaseYear":1993,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Amiga"},{"id":0,"name":"DOS"}]},{"id":233330,"name":"Welcome Azrael","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An alleged time traveller was found trespassing on private property in the region of Anthem and is now incarcerated in a Police Department in Phoenix, Arizona.\n\nOn your first day of fieldwork, you were given the task to scour through his digital belongings to find the source of the man’s apparent unbalance.\n\nA colleague of yours from the Police Department sent you some valuable exhibits to start with; the inmate seems physically constrained in relation to disclosing his computer’s password. And no one could hack into the system by any means.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"LibanioL 28H","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233331,"name":"What I Heard","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are a Lady’s maid to Lady Catherine Holloway, the daughter of a wealthy and locally prominent family in the village of Thrumshire.\n\nLady Elizabeth Holloway, Catherine’s mother, has been taken ill, much to the suspicion of Lady Catherine. You are asked to a private meeting where she tells you of her suspicions, she believes her mother is being poisoned by someone in the house.\n\nYou are to interrogate the staff, listen to household conversations and find clues, you have 3 days to find out as much as you can, then you must accuse someone of the crime.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"Abstract Machine","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233332,"name":"Kodama Battles","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Kodama Battles is a singleplayer AutoChess Roguelite with a jolly bunch of Kodamas to collect, gather and upgrade. Build an unique team with unexpected synergies, try new playstyles each run and become king of the moonlight forest.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6y7p.jpg","releaseYear":2023,"developers":[{"id":0,"name":"BOING BOING GAMES","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233333,"name":"Where Did the Humans Go?","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"A pilot descends on a planet where something strange is going on. When he arrives at a scientist's camp, there's no trace of humans. Only robots are left and their behaviour is strange. Where did the humans go?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co99bs.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Lorenzo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":233334,"name":"Where's Mom","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Peacefully in the autumn forest lives you, mom and sick sis.\nOne day you must watch over your sick sister so mom can leave to brew a potion for her. But she never comes back, where's mom?","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"BitCave","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233335,"name":"Winchester","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Annabelle is on her way home to San Francisco when she crashes her car. Her injuries lead her to the house, and the history of all that has happened within. Mrs. Hannover lives here, and has forced her help onto Annabelle. The house is off-putting and soon reveals its secret history to Annabelle, who becomes increasingly desperate to escape.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[{"id":0,"name":"Vandehigh","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233336,"name":"The Winter Rose","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"An evil ice-dragon has settled in once lush and forested land, blighting it with eternal winter. Only a young archer has the determination -and the wits - to end his wicked reign of terror. Help Rose through this epic quest.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co98pd.jpg","releaseYear":2005,"developers":[{"id":0,"name":"BaRon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233337,"name":"Wraith","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null}],"avg_score":0.0,"description":"Wraith is a fantasy role-playing game like the author's previous effort Shadowforge, although it's set in a larger, more detailed world with an updated and expanded rule system. The worship of Metiria is being subverted all over the realm of Araithia; lords and commoners have turned their devotion to a newly-arrived evil power, the Wraith, whose monstrous armies now infest the island. You, guardian of the last Temple of the True Faith, are summoned to seek out and eliminate this evil.","imageUrl":"Sin imagen","releaseYear":1990,"developers":[{"id":0,"name":"John Carmack","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Apple II"}]},{"id":233338,"name":"The Yellow Rose Motel","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The yellow rose motel is a ps1/VHS style low poly psychological thriller set in a mysterious motel designed to leave your soul terrified.\n\nAfter a long day of work and stress John (player) arrives in a place called Yellow Rose Motel, which at first seems like a family-friendly loving place turns into a nightmare in less than a day.","imageUrl":"Sin imagen","releaseYear":2021,"developers":[{"id":0,"name":"DarkDayAfternoon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233339,"name":"Azure","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In this near-future 3D first-person action shooter, you play a gun for hire, piloting a bipedal mech to tear down the enemy frontlines. Your missions involve on-rails segments where you shoot foes using a reticule, plus off-rails maze exploration with combat and collectibles. Can you survive this mechanized war, protect your companions, and seize victory?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wy.jpg","releaseYear":1993,"developers":[{"id":0,"name":"Family Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"FM Towns"}]},{"id":233340,"name":"Yggdrasil Chronicles: A Tale of Cindrivia","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Hundred years ago, The Illuminati Order, originally formed by a demon named Lucifer, plunged the whole world into Chaos. With his mighty power, he slowly corrupted this living world, driving the humanity to an extinction. Fortunately, six remarkable warriors, calling themselves Warriors of The Holy Alliance, possessed the power of faith and justice, stood against The Illuminati as the last hope of Cindrivia. With the help of the Heavenly Artifacts sent down by Aina The Goddess of Night, they finally put an end to Lucifer and his Illuminati Order. The world of Cindrivia then found peace again for decades. Many years have passed, and now The Illuminati Order is about to raise again, lead by a mysterious wizard so-called Ryan The Illuminator. The existence of Cindrivia and even The Yggdrasil Tree is in danger one more time.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[{"id":0,"name":"Ryan Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233341,"name":"Massive Cleavage vs Zombies","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"It's a zombie apocalypse horror story, told through arcade style fighting, and cut scenes. Your character wanders the city in search of supplies for her people, using only her massive cleaver. Every place she goes she leaves behind piles filled with hundreds zombie corpses.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61wz.jpg","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":233342,"name":"You Just Died","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You Just Died. In this game you play as Davey. He wakes up in his childhood home, it's different, yet familliar. Where will he end up while wandering through this dreamy interpretation of the afterlife? And will you find out the dark truth about his past?\n\nKeep your eye's open, you won't see everything on the first playthrough...","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"CheesyKirah","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233343,"name":"Ultimate Doom the Way id Did","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A custom Doom 1 level pack released in 2019 that takes over the Episode 4 slot of The Ultimate Doom. Created by various mappers from the Doom modding community, 'Ultimate Doom the Way id Did' is an attempt at replicating the style of the various mappers that contributed to the original Episode 4 of Doom and its difficulty.\n\nThis level pack is 9 maps long, and occupies the entirety of Episode 4. No other new maps occupy the first 3 episodes, and this can be seen as an expansion to 'Doom the Way id Did', released in 2011.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x0.jpg","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233344,"name":"You and the Night","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are traveling alone - just you, your broken car, the fog and the dull countryside. You are tired and you take a break in a small family hotel. You're engulfed in silence - you sit and wait like you always did - it's just you and the night.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[{"id":0,"name":"mjessen86","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233345,"name":"The Never Ending Game","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Play this addicting and never ending game! Good luck with this crazy challenging game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x1.jpg","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":233346,"name":"You Just Don't Get Stars Like These Back Home","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Explore a campground and night and try to find the darkest spot, so you can see the most stars in the sky.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"MrTheKunzer","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233347,"name":"Really Scary","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Explore a real world haunted house. Avoid possessed teddy bears and twisted monstrosities. Solve puzzles and search for clues. Will you unravel the mystery before your fragile mind collapses into insanity? Probably not.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x2.jpg","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox 360"}]},{"id":233348,"name":"Lootfest2","genres":[{"id":0,"name":"MOBA","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Lootfest is back for everyone who loves classic adventure games. With more monsters, weapons, missions and of course - more loot! Explore a large world with your friends, using an easy drop-in multiplayer. Any combination of split screen and online gameplay is supported.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x3.jpg","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":233349,"name":"GOG Collection Shooter Pack","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233350,"name":"Kingdom's Life","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233351,"name":"Dungeon of the Endless: Definitive Edition","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233352,"name":"GOG Adventure & Puzzle Bundle","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61x7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233353,"name":"Colors: Zero","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Colors:Zero is an interactive storytelling set in a neo noir universe. You will play as a detective and will be assigned to investigate about strange murders.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6zmj.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Cid","games":null}],"libraryGames":null,"platforms":[]},{"id":233354,"name":"Zealot","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"You have been summoned by your Masters to perform the final ritual atop the Eternal Peak. Survive hordes from the space between the stars, using your reflexes and shooting skills until the Ritual is complete. Do not fail your Masters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7vce.jpg","releaseYear":2016,"developers":[{"id":0,"name":"ToothandClaw","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233355,"name":"MX vs. ATV: Legends - Yamaha Pack","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Start your engines! Purchase the Yamaha Pack and experience real off-road riding!\nThis pack includes the following vehicles:\n\nYamaha YZ250F MX\nYamaha YZ450F MX\nYamaha YZ250 MX\nYamaha YZ450 MX\nYamaha YFZ450R ATV\nYamaha YFZ450R SE ATV","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xa.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"}]},{"id":233356,"name":"MX vs. ATV: Legends - Honda Pack","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Start your engines! Purchase the Honda Pack and experience real off-road riding!\nThis pack includes the following vehicles:\n\nHonda CR 125R MX\nHonda CR 250R MX\nHonda CR-F250 MX\nHonda CR-F450 MX\nHonda TRX450R ATV","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xb.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"}]},{"id":233357,"name":"Train Sim World 3: Bahnstrecke Bremen - Oldenburg","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Take a trip to the late 2000s and experience frequent passenger and heavy freight services, be in control of classic and modern traction as you traverse through the heart of Northern Germany. Electric Containers and Karlsruher Kopf n-Wagens await in Train Sim World 3: Bahnstrecke Bremen - Oldenburg.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xc.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"}]},{"id":233358,"name":"Little Mouse's Encyclopedia: Premium Edition","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Little Mouse's Encyclopedia is ideal for born explorers. Wandering around the lively boards, you’ll find animals and plants by yourself. Using a magnifying glass, you can reveal cards that contain interesting information and drawings.\n\nWith a brave mouse, you’ll explore the area around its burrow, walk through the forest, sneak through the garden and swim in the pond. In each of these places, unique species of animals and plants await you. During your wandering, you’ll come across over 160 unique species, about which you can learn something interesting.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co624t.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":233359,"name":"Montezuma's Revenge","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is the official version of the 80's classic game Montezuma's Revenge rebooted by the original developer. It's the classic puzzle solving action adventure platformer you loved in your youth.\n\nUnlike the switch port, this port adds a \"Modern Mode\" visuals.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co63c7.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Normal Distribution LLC","games":null},{"id":0,"name":"Normal Distribution LLC","games":null},{"id":0,"name":"Parker Brothers","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"Mac"}]},{"id":233360,"name":"Trainz Railroad Simulator 2022: Qube GE C44aci Pack","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The C44aci is a model of Australian heavy duty diesel electric locomotive designed by UGL Rail and built at the Broadmeadow factory. It is operated by a number of rail freight operators. The design is based on the National Rail NR class but with some modifications and upgraded features.","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":233361,"name":"Trainz Railroad Simulator 2019: ANR DL Class Australian National Pack","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Built between 1988 and 1990, the Australian National DL class locomotives were introduced for both passenger and freight service across Australian National's standard gauge network from Adelaide to Broken Hill, Alice Springs, and Kalgoorlie. This pack features 4 versions of the class in AN livery.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ivc.jpg","releaseYear":2023,"developers":[{"id":0,"name":"N3V Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233362,"name":"Trainz Railroad Simulator 2022: ANR DL Class Australian National Pack","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Built between 1988 and 1990, the Australian National DL class locomotives were introduced for both passenger and freight service across Australian National's standard gauge network from Adelaide to Broken Hill, Alice Springs, and Kalgoorlie. This pack features 4 versions of the class in AN livery.","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233363,"name":"Trainz Plus: ANR DL Class Australian National Pack","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Built between 1988 and 1990, the Australian National DL class locomotives were introduced for both passenger and freight service across Australian National's standard gauge network from Adelaide to Broken Hill, Alice Springs, and Kalgoorlie. This pack features 4 versions of the class in AN livery.","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":233364,"name":"Dinogen Online","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Action-packed 2D multiplayer top-down shooter. Play as a human or dinosaur with hundreds of weapons, game modes, and maps!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bav.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233365,"name":"Pattaya","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This is an AVG, a GALGAME, a visual novel, a funny and hilarious game. In this game, our protagonist Dude and his friend Jimmy will go together to visit the charming streets, pubs, yoga studio, massage shop and hotel of Pattaya, Thailand.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co659l.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233366,"name":"Backrooms: Apprehension","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A terrifying and immersive multiplayer horror experience with social deduction elements. Survive as a scientist stuck in the Backrooms, just be very careful who you trust, someone is not what they seem!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6mgi.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233367,"name":"Square Life","genres":[],"avg_score":0.0,"description":"Why do you need the company of beautiful women to do a simple thing?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62vg.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233368,"name":"This This Rice","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Simulator game made in Hong Kong.\nPack the lunch box.\nTake the money.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233369,"name":"Your Train","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This is a simulation game of driving a train to transport customers on a Japanese railroad line.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xj.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":233370,"name":"Pottery","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Pottery is a VR simulator that makes everyone feel like a real potter. The simulator reproduces the main stages of the production of pottery: the selection and preparation of clay, the creation of a workpiece blank, the processes of drying, painting, firing and glazing the product.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233371,"name":"Boundary Walls","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Overview: You are a source of light trapped inside walls and you need to escape from these walls surrounded by various traps, but how? The light sources you find around open a gateway for you to move on to the next level, and you can only get out of here by collecting them.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233372,"name":"Bad Cat Sam","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The cat, named serious Sam, is very upset when the house is in order and everything is in its place. Help Sam get inner peace.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62b3.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":233373,"name":"Rogue Planet 1: Consolidation","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A standalone expansion to the original game, set 2 years after the original. The climactic finale and final chapter of the first game. Your interpetation of the truth will affect the world around you, and more importantly, the people living in it. Be careful. Imaginations can be powerful things...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co99hl.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233374,"name":"Zog Moonbuckle: The Mysterious Planet","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"During a journey home from the far reaches of space, you are forced to crash-land on a mysterious planet not on any of your star charts. Faced with the challenge of repairing your damaged spaceship, it soon becomes clear that you've become involved in something altogether more interesting...","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233375,"name":"Quick Rally","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Quick Rally.\nAn arcade casual fastest time chaser.\nCompete on the leaderboard against friends or anyone in the world to set the fastest time on each track.\nA weekly challenge track, with a new track each week and a fresh clean leaderboard to compete for the best time.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233376,"name":"Chessplode","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233377,"name":"Tycoon Idle: Business Master","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233378,"name":"Merge Master: Super Dragon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233379,"name":"Man, I Hate That Indie Game!","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Some cute girls who are interested in indie games are in need of your help! Do you love indie games enough to be useful? Choose your route carefully, and you may end up a winner!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61xp.jpg","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox 360"}]},{"id":233380,"name":"Farm Harvest","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233381,"name":"Baby Panda's Birthday Party","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233382,"name":"Galaxy Storm","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233383,"name":"Basketball 1v1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233384,"name":"Drink Clicker: Idle Tycoon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233385,"name":"Train Station 2: Train Games","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"All the railway lovers, train collectors and train simulation enthusiasts who love everything rail transport related unite! It’s time to put your trains on rails and build a global railway empire. Become a railway tycoon and enjoy a beautiful train simulation journey full of surprises, achievements and challenging contracts.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233386,"name":"The Shooter Ball","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233387,"name":"Loki's Castle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233388,"name":"Rocket in Space: Running Games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233389,"name":"Space Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233390,"name":"EZ Knight","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233391,"name":"Dungeon Gunner","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Slay the diverse enemies you encounter while exploring the deep dungeons. A variety of equipment awaits that will make you more powerful. Grow stronger as you delve deeper into the dungeons and survive until you reach the very depths! How long can you last?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co889e.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233392,"name":"Mental Hero: Bipolar","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233393,"name":"The Termiraptor","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233394,"name":"Hero Wars: Fantasy Battles","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233395,"name":"Card Brawl: Dungeon Slayer","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Magical spires have risen across the land causing discord and chaos... No longer a mere shopkeeper, the fate of Aragonia now lies in your hands...\nChoose your path in procedurally generated dungeons and employ unique strategies with each playthrough! Slay your way to the Elite Boss at the end of each dungeon to unlock new cards for your collection and carve your name in history as the top ranked card brawler across Aragonia! Immerse yourself in a turn-based Roguelike CCG like no other, where you must randomly draft cards as you progress through each spire, testing the limits of your wit and skill with each battle.\nCollect powerful cards to create epic combos, wield masterful strategies by unlocking mighty heroes and their unique skills, gear up heroes with legendary equipment and turn the tides of battle across PvE and PvP by unleashing a well-timed spell! In Card Brawl you draft cards as you progress making each level more interesting than the last!\nWhat are you waiting for? Install Card Brawl for FREE to experience the mayhem of roguelike card battles and join the millions of players around the world in the Arena to forge your legacy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233396,"name":"Gunslinger: Zombie Survival 2019","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233397,"name":"Zombie Survival: Wasteland","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233398,"name":"Peece Maker","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233399,"name":"Left for Dead","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233400,"name":"Battle of Figures","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233401,"name":"Save Finn","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233402,"name":"Floppy Turd","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233403,"name":"Zen Idle: Gravity Meditation","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2019,"developers":[{"id":0,"name":"Tech Tree Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233404,"name":"Siege: World War II","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"PVP Card Battle game in World War 2. Build an Army and join the battle!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Imperia Online Ltd.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233405,"name":"Words With Friends Crosswords","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233406,"name":"Final Guardian","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233407,"name":"Call of Mini: Zombies 2","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The sequel to Call of Mini: Zombies.\n\nSecondary weapons and a combo system are here. Fight off hordes of zombies and take on powerful bosses to save the world again!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6nmv.jpg","releaseYear":2013,"developers":[{"id":0,"name":"Triniti Interactive Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233408,"name":"EF Defense","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233409,"name":"Shinkei Suijaku: Indo-hen","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233410,"name":"Puzzle Blox","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233411,"name":"Alien Tentacles: Attack Master","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233412,"name":"Little Panda's Jewel Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233413,"name":"Street Drag 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233414,"name":"Captain Tsubasa: Zero - Showdown! Miracle Shoot","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233415,"name":"Swipe Brick Breaker","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233416,"name":"Survival Fort","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233417,"name":"Doodle Mountain","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233418,"name":"Dodgy Carrot","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233419,"name":"Magic Pixel Survival","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233420,"name":"Tanks of Battle: World War 2","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233421,"name":"Laser Nodes","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233422,"name":"Spire Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233423,"name":"Beam","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co70xt.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233424,"name":"Farm King Saga","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233425,"name":"Clean and Bridge","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233426,"name":"Monster Planet 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233427,"name":"Sky Surfing","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233428,"name":"Merge Monsters","genres":[],"avg_score":0.0,"description":"Merge, Power up, Fight and Challenge yourself! Are you ready to join adventure of dungeon raid.","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233429,"name":"Animal Crush","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233430,"name":"Golf King: World Tour","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play on beautiful courses against rivals around the world in online battles! Win and collect trophies to unlock higher tours. Discover and upgrade golf clubs to improve your performance. Take on the daily and weekly leaderboards to win awesome prizes and glory. Play against your friends!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233431,"name":"Space BlocKing","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233432,"name":"Spiders: Cobweb Shooter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233434,"name":"Jewel Crush","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233435,"name":"Pop the Jewel","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233436,"name":"Snowy Leaps","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233437,"name":"Joyland: Horror Adventure Quest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233438,"name":"Farming Tractor Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233439,"name":"AncientsReborn","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233440,"name":"Dark Mine","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233441,"name":"Restaurant Diary","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233442,"name":"Gun vs. Bottles","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233443,"name":"Calculation King","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233444,"name":"LuckyJet","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233445,"name":"Spear Knight","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233446,"name":"Game After School","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233447,"name":"Mine Survival","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"How long can you survive? Don't Die! Don't Stop eating and drinking!\n\nThrough collections and hunting, you can create tools and buildings.\nThrough it Protect yourself from zombies and survive for a long time.\nAdapted to five mode environment, Create a space protecting yourself from zombies!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co86sd.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Wild Soda","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233448,"name":"Merge Castle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233449,"name":"Sky Utopia","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233450,"name":"Bash Arena","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233451,"name":"Gamer Cafe","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233452,"name":"Ancient Allies Tower Defense","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233453,"name":"Latto-Latto Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233454,"name":"Wild West: Hidden Object Games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233455,"name":"Ancient Relic","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233456,"name":"Flipo: Gravity Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233457,"name":"Crossfire Zombie Survivor","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233458,"name":"Monster Desert","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233459,"name":"Football Challenges","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233460,"name":"Witch Cry: Horror House","genres":[],"avg_score":0.0,"description":"Just like every good tale begins, once upon a time… there was a couple of witches who lived happily with their son in a house in the woods. They hunted using their magical powers and sometimes they faced scary monsters.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233461,"name":"Zombie Avenger","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233462,"name":"Little Tailor 4: Fashion Sewing","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233463,"name":"TabTab Apocalypse","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233464,"name":"Neon Impact","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233465,"name":"Clone Drone","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233466,"name":"Nonograms","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233467,"name":"Airport Fever","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233468,"name":"Fastar: Fantasy Fairy Story","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This game stimulates the senses with a fantasy!\n\nThe ultimate fun! This has been a fantastic fairy fantasy game!\n\nBorn in the classic work of professional composers who are filled with emotional game!\n\nAnd! Healing emotional stimuli games admiring the background that grows more beautiful!\n\nAt the sight of a lovely fairy please Healing\n\nnow! Feel free to gather all the beautiful artifacts distinctive world of pasta!\n\nGather some friends around the world of fairy users join forces Become Your Own Best Fairy!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9dq9.jpg","releaseYear":2016,"developers":[{"id":0,"name":"NextDoors","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233469,"name":"After School: Full Horror Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233470,"name":"Dark Disciples","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233471,"name":"Police Car: Gangster Chase","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233472,"name":"Island Questaway: Jungle Farm","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233473,"name":"My Gym: Fitness Studio Manager","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233474,"name":"Ambulance Away","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233475,"name":"Candy Sugar Drop","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233476,"name":"Kurumi Diary","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Kurumi Diary is a casual simulation game developed by Giant Network. In this game, players can interact with an adorable girl called Kurumi in her everyday life!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co66eg.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233477,"name":"Crab Balls","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233478,"name":"Cafeland: Restaurant Cooking","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233479,"name":"Nemuri Uri no","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233480,"name":"Drawing Rush","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233481,"name":"Tornado","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233482,"name":"Hidden Tales","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233483,"name":"Tank It","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233484,"name":"Nations of Darkness","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233485,"name":"Boss Hunter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233486,"name":"Toten","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233487,"name":"JoJo the Sheep","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233488,"name":"Assemble the Car","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233489,"name":"Crime Kings","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233490,"name":"Sleeping Flowers: Thread Curse","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233491,"name":"Critical Ops: Reloaded","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233492,"name":"Five Stars","genres":[{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233493,"name":"Seemly Girl Escape","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233494,"name":"Cooking Voyage: Cook & Travel","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233495,"name":"8 Bit Fighters","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"This game combines legacy game elements such as side scrolling and 2D fighting games. Imagine you can perform all the 2D fighting game's stylish moves & combos on a classic side scrolling game. So download now and be the next 8-Bit fighters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6rbm.jpg","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233496,"name":"Drift Clicker","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233497,"name":"Tales AFar","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233498,"name":"Dig Dungeon: Roguelike","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233500,"name":"Storm of Darkness","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233501,"name":"Fairy Sphere","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233502,"name":"Samurai Daisuke","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233503,"name":"Temple Run: Treasure Hunters","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233504,"name":"Kraken Invasion: RPG Idle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233505,"name":"College Brawl 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233506,"name":"Real Cricket Go","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233507,"name":"Balls 'n Ropes","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233508,"name":"Healthy Hospital","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233509,"name":"Adam and Eve: Crossy River","genres":[],"avg_score":0.0,"description":"Help Adam & Eve cross the river! Make sure they both don't drown or get bitten by giant crabs and other dangerous animals while making it safely to the other side!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8dnq.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233510,"name":"Monster Fishing: Fishing Life RPG","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ifa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233511,"name":"Hero Rescue 3","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233512,"name":"Think! Think! Monsters","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Think! Think! Monsters is a battle-puzzle game made for players aged 10+, made by the creators of Think!Think!, an award-winning educational app by Hanamaru Lab, Ltd. The game is designed to train players’ brains, and to show them how to enjoy using their own critical thinking skills to solve a problem.\nIn the battle system, players are securely matched up in teams with other players. If there are no other players to connect to, players will battle along side AI units.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233513,"name":"Weeny Adventure","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Weeny adventure is a tiny challenging platformer game in pixel art style like an old-school game that brings back childhood memories.\n\nYour mission is to run and jump and to grab all the gems before time runs out to find the hidden map to win the level. Your adventure journey is not easy, because you will encounter deadly traps and dangerous monsters.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[{"id":0,"name":"ANATA","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":233514,"name":"Speed Intense Island","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"If you love cars, tuning and playing car or motorcycle racing games then this game is for you!\nIt's the only car and motorcycle racing video game on Reunion Island.\nReunion is a beautiful island located in the Indian Ocean at the east of Madagascar.\nThe tracks you will drive on in this game take place on the main roads of the island.\nDiscover the beautiful landscapes that actually exist while racing.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233515,"name":"2048 Numbers Mania","genres":[],"avg_score":0.0,"description":"2048 Numbers Mania will test your mathematical skills and ability to problem solve, despite its simple design.\nYour ultimate impossible goal is to continually think about how to add pairs in order to clear more space on the board. Sounds simple? It's not!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233516,"name":"Feed the Cat","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Feed the cat - is a colorful puzzle game with simple controls. The goal of each level - to feed the sweets of all kittens.\nSweet gesture can move your finger across the screen, snacks will move through the cells vertically and horizontally in all directions.\nWhen the sweetness gets into a cat, he eats it and goes to sleep, becoming an obstacle.\nAvoid black holes - they suck sweets forever, and some cat will remain without food and will be sad as grumpy cat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233517,"name":"Swapologic","genres":[],"avg_score":0.0,"description":"Swapologic is a challenge you will enjoy. Your mission is to solve the logic puzzles in each row by swapping tiles. As you complete each puzzle, the row will be eliminated and you will score.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233518,"name":"Merge 5: 10x10 Color","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Merge 5 is a new Block Match puzzle game.\nTrain your brain and develop your logic with this simple game that lets you combine puzzle blocks in 10x10 grid, build and destroy structures by creating new color shapes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233519,"name":"Butterfly Sky","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Use your jumping skills and time your landings to collect butterflies in this massively addicting endless-jumper that will have you saying, “just one more round!” It’s up to Brian to feed the picky whale who doesn’t eat fish. Collect and upgrade 4 handy power-ups while jumping on clouds in the sky. Upgrade your clothing, your house, and even your power-ups using your hard-earned butterflies. And don’t forget to level up your character for bigger bonuses and score multipliers!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233520,"name":"Bouncy! Trampoline","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bouncy is a rabbit who loves to jump on his trampoline. Touch or slide to make Bouncy jump and do tricks!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233521,"name":"Ocean Drift","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Humans have surpassed their limits and have evolved to this point mainly because their skills have been tested and improved. While numerous games try to do something similar, none seems to do it as well as Ocean Drift, a new and exciting arcade game with a simple premise that will keep you coming back for more.\nDrag your thumb on the screen and watch the boat drift through the sea!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233522,"name":"Don't Be Greedy","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"This is a game about not being greedy.\nBasically, it is very easy. So it is hard not to be greed or hasty when you play it.\nIf you are not being greedy, you will get a high score.\nTip: When Bunny is on a blue pad, the progress is saved. So that you can continue from the saved point when you re-launch the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233523,"name":"Box Heap","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Box Heap is an addictive mobile game with a simple gameplay and easy to learn and master.\nDrag the block to match 2 or 5 blocks of the same color. These blocks will change to a new block.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233524,"name":"Sheep Launcher 2","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The much anticipated sequel to the original hugely popular Sheep Launcher is now available and running beautifully on the new iPhone5 in full Retina Display!\nExplore an infinite universe with strange new worlds. Battle the massive Martian Overlord and his minion to earn the rights to space travel. Check out the new Style Shop and show off your cool new threads. Use home grown and advanced Martian tech to power up and go farther than ever before!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233525,"name":"SuperPro Snowboarding","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Start as an amateur and try and make it as a pro! Win contests, earn sponsorships, do photo shoots to build notoriety, and, if you're good enough, you'll get invited to the SuperPro Games!\nOutfit your rider with authentic gear from Neff, Sandbox, Bataleon, Switchback Bindings, Lobster Snowboards, YES Snowboards, NOW Bindings, Airhole Facemasks, Endeavor Snowboards, Skullcandy and Whitegold Snowboards.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233526,"name":"Amazing Wire","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Creeping... slinking... gliding... I am a weird wire with a weird hobby of sneaking through tiny holes!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233527,"name":"EcoDriver","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"With EcoDriver it’s not the fastest driver who wins, but the most clever!\nTest your driving with EcoDriver in an endless, randomly generated environment! This exciting game shows you the advantages of driving safely, economically and in an environmentally friendly way.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233528,"name":"Rocket Road","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Dodge your way through traffic with blasting speed! Put to the test your dexterity as reflex is everything to avoid crashing. Travel and discover all the different roads. How far will you get?\nYou can now play Rocket Road on Bet4Fun against your Friends! Click on the Bet4Fun button in the Main Menu and challenge your friends and players from all over the world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233529,"name":"Jalebi: A Desi Adda","genres":[],"avg_score":0.0,"description":"Let’s play all your favorite games – Word Search , Ludo , Snakes and Ladders , Quiz , Word Hunt and 4 Letters games in one single pack. India’s first-ever game center, Jalebi – A Word Game now becomes Jalebi – A Desi Adda with 6 games in 1 pack. Now play word search , Quiz , Word Hunt and 4 letters Word puzzle games in your own language (English, Hindi, Gujarati, Marathi, Bangla / Bengali, Odia, Malayalam, Kannada, Tamil and Telugu) and also you can play Ludo , Snake & Ladder with localized UI.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233530,"name":"Cat 2048 Story","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Cat 2048 Story is an addictive digital game, puzzle game.\nJoin the cats and get to the tile, they are the 2048's multiple, they are growing step by step. Swipe to move all tiles. When two tiles with the same cat face touch, they merge into a upgrade one. You can choose different type to enjoy. Adventure or time model for you explore.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233531,"name":"Eras of Alchemy","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Help! Earth has been mostly destroyed by an asteroid.\nMy name is H.E.R.A. Will you help me resurrect all of Earth's creatures?\nHERA, the Holographic Earth Revival Alchemist, awakens one day to find Earth destroyed with little life remaining. The planet depends on you. Using the combined powers of science and HERA's alchemy pods, can YOU help repopulate Earth? Discover the combinations to create creatures and advance through eras of time!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233532,"name":"Mutant Roadkill","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Race through an apocalyptic wasteland overrun with mutants and other hazards! Blast your way through city ruins as you try to escape a world overrun with danger. Drive as far as you can and compete against the world on the online leaderboards! Can you make it out alive?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co98sj.jpg","releaseYear":2012,"developers":[{"id":0,"name":"glu","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233533,"name":"Monkeynauts: Merge Monkeys!","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Since the dawn of time, monkeys have had only one thing on their minds. BANANAS!?! Well... yes. But who doesn't love bananas???\nBut also... OUTER SPACE!!!\nYes it's true! Historians agree that MONKEYS, not humans, single-handedly pioneered the global space program. And now these adorable \"Monkeynauts\" are ready to blast off to NEW worlds to meet their extra-terrestrial, banana-eating brethren.\nBegin your epic journey on Earth and wield the power of evolution! Merge matching monkeys to unlock new, unbelievably CUTE & quirky evolutions. Accelerate your orbital dreams and get closer and closer to powering your rocket ship!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233534,"name":"No Play No Die","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"An addicting game that tests your reflexes. More challenging, more anomalous and more addicting.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233535,"name":"Narcos: Cartel Wars Unlimited","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Build your empire. Gain power. Destroy your enemies. Lead your own cartel in this strategy game based on the hit series.\nEnter the world of Narcos: Step into the dangerous and thrilling role of cartel kingpin in the official strategy game based on the hit Netflix series. Decide between ruling with an iron fist and gaining respect through loyalty. Sometimes bad people do good things… In the end, you must decide will it be “Plata o Plomo”?\nLearn the ropes of running an operation from drug lord El Patron himself and manage your “relationship” with the authorities through DEA agents Murphy and Peña.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co828k.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Netflix","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":233536,"name":"Soccer Slam!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tap the players to keep the ball in the air.\nTry to get all three medals!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233537,"name":"Flat Fat Cat Bounce","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bruno is our male cat, he wants to bring more joy and fun into his life by bouncing other flat fat cats together. Help him on his journey by crashing him, just like you would do on an air hockey or billiard table, into other fat cats.\nYou just need to do a swipe and see Bruno bouncing over the floor. This is not so easy however: Every room offers a diversity of obstacles: Simple furniture, chihuahua dogs, fans or color buckets which creating so much fun.\nExplore Bruno's crazy adventure and experience hundreds of different levels. Master the challenges awaiting you on the hockey table!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233538,"name":"Happy Pet Balance: Which is the heaviest?","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Which is heavier? A pot of plants or Professor Albert? A holiday gift box or 3 fishes? Let's find out! All is not as it seems!\nFigure out each object's mass using the weighing scales and select the heaviest item! As more stages are cleared, more weighing scales and objects will be added! Happy Pet Balance is a fun brain training game that keeps you on your toes. Time is ticking. Think fast, act fast!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233539,"name":"Clock Smith","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"ClockSmith helps you train your memorization skills with beautiful mechanical clock. Get better at memorizing long numbers and symbols. After using ClockSmith, next time you will have to quickly remember something, it will be easier.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233540,"name":"Super Ball Juggling","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"How many times you can juggle these two balls?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7mk0.jpg","releaseYear":2013,"developers":[{"id":0,"name":".GEARS Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":233541,"name":"Vwls: A Game About Vowels!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Vwls is a game all about Vowels. Did you get it?\nWord finding has never been trickier and fun when all you have are scrambled consonants aided by a clue. Find the vowels, find the word.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233542,"name":"Tezuka World: Astro Crunch","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enter the world of the Father of Manga: Osamu Tezuka! Here, Tezuka classics such as Astro Boy, Black Jack, Princess Knight, Triton and more have come together to star in a grand adventure full of puzzles and nostalgia!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233543,"name":"Magic Colors 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Magic Colors2, Challenge your thinking!\nMagic Colors is a creative geometric jigsaw puzzle game that requires you to successfully put together the colorful triangles at their places within the hexagons. An image pattern of the final colored hexagons is given for all levels and try your best to match them in as LITTLE moves as possible!\nIn Magic Colors2, the graphics of the game are improved greatly. More patterns and three hexagons are introduced; it’s a challenge for your thinking!\nIt’s free for all levels! Get ready to train your brain!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233544,"name":"International Boxing Champions","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Unrelentingly fast paced, Boxing action. Beautifully rendered and animated, high resolution and high definition graphics.\nCompete against boxers from all over the world each with their own distinctive style of fighting. Unload on your opponent with jabs, straight punches, hooks and body shots before finishing them off with super combos.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233545,"name":"Space Station: Frontier","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A deep space mining operation should be a peaceful job, not when a mysterious alien race is violently contesting the territory!\nHarvest precious energy, fortify your station, build up your firepower to defend humanity's domain on this new frontier!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233546,"name":"Dungeon & Dice","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61yd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233547,"name":"Sibijicheon M","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233548,"name":"Sonyeojeonjaeng: Hwansangui Cheonhatongil-jeon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233549,"name":"Warcraft 2000: Nuclear Epidemic","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"In 1998 the GSC Game World studio tried to introduce itself to the Western video gaming market by making its first real-time strategy game. For that, the developers decided to make their own sequel to Warcraft II, using their own engine that would be used later for the Cossack games.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61ye.jpg","releaseYear":1998,"developers":[{"id":0,"name":"GSC Game World","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233550,"name":"Squitter's Spider Quest","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Every level is now played with Squitter!\n\nLevels have had their objects rearranged to make sure Squitter can get through them safely.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co627t.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Saetta06","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":233551,"name":"Gun Fever","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A game based on the popular cartoon series named Gun Fever.\n\nThe Wild West is covered by a terrible epidemic. Indians, cowboys and settlers are suffering from it. This disease is called \"Revolver Fever.\" Shoot first, or lie in a coffin!\n\nLots of adventures await you in the role of the character of the game. He came from the cartoon and looks too cheerful for the Wild West. Naturally, bandits and other moral monsters, like the evil sheriffs, do not like it. But you have a true Colt, while your Colt has bullets!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61zd.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Devalley Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":233553,"name":"Astro Smash 'n' Blast!","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The sky is falling! The sky is falling!\n\nYour base of operations is the last line of defense against an imminent disaster. Big rocks and lil rocks are pounding the earth. Making matters worse, extra terrestrials or some rogue government are sending over spinner missiles and pulsar bombs designed to end your day and make sure you and yours can never phone home again.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co627w.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ROMhacking.net","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Entertainment System"}]},{"id":233554,"name":"Pixel Rooms","genres":[],"avg_score":0.0,"description":"A new evolution of escape-the-room games. Clear each room and escort Mr. Pixel to victory. Plus a speedrun mode with global rankings.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61z8.jpg","releaseYear":2013,"developers":[{"id":0,"name":"URARA-WORKS","games":null},{"id":0,"name":"Skipmore","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233555,"name":"Crazy Freekick","genres":[],"avg_score":0.0,"description":"There is a very strange defender in front of the goal. Ninja, sumo, animal, trap, and quizzes. Let's goal using a technique and brain!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61za.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Hap inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233556,"name":"Star Fox EX: Exploration Showcase","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"This romhack boasts dozens of amazing additions and features, including, but not limited to:\n\nA brand new map with 17 new levels, new bosses, music, backgrounds, enemies and more!\nA 3+ page pre-game menu to customize your experience!\nUse the SNES Mouse, Super Scope, NTT Data Pad or Multi-Tap for a new way to play!\nPlay with 2/3/4/5 people, AI controlled teammates, or ships all controlled by player 1!\nWireframe mode, grid lines, palette changes and more!\nCustomize your player ship and crosshair style with new crosshair functionality!\nA full model test viewer, BGM/SFX test menu and Super Scope Calibration screen!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8q0g.jpg","releaseYear":2022,"developers":[{"id":0,"name":"kandowontu","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":233557,"name":"Bantumi","genres":[],"avg_score":0.0,"description":"Kalah for the Nokia 3310","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6203.jpg","releaseYear":2000,"developers":[{"id":0,"name":"Nokia","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":233558,"name":"Wipe Factor","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Wipe Factor is a multiplayer party game where you and other contestants compete as a team to overcome various physical obstacles and parkour chaos until one team wins!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61zh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233559,"name":"GeneRally 2","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"GeneRally 2 is a top-down arcade racing game with a built-in track editor. Challenge the track records in time-trial; compete on the sofa with friends; or let your creativity flow by creating your very own racing tracks to share with the world!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co65tl.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Curious Chicken Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233560,"name":"Chronicon: The Mechanist","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Play as the Mechanist, laying waste to your foes with high tech weaponry and machinery! Equipped with a medium range Gun, an Axe for close encounters (or throwing!), and a Jetpack for mobility, the Mechanist is an intense and powerful class.","imageUrl":"Sin imagen","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":233561,"name":"Underlien: Safety Zone","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61zj.jpg","releaseYear":1997,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"DOS"}]},{"id":233562,"name":"Project: Mirror","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Project: Mirror is a world full of magic, their souls of beautiful girls have broken into several pieces during a violent and powerful storm. You are the only one who can help the beauties revive their souls!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621b.jpg","releaseYear":2023,"developers":[{"id":0,"name":"430Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233563,"name":"Flat Affect","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A young girl wishes she was a hotel room","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co61zn.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Fewprime","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233564,"name":"Castlevania Chronicles II: Simon's Quest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A fanmade remake of Castlevania 2: Simon's Quest is offering a whole new way to play the most infamous entry in Konami's classic vampire-hunting series.\n\nBack in 1995, Konami released Castlevania Chronicles on PS1, which remade and remixed the original Castlevania for then-modern standards. Now, in 2023, the fan studio WarMachine has released Castlevania Chronicles 2: Simon's Quest, which takes the same approach for the divisive NES sequel.\n\nThis remake takes the bones of Simon's Quest to craft a whole new game. You still explore an open-ended overworld, get hints from NPCs, and explore dungeon-style mansions to acquire key items. But the world has been remixed, the mansions have been completely revamped, and the old currency system has been completely revamped.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co75a7.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233565,"name":"Willy's Horrorland","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In 2021, Eric Moore moves to Midtown to start his life over from scratch in a new city. Looking for a new job, he finds an establishment called \"Willy's Restaurant\" that is hiring staff to guard the place also doing janitor work after his night watch.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6npd.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Swashbucklers","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233566,"name":"A Blast from the Past","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A Blast from the Past is a stunning, classic arcade shooter. Includes gameplay modes for the casual gamer through to \"Tournament Mode\" for Hi-Score hunters! With 4K/360Hz+ support, experience smooth as silk gameplay in this dazzling arcade blaster with something for every arcade-going fan!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6200.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Intellivision Amico"}]},{"id":233568,"name":"Escape Covid Camp","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sent to camp against your will, find a way to escape to freedom. Craft goods to trade with other inhabitants for objects to use in your planned escape. Can you strategize and execute an escape plan through the perimeter of patrolling guards?\n\nContained within a world of steel, this is not the life you chose. Explore your new home that saps the souls of all who it contains. Fabricate a plan to escape this world force upon you. Freedom is your mission.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7gax.jpg","releaseYear":2021,"developers":[{"id":0,"name":"RedZyrro","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233571,"name":"Hitman World of Assassination","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Become Agent 47 in the ultimate spy-thriller adventure across more than 20 locations.\n\nHitman World of Assassination brings together the best of Hitman, Hitman 2 and Hitman 3 including the main campaign, contracts mode, escalations, elusive target arcades and Hitman: Freelancer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co620f.jpg","releaseYear":2023,"developers":[{"id":0,"name":"IO Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation VR"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":233572,"name":"Hitman 3 Access Pass: Hitman 2 Standard","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Purchasing or redeeming this Access Pass will grant access to the locations from 'Hitman 2 - Standard Edition' in Hitman 3. You must own Hitman 3 to access this content.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co97au.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":233574,"name":"Hitman 3 Access Pass: Hitman 1 GOTY Edition","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Hitman 3 Access Pass system allows you to access Hitman 1 and Hitman 2 locations in Hitman 3. Purchasing or redeeming this Access Pass will grant access to the locations from 'Hitman 1 - GOTY Edition' in Hitman 3. You must own Hitman 3 to access this content.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co620k.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233575,"name":"Sanctuary Saga","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Protect your caravan and face the brutal Untamed Wilds in roguelite turn-based RPG Sanctuary Saga. Engage in row-based combat across multiple varied biomes and keep your group together using a dynamic relationship system.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co68q3.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Vicarious Publishing","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233576,"name":"Strayed Lights","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"An atmospheric action adventure combining a wordless experience with cinematic fights based around colors. Restore your light that was torn by shadows and face endearing creatures deformed by their emotions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67ty.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Embers","games":null},{"id":0,"name":"Pingle Game Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":233577,"name":"Eon of the Green","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In this text based RPG you play as an agent exploring Earth's far future. Receive weird visuals from lifeforms on the brink of extinction. Can you decipher their meaning? Eon of the Green is a game about the psychological stresses of mental time travel.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62vh.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233578,"name":"Luckily, My Arm is a Shotgun","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are lost on a cursed island full of monsters... Luckily, your arm is a shotgun! Explore a mini open world and blast your way through waves of demons in this short adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co681t.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Merlino Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233579,"name":"Aeterna: Rubra Plena","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Aeterna: Rubra Plena is a visual novel otome game about happy romance, and dealing with depression, anxiety, and trauma. You play a beautiful young noblewoman dealing with her current and past experiences while finding love.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co620v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":233580,"name":"Puzzle Bobble 2X/Bust-A-Move 2: Arcade Edition & Puzzle Bobble 3/Bust-A-Move 3: S-Tribute","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enjoy new features in Puzzle Bobble 2X and Puzzle Bobble 3, games where you shoot bubbles that pop when 3 or more of the same color stick together.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co626j.jpg","releaseYear":2023,"developers":[{"id":0,"name":"City Connection","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"}]},{"id":233582,"name":"Forgotten Seas","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Craft a 'Ship in a Bottle' and set sail! You are lost in a Bermuda Triangle void. Land is scarce, and the ocean is treacherous. Dread Pirates rule the seas. Experience a survival adventure filled with sailing, plundering, base-building, crafting, treasure hunting, trading, and Pirate Ship combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7d56.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Pangea Game Studios","games":null},{"id":0,"name":"indie.io","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233583,"name":"Rogue Planet 1","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Rogue Planet is a short action horror FPS game based on the Mayan Phenomenon of 2012. Made over the course of 3 years as my first game using GameGuru. A personal passion project.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7re6.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233584,"name":"WikiParty.org","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A game that will take you on a journey through the world of Wikipedia!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233585,"name":"Hi-Fi Rush","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"As wannabe rockstar Chai, you’ll fight back against a sinister robotics enhancement conglomerate using rhythm-amplified combat where everything – from the motion in the environment to the blows of combat – is synced to the music.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6219.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Tango Gameworks","games":null},{"id":0,"name":"Bethesda Softworks","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"}]},{"id":233586,"name":"Pikmin 2 Multiplayer","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Pikmin 2 campaign but you can play with up to 3 friends! Also featuring a huge cast of playable characters, and other features.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6213.jpg","releaseYear":2020,"developers":[{"id":0,"name":"PikHacker","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo GameCube"}]},{"id":233587,"name":"The Elder Scrolls Online: Necrom","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Traverse the Telvanni Peninsula in Morrowind and preserve secrets ascribed to the unfathomable realms of Apocrypha. Unlock the runic power of a brand-new class - the Arcanist - and fight to uphold reality itself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621a.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Bethesda Softworks","games":null},{"id":0,"name":"ZeniMax Online Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":233588,"name":"Fallen London: A Devil's Due","genres":[],"avg_score":0.0,"description":"This is a DLC for the game Fallen London. It is part of the Exceptional Stories, a monthly release of new stories that are available for subscribers (Exceptional Friends) for free, and available for purchase afterwards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621d.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Failbetter Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233589,"name":"Fallen London: Salon Scandal!","genres":[],"avg_score":0.0,"description":"This is a DLC for the game Fallen London. It is part of the Exceptional Stories, a monthly release of new stories that are available for subscribers (Exceptional Friends) for free, and available for purchase afterwards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621e.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Failbetter Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233590,"name":"De-Ja II","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Like its predecessor, De-Ja II is a Japanese-style adventure. The interface has been enhanced compared to the first game. Most of the commands are still done via the extensive verb menus and object sub-menus; once again, it is usually necessary to use those commands several times in order to gain new information and thus advance the story. However, in certain places, icon-based interface becomes available, with point-and-click interaction. The icons include traditional talking, touching, as well as less common commands such as hitting, and even an icon depicting a condom, for... err... scientific activities that are closer to anatomy than archeology.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621g.jpg","releaseYear":1992,"developers":[{"id":0,"name":"ELF Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC-9800 Series"},{"id":0,"name":"FM Towns"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Sharp X68000"}]},{"id":233591,"name":"Fallen London: The Mushroom's Dream","genres":[],"avg_score":0.0,"description":"This is a DLC for the game Fallen London. It is a Festive Story, a yearly end of the year release that is available for purchase.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621i.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Failbetter Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233592,"name":"Fallen London: Stolen Stanzas","genres":[],"avg_score":0.0,"description":"This is a DLC for the game Fallen London. It is part of the Exceptional Stories, a monthly release of new stories that are available for subscribers (Exceptional Friends) for free, and available for purchase afterwards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621j.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Failbetter Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":233593,"name":"Jan Jaka Jan","genres":[{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Jan Jaka Jan is a mahjong game in its core, the majority of the gameplay dedicated to mahjong matches (two- as well as four-people) against a variety of opponents. The player can navigate the protagonist around the top-down town and enter various locations, which are viewed from first-person perspective.\n\nThe player is also able to buy items to increase his parameters during mahjong matches and encounters of sexual nature.\n\nCut scenes occur before and after mahjong games, and many matches and other events are dictated by the story. Defeating a female mahjong opponent usually leads to cut scenes that depict nudity and sexual situations.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621s.jpg","releaseYear":1992,"developers":[{"id":0,"name":"ELF Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC-9800 Series"},{"id":0,"name":"Sharp X68000"},{"id":0,"name":"FM Towns"}]},{"id":233594,"name":"Wendy's Quest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Venture to find your friends and complete Wendy's Quest.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[{"id":0,"name":"Nescuaiko","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233595,"name":"Hop Swap","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Hop Swap is a 2D platformer where you have to go through a world full of obstacles and traps. The problem? With just one touch you change worlds: the top and the bottom.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621r.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Nitrome","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":233596,"name":"Mullet Hell","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Blast your way through hair curling enemies to prove you are worthy of the mullet! Mullet Hell is a casual rogue-like, reverse bullet hell where you must fend off foes who seek to remove your luscious locks from your head.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co621x.jpg","releaseYear":2023,"developers":[{"id":0,"name":"1Up Indie","games":null},{"id":0,"name":"Leo Dawn","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233597,"name":"Growling In My Demise","genres":[],"avg_score":0.0,"description":"Mekra D. needs to get away.\nThis is a very short, nice little pocket game.","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":233598,"name":"Castlevania: Specter of Sorrow","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Specter Knight is now in Dawn of Sorrow! Start a game in Specter Mode to slice and dice your way through the castle using Specter Knight’s diagonal slash while engaging in mini-platforming challenges! Many rooms are tweaked for Specter Knight’s movement and there’s little secrets all around the place to allow for 100% map completion.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8rg9.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Muddy","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":233599,"name":"Koopa CD","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Koopa is sent to the past by the Toads in the future as they plan to corrupt everything in that time.\n\nThis was a submission for the SMB Jam 22, and it is a small but complete overhaul of the game. This entry scored 3rd place out of the 11 contestants.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62b1.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Shenmue Master","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Entertainment System"}]},{"id":233600,"name":"Pokémon PureBlue","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is a purist's enhancement of Pokémon Blue. The goal is to enhance the original games for excellent replayability without bringing in mechanics, moves, sprites, visuals, type matchups, or Pokémon that were introduced in later games. The 2.0 version is based on the disassembly and has hundreds of new optional features / fixes!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co62wh.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Vortiene","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]}]